["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>The large roaring engines of the surrounding planes vibrated the Jetway beneath my feet. I wasn't the biggest fan of flying anyway, and the airlines didn't make it any easier. They funnel you down a narrow tunnel, through a narrow opening, down a narrow aisle, and then make you sit in a narrow seat where you have an elbow face-off with a stranger for a narrow armrest. I'm a fairly petite person and even I feel like a tightly wrapped sushi roll. My rolling suitcase that was stuffed with everything I would need for two weeks in Woodfalls bounced off the heels of my feet every time the woman in front of me stopped to pacify her screaming toddler. Yet another part of flying that had me regretting I didn't have a stiff drink at the airport Chili's before boarding. Don't get me wrong, I liked kids. Heck, I plan to have my own one day when I finally find Mr. Right. I say \"one day\" because so far, I haven't had the best luck in the dating arena, and now I was returning to Woodfalls for the holidays where the pickings were pretty slim. How I had allowed my mom and my cousin Tressa to talk me into returning home for Christmas was beyond me. I had sworn after the guilt-fest that ensued last year that I would take a year off from holidays in Woodfalls. Of course, my mom had pried her way through my defenses like she always did. She had a way of making it nearly impossible to say no. Next year, I would stick to my guns. Yeah, I'm as sure of that as I am that I'll win the lottery. It's not like I didn't love Woodfalls, or even my family for that matter. I'm just tired of returning as a single gal every year. Since I was a little girl, I've pictured myself marrying the perfect guy and raising our three kids—one girl and two boys—in Woodfalls. Growing up, my parents' marriage had been a measuring stick for me, and I knew that was the kind of relationship I wanted. I always assumed when I returned home from college it would be to settle down and start a family. At the rate I was going, I'd be returning to Woodfalls as a wrinkly old cat lady.</p><p>As I continued to inch my way down the aisle of the plane, waiting for slow-moving passengers to stuff their oversized bags into the overhead compartments, I sighed with resigned acceptance that eventually I would reach my seat at the back of the plane. That's what I got for waiting until the last minute to book my flight. I could have driven, but that would only give my mom and aunt an excuse to try talking me into staying in Woodfalls longer. That was one of the downfalls of being a food blogger. My job could be done from anywhere, and my mom reminded me of that every chance she got.</p><p>I finally spotted my row at the back of the plane. Go figure. The harried mom and screaming toddler ended up being in the row directly in front of mine. That seemed to be my relationship with karma. At least it was only an hour and a half flight. I guess I could survive for that long.</p> <p>Lifting my suitcase, I staggered slightly under its weight. Why couldn't I learn to pack lighter? I silently chastised myself.</p><p>\"Here, let me,\" a warm masculine voice said as he reached up over me to stow my suitcase effortlessly into the overhead compartment.</p><p>Hmmm, strong is good. I thought, taking in the exposed forearms that were bracketing me on both sides. Maybe flying home wasn't the worse idea after all. Now, would he be as cute as he sounded?</p><p>\"Why, thank you,\" I drawled, twisting around so I could introduce myself to my rescuer. My throat closed in on me the moment our eyes met, making the end of my statement come out as more of a gasp. Cute wasn't the issue. In fact, he was downright handsome. The problem was the familiarity of the face staring back at me. Of all the craptastic luck.</p><p>\"Hello, Jams,\" he drawled back, observing my dismay with an amused expression.</p> <p>\"It's Jamie,\" I replied through gritted teeth, claiming my seat, but not before I smacked my head on the overhang above me. \"Mother of all suck,\" I yelped, grabbing my head.</p><p>\"Whoa, careful there,\" he chuckled loudly. \"Remember, there are children nearby,\" he laughed as I let out a string of swear words that had the mother in the next row glaring at me between the seats.</p><p>Damn, Grant. He seemed to have a knack for seeing me at my worst. I rubbed my throbbing forehead, wondering how things could get any more awkward. This is why I left Woodfalls in the first place. Finding a man who didn't know everything about me was a must. The small population of Woodfalls offered limited choices for a future husband, and because everyone in town knew each other, it didn't leave much to the imagination. Take Grant Johnson sitting next to me. He'd seen my panties way before it was acceptable. I was eight years old when an unfortunate upside-down hanging attempt on the monkey bars left my skirt over my head, revealing my day-of-the-week panties. For months after that Grant would ask me every day what day of the week it was. Go figure that would happen around him. It was devastating at the time, considering he was my very first crush. Not that I would have ever admitted that to him. The little jerk was relentless and even though he eventually forgot about the panties, he found many other things to tease me about. Like how I may have gotten a little overzealous while plucking my eyebrows when I was twelve. To say they were sparse would have been a pretty generous description. Only a couple of hairs were left over each of my eyes. That provided Grant with ammunition for weeks. I went home that first day in tears, vowing to never talk to him again. I even crossed out his name along with all the little hearts I had drawn in my diary. From that day forward, I pretended he no longer existed. At least my lack of response took the fun out of any future teasing and Grant moved on to messing with Amanda Halt. For years after that, I pretty much stayed off his radar, which I thought I was okay with until Grant and Amanda started dating freshman year. Then it felt like a kick in the gut. Sure, it was years later, but technically, I was the reason he noticed her in the first place. I felt like I should have had dibs or something. Realizing the insanity of my reasoning, I turned my sights to the other guys in town, but none of them sparked my interest like Grant had. It was finally during senior year, after the typical round robin method of teenage dating, I came to the conclusion that the guys in Woodfalls just didn't have what I was looking for. I knew all of them too well. It was like dating a relative or something. So, I left Woodfalls the first opportunity I got and vowed not to return until I had found the perfect guy for me.</p><p>\"How's the head, Jams?\" Grant asked, sliding into the seat next to me.</p><p>\"It's fine,\" I lied. My head was throbbing like a tequila hangover. \"What are you doing on this plane?\" I asked ungraciously as he stretched out his long legs in the cramped space that airlines claimed was ample legroom.</p><p>\"Why, is this your plane?\" he asked, looking amused.</p> <p>\"Ha-ha, smart-ass. I meant, why aren't you in Woodfalls?\"</p><p>\"Wait, this isn't Woodfalls?\" he teased.</p><p>\"Hilarious. Are you ever serious?\"</p><p>\"Not if I can help it. I was out of town for business. Man, how crazy is it that we end up on the same flight?\" he threw back at me.</p><p>\"Yeah, crazy. Of all the planes in all the world,\" I said, tapping my foot nervously as the engines began to roar louder. The plane slowly backed away from our gate. This was by far the worst part of flying for me. Taxiing down the runway followed by the instant acceleration and the ascent into the air always makes my stomach drop to my ankles. I wanted to run down the aisle and flail at the door until they let me out, but instead I dug my nails into my thighs. Once we reached our cruising altitude, I would be fine. Continuing the death grip on my legs, I clamped my eyes closed and silently sang my favorite Mumford &amp; Sons song in my head. It was a ritual that helped me cope with my nerves. Usually, by the time I hit the last line we were well into the sky.</p><p>\"You okay, Jams?\" I faintly heard Grant ask. I was too busy singing in my head to give him any real acknowledgment. I merely nodded without opening my eyes and continued with my internal concert. I could feel my body reacting to the high revving engines. The worst part was upon us. We were putting our fate in the hands of someone we had never met. The plane picked up speed, pushing me back into my seat and I felt the tires lift off the tarmac.</p><p>Grant reached for my hand, but I didn't have the willpower at the moment to jerk away. I just wanted us to get in the air. The song in my head was finishing its last chorus, and at any moment I could breathe again. Then maybe I would remove Grant's hand, which was resting on top of mine.</p><p>The thought had no sooner filtered through my head when a sudden earth-shattering bump made our plane lurch forward. The seatbelt bit into my stomach as my body was thrown forward like I was a rag doll. Some of the overhead compartments flew open, sending bags shooting out. A poor old man in the aisle seat two rows up held his nose with blood dripping from behind his fingers after a small rolling suitcase dropped from the compartment across from him. Grant's hand dug into mine as he gripped the arm of the seat. Panic-filled screams echoed through the plane as we took a sudden nosedive toward the runway we had just left. The toddler in front of me shrieked. I wanted to join him, but I couldn't muster the breath from my lungs. The nose of the plane slammed hard against the tarmac and the deafening sound of metal grinding against asphalt overtook the screaming passengers. All my senses rose to a fever pitch. We were going to die. It was my worst fear. I was stuck in this metal death trap, about to meet death and I was still single. The plane continued to race down the runway as more luggage fell from the overhead compartments. Grant twisted his body to protect me from the falling debris. Eventually, the plane's momentum stalled and we finally shuttered to a stop. Gasps of pain by those who had been hit by flying luggage could be heard throughout the aircraft, but the sighs of relief that we were not going to die was much louder.</p> <p>Chapter 2</p><p>A moment of silence settled over the plane as we ground to a stop. Even the crying baby in front of me seemed to take a breath. The fleeting moment quickly erupted to mayhem as passengers began standing. One of the two flight attendants tried to calm everyone, asking if anyone was seriously hurt or in need of medical attention.</p><p>\"Are you okay?\" Grant asked, cupping my face in his hands so I would have to focus on his words. It was only at that moment that I realized I was shaking from head to toe. \"We're okay,\" he said, removing an article of clothing that didn't belong to me from my lap. He tossed it in the aisle that was now slanting toward the front of the plane.</p><p>I didn't answer as I spotted the wound on his forehead. I watched with morbid fascination as the blood trickled down his face in a slow stream. It began to pool on his shoulder, changing the light blue material of his shirt to more of a plum color. The crimson stain continued to grow as more blood collected there.</p><p>\"Jams, are you okay?\" Grant repeated with concern clouding his voice. I finally pulled my eyes from his shoulder. I was surprised he seemed so concerned about me. He hardly looked in my direction the entire time we were in high school, and now suddenly he was looking at me like I was the most important person in the world to him.</p><p>I wanted to nod my head, but at the moment, I was anything but okay. My head refused to move. I couldn't focus and everything around me looked like a kaleidoscope. I was only seeing fragments of what was really in front of me. I knew I should move. I wanted off this death trap, but I couldn't seem to will my body to make it happen. Things became hazy after that. Grant stopped asking if I was okay, and instead took matters into his own hands. I don't remember much about getting off the plane. One minute, I was buckled in my seat, and the next I was in some holding area in the airport with all the other passengers from the flight. Medical personnel were working and taking stock of various injuries from the accident. For the most part, everyone was okay except for a flight attendant who had suffered a broken leg and a concussion from a food cart that had gotten away.</p><p>\"Miss, do you need to go to the hospital?\" a kind paramedic asked, breaking through the haze in my mind. He shined a light in my eyes to check my pupils. \"Hey, can you hear me? Are you hurt?\"</p><p>It took me a moment to find my voice. \"No, I'm fine,\" I answered. It came out as more of a croak. I cleared my throat and tried again as he wrapped my bicep to check my blood pressure.</p><p>\"Just relax while I check you over a little,\" he said.</p><p>\"I'm okay,\" I repeated, looking up at Grant, who was still hovering over me. His head now sported a bandage where they had treated his wound. I was surprised they weren't taking him in for stitches. \"What about you?\" I asked him, looking at the stark white bandage.</p><p>\"It was more superficial. No stitches necessary,\" he answered, looking relieved that I was no longer comatose. \"Are you sure you don't need to go to the hospital?\" he asked, looking to the paramedic for confirmation. \"Do you think she's in shock?\" Grant asked, like I wasn't there.</p><p>\"Probably a little, but her vitals are okay. Did she pass out?\"</p><p>\"No, but she's been pretty foggy since the crash,\" Grant answered.</p><p>\"Well, her skin is not clammy and her breathing seems normal, but we can bring her in if you're concerned.\"</p><p>\"I'm fine,\" I answered, done with them acting like I was a child.</p><p>The paramedic looked at Grant like my opinion didn't matter. I was tempted to kick him since he was still kneeling in front of me, but I figured that wouldn't help my case. Grant nodded hesitantly, even though he had no right to be making judgment calls on anything to do with my health or my body. I refrained from pointing that out since my brain was finally beginning to sort through what had happened.</p><p>First, I thought I better call my mom to let her know. The last thing I needed was for the accident to make national news and for her to find out before I had a chance to call her. I reached for my purse to grab my phone, only to realize my purse was still stowed under the seat on the plane. \"Damn,\" I said. Why didn't I grab it before we left the plane? My oversized purse had everything important in it—my phone, my wallet and my iPad. The thought of functioning without my stuff even for a moment filled me with a whole new sense of panic.</p><p>I rose to my feet, intending to find it. I swayed slightly from the sudden movement.</p><p>\"Whoa, where you going?\" Grant asked, reaching a hand out to steady me.</p><p>\"My purse. I need it,\" I answered, not caring that I sounded like some junkie looking for her next fix. I wanted my purse, like NOW.</p><p>\"You'll have to wait. They said they'll be moving all the bags and luggage into a holding area as soon as the plane is safe enough,\" Grant said, plopping down on the seat I had just vacated. He stretched out his legs and yawned loudly like he had nothing better to do than wait.</p><p>Now would have been a good time to have my purse since I had the urge to hit him upside the head with it. \"Did they say how long it's going to be?\" I asked, steadying myself with the arm of the chair. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Like a couple of hours, probably. What's your deal? Do you need to hit the john?\" he asked as I did my \"I'm dying without my phone\" dance.</p><p>\"Still not funny. I happen to need my purse more than the average person,\" I stated, looking around for anyone who could help me. The airport staff were scattered about, but seemed to have more important duties than to retrieve lost purses at the moment.</p><p>Grant's indifference swiftly changed to concern as he stood up to help me search. \"I didn't realize you needed it that bad. Is it for health reasons or something? I should have grabbed it before we left the airplane,\" he said, spotting a flight attendant across the room. \"Let me see if we can get you what you need,\" he threw over his shoulder as I watched him stride purposefully for help.</p> <p>Crap, he thought I needed medicine or something from my bag. Embarrassment flooded me. I should have called him back, but my desire to have my phone outweighed my remorsefulness. Besides, it wasn't my fault he had misunderstood me. I never said I had medicine in my purse. All I had said was I needed it more than the average person, which was technically true. My entire business was run by the electronic devices in my bag.</p><p>I was still rooted to the same spot when Grant returned, looking concerned. \"They're going to see about getting you your bag. Are you feeling okay? Maybe you should go to the hospital. I'm sure they will have the medication you need on hand.\"</p><p>I shifted my weight to my other foot, feeling like a complete ass. I couldn't believe how concerned he was. \"It's not medication I need from my bag,\" I admitted.</p><p>\"It's not?\" he asked. His eyebrows came together with confusion.</p><p>\"No, I need my iPad and my phone.\"</p> <p>\"Are you serious? I thought you were diabetic or something,\" he said through gritted teeth.</p><p>\"I need to call my mom, but I also make a living on those devices, so you can wipe that look off your face,\" I said in a huff.</p><p>We both watched the flight attendant talking to an airport official as she pointed in my direction.</p><p>\"Great, what did you tell her?\" I asked under my breath.</p><p>\"What do you think I told them? I thought you needed your bag.\"</p><p>\"Well, I do,\" I said defensively, though the guilt was now gnawing at me.</p> <p>He looked at me incredulously for a minute. \"For your phone.\"</p><p>\"Well, you should have asked before charging off like some knight in shining armor.\"</p><p>He muttered something under his breath that I didn't quite catch, but I ignored him. I felt guilty over the mix-up, but a part of me still just wanted my bag. Time slowly trickled by and after a half an hour passed, it became clear finding my purse wasn't a priority. I watched with envy as Grant extracted his phone from his pocket and proceeded to make a call. I didn't have to attempt to eavesdrop since he didn't seem to care that everyone in the vicinity could hear him. The conversation sounded one-sided as Grant only interrupted occasionally to reassure the person on the other line that he was okay. I felt an odd stirring in the pit of my stomach. I didn't want to admit I was jealous that he obviously had a special someone who cared for him and I had no one. I was proud of the success I had reached with my business, but it didn't change the fact that when I left Woodfalls four years ago, I thought it was only a matter of time until I found Mr. Right. I wanted a relationship like my parents had, one that stood the test of time and was an equal amount of give and take. Now, five years later, I had dated enough guys to realize that Mr. Right was tougher to find than I thought.</p><p>My spirits perked up when I heard him address the person on the other line. He was talking to his mother. Thank goodness. Wait, that was harsh, I thought. It wasn't like his love life was any of my business. It was all but a given in high school that he would marry Amanda when we graduated, which was one of the reasons I had hightailed it out of Woodfalls. Even now, I made a point anytime I talked to my cousin Tressa to never ask about it. Only one person in Woodfalls knew about my past crush on Grant, and I knew that person would take that secret to the grave.</p><p>He gave his mom one more reassurance before hanging up. \"My mom,\" he acknowledged after hanging up his phone, not that I needed the clarification. I nodded, though my eyes were focused on his phone. He grinned mischievously, wagging his phone in front of me. \"Did you want to use my phone?\" he asked. I reached out to snatch it, but he pulled it just out of reach. \"Say please,\" he teased.</p><p>\"Please,\" I said through a fake smile. This was the Grant I remembered, always the tease. I made another grab for the phone.</p><p>\"And you're sorry you deceived me before,\" he added, pulling the phone away again.</p><p>I glared at him before turning away. He could shove his damn phone for all I cared. This was why he had infuriated me so much in school.</p> <p>\"Here, I was kidding,\" he said, holding the phone in front of my face.</p><p>I made no move to grab it. I knew him too well. I knew once I tried, he would move it again. Sucker me couldn't help myself. He moved it at the last second—of course.</p><p>\"Say it,\" he taunted.</p><p>\"God, are you ever going to grow up?\" I fumed, glaring out the large window.</p><p>\"Do you mean am I ever going to become uptight like some people?\" he asked, looking at me pointedly. \"I sure hope not,\" he added, shuddering dramatically. \"Don't you get sick of always taking life so seriously?\"</p><p>\"We're adults, Grant. It's what adults do.\"</p><p>\"It's what adults do,\" he mocked in a deep voice. \"Oh my god. Obviously you're not hearing yourself. You're twenty-three, not forty-three. I bet you were a barrel of laughs in college,\" he laughed.</p><p>\"You got me. I wasn't going to a keg party every night to hone my beer bong skills, so what? Excuse me for deciding it was better to get the education I was paying for,\" I snapped. Of course, I was lying through my teeth, but he didn't need to know that. Better for him to think I was a stick in the mud than to know how many parties I had attended, hoping to meet that one special person. After two years of the same crap, I was sick of the whole party scene and the college experience in general. I transferred to culinary school and focused on my career while I formulated plan B. Everything sort of clicked after that, at least professionally. Not long into my schooling, I came up with the idea to start a blog showcasing some of my favorite recipes. I named the blog Cooking for Love. After all, the old saying claims the way to a man's heart is through his stomach. I post meal prep videos twice a week, but the rest of the time I leave helpful hints on making yummy treats for your loved one. I also encourage followers to ask me questions and email their ideas. Once a month, I pick one of the ideas and prepare it on my site. The author of the winning recipe receives credit for the meal, a bottle of wine and chocolate-covered strawberries. My giveaways became an instant hit and each month the number of entries doubled from the previous month. Two and half years later, I've managed to build my blog into a successful business, but ironically, I haven't been able to cook my way into a man's heart.</p><p>\"Never underestimate the mad skills it takes to become a champion beer-bonger,\" Grant said, standing up. He walked away dialing his phone and my stomach twisted into knots. It didn't take an Einstein to figure out who he was calling. Looking away, I studied the other passengers who sat with nothing more to do than wait like I was. I wondered how the crash would affect their lives. I shuddered to think if we would be sitting here if our plane had reached thirty thousand feet before whatever the malfunction was happened. I'm sure many of the other passengers were thinking the same thing.</p><p>\"Here,\" Grant said, appearing at my side quicker than I expected. He dropped his phone on my lap before heading toward the bathroom. Maybe Amanda didn't answer his call. I dialed my parents' number and my mom answered immediately, like she had been waiting for the phone to ring. She sounded relieved when she heard my voice, but after she was certain I was okay, she chastised me for waiting so long to call her. It took me awhile to get her to pipe down long enough to let me explain what happened. My palms began to sweat as I recalled the fear of death I felt when the plane nosedived.</p><p>\"What are you going to do now?\" her voice interrupted my wayward thoughts.</p><p>\"I'm not sure. Definitely not flying,\" I answered since the mere thought of stepping into another plane had me teetering on the edge of hysteria.</p><p>\"But I want you home for Christmas,\" my mom all but wailed through the phone. \"Especially after what happened today. I need my baby here.\"</p><p>\"I know, Mom. I'm still coming. I think I'll rent a car. I can make the trip in one day if I don't stop.\"</p><p>\"Dear, I'm not crazy about you driving all by yourself.\"</p><p>\"Mom, I drive by myself all the time,\" I reminded her as Grant sank down in the seat next to mine.</p><p>\"I understand that, honey, but driving halfway across the country isn't safe for any woman, especially after what you've been through.\"</p><p>\"It's not halfway across the country,\" I pointed out. I refrained from reminding her that she's the one who wanted me to drive. When she started her worry mode, there was no reasoning with her. I listened with half an ear as she continued to bemoan my predicament. Only when she suggested that she could fly here to make the drive with me, did I intervene. I would have laughed at her suggestion, but I knew she was dead serious. A mixture of amusement and dismay swirled through me. Don't get me wrong. I loved my parents dearly, but the idea of my mommy flying in to rescue me didn't sit right. \"Mom, don't be ridiculous. I don't need you to fly here and hold my hand. The drive isn't that long,\" I explained. I shushed Grant, who was chuckling beside me. He wiggled his fingers in my face to get on my nerves until I elbowed him in the gut. You'd think he would have gotten the hint, but it only egged him on further. I swatted his hand away as I continued to try to convince my mom that I was indeed capable of driving myself to Woodfalls. I was in the middle of reminding her of all the traveling I had done the last few years when Grant plucked the phone from my hand.</p><p>\"Don't you even do it,\" I threatened. I was shocked he had the nerve to snatch the phone from me.</p><p>He held up a hand to quiet my complaints, and for the first time in my life, I contemplated murder. I tried to retrieve the phone before he could speak, but once he stood up, he was too tall. All I managed to do was draw attention to us as I practically crawled up his body in an attempt to get the phone.</p><p>\"Mrs. Lawton, this is Grant Johnson,\" he said into the phone. I could hear my mom's happy squeal from my seat. I rolled my eyes. For whatever reason, all the adults in Woodfalls had always liked Grant. Even when I used to complain about his endless teasing, my mom had always defended him, telling me that was his way of showing he liked me. She was wrong. I was nothing but a source of entertainment for him. \"We were both on the flight,\" he said into the phone. \"I know, small world, right? Me and Jams together,\" he added. I'm sure he didn't mean his words to sound the way they did, but it still didn't stop my pulse from racing slightly. Grant's next words made my blood pressure rise. I had to have heard him wrong because there was no way in hell he could have been serious. Otherwise, I really was going to have to kill him now.</p><p>Chapter 3</p><p>\"Are you insane?\" I hissed as he ended the phone call with my mom.</p><p>\"What?\" he asked, feigning surprise.</p><p>\"There's no way I'm driving eight hundred plus miles with you.\"</p><p>\"Nine-nineteen,\" he corrected, stowing the phone back in his pocket.</p><p>\"What?\" I asked, momentarily distracted as I watched the phone disappear from sight.</p><p>\"It's nine hundred and nineteen miles to be exact. I Googled it,\" he said, patting his pocket.</p><p>\"It doesn't matter if it's nine miles. I'm not driving anywhere with you,\" I stated. There was no way I could spend that much time with him. Eventually, we would move past the superficial talking we had been doing. I didn't want to delve into what he had been up to in my absence from Woodfalls. More specifically, I didn't want to hear about his perfect little life with Amanda. I would have continued my objection, but a team of airport personnel entered the holding area.</p><p>\"Why not?\" he asked as we joined the semicircle of passengers that had formed around the airport employees.</p><p>\"Um, could it be because you made my preteen years hell?\" I said, grasping for any excuse I could come up with. He started to argue, but I shushed him so I could hear what the airport staff had to say. Most of it didn't pertain to me since I had no interest in catching a new flight. All I cared about was getting my luggage and getting out of this airport. The spokesperson for the airline talked in a loud voice that carried through the large room. She first apologized for the trauma we had all suffered. She claimed they were doing everything in their power to get all of us to our destinations, yada yada yada. Once she had covered new flights and how the airline would compensate us with free flight vouchers, she moved to an explanation about the accommodations they had secured for those of us who would not be catching a flight that night. Finally, she got to something I actually cared about, collecting our belongings. They had a shuttle waiting to take us to the hangar where they had placed all our bags.</p><p>Without giving any thought to Grant, I was the first to step in line for the shuttle. I planned on finding my bags and getting the heck out of Dodge. Alone.</p><p>\"Not so fast, Jams,\" Grant said, joining me.</p><p>\"I think the end of the line is back there,\" I said, pointing over my shoulder.</p><p>\"You're not leaving the airport without me.\"</p><p>\"First of all, this isn't the line to leave the airport. Second, you're the only one who thinks we're leaving together,\" I pointed out, tapping my fingers impatiently against my leg as I waited for them to show us to our shuttle.</p><p>\"Not true. I promised your mom I wouldn't let you drive home by yourself,\" he said, holding up a hand when I tried to argue. \"And I never break a promise,\" he continued. He looked serious. It was the first time I could recall seeing him without a trace of teasing.</p><p>\"Look, Grant. I appreciate the offer. Really, I do, but I'm a big girl. I've been on my own long enough now. Driving through a couple of states by myself is no biggie. Trust me. You know how protective my mom has always been.\"</p><p>\"All that being said, it's still not a bad idea for us to drive together. We are going to the same place. Just think, if we ride together, we can share the driving duties and get there even faster,\" he reasoned as an employee led us out to the airport shuttle. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Yeah, but you're forgetting something important,\" I said, climbing onto the large bus.</p><p>\"What is that?\" he asked, sitting down on the bench seat next to me.</p><p>I looked at him incredulously. Was he being obtuse on purpose, or was he really that dense? \"We don't like each other,\" I answered, gripping the metal handrail to steady myself as the shuttle came to an abrupt halt.</p> <p>\"Who said I didn't like you, Jams?\" he asked, reaching a hand down to help me get to my feet. A couple things happened simultaneously at that moment. One, I had never seen him look so sincere, and two, the feeling of my hand being wrapped inside his large and very masculine hand made my stomach twirl. Our eyes met for a brief instant before I pulled my hand away and scrambled out of the seat and down the aisle. In my haste to leave the shuttle, I neglected to notice the ground was covered in a fine layer of snow.</p><p>My feet hit the pavement for only a moment before they were out from under me and I was flat on my back on the tarmac. When I was nine, I fell out of the back of a pickup truck while trying to jump out. My sneaker got caught on the tailgate and long story short, I got a mouth full of dirt. I remember hitting the ground so hard it knocked the breath out of me. The fear of not being able to breathe overlapped the actual pain. At the time, I thought it was the single most embarrassingly painful moment of my life, until now. Falling on a snow-slicked airport tarmac in front of multiple witnesses, including the guy I had once majorly crushed on, was so much worse. Not only because it hurt my ass, which took the brunt of the fall, but my pride took a big punch because falling as an adult is way more embarrassing than when you fall as a child. Plus, the brand-new peacoat I had just bought was getting filthy.</p><p>Once I was able to gather myself, I looked up at the many individuals circled around me, who all looked concerned with the exception of one. Grant looked like he was trying not to laugh. I glared up at him, daring him to say anything. His eyes danced with merriment as he reached down to help me up.</p><p>\"Oh my. Are you okay?\" the driver asked from his perch on the last step of the shuttle.</p><p>\"Fine,\" I wheezed, looking into Grant's smirking eyes.</p> <p>\"Can you believe she used to be a champion ice skater?\" Grant announced loudly, making everyone laugh.</p><p>\"Oh, that's good. Here, let me give you a round of applause,\" I said, jerking my hand from his as he helped me to my feet. I lost my footing again and my legs tried sliding out from under me in different directions. Grant reached out and grabbed my jacket just in time to keep me from going down a second time, much to the amusement of everyone watching.</p><p>\"Hey, I'm not the funny one,\" he chuckled, keeping a firm hand on my elbow. I would have pulled away, but I wanted to be done embarrassing myself. Only after we entered a large hangar and I was on steady non-slick ground did I jerk my arm from his. His laughter followed me as I made my way down the long rows of purses and suitcases the airline had laid out on the floor. I found my purse quickly, but it took longer to find my small rolling suitcase, which somehow had broken open during the accident. Examining it closer, I could see I wouldn't be able to keep it fastened. Plus, some of my belongings were missing. I sighed, searching for any of my clothing and other personal items. Any loose items had been collectively piled up at the end of the row. Next to the pile was a stack of large plastic bags from Walt Disney World. I laughed at the phrase \"The place where dreams come true,\" along with the image of Mickey Mouse printed on the bag like he was mocking me. Picking through the pile of unclaimed belongings until I was satisfied I had found everything I remembered packing, I transferred everything from my broken suitcase and my stuff I found in the pile into one of the plastic Disney bags.</p><p>Grant was waiting by the hangar door, where a security guard double-checked my belongings, making sure I wasn't taking someone else's luggage. I obliged him, but I wasn't in the mood anymore. I had enough of the airport and was ready to leave now that I had my stuff. After watching him paw through the plastic bag for a moment, my aggravation got the best of me and I spoke up. \"Why don't you tell me what you're looking for and I can find it. Or maybe it's still in the plane I was in that crashed,\" I said sarcastically.</p><p>\"Have a nice evening, ma'am,\" he said, looking unfazed.</p><p>\"Yeah,\" I returned as I walked away.</p> <p>\"Everything okay?\" Grant asked, plucking the bag off my arm.</p><p>\"I can carry it,\" I protested as he slid it onto his shoulder.</p><p>\"You have more important things to worry about. Like not slipping,\" he joked as we left the warmth of the hangar. The shuttle bus was waiting to take us back to the terminal. At least the driver had parked closer, and hopefully I wouldn't mortify myself by busting my ass again.</p><p>\"I figured we can try to get a car from Enterprise when we get back to the terminal, and then maybe look into the rooms the airline is providing at the airport hotel,\" Grant said conversationally, like everything was set in stone. I opened my mouth to argue, but reason held me back. He was right. It made sense for us to drive together. We were headed to the same destination.</p><p>\"Fine,\" I grudgingly agreed, sinking back in my seat while we waited for the shuttle to fill up with more passengers. I was mentally exhausted and sick of all the waiting. Today felt endless. I couldn't believe everything that had happened in the span of ten hours. My body was dragging like I had run a marathon. Not to mention my stomach was threatening mutiny. I hadn't eaten anything substantial since I left my apartment at the crack of dawn. Digging through my purse, I located my phone and pulled it out. I refrained from kissing it since Grant was watching me. Instead, I opened my blog to make sure there was nothing pressing I needed to take care of. After I was reassured my blog would survive until morning, I hit the tab for my Facebook fan page. Scrolling through my notifications, I responded to anything that required my immediate attention before doing a longwinded status update about my day's mishaps. I was ready to post when the sound of a throat being cleared pulled my attention from my phone. Glancing up, I saw the shuttle was empty with the exception of the driver and Grant, who were both studying me like I was an insect or something. I didn't even flush at their looks. It was no secret that when I was in the middle of work-related activities, I could become a bit involved. It was a long-standing joke with everyone who knew me.</p><p>\"Plan on sleeping here tonight?\" Grant asked wryly as the driver looked on with annoyance.</p><p>\"Sure, can you fetch me a blanket?\" I answered, grabbing my bag. I kept my phone in my hand. I didn't need it, but holding it gave me comfort.</p><p>Grant rolled his eyes, but didn't seem bothered. The driver, on the other hand, looked pretty disgusted with my phone dependency, but he was an old-timer who probably didn't have a smart phone. I trailed behind Grant as he carried our bags toward the Enterprise counter to rent a car for the following day. I grinned when he requested something with plenty of legroom. At six foot plus, his request totally made sense. Once we had all our paperwork in order for the car, we headed for the airport hotel. I was seriously dragging by the time we approached the desk together.</p> <p>The desk clerk smiled condescendingly before telling us all the rooms had been taken for the evening.</p><p>It took me a moment to register her words since I was dead on my feet. \"But we have vouchers,\" I said, plunking the paper down on the counter like it was a golden ticket to Wonka's chocolate factory.</p><p>\"Those are only good if there are rooms available. We had a hiccup with an airline earlier today, which resulted in delays with every carrier. Really, it's to be expected after that kind of chaos,\" she chirped like she was telling us something we should have already known.</p><p>\"Hiccup? Is that what they're calling it?\" I squawked out. \"I think 'hold on to your asses because you're all going to die' would be a more accurate description.\"</p><p>Grant chuckled next me as the smile slipped from the clerk's face as she gaped at me.</p><p>\"Sorry, I'm just tired,\" I said more to Grant than the woman who was doing a pretty good impersonation of a guppy.</p><p>\"No biggie. We'll grab our rental and get a room at another hotel,\" he reassured me, lifting our bags off the ground.</p><p>\"Oh, every hotel within a ten-mile radius is completely booked,\" the clerk, who I was seriously thinking of strangling, said in the same annoyingly chipper tone.</p><p>My eyes narrowed as I opened my mouth to tell her where she could shove her chipper tone. Grant grabbed me by the hand and dragged me away from the counter before I could strangle her with the keys she wore around her neck. \"She was about to get choked by that freaking scarf around her neck,\" I grumbled as we staggered back to the Enterprise counter.</p><p>\"I thought you were going to put her face through her computer monitor,\" Grant said, chuckling again.</p><p>\"That would have worked too,\" I said, sitting on one of the round couches near the Enterprise counter while Grant collected the keys to our rental. I leaned against the back of the couch, closing my eyes briefly. I must have drifted off because the next thing I knew, Grant was shaking me, looking slightly aggravated.</p><p>\"What's the matter?\" I yawned.</p><p>\"It would seem their car supply is also depleted,\" he said, sounding as exasperated as I had felt when we found out there were no hotel rooms available.</p><p>\"And the hits keep on coming,\" I muttered under my breath.</p><p>Chapter 4</p><p>\"What does that mean?\" I asked, afraid the couch I was sitting on would be my temporary bed for the night. Talk about a colossal sucky day.</p><p>\"It means we have to take what they have available,\" he grumbled, striding out of the terminal. This time it was my turn to laugh. I was relieved I wouldn't be sleeping in the airport, but it was pretty hilarious to see the normally easygoing Grant losing his cool.</p><p>We boarded the rental car company's shuttle and my laughter quickly turned into one yawn after another. The swaying motion of the shuttle bus combined with the snow falling outside lulled me back into my lethargic state. Something about watching snow dropping from the sky had always given me a warm, cozy feeling. It would have been a perfect time to curl up in bed with a good book and hot chocolate.</p><p>The shuttle driver stopped in front of what was literally the only car left on the lot. Teeny tiny would be the best way to describe it. I couldn't help barking out in laughter after finally understanding the source of Grant's aggravation. It wasn't one of those Smart Cars, but it was pretty darn close.</p><p>\"Not funny,\" Grant declared, wheeling his suitcase through the snow toward the car that looked smaller and smaller the closer he got to it. \"I've seen riding lawn mowers with more room than this thing.\"</p><p>I burst out laughing again. He glared at me for a moment before his frown turned to a smile. Even Grant couldn't help laughing at the irony of the situation. A frigid gust of wind blew across the parking lot, sending a shiver down my body. The soft flakes of snow swirled around, pelting my face.</p><p>\"Here, can you warm up the car?\" he asked, handing me the keys while he stowed the luggage in what was supposed to be the trunk.</p><p>Only when I was sitting behind the steering wheel of our micro car did the humor of its size lose its luster. We would be cramped driving five miles in this sardine can. Nine hundred plus miles was going to suck. Even with only two of us in the car, we would be practically on top of each other. This was going to be as close to torture as I had ever come.</p><p>\"I would have driven,\" Grant said, shaking the snow off his head as he opened the passenger door.</p><p>My eyes focused on the stray lock of hair that fell across his forehead. He had great hair for a guy. It was auburn with a lush fullness that would make most girls jealous. I would be embarrassed to admit how often I had dreamed about running my fingers through it.</p><p>I reluctantly forced myself to look away. I could NOT fall for Grant again. He had already unknowingly broken my heart once. I would be wise to remember that. Who cares if we were only thirteen years old? A broken heart was a broken heart. Besides, he aggravated the crap out of me, which meant he wasn't Mr. Right.</p><p>Oblivious to the jumbled thoughts in my head, Grant adjusted his seat, sliding it as far back as it would go before he climbed in. Even still, his knees were practically in his lap.</p><p>\"I feel like I'm on a kiddie ride,\" he complained, adjusting the incline of the seat to try to gain a little more comfort.</p><p>\"Make sure to keep your arms and legs in the vehicle at all times,\" I teased, plugging my phone into the charger so I could use the GPS on my phone without draining the battery. Once I selected \"Home\" from my favorites list, Mona (the name I gave the robotic voice on my phone), started spouting out directions.</p><p>\"I figured I'd drive until we hit the next town since Ms. Personality claimed the hotels around here are all booked,\" I told Grant as I drove away from the airport.</p><p>\"Sounds good,\" he said, shifting in his seat as I pulled onto the main road. I drove for less than a mile when I turned my blinker on.</p><p>\"I hope a drive-thru is okay?\" I asked, turning into the parking lot of a popular fast food chain.</p><p>\"That's fine,\" he said as I pulled behind a heavy-duty truck that dwarfed our small car. The line moved fast and soon we were back on the road. Grant had the juggling act of passing me my food while trying to eat his own, but neither of us wanted to go inside the restaurant. I started to feel more human after I downed my burger and fries. I switched lanes until I was farthest to the left, which I considered my comfort lane. Like the parking lot at Enterprise, the highway was pretty much empty except for an occasional oversized semi-truck.</p><p>\"This is comfy,\" Grant said, stowing our trash in the minuscule backseat. He shifted his legs to a suitable position, which happened to be intimately close to my right leg. I debated moving, but that would have been obvious, and possibly lead to an awkward conversation. Instead, I tried to ignore the voice in my head telling me how good his leg felt against mine.</p><p>Neither of us talked as the city lights faded away and the night swallowed our lone vehicle. I kept my eyes on the road ahead of me, afraid if I looked at Grant it would start a conversation. It's not like I didn't want to talk to him. I just felt our current driving arrangement was intimate enough without initiating a conversation in the cloak of darkness. A part of me wished he would go to sleep so I could relax a little.</p><p>\"Are you okay driving?\" he asked, making me jump. In all my deep thoughts of not wanting a conversation, I wasn't ready when he initiated one.</p><p>\"I'm good for now. I'm hoping we'll find a decent hotel there,\" I said around a yawn as I pointed to a gas station billboard stating the next exit was in twenty-five miles. Despite how tired I was, I felt I could make it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Okay. I'd offer to drive, but I'm not sure I'd be able to fit behind that steering wheel,\" he said sardonically. \"Maybe if there's an Enterprise in town we can look into trading this thing for something bigger in the morning.\"</p><p>\"I'm okay driving,\" I said, yawning again. Once the yawns started, there was no stopping. \"I drive all the time for work,\" I added.</p><p>\"You're some kind of chef, right?\" he asked, draping his arm across the back of my seat. If there was something that would wake me up, that was it.</p> <p>\"Um, yeah, but I run a cooking blog,\" I said, shifting uncomfortably. Grant acted like he didn't notice and continued to talk.</p><p>\"That's cool. What's your blog called?\"</p><p>I mumbled the title under my breath.</p><p>\"Sorry, can you repeat that?\" he asked, sounding amused.</p><p>\"Cooking for Love.\"</p> <p>He chuckled. \"Still hung up on that whole love thing, I see,\" he observed.</p><p>I flushed slightly. I knew my reasons for leaving Woodfalls were common knowledge. I couldn't expect anything less from our small town. \"What's wrong with wanting love?\" I asked defensively as I maneuvered around a semi-truck that seemed to be having a hard time staying in its own lane. As we passed, I could see the driver was texting on his phone. What an idiot.</p><p>\"There's nothing wrong with love. You've just always been a bit obsessive about it.\"</p><p>\"Obsessive?\" I asked in a slightly raised voice that bounced off the tight quarters of the vehicle. \"I don't see anything wrong with wanting to find my soul mate,\" I argued.</p><p>His laughter boomed through the vehicle. \"Did you say soul mate?\" he asked, trying to catch his breath.</p><p>\"What's wrong with that?\" I bristled.</p> <p>\"It's just so cliché, believing there's only one perfect person out there for you. True love is a give-and-take relationship that takes years to perfect,\" he stated.</p><p>\"Well, thank you, Dr. Phil. Are you a love therapist now?\" I snapped. My faith that my perfect match was somewhere out there had been keeping me going for so long. It was the whole reason I traveled so much for my job. I have this fantasy of walking into a romantic restaurant and waiting at the bar for my table. The bartender sets down a glass of red wine and points to a tall, dark and handsome gentleman at the other end of the bar who raises his glass when I look in his direction. He walks over confidently and introduces himself. The connection is instantaneous. We have dinner together and talk all night long until we share the most passionate kiss ever as the sun rises in the horizon and we have our happily ever after. It could happen.</p><p>\"Nope. I read it on the back of a cereal box,\" he quipped. I elbowed him in his ribs, but he deserved it. I hated that I was always the butt of his jokes.</p><p>\"Hey, kidding. I learned it from watching my parents all these years. They love each other deeply, but that's because they're willing to put the work into their relationship. You can't just expect to have some love fairy wave her magic wand and poof, you've met your soul mate,\" he said sarcastically. He removed his arm from the back of my seat and I couldn't help feeling like he was mad at me or something, which was utterly ridiculous. If anyone should be pissed it was me.</p><p>I stewed on his words, not saying anything for the next ten miles. When another billboard appeared declaring we were two miles from our gas needs (their words, not mine), I let out a small sigh of relief. I was ready to get out of the car and put some space between us. I had no idea how I was going to handle the rest of the trip when the first hour had pretty much done me in.</p><p>Grant must have felt the same since he looked relieved when our exit came into view. Merging onto the off-ramp, I followed the signs to the only hotel in the area.</p><p>\"Roach motel, anyone?\" Grant said as I pulled into the parking lot that was in dire need of some repairs, but seemed to be the least of their problems. The office had an illuminated sign, but the first few letters were burned out, so all it said was \"fice.\"</p><p>\"Are we sure it hasn't been condemned?\" I said with dismay. I was by no means a snob, but I did expect a certain degree of cleanliness when I stayed in a hotel. Hopefully, it had fresh sheets and towels and clean floors, and not to knock this place any more, but I would prefer it if the night manager wasn't picking his nose as we walked in the front door.</p> <p>\"You folks like a room?\" he asked, chewing on his thumbnail that had just been in his nose. Double gag.</p><p>\"Are there any other hotels in the area?\" I asked hopefully as Grant snickered.</p><p>\"No, ma'am. We here have the only accommodations in a twenty-mile radius,\" he said proudly, spitting a section of his nail off to the side.</p><p>\"Charming,\" I replied.</p><p>\"Two rooms,\" Grant said, stepping in before I had the chance to say anything more.</p><p>\"Two? I thought you two were together,\" he said, looking at me with a whole new level of interest.</p><p>\"We are,\" Grant glared at him. \"We'd like our rooms to be adjoining,\" he added.</p><p>The clerk shrugged his shoulders after eyeing me up and down one last time before giving us our total. My skin crawled, but I ignored him as I paid for both rooms. Grant tried to intervene, but I reminded him that he had paid for the car. With one last wink from Mr. Nose Picker, I grabbed our two room keys and walked out of the office. Grant stood for a moment with his fist clenched before turning around to follow me out.</p><p>\"Bit of a creep, huh?\" I said as I climbed back into the car to drive us to the end of the building where our rooms were located.</p><p>\"Dickhead is more like it,\" Grant answered.</p><p>As we climbed from the car and grabbed our bags, I was almost thankful it was so dark outside. If I saw the building in the harsh light of day, I'm not sure I could have forced myself to stay.</p><p>Grant waited beside me while I slid the key into the lock and twisted the handle. The strong stench of old mildewed carpet assaulted my senses when I pushed the door open. Reaching a hand along the wall, I found the light switch and turned it on. Swallowing hard, I stepped into the room, which was far worse than I imagined. The carpet was worn with the concrete floor exposed in several areas. What there was of carpet was stained. By what, I didn't even want to think about. The walls that were once white were a dingy yellow from years of neglect and cigarette smoke discoloration. There was a bed and a small dresser with a broken leg that made it wobble when you touched it.</p><p>\"I'm in hell,\" I mumbled, walking farther into the room. I was afraid to touch anything else and didn't know how I was going to manage sleeping here.</p><p>\"Well, that's not true. If it was hell, it wouldn't be this damn cold,\" Grant said, walking over to my thermostat to adjust the heat. A groaning noise moved through the wall, but thankfully a blast of warm air blew through the vent. \"I guess I better go check if mine is any better,\" he added, opening the door that adjoined our rooms. The second door was warped and didn't close completely.</p><p>\"I guess it's a good thing you're the one in the room adjacent to mine,\" I said sarcastically as he pushed the warped door open, which creaked loudly.</p><p>\"On a positive note, you can rest well knowing I can't sneak up on you,\" he said, making the door squeak again as he walked into his room.</p><p>I circled around again to take in the room, unsure of what I wanted to do. I was dead tired, but my day of travel had left me feeling frumpy and dirty. Standing in the middle of my disgusting room wasn't helping matters. Still holding my bag, I stripped off the comforter that looked like it hadn't been washed in a decade. The sheets looked marginally better. After giving them a quick inspection, I figured they would have to do. I placed my bag and purse on the middle of the bed and headed to the bathroom with a pair of socks and my bathroom bag in hand. I paused along the way to close the door that separated our adjoining rooms.</p><p>I showered quickly, in part because I could barely keep my eyes open, but mostly because the hot water worked about as well as everything else at the motel. Drying off, I pulled on my socks, since there was no way I was walking on the floor with bare feet. The towels were small and barely wrapped around my torso. I had to admit, as tired as I felt, the bed suddenly didn't look as bad as it had a few minutes ago. I decided to lie down for a minute to see how the mattress felt. My intention was to get back up and put on some pajamas, but before I knew it, my eyes closed and I was out.</p><p>I was having one of those half in-half out kinds of dreams when a tickling sensation on my leg caused me to stir. I tried to ignore it, not wanting to wake up. It was only when the tickling moved up my leg that my mind sprang to awareness. With speed that would make a track star envious, I leaped from the bed, screaming bloody murder. Swatting at my thigh, I knocked the biggest bug I had ever seen from my body just as Grant charged into my room. He looked like a wild man ready for action with a lamp clutched in his hand. Despite my bug phobia, it didn't escape my notice that Grant was wearing nothing but boxer briefs that left little to the imagination. It was at that moment that I remembered I had neglected to put on pajamas before I fell asleep. My eyes met Grant's as he came to two obvious conclusions at once. One—I wasn't being attacked by some mass murderer, and two—I was standing in the middle of the room stark naked with the exception of my Care Bears socks.</p><p>Chapter 5</p><p>Grant's eyes drifted from my face down to my very naked body. Grabbing the towel at my feet, I hastily wrapped it around my torso, which didn't cover much since the towel was intended for a child.</p><p>\"What the hell are you doing? Don't look!\" I yelled while attempting to cover all the important areas.</p><p>Grant's expression sparkled with a mixture of amusement and desire. My knees suddenly felt weak as a flush tinted my cheeks.</p><p>\"I thought someone was murdering you,\" he laughed, dragging his eyes away from my breasts, which could still be seen through my clenched fists that were trying to hold up the towel.</p><p>\"It was a bug,\" I screeched as the offending insect crawled across the floor. Without any thought of the consequences, I flew across the room into Grant's arms.</p><p>Perhaps it would have been erotic if I wasn't trying to climb him like a monkey.</p><p>\"As nice as it feels to have you...wrapped around me, if you want me to kill your little friend, you're going to have to let go,\" he said in strained voice. Releasing him self-consciously, I realized I had stepped over the line. He was seeing someone. Sure, he had been nice to me all day, and at times even flirty, but that was probably just me trying to fabricate something that wasn't there. It didn't help the situation to think about how good his rock-hard bare chest felt pressed against mine, or how low his boxers fit on his hips.</p><p>\"Sorry,\" I said, untangling my arms from around his neck. I stepped away from him as he picked up one of my boots and held it in the air. \"Wait, don't use my boot,\" I pleaded, but I was too late. The crunching sound made me grimace even though I was glad the bug was gone.</p><p>\"Nice socks,\" he said, wiping the sole of my boot on the carpet.</p><p>\"Thanks,\" I squeaked. He walked to my bathroom and came back a moment later with a wad of toilet paper. I wanted to gag when he scooped up the dead bug carcass and flushed it down the toilet. My heart rate returned to normal now that the threat was gone. Of course, the fact that Grant had not only seen my goods, but that I had also thrown myself into his arms like some damsel in distress was still hanging out there. No pun intended to myself. I pawed through my bag and found my PJ shorts and sleeping shirt before heading to the bathroom. For future reference, I will make sure I get dressed before going to sleep from now on.</p><p>After a pity party that abruptly ended when I saw another bug crawl out from under the sink, I left the bathroom. We were literally in the roach hell motel.</p><p>Grant was still standing in the doorway of our adjoining rooms looking at me like I had been dipping in spiked eggnog.</p><p>\"What? I hate bugs. Okay?\" I said, surveying the room like I expected an army of roaches to appear at any moment to drag me away.</p><p>\"I'm just disappointed you decided to put on some clothes. That'll take half the fun out of coming back in here if you see another one,\" he said, dropping my boot and heading back to his room.</p><p>\"Glad you enjoyed the show,\" I said, playing along, although my adrenaline was rushing through my veins.</p><p>When I was able to clear the image of his six-pack from my mind, I looked around at all the possible places a bug could hide. I debated going to the car to sleep, but the thought of freezing my butt off held me back. This was officially shaping up to be the worst holiday season ever. I should have followed my instincts and opted for a sandy beach instead. It was too late to cry over spilled milk, so I came up with a plan where I could hopefully get a little sleep. I started off by pulling the bed away from the wall. Thankfully it wasn't bolted down like everything else in the room. Once the bed was as far away from the walls as I could get it, I stripped it to make sure there were no more unwanted guests hiding in the sheets. After shaking them out, I replaced the fitted sheet on the bed and wrapped the remaining sheet around my body papoose style so nothing could crawl up my bare legs again. Only after I tucked my head under the sheet did I feel somewhat safe from any more creepy crawlies. I left the light on and fell into an uneasy sleep that involved dreams with naked chests covered in bugs.</p><p>Scratching noises on the ceiling above woke me the next morning as I emerged from the safety of my sheet cocoon. I pulled my head out in time to see two roaches scurrying across the ceiling right toward the bed. Biting back a screech, I jumped off my bed, not thinking about the sheet that was tightly wrapped around my body. Twice in two days I found myself flat on my back with the breath knocked out of my lungs. Hell. If this wasn't Christmas hell, I don't know what was.</p><p>\"I'm not sure I would have picked the floor to sleep on,\" Grant said as his face came into view. \"It looks a little rough down there.\"</p><p>\"Bite me,\" I wheezed, struggling to my feet. One thing was clear; I couldn't have done a better job wrapping myself in the sheet. With it tangled around my legs, I pitched forward, landing directly in Grant's arms.</p><p>\"You've gotten pretty forward with age,\" Grant teased, wrapping his hands around my biceps to steady me. \"I mean, biting you doesn't sound like that bad of an idea, but we should probably build up to that.\"</p><p>\"Very funny,\" I snapped. It was aggravating that I couldn't seem to get my act together when he was around. When I finally managed to untangle the sheet from my legs, I threw it across the room in a fit of anger. It fluttered harmlessly to the floor, taking the oomph out of my action. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Grant threw his head back, laughing loudly. Ignoring him, I stomped off to the bathroom only to return a moment later for my boot. Six smashed bugs later, I was dressed and ready to leave the roach motel behind.</p><p>By the time Grant joined me, I was already in the car with the engine running. He refrained from commenting as I tore out of the parking lot like the hounds of hell were after us. Twenty seconds later, I was muttering every swear word I knew under my breath when flashing lights showed up in my rearview mirror. \"Not a word,\" I told Grant, who was smirking. I glared at him, even though I was more pissed at myself. Go figure, I'd get my first-ever speeding ticket now. This was the cherry on top of the crap sundae these last few days had been. I rested my head on the steering wheel and counted to ten so I wouldn't lose my shit with the approaching highway patrolman.</p><p>Grant kept his mouth zipped as the officer wrote me a ticket for going fifty in a thirty-five mile-per-hour zone. My teeth ground together as he called me \"young lady\" and pointed out that maybe I should leave the driving to my boyfriend. The temptation to drive the vehicle over his condescending ass was strong, but I could only imagine what jail would have in store for me with the luck I'd been having. After fifteen minutes of being reprimanded on safe driving, the sexist, asshole cop finally let us go. I left the odious town behind, clenching the steering wheel in a death grip. To Grant's credit, he kept his mouth closed. I swear if he would have commented, or if I would have seen so much as a smirk on his face, he would have been walking home.</p> <p>Fifty miles of silence later, I finally cut my eyes over at Grant. \"Are you hungry?\" I asked.</p><p>\"Oh, hello. Am I allowed to talk?\" he asked, sounding amused.</p><p>\"My humiliation is a never-ending source of entertainment for you, isn't it? Has there ever been a time when I wasn't doing something you could make fun of?\" I complained, taking the next exit that boasted several restaurants. Without asking for his preference, I pulled into the parking lot of a quaint-looking diner.</p><p>\"Making fun? Is that what you think I've been doing?\" he asked, unfolding his six-foot-plus frame from the car. He groaned as he worked the kinks out of his body. \"I swear, riding in a coffin would be more comfortable,\" he complained, bending over to stretch his back. I expected him to elaborate on why I thought he'd been teasing me our entire lives, but he continued to whine about the size of the car as we made our way into the diner. The air outside was brisk. I shivered, staring up at the low hanging clouds in the sky. I had lived in a snowy state long enough to know when a bad storm was coming.</p><p>The warm restaurant, on the other hand, was absolutely heavenly. \"Wow, I think an elf threw up in here,\" I said sarcastically. It's not that I hated Christmas decorations. All the rotten luck over the past couple of days had just made me overly cranky.</p> <p>\"I think they're cool,\" Grant said, taking in the endless array of mismatched Christmas decorations covering every available wall space. There were multiple Nativity scenes and each one seemed to be missing pieces. I couldn't help wondering why they didn't combine them into one complete set. It was impossible to count the number of Santa Clauses scattered around, but I did spot five Christmas trees in varying sizes. Whoever decorated them had quite the sense of humor. The funniest one was decorated using different beer cans as ornaments.</p><p>\"How many?\" an elderly waitress asked, looking up from a table she was wiping down.</p><p>\"Two,\" Grant and I answered in unison.</p><p>\"Aww, aren't you two so cute,\" she said, grabbing two menus from the hostess stand. \"My husband and I used to be in sync like that. Of course, now he's too busying fiddling around in his workshop to be in sync with anything else.\" She winked at me conspiratorially. Neither Grant nor I bothered to correct her assumption that we were a couple since she had already moved on to another topic. In the short walk to our booth, we learned she had been married thirty years and had two daughters that now lived out of state. Grant grinned at me as she placed our menus on a table that sat in front of the long bank of windows that looked out the front of the restaurant.</p><p>\"I'm surprised you two lovebirds decided to venture out. That storm is going to be a doozy,\" she said, placing two filled water glasses on our table as the first snowflakes began to fall from the sky.</p><p>I kicked Grant's leg when he snorted over her choice of words. \"We're just passing through,\" I answered.</p> <p>She shook her head before I finished getting the words out. \"I'm not sure that's the best idea. This storm is supposed to stretch across six counties. I guess if you have four-wheel drive you might be able to make a go of it,\" she commented, glancing out the window.</p><p>Grant and I looked at each other, trying not to laugh. The only way we would have four-wheel drive was if we picked up our matchbox car and placed it in the bed of the nearest Ford truck.</p><p>\"I'm thinking you'll be with us the next few days,\" she chirped cheerily, obviously thinking the same thing. \"Now what can I get you to drink?\"</p><p>\"Coffee,\" Grant answered.</p><p>\"I'll take the same,\" I answered, peering out the window. I was distracted by the snow that was already falling harder. There was no way we could be stuck here for two days. We were still more than seven hundred miles from Woodfalls, and Christmas was in four days. My mom would have my head if I didn't make it there for all the pre-Christmas festivities.</p><p>\"Don't worry, I'm sure this storm isn't as bad as she's making it,\" Grant said like he had read my mind. I pulled my eyes from the window and saw that he was studying me as intently as I had been studying the falling snow.</p><p>\"I hope not. My mom will kill me if I don't make it home for Christmas,\" I mumbled, fidgeting with my spoon on the table.</p><p>\"I'll get you home,\" he said confidently, sitting back in his chair.</p> <p>\"Oh, you'll be driving?\" I teased.</p><p>\"When I say 'I'll get you home,' I mean more figuratively,\" he answered.</p><p>\"Thought so.\" I smiled as June, our waitress, came back with two steaming cups of coffee. She took our food order after telling us she had called her niece who runs a bed and breakfast and told her that we'd be coming by.</p><p>\"Oh, that was nice of you, but I think we're going to see how far we can get,\" I said, handing her my menu.</p><p>Her eyes widened with disbelief, but she didn't say anything as she headed back to the kitchen shaking her head. Not that she gave up. Throughout our meal, she gave us updates on the weather and traffic conditions. She sounded like a walking highway safety billboard as she quoted statistics for weather-related car accidents. She even tried highlighting how lovely and romantic her niece's bed and breakfast was. I thanked her for her concern, but remained adamant that we were continuing on. I explained how our families were expecting us home for the holidays and would be disappointed if we didn't make it. Grant was no help. All he could do was sit and try not to laugh with every recurring visit to the table.</p><p>\"You were no help,\" I chastised him as we paid the check.</p><p>\"I think her concern is sweet,\" he said as we both shrugged into our jackets.</p><p>\"I brought you two crazy kids a couple of coffees to go,\" June said, bustling out of the kitchen. \"You come back and see us here in Whisper Hollow when you're not so pressed for time. Next time you'll have to try our waffles and legendary maple syrup. It's the best maple in the state,\" she boasted.</p><p>\"We will,\" I promised, even though there really wasn't a \"we\" when it came to Grant and me. \"Thank you, June,\" I said, impulsively giving her a hug. Maybe it was the cheesy Christmas decorations or I was touched by how concerned she was, but I felt an odd kinship with her. It made the stay in the roach motel last night that much worse knowing we could have stayed here instead if we had known about it.</p><p>Waving at June one last time, Grant and I left the warmth of the restaurant behind. We crunched our way to the car through the layer of snow that was effectively covering the ground.</p><p>\"Do you want me to drive?\" Grant asked. The offer was sweet, but I could see him eyeing the compact space behind the steering wheel skeptically.</p><p>\"Don't worry about it, big boy. I got it,\" I teased, easily sliding my petite frame behind the wheel.</p><p>\"Take it slow and easy,\" he directed as I pulled out of the parking lot and merged onto the highway.</p><p>I shot him a look that said I knew how to drive, even though I heeded his advice and let up on the accelerator a bit. The car still shimmied and slid on the slick highway. We didn't have a lot of weight in this small car. I let up on the accelerator a bit more as the snow fell even heavier. Our progress was slow, and I was beginning to think June was right. Only someone crazy would be driving on this road.</p><p>Without warning, the car lost traction. I barely had time to react as we slid sideways across the highway. Luckily, no cars were coming from the opposite direction. I removed my foot from the accelerator and stayed off the brakes. Thankfully, I had some experience driving on icy roads. I knew to turn the wheel in the opposite direction of our skid to keep the car from spinning around, but as much as I tried, we continued to slide sideways and down the short embankment. The car protested with a loud grinding noise and came to a jarring halt in a narrow gully off the side of the road.</p><p>Chapter 6</p><p>\"Well, hell, that was fun,\" I muttered, gripping the steering wheel with shaking hands. The car was no longer running, but smoke was seeping out from under the hood.</p><p>\"Are you okay?\" Grant asked. I had a strange sense of déjà vu. Just yesterday he had asked me the same question after the plane crash.</p><p>\"Yeah, but I'm starting to feel like we're in one of those Final Destination movies,\" I said, resting my head against the steering wheel. The vehicle shook slightly from Grant's laughter. As always, I was so glad I was here to amuse him.</p><p>\"It's not funny,\" I stated, although my own lips began to quirk from watching him trying to hold his laughter in check.</p><p>\"You're like the ultimate traveling bad luck charm,\" Grant said, between howls of laughter.</p><p>\"Me? How do you know it's not you? I've never had this much trouble getting from one place to the other before,\" I said as my own laughter rippled through me. I guess under the circumstances, it was good that we had a sense of humor over our experience. It would definitely give us a story to tell.</p><p>\"We better head back to Whisper Hollow,\" Grant said as the snow continued to fall.</p><p>\"Seriously? How far do you think we've gone?\" I wasn't relishing a walk along the highway in my designer boots that were designed more for fashion than function.</p><p>\"It's probably less than five miles. If we're lucky, we can get back to town before the sun sets. Besides, what choice do we have? Look at your phone. There's no signal out here.\"</p><p>Terrific. Five miles might not seem like a big deal to him, but for someone like me, who avoided exercise like the plague, five miles might as well be ten miles. \"Maybe we should wait for someone to drive by and help,\" I offered hopefully.</p><p>\"Did I miss all the traffic driving by? I think this is rush hour. Even if a car does happen to be out in these conditions, there's no guarantee they'd stop for us. We could wind up waiting and then be stuck here all night. I don't know about you, but sleeping in this tuna can is not my idea of a fun time,\" he said. He pulled on the handle of his door to climb out, but it wouldn't budge. \"Damn it,\" he grumbled. \"It's stuck. You're going to have to climb out first and then I'll go out your side,\" he said, looking at the center console and steering wheel apprehensively.</p><p>\"I can't wait to see this,\" I spurted out, laughing. It was almost worth the five-mile walk for him to finally be the butt of the joke. Almost.</p><p>Five minutes and multiple swear words, bumps and more swear words later, Grant and I were headed back the way we had come, this time on foot. Grant carried the recyclable Disney bag I had gotten from the airport that now contained a change of clothes for each of us and the necessary toiletries. I carried my purse with all our gadgets. He tried to talk me into leaving my laptop behind, thinking it would become dead weight, but I refused. My laptop was my life. I would drag my purse behind me through the snow before I left my laptop. I could tell he wanted to argue further, but he just shook his head, mumbling something about priorities. He didn't seem to get that my job was a priority and my laptop was a tool I needed.</p><p>I threw one last wistful look at the car that was already covered by a thin layer of snow. Pretty soon it would match the cover on the ground, which was up to my ankles. At first, I was okay walking along. It was kind of nice to have the snow floating down around us. Even as cold as I was at first, after twenty minutes of brisk walking while trying not to slip, I had warmed up and was tempted to take off my jacket. Once the wind kicked up, it was a different story. Neither Grant nor I talked as we trudged forward with the swirling snow whipping into our faces. Grant stuck close to me, lending a hand when the soles of my boots caused me to slip.</p><p>Forty minutes into our journey, I finally broke the silence. \"So, what do you do for a living now?\" I asked, huffing slightly in the brisk air. I had been dying to know what he had been up to since I left Woodfalls. I was just always too afraid to ask. He may think I'm crazy for asking now, but it was a way to pass the time.</p><p>\"I took over for my dad at the lumber yard. He still comes in every day, but he basically turned over the day-to-day responsibilities to me when I graduated,\" Grant answered, not sounding nearly as winded as I was.</p><p>\"Wow, that's great. I was afraid after the fires in '09 the plant was going to have to close,\" I admitted. My father had kept me abreast on what was going on while I was away at college. It was all he could talk about every time I called home. He was worried and rightfully so. He had been the shift manager at the plant for twenty years. The lumberyard was his life. He wasn't the only one. Half the population in Woodfalls had ties to the plant in one capacity or another.</p><p>\"That was a tough year, but I helped out whenever I wasn't in class. There was some rebuilding that needed to be done, but everyone really pulled together,\" Grant said.</p><p>\"That's Woodfalls,\" I said nostalgically. \"Whisper Hollow kind of reminds me of Woodfalls,\" I added. He nodded his head in agreement and I felt a wave of homesickness. In the four and half years I'd been gone, I had only returned for short stints, mostly around the holidays. It was the seasons I missed the most. Like the fall when the leaves changed colors in September and early October. The landscape would be a painter's canvas of yellow, red and orange. Spring was equally enchanting as new life bloomed in the plants that had been dormant all winter. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Sounds like you miss it,\" he said, looking at me with surprise.</p><p>\"Of course I miss it,\" I said halting. \"Woodfalls is my home.\"</p><p>He also stopped. \"You could have fooled me. You hightailed it out of there almost the moment we graduated and never looked back,\" he added, sounding aggravated, although I couldn't imagine why. His steps were longer than before, as if he was trying to outdistance his sudden annoyance with me.</p> <p>\"I had things I needed to do,\" I stated, stalking after him as my own anger rose. What was it to him that I had been gone for a while? It's not like we were friends or anything before I left. My own aggravation made me forget to watch my step on the uneven snow-covered path. I was practically running to keep up with him when my right foot stepped into a hole that was covered in snow. My ankle buckled and the forward momentum carried me to a heap on the ground with a cry of pain. The throbbing in my ankle outweighed the fact that I had fallen in front of Grant again. I chanted a few words that would have made a sailor blush as I extracted my foot from the booby trap it had stepped in.</p><p>Without hesitation, Grant dropped the bag he was carrying so he could kneel in front of me. \"Are you okay?\" he asked me for the third time in two days as he wiped away a tear that rolled down my cheek.</p><p>\"I'm not sure,\" I answered, pulling my pant leg up to inspect the damage. My boot was covering my throbbing ankle. I made a move to take it off, but Grant stopped me.</p><p>\"You better keep it on. If your ankle is swelling you might not be able to get it back on,\" he said, looking worried.</p><p>\"How much farther you think?\" I asked, squinting in the snow that was falling more rapidly.</p> <p>\"Two miles, give or take,\" he said, reaching a hand out to help me up. Grasping my hand tightly, he helped me to my feet. The instant I put weight on my leg it bucked and I bit back another cry of pain.</p><p>\"Mother sucking of all bad luck,\" I grunted, hobbling on my one good foot.</p><p>Grant looked back the way we had just come and then back to the way we still needed to go. Go figure. Only I would hurt my ankle at exactly the halfway point.</p><p>\"We have to keep going. It's okay. I'm going to help you,\" he said, effortlessly scooping me up into his arms.</p><p>\"Wait, you can't carry me,\" I squirmed.</p><p>\"Well, I don't want to freeze my ass off out here, and this is probably faster than helping you limp the rest of the way,\" he said, adjusting me snugly against his chest. His rock-hard chest I might add. \"I'm going to have to leave the bag. I'll have to get it later,\" he said, striding toward town.</p> <p>I cradled my purse in my arms, feeling guilty that he was supporting my weight along with our stuff, but we had no choice. Our phones and my computer would never make it covered in snow. My throbbing ankle continued to make its presence known, but I wasn't going to lie, his arms felt absolutely dreamy wrapped around me. Without giving any conscious thought to it, I snuggled closer. He responded by tightening his arms more securely. It had been longer than I would care to admit since I had been held intimately like this. My last relationship was a disaster to say the least. We fizzled out quickly when I realized the guy I had been dating basically lied to me about everything from his job, where he went to school, where he lived. Turns out he had dropped out of college and was still living at home while he worked odd jobs. I'm still not convinced he had given me his real name. Thankfully, it had only taken me a few dates to see through his load of crap. I'd like to say my other ventures in the dating world had been more successful, but between Dan the Forever Crotch Grabber and Steve the Perpetual Xbox Gamer, my dating endeavors hadn't been very successful. Long-term relationships never seemed to be in my grasp. I felt like Taylor Swift. Minus all the money, of course.</p><p>\"Are you still seeing Amanda?\" I asked impulsively. The moment the words left my mouth I wished I could have retracted them. Did I really want to know about Amanda at this moment?</p><p>\"Amanda?\" he asked, puzzled. \"No, we broke up right after you left.\"</p><p>My pulse felt like it galloped at his words.</p><p>\"She married Stan last year.\"</p><p>\"Oh, wow. I thought you guys were serious,\" I said, trying not to sound as excited as I felt. His words gave me permission to not feel so guilty for enjoying the way it felt to be held in his arms. The heady scent of his cologne swirled around me. I remembered the smell acutely. All through senior year, this had been his scent choice. Thanks to Ms. Garrison's statistics class and her insistence that we sit in alphabetical order, I had to sit behind Grant the entire year smelling it. Memories from back then flooded my mind and I fought the temptation to bury my face in his neck.</p><p>I felt him shrug before he answered. \"She wanted things I couldn't give her,\" he answered.</p><p>Great, he had a commitment phobia. \"I'm sure she would have waited until you were ready.\"</p> <p>\"I was never going to be ready,\" he answered.</p><p>Gah, commitment-phobe to the max. All my hopeful feelings from a few seconds ago deflated like a balloon. I wasn't looking for a guy who strings a girl along for four years and then drops her like a hot potato when she wants something more. I get the whole waiting thing, but you had to give a person something. For the first time, I actually felt bad for Amanda. Maybe I had dodged the bullet since Grant was never interested in me.</p><p>\"I got it. You're a perpetual playboy,\" I finally analyzed, looking at the falling snow in front of us.</p><p>\"Playboy? You grew up in Woodfalls, right? I'm not sure there are enough women there to be considered a playboy,\" he chuckled. \"Besides, Fran would have my head,\" he added.</p><p>\"How is Fran?\" I asked, momentarily distracted. I had fond memories of the woman who owned the small store back home. Where most towns had fast food restaurants where all the teenagers hung out, we had Fran's. She had always welcomed us in no matter how loud we were. She made sure to have our favorite snacks on hand and allowed us to claim the front porch of the store as long as we didn't disrupt the customers coming in and out. The best thing about Fran was that she was never too busy to listen to any of us. I loved my cousin Tressa and we had been close growing up, but once I hit high school, the two-year gap between our ages made it hard for me to talk to her at times. Fran was the only one in Woodfalls who knew about my feelings for Grant. She was my shoulder to cry on, dishing out tissues and advice at the same time. Eventually, I stopped focusing of Grant and told her about my desire to leave Woodfalls so I could meet Mr. Right. Fran was never crazy about the idea and made it her goal to find me the perfect guy in Woodfalls. For months after, I would arrive at her store to find a different guy from school who Fran had somehow convinced to help her with some project she had fabricated. Her plan never worked, but she deserved an A for the effort.</p><p>\"She's the same. Causing havoc and flirting with all the men in town her age and some who aren't her age. Of course, she's set her sights on Tressa's friend's dad.\"</p><p>\"What? Brittni's dad came back?\" I asked, completely floored.</p><p>\"No, not Brittni. Her friend Ashton.\"</p><p>\"Ashton? Why don't I remember her in school?\"</p><p>\"You wouldn't. Tressa met Ashton when she was in Woodfalls a couple summers ago. She came back last summer to get married over on the James property.\"</p><p>\"Wow, I guess I've missed a lot,\" I mused, turning my face back around to look at him. I was startled to see he was looking down at me intently. \"What?\" I asked self-consciously.</p><p>\"You have something on your nose.\"</p><p>\"Oh,\" I flushed, turning my face away from his. I ran my hand over my nose, completely embarrassed.</p><p>\"It was just a snowflake,\" he said, chuckling.</p><p>\"Creep,\" I muttered, swatting at his arm.</p><p>\"So, you plan on returning to Woodfalls anytime soon? I mean, for other than the holidays?\" he asked, adjusting me in his arms.</p><p>\"Not with the rate I'm going,\" I muttered, keeping my face averted from his.</p><p>He started to answer until we both heard a vehicle approaching in the distance. Grant gently stood me up and we waved our arms to get the driver's attention.</p><p>Chapter 7</p><p>A pickup truck much like June had suggested we needed slowed to a stop on the side of the road. \"You folks need some help?\" the driver asked after opening his door.</p><p>\"Yes, sir,\" Grant answered, walking toward him.</p><p>The large burly bear of a man stepped from the truck. He stood easily at six and a half feet tall. Grant was tall, and even he looked miniature next to this stranger. The nickname \"Refrigerator\" would have suited him well. Dressed in a flannel shirt that was rolled up to reveal massive forearms, he looked like a lumberjack, or in my mind, a serial killer.</p><p>\"Are you sure this is a good idea?\" I asked under my breath. \"He might be some crazy mountain-man killer.\"</p><p>\"Nah, he has to be cool. He has a Pittsburg Steelers flag in his back window.\"</p><p>\"Even more reason not to trust him. Everyone knows the only people you can trust are Bills fans.\"</p><p>\"You know football?\" Grant asked.</p><p>\"Um, hello? I was born in Woodfalls,\" I joked. Football and Woodfalls came as a package. With not a whole lot else to get excited about in a town the size of Woodfalls, football was practically a religion. To say you didn't like football was pretty much sacrilegious, and were considered fighting words. Fridays were spent traveling to high school games since our school didn't have a home field. Saturdays we watched college ball, and Sundays, of course were all about the Buffalo Bills. Even after almost five years away from Woodfalls, football was still in my blood.</p><p>\"I'm Tim,\" the stranger introduced himself. \"My wife, June, thought you folks might need a hand. She said you had it in your heads to drive some Barbie car in this storm,\" Tim said, opening the passenger door so Grant could set me down on the seat. My misgivings were put to rest. Of course June sent him out to check on us.</p><p>\"Barbie car. Ha, that's not far off,\" Grant laughed, sliding in beside me. I sighed with pleasure at the warm air coming from the vents.</p><p>\"How long you folks been walking?\"</p><p>\"Just over an hour. I think our car is about three miles up. We slid off the road. Then poor Jamie here stepped in a hole. I'm not sure if she broke her ankle or just sprained it, but we had to leave the bag I was carrying. I'd sure appreciate it if you would let me collect it.\"</p><p>\"Not a problem at all. We'll also check on your car.\"</p><p>\"That would be wonderful,\" I said. It would be great to have a change of clothing. I pulled my gloves off so I could hold my hands in front of the vents. I had been so preoccupied in Grant's arms I didn't realize how cold I was.</p><p>It took Tim less than two minutes to spot our bag on the side of the road where we had left it. Grant jumped from the vehicle to retrieve it. He brushed off the snow and handed it me to hold on my lap with my purse. When he climbed back into the truck, he was careful not to bump my ankle, which had started throbbing now that it was no longer elevated over his arm.</p><p>\"Our car should be pretty close from here,\" Grant said, closing his door hard.</p><p>\"How's your ankle feel, missy,\" Tim asked, shifting the truck from first to second gear.</p><p>\"I'm not sure to tell you the truth, but I know it hurts,\" I admitted, grimacing.</p><p>\"I'll bet. Don't worry. Doc Jones will get you fixed up.\"</p><p>Grant and I both burst out laughing. Tim shot us a look like we'd lost our minds.</p><p>\"Sorry,\" I said between giggles. \"We have a Doc Jones in the town we grew up in. We were just saying how much Whisper Hollow reminds us of home.\"</p><p>\"I'll be darned. Small town, huh? Nothing wrong with that,\" Tim said like we had just declared we were all members of the same secret society. \"Would you look at that. She was right. I think my grandkids have remote control cars bigger than that,\" Tim stated, pulling onto the shoulder of the highway. I was surprised to see our car covered with a blanket of snow that easily was six inches deep. I had no idea the snow had been coming down that hard while we were walking.</p><p>\"Yeah, it definitely wasn't our first choice, but it was all they had at the airport,\" Grant replied, climbing from the vehicle. He took the plastic bag with him, saying he would grab the rest of my stuff. I blushed slightly thinking about him seeing the bras and panties I had tried to hide between my sweaters. Hopefully he would leave everything folded and just add it to the bag.</p><p>The guys made quick work of grabbing the rest of our things, but by the time Tim turned the truck around, Mother Nature had kicked it up a notch. We were in an all-out blizzard. Even with chains on the tires, Tim had to grip the steering wheel and reduce our speed to a near crawl. We all remained silent so Tim could concentrate on the treacherous conditions. When we finally turned off the highway and drove into the Whisper Hollow town limits, we couldn't have been any more relieved.</p><p>\"We don't have a hotel here, but our niece runs a real nice bed and breakfast,\" Tim said, turning down a road a half mile off the exit. The town of Whisper Hollow came into view and the homesickness I had been feeling for Woodfalls returned again. I had fought my mom this year on coming home for Christmas, but at the moment I would do anything to be driving down Main Street in Woodfalls, surrounded by friends and family who all loved me. Instead, I was stuck several states away in a strange town with the last person I would have ever expected to be stranded with.</p><p>Whisper Hollow looked to be half the size of Woodfalls, although I'm sure they had their areas that stretched beyond the little town we were driving through. With the blanket of snow covering it, the town resembled something you would see on a Christmas card. Especially since everything was completely decked out for Christmas like the diner had been.</p><p>\"I'll drop you off here at the B&amp;B first and then send Doc your way,\" Tim said, pulling behind a large Victorian house with long sweeping porches on the first and second floors. A huge Christmas wreath hung from the highest eve of the house while lighted garland draped the porch railings on both levels.</p><p>\"Thank you so much. We can't thank you enough,\" I said to Tim.</p><p>\"I'm happy to help, darling. Let's get you two inside.\"</p><p>\"This is beautiful. Magical,\" I breathed as Grant opened the truck door and swept me back up into his arms. My eyes met his only to see he was studying me the way he had earlier when he told me I had a snowflake on my nose. I waited for a teasing comment or for him to make some joke since that was his norm, but he did neither. His eyes moved to my lips. Unconsciously, I dragged my bottom lip between my teeth, not wanting to admit how long I had dreamed about what his lips would feel like on mine. I shouldn't want them. He had all but declared that serious relationships weren't for him. Maybe something casual could work. Just this once. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tim interrupted the moment when he rounded the vehicle carrying our bags. I wasn't sure if I was relieved or disappointed. With me tucked into his arms, Grant trailed behind Tim as they climbed the four shallow steps to the front porch.</p><p>A bell chimed above the front door as Tim pushed it open. The foyer opened up to reveal a large grand staircase that greeted us as we stepped into the warm space that smelled like cinnamon and sugar cookies.</p><p>\"Uncle Tim, what are you doing out in a storm like this?\" a plump, pleasant-looking woman who looked to be in her early thirties asked, stepping into the foyer.</p> <p>\"Hey, Mags. These kind folks here ran into some trouble with the storm. Do you have any rooms available? I know you have that crew here from Georgia who come every year, but I thought maybe you could squeeze 'em in,\" Tim said, sliding his arms around his niece's shoulder. \"Grant and Jamie, this is my niece, Maggie. Or Mags to those of us who watched her grow up from being a peanut. Maggie, this is Grant and Jamie.\" He finished the introductions with a nod in our direction.</p><p>\"It's nice to meet you two. I expected to see you earlier after Aunt June called today,\" she said, reaching out to shake our hands, which was a bit awkward since I was still in Grant's arms. \"You're in luck. I had a cancellation on the Washington room,\" she said, wiping her hands on her Christmas apron that was covered in flour. \"Are you on your honeymoon?\" she asked, probably wondering why Grant hadn't put me down yet.</p><p>Her question was simple enough to answer, but for some reason, it suddenly felt like the white elephant in the room. I dared not look at Grant, afraid of the mocking that was sure to be there. Knowing him, he'd come up with some kind of joke at my expense. To beat him to the punch, I jumped in with the first thing that popped into my head. \"Hell no,\" I all but shouted, hearing myself echo in the small foyer. An uncomfortable silence filled the room and I wouldn't have blamed Grant if he dropped me on my ass.</p><p>\"I mean, I hurt my ankle,\" I finally said, finding the rational answer. \"That's why my friend Grant is carrying me.\"</p><p>\"Oh, you poor thing. Let me show you up to your room,\" she said, grabbing an old-fashioned looking key off an elegant key rack that hung next to the small reception desk. \"Do you want me to call Doc Jones, or are you going to go get him?\" she asked Tim.</p> <p>\"I'm going to fetch him. That ole pickup truck of his has been giving him some issues. I keep telling him it's time to drive to the city to get a new model. You know him though. He feels if he fiddles with it a little, it'll be good as new.\"</p><p>\"That's Doc for ya. He feels there ain't nothing broken that can't be fixed,\" Maggie told us with twinkling eyes as she headed for the staircase. \"I'll get these two settled in then,\" she threw over her shoulder.</p><p>Grant followed behind her with me still tucked in his arms, which I was thankful for. After my slip of the tongue, he could have left me in a heap at the bottom of the stairs.</p><p>Maggie led us down a long hallway, stopping at the last door at the end of the hallway. She inserted the key into the lock and pushed the door open. \"Welcome to the Washington Honeymoon Suite,\" she said, holding her arms out in a grand gesture.</p><p>\"Oh hell,\" Grant mumbled under his breath.</p><p>Chapter 8</p> <p>Turning my head, I took in the room. Our room. For a honeymoon suite, it definitely lived up to its name. Maggie got a fire started in the massive fireplace that was across from a king-sized sleigh bed, which would have dominated the space if not for how large the room was. Floor-to-ceiling bookcases covered the walls on either side of the fireplace. As beautiful as the room was, my eyes only seemed to be able to focus on the one bed.</p><p>\"You folks were actually pretty lucky. This storm made it impossible for the newlyweds who paid for this room to make it. They decided to fly to Bermuda instead, but that means all the amenities they bought are now yours,\" Maggie said, pointing to a bottle of champagne that was chilling by the fireplace next to a platter of decadent chocolate-covered strawberries. I would have laughed if the whole situation didn't seem so ridiculous. How did I go from flying home for the holidays to being laid up in a honeymoon suite with my high school crush?</p><p>\"This is fantastic,\" Grant said in a strangled voice, depositing me on the bed and backing up toward the door. \"I better go see if the doctor is here,\" he said before fleeing from the room.</p><p>Maggie looked at me questioningly as I burst out laughing. \"He's a bit of a commitment-phobe,\" I said, though it really wasn't funny. I had officially lost it.</p><p>\"How long have you two been dating?\" Maggie asked, taking my jacket and hanging it in the closet.</p><p>\"Oh, no, we're not dating,\" I said, leaning back against the stack of pillows that lined the headboard. \"We went to school together. It just so happens we ran into each other on our way home for the holidays. The funny thing is the trip has turned into something right out of the movies.\"</p><p>\"That sounds like an interesting story.\"</p><p>\"You could put it that way, but it's almost more appropriate to call it a disaster story,\" I admitted, launching into an explanation of everything that had happened in the last twenty-four hours. Maggie found the retelling of our adventure extremely humorous. We were both laughing when Grant returned with the doctor.</p> <p>\"Hello, young lady, I'm Doc Jones,\" the elderly gentleman said, holding out his hand. \"I heard you hurt your ankle playing in the snow,\" he added, winking at me.</p><p>\"That's one way to put it,\" I answered as Maggie giggled again. I grinned back, which turned into a laugh when Grant looked at both of us like we had sprouted an extra head. Doc Jones paid no attention as he moved to the foot of the bed where my sore ankle was propped up over a stack of pillows.</p><p>\"The first thing I'm going to do is remove your boot, which will cause some discomfort,\" he said, tugging on my boot. Discomfort was a total understatement. I wanted to yell the whole dictionary of curse words, but I didn't want to shock everyone in the room. I leaned back against the pillows, panting as the doc examined my foot. I tried to appear tough for my audience, but all I really wanted to do was cry. My ankle, which had been merely throbbing, now felt like someone had taken a sledgehammer to it. Only when I heard Maggie clucking her tongue sympathetically did I raise my head off the pillows so I could peer at my right ankle. I studied it critically, not believing it was mine. It was easily twice its normal size, if not bigger. The most startling aspect was the color. The normal creamy tone of my skin was gone and replaced by an icky rainbow of blues, blacks and purples that all blended together into a bright swollen mess.</p><p>I sank back against the pillow again as Doc Jones continued to probe at the monstrosity that was now my ankle. I knew he was being gentle as he could, but it felt like he was running it through a meat grinder. I turned my head from the others as a tear crept out of the corner of my eye. I wanted to tell him he was examining a swollen ankle, not working in a pottery class.</p><p>\"Well, I'm ninety-nine percent sure it's just a really bad sprain, but I'm going to wrap it good until we can get X-rays done to make sure. The closest hospital is twenty miles away, but we should wait until the storm has passed,\" he said, pulling a bandage from his bag. By the time he was done, a thin layer of sweat had beaded up on my forehead, but the pain was at least bearable now that the ankle was wrapped.</p><p>Finally, when my foot was propped up again, I looked over at Grant, who had remained stoically silent during the examination.</p><p>\"Maggie, dear, will you get Jamie something to drink for her pain pills?\" Doc Jones asked, pulling out a sample pack of pills. \"These will help with the pain and might make you a little loopy, so no alcohol,\" he said, looking pointedly at the champagne.</p><p>\"Can't I just take ibuprofen?\" I asked, not liking the idea of taking pain pills with Grant around. Especially if they were supposed to make me loopy.</p><p>\"Ibuprofen should work tomorrow, but for tonight you're going to want to take these,\" he said, popping two of the pills out of the pack.</p><p>Maggie handed me the glass of ice water she had poured from the ceramic pitcher on the highboy dresser. She winked at me as Doc handed over the pills. She knew why I didn't want to take them.</p><p>I stuck my tongue out at her before dropping the pills into my mouth. She laughed as she headed for the door. \"I better go check on supper. Are you up to joining us in the dining room, or would you like me to bring a tray up?\" she asked me.</p><p>\"I'd like to join you if that's okay,\" I said, looking at the doctor questioningly.</p><p>\"As long as you keep your foot propped up, that will be fine,\" he said, closing his bag.</p><p>\"Would you like to join us, Doc?\" Maggie asked. \"I made pot roast,\" she added, trying to entice him.</p><p>\"Damn, I sure hate passing up your pot roast, but June and Tim already invited me over for dinner. You know it's dang near impossible for me to turn down June's chicken pot pie,\" he said, smiling at Grant and me. \"You take it easy, young lady. I'll come back tomorrow evening to check your ankle,\" he said, heading for the door.</p><p>\"Wait, what do I owe you?\" I asked.</p><p>\"Think nothing of it. Maybe one day you'll pass through again and take me out for a fancy dinner,\" he said, winking at me before leaving the room.</p><p>\"I can't believe how nice everyone has been,\" I said, completely perplexed.</p><p>Grant laughed. \"I know, right? But you know what? I'd like to think anyone in Woodfalls would do the same thing if two strangers like us needed a hand. Maybe when we get home we can think of some way to pay them back.\"</p><p>\"That can't happen soon enough, let me tell you. Tomorrow we're calling the rental company and figuring out a way to get us another car so we can get home.</p><p>\"You know we're going to have to wait until the storm passes, right?\" Grant said, snagging two of the strawberries off the tray. He handed me one before popping the other in his mouth.</p><p>I gaped at him for a moment, ignoring the strawberry.</p><p>\"What?\" he asked at my guppy-like expression.</p><p>\"We're not leaving tomorrow?\"</p><p>\"Jams, have you missed the blizzard outside? We're not going anywhere until it passes and they clear the roads. Tim was saying it could be Friday.\"</p><p>\"But, Christmas is on Thursday—in three days,\" I said, stating the obvious. There was no way I could spend the next three days holed up in some honeymoon suite with him. \"What am I going to do about my mom?\" I added.</p><p>He sat on the edge of the bed beside me, which momentarily distracted me. Did he have to be so freaking handsome?</p><p>He smiled at me. Oh hell, did I say that out loud? It was the damn pills. I could already feel their effect as my brain took on a hazy quality.</p><p>\"My mom wanted me home for Christmas,\" I said lamely, trying to cover up what I may or may not have said.</p><p>\"Jams, I've known your family my whole life and I'm pretty sure your parents would rather you were safe. Plus, you heard Doc Jones. You need to keep your foot elevated.\"</p><p>His words made sense, or at least I thought they did. Just to be safe, I nodded my head. Again, I think I nodded my head. I was finding it hard to concentrate on what we were even talking about. Whatever had been in the pills had broken my brain, but at least I could no longer feel the pain in my ankle.</p><p>\"Jamie, are you okay?\" Grant asked, looking at me with concern.</p><p>\"I'm okie dokie artichokie,\" I sang, giggling at my rhyme.</p><p>\"I'm taking that to mean your pain pills are working,\" he said, moving around to the other side of the bed.</p><p>\"Just put it this way. I feeeeeeeeel good,\" I slurred.</p><p>\"I bet you do,\" he laughed, lying back against the pillows. For some reason, his action struck me as funny.</p><p>\"I've always wanted you in the sack,\" I blurted out. I sensed that I shouldn't have said that, but my tongue and brain seemed to be working against each other.</p><p>\"You have, huh?\" Grant said, turning on his side. \"Do tell.\"</p><p>I tried to focus on his face, but that had become fuzzy too. \"Yep, since high school,\" I answered, closing my eyes. \"Because I loooooved you,\" I sang, smiling at how the words chimed through my head.</p><p>Grant said something else, but it took too much effort to decipher. And that was the last thing I remembered.</p><p>Chapter 9</p><p>My eyes fluttered open to the sounds of the wind howling outside and the fire crackling in the fireplace. I felt warm and cozy snuggled up in the bed with a large hand resting on my bare stomach where my shirt had ridden up. My groggy mind didn't connect the dots until I lifted my arms, spotting both my hands. Glancing down, I could see Grant's fingers splayed across my abdomen. Suddenly, hazy memories of last night began flooding my mind. I remembered Grant lying next to me on the bed and me saying something about how I wanted to get him in the sack. Oh God, it was the pills Doc Jones had given me. Were they pain pills or truth serum? I was pretty sure I told Grant I loved him too. I would have given anything for it to have been a bad dream, but the memories were too clear now. Grant was sleeping on his side, facing me, holding me securely against his body. I was tempted to stay there, basking in his embrace, but my mouth felt fuzzy from falling asleep without brushing my teeth. I shifted my body to climb off the bed, but when my foot touched the floor, my sprained ankle reminded me I wasn't ready to walk on my own.</p><p>I crumpled to the floor, crying out in pain. The bed creaked and Grant's head peeked over the side, seeing me sprawled out on the hardwood floor. Glancing at the clock on the mantle, I saw it was barely five a.m.</p><p>\"What were you thinking?\" Grant asked, appearing at my side. He kneeled down to help me stand.</p><p>\"I forgot,\" I answered, feeling like a complete ass. \"I'm sorry I woke you,\" I apologized, looking at him. He was shirtless like the night at the roach motel. My already fuzzy mouth became as dry as the desert as I took in his taut muscles and defined six-pack abs. He had the physique of someone who was no stranger to physical labor. My fingers wanted to reach out and trace the contour of his pecks that because of his height were at my eye level. They became even closer when he scooped me into his arms.</p><p>\"Were you trying to get to the bathroom?\" he asked. I heard his words, but they didn't quite register. My mind continued to be preoccupied with the fact that I was in his arms while he was practically naked. I ran my hand over his chest. His skin was as warm as I imagined it would be. My eyes found his as I continued to explore the planes of his muscular upper body. He didn't speak, but shifted his stance. I suddenly felt the stirrings of humiliation. Of course he felt uncomfortable. He had no interest in me. I pulled away from his body, but he tightened his hold on me. My breathing began to match my rapid pulse as his eyes focused on my lips. I was ready and hesitant at the same time. I wanted to feel those lips pressed against mine, but what would it mean for us? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Bathroom?\" he asked huskily, returning his stare to my eyes.</p><p>\"Huh?\" I answered. His words shook me back to reality and my pressing needs. Crap, my teeth. He almost kissed me and I'm sure my breath was rank enough to turn Medusa to stone. I clamped my hand over my mouth.</p><p>\"Is that some kind of hint?\" he asked in a strangled voice</p> <p>\"I need to brush my teeth,\" I mumbled around my fingers.</p><p>\"Are you still high on those pills?\" he asked, waiting like I was going to spout out more gibberish like I did last night.</p><p>I groaned at his words. \"No, I just hate morning breath,\" I said, flushing. I vainly hoped the dim light from the fire would keep him from seeing my embarrassment. \"Please stop looking at me like I just climbed out from under some gross rock,\" I begged, hoping he would just let the whole pill thing go. Couldn't it be like going to Vegas? What happens when Jamie takes pills stays at blah blah blah.</p><p>He stared at me for a moment before coming to the conclusion that I wasn't high. I was getting close to the point of becoming defensive by the way he was looking at me, but something in his stare struck a chord in me. It was almost as if he cared, which confused me, but still fueled my feelings of desire for him. The desire that had been dormant for the past five years since we'd last seen each other was now smoldering.</p><p>We continued to stare, both nervously waiting to see who would make the first move. I felt something akin to pain with need. I strained closer, willing him silently to ease the burning inside me. A log in the fireplace settled loudly, startling us both. The moment was broken like coming to from a hypnotic trance.</p> <p>What was I doing here? Talk about playing with fire. Everything in me knew I was asking to get burned. It was time to get a grip. \"Um, bathroom,\" I reminded him, seeking to get a little distance between us. As nice as it was to languish in his arms while I admired his physique, it was hard to want to go any further without wondering if I would only get hurt in the long run.</p><p>\"Right,\" he said, heading for the bathroom. It didn't surprise me to see how luxurious the bathroom was in our suite. Admittedly, I was a definite bathroom slut and this one didn't disappoint. A large granite counter with grey smoke-colored glass bowl double sinks lined one wall. The best feature was the old-fashioned claw-footed tub that begged for long bubble baths, especially for two, judging by the size. This whole suite was like an aphrodisiac.</p><p>Grant placed me on the counter between the sinks, pulling my eyes from the tub where I was picturing us naked together. I was acting like a walking sex-deprived disaster. If I didn't come to grips with my feelings I would drive myself nuts. \"I'll get your bathroom stuff,\" Grant said, seemingly oblivious to my erotic thoughts.</p><p>\"Can you manage okay, or do you need my help?\" he asked, returning quickly. He looked comfortable with either answer.</p><p>\"I got it,\" I gulped. Even if I did think sharing a hot bubble bath together was a possibility, I couldn't imagine the best way to get us in the mood would be for him to help me use the potty.</p><p>\"Just be careful. With your luck these last few days, it wouldn't be a far stretch for you to fall and really break something this time.\"</p> <p>\"Bite your tongue,\" I muttered, even though it was hard to deny his observation. Never in my whole life had I ever had such a string of bad luck. Maybe it wasn't me. He could be the bad luck charm for all we knew.</p><p>He laughed at my words and closed the door to give me my privacy. It took a lot of hobbling on one leg, but I was finally able to brush my teeth, wash my face, use the toilet and fix my hair so it no longer resembled a bird's nest. By the time I finished, I almost felt like I had completed a workout. I was ready to cut off my foot so I wouldn't have to deal with the pain.</p><p>Grant was standing patiently outside the bathroom when I opened the door. I was both disappointed and relieved to see that he had put on clothes. He had also opened the heavy drapes that I didn't realize covered a long bay window with a built-in window seat. The sky was still covered in clouds, but I could tell the sun was beginning to rise. Of course, it was still snowing. Grant carried me back to the bed, which he had made while I was in this bathroom. It was seriously too bad he had commitment issues, because he would make someone an amazing husband someday.</p><p>\"Are you hungry?\"</p><p>My stomach growled in response to his question, making him smile. \"I'll take that as a yes. You should be hungry since you snored through dinner.\"</p><p>\"I don't snore,\" I retorted.</p><p>\"Are you sure about that?\"</p><p>\"No one's ever mentioned it before,\" my voice trailed off. Did I snore? It had been a long time since I had an overnight guest.</p> <p>\"Probably because I made it up,\" he said grinning at me as he headed for the door. Grabbing a pillow off the bed, I chucked it at the door, even though he was already long gone. He would never outgrow teasing me.</p><p>I switched on the lamp on the table and picked up my phone that Grant must have charged for me since my battery was at one hundred percent. It was still too early to call my parents, but I would have to in a little while. I didn't relish breaking the news to my mom that for the first time ever, I would not be home for Christmas. Scrolling through my social media apps, I made sure I hadn't missed anything in my absence. For the most part, everything was quiet on that front. I guess everyone was in holiday mode, which was fine with me. It was kind of nice to take a break from it all.</p><p>Setting my phone to the side, I laid back on the pillows. It felt strange to not be obsessing over my blog. For two years, I had slept, ate and breathed nothing but my cooking show. Even when I agreed to come home, my plan was to work while I was there. I had an entire Christmas segment worked out with different holiday treats that were sure to woo your man. Now, it almost felt like my perspective was changing, or was at least blurred. Maybe it was the nearly life-altering plane crash or the car accident during a snowstorm that could have turned tragic, or my sprained ankle. Or for that matter, even the night in the roach motel. I could laugh now at how crazy the last forty-eight hours had been, but it also had me thinking about where my life was going. Of course, I neglected to add the most important thing to the list, which was Grant. Up until two days ago, I had been able to successfully make it through long stretches of time without giving him any thought. Even if he did come to mind, it was only the fact that he was probably married to Amanda with a couple of kids. Knowing that wasn't the case changed everything.</p><p>\"Sorry it took so long. Maggie insisted on making you a full breakfast,\" Grant said, interrupting my thoughts. He carried a tray loaded with food.</p><p>\"Holy gluttony. She didn't have to do that,\" I protested, although the tantalizing scents had my growling stomach thinking otherwise.</p><p>\"I tried to tell her that, but I think she felt bad since you missed dinner last night. Which, by the way, might have been the best pot roast I've ever had,\" he said, placing the tray in the middle of the bed between us. He handed one of the loaded plates to me.</p><p>\"So, tell me what's been going on in Woodfalls,\" I said, taking a bite of bacon.</p><p>\"Doesn't your mom keep you up on everything?\"</p><p>\"Not really. Sometimes I think she's hoping that by being close-mouthed I'll come home more often. She'll throw out little teasers every once in a while, but won't embellish on them, even when I press her. She's a jerk,\" I said affectionately.</p><p>\"Sounds smart to me. What do you want to know?\"</p><p>\"Everything,\" I answered.</p><p>And that's what he did. He filled me in on who was dating who, who had recently had kids, who had passed away, and of course, my cousin Tressa's latest scandals. I loved Tressa to death, but I swear, she wasn't happy unless she was stirring up something. Our conversation continued after we finished eating. He was turning into an easy person to talk to when he wasn't teasing me. I'm sure a lot of it had to do with our common bond of knowing all the same people. I was surprised to discover we shared a lot of the same likes and dislikes. It seemed crazy that even growing up around someone in the same small town didn't mean you knew everything about them.</p><p>\"What about your dad? How's he liking retirement?\" I asked, sliding my plate away so I would stop nibbling on the leftovers. My stomach was threatening mutiny if I tried to eat one more morsel of food.</p><p>\"Well, considering he still comes in almost every day, I'd hardly call it retirement. I think he missed the memo on what retirement is supposed to entail. I guess I can't blame him though. The lumber yard has been his whole life since he was kid. My grandpa was the same way. I'm sure when it's my turn it'll be my son griping one day.\"</p><p>\"Your son? You want kids?\" I asked, completely floored.</p><p>\"Sure I want kids. The more, the better as far as I'm concerned.\"</p><p>Seriously? Mr. Non-Commit wanted kids? Did he understand that kids were the mother of all commitments?</p><p>\"What? You don't want kids?\" he asked intently.</p><p>\"Of course I want kids. I want a whole houseful, but I'm shocked you want them.\"</p><p>\"Why? You think I'd make a lousy dad?\" he asked, snagging the last piece of bacon from my plate.</p><p>\"Of course not, but you do realize you'll actually have to bite the bullet and commit to someone?\"</p><p>\"Duh, really?\" he said, looking offended.</p><p>\"Hey, don't get all offended. You're the one who said you couldn't commit.\"</p><p>\"What? When did I say something like that?\" he asked incredulously.</p><p>\"When you were talking about Amanda getting married,\" I answered, amazed at how dense he was being.</p><p>\"I said she wanted things from me I wasn't willing to give.\"</p><p>\"Exactly. Considering she got married to someone else, I'm guessing what she wanted was marriage.\"</p><p>\"Right,\" he answered, looking at me like I was the one talking in circles and not him.</p><p>\"Which would mean you were unable to commit,\" I said through gritted teeth, plopping back on my pillows. He was so infuriating at times. I couldn't tell if he was messing with me.</p><p>\"Commit to her being the point.\"</p><p>\"Ooooh, you didn't want to marry her,\" I said, finally understanding. I pulled my bottom lip into my mouth, mulling his words over. He wasn't the commitment-phobe I had portrayed him to be. He just hadn't found his \"someone.\" I couldn't help the smile that spread across my face. It shouldn't matter to me. But it did.</p><p>\"Ding ding ding. I don't remember you being that dense in school. Have these highlights messed with your brain?\" he teased, tugging on a lock of my hair.</p><p>\"Funny. I thought you were deliberately trying to be obtuse.\"</p><p>\"Why do you care so much?\" he asked, scooting the tray to the foot of the bed and moving closer to me.</p><p>My body reacted to his close proximity. \"What makes you think I care?\" I said breathlessly as he inched closer.</p><p>\"I think you care a lot,\" he said, dropping his eyes to my mouth.</p><p>I swallowed hard as his mouth hovered close to mine. \"Tell me you haven't been thinking about this,\" he said, stroking a thumb over my bottom lip.</p><p>\"Have you?\" I whispered.</p><p>\"Jams, I've been thinking about this longer than I can remember,\" he said, crushing his lips to mine. His words rang through my head, but there was no way I could make sense of them when his lips felt so good. I responded with a small moan when his tongue trailed across the same spot where his thumb had been. My pleasure filled acceptance affected him and he dragged me into his arms, deepening the kiss. A shiver rippled down my body as our tongues found each other. I gripped the hem of his shirt, wanting him closer. Hearing my unspoken plea, he settled the upper half of his body on top of mine. I gasped with pleasure, running my fingers up under his shirt. I could feel the firmness of his muscles and smoothness of his skin. It was almost my undoing when I felt him tugging at my shirt moments before his hand glided over the sensitive skin of my ribcage. My blood roared through me. His hand moved farther up to my breasts and I bowed my body, whimpering against his lips. I wanted his touch everywhere on my body.</p><p>\"Jams, you're seriously killing me,\" he said raggedly against my lips. He pulled back slightly.</p><p>\"Is that good or bad?\" I asked, running my hands up his torso. My fingers trailed to the small patch of hair that disappeared down his jeans. Ever since I'd seen him in nothing but his jockey shorts the other night, I've fantasized about that small trail of hair.</p><p>\"So good it almost hurts,\" he said, leaning in for another kiss. Before his lips could reach their destination, a beeping noise from downstairs followed by the sound of voices in the hallway interrupted us. \"Really?\" he asked incredulously, climbing off the bed. I couldn't help giggling. Of course something was going on. With our luck lately, I could have almost set my watch by it.</p><p>Chapter 10</p><p>Grant helped me put my boot on my one good foot and slid his feet into his own before he reached for me. His eyes were amused as he scooped me up into his arms yet again. \"Nice timing,\" he joked. \"I better think about baseball and hope it works quickly.\"</p><p>\"What?\" I asked, not getting what he meant.</p><p>\"You know—we were just doing some stuff that may have caused something,\" he said, nodding his head downward.</p><p>I burst out laughing after finally realizing his problem. \"So, I shouldn't tell you how hot you were making me?\" I said, adding fuel to the fire.</p><p>\"Please no,\" he pleaded as I reached out to open the door.</p><p>In the last twenty-four hours, I had been held by him a number of times, and yet this time it felt different as he cradled me tenderly against his chest. We followed another couple down the stairs and outside. Smoke was drifting from the back of the house, which alarmed us both.</p><p>\"Where's Maggie?\" I asked, scanning the small crowd outside.</p><p>\"I don't know,\" Grant said, looking worriedly back inside.</p><p>\"Put me down, I can hang on to the post,\" I said, hearing sirens in the background.</p><p>\"Don't move,\" he said, setting me down.</p><p>\"I promise not to run any marathons. Now get in there.\"</p><p>A woman I didn't know came over to stand beside me. \"Are you okay?\" she asked as I hobbled on one foot while I held the banister.</p><p>\"Yeah, it's just a bad sprain. Do you know what happened?\" I asked.</p><p>\"I think it's another one of Maggie's mishaps in the kitchen,\" she laughed.</p><p>\"This has happened before?\" I asked, feeling somewhat relieved. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Oh, yeah. We've been coming here for ten years, and I think Maggie has had a fire five of those years,\" she said, laughing again. \"I was still snoozing when the alarm went off this time. Thank god my husband, Jim, heard it since I sleep like the dead. I wish he would have had the foresight to tell me to grab my shoes though,\" she said, pointed down to her stocking-clad feet.</p><p>I nodded my head absentmindedly. The sirens were getting louder, but I was more concerned that it seemed to be taking Grant so long. The rest of the residents didn't seem overly concerned as they chatted among themselves, but I was still a worried. Just when I was ready to hobble in after him, the first fire truck turned down the narrow lane in front of the inn. At the same moment, Grant came out from the house followed by a sheepish-looking Maggie, who was coughing from the smoke.</p><p>\"Not again, Maggie,\" one of the firemen said, climbing down from the rig. \"Is it out?\"</p> <p>\"It was just a small one, Hank,\" Maggie said, shooting a guilty look at her guests.</p><p>\"What did we tell you about using your gas stove?\" he asked as the other men from the fire truck headed inside to make sure the fire was indeed out. Peering through the door, I could tell most of the smoke had already started to thin out.</p><p>\"What happened?\" I asked Grant as Maggie trailed in after the firemen.</p><p>\"Grease fire. Maggie had it out by the time I made it in there, but the kitchen was already filled with smoke. We opened the back door and the kitchen windows to let it blow out,\" he said, taking my hand so I wasn't so wobbly. \"I guess it's happened before. Maggie likes to keep the bacon grease on the stove, but she forgets to turn off the heat under it.</p><p>I laughed. I had worked long enough in the cooking field to know her mistake.</p> <p>\"Well, at least Maggie seems to be a pro at dealing with it,\" I said, watching the firemen head back out. Hank was still reprimanding Maggie, telling her he'd have to give her a citation the next time they had to come out. Maggie listened to him solemnly, nodding her head in all the appropriate spots. Once the fire truck pulled away, Maggie turned to me with the same mischievous grin I had seen the day before.</p><p>\"Sorry about the early morning wake-up call, folks. The good news is breakfast is ready for those who haven't eaten and the cookies in the oven were saved before disaster struck,\" she said good-naturedly, leading the way back into the house. Everyone laughed with her, relieved it was nothing more serious. That, and we really wanted to get back inside. There were far too many chattering teeth as everyone stomped their feet in the cold. At least the snow had finally stopped, but the wind was still blowing around.</p><p>\"Your chariot waits,\" Grant said, lifting me up. \"I think I'm getting used to this.\"</p><p>\"Fine by me,\" I teased. My eyes met his and I knew we were both thinking about our kiss and everything else that was about to happen before the ruckus. His eyes darkened while his grip on me tightened. \"You want to go back upstairs?\" he asked. I knew what he was asking. If we went upstairs, we would be continuing where we left off. He was giving me a chance to put on the brakes, but it wasn't necessary. I was as ready as he was.</p><p>I nodded my head, running my hand over the light-colored five o'clock shadow covering the lower half of his face. I liked this rugged look he was sporting. I continued to explore his face, taking time to trace my finger over his lip as he carried me back to our room. He startled me by sucking the finger into his mouth. My stomach tightened with desire as his tongue swirled sensually around my finger. I turned my head to see how close we were to our room. Sensing my urgency, he picked up his pace.</p><p>Our door was still open from when we left earlier, but Grant kicked it closed behind us and reached back to make sure it was locked. \"I don't want to hurt your ankle,\" he said, looking at my wrapped foot.</p> <p>\"You won't,\" I said. At the moment, that was the last thing on my mind. My desire for him had intensified to the point of no return. I had dreamed about this moment for a long time. As he lowered me to the bed, I remembered something I wanted to ask him. \"What did you mean when you said you'd been thinking about kissing me for a long time?\" I asked as he pulled off my boot and climbed up on the bed with me. Taking care not to jar my ankle, he positioned me on my side so we were facing each other.</p><p>He scooted close, running a hand from my shoulder down to my hand before lacing our fingers together. He brought my hand to his mouth so he could place his lips on my knuckles before answering me. \"Jams, surely you know I've had a thing for you half my life?\" he said, placing a hot kiss on my wrist.</p><p>\"No, you haven't,\" I argued. Did I really need to remind him of all the relentless teasing he had put me through during my formative years?</p><p>\"Didn't you get the hint when I dipped your braid in paint in second grade?\" he asked, scooting my shirtsleeve up so he could trail his lips up my forearm. I shifted closer to him with my desire at full force. Sensing my needs, he lifted my good leg and eased his own leg between me, bringing us practically on top of each other. I couldn't help moving against him. He was driving me nuts with his slow patient pace.</p><p>\"You hated me,\" I said, finally finding my voice since our slow grinding motion was distracting me.</p><p>\"I was just trying to get your attention. I thought you were cute, but you kept shooting me down,\" he said, moving his kisses from my arm to my collarbone.</p><p>\"You teased me mercifully.\"</p><p>\"I had a major hound dog crush on you. I worked for a week on the valentine I gave you in third grade. Do you remember it?\"</p> <p>\"I still have it,\" I admitted.</p><p>He pulled back from my neck for a moment. \"You do?\" he asked, sounding thunderstruck.</p><p>I nodded my head as his eyes held mine. \"I had to re-tape it freshman year when I tore it up.\"</p><p>\"Why, what happened freshman year?\" he asked, smoothing my hair off my forehead before resting his hand on my thigh so he could hitch my leg over his more securely. We continued our slow grind. I would have been embarrassed, but it felt too good to care.</p><p>\"You started dating Amanda. It crushed my heart, so I tore up the heart you gave me. After I re-retaped it, I shoved it in my drawer so I wouldn't have to face it.\"</p><p>\"I started dating Amanda because I thought you were never going to give me a shot. The guys were giving me a hard time and told me to do something or move on. I figured they were right when you never looked at me again.\"</p><p>\"You broke my heart. Just ask Fran. She was my sounding board the entire time,\" I whispered as he lowered his mouth to my cheek.</p><p>\"I was stupid. If it makes you feel better, you broke my heart too when you left Woodfalls,\" he admitted.</p><p>My heart stuttered. His words eclipsed our sensual heat as we shared probably the most significant moment of my life. \"We were both stupid,\" I said, pulling him close. I couldn't stand another moment without our lips together. The kiss started so tenderly that tears formed in my eyes. Cupping my face with his hands, Grant anchored me in place as his lips staked their claim. I deepened the kiss and moved my hips to force his leg more snugly between mine. His hands found their way under my shirt, moving seductively over my stomach, past my ribcage and coming to a rest right below my bra line. \"Yes,\" I whimpered. I raised my back to allow him access to remove my lacy undergarment.</p><p>\"You want this?\" he asked, slowly lifting my bra so his hand could make its way underneath.</p><p>\"Don't be a tease,\" I said, tugging on his shirt.</p><p>\"But you're so cute when you get aggravated,\" he said, shrugging off his shirt. I lifted my head and circled his nipple with my tongue, grinning wickedly when his eyes darkened. I could play his game if that's what he wanted. I glided my tongue smoothly to his other nipple, dragging it between my teeth and biting gently. His body arched against mine. I could feel his hunger pressed hot and hard against me. Enjoying the feeling of empowerment, I sucked harder on his chest as he gripped my hair in his hands.</p><p>\"Enough, woman,\" he finally said, pulling off my shirt and bra.</p><p>\"Just thought you needed a little taste of your own medicine,\" I said. He took it as a challenge and began kissing my stomach. This time it was my turn to arch as his mouth left a fiery path down my abdomen to the top of my PJ bottoms. To make his point, he lifted the edge of my panties and placed one more purposeful kiss just above where I wanted him the most. He was killing me. My response set a fast course as we shed the rest of our clothing. I finally got to see where the enticing trail of hair on his stomach ended just before he settled between my legs. His eyes never left mine as he moved slowly inside me. He set the pace, which was both infuriating and toe curling all at once. He would thrust against me, getting me right to the edge and then hold back to drag the moment out. I clutched at his back, urging him that I was close.</p><p>\"Not yet, baby. I want this to last. We've waited a long time for it,\" he said, placing his mouth tenderly on mine. I moved restlessly beneath him, completely consumed by the fire. Just when I thought I couldn't handle it a second longer, he started moving inside me again. The wave came out of nowhere, crushing me as I pressed my hips against him. His lips swallowed my moans of pleasure as my body convulsed around his. He finished just as I did, thrusting one last time before collapsing on top of me.</p><p>Completely content, I stroked a hand over his head, marveling at how good his weight felt on top of me. My eyes felt heavy and I could feel his labored breathing returning to normal. I think we both must have dozed for a few minutes, but eventually Grant left the bed to clean up before closing the drapes. He crawled back in bed and gathered me in his arms. We napped into the early afternoon together.</p><p>Chapter 11</p><p>The echo of laughter in the hallway woke me a few hours later. Turning to face Grant, I saw he was already awake and watching me.</p><p>\"What?\" I asked, self-consciously pulling the blanket up to cover my breasts.</p><p>\"I'm just basking in the glory of finally having you in my bed,\" he said, tightening his arm that was wrapped around my midriff.</p><p>\"Well, technically, I was in your bed last night too,\" I teased. \"Oh crap, I keep forgetting to call my mom. She's going to kill me,\" I said, sitting up in a sudden panic.</p><p>\"Relax. I called her last night while you were whacked out on your happy pills,\" Grant said, placing his hand on mine before I could dial my parents' house.</p><p>\"You did?\" I asked, touched that he had the foresight to do that. \"Wait, what did you tell her?\"</p><p>\"I told her about the snowstorm and our accident,\" he said, chuckling as he ticked off everything that had happened in the last day. \"Oh, and your ankle. She said with the luck we're having, her advice was to stay put, but of course, that was before the fire here this morning too,\" he added as we both started laughing at the hilarity of the situation. We regained our composure and Grant got up to start a bubble bath in the big claw-footed tub. Trying to take a bath with him while also trying not to get my bandaged ankle wet was quite a feat. Still, our two slippery bodies combined with his roving hands made it the best bath I had ever taken. We didn't make it back to the bed before he took me again on the bathroom counter.</p><p>Once we got cleaned up, I finally called my parents to make sure they were really okay with me missing Christmas with them. My mom reassured me it was perfectly fine. At first I was confused about her complete one eighty until I pieced together she was tickled pink that I was cooped up with Grant. I'm sure she wanted nothing more than for Grant and me to have a real relationship. I knew her too well and in her mind she saw it as a way to get me back to Woodfalls on a permanent basis. I hung up the phone, reassuring her I would call again tomorrow and then again on Christmas Day.</p><p>Grant and I finally made an appearance downstairs in the late afternoon when Doc Jones came by to check on my ankle. It was still horrifically swollen and more discolored than the day before, but I turned down more of his happy pills, settling for ibuprofen instead. He stuck around for dinner, which was steaming bowls of stew and homemade bread followed by cherry cobbler. During dinner, I learned the three other couples knew each other. They were older than we were and had no family to speak of, so they spent the holidays at Maggie's Bed and Breakfast every year.</p><p>\"It's because her cooking is out of this world,\" one of the husbands said, winking at Maggie, who blushed.</p><p>\"Even if I do set a few fires,\" Maggie joked, clearing the table. The rest of us laughed as we headed out to the living room with the coffee Maggie had prepared.</p><p>Doc Jones excused himself after one cup. \"I'll come check on you again tomorrow.\"</p><p>\"You don't have to. It's Christmas Eve,\" I protested.</p><p>\"Darling, why do you think I'll be coming by? I'm hoping Maggie will invite me over for Christmas Eve dinner,\" he said, winking at me as Maggie came in drying her hands on her apron.</p><p>\"Oh, posh. You know you're always invited. Aunt June and Uncle Tim wouldn't have it any other way,\" Maggie said, walking him to the door.</p><p>After Doc left, the rest of us sat around chatting well into the night. The other couples were all hilarious as they regaled us with their own mishaps over the years. Grant kept an arm around me the entire evening, like he was afraid I would disappear if he didn't hold me. I didn't mind at all, especially since his fingers played with the hairs at the back of my neck the entire time. Maggie noticed our closeness and gave me a wink when no one was looking. I returned her grin enjoying the moment.</p><p>Retiring for the evening, Grant and I made love for the third time on the plush carpet in front of the fireplace in our room. Unlike the previous two times, this was more of a sensual dance as we used our hands and mouths to explore each other's bodies and discover our hidden pleasures.</p><p>The next morning the sun was shining brightly for the first time in three days. I bathed solo in the tub as Grant washed my hair while I worried about keeping my bandaged foot dry. Once we were dressed, he carried me downstairs and deposited me in the living room, claiming there were a few things he needed to do. Perplexed but also intrigued, I let him have his secrets while I helped Maggie prepare some of the food for the evening. We had learned the night before that Maggie hosted a Christmas Eve party for friends and family members before they all headed off to midnight mass. She put out a buffet spread that everyone else contributed dishes to as well.</p><p>Maggie turned on Christmas carols while we worked. Even though I wasn't home in Woodfalls, it still helped make it feel special. I even found myself humming along. It was funny to think that like a Scrooge, I had fought my mom tooth and nail about coming home for Christmas. I had my reasons, but none of them seemed to matter as much anymore. That was the irony of Christmas this year. Now that I really wanted to be home, I couldn't get there. Sitting in Maggie's kitchen preparing cake pops and decorating Christmas cookies, I was reminded of the true importance of Christmas. It was all about spending time with loved ones. The essence of Christmas was happiness and togetherness. I would never forget that again. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Grant returned to the house a few hours later with a silly grin plastered to his face. He wouldn't tell me what he was up to. \"You have to wait,\" he said, smiling the entire time. I grumbled my displeasure, but it was an act. The guests began to arrive before I could quiz him any further. I was pleased to see June again, who greeted me like an old friend. She clucked sympathetically over my foot, though she pointed out if we would have listened to her in the first place, it wouldn't have happened. I had to agree with her, although having a bum ankle definitely had its perks, like being held in Grant's arms.</p><p>I lost track of Grant as more and more people came and went. Maggie and June introduced me to everyone, which was a bit overwhelming. After a while, I stopped trying to remember their names. I was in the middle of discussing my food blog with Maggie and her friends when Grant found me.</p><p>\"Are you ready for your surprise?\" he whispered in my ear.</p> <p>\"Yes,\" I shivered as his breath tickled my ear.</p><p>\"I'll bring her back in a few minutes,\" he told Maggie and her friends, scooping me up in his arms. They all sighed collectively. We paused in the hallway and he set me down to help me into my jacket before carrying me out the front door. I'm not sure what I had been expecting when he told me he had a surprise, but he managed to shock me.</p><p>Parked in front of the inn was a gorgeous Clydesdale horse attached to a beautiful carriage. Tim sat at the reigns, giving me a small wave.</p><p>\"Your carriage awaits my lady,\" Grant said, placing me in the seat before joining me on the other side. He tucked a couple blankets around our laps as Tim urged the horse to move.</p><p>\"How did you know?\" I asked.</p> <p>\"Know what?\" he asked, placing an arm around my shoulder.</p><p>\"This has always been my Christmas dream.\"</p><p>\"I knew that, Jams. Haven't you been paying attention? I remember everything, including in fourth grade when Ms. McMillan had us all write our Christmas wishes on the board. Your wish that year was to ride on a horse-drawn carriage on Christmas,\" he said.</p><p>Tears welled up in my eyes. \"You made my Christmas wish come true,\" I said, enchanted as I looked up at him. Who would have thought? Grant—the boy who had teased me and driven me insane—remembered something I had wished for almost fifteen years ago. A tear escaped my overflowing eyes. Grant caught it with his thumb.</p><p>\"Jams, I want to make all your wishes come true. Merry Christmas,\" he said, capturing my mouth with his.</p><p>I didn't tell him he already had.</p>  </body></html>"]