["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>He hadn’t expected her to be dead.</p><p>Jamie O’Connell narrowed his eyes as he studied the still woman before him. Her body had been placed—very carefully, he had no doubt of that—in the middle of a large bed. White, gossamer curtains billowed around the bed, looking like thin spider webs that had been spun to shield her body.</p><p>“This is a bad idea,” Sean Whelen, Jamie’s first in command, muttered as he grabbed Jamie’s arm. “There’s a reason she’s under, man. The woman is evil.”</p> <p>She didn’t look evil. She looked...beautiful.</p><p>Jamie shook off Sean’s hold. The guy swore but stepped back as Jamie shoved away those too-thin curtains and let his gaze sweep over the prize he’d sought for so long.</p><p>The woman was pale, but that was expected of her kind. It wasn’t like she would have been a fan of sunbathing even before she’d succumbed to the curse that had locked her body. Her hair was long and dark, lustrous and gleaming against the bedding. A silken, white dress covered her, skimming over what he could see were ample breasts and the kind of hips he’d always enjoyed holding tight.</p><p>“We’re going to die,” Sean told him, voice definite. “Probably in the next five minutes. Some horrible, painful death.”</p><p>Jamie tossed him a glare. “Not helping.”</p> <p>Sean rocked back on his heels.</p><p>“And it’s not like we have a choice,” Jamie muttered. Hell. He didn’t want to do this. Waking the woman known as the Blood Queen wasn’t exactly something that Jamie had ever thought he’d do.</p><p>But sometimes, a werewolf could sure get desperate. Especially when the lives of his remaining packmates were on the line.</p><p>So he put his hands on her body. Ice cold. Figured.</p><p>“She’s not breathing, is she?” As usual, Sean kept talking.</p><p>But this time, the guy was right. “No.” That was why she looked...dead. When he’d first heard the story about the Blood Queen, he’d just thought it was bullshit.</p> <p>He wasn’t staring at bullshit.</p><p>He’d had to kill his way through half a dozen paranormal bastards in order to get to her. Their blood still stained his clothes. But if the woman before him could really do what he thought, then the hell he’d walked through would be worth it.</p><p>His fingers skimmed down the delicate curve of her cheek. She certainly didn’t look like the walking nightmare rumors whispered about in the dark. Her chin was a little pointed, her lips sensual and full—and red. Long lashes cast faint shadows on her cheeks, and Jamie wondered what color her eyes would be.</p><p>Since he planned on waking her up real soon, Jamie knew he was about to find out.</p><p>He lifted his hand away from her face and claws ripped from his fingertips. “Go outside,” Jamie ordered Sean. “Guard the door, just in case...”</p><p>“Uh, yeah, in case the crazy bitch gets loose and kills you?”</p><p>No. He wasn’t worried about that. Jamie had this, her. “In case we’ve been tracked. I don’t want anyone stopping me. Not until I’ve put the bond in place.”</p><p>Silence.</p> <p>Then Sean gave a low whistle. “You’re...really going to do it?”</p><p>What, did Sean think he’d gone to all this trouble for the hell of it? Shits and grins?</p><p>“You know...you know what will happen to her if you do this, Jamie.”</p><p>Now Sean almost sounded sorry for the “crazy bitch” in question. Jamie forced a shrug. “And I know what will happen to me.” He turned his head and met Sean’s dark stare. “I’ll make my pack stronger.”</p><p>The pack was all that mattered.</p><p>He’d returned to the pack just one year before and found them under attack. An attack that had come from within. Men, women—they’d been brutally killed. The pack had dwindled down to just six—six—werewolves.</p><p>There would be no more deaths in the O’Connell pack. But the pack...oh, yes, the pack would have its vengeance.</p><p>His gaze turned back to the woman. Hello, vengeance.</p><p>She didn’t stir.</p><p>“Go outside,” Jamie ordered again.</p><p>This time, Sean obeyed. Jamie heard the shuffle of Sean’s boots over the dusty floor and the creak of the old door as it slid closed.</p><p>Then he was alone with the prey that he’d sought for the last six months. The instrument of his revenge.</p><p>He raised his right hand, and his claws slashed across his left wrist. Blood welled, dripped. Clenching his teeth, Jamie put his hand over the woman’s mouth and he waited.</p><p>The seconds ticked by as his heartbeat thundered in his ears.</p><p>And nothing happened.</p><p>Jamie lifted his hand. Blood had smeared over her lips. He leaned toward her. His index finger pushed lightly inside her mouth as he searched for the fangs that should have been there.</p><p>Only they weren’t. The woman had perfectly normal, human teeth. No fangs.</p><p>He pulled back. The wound he’d made on his wrist throbbed with a dull ache, but he ignored it. Pain didn’t matter. Never had, to him. Frowning, he put his hand on her chest. He didn’t feel a heartbeat. Despite what humans believed, the hearts of vampires actually did beat.</p><p>Only her heart was ominously still.</p><p>His back teeth ground together. “Maybe you are dead,” he gritted out.</p><p>The Blood Queen had been under a spell for the last fifteen years. A spell, a curse, same damn thing to him.</p><p>The blood of a werewolf had put her under—that blood had frozen her body and locked the spell’s magic in place.</p><p>And the blood of a werewolf was supposed to wake her. Only she wasn’t waking up.</p><p>Hell. So much for his big, secret weapon. Jamie would just have to find another way to destroy Latham and—</p><p>She had golden eyes. Dark, deep golden eyes.</p><p>“I’m not...dead,” she said, her voice a husky purr that actually seemed to roll through him, “but you...are.” And her hand flashed up. The woman was strong—far stronger than he’d expected—and she grabbed him by the shoulder and yanked him toward her.</p><p>Then her mouth, her very sharp teeth, bit into his throat.</p><p>Instead of being afraid, Jamie smiled and let the Blood Queen taste him.</p><p>Drink up, baby. It’s your funeral. Because with every drop of blood that she took in these first moments, she was just locking herself to him ever more deeply. Bonding them, body to body, blood to blood, until there would be no escape. Not for either of them.</p><p>His claws dug into the sheets as he held his body perfectly still.</p><p>Revenge would sure be one bloody bitch.</p><p>Latham, get ready to die.</p><p>Don’t kill him.</p><p>The whisper slid through the shattered remains of Iona’s mind. His blood was in her mouth, flowing like rich bliss over her tongue. His hot, strong body was against hers, and...</p><p>Her heart was beating. Hard, pounding beats that seemed to tremble through her. She could feel and hear every single beat.</p><p>Her teeth pressed into him. She was probably hurting this man, but she couldn’t seem to stop herself. She was starving. Had been starving, for so very long.</p><p>Pull back. Don’t kill.</p><p>But it was so hard to keep her control.</p><p>Her heart beat was growing faster. She could feel the power of his blood sliding through her body. Giving her strength when before there had been only weakness. There’d been...nothing.</p><p>“I think that’s enough.” His voice was low, deep, and tinged with the faintest brush of an Irish accent.</p><p>She ignored his words. Iona hadn’t enjoyed her fill of him yet and—</p><p>“I said...enough.” His hands, big, powerful, caught her shoulders and shoved her away. Her back hit the wooden headboard of the bed, and she blinked up at him.</p><p>“If you drain me, then this little deal isn’t going to work.”</p><p>She licked her lips and still tasted him. Maybe it was because she’d gone without blood for so long, but the man—he’d tasted incredible. Fresh. Wild. Spicy.</p><p>She’d like more.</p><p>When Iona tried to lunge forward, his hands just tightened around her shoulders, and he kept her pinned against the bed’s head-board. “Not so fast, baby.”</p><p>Baby? Her eyes narrowed and she actually managed to focus and look up at his face.</p><p>Hard angles. Brutal cheekbones. A sharp nose. Lips that were...sexy.</p><p>Her breath whispered out.</p><p>There were faint scars on his left cheek. Old. Little ridges that raised the flesh and gave him a tough, dangerous appearance.</p><p>She’d always enjoyed danger.</p><p>Until that lust for danger sent me to hell.</p><p>His hair was dark, even darker than her own. Light drifted through the window on the far right. Light. Actual light! And with that light, she saw only pure black in his hair. His eyes—a sharp, intense green—were a bright contrast to that thick darkness.</p><p>“You settlin’ down?” he demanded and that faint Irish burr rolled beneath his words. Some might not have even noticed that slight accent.</p><p>Iona wasn’t some.</p><p>She was also hardly settling down.</p><p>But...how did he hold her back so easily? She’d taken a lot of blood from him during that frenzied feeding. He should be weak.</p><p>If he were human, he would be unconscious.</p><p>Just what type of creature was he?</p><p>His gaze flickered over her. Blood—his—had dripped onto her dress.</p><p>Her heart beat had finally dimmed. Her heart still raced just as frantically in her chest, but the thunderous booms didn’t threaten to burst her ears any longer. Her heartbeat had been the first sound she’d stopped hearing.</p><p>Listen, Iona...listen to these last, desperate beats.</p><p>Thud.</p><p>Thud.</p><p>Do you hear them? They’re slowing. Soon, they’ll stop.</p><p>Thud.</p><p>And you’ll never hear your heart beat again.</p><p>As that memory whispered through her mind, a scream broke from her and Iona lunged upward as she battled the ghost from her past. Her nails turned into claws, and she attacked the man before her. She swiped out, catching him across the chest and then tossing him aside.</p><p>In the next instant, she was on her feet. The long dress tangled around her legs and she ripped the fabric away from her thighs as she lunged for the door and sweet, sweet freedom.</p><p>Get out. The walls wouldn’t hold her prisoner any longer. She wouldn’t hear the rustle of insects or the scuttle of rats or the whisper of the wind or—</p><p>Iona yanked open the heavy metal door, nearly tearing it right from its hinges.</p><p>Another man whirled to face her. His handsome face tightened when he saw her and claws broke from his nails. Long, razor-sharp claws that could have passed for knives. Claws that were much bigger and shaper than the talon-like ones that she possessed.</p><p>Werewolf.</p><p>Rage filled her, blocking all other thought. The room faded in focus around her. She could only see him. The beast. The monster.</p><p>Just like the one who’d imprisoned her.</p><p>“Die.” Her whisper. Her voice was broken. She was broken. But killing the wolf could help to make her whole. This man—this werewolf—he hadn’t been the one to save her. Not like the other one. He hadn’t brought her back. So there was no remorse in her, no phantom urge to protect him as she grabbed his head and twisted his neck to the side.</p><p>Then she felt claws circle her own throat.</p><p>“He can be an asshole sometimes, but I can’t let you kill him.”</p><p>The other man. Irish. And had he said asshole or arsehole? With the Irish thickening in his voice, she couldn’t tell for sure. Not that it mattered. What mattered was...</p><p>Her rescuer had...claws, too. Werewolf. Two werewolves.</p><p>She freed the fool at the door even as she began to plan her next attack.</p><p>“Get out of here, Sean,” Irish said.</p><p>The one called Sean scrambled back and jerked the door closed as he left.</p><p>Her captor kept his claws at her throat and slowly forced her to turn and face him. Blood soaked his shirt and that sweet scent tempted her. Iona’s fangs were out, and her body, so long starved for nourishment, shuddered with longing.</p><p>Another taste.</p><p>If he didn’t kill her, she’d get that taste. As weak as she was, even a mangy wolf might be able to take her out.</p><p>Maybe.</p><p>“I want my taste, too.”</p><p>She had no idea what he was talking about.</p><p>His green eyes seemed to burn into hers. “I bled for you, and now it’s your turn.”</p><p>The claws at her neck slid across her skin. The pain was brief, a prick that she almost didn’t even feel, but then he was pulling her closer. Wrapping his arms around her, and because the man was huge—towering far over six feet—he lifted her up against him so that her toes barely touched the ground.</p><p>Then he put his mouth on her throat and he...he licked her skin. Her breath shuddered out of her. Iona knew she should fight, but her legs were still weak. She ached. She...</p><p>Liked the feel of his mouth on her.</p><p>“Mmmm...didn’t expect that,” the man murmured against her skin.</p><p>Her eyes were wide open, staring behind him at the bed that had been her jail cell.</p><p>How long had she been there? So long that she’d gone crazy enough to let a wolf put his paws on her.</p><p>“Re...lease me...” Her voice was hushed, so raspy. Her throat ached when she spoke, but the blood would heal her. Soon enough. “Or...die.”</p><p>His tongue slid over her skin. Did he—did he press a kiss to her throat before his head lifted? It felt as if he had. “Easy. I barely took a sip from you.” One dark brow rose as he offered her a half-smile that flashed a dimple in his cheek. “While you guzzled me like a frat boy with a new keg.”</p><p>A frat...? Her eyes slit and she forced herself to speak again, “Re...lease...” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Right, right...” He dropped his hands and moved back a step. “Happy now?”</p><p>Her teeth snapped together. Happy wasn’t exactly a part of her vocabulary.</p><p>The man raised his hands. “I’m guessing that’s a no?”</p> <p>“Who are...you?” Her voice was a bit stronger now. Good.</p><p>“I’m the man who saved your sweet ass.” Definitely sounded like arse that time.</p><p>Her gaze swept over him. “Not...man.” Men didn’t have claws. Men didn’t drink blood.</p><p>He shrugged. “True enough. I’m more than just a man.” A brief pause. “I’m a werewolf.”</p><p>“So...you’re dead...” A threat because...he would be. Vampires and werewolves didn’t mix. She’d tried that path once upon a bloody time. Hell had been her reward.</p> <p>“Not quite.” That grin came again. His dimple winked. “I’m the hero who just rescued you.”</p><p>Werewolves weren’t heroes. They were the monsters in all the stories. All of her stories, anyway.</p><p>“And I’m the guy who can give you exactly what you want.”</p><p>He didn’t know her. How could he possibly know what she wanted? Her lips parted and she sucked in a deep breath. Then she realized what she was doing. Air. Wonderful, precious air. Her lungs had been starved, for so long. She actually felt a bit dizzy as she pulled in more of that delicious air.</p><p>His eyes were on her, watching her far too closely, and then the guy said, “I can give you Latham, and I’ll even help you to cut the bastard’s head off.”</p><p>Okay. Perhaps...maybe...this stranger did know what she wanted, after all.</p> <p>She’d let him keep living a bit longer.</p><p>Latham. The name had burned itself in her memory. Latham Gentry was the wolf responsible for sending her to hell. “Who are you?” Iona asked again. Her speech was improving by the second. Good thing she’d always been a fast healer.</p><p>“My name’s Jamie O’Connell.”</p><p>The name meant nothing to her. It was Irish. So was he. In all her very long life, she’d never met Jamie O’Connell before.</p><p>Not until she’d opened her eyes and tasted his blood.</p><p>Now that she knew him, Iona realized she’d never forget the werewolf. His memory would stay with her long after he was dead.</p><p>“Just give me a little time,” Jamie said as he nodded his dark head, “and I’ll lead you right to Latham.”</p><p>She stared at him. The werewolf was trying to offer her some sort of deal. She didn’t do deals. “You brought me back.” He’d given her the blood she needed to break whatever wretched curse Latham had used on her.</p> <p>Jamie inclined his head toward her. She figured that was an agreement.</p><p>She’d once vowed to destroy the werewolves, to take them out...one by one.</p><p>But this man, this werewolf, he’d given her life. Killing him then, well, it didn’t exactly seem right. “Count yourself lucky, wolf.” She brushed by him and headed for the window. The only window in that narrow room. As she walked into the ray of light that spilled through the glass, the sunlight felt wonderfully warm on her chilled skin.</p><p>Most vampires hated the light.</p><p>Not Iona.</p><p>She’d been in the darkness for so long that she was desperate for that light. She pressed her palm to the windowpane. Beyond that glass, she saw the rough edges of the cliffs that waited outside. Heard the crash of waves. Water seemed to surround her.</p><p>Figured, water would be needed for a holding spell.</p><p>The werewolf and his damn witch. She’d find them both. Make them bleed and beg.</p><p>But first, she had to deal with this werewolf. “Good-bye, Jamie O’Connell,” Iona said, without bothering to look back at him. Then she slammed her hand through the glass. The window shattered and broken glass rained down on the floor—and fell outside of the window.</p><p>Jamie called out her name, but she didn’t stop. In an instant, she’d leapt through that window, and she was rushing for her freedom. She was an old vampire, one gifted with powers that few others could ever hope to possess.</p><p>She’d been born as a vampire. Born to a father who wanted the power of the gods.</p><p>He’d gotten her instead.</p><p>She leapt over the rocky terrain. Stared at the water that seemed to howl and snarl below her.</p><p>“Stop!”</p><p>The dark werewolf, giving chase. She paused at the edge of the cliff.</p><p>“What are you doing?” He demanded as he rushed after her. “Do you want to die?”</p><p>She laughed then, and the sound was as brittle as her voice. Iona glanced over her shoulder at him. “I’ve been dead for too long.” And she wanted to wash away the rot and stench of the hell that had trapped her. “It’s time for me to live again.”</p><p>And when the Blood Queen lived, everyone else should fear.</p><p>Lifting her hands high above her, Iona turned back to the crashing waves. Then she stepped off the edge of the cliff and plummeted into the dark water below her.</p><p>Footsteps pounded behind Jamie as he peered over the edge of the cliff. Hell, that was at least a thirty foot drop. Forty?</p><p>The water roared below him.</p><p>“Are you going after her?” Sean asked as the younger wolf huffed to a stop beside him.</p><p>Her head had just broken through the foaming waves. While Jamie watched, the vampire called Iona began to swim through the churning tide, taking her sweet time as she moved easily through the water.</p><p>Amazing.</p><p>In-freaking-sane.</p><p>Jaw clenching, he gritted, “No.” Because, unlike the vamp, he wasn’t ready to risk having his body savaged by the rocks and the waves and whatever the hell else waited below.</p><p>“She’s getting away,” Sean said, pointing out the obvious. He had an annoying tendency to do that.</p><p>Jamie slanted the guy a hard glance. Sean should be glad the lady was swimming away. Especially considering that the vampire in question had been close to ending Sean’s life just minutes before.</p><p>Then Sean gave a slow shake of his head and met Jamie’s gaze. “That didn’t go quite as we planned, did it?”</p><p>He re-assessed his grand plan. Iona was a strong swimmer. Correction, she was just plain strong. Ten minutes after waking, and the woman was cutting through the water like an Olympic swimmer. Very interesting. Very promising. Jamie smiled and let his anger wash away. “It went even better than I’d planned.” The Blood Queen...Iona...she’d definitely lived up to the stories that he’d heard.</p><p>Iona. Her name whispered through his mind. Beautiful. Seductive. A perfect name for his vampire. Before, he hadn’t been able to match that name with a face. Now he knew just what she looked like. It would be impossible to ever forget a woman like her.</p><p>He glanced down at the water once more. Then, because he knew where the vampire would go, Jamie turned away from the cliff. Iona thought she was safe. That she was still the paranormal bad-ass that others had to fear.</p><p>Once she got to town, she’d see that the rules of the game had changed. She wouldn’t be getting away from him.</p><p>Not now.</p><p>Not ever.</p><p>The bond he’d forged with her could never be broken. At least, not if the vampire wanted to keep living.</p><p>Chapter Two</p><p>As far as hunting prospects were concerned, the small coastal town of Shade, Oregon, wasn’t exactly ripe with possibilities. Two bars—both rundown as all hell and faded from time—blasted music into the night.</p><p>Just two.</p><p>When Iona turned up, Jamie knew she’d head to one of those bars. He just had to make sure he chose the right hunting spot in order to catch her.</p><p>The music kept playing. Some young band danced across the stage while girls in low-cut tops swayed in their seats. The alcohol was pouring, laughter floated in the air, and as the darkness deepened outside, not one of the humans there seemed to realize the danger that stalked them.</p><p>Humans. They could be so oblivious. Maybe that was why they still thought vampires and werewolves existed only in movies and nightmares.</p><p>Jamie tapped the counter and the bartender slid him another beer.</p><p>Not just in movies, kids. We’re right in front of you. He drained the beer in two gulps.</p><p>Now, to just find Iona...</p><p>Jamie put his back to the bar and propped his elbows on the countertop behind him. His gaze swept the crowd once more and...</p><p>She walked in.</p><p>Not still clad in her blood-stained gown, but wearing jeans that curled around her legs, high hells that clicked across the floor, and a tight, black t-shirt that pushed her breasts forward and had three men scrambling eagerly toward her.</p><p>Hell.</p><p>Iona smiled, and Jamie saw that she was careful not to flash any fang. For the moment.</p><p>But then she took the hand of one of the fools who had rushed toward her, and she began to lead the guy back outside. Talk about your easy prey. Jamie was almost tempted to let the dumb kid die.</p><p>Almost. Stupidity shouldn’t be a crime punishable by death.</p><p>He tossed some cash down on the bar and stalked after his Blood Queen.</p><p>Bodies jostled into him as he made his way through the bar, but he just shoved those bodies the hell out of his way. In moments, he was outside and the bar’s main door slammed closed behind him. The scent of the ocean teased his nose as the wind blew lightly against him. Wind that carried not just the salt of the ocean, but the coppery odor of blood.</p><p>His claws wanted to break free. The beast inside roared, but Jamie yanked back on his wolf’s chain. Holding tight to his control, Jamie followed the scent of blood, rounded the building and saw—</p><p>The kid—some college-aged guy with sun-streaked blond hair—was pressed up against the side of the building. Iona had her hands on his chest. The jerk was moaning and her fangs were in his throat. Jamie’s teeth ground together as he rushed toward them.</p><p>But before he could grab Iona, she fell away from the guy and hit the ground, hard. Her body began to shake as she wiped her hand over her mouth. “Poi...son...”</p><p>The blond wasn’t moving. He lifted a hand to his throat and touched the faint wound on his neck. “Wh—”</p><p>Jamie lunged forward and grabbed the blond by the shoulder. “Get the hell out of here.”</p><p>The guy’s eyes widened, but, despite the fear Jamie could smell, the fellow shook his head and glanced over at Iona. “She’s hurt. I-I should help...”</p><p>The dumbass didn’t seem to get that Iona had just tried to eat him. And now he wanted to play Galahad. Figured. Hero complexes. Jamie sure didn’t suffer from them. “Get out of here, or I’ll just knock your ass out.” Jamie lifted his fist. One punch, and Galahad wouldn’t be waking up for hours.</p><p>Galahad swallowed. “I-I—”</p><p>Iona was back on her feet. “You burned me!” She yelled, then she leapt at her would-be-snack.</p><p>Jamie caught her before she could do any permanent damage to Galahad. “Go,” he bit off to the fool. “Now.”</p><p>Finally, Galahad left. Iona twisted and bucked in Jamie’s arms, and he was sure that she didn’t mean to turn him on. The woman seemed far too furious, but, damn, her curves were fine and when she kept rubbing that ass right over his groin...</p><p>His eyes squeezed closed. Fucking her hadn’t been part of his plan. This hard lust? No, not the plan. He wasn’t supposed to want her so badly. Use her to hunt his enemy? Yes, that was definitely on his agenda. Wanting to strip her and explore that silken body for hours? No, not the plan.</p><p>His plans just kept changing.</p><p>But then she stopped struggling. Iona just seemed to go limp in his arms. Her head sagged forward.</p><p>Uh, oh. He wasn’t sure just what kind of damage the guy’s blood might have done to her. Jamie knew that he probably should have warned her about that little, ah, issue, but she’d run before he could break the news to her.</p><p>“Iona?” He turned her in his arms, moving her so that Iona’s chest pressed against his. Her eyes were closed. He bent over her, wondering what to do next.</p><p>Her eyes flew open. Too aware. Too...hungry. And rather pissed. In a flash, she’d bolted up and her teeth were on his throat. No, in his throat.</p><p>His breath hissed out, but it wasn’t pain that he felt. Her fangs sliced through the skin in an instant, and the only sensation he felt was a burst of pleasure so intense that his whole body shuddered. More of that. Oh, yeah. More.</p><p>She was drinking from him, and every soft move of her lips had his body tensing even more. Growing harder. His cock was swollen, fully aroused, and hot pulses of pleasure lit his blood as her mouth worked on his neck.</p><p>Keeping his hands on her hips, he maneuvered her back, then she was the one pinned against the side of the building. He tilted his head, trying to give her better access because, hell, yes, he was loving this rough ride of pleasure. And the blood that she took...</p><p>It links us more.</p><p>His fingers slid around to the front of her jeans. Found the snap and jerked it free. Her zipper hissed down.</p><p>Her tongue licked over him.</p><p>He wanted to touch her skin. Wanted to touch her everywhere so he could discover just how soft she’d be.</p><p>Her body trembled against him. “You...you taste so good.” Her soft words were whispered against his neck.</p><p>He was betting that she’d taste like paradise.</p><p>“He tasted like acid, but you...” Now her voice wasn’t so whispered. It was snapping. Angry as awareness grew within her. Her fingers curled over his shoulders, and she pushed him back, just far enough that she could see up into his eyes. “You taste like dessert.”</p><p>Her little pink tongue slid over her bottom lip. As if she were savoring his taste.</p><p>Dangerous. The woman was lethal in more ways than he’d realized. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her eyes—he could see them perfectly in the dark, a werewolf perk—narrowed on him. “Why do you taste like dessert?” Iona wanted to know.</p><p>He deliberately let his eyes widen. “Because I’m awesome?”</p><p>Her eyes had become golden slits. “What have you done?”</p> <p>Aw, their hot moment was about to be over. Pity. His hand was still just inside of her jeans. So close to the flesh he wanted to touch.</p><p>She seemed to realize exactly how close his fingers were to her sex because she gave a little growl and pushed him back a good five feet.</p><p>Not inside her jeans anymore.</p><p>Iona yanked up the zipper and fixed the snap in an instant. “You thought to fuck me?”</p><p>Hoped, not thought, but he lifted his hands and shrugged. “You thought to drain me?” Jamie tossed back.</p> <p>She growled again. Sexy. “Wolf,” she snarled, “I gave you a chance to live. You should have just stayed away from me.”</p><p>“Can’t do that.” Time for her to realize just how much her life had changed. “If I do, you die.”</p><p>She laughed at that. “What? Are you some sort of protector?”</p><p>Not hardly.</p><p>“Are you going to keep me safe from all the other big, bad wolves out there?”</p><p>“No.” Flat.</p> <p>She blinked at that. A faint furrow appeared between her brows.</p><p>Jamie rubbed his chin. Time for some fast facts. “The human tasted like crap to you because you can’t handle his blood—”</p><p>“I’m a vampire,” said with a long sigh, as if speaking to a clueless child, “I can handle anyone’s blood.”</p><p>He risked a step toward her. His boots crunched on the gravel beneath him. “Not anymore you can’t.” Okay, she’d flip over this, but he figured it was best to just get it out there. “You see, your body’s tuned now. It’s only gonna want one thing. Can only accept one thing...”</p><p>Her head tilted as she studied him. “Tuned?” Her lips tightened in distaste. “I don’t know what you’re rambling about.”</p><p>“To survive, you need blood.” It was a simple fact of the undead life for a vampire. To keep existing, a vampire had to take in sustenance. Blood. And, usually, any blood would work to sustain a vamp.</p><p>But not for her. Not anymore.</p><p>“You were put under a spell,” he said this part quietly, with a hint of sympathy, because the spell had been a real bitch for her.</p> <p>Her hands fisted. “I was there. I remember. You don’t have to tell me, wolf.”</p><p>The woman had more than a touch of arrogance. Probably because, if the stories were true, she actually had once been a queen.</p><p>“An alpha werewolf’s blood put you under the spell.” Here was the dicey part. But, really, what could she do to him? Without just hurting herself in return? “That meant only the blood of another alpha wolf could wake you.” And break the spell.</p><p>“So you’re an alpha. I’m so impressed,” she murmured, sounding not even the tiniest bit like she cared. A car horn honked in the distance. The wind kept brushing over them. Near the back of the bar, a chime tossed music into the air. Iona shoved back her hair. “It’s not like I haven’t met and killed a dozen of your kind before.”</p><p>Except for Latham. She hadn’t killed him. If she had, then neither of them would be having these problems right then.</p><p>“There was just one little rule about breaking your spell...” Jamie kept his voice flat when his own anger wanted to stir. He had helped the woman. As far as she knew, he was just being a good Samaritan. Had Iona even offered a thank you to him? He cleared his throat. “The wolf that woke you...”</p><p>“I wasn’t asleep!”</p><p>He ignored that, for now. She’d sure looked asleep—no, dead—to him. “You’d only crave the blood of the wolf that freed you from the spell.” He studied her, then said, “‘It will taste like wine to you...’” Now he was doing a direct quote from what a witch-in-the-know had told him during his search for the Blood Queen. Before Iona speak, he finished the last of that witch’s quote, “‘While the blood of others will never satisfy your hunger.’”</p><p>She grabbed him. In all of his years, he’d never seen a vampire move as quickly as she did in that one instant. “You’d better by lying.” Her fists had clenched around his shirt. The material was in danger of ripping at any moment.</p><p>He gave her a big smile, knowing that his dimple would flash. “Baby, would I lie to you? I’m the wolf who saved you.”</p><p>Her fists clenched even harder as she dug her nails into his shirt.</p><p>He kept his eyes on hers. Jamie said, “I’m also the man who’ll keep you alive. My blood. It’s what you need. What you’ll always crave.” He felt like he was driving nails into the vamp’s coffin. In a way, he was. He was also enjoying himself. Iona was about to realize just how much she needed him. “So it’s in your best interest to make sure that I live a very, very long life.”</p><p>The shirt began to tear. “You’ll never live as long as me.”</p><p>Normally, no. But their situation wasn’t exactly normal. “I will live as long as you give me your own sweet blood.” The beast inside had always enjoyed a taste for blood. And hers blood was the most powerful that he’d ever had.</p><p>Her gaze held his. “You want my blood?”</p><p>“I kinda have to get it, in order for us both to keep living.” He kept his face blank. She couldn’t know the real reason why he wanted her blood. That wonderful power boost that he’d get from it. The boost that would make him strong enough to take out Latham.</p><p>Because Latham had also been feeding on vamps.</p><p>The secret was out in the paranormal world. Thanks to the mating of a few werewolves and vampires, folks had realized that if you wanted a power surge, you had to get very, very intimate with those who’d once been your sworn enemies.</p><p>Since Iona had been sleeping during that time of revelation, she didn’t realize just how hot of a commodity her blood had become to the werewolves of the world.</p><p>Blood as old as hers, as powerful...and it’s all mine.</p><p>Jamie knew his smile had widened. He couldn’t help it. Everything was falling into perfect place for him.</p><p>“Liar.” Barely a breath from her. A breath that was full of burning fury. “One bad human doesn’t mean I’m stuck with you. He was probably on drugs. I always hated the taste of drugs in a human’s blood.”</p><p>But she wasn’t letting him go, and Jamie wondered if, deep down, she already knew the truth.</p><p>Then he caught the scent of blood. Heard the softest tread of footsteps. His head jerked up. His nostrils flared.</p><p>Five men. Though not actually men. Not human.</p><p>Coming their way.</p><p>The same knowledge was in her eyes.</p><p>“Company,” he told her as he drew in the scents of the night.</p><p>Her head turned to the left, away from the faint lights from the parking lot and toward the darkness of the woods that waited. Her body seemed to tense against his. “Yours?”</p><p>“No.” But it was company he’d expected. Just not quite so soon. “Don’t worry,” he told her, as he pushed her behind his body. She went easily enough, probably more from surprise than anything else. “I won’t let them hurt you.”</p><p>Five against one. He could handle these odds in his sleep.</p><p>Especially since he’d taken some of her blood. Hmmm...maybe he could even consider this as a test run. To see just how much strength her blood would truly give him.</p><p>The others were coming in fast now. Time to change. Time to show Iona just who—what—she was dealing with in this battle.</p><p>The fire of the change swept through his body. It wasn’t some light, easy shift. It was brutal. As savage as the beast he carried. His bones snapped. His muscles tore and reshaped. Fur seemed to explode along his flesh. He hit the ground, but when his palms slapped against the cement, they were already transforming into the powerful paws of a wolf.</p><p>Iona stood behind him, and the fast pants of her breath echoed in his ears.</p><p>The werewolves were coming for her. He knew it. Once the spell holding Iona had broken, Latham’s witch would have told him the news. And Latham would have sent out his attack dogs.</p><p>Too bad. You can’t have her back.</p><p>Their “company” broke from the trees. Two black wolves. Two gray. One white.</p><p>Latham’s foot soldiers—wolf soldiers.</p><p>Jamie barred his teeth and didn’t wait for them to come lunging at him in an attack. He sprang toward them, more than ready to draw first blood.</p><p>The sounds of the vicious snarls and howls filled her ears. The waves were crashing close by, and the music still blared from the bar, so the humans probably weren’t even aware of the bloody battle going on so close to their safe little world.</p><p>Iona was too aware.</p><p>Jamie wasn’t a man any longer. But she knew that, in truth, he’d never been a man. That had just been a surface lie. Werewolves were always more beasts than men.</p><p>He was in the form of a big, fierce, black wolf now. A wolf that was easily twice the size of the others he attacked. A wolf that drew blood with his claws and his razor-sharp teeth and seemed to love the savagery of the fight.</p><p>No hesitation. No fear.</p><p>Two of his enemies were already on the ground.</p><p>A third would be out of the battle soon.</p><p>It appeared that Jamie was a true werewolf alpha.</p><p>Iona turned away from the battle. Alphas had always annoyed her. Maybe because she liked to be the alpha, too.</p><p>Whatever. She would leave Jamie’s lying beast to his own ends. He could handle the others—and she could find a human to eat. I’ll prove him wrong.</p><p>She just needed more blood. There was still a weakness in her limbs that she couldn’t allow. When she faced Latham—oh, I’ll see you dead soon—she had to be at full strength.</p><p>A wolf’s sharp cry pierced the air behind her. For just an instant, she hesitated and looked back. Jamie had taken out the white wolf. The beast was on his side, and she knew the dark shadow spreading on his coat was blood.</p><p>Jamie stood over his fallen prey, with his big body heaving. The wolf’s eyes—that same, piercing green—were on her.</p><p>I won’t let them hurt you. His words whispered through her mind.</p><p>As if she needed his protection. Her chin lifted. She’d walk back into the bar. Find another, non-drugged man to sample, and Jamie could fight his little blood battles.</p><p>A familiar scent teased her nose. Iona’s body stiffened.</p><p>Then a rumble of thunder broke the air. Jamie—his wolf—staggered back. More thunder rumbled. No, not thunder, a gunshot. Jamie hit the ground.</p><p>She was running toward him before she’d even realized what was happening. The other wolves had scattered back, but when they saw her rushing forward, the grey beast tossed his head and howled.</p><p>Blood.</p><p>And...Iona inhaled deeply, wondering about that other heavy, too thick scent in the air. A scent that was metallic, like...</p><p>Jamie was shifting before her. She’d never seen a wolf shift so quickly. Except for one time when her vamp coven had attacked invading wolves with silver. Silver could always force a fast change for a werewolf.</p><p>The beast was gone. On the ground, Jamie sprawled as a man. Bullet holes were in his chest. Her eyesight was perfect in the dark, probably even better than his, and Iona saw that he appeared to be bleeding in rivulets of silver.</p><p>Liquid silver? Was that the weapon of choice against werewolves these days?</p><p>Jamie’s claws drove into his own chest, and he yanked out a handful of silver. A brutal move that had the breath freezing in her lungs. Then he did it again, to the other bullet hole.</p><p>“Can’t...get it all...” His voice was barely human. “Liquid...in my blood...”</p><p>Yes, it would be. Unlike a solid silver bullet, the liquid silver would pour through him.</p><p>“I’ll...die...”</p><p>She realized that his head was in her lap. Iona didn’t remember sliding her knees under him. Why had she even come to check on him? The shooter could still be out there. The shooter could come for her.</p><p>She should run. Leave. Hunt.</p><p>Not lean over him and brush the hair from his forehead, but, sure enough, she saw her own trembling fingers sliding thought that thick, dark hair.</p><p>What is wrong with me?</p><p>“If I die...” It certainly looked like the wolf was close to death. Jamie growled, then managed, “So...do you...”</p><p>She gazed down at him. She knew what others said about her. She was evil. Wicked. Without a soul.</p><p>And maybe some of those stories were true. But in this one instance...</p><p>Iona brushed her lips over his. A soft kiss. Gentle. Their first kiss.</p><p>It seemed strange to have it here, with blood around them.</p><p>It seemed strange to have the kiss after she’d already taken his blood.</p><p>But maybe it was fitting.</p><p>The kiss was light, but she enjoyed the taste of his lips almost as much as she’d enjoyed his blood.</p><p>Perhaps the werewolf could prove to be addictive to her.</p><p>And, maybe, she’d show him just how addictive she could be.</p><p>Her mouth lifted from his, a few inches. “What makes you think...” Iona asked him quietly, “that I would let you die by any hand other than my own?”</p><p>Then she lifted her hand. Brought it to her mouth. Sliced the flesh with her teeth, then offered her wrist to him.</p><p>When he drank, she understood that Jamie wasn’t like the others. For some reason, he’d touched a part of her that she’d buried deep inside. The human part. The part that wouldn’t let a man die before her eyes. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not a man who’d saved her. Who’d tried to protect her.</p><p>I won’t let them hurt you.</p><p>Funny. No one had ever tried to protect her. Not even her father. No, he’d been the one to tie her to the stake on her twenty-fifth birthday. The day he’d realized she wasn’t aging as she should.</p> <p>He’d tied her to the stake and carried the torch that had started the blaze around her. She’d screamed and begged him to stop. He hadn’t.</p><p>Too bad for him, she’d been strong enough to break free of the bonds that held her. Burned, savaged, she’d escaped.</p><p>Later, she’d gone back for him.</p><p>Jamie’s hand lifted and locked around her wrist as he took her blood. As far as she knew, only one other werewolf had ever tasted her blood.</p><p>That was the werewolf who’d locked her in that horrible house. Made her a prisoner in her own body.</p> <p>The same werewolf that had been there tonight because, right before the first bullet had slammed into Jamie, she’d caught Latham’s scent.</p><p>Her gaze lifted to the woods once more. The scent was gone now, but it didn’t matter. Latham knew she was free—and she, well, she knew that he’d soon be one very dead wolf.</p><p>The fool had freed her. Latham raced through the woods, his packmates close to his sides. They were bleeding, and he knew that Jamie would track the scent of the blood.</p><p>Jamie thought he was such a fine tracker.</p><p>They burst from the woods. Two black SUVs were waiting for him. Latham rushed into the first SUV, the gun a heavy weight in his gloved hand. The silver bullets should have taken out his rival, but Latham had missed Jamie’s heart because he’d been distracted.</p><p>By her.</p> <p>The witch was waiting for him in the SUV. Unlike the other werewolves, Latham hadn’t transformed into his wolf form.</p><p>“Is he dead?” The witch asked. Brian Hennessey didn’t look much like a witch. Tall, thin, with small, black glasses perched on his nose, the guy appeared to be a harmless human.</p><p>Brian was far from harmless.</p><p>The other werewolves were shifting. The others who’d survived anyway—two packmates wouldn’t be escaping with him.</p><p>Should have gone in stronger.</p><p>“No, Jamie is still alive,” Latham bit out. “Because he wasn’t alone.”</p><p>Latham knew that once Jamie was out of the picture, the remains of his pack would be easy pickings. Jamie was the strength of that pack. Without him, they’d crumble to nothing.</p><p>He wanted them to crumble. Those fools deserved to crumble.</p> <p>“More wolves?” Brian shook his head and waved for the driver to get them out of there. “I would have thought you’d be able to take them—”</p><p>Latham grabbed his arm and let his claws rip into Brian’s flesh. “Most witches can see into the future.”</p><p>No fear flickered in Brian’s gaze. “Most witches didn’t nearly burn out their power by locking up a born vampire queen for you.”</p><p>His claws dug deeper. “She’s not locked up.”</p><p>“Yeah, she is. I put that bitch in her cell, I—”</p><p>“Not anymore,” Latham snarled at him as the rage flared hotter within him. “He got her out.” In-fucking-possible. Or it should have been.</p><p>Brian paled. “Iona...is free?” Ah, now the fear was there.</p><p>The witch was right to be afraid. Iona knew Brian had been the one to cast the spell that bound her.</p><p>She’d be gunning for him, too.</p><p>But Iona would have to get in line. Latham was ready to rip the witch’s head right off. “You said I was the only one who’d be able to get her out.” Only he hadn’t wanted her out. She just would have fought him then. Tried to take his head. So he’d kept her locked up, and every few months, he’d gone in and drained blood from her.</p><p>Iona’s blood was pure power. It gave him the strength of a werewolf—of five werewolves in fully shifted form—but let him keep the body of a man at all times. Why shift? Thanks to her blood, he always had more than enough strength to break his enemies.</p><p>“I-I told you...as a werewolf alpha, you’d be able to bind her body.” The scent of Brian’s sweat and fear filled the interior of the vehicle. “And if a werewolf alpha locked her body, then only a werewolf alpha could—could free her.”</p><p>Snarling, Latham put his claws at Brian’s throat. “You didn’t tell me that any werewolf alpha would do the trick! I thought I was the only one! Just me!”</p><p>More sweat. More fear. But Brian shook his head. “I never said you were the only one who could free her.”</p><p>That information would have been important before then. Yet even as the rage pulsed in his blood, Latham smiled at the witch.</p><p>Brian’s fear deepened. Ah, the witch knew him well.</p><p>“Your power’s nearly out,” Latham said, repeating what Brian had told him. The witch would be regretting those words. “You can’t see the future, and that’s a pity. If you’d seen it, maybe you could have avoided—”</p><p>Latham sliced his claws right across Brian’s throat. “This.”</p><p>Then he shoved open the door and tossed the witch’s body into the road.</p><p>Chapter Three</p><p>The cars had changed. Some were smaller. Some were far bigger. They had computers inside of them. Small screens with maps that showed any area with a touch of a button.</p><p>Iona touched lots of buttons.</p><p>The radio had what seemed like a thousand channels. The music was crazy. Wonderful. Faster, harder than she remembered.</p><p>And the seat beneath her ass? It...warmed.</p><p>She liked that.</p><p>“Yeah, yeah, they attacked outside of the Shore Tavern,” Jamie said, speaking into his little phone.</p><p>Iona frowned at the phone. The last time she’d seen a phone in a car, the thing had been huge—and in some black bag that plugged into the cigarette lighter. The phone in Jamie’s hand was just a few inches long and so incredibly thin.</p><p>There weren’t any buttons on it. Jamie just touched its screen and things happened.</p><p>She liked that, too. She’d have to get one of those phones, soon. Gadgets had always intrigued her.</p><p>“We’re on the way. Stay on guard, Sean,” Jamie ordered and ended the call.</p><p>Ah...yes. Her turn. Iona snatched the phone from him. She swiped her fingers over the screen. Music blared. The phone...flashed, as if she’d taken a picture, and then some kind of game with little birds popped up and—</p><p>Jamie pulled the phone away from her. “What are you doing?”</p><p>She wanted that phone back. But her fingers clenched in her lap. She’d always been taught...don’t let others know what you need. “I’m playing catch-up. A lot can happen in fifteen years, you know.”</p><p>And it had been fifteen years. Before she’d headed to the bar for a bite, she’d broken into a store and found herself new clothes. After picking up the clothing, it had been time to grab a newspaper in town. As soon as she’d held the paper in her hand, she’d realized all that she’d lost. The date had been big and bold and painful to see. She’d clutched that paper and wanted to rip and tear into Latham.</p><p>He’d taken fifteen years of her life away. Fifteen years.</p><p>In return, she’d take forever from him.</p><p>Jamie was quiet for a moment, as if processing her words, then he said, “So you just...slept, that whole—”</p><p>Iona turned away from him and gazed out at the blur of darkness beyond her window. “I told you already, I wasn’t asleep.” If only.</p><p>“Baby, I was there. Your body wasn’t moving. Hell, when I first saw you, I thought you were dead.”</p><p>She’d wanted to die. For so long.</p><p>Iona pulled in a steadying breath and said, “My body was paralyzed.” That was how it had felt. She hadn’t been able to move a muscle. Not one single muscle.</p><p>Her hands shook at the memory.</p><p>Kill him. A whisper that came from inside of her..</p><p>During that long, long time...Iona had begun to hear voices. She’d lost her sanity, she knew it. After so many years of being frozen, hell, just talking with Jamie still felt strange to her.</p><p>“Your body...” He repeated in that faint brogue that Iona wouldn’t admit she rather enjoyed hearing. “But...your mind?”</p><p>Smart wolf. Maybe he was picking up on the things that she said and the things that she didn’t say. “I could hear everything for years. Could smell. Could feel the bed beneath me.” For at least the first five years. Was it stupid that she’d been counting the days then? “I heard the bugs and the rats. I heard the crash of the waves and the whisper of footsteps.” Latham had kept a guard on her. Always.</p><p>A guard that...Iona’s head whipped toward him. “Did you kill the guard? The one who smelled of whiskey and cigars?” The odor of his cheap cigars had burned into her over the years.</p><p>A grim nod.</p><p>She couldn’t control her smile. “Good.” One less person to hunt and torture. And she was going to kill. The thought of killing had sustained her until her mind had finally broken.</p><p>Broken...and slid into the dark.</p><p>“Did he hurt you?”</p><p>The guard? He’d liked to touch her. Touching a corpse. What a sick freak. He’d also liked to burn her with his cigars. Good thing her kind didn’t scar. “Did he suffer before he died?” Iona asked instead of answering him.</p><p>“No. The death was fast.”</p><p>“Pity.” Her little claws drummed on the leather inside the vehicle. “I would’ve liked taking my time with him.”</p><p>“He did hurt you.” Anger roughened his voice.</p><p>And caused her to glance at him with surprise. “Wolf, you sound as if you actually care.” A lie, of course, but Iona could admit—to herself—that it would be nice, to have one person who cared.</p><p>The vampire coven she’d so carefully created over the years hadn’t cared. The ones she’d fought desperately to protect. They. Hadn’t. Cared.</p><p>They’d left her to wither away.</p><p>She’d been so hungry at first. Starving for just a few drops of blood. She wanted to gorge herself on blood now because that hunger was still eating away at her.</p><p>But...</p><p>But the only blood she seemed to want was Jamie’s. Can’t eat him. Not until I find out what he’s done to me.</p><p>She would find out, soon enough.</p><p>“If it makes you feel better,” he told her, the words halting, “I killed the five other guards who tried to keep me from you. No one who left you in that house is alive.”</p><p>But there were others still alive. Her coven. They might not have been at that house, but they’d left her there just the same.</p><p>Before she could speak, the vehicle screeched to a sudden stop. Iona jerked forward even as the seatbelt tightened around her and cut into her shoulder. “What the hell—”</p><p>“Blood,” Jamie snapped out as he jumped from the car.</p><p>She caught the scent, too. Heavy. Fresh.</p><p>Iona hurried out after him. They were on an old, twisting highway. Jamie had kept the driver’s side window down as he drove, the better to follow the “scent” of their attackers, and it sure looked like his nose had led him to their prey.</p><p>He stood over a broken body, and the scent of blood called to her.</p><p>Then she saw the prey on the ground—saw exactly who he was—and fury rolled within her.</p><p>Brian. The witch who had imprisoned her. His throat had been slit, from ear to ear, and blood pooled beneath him.</p><p>“It shouldn’t have been so easy for you,” she snapped, the rage clawing inside of her, raking and ripping open her guts. He’d been on her list. Hunting him, killing him—that promise had gotten her through so many days and nights. To see him like this...</p><p>“Those are the claw marks left from a werewolf attack,” Jamie said as he bent to better study the body. He shook his head. “Guess Latham got pissed at his witch.”</p><p>Surprise froze her breath. “You knew Brian?”</p><p>After the briefest of hesitations, Jamie gave a slow nod, but then said, “Never met him personally, but most paranormals out West, yeah, we knew of him.” He glanced up at her. “He’s the one who imprisoned the Blood Queen. He kinda got infamous for that bit.”</p><p>Blood Queen.</p><p>The name still hurt, not that she’d let him see her pain. Her father’s men had given her that name. When she’d escaped the fire, her father had sent mercenaries—the most vicious he could find—to kill her.</p><p>She’d been covered in their blood when she went to destroy dear old dad.</p><p>“Guess Latham turned on the witch.” Jamie closed the man’s eyes. Brian’s blue eyes had been wide open.</p><p>Hope you are seeing hell.</p><p>Jamie stared down at the witch. “After the guy lost his powers, I’m surprised Latham kept him around for this long.”</p><p>Now that was news. Brian had lost his powers? Good.</p><p>Jamie rose to his feet. His nostrils flared as he sniffed, probably trying to catch Latham’s scent.</p><p>Iona grabbed his arm before he could head back to the car. “How did Brian lose his powers?”</p><p>“By caging you.” His hand lifted. Stroked lightly down her cheek. Heat bloomed within her belly, but Iona refused to let her reaction show.</p><p>Fifteen years.</p><p>“It’s not easy to cage a queen.” His hand curled under her chin. “Want to tell me how he did it?”</p><p>She remembered screams. Pain. An agony that she’d thought would never end then—can’t move. Help! “No.”</p><p>She didn’t trust him. There was no point in telling Jamie her dark secrets. Not then.</p><p>I must get more blood. Iona knew she had to get her strength back to her maximum level. So she straightened her shoulders, took a long look at the wolf and said, “This is where we part ways.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jamie stared at her like she was crazy. I so am. She knew her own weakness. Fury was boiling inside of her right then, and she was going to let that fury out. Jamie needed to be away from her when the rage broke free. I should have been the one to kill Brian.</p><p>“Get back into the car, and just drive away,” she told Jamie, fighting to keep her voice steady. Iona figured he deserved the warning to get the hell away from her.</p><p>Jamie’s jaw clenched even as his hand dropped. “We’ve been over this. You need—”</p> <p>“I don’t need anyone or anything.” She stepped back. Glanced down at Brian’s body. He certainly looked dead.</p><p>But then, according to Jamie, she’d appeared dead, too.</p><p>Let’s make sure.</p><p>“Don’t worry about Latham,” Iona told him as she tossed a quick glance back at Jamie’s tense face. “He’s next on my list.” Latham wouldn’t escape their battle alive. “So consider whatever little war that you had with him, well, consider it over.”</p><p>Jamie shook his head. “This isn’t...”</p> <p>She lifted her hands. “There’s something you should know. I’m not just a vampire.” If she had been, then Brian would have never been able to bind her. Kill her, yes, but a binding wasn’t the type of magic that would normally work on vampires.</p><p>Binding. That was what he’d done. Not just a curse or a spell. He’d performed a ritual binding on her. One witch...</p><p>To another.</p><p>Flames began to flicker above her palms. Not touching her skin, never that, but spinning, burning, right above her flesh. “You need to leave now,” she told Jamie.</p><p>This time, he backed the hell up.</p><p>Smart man.</p> <p>She stood near Brian’s body. Her father had known what she was so long ago. That was why he had tried to burn her. If you wanted to destroy a witch, truly destroy her, then you had to use fire.</p><p>Iona drew back her hand and sent flames rushing right at Brian’s body. “Burn,” she whispered as the fire greedily leapt onto his flesh. “Burn.”</p><p>One down. One to go.</p><p>She was everything he’d hoped that she would be...and so much fucking more.</p><p>Jamie stalked behind Iona, being careful to keep a safe distance between them. He was downwind of her, but with her enhanced vampire senses, he was still worried she’d catch his scent.</p><p>He didn’t want her aware of him, not yet.</p><p>She’d stirred fire.</p><p>Vampires didn’t control fire. As a rule, they were just bloodsuckers. Sure, they could be super strong, they could live for freaking ever—provided they didn’t get staked or lose their heads to a werewolf’s claws—but they didn’t stir fire from nothing.</p> <p>Only witches could do that.</p><p>The stories had been right about that point, too. Iona wasn’t just a Born Vampire. She was a very, very powerful witch.</p><p>No wonder she’d been locked up. Caged near the water so the energy from the ocean would work to reinforce the spell. She might just be the most dangerous woman he’d ever met.</p><p>That fact only made him want her more.</p><p>Perfect. In so many ways. And Jamie wasn’t about to let her go. Not when he’d risked so much to find her.</p><p>Not when he’d had to make his own deal with the devil to claim her.</p><p>So now...yeah, okay, probably not his finest moment, but he was following her through the dark. Keeping his gaze on her as she slipped through the shadows.</p><p>Of course, Jamie knew what she was doing. Hunting. Going for another taste of blood.</p><p>Not gonna work, baby. You’re stuck with me. Did he feel guilty about that? No. These days, he couldn’t afford to feel guilty about anything and—</p><p>And she was gone.</p><p>Jamie hurried forward as his heart raced in his chest. It had only been a moment and—</p><p>He was tossed against the side of a dumpster.</p><p>“Following me? Really? What must I do?” Iona demanded as she put her hands on her hips. “Rip off your head in order to make you stop?”</p><p>Taking his time, he stood back up. She’d tossed him about ten feet. Jamie made a show of brushing dirt off his jeans and shirt. Mostly to give himself time to think, then he replied, “You’re afraid to rip off my head. Part of you already knows that I’ve told you the truth.” He headed toward her, not trying to keep his footsteps quiet any longer as his feet crunched over the gravel. “And if you kill me, you know that you’ll be killing yourself.”</p><p>It sounded like she hissed at him. He almost smiled but then—then he blinked and Iona was in front of him. She’d closed the distance herself, effortlessly. A distance of ten feet, in less than a second’s time. “Let’s get one thing straight.” She pushed up on her toes. Stabbed a finger into his chest. “I’m not afraid of anything. Or anyone.”</p><p>Right. She probably wasn’t.</p><p>And, damn, she was sexy. His gaze dropped to her mouth. Her lips had been the softest that he’d ever felt. He could still taste her on his tongue. The sweetness had been a surprise. From her, he’d expected spice.</p><p>“Why...why are you looking at me like that?” Iona asked as her gaze searched his.</p><p>He could tell her the truth. “Because I want to kiss you.”</p><p>Her poking finger jerked back as if she’d been burned. “You mean that you want to take more of my blood. So you can get stronger and so you can—”</p><p>He caught her shoulders and pulled her close. Her body brushed against his. Soft. He loved the way she felt. “I mean I want your lips beneath mine. I want to taste you. I want to savor you.”</p><p>She swallowed. “Your brogue is...thicker.”</p><p>“Yeah, it gets that way when I’m turned on.”</p><p>Her lips parted.</p><p>“I want your mouth,” he said again, no longer willing to fight the desire he felt for her. Why bother? They were locked together, even if she didn’t realize it.</p><p>He was more than ready to start enjoying the perks of the deal.</p><p>For an instant, Jamie was sure he saw the flicker of an answering desire in her golden gaze. But then her chin rose as she said, “And I want blood.”</p><p>The implied not yours was clear as she pulled away from him. As he watched her, Iona turned on her heel and headed toward the faint sound of music that drifted in the air.</p><p>Yes, she was heading toward big, bad bar number two in the town of Shade. So predictable.</p><p>In fact, her move was so incredibly predictable that he’d already told Sean they’d be coming that way. When Jamie had gone hunting for Iona earlier that night, he and Sean had separated. One bar for each man.</p><p>Jamie had gotten lucky. He’d found Iona at the Shore Tavern.</p><p>But when he’d talked to Sean on the phone, he’d told the other wolf that he’d be coming to meet him. I knew she’d want to try tasting someone else.</p><p>He knew, but he didn’t like it. In fact, it made him feel...jealous?</p><p>Impossible.</p><p>It should have been impossible. Yet Jamie found himself hurrying to keep pace with her. And, moments later, when Iona pushed open the door to the bar, when the bouncer gave her a welcoming smile, and all eyes seemed to greedily stroke her body, Jamie’s beast gave a growl.</p><p>Back the hell off.</p><p>The music was pumping. Loud and—</p><p>“The music has changed.” Iona tilted her head as she listened to the pounding beat. “I think...I like it better now.”</p><p>He kept forgetting she’d missed so much in the last fifteen years.</p><p>Her hips began to sway. The men began to close in.</p><p>Hell. He put his arm around her shoulders.</p><p>Those men backed up. Damn straight. If they’d come closer, he might have even flashed fang.</p><p>“It will be harder to find good prey with you at my side.” Her voice was low and husky and her hips were still rocking.</p><p>“Too bad. I don’t plan on backing off.” She didn’t seem to realize the gigantic threat that hung over her. Latham could attack, at any time. Yes, she was strong. But so was Latham. And if he caught her off-guard... “I don’t want Latham putting you under again.”</p><p>Her hips stopped rocking. She glanced at him. Anger had melted the gold in her eyes so that her gaze just burned. “He won’t.” Then, with a toss of her head, so queen-like that Jamie had to smile—he’d started to rather like that touch of haughtiness—she sauntered across the bar.</p><p>It took him about ten seconds too long to realize that she’d already picked her out prey.</p><p>By then, Iona had her hand on the chest of her would-be victim. A familiar victim. The bar was behind Sean, trapping the guy as he stood right in front of Iona.</p><p>She chose my first-in-command? Fuck. Jamie stalked toward them. He’d just closed in when he heard—</p><p>“I think this could be fun,” Iona murmured as she leaned toward Sean.</p><p>Sean’s shocked gaze darted to Jamie.</p><p>“You aren’t doing this,” Jamie snapped. He grabbed her arm. For some reason, he didn’t want her touching the other werewolf. He glared down at Iona. “I already told you, it isn’t going to work. You can’t take anyone else’s blood.”</p><p>“And I told you...I don’t believe you.”</p><p>She was making him want to howl. And making him want to toss her over his shoulder and carry her away from Sean. Away from all the other men there.</p><p>Her head turned as she studied Sean. “Maybe one werewolf will be as good as another, and at least with him, I’ll be sure he isn’t on drugs.” Her gaze slid back to Jamie. “I’m betting you run a tight ship when it comes to that.”</p><p>He did. Drugs would make his wolves weak. He didn’t allow for weakness. Weakness would just get them killed.</p><p>“This way, I don’t have to kill any humans...yet.” She offered first Jamie, then Sean a smile that flashed her sharp little teeth. Then her focus centered on Sean as she said, “So point me toward a private room, and let’s just see how you taste, wolf.”</p><p>Women liked Sean, they sure fell into his bed easily enough. Maybe it was because Sean appeared easy-going, and often...normal. A big bonus for a guy who was actually paranormal. Sean was a perfect chameleon. He could fit in with just about anyone, anywhere. Unlike Jamie, he’d dropped his Irish years ago, and, in fact, he could fake other accents—depending on where he was and who he wanted to fool—almost instantly.</p><p>Jamie fisted his hands and fought to hold on to his control.</p><p>Iona appeared determined. And a little too satisfied with her drinking scheme.</p><p>The woman wasn’t stopping. Not until she’d tried to drink from someone else. He could fight her, but he knew Iona wouldn’t give up. “One sip,” Jamie said, his voice clipped. Just one. That would be all she’d need to find out if the blood worked for her.</p><p>And if it does work? He couldn’t think about that possibility right then. The witch had been adamant. The wolf that woke her would be the wolf that controlled her.</p><p>He didn’t think Brian had been lying, but since the witch was dead, it wasn’t like he could find out for certain.</p><p>And I have to make sure she doesn’t find out about my deal with Brian. Because if she did...</p><p>“There’s a room in the back.” Sean inclined his head toward a dark, narrow hallway. “Right through there.”</p><p>Wasn’t that just fantastic.</p><p>“Lead the way,” Iona invited him with a wave of her hand.</p><p>But Sean wasn’t an idiot. He glanced at Jamie, waiting to see what his alpha wanted.</p><p>“Keep your hands off her,” Jamie ordered him, voice lethal. “She gets one taste—one.”</p><p>Sean gave a nod. As a rule, werewolves weren’t up for being vamp prey. Only this wasn’t a typical situation.</p><p>Iona wasn’t your average vamp.</p><p>Sean headed down the hallway. Iona didn’t move, and Jamie was far too conscious of her body near his. Her eyes narrowed as she studied him, then Iona crooked her finger, inviting him closer. His head bent toward her, the move automatic. She rose onto her toes. Her lips brushed against his ear as she said, “I don’t need your permission to feed from prey.”</p><p>He turned his head. Made sure their eyes met. “In order to touch you, he needs my permission.” Because, dammit, Jamie had already started to think of her as—</p><p>Mine.</p><p>“Werewolves...always the same.” Iona sighed as she eased away from him. “You think that you can control everyone and everything around you.” She sauntered toward that dark hallway.</p><p>“No.” The growl slipped from him.</p><p>Iona looked back at Jamie.</p><p>“I can’t control everything. If I could, there’d be more than six members of my pack still alive.” He stalked to her, aggressive, deliberately so. “If I could control everything, my family would be alive. I wouldn’t have come home to find my mother and father dead, their bodies savaged. Latham wouldn’t have killed them.” His parents had come to this country because they’d wanted a fresh start. They’d brought their pack over with them. Everyone had been so hopeful, at first.</p><p>What could have been sympathy or maybe even pity flashed in her stare. That faint emotion just stirred up his anger even more. Pity was the last thing he wanted from her.</p><p>His body brushed against hers. “And if I could control everything,” his voice was for her alone, “then I’d already have gotten you, naked, under me, and I wouldn’t be so wild with lust that I want to rip apart my own best friend...because you’re about to put your mouth on him.”</p><p>The words surprised him with their brutal truth. The lust he felt for her...it was just growing. Stronger and stronger. Almost like he was under some kind of spell. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’s part witch. Maybe I am under her spell.</p><p>Under, and falling fast.</p><p>“One taste,” he told her, “but you’re going to regret it.”</p> <p>Her gaze searched his. “There are few things I regret.”</p><p>He could believe that.</p><p>“This won’t be one of them.” Then she turned, head high, back straight, and marched to the door at the far end of the hall.</p><p>He didn’t follow her. He didn’t want to see her with Sean. “You’ll be coming back,” Jamie said, the words drifting after her.</p><p>And they were a promise. Iona was about to realize that no other man would ever do for her again.</p> <p>Only me, baby. Only me.</p><p>He’d already realized that no other woman would satisfy him.</p><p>Chapter Four</p><p>Her fangs had stretched and sharpened as she prepared for the bite. Iona had locked the door behind her—locked Jamie out—and now she and Sean were alone together in the small storage room.</p><p>“So...how does this work?” He asked her with a nervous glance at her fangs.</p><p>She almost rolled her eyes. Really? How did he think it was going to work? “The usual way. I bite you. I drink. That’s how it works.”</p> <p>Sean was nearly as big as Jamie. His shoulders weren’t quite as broad, his muscles not as big. He was probably a few inches shorter than the alpha wolf, too.</p><p>But Sean was...handsome. His features were even and smooth and had no doubt drawn plenty of female attention over the years.</p><p>Iona realized that she preferred the rough danger of Jamie’s hard face. Story of her very, very long life. The bad boys often drew her in.</p><p>Then, frequently, they’d tried to kill her.</p><p>So she’d had to kill them.</p><p>“Give me your hand,” Iona ordered.</p><p>But Sean shook his head and shoved his hands behind his back. “No way. I’m not supposed to touch you!”</p><p>For the love of...She grabbed his arm and jerked up his hand. Then she lifted his wrist to her mouth. “Calm down.” She could probably try to soothe him. She’d always been good at lulling her prey, when she wanted. Seduce with a look. Kill with a bite.</p> <p>Been there, done that.</p><p>So many times that it rather bored her now.</p><p>But, yes, if she wanted, Iona could seduce just about anyone.</p><p>Only she didn’t want to seduce Sean. She just wanted to find out what his blood would do to her. Don’t burn me, don’t. Because if she was stuck with only taking from Jamie, then she’d be tied to him.</p><p>Forever.</p><p>Iona parted her lips. Her fangs pressed into Sean’s skin, and just like that, with one quick press of her teeth, his blood flowed onto her tongue.</p><p>Sean gave a little moan. “Oh, shit, no one said it would feel good.” For the first time, she heard the whisper of an Irish accent in his words.</p><p>Only...his blood wasn’t “feeling good” to her. It felt horrible. His blood tasted rancid, and she was already yanking her mouth away from him and backing up even as her body started to shake and spasm.</p><p>“Iona?” Sean called her name as he came toward her. “Iona!”</p><p>The door burst in, heaving right off its hinges. Jamie stood in the doorway. His gaze swept around the room, from Sean—and his outstretched hand—to Iona.</p><p>When did I curl up on the floor?</p><p>She didn’t curl. She didn’t hide.</p><p>I do when I realize my choices are gone.</p><p>Because Sean’s blood tasted just like the human’s, and instead of strengthening her, it had made her feel even weaker.</p><p>Now the hunger was ripping through her insides. Hollowing her out.</p><p>“I told you not to touch her,” Jamie tossed Sean back against the wall. “I told you.”</p><p>It wasn’t the touching that mattered. It was the blood. Blood she couldn’t drink.</p><p>“Iona?” Now Jamie was the one calling her name.</p><p>She forced her head to lift. Made her body rise. She was still shaking, but those trembles couldn’t be helped because they came from the hunger and the weakness that filled her veins.</p><p>Oh, how the mighty have fallen. So many would laugh to see her brought so low.</p><p>Jamie wasn’t laughing. He was staring at her with eyes that saw far too much. “Get out of here,” he said.</p><p>Her lips parted.</p><p>“Yank the door back up after you, Sean, and get the hell out,” he said, never looking away from her.</p><p>Sean hurried to comply.</p><p>Jamie didn’t touch her. Didn’t move another inch. Not until the door was partially up, giving them a bit of privacy, and Sean was gone.</p><p>“It didn’t work,” he said flatly.</p><p>Of course, he’d known the truth. Maybe she had, too. She’d just been desperate.</p><p>“It makes you sick, doesn’t it?” He asked. “When you take blood from others.”</p><p>Yes. A vampire who could only bite one man? Talk about falling far from her perch of power. She wasn’t exactly the big terror of the town any longer.</p><p>The faint lines deepened near Jamie’s mouth. “I want you to bite me. Take my blood...I don’t care. I can give you what you want, always.”</p><p>He didn’t understand. But right then, she just didn’t have the energy or the control to make him understand.</p><p>Fifteen years. For all intents, she’d been dead then. Even if her mind had been crying out in agony.</p><p>Now that she was free, Iona wanted to live.</p><p>She was about to break apart because she just wanted to let go—to lose her control and take the blood that he offered.</p><p>But with vampires, when control broke and blood was involved...</p><p>There was a reason she’d been trying to push her vampire coven away from taking blood from live sources. She’d seen the carnage that came from centuries of bloodlust and violence.</p><p>When you took straight from a source, when your control shattered, the lust wouldn’t just be for blood.</p><p>“Blood and sex,” she whispered.</p><p>Jamie’s gaze burned into hers. There was no fear or revulsion or even a hint of hesitation in his eyes. There were just answering hunger. “Yes.”</p><p>He knew what he was getting with her. No secrets there. And she needed to feel alive again. She’d gone too long in that cold darkness. There would be no holding back for her. More blood.</p><p>She reached for him. Sank her teeth into his throat.</p><p>His blood was perfect on her tongue. Delicious. Addictive. Like a mix of wine and chocolate.</p><p>His body brushed against hers.</p><p>Pleasure. Close. So very, very close.</p><p>Her nipples were tight. Her sex already growing moist. Iona’s control was fracturing. She could feel the ripples as they shook through her body.</p><p>His hands locked around her wrists. “Don’t worry,” he told her, the words rumbling against her as her tongue licked lightly at his throat. “I’ve got you.”</p><p>Maybe he did.</p><p>They were about to find out.</p><p>In the next instant, he’d lifted her up. Took two fast steps, and then her back shoved against the wall.</p><p>“When you bite me,” his words were a dark rumble that had her sex clenching, “I want to fuck.”</p><p>Not an unusual reaction. The bite did something to prey. Gave them a boost of pleasure. Made them want more.</p><p>The vampire could usually control the bite, especially a vampire as old as she was. Could give pleasure or pain.</p><p>Her fangs scored lightly over his flesh. He growled. With this bite, she wanted to give pleasure.</p><p>His fingers were on her stomach now, under her shirt. His hands were warm and strong and they were sliding up, up, and cupping her breasts. Her breath hissed out as her nipples pebbled beneath his touch. She arched against him, wanting more.</p><p>His blood had already made her stronger. So now she wasn’t just drinking from him. She was kissing. Licking. Learning what the werewolf liked.</p><p>“My turn,” he muttered as he lifted her even higher. Strong wolf.</p><p>Then he yanked away her top and put his mouth on her breast. He used his teeth to lightly rasp over her sensitive flesh. Her sex ached. So long...</p><p>Iona wrapped her legs around him even as he kissed and sucked her breast. She pushed her hips against him. He was aroused. No mistaking that hard bulge that shoved back against her.</p><p>Pity his jeans were in the way.</p><p>Not for long.</p><p>This time, she was the one to jerk open his jeans. To pull the zipper down and slid her fingers past the denim. She found him, long, thick, hot, pushing eagerly toward her.</p><p>Her tongue slid over the edge of her left fang. She’d had his blood. Now she just wanted him.</p><p>His rough breaths filled her ears. Then she heard the sound of a frantic heartbeat. His? Hers? Maybe both. Racing too fast.</p><p>“Jamie.” Her demand. “Now.” She didn’t want foreplay that lasted for hours. That could come another time. Right then, she was already clawing at his back. Pushing against him as her control shattered around her. She wanted him inside of her.</p><p>Wanted the pleasure to erupt and sweep everything else away.</p><p>Then his hands were between their bodies. He had her jeans open, and she had to lower her legs, just long enough to kick out of her heels and jeans. She wasn’t wearing any underwear, so she didn’t have to worry about—</p><p>“Fuck.” His hand was between her legs. Pushing into her sex and her head tipped back because she liked the sensation of his fingers sliding in her. Her body was humming, so tuned up that she knew the first climax would hit her soon.</p><p>His thumb pushed over her clit.</p><p>The climax hit.</p><p>She grabbed for his broad shoulders as the release blasted through her. Even as her sex contracted, he was there. Not with those long, broad fingers anymore, but with the heavy length of his cock. Driving into her. Plunging deep.</p><p>His neck was inches from her mouth. She had to taste him again. Bloodlust, physical lust, they blurred in her mind and her control fell to the ground. There was no thought. Only need. Hunger that couldn’t be satisfied.</p><p>He pushed into her, not easy or gentle, and she wanted him that way. His hands were around her hips, forcing her into the air so that he supported her body and he drove into her, again and again with thrusts that stole her breath and made her body shudder.</p><p>She clenched her sex around him, squeezing tight.</p><p>“Iona...so good...”</p><p>She’d show him better than good. She let the bite linger, knowing it would bring more pleasure.</p><p>Pleasure. It was what they both wanted. Craved.</p><p>He pulled her away from the wall. Wrapped his arms around her so that he held her fully. And his hips still pumped into her. Wolves...so powerful.</p><p>Another climax hit her, and this one had her crying out as she lifted her mouth from his flesh. Her breath was choked and the pleasure...it was so intense that it almost hurt.</p><p>Her whole body was electrified with feeling. So sensitive that every move of his flesh against hers had Iona tensing.</p><p>Then he shoved boxes off a table top. Put her down over it. Her legs dangled in the air.</p><p>“We aren’t done,” Jamie promised, his voice so dark and deep.</p><p>She wanted to smile. Couldn’t. He’d taken her legs. Hooked them over his shoulders so that she was wide open to him. He took her now, hard and wild, and it was exactly what she wanted. The rush of sensation just wouldn’t stop.</p><p>Iona didn’t care that his claws were out. That they’d slashed across the top of the table. She didn’t care that his eyes glowed or that his cheeks had hollowed, signaling the presence of his beast.</p><p>She liked the wildness. Wanted it.</p><p>His head lifted. She saw the flash of his fangs. Fangs that were even sharper than her own.</p><p>Blood and sex—that wasn’t just a combination that worked for vampires.</p><p>She turned her head to the side, offering herself to him. Only fair...she’d had her turn.</p><p>He took the spot where her neck curved into her shoulder. His lips closed over the flesh. His teeth pressed lightly into her. It didn’t feel like he was drinking from her though.</p><p>It felt as if he were...claiming her.</p><p>Then he stiffened against her. The hot splash of his release filled her and sent more waves of pleasure pulsing through Iona’s body. Pleasure, life, lust...she wanted it all.</p><p>This wasn’t sleep. Wasn’t death. Wasn’t whatever the hell had happened to her because of Latham.</p><p>Jamie’s body was pressed to hers. Flesh to flesh. He was the man who’d brought her from that nightmare. Who’d freed her. The man who’d just given her the best orgasm—or three—that she could remember having in this century.</p><p>His scent was on her. Her scent was on him. She’d marked him. He’d marked her.</p><p>Her lips began to curl. How perfect.</p><p>Werewolves were always so territorial. So driven by emotions and needs. By rage. By possessiveness.</p><p>Sometimes, their strengths could be weaknesses. Weaknesses that she could use in her battle.</p><p>Her frantic heartbeat began to slow down.</p><p>She stared up at the cracked ceiling above her, and her hands were still locked around Jamie. When she went to Latham, she’d be carrying Jamie’s scent on her. Revenge, step one.</p><p>Not yours, Latham. Never that. Despite what Latham had done to her, she’d escaped. She wasn’t the prisoner in his little trap any longer. Not his plaything for eternity. She was free.</p><p>And she’d just fucked his enemy.</p><p>Payback was coming for Latham, and it had just started...</p><p>Wait until I bring my nightmare to your door. She’d make Latham scream, plead, then...die.</p><p>“Are the stories true?”</p><p>Iona didn’t glance away from the night sky when Jamie asked the question. She had her back to him. Her legs were drawn up, her arms curled around her knees, and she gazed up at the stars lighting the sky.</p><p>When he’d finally been able to speak—and move—again, he’d gotten her out of that back room. Out of the bar and to a safe place. A safe place that had a good bed and fresh clothing for them both. And more comfortable shoes for her. She’d smiled when he’d given her the shoes. He liked her smile. He liked having sex with her a hell of a lot more. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Having sex with her...</p><p>Mind-numbing.</p><p>The pleasure had been deeper than anything he’d experienced before, and even now, he wanted her again.</p> <p>If the stories were true, he wasn’t the first man to feel this way for her.</p><p>“Which stories do you mean?” Her head tilted back, in what looked like an effort to better see the stars.</p><p>He sighed and eased down beside her. They were at a house Sean had found for him, a little place in the woods, and though Jamie had tried to get her inside the cabin, Iona had insisted on sitting outside. Sitting outside and gazing up at the stars.</p><p>He followed her stare for a moment, then glanced back at her profile. He much preferred that view. “Are you truly the oldest pureblood?” He asked after a moment of just watching her.</p><p>Pureblood...the term for vampires who were born, not made. Most of the vamps populating the world had been made or turned. They were humans who’d been bit, who’d taken vampire blood when they were near death, and who’d been reborn as something more.</p> <p>But Iona wasn’t like those other vampires. He caught her left hand. Opened the palm. His enhanced vision easily let him see the small mark in the middle of her palm. Those who were born to the blood often had that mark.</p><p>That mark...and a circle of gold in their eyes.</p><p>Since her eyes were pure gold, the lady more than met that part of the pureblood requirement.</p><p>Her slender shoulders rolled in a little circle. “There could be others out there, probably are. I just haven’t met them.”</p><p>“When were you born?” Jamie pressed.</p><p>Her gaze was still on the stars. “Long before men ever thought they’d travel up there.”</p> <p>“Iona...”</p><p>Another little shrug. “Around 600 A.D., give or take a few years.”</p><p>He tried not to let his surprise show.</p><p>“I know, I look good for my age, right?” Her lips had curled into a faint smile.</p><p>Very good.</p><p>He found that he was curious about her. Maybe too curious. “How did you know...what you were?” He’d always known he was a werewolf. When puberty hit, there’d been no surprise when he grew fangs and claws and had the urge to howl at the moon. Surrounded by others of his kind, it had been an easy transition for him.</p><p>“I got the first clue when one of my father’s warriors stabbed me in the heart, tossed my body in a shallow grave, and left me to die.” Her gaze drifted to him. The smile was gone from her face. “Yes, that was my first big clue. He left me to die, only...I didn’t.”</p><p>His hands clenched into fists. “Why did he do that?”</p> <p>Her gaze turned back to the stars. “Have they traveled up there? While I was...under...did they travel more to the moon? Maybe to another planet? I’ve seen so much in the years I walked the earth, but I’ve always wanted to go beyond the sky...”</p><p>He caught her hand. Twined his fingers with hers in order to catch Iona’s attention—and just because he wanted to hold her hand. “They’ve sent out robots. Rovers. They captured images of planets and stars. Searched and explored.” Hell, he’d take the woman on a little NASA field trip if she wanted...after they were done with Latham. He’d make sure she learned every advance that had been made in space exploration.</p><p>“It hasn’t changed,” she said, and with her free hand, she pointed to the sky. “Venus waits. Jupiter shines. The constellations are just as they were. Clothes are different. Music. Technology. But up there...it all looks the same to me.”</p><p>He squeezed her fingers. “Why did he stab you?”</p><p>“Because my hair wasn’t gray. Because my skin hadn’t wrinkled. Because I wasn’t bearing children for my husband.”</p><p>Her husband?</p><p>“Did I mention...” Iona murmured, “that my husband was the warrior who stabbed me?”</p><p>Sonofabitch. “No,” Jamie bit out the words, “you didn’t.”</p><p>“Purebloods usually stop aging around twenty-five. Their bodies just...they freeze. I didn’t realize that had happened to me, of course. I learned later that my father and my husband—they thought I was bewitched.” Her lips tightened. “Or that maybe I’d even made a deal with the devil.”</p><p>Blood Queen.</p><p>“When I got out of that grave, I made the mistake of running back to my people for help. You see, I still didn’t get it. I thought my father would help me. I was sure he couldn’t have known what Tylar had done. I was so scared and...” Her stare dipped to Jamie’s throat. “Hungry.”</p><p>Because her vampire side would have kicked in with all of the blood loss she’d suffered.</p><p>“But my father knew. The attack had been his plan. As soon as he saw me, he ordered his guards to prepare the fire.”</p><p>The fire. Jamie found that he couldn’t speak. His hold tightened on her.</p><p>“The guards bound my hands. Tied me to an old, rotting tree...put brush around me, and it was my father...he was the one to bring the first torch to start the blaze.”</p><p>The Blood Queen slaughtered a whole village. That was the tale he knew of Iona’s birth. Whispers had told of a Born Queen who’d been so stricken by bloodlust that she’d turned and attacked every person near her.</p><p>Only the story that Iona told was much different from what he’d heard. Jamie found that he didn’t doubt her account, not for an instant. There was too much pain humming beneath her words.</p><p>“I begged for help,” she said quietly. Her lips trembled. “So many were gathered around the fire, but no one would step forward to save me. No one.”</p><p>Now her fingers were squeezing his.</p><p>“I’d never known my mother. My father...he’d said that she was attacked by our enemies shortly after my birth. But there were rumors about her. Stories that said my mother could do magic.” Her long hair slid over her shoulders as she turned her head and gazed at him. “That day, I used magic, too. The fire should have consumed me.”</p><p>He knew vampires were particularly susceptible to the flames. Their bodies burned so quickly.</p><p>“But I managed to control the fire. I don’t know if it was my fear or my fury, but...something broke in me and I felt a sure of power.” Her breath sighed out. “I got away. I ran and I ran and then I realized...he’d always hunt me. My father wouldn’t stop searching for me because, to him, I was some kind of—of punishment.”</p><p>“Punishment? For what?” He didn’t understand, but he sure would have enjoyed doling out some justice to her sadistic father.</p><p>“For killing my mother,” Iona said in a soft, sad voice. “Our enemies didn’t kill her. I found out that truth too late. She died by my father’s hand.”</p><p>She’d had one sick bastard of a father. Family. Sometimes, you couldn’t live with them...</p><p>And sometimes you needed to kill them.</p><p>Iona kept talking, and she didn’t try to pull her hand from his.</p><p>Good. He liked holding her palm against his. “My father always wanted immortality. Wanted to rule all the land he could find. He thought my mother could help him, and when she didn’t, he made sure she could never use her magic to help anyone again.”</p><p>He couldn’t believe how dark her origins were. A heavy ache had grown in his chest as he listened to her tale.</p><p>“It was him or me,” she said, and, sure enough, that stubborn chin of hers kicked up. “I knew it, so I went back to my father’s land. I slipped inside and made my way up to kill him.”</p><p>And she had. He knew that, at least, this part of her legend was true.</p><p>“I had my knife at his throat, but I couldn’t do it.” Her head sagged a bit, as if she were shamed by the memory.</p><p>Well, hell. So that part wasn’t true, either?</p><p>He’d suspected from the moment her golden eyes first opened that she wasn’t the evil bitch that rumor and legend had made her out to be. Now he knew for certain.</p><p>And that knowledge made him feel...lost.</p><p>What have I done to her?</p><p>“He laughed at my weakness and stabbed me with his sword.” Her left hand went to her side, as if touching a wound that had to be over fourteen hundred years old. “He was coming to cut off my head. H-he said that would be the way to end me.”</p><p>Her father had been right. Even a pureblood vampire wouldn’t be able to rise from a beheading.</p><p>“He’d killed my mother by taking her head. He told me that...”</p><p>Had her mother been a pureblood, too? It was possible. Maybe Iona’s father hadn’t killed her mother because the woman was a witch. Maybe he’d killed her because she was a pureblood and she’d refused to turn him into a vampire? Then the hate had eaten at him, until he’d unleashed his rage on his own child.</p><p>“As his blade came for my throat, as I felt my own blood pouring from me, and saw death coming...” Her breath whispered out. “The woman I’d been, she died. The vampire inside of me—she lived. She killed. I took that sword. Snatched it from him. Then shoved it right back into his heart.”</p><p>Jamie wanted to put his arms around her, so—screw it—he did. Jamie wrapped his arms around Iona and pulled her against his chest. She stiffened but didn’t fight his hold. Good. He couldn’t have fought her then. Her pain was too fresh. Too strong.</p><p>He didn’t want to ever cause her anymore pain.</p><p>Too late for that. You’ve stolen her life, and she doesn’t even realize it.</p><p>His jaw locked.</p><p>“When his men came and attacked, I fought back. They died. My husband was the first to fall before me.” Said flatly, as if she were yanking back on her emotions. “Then I walked away from that land, with their blood covering me.”</p><p>And the legend of the Blood Queen had been born.</p><p>“I learned an important lesson that day,” she whispered.</p><p>That her father had been better off dead? That her husband had deserved a long, brutal death?</p><p>“Even those closest to you will betray you and kill you, if they have the chance.” Her head turned, and she glanced up at him. They were close enough to kiss. “Just so you know, I won’t give you that chance.”</p><p>Jamie blinked. “I have no plans to kill you.” Keeping her alive was imperative to him. Without her, he would be dead.</p><p>Her smile was sad, and it called him a liar. “You’ve been so careful about what you revealed to me. But I know more than you think, and when I sleep, I’ll know all.”</p><p>Because powerful vampires could literally steal people’s memories with the act of blood-drinking. Their prey’s blood memories appeared to the vampires when they dreamed. Jamie knew that and he also knew that he had to stop Iona from dreaming, at least until their war with Latham was over. But, lucky for him and—I’m so sorry, Iona—unfortunately for her, he knew the lovely vampire’s weakness. So he had to use that weakness as he asked, “And you’re so eager to sleep again, are you? To close your eyes and wake to see that years have passed?”</p><p>She flinched. Jamie had hit his target, and shame burned inside of him.</p><p>“Eventually,” she said, still staring back at him with the eyes that Jamie swore could see into his soul, “I’ll have to sleep. There won’t be a choice.”</p><p>He bent forward and pressed a kiss to her cheek. “Eventually, there won’t be a need for secrets.” They both knew he had them. “My war with Latham will be over.” But the end for him and Iona wouldn’t come any time soon.</p><p>As he pulled in her scent and felt her slender body against his, he had to ask, “Why did you kill the others?” Not the warriors on that long ago night. He would have gladly killed them himself. No, he meant the vampires that she’d brought in to her coven. “Did they turn on you, too?”</p><p>A faint furrow appeared between her brows. “What are you talking about?”</p><p>“The coven you had in LA. Why did you kill them?”</p><p>Stark pain—no, anguish—flashed in her eyes. “They’re dead?”</p><p>Oh, shit.</p><p>But then she twisted in his arms, shoved him back, and Jamie suddenly found himself on the ground with one very, very enraged pureblood vampire above him. “They’re dead?”</p><p>“Yes.” Okay, so she hadn’t killed them. Big miscalculation his part. If she hadn’t done it—</p><p>Latham.</p><p>“I wondered why they never came for me.” The words were spoken with sadness, but fury crackled in her gaze. “I waited for them. Thought they’d betrayed me, too.”</p><p>Maybe some of them had, he didn’t know. All Jamie knew for sure was that, “The compound burned to the ground on the same day that you...disappeared.” The flames had lit up the sky. He’d been in LA at the time, young, barely twenty, still too reckless, and he raced toward those flames.</p><p>But there had been nothing he could do. The vampire compound had been too far from the main city streets. The fire had been too strong.</p><p>Too out of control. For him. And certainly for the human fire fighters who’d tried to battle the blaze.</p><p>A tear slid down Iona’s cheek.</p><p>It felt like someone had just clawed his chest open. He hated the sight of that tear. “I’m sorry. I-I didn’t—”</p><p>She lunged away from him. Raced away in a flash and disappeared into the woods as she used that super vamp speed of hers.</p><p>No. “Iona!”</p><p>But she wasn’t stopping for him.</p><p>Swearing, he transformed into the wolf, letting the savage shift sweep over him. Then he was running, following her sweet scent. Rushing through the woods as fast as could.</p><p>Can’t let her get away. Can’t. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But even as he rushed through the woods, her scent was growing fainter. He kept going, knowing she couldn’t maintain her enhanced speed forever. She’d still be weak from her imprisonment. She’d still—</p><p>He burst from the woods. Heard the growl of a motorcycle. Saw Iona, holding tight to the back of some leather-clad bastard. As the breath heaved from him, the motorcycle shot forward, taking Iona away.</p><p>Jamie howled.</p> <p>The driver glanced back, and Jamie could smell his fear. The man was smart to be afraid. Jamie charged after the bike. After them.</p><p>“What the hell is that?” The human demanded. “Too big for a dog...”</p><p>“It’s a nightmare.” Iona’s soft voice drifted back to Jamie. Stabbed right in his heart like any knife. “Go faster.”</p><p>The engine gunned and the bike picked up even more speed as it flew down the narrow road and into the fading night.</p><p>For a time, Jamie kept pretty good pace with the fleeing motorcycle. But then the human and Iona vanished.</p> <p>Vanished...before he could make her realize that the human wasn’t harmless. That he hadn’t been outside of those woods by chance.</p><p>He howled again.</p><p>Jamie knew that human’s face. He’d seen him before. At Latham’s side.</p><p>And now that human...one of Latham’s army...had Iona.</p><p>Chapter Five</p><p>The wolf wasn’t following them any longer. Iona’s hands tightened around the male. They should be clear, for now.</p> <p>“Stop,” she told him, raising her voice so it would be heard over the roar of the motorcycle.</p><p>He didn’t stop.</p><p>Her hands squeezed him, harder. “Stop.”</p><p>Did he give a negative shake of his head?</p><p>He did. Her gaze searched the road around them. She needed to get to LA, but she didn’t need the human, not any longer.</p><p>“If you don’t stop, I’ll kill you.” He wasn’t wearing a helmet so it would be ridiculously easy to dispatch him. One quick toss and he’d be on the ground. One flick of her wrist and his neck would break.</p><p>She might not be able to drink from him, but she could certainly kill him easily enough.</p><p>“Someone wants to see you,” the human said as his fingers tightened around the motorcycle’s handlebars.</p> <p>Unease skated through her. “Then he sent the wrong messenger.” She didn’t even hesitate. Iona grabbed the human and threw him off the motorcycle.</p><p>Before the bike could crash, she slid forward and took control of the handlebars. This wasn’t like the old hog she’d had all those years before but...</p><p>But she was a fast learner. Her thighs curved around the body of the bike and she throttled up the speed as she raced away.</p><p>The human could live or die. He wasn’t her concern.</p><p>Her coven—her vampires—they were what mattered. She needed to find out what had happened to them.</p><p>Greg Coleman rose slowly from the pavement. His ankle was broken, thanks to that bitch. And, also thanks to the vamp bitch, blood soaked the right side of his body where the asphalt had ripped his flesh away.</p><p>All that blood, permeating the air, and she hadn’t even stopped for a sip. He yanked out his phone. The screen was cracked, but he still managed to make his call.</p><p>“You were right,” he said when the boss picked up. “She didn’t so much as make a move toward my throat.”</p><p>A growl rumbled over the line then... “Where is she?”</p><p>“Driving fast and hot for LA.” That was what she’d told him, anyway. When she’d rushed out of those woods—nearly scaring the shit out of him because he hadn’t been ready for her; hell, he’d been about to go in those woods and scout for her—the vampire had said that she had to get to LA.</p><p>He’d told her to hop on the bike. When she had...holy fuck, talk about perfect luck.</p><p>“She’s alone,” he said into his phone as he tried to take a few steps down the road. Every step sent pain pulsing from his ankle. “Probably heading there to see if she can find any of her coven.” Not that there were any vamps for her to find there. Well, not any who would be on her side.</p><p>Greg stopped walking, sucked in breath, and said, “It looks like she lost the werewolf, so she should be easy pickings for you.”</p><p>“Yes...”</p><p>A twig snapped behind Greg. He whirled around and his ankle gave out, sending him falling right back down. His phone slipped away from him, smacked the pavement once more, and landed just out of his reach.</p><p>“Fuck.” He clenched his teeth and tried to shove toward that phone. “I need transport,” he shouted, hoping the boss would hear him. “Follow my GPS and come get me—shit!”</p><p>A wolf jumped out of the darkness. Big, black, and with sharp green eyes that promised death. One of the wolf’s front paws slammed down onto the phone.</p><p>Greg tried to scramble back. He had a gun full of silver bullets...in the saddlebag on his bike. Fuck, fuck, fuck! “Stay away from me!”</p><p>The wolf stalked closer. It was the same wolf that had followed Iona from the woods. That beast had been hunting them, had come all this way?</p><p>The wolf’s sides heaved. Saliva dripped from its mouth and it kept advancing toward him.</p><p>Greg nearly pissed his pants. He’d never had werewolves come at him before. He was part of Latham’s team. The pack. Latham’s wolves attacked others, not him. Never him.</p><p>“Don’t!” Greg lifted his hands, trying to cover his face.</p><p>The wolf’s claws sliced into his left arm. Blood flowed, too quickly.</p><p>“Stop!” Greg screamed as he tried to fight the wolf.</p><p>The wolf didn’t stop. Its eyes glinted. The beast barred its teeth and that green stare locked on Greg’s throat. Death. Greg saw the promise in that gaze.</p><p>Only he wasn’t ready to die. And maybe...maybe he didn’t have to.</p><p>“You want the woman?” Greg threw out and tried not to whimper at the pain from his arm...his ankle...his whole body.</p><p>The wolf seemed to hesitate.</p><p>“She’s heading for LA.” Who knew how long it would take for her to arrive? “She’s going after her old coven.” Greg forced a laugh. “Doesn’t realize it, does she? The vamps still left from that coven—just a handful of ‘em—they were the ones who set her up with Latham. They were the ones who lit that whole compound up in LA. They didn’t want bagged blood and peace with humans.”</p><p>So he’d been told. He knew nothing first-hand, but he was ready to trade every whisper and bit of gossip that he’d ever heard for a chance to live a little while longer.</p><p>“They’ll find her. They’ll trick her. They’ll...” Greg’s breath choked out as fear shuddered through him. The wolf wasn’t backing off. “They’ll take her head—or they’ll just give her right back to—to Latham!”</p><p>The wolf attacked. His razor-sharp teeth locked on Greg’s throat.</p><p>“Please!” Greg begged. He could feel the tears pouring down his cheeks. “Let me go...Save her. Hurry...and she could live!” Total lie. That bitch’s death was already set.</p><p>But the wolf didn’t know that, and his teeth lifted away from Greg’s throat. The fool pulled back. Turned away. Rushed back into the woods.</p><p>And then the beast ran away to play the hero.</p><p>Nothing remained. The heavy stone walls that had been erected around the perimeter of Iona’s home in LA still stood firm, but inside of those walls...</p><p>Nothing.</p><p>Blackened earth. No buildings. No people. Just...nothing.</p><p>A big FOR SALE sign hung on the front gate, swaying a bit in the breeze. The sign groaned as it rubbed against the iron gate. Iona stood about fifteen feet away from the gate, inside those cold stone walls, lost in the middle of the one place she’d always felt truly belonged to her, and she refused to cry.</p><p>She could almost feel the pain lingering in the air around her. When she closed her eyes, the screams whispered through her mind. Whispered—then burned.</p><p>As her friends had burned. Her family.</p><p>She’d transformed some of the coven herself. Found the rare few that she’d thought could handle the vampire world. They’d turned others. The coven had grown.</p><p>It was all gone now. Ashes.</p><p>Her father had wanted to burn her to ashes. Fire was such a good way to kill a vampire.</p><p>Her gaze fell to the blackened ground. She’d driven for so long that night had descended on her once more, a black shroud to cover her beloved home.</p><p>“Iona.”</p><p>At first, she thought the call was just a memory. Then she looked up, and, there, just beyond the front gate, she saw Michael staring at her.</p><p>He looked as if he’d seen a ghost. She felt as if she had.</p><p>Michael. Michael Monroe. The breath rushed from her. One of her coven!</p><p>She hadn’t transformed him. Another member of the coven—Christine—had brought him over. Christine had found Michael, broken and bloody, the victim of a hit and run car accident. He’d begged Christine for help.</p><p>The gate groaned louder as Michael opened the metal bars that lined the entrance. Iona hadn’t bothered opening the gate. She’d just leapt over the stone wall.</p><p>If Michael had known just what sort of help Christine truly offered, would he still have begged? Or would he have chosen death? Iona had always wondered...</p><p>“You should be dead,” Michael said, shaking his head as he advanced on her. “All this time...we thought you were dead.”</p><p>She kept her hands at her sides. Refused to let hope fill her. He was alive, and he’d just said...we. Others must have survived, too.</p><p>But...but she didn’t let the hope take over. Hope had been crushed too many times. “What happened here?”</p><p>“Latham,” Michael bit off the name of the werewolf at the top of Iona’s most-hated list. “When you left us, he came in with his wolves. They attacked during the day and burned the place around us.”</p><p>Her eyes narrowed. There should have been safeguards in place. Specific vampires and bodyguard humans who protected the area during the day while the vamp coven was more vulnerable. The compound had been set up with security systems, dozens of alarms. The wolves should never have been able to sneak inside and attack.</p><p>“How did you escape?” Iona asked him.</p><p>But he just shook his head. “I can’t believe...I’m so glad to see you!” Then he rushed forward and wrapped his arms around her. He smelled of fresh blood.</p><p>Michael had been out hunting. Had his prey been humans? Werewolves?</p><p>Her hands touched lightly on his shoulders. “How did you escape?” Iona asked him again. Goosebumps rose on her arms. Something was off, something felt—</p><p>A low growl drifted in the air. Iona swallowed.</p><p>Michael lifted his head. Pulled back a bit so he could stare down at her. “I didn’t escape.” He was smiling now. Flashing his fangs. He must have heard the growl, too. Like her, he knew the sound for exactly what it was.</p><p>The sound of a werewolf. After all, that deep, rumbling growl was pretty unmistakable. A werewolf was closing in on them.</p><p>“I killed the human guards,” Michael told her. He was proud. Bragging? “I made sure that the vamps on patrol were given drugged blood. Then I just walked away and let the werewolves have their fun.”</p><p>Fury had her trembling and more than ready to rip off his head. “Christine saved you!”</p><p>He shrugged. “Then she got in my way. Tried to get me to be a good, fuckin’ little vamp who followed the rules.” He shook his head and pulled a stake from his coat. “I’m not the following type.”</p><p>The wolf was behind him, racing with his giant jaws parted and his eyes trained on the prey that waited.</p><p>Michael pressed the tip of his wooden stake over her chest. “I’m guessing all that time, frozen like the dead, slowed you down, huh?” His smile widened. “I’m glad I get to be the one to send you to hell.”</p><p>She snatched the stake from him, and, before he could even have a chance to fight—he deserved no chance—Iona shoved that stake deep into his heart. “You guessed wrong.”</p><p>His lips parted. His eyes stared at her in horrified surprise.</p><p>“No time to beg this go around,” she said. “You’re dead.” Then she walked away while his body fell to the blackened earth.</p><p>The wolf was charging right at her. Iona braced her legs to face him.</p><p>But the beast started to change. Bones crunched and snapped, and the fur vanished from his body. Golden flesh emerged. Flesh she knew. A face she knew. It would be impossible to ever forget Jamie’s hard, dangerous features.</p><p>“I was...coming to save you...” The words were raspy and grating as his paws became hands that sank into the earth.</p><p>Her head tilted at she studied him. “I didn’t need saving.”</p><p>Jamie looked up at her. His gaze blazed. “That vamp’s not the only one after you.”</p><p>No, she didn’t think that he was. She wasn’t that foolish.</p><p>“A few other vamps were helping him, and they’re—”</p><p>“Here,” she finished with a nod because she’d caught their scents, too. They were just beyond the wall, waiting.</p><p>Maybe Michael had been their leader, so they’d let him try for first blood. Would they attack now that they realized she wasn’t weak? Would they be afraid—or would they try killing her, too?</p><p>“If they’re smart, they’ll run like hell,” Jamie said as he fired a fast glance toward the wall.</p><p>If they’d been smart, they never would have betrayed her coven.</p><p>Jamie’s head jerked to the right. “One’s running.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But she already heard other footsteps. Pounding toward them. “And two are attacking.” Iona rushed away from Jamie as she ran to face the threat. Fury boiled in her, the kind that just made her want to destroy. So when she saw the two vampires charging at her with hate twisting their faces and their hands curled around stakes, Iona didn’t hesitate.</p><p>She was within range now. She’d just needed to get close enough—</p><p>“Good-bye,” Iona whispered and flames shot out from her hands.</p> <p>Close enough to kill.</p><p>The vampires screamed as the fire consumed them. A fire stronger than anything they’d probably ever seen before.</p><p>My fire. One fueled by rage and magic.</p><p>They died quickly, though they probably didn’t deserve such a swift death. Not after what they’d done. Betrayal.</p><p>A hand touched her shoulder. Iona flinched and spun around.</p> <p>Jamie backed up, lifting both hands in front of him. “Easy, love. I’m on your side.”</p><p>She wanted to believe that. “The woman...” Iona couldn’t look at what was left of her, but she didn’t need to. Iona remembered Luanne’s face. “She brought the blood to me that last night. Michael and his vamps...they gave me drugged blood.” That was how they’d managed to subdue her. She just hadn’t realized it at the time.</p><p>She’d gone to sleep in her home, and she’d woken in the room that would become her prison, woken just in time to see Latham and Brian. The spell had been cast. The taste of blood filled her mouth—Latham’s blood. She’d tried to lunge at them, but her body had refused to obey her commands.</p><p>If you won’t give me your blood, then I’ll just take it. Latham’s voice. He’d tried to woo her when they first met. Offered her promises of peace between the vampires and werewolves. He’d been handsome. Charming.</p><p>But she’d seen the darkness in him.</p><p>Latham had only wanted her blood. Her power. He hadn’t cared about peace. The werewolf enjoyed his violence and death too much for that.</p> <p>I would have put him down. She’d planned to kill him, but Latham had struck first. He couldn’t kill her, because then he’d never get the blood he wanted from a corpse. And if he let her live, then he’d known she would attack him.</p><p>So he’d decided on a compromise.</p><p>Bastard.</p><p>“Iona?” Jamie eased closer to her. “We should get out of here. Latham knows this is where you were going when you left Oregon.”</p><p>“And he’s coming.” No surprise. “When Michael caught the werewolf scent in the air, he thought you were just one of Latham’s army.”</p><p>You thought wrong, Michael.</p><p>She rolled her shoulders. Weariness beat at her. She’d driven so far, non-stop, and Iona always felt drained whenever she used her fire and magic.</p><p>She risked a look up into Jamie’s bright stare and knew he could see her weakness.</p> <p>“You need to rest,” he told her.</p><p>True, but not likely.</p><p>But when he offered his hand to her, Iona found herself stepping forward and actually clasping his fingers. So many had betrayed her over the years, but...some had been her true friends. Christine. Iona could still see her so clearly in her mind. Her warm smile. Her perfect, dark skin. Her kind eyes. “Latham killed my family.”</p><p>“And mine.” Fury vibrated in his words. She could understand that rage. It was no wonder he wanted vengeance against Latham.</p><p>They were outside of the gate now. A big, black truck waited for them. She frowned at it for a moment.</p><p>Jamie laughed softly. “Ah, love, did you really think I ran all the way after you?”</p><p>Love? It was the second time that he’d called her that. She’d just been baby before. But Iona pushed the thought aside as he guided her to the vehicle. Her legs wanted to go limp, so she slumped inside, sinking into the soft seat.</p><p>She would go with the werewolf, for now. She could always slip away from him later. She could slip away any time that she wanted.</p><p>In seconds, Jamie was in the truck with her. With a flick of his fingers, he started the ignition, and they left the heavy, stone walls behind them. Iona squeezed her eyes shut.</p><p>“I would have...brought you here,” Jamie said, voice hesitant. “You didn’t have to leave me.”</p><p>“I brought myself here.” She could protect herself. She’d never needed anyone else to fight her battles. Still didn’t. “And maybe I was tired of being used.” Because he was using her, too. She knew it. Wasn’t it always about the blood?</p><p>My blood. My power. The werewolves just kept wanting it.</p><p>“Iona—”</p><p>“I want to shower.” To wash away the ash on her skin. To wash away the death. She forced her eyes to open, and Iona glanced at him. “Find the nearest hotel or just...just find me a safe place.”</p><p>A muscle jerked in his jaw, but Jamie gave a grim nod. He didn’t speak again during the ride, and Iona was glad because the ghosts from her past—the vampires she’d lost—their memories were screaming at her as she left her home behind.</p><p>She was hurting. Not a physical pain. Jamie had checked Iona’s body thoroughly and found no sign of wounds.</p><p>Her pain went far beneath the surface.</p><p>Iona was in the shower, the water pouring down with a heavy thunder that he could hear clearly through the gleaming door.</p><p>He had found her a safe place. Not some pay-by-the-hour dump. She’d deserved better than that. The woman was a queen, and he’d gotten her the best room he could afford. Five freaking stars.</p><p>He wanted to do anything and everything he could in order to make her pain go away. She’d seen enough pain, more than he’d ever expected.</p><p>I want her to be happy.</p><p>“I know you’re there...” Her voice drifted to him. Not a yell, just a whisper. That was all she needed to do...whisper, and his wolf could hear her. “Come inside, Jamie.”</p><p>His body hardened at the invitation. Hell, he’d already been hard, from the moment they entered the hotel. Iona had started to strip. Then she’d walked away. Shut the door. Closed him out.</p><p>But, now...she was inviting him inside...</p><p>He didn’t need to be invited twice.</p><p>Jamie nearly ripped the door off the hinges when he rushed into the bathroom.</p><p>The shower was huge. Easily bigger than the little house Sean had found for them back in Oregon. The place was lined with granite. Some kind of stone bench was in the shower, and, in that shower, two different jets of water poured from opposite walls to slide down over Iona’s naked body.</p><p>She stood just behind the glass door. Steam drifted around her. Her gaze met his, then she put her hand on the glass.</p><p>He could see the small birthmark on her palm. That mark had changed everything for her.</p><p>Jamie didn’t remember crossing the room, but suddenly, he was right in front of the shower door. His hand lifted and covered hers. Only that thin pane of glass separated his flesh from hers.</p><p>Her gaze met his. He could see the edge of her fangs peeking out from beneath her red lips.</p><p>“Will it be like before?” Iona asked him. “So much pleasure...it let me forget all the pain.”</p><p>Her words pierced deep into him. No more pain. Jamie lifted his hand. Stripped. Opened the door. Reached for her. His fingers skimmed over the silken flesh that had been heated by the pounding water. “This time, it will be even better.”</p><p>“Promises, promises...”</p><p>He noticed that some of the shadows had lifted from her gaze. So beautiful that she makes me ache.</p><p>His fingers curled around hers, and he bent to taste her. Mine. Her lips parted. Her tongue met his. There was no hesitation in her. Iona knew what she wanted, and she was taking it.</p><p>Jamie knew exactly what he wanted, too, and he’d be damned if he ever gave her up.</p><p>They were hungry from the start. Wild. Full of lust and need. Their kisses were hard, their tongues tasting. He’d never get enough of her. He never wanted to taste another woman. The taste would be bitter. But Iona...</p><p>Perfect.</p><p>Their hands were greedy and eager. Iona’s body was slick from the soap and water. Her fingers brushed over his chest. Over the old scars—some he’d gotten just as a child, long before he could shift and heal—that would always mark him.</p><p>Then...she slid down onto her knees before him.</p><p>Jamie hadn’t expected the move, and he tried to pull back. “You don’t need to—”</p><p>“I want this.” Demanding, not asking.</p><p>As if he’d deny her anything.</p><p>Then her mouth closed around the tip of his cock, and Jamie’s knees locked. Sweet fucking hell. Her tongue rasped over him. She took him in deeper as she sucked his flesh. The low moan that Iona gave vibrated along his cock and had him nearly exploding in her mouth.</p><p>I made a promise. One he wouldn’t forget, even if the woman was trying to make him go blind from pleasure.</p><p>He pulled back from her.</p><p>She glanced up, her eyes molten. “Jamie!”</p><p>He liked her demanding. He lifted her into his arms. He’d like her even more when she gave him a chance to taste her.</p><p>She kissed him while he carried her out of the bathroom. She licked his lips. Then she moved to his neck. When her fangs slid into his skin, his arms tightened around her.</p><p>Can’t. Come. Yet.</p><p>He had to be inside her before he came, and she—she had to be on her second orgasm by then.</p><p>Promises, promises...Now he recognized her words for the taunt they were. Iona wanted him to break. He wouldn’t, maybe.</p><p>He put her on the bed. Hated to move away from her mouth—he loved her bite—but there was a part of her that he’d been dying to taste. Would she taste as good there? Yes. He already knew she would.</p><p>His hands trailed over her body. Over the soft swell of her stomach. He pressed a kiss there. Then, down, sliding into the silken heat of her sex.</p><p>Her legs parted for him. Not far enough. He moved between those sexy legs and opened her even wider.</p><p>So fucking perfect.</p><p>Jamie put his mouth on her. Tasted her secrets and drove his tongue into her sex. She bucked beneath him, and he grabbed her hips, keeping her just where he needed her to be.</p><p>Right beneath his mouth.</p><p>Her hands slid over his shoulders. “Jamie?”</p><p>He licked her.</p><p>And felt her come. One...the start.</p><p>He kept tasting and licking and her moans filled his ears even as the beast roared inside him. Her pleasure was sweet on his tongue, but it wasn’t enough. He needed so much more.</p><p>When had she become so important to him? When had she become...</p><p>Everything.</p><p>He’d been so desperate to get to LA. To get to her. If she’d been killed...</p><p>Jamie’s hands tore away from her hips just as his claws burst from his fingertips. The claws sliced into the sheets, the mattress.</p><p>He heard her gasp. and he tried to yank back the beast. “Won’t...hurt...”</p><p>His head lifted. He met her stare. Saw his whole world reflected back in that gold.</p><p>Claim. An instinct bred into the wolf. When you saw what you wanted, you took it.</p><p>An alpha’s right. He’d never wanted another this way.</p><p>Take.</p><p>He pushed his cock into her body. Drove deep and hard and the pure fucking bliss of her had his back teeth grinding together.</p><p>Then the animal inside took over. Lust was a frenzy, need a desperation within him. He plunged into her, thrusting again and again, but he couldn’t seem to get deep enough, couldn’t feel her close enough.</p><p>He pulled away from her. Turned Iona so that she was on her stomach. Would she—</p><p>She rose to her knees. “Ready for more?” Iona asked him, tossing that shining mane over her shoulder.</p><p>He was beyond speech right then. His mouth closed around the curve of her shoulder. A kiss at first, but then, because this was the spot that would mark a claiming...</p><p>He bit her, even as he thrust into her sex. The pleasure hit them both, sweeping through them, between them, consuming in a white-hot explosion that left him hollowed out, and yet, for the first time in his whole life also feeling...</p><p>Whole.</p><p>As if he’d found something that had always been missing.</p><p>Her.</p><p>Jamie pressed a kiss to the faint wound he’d left on Iona’s shoulder. The mark of a werewolf claiming. There would be no going back from this, and he wondered just what Iona would do now.</p><p>Hopefully, she wouldn’t try to kill him.</p><p>Her arms curled around him. “I don’t want to sleep,” she whispered but her words were husky, and he knew that sleep pulled desperately at her.</p><p>It pulled at him, too. “I’ll stay with you.”</p><p>Her head tilted back. She stared up at him with eyes so deep and mysterious. “I’m afraid.”</p><p>He knew the admission had been hard. For her, hard was probably one serious understatement.</p><p>His arms tightened around her. “It’s okay. I swear, I won’t let anything happen to you.”</p><p>The last time, she’d slept for fifteen years.</p><p>He inhaled her scent. Realized that she already felt like she was a part of him. “I’ll keep you safe.”</p><p>But Iona gave a sad shake of her head. “It’s not the sleep I fear.” Her hand slid over his chest. “It’s the dreams. What I’ll...see.”</p><p>Because of the blood she’d taken from him. Jamie carefully held his expression, hoping to show only concern for her and not the fear and anger that were suddenly clawing inside of him. Just yesterday, he’d planned to keep her from sleeping. Planned to stop her from using their blood link so she wouldn’t see his secrets in her dreams.</p><p>But now I want her to know me. Pity his memories weren’t the stuff of white knights. Hell, Iona had probably met real freaking knights in her life. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And she’d battled monsters. Like me.</p><p>“I don’t want to find out...you’re as much of a monster as Latham...” Her voice whispered away as her lashes began to sag. Her slurred words were a painful echo of his own thoughts.</p><p>His eyes squeezed shut. Jamie leaned over to press a kiss to her the tumble of her hair. “I’m sorry.” Because he knew exactly what Iona would see in her dreams.</p> <p>And he knew that she’d want him dead.</p><p>But she deserved to know. He couldn’t keep secrets from her anymore.</p><p>Even if the truth she learned made her go for his throat.</p><p>Chapter Six</p><p>The bodies were broken. Twisted.</p> <p>Jagged wounds—claw marks—had ripped into the woman’s neck. Her blond hair was matted with her blood.</p><p>A man’s body rested beside her, his hands still reaching for her even in death. The heavy scent of silver burned in the air.</p><p>“Why?” The cry was torn from her...only when she glanced down, Iona wasn’t staring at her own body.</p><p>No, when she glanced down, she saw Jamie’s strong hands. Jamie’s body.</p><p>Because this was Jamie’s memory.</p><p>Part of her wanted to wake up, but once the blood memories came, there was no stopping them. This was the way the memories always came for her. She relived the memories, the moments, until the blood pushed her free. So she watched, through Jamie’s eyes, as he fell before the people that she knew were his parents. Those memories were there, too, inside of her and—</p> <p>“You’re next.” Latham’s voice.</p><p>He was standing over the bodies. His lips were twisted with hate.</p><p>“Why?” Jamie demanded again, the cry like a wounded animal. And—he was.</p><p>“Because I’m taking over the pack. He was in my way.” Latham glared at the dead man’s body and then pointed at Jamie. “You’re in my way, too, brother.”</p><p>Brother?</p><p>A knife seemed to slide into her heart, but the heart—it wasn’t hers. It was Jamie’s. And Latham had just shoved a silver blade into Jamie’s chest. Then Latham...walked away.</p><p>But Jamie didn’t die. Someone else rushed to his side. A wolf she recognized. Sean. Sean took out the blade even as it scorched and blistered his fingertips. But Jamie was still near death. Far too close. Death’s cold hands reached out as the world seemed to go dark...</p><p>Then she was somewhere else. Her eyes opened. She—no, Jamie was on a bed. “What the hell happened?” His voice seemed to echo all around her.</p> <p>Sean swallowed and glanced away, as if he couldn’t stand to meet Jamie’s eyes. “Had to...I had to give you vampire blood. It was the only way to keep you alive.”</p><p>“Where’d you get it?”</p><p>“Latham...he...he has a vamp that he keeps prisoner. She’s supposed to be fuckin’ strong.”</p><p>She? Iona’s heart burned because she realized this memory...it had been created when Latham already had her captive.</p><p>“That’s how my brother stays so strong.” Jamie jumped from the bed. Her blood had pushed his strength level higher than anything he’d ever felt before. “We have to find her. Find her...and kill the bitch. We kill her, and we’ll kill him, too.”</p><p>Iona whimpered and turned her head against the pillow.</p><p>Jamie’s jaw locked. He wanted to shake her and force her eyes to open, but...he didn’t want any more secrets between them. No more lies. Iona wasn’t what he’d expected. She deserved to know the truth about what happened. About him.</p><p>“And when you come for my throat...” His fingers brushed back her hair. “Hell, maybe I won’t even fight you.”</p><p>Because he didn’t know who had wronged her more. Him...or his brother.</p><p>Another time, another place. The memories were coming faster now as the blood pushed her to see more. Learn more.</p><p>The pounding of the surf hit her ears even as the scent of the ocean filled her nose. She paced—no, Jamie paced—inside a small beach house. A man sat before him, bound hand and foot to a chair.</p><p>The man’s blond hair fell over his eyes, but then Jamie said, “Witch, we can do this two ways. I can kill you now, or you can help me.” His hands lifted and claws glinted in the dying light. “We can both work together to take out Latham, and you can keep living.”</p><p>Witch? The man’s head rose. Brian Hennessey stared back at her. Pain froze her heart. Jamie had been working with Brain? With the witch who’d bound her?</p><p>Blood dripped from Brian’s busted bottom lip. “You can’t...stop him. He’s too strong.” Then Brian laughed. “He’s gonna take...over every pack...no stopping...”</p><p>Jamie kicked the chair and Brian fell backward, slamming into the wooden floor. “He’s strong because you gave him magic. You think I didn’t hear the story about the vampires you slaughtered? About the Blood Queen that you’re holding and slowly draining?” His lips curled in disgust. “I know you’re giving her blood to my brother. That’s why he’s so powerful.”</p><p>And for an instant, the fast flood of memories were hers, not Jamie’s. Iona remembered the prick of a needle in her arm. The slow suction as her blood drained away. Again and again and again as the years rolled away...</p><p>Her dark past vanished, and there was only Jamie once more.</p><p>“When we take his vamp away, he’ll get weak.” Jamie crouched over Sean and put his claws to the witch’s throat. “Tell me how to find her, and I’ll make sure to cut off his little blood supply. Because it’s her, right? Not just any vamp...her. I know she’s old, powerful—”</p><p>“M-magic.” Blood oozed from Brian’s throat when Jamie’s claws broke the skin. “Not just a vamp...the Blood Queen is part witch, too. Get her blood, get the power. Latham has the power.”</p><p>“Because you helped him!” Fury rolled in Jamie’s voice. “You backed the wrong brother. But you can regret that while you’re burning in hell.” His claws sank deeper into Brian’s throat.</p><p>Brian shook his head, seemingly frantic at the promise of death he must have seen in Jamie’s eyes.</p><p>Jamie’s claws lifted once more. He attacked.</p><p>More blood flowed.</p><p>The witch broke. “Th-there’s a way...end the curse...you can...can control her...”</p><p>Iona wanted to close her eyes. Wanted to slap her hands over her ears. But this wasn’t her body, and Jamie’s hands—they were too busy slicing into Sean.</p><p>“Then you tell me that way. Tell me how to control the Blood Queen, and you can help me to kill Latham.”</p><p>“My father was alpha,” Jamie said the words, knowing she probably couldn’t hear him—not while she was locked in blood memories—but still needing to speak. “I was his second son. Latham...he was my half-brother. Hell, I didn’t even know about the guy for the first ten years of my life. He just...showed up one day. His mother had never...she’d never joined the pack. That’s why his last name’s Gentry.”</p><p>Latham Gentry. The fucking wolf that had destroyed his world. “He’d been in America, had grown up there.” And, later, it would be Latham who convinced the pack that they needed to move across the pond and start fresh in the United States.</p><p>“I was a kid when Latham showed up, and Latham—hell, he was a fully mature wolf. He was also a sadistic prick.” Jamie shook his head. “Only back then, nobody but me ever seemed to see the evil that burned in him.” His fingers were laced with hers. “I tried to tell my father. He wouldn’t listen. He was too damn happy to have a strong, new wolf in the pack—a wolf with his blood.”</p><p>He’s fucking crazy. How many times had Jamie said those exact words to his father over the years? He’d seen the evil in Latham. Why hadn’t the others?</p><p>“The years passed. I could see that Latham was growing darker, more dangerous. I could also tell that he was positioning himself to be alpha.” The hell, no. “I had to leave the pack. I knew...I knew I’d never be able to swear allegiance to Latham.” His parents had been furious. Jamie’s father had disowned him, still refusing to see what Latham was. He said I was jealous. Bitter.</p><p>Their father had learned the truth for far too long.</p><p>“When I left, Sean came with me.” Sean had been his best friend for as long as he could remember. Orphaned, Sean had always been treated as the runt of the pack when they were kids. But Jamie hadn’t let the others ever hurt Sean. He’d fought plenty of battles for his friend until Sean had finally grown big enough to fight back.</p><p>When they’d left the only life they’d ever known, Sean had said, “It’s time for me to have your back.” Sean could be a smart-ass, but the guy was loyal. True through blood and bone.</p><p>They’d gone out, ready to start a whole new life.</p><p>But...something had happened. “Maybe it was you,” Jamie whispered to her. “There was talk that Latham had become obsessed with a vampire. That he wanted her for his mate, but she...she turned away from him.”</p><p>Smart choice.</p><p>“The years passed, and Latham just started to grow stronger. Crazier.” This was his shame. Jamie hadn’t returned to the pack then, despite the stories he’d heard. My father told me if I left, not to return. So he’d stayed away, thinking his father would finally see Latham for what he was—thinking that his father would stop the other wolf.</p><p>“But when my parents realized the truth about Latham and tried to fight back, he killed them.” The memory was a knife in his heart. “I came back—too late—and found their bodies.”</p><p>He’d never forget the sight. He’d heard tales of more bloodshed in the O’Connell pack. Tales of torture and death, and he hadn’t been able to stay away a moment longer.</p><p>“Latham tried to kill me, too, but vampire blood—your blood—saved me.” His breath rushed out on a rough sigh. “Didn’t thank you for that, did I? No, instead, I just went right ahead with my plans. I wanted revenge. I wanted Latham taken out, and I didn’t care who stood in my way.”</p><p>He leaned over her. “I fucking care now.”</p><p>And he heard the faintest of rustles in the hallway. Footsteps. Someone closing in.</p><p>He brushed his lips over hers. “I care now,” he said again, and went to face the threat coming for them.</p><p>“Are you sure about this?” Sean demanded as he glanced around at the two dead bodies that littered the ground. The dead werewolves were slowly shifting back into their human forms.</p><p>Jamie straightened his shoulders. She could feel the determination coursing through his veins. “The Blood Queen is inside.”</p><p>And he’d just defeated a small army in order to get to her.</p><p>Sean grabbed his arm. “How do you even know the witch is telling the truth? That whole story about waking her could be a bunch of BS. We might get in there and just find Latham waiting to gut us.”</p><p>Jamie glanced at him. “Brian burned himself out casting the spell for Latham, and he understands...my brother hates weakness. It’s only a matter of time before Latham kills Brian. The witch knows it, even if he can’t see his death coming.”</p><p>Sean frowned. “Can’t ‘see’ it? What the hell are you talking about?”</p><p>“Witches can see much in this world, and beyond it. Brian saw how to trap the Blood Queen, and he set the spell so that only a werewolf alpha could free her.”</p><p>“An alpha like you?”</p><p>Jamie nodded. Then they were running down a hallway. Attacking more wolves. Killing their own kind.</p><p>As Jamie gazed around, searching for more enemies, Iona realized that she knew this place.</p><p>Her prison.</p><p>Jamie stopped before a too-familiar metal door. “I’ll wake her, and she’ll be my weapon.”</p><p>She didn’t want to hear—</p><p>“If she wants to keep living,” Jamie said as he lifted his claw-tipped hand toward that door, “then she’ll need my blood. So she’ll do what I want.”</p><p>And she knew...He was just like Latham. Not caring what happened to her. Not giving a shit at all.</p><p>Maybe he deserved the same death as his brother.</p><p>Then Jamie and Sean were inside the room. Jamie inhaled the scent of the ocean. Saw the wispy curtains. Saw the body lying in the bed. So still.</p><p>Dead.</p><p>Jamie’s stare locked on her prone form. Sean grabbed him again. “This is a bad idea. There’s a reason she’s under, man. The woman is evil.”</p><p>No, she wasn’t. Sure, she’d done bad things, but only to those who’d come after her. She’d never hurt an innocent. Iona didn’t care what the twisted lies claimed about her.</p><p>Only Jamie didn’t think she looked evil. She was in his head, and she knew that he thought she looked...beautiful.</p><p>Insane man. She looked like a corpse.</p><p>“Go outside,” Jamie ordered Sean. “Guard the door, just in case...”</p><p>“In case the crazy bitch gets loose and kills you?”</p><p>She felt his annoyance. “In case we’ve been tracked. I don’t want anyone stopping me. Not until I put the bond in place.”</p><p>Bond. The word trembled through her.</p><p>Jamie cut his wrist. It was so strange to watch as he put his wrist—his blood—to her mouth. He tried to force her to drink. Frustration churned within him when her eyes didn’t open. “Maybe you are dead.”</p><p>Then she saw her own eyes open. “I’m not dead...” A weak, raspy voice. Her voice. “But you are.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jamie yanked open the door and put his claws at the werewolf’s throat. Sean froze with his hands up in the air. Then he demanded, “Fuck me, man, is that how you answer a door?”</p><p>“It is when I smell Latham’s scent.” And his brother’s scent was definitely on Sean. Jamie grabbed the guy and hauled him inside. “Want to tell me what the hell is happening?”</p><p>Sean swallowed. “He’s coming for you.” His gaze darted to the bed. “For her.”</p> <p>That had been the plan. Before.</p><p>“You’ve changed your mind, haven’t you?” Sean charged. He shoved away from Jamie. “Dammit, I knew this would happen. I saw the way you were looking at her in that bar. When she said she was gonna drink from me...shit, you went postal.”</p><p>Postal? Huh. Jamie had thought that he’d held onto his control pretty well. All things considered. He had remembered that Sean was his best friend. So he hadn’t shoved his claws into Sean’s side.</p><p>“She was the big secret weapon.” Sean marched around the bed. “You were supposed to use her, not fall for her.” Sean’s gaze drifted from Iona’s still body back up to Jamie. “I guess you are more like your brother than you want to think.”</p><p>In an instant, Jamie had his friend against the wall, and his claws were out. “Don’t.” There were some lines that he wouldn’t even let Sean cross.</p> <p>“Don’t what?” Sean demanded, not backing down at all. “I trusted you. I gave you my loyalty, my life. Latham’s a twisted freak, but he managed to walk the thin sanity line until he met her. Your brother couldn’t have her, and he went batshit. If she wasn’t his, then she was nobody’s. He locked her up and—”</p><p>Jamie’s fist and claws drove into the wall as his fury erupted. “He was always batshit! I saw it from the moment he came to the pack. He’d get off on torturing the weak. Hell, he almost killed you when you were only six.” But Jamie had stopped him. He’d always had to stop him. Story of my life. “You don’t remember, but I do. How the hell do you think you became an orphan? He was the one to kill your parents. He was the one who came after you. I told my father. I told him, but no one would believe me. Why would a wolf attack his own kind?”</p><p>Sean stared at him with stunned eyes.</p><p>“Because he’s a demented psychopath,” Jamie said, answering his own question as he yanked his claws out of the wall and stepped back. “And I am nothing like him.” He turned away from Sean and glanced over at the bed.</p><p>Iona’s eyes were open. She was sitting up in bed. Staring at him. Shit.</p><p>“You want her just as much as he does,” Sean said from behind him, but the werewolf’s voice shook with pain and sorrow.</p> <p>I shouldn’t have told him like that. Sean deserved better. To him, Sean was his brother, not Latham.</p><p>“Remember your big plan?” Sean said and now he was getting angry. So Jamie wasn’t really surprised when the guy said—right in front of Iona—that, “Part of that plan was that I’d let Latham find me. I’d offer him a deal. Tell him that you’d trade her for peace.”</p><p>Jamie’s eyes were on Iona. “That was just a lie to bring him out. To get him to face me. I wasn’t going to make a deal.” I wouldn’t trade you. He’d thought to defeat Latham, not to actually give Iona to the bastard.</p><p>She just stared back at him. He couldn’t read a single emotion on her face or in her eyes.</p><p>“I held up my part of the agreement,” Sean snapped. “I went to him. Found him while he was torturing some human named Greg. I told Latham, and now he’s coming to meet you. Latham sent me to deliver a message. He wants you and the vamp to meet him at her old compound, at midnight.”</p><p>The plan had been to draw out Latham. To force him to face-off against Jamie. Only...Jamie had planned to be riding high off the rush that came from Iona’s powerful blood. Finally, a fair fight between the brothers. He’d planned to drink and drink from her.</p><p>Then use her to distract his brother so that he could go in for the kill.</p><p>I can’t. Because what if he was wrong? What if he wasn’t strong enough? And if Latham got to Iona...</p> <p>Iona cut her gaze to Sean. She studied him a moment, then gave a curt nod. “We meet at midnight.”</p><p>No. Jamie hurried toward her. He leaned over the bed and had to fight to keep his hands off Iona. Don’t touch her when your claws are out. You can hurt her. “I’ll go after him myself. You don’t need—”</p><p>“I was supposed to be the instrument of your vengeance.” She pushed from the bed. Walked right by him. “And now you don’t want to use me?”</p><p>The blood memories. So she had gotten them all while she slept. No more hiding. His shoulders stiffened. “You know.”</p><p>Her burning gaze touched on him and said that she did.</p><p>“Good,” he told her and meant it. “Because I don’t want any more lies or secrets between us. I was an idiot then. I didn’t know you, and I thought—I thought who you were didn’t matter.” But she’d gotten under his skin. Into his very blood and soul. “You matter,” he said, the words too simple.</p><p>A furrow appeared between her eyes. “You expect me to believe—”</p><p>He hated that he had an avid audience watching his every word. Jeez, could Sean not give them some privacy for an instant? “I expect you to believe that I was an idiot. I was bent only on getting my own justice, and I didn’t realize the cost to you.”</p><p>Her breath seemed to come faster. Her eyes blazed. “You tied us together. For me to live, I’ll have to keep taking your blood.”</p><p>Shame burned through him. “I’m sorry, I—”</p><p>She waved away his apology with an angry swipe of her hand. “And you think I’d just let you waltz out there and face Latham alone? If he kills you, I’m dead, too.”</p><p>He realized the enormity of just what he’d done to her. Like an apology was gonna cut it. “I don’t plan on dying. I’ll kill him, and when this is over...”</p><p>“What? We’ll stay together, because you’ve bound us?”</p><p>He shook his head. “I’ll give you as much blood as you need, anytime you want it. You don’t have to stay with me. You can...” He stopped and cleared his throat. I want her with me. But he wanted her happiness more. “You can go anywhere you want,” Jamie forced himself to say, “do anything you want, and I’ll make sure the blood is always sent to you.” He’d be her personal donor, for as long as she wanted.</p><p>Forever.</p><p>She closed in on him and put her hand on his chest. Right over the heart that just seemed to beat only for her now. “And what about you? If you don’t get my blood, you won’t be the all powerful werewolf that you so desperately want to be.”</p><p>“He also won’t live forever without your blood,” Sean pointed out as he crept closer to them. His voice was controlled now, but Jamie knew the control was an act. I’m sorry, Sean. He’d kept the secret about Sean’s parents for too long. But if he’d told Sean the truth back then, the guy would have gone after Latham.</p><p>And gotten killed.</p><p>Sean was just a foot away now. Shoulders up. Head back. Eyes too determined. “All my research showed—”</p><p>Iona’s head jerked toward him. “Research? What research?”</p><p>Sean’s face reddened. “There’s...ah...a few mated werewolf and vampire couples these days. When they share blood, they stop aging. We even found one couple that had been together for seventy years, and the werewolf doesn’t look a day over twenty-five.”</p><p>Iona’s gaze came back to Jamie. So much suspicion in that gaze. He hated that look. I want her trust.</p><p>She didn’t appear to be in the mood to give it to him.</p><p>“So as long as you have my blood, you get to live forever, huh? I’m betting your brother,” Iona said the word like the curse it was, “knew all this, too. That’s why he just wouldn’t take my hell, no for an answer when he asked me to mate with him.”</p><p>“I’m killing him...” Latham would never touch her again.</p><p>“No, I’ll do that. I can fight my own battles, and pick my own mate.”</p><p>A mate that isn’t you. He knew exactly what she meant. His fingers lifted. Curled around the hand that she still had pressed over his heart. “It isn’t just your battle. He took my family.”</p><p>“Mine fuckin’, too,” Sean snarled.</p><p>Jamie flinched.</p><p>Iona’s small, pink tongue slid over her bottom lip. “I-I know.” Her gaze darted to Sean. Jamie saw the sympathy in her stare, then her stare returned to him.</p><p>“I won’t let him keep hurting and torturing. I will stop him.” Then, he confessed his shame, “As I should have stopped him years ago.” Because if he had, then none of this would ever have happened. His parents’ deaths. The slaughter of the wolves in their pack. Her imprisonment. “I won’t walk away this time.”</p><p>He was alpha now. He’d been ten when Latham killed Sean’s family. Jamie’s father hadn’t believed his tale. He’d said it was a child’s wild imagination.</p><p>Latham had been furious with Jamie for trying to reveal his slaughter. His brother had found him, separated him from the others...As soon as I’m alpha, I’ll take your head, brother. Latham’s threat had whispered through his head so many nights when he’d been a child.</p><p>But now...I’m coming to take your head, Latham.</p><p>Jamie had fought to be strong. He had his wolf, a fierce, powerful beast that knew how to battle. How to survive. How to conquer.</p><p>And his blood had woken Iona. Only an alpha’s blood could have woken her. He was an alpha. The power was inside of him, as it had always been. Maybe that was why Latham had hated him so much. Maybe his brother had known that, one day, the life-or-death battle would come between them as they fought for dominance.</p><p>That day is now.</p><p>“I thought you were different.” Iona’s voice was so soft now. Not soft because of sadness, but because of the fury he saw blazing in her eyes. “Why couldn’t you have been different?”</p><p>“I am different.” He pressed her hand harder against his chest. “I’ll prove that to you.”</p><p>But she laughed and the sound cut into him. “There’s nothing to prove. I’m in your blood, wolf. I know you.”</p><p>He pressed his lips to hers. Kissed her hard and deep and wild. Kissed her with all of the consuming passion and lust that he felt for her. “And you’re in mine,” he gritted out against her lips. “I feel like you’re a part of me.”</p><p>Sean cursed and backed the hell away from them.</p><p>Jamie’s gaze searched hers. Her breath heaved but she didn’t speak.</p><p>He did. “You’re a part that I didn’t even know was missing...the best part of me.” His heart.</p><p>Then, because it was what he had to do, Jamie stepped away from her. He turned to face Sean. “I’m sorry about your parents. I didn’t tell you...because I knew you. Even at six, you would have challenged him. You would have died.” He hadn’t been powerful enough to save Sean. Not then.</p><p>And he’d kept the secret, kept it for so many years, because Latham’s power had just continued to grow. Jamie hadn’t wanted to risk his best friend’s life. He’d protected him the only way he knew how...by staying silent.</p><p>It wasn’t a time for silence any longer. It was a time for vengeance.</p><p>Jamie exhaled slowly. “If Latham said midnight, then we’re getting there as soon as night falls. We’re not going to give him a chance to set a trap.” They were only going to let Latham die.</p><p>“Of course, there’s going to be a trap,” Iona said, but her voice wasn’t quite steady. “With Latham, there’s always a trap. Werewolves in the shadows, vamps ready to betray their own kind, witches with their spells...”</p><p>“He doesn’t have a witch this time,” Jamie pointed out with a fast glance her way. “So there’s no power for him there.”</p><p>“Isn’t there?” Iona asked as she swept past him. “Latham doesn’t make mistakes when it comes to battle. He killed Brian, yes, but I’m betting that was only because he’d already found another witch who was more powerful. A witch he’ll try to use against us in our midnight battle.”</p><p>The kick in his gut told Jamie that she was right.</p><p>“So we need to be ready to fight that witch with our own magic.” From the corner of his eye, Jamie saw the flames begin to dance over Iona’s hands. “And when it comes to magic, this time, I will be holding my own.” The flames flared higher. Jamie’s eyes met Iona’s. The gold in her gaze matched the flames.</p><p>Beautiful.</p><p>Death had never been so gorgeous. Latham was a fool. Against them, he’d have no chance.</p><p>Time for his brother to die.</p><p>Chapter Seven</p><p>“I want you to bite me.”</p><p>Iona blinked at the low, growling words. They were inside the heavy walls that had once surrounded her old home, and the scent of ash teased her nose, a reminder of the fire and death she’d dealt earlier.</p><p>Her head turned so that she faced Jamie. Sean was about fifty yards away, perched carefully at the top of the west side wall. A group of trees grew near the wall, partially concealing Sean as he watched...and held a rifle equipped with silver bullets.</p><p>“My blood can increase your power,” Jamie told her as his gaze searched hers. “You know it can. A werewolf’s blood can amp you up for the battle.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So it could. The blood of paranormals always seemed to pulse with power. And she would love to have more power before she faced off against Latham but... “If I take more from you, then you’ll just grow weak before the fight.”</p><p>A muscle flexed along his jaw. “Not if you give me your blood, too.”</p><p>An exchange. To make them both stronger. Yes, they needed it, but for some reason, when he asked for her blood, it made her feel...used.</p> <p>So she narrowed her eyes and told him, “The first time I fucked you, I did it because I wanted to make Latham angry. I wanted him to catch your scent on me. I wanted him to know that I was giving my body to someone else.” Anyone else. Not just—</p><p>Jamie shook his head. “When you lie, a faint line appears right...” He tapped his finger between her brows. “Here.”</p><p>Iona was so shocked she almost fell onto her ass. As it was, she barely managed to keep crouching next to him without lunging for the jerk. “I’m not lying!” She was the Blood Queen. Like she’d have some easy tell that gave away her lies.</p><p>He stroked the spot between her brows. “There it is again.”</p><p>Sonofabitch. She had a tell. All these centuries, and no one had mentioned it to her before? Wonderful.</p> <p>“Don’t worry,” he said as if reading her mind, “I doubt anyone else noticed. I just know because I can never seem to take my eyes off you.” His hand fell away. “Just so we’re clear, I made love with you the first time because I wanted you more than I wanted breath. That’s the same reason I did the second time, too. And the reason I’ll do it every chance I get.”</p><p>Arrogant wolf. “I did want to piss off Latham.” But...more...Time for her truth. “I also just wanted you.”</p><p>His eyes seemed to darken.</p><p>“Is that what you needed to hear?” She demanded, angry. “That you could make the Blood Queen want—”</p><p>“I don’t really give a shit about the Blood Queen,” he said, the Irish thickening in his voice. “I care about Iona. She’s the one I want. Not some evil queen who is supposed to give little kids nightmares.”</p><p>Nightmares? Really?</p> <p>“I want to give you my blood now because I want to make sure you’re as strong as you can be. And, no,” he muttered, “you don’t have to give me yours. Just take mine. Just...be strong. I don’t want Latham to ever hurt you again.”</p><p>The wolf was sure acting like he actually cared about what happened to her.</p><p>And she did need his blood.</p><p>Iona lifted his hand to her mouth. Her fangs sank into his wrist, and the image of them—in that horrible room, her on the bed, him leaning over her—flashed in her mind. Then his blood slipped over her tongue—warm, spicy, that delicious taste that was only Jamie—and her eyes locked with his.</p><p>She didn’t see calculation in his gaze. No secrets. Just desire.</p><p>His power fueled her, heating her body from the inside out. She drank, taking in that wonderful blood and power. Then her tongue licked over his skin as she tried to soothe the small marks that she’d left behind.</p><p>Her head lifted. His taste was still in her mouth.</p><p>“I’ve never wanted another woman the way I want you.” Gravel-rough, the words seemed torn from him. “And I’ve never met another woman who was so far out of my reach.”</p> <p>She was less than a foot away from him.</p><p>“If I had to do it all over again, I’d find another way to break the spell. I wouldn’t force you to be bound to me.”</p><p>She couldn’t help it. Iona laughed at that. Clueless werewolf. “You really think I’m the one being forced?” Her hand lifted and curled under the hard square of his jaw. “I’m over sixteen hundred years old. I can stir fire with a thought. I’m about to turn your brother to ash...” She smiled at him and knew her fangs would flash. “You’re the one who’s going to be forced to stay with me, wolf. Do you actually believe I’d ever let my blood supply get away?”</p><p>He blinked.</p><p>Men. Always thinking it was all about them.</p><p>She shook her head and turned away.</p><p>He caught her hand. Held her tight. “Love, the only way I’d ever leave you...you’d have to tell me to leave. Cause otherwise, I’d count myself lucky to be at your side.”</p><p>She stilled. Then her heartbeat kicked up in a double-time rhythm. Jamie sounded as if he meant the words. She stared into his eyes and searched for the truth.</p><p>He did mean them.</p><p>“What do you want from me?” She asked him, barely recognizing the soft voice as her own.</p><p>“Everything.” Just as soft, but his words were darker. So deep. “But I’ll start with this...give me a chance. Give us a chance. Let me show you that I’m not just a beast.”</p><p>She already knew that.</p><p>“Let me show you the man I can be. Let me—” Jamie broke off, his nostrils flaring. Then he spun away from her. “He’s here.”</p><p>She hadn’t caught Latham’s scent yet, but she’d take Jamie’s word for it. Her gaze darted to the big wall surrounding the old compound. She saw the dark shadows scaling the stones, climbing over the wall. Coming for us. Iona counted at least a dozen forms.</p><p>“Vampires...werewolves...” Jamie’s claws were bursting from his hands as his shift started. “What we...expected...”</p><p>Yes, it was. Now it was time to give Latham what he didn’t expect. She barred her throat to Jamie. “Bite.”</p><p>His eyes were more beast than man. “You don’t...” He still tried to speak with a man’s voice.</p><p>“I want you to drink.”</p><p>His hand lifted. His claws seemed to tremble, then he sliced lightly over her skin. His dark head lowered. His tongue rasped over her wound.</p><p>She shuddered against him. Her eyes closed. His lips brushed over her. His claws were at her waist, but he was so careful not to hurt her.</p><p>Latham had never been careful with anyone or anything.</p><p>A shot echoed through the night. She knew the sound had to come from Sean as he took out prey with his silver bullets. Those werewolves fighting with Latham had picked the wrong side.</p><p>Their mistake.</p><p>Sean had chosen a position of his own on top of the west wall. A position that let him take out his prey as he wanted, picking them off with his silver bullets, one at a time.</p><p>“Get away from her!” Latham’s enraged roar. Showtime. “You bastard, that’s my queen!”</p><p>Jamie’s tongue licked over her flesh once more. A rough caress. Then he was pulling back. Gazing at her with a gaze that burned with emotions she didn’t want to name. “No,” he said, voice thundering out just as powerfully as his brother’s. “She’s mine.”</p><p>Then he whirled toward Latham. The two brothers charged at one another. Shifting werewolves were on the ground, some in pain because silver bullets had ripped into them, some were just contorting from the force of their transformations.</p><p>And the vampires who’d sold their loyalty to Latham were there, standing back because they’d caught sight of her. She heard their whispers...</p><p>“Blood Queen...”</p><p>“She’s back...”</p><p>“Back and pissed,” Iona clarified, letting her voice ring out and not glancing over at Latham and Jamie even as the scent of blood deepened in the air. “So come closer, and try to take me down, if you think you’re strong enough.” Then she crooked her index finger at them, daring the fools to come and get her.</p><p>Because she needed them closer. They had to be close for her fire to reach them. Just a little closer...</p><p>A tall, red-headed vampire made the mistake of lunging for her.</p><p>When he was within range of her power, she tossed a ball of fire right at his chest. He hit the ground, screaming and rolling as he tried to put out a fire that just wouldn’t be stopped. Only she could stop those flames. Iona wasn’t in the mood to stop them.</p><p>The other vampires froze.</p><p>“Who’s next?” Iona challenged.</p><p>Bones crunched behind her. More shifting wolves. She turned and saw a big, gray wolf rushing toward her.</p><p>A shot thundered out.</p><p>The wolf fell, a silver bullet embedded in his spine. There was a shout then, and Iona saw Sean jump down from his position on the wall. He attacked, fighting the wolves that had come for him.</p><p>He was fighting—and winning his battle.</p><p>Iona’s gaze darted to the right. Sean and Latham weren’t in human form any longer. Two big, fierce black wolves were fighting, tangled in claws and teeth and blood. The wolves—they looked just alike to her. She wasn’t sure which wolf was winning the battle...or which wolf was Jamie.</p><p>“I’m next!” A woman’s voice shouted. “And I’m not afraid of that bitch!”</p><p>You should be.</p><p>The line of vamps parted. A woman rushed forward. A small woman with long, curly, brown hair. She smirked at Iona and fire rose above the woman’s delicate palm. “See? I can do it, too.”</p><p>Ah, so this was the new witch that Latham had picked up. Being right felt so good. “I’m not drugged this time.” Iona felt she should point out that little fact.</p><p>The witch frowned.</p><p>“That’s how Latham’s first witch got the advantage. The drugs in my system slowed me down...” Iona threw her flames at the woman. The witch’s hair caught fire, and the woman screamed as she stumbled back. “I’m not slow now...and lady, I’m a hell of a lot stronger than you!”</p><p>The witch—minus a whole lot of hair—ran away, shrieking. Easy enough. Too easy. Must be slim-pickings when it came to magic power these days.</p><p>Iona lifted her hands into the air. It was time to send a message to the paranormals out there. She didn’t want to be looking over her shoulder, worried that others would come and hunt her.</p><p>They needed to be too afraid to even whisper her name.</p><p>Blood Queen. She could be her, again, in order to be free.</p><p>“Run,” she ordered the fools still around her. “Or die.” Then she called up the magic inside, letting it whip through her and form a circle of fire, a bright ring that closed around her and the two black wolves that fought a life-or-death battle. Everyone else was on the outside, and the fire snapped out at those vampires and werewolves, attacking with greedy tendrils of flame that ignited flesh and sent shrieks into the night.</p><p>Most ran. They would be the ones to spread the new story of the Blood Queen’s rebirth.</p><p>As for the ones who didn’t run? The slow? The idiots who still thought they could kill her?</p><p>They died.</p><p>And then there was only Iona...in the circle with her wolves.</p><p>She could kill them both with a thought. Send the fire ripping at them but...</p><p>Iona didn’t want Jamie to die. Which wolf?</p><p>She needed to see their eyes. Their scents were too linked then—they were too close to each other. There was too much blood. If she could just look into the wolves’ eyes, she’d know her lover.</p><p>The claws of one wolf shoved into his opponent’s stomach. A long, mournful howl filled the night. The injured beast heaved on his side and slowly, slowly began to transform.</p><p>The fur melted from his body. Familiar, golden flesh emerged once more. She knew the strong line of that jaw. Knew the heavy slash of those cheeks.</p><p>The other beast snarled into the air, a cry of fury and dominance. Then the beast turned to face Iona.</p><p>Not Jamie’s eyes. But then, she’d already known her lover was the one bleeding out on the ground.</p><p>She lifted her hands and tossed as much fire as she could at Latham. She wanted that bastard to burn.</p><p>Only, he didn’t burn. The flames just sank into his thick fur and disappeared. Tendrils of smoke drifted into the air.</p><p>The snap and crunch of his bones reached her ears. He shifted before her, a fast, brutal shift.</p><p>She couldn’t see Jamie’s body behind him. Was Jamie still alive? And why did it feel like someone had ripped out her heart?</p><p>“I’ve got so much of your blood pumping in me,” Latham snarled as he closed in on Iona and grabbed her wrists. His hold was rough, too strong, so painful it felt like he was about to break her bones. “Thanks to all that blood, your magic can’t hurt me, Iona. Nothing can anymore.”</p><p>The fire sure couldn’t. But she wasn’t about to give up yet. “Then let’s just see what my teeth can do...” And she sank her fangs into his throat.</p><p>His blood burned her, going down as hot as acid on her tongue, but she didn’t let him go. She’d drain him, if that was her only way and—</p><p>He screamed and pulled away from her.</p><p>No, he didn’t pull away. Jamie had snatched Latham back. Because her Jamie wasn’t dead. He was on his feet and he’d spun Latham around to face him...spun him around and, as she watched, Jamie shoved his claws into his brother’s chest.</p><p>“She was the distraction,” Jamie whispered as he let his brother stagger away from him. “You should have made sure I was dead.”</p><p>Latham’s head swung toward her. He shook his head even as blood pumped from his chest. “I’m...immortal.”</p><p>“Not anymore you’re not,” Iona told him. Jamie had been right. Latham was still too fixated on her. Fixated enough to make a fatal mistake.</p><p>He’d turned his back on a werewolf who wanted his blood.</p><p>Latham’s teeth snapped together. “You won’t...live...without...me!” He rushed toward Iona.</p><p>And Jamie’s claws slashed over his brother’s throat even as the thunder of a gun echoed and a bullet slammed into Latham’s chest.</p><p>Sean...doing his job and avenging his parents. Overkill could be a good thing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Iona slowly walked around Latham’s body. Jamie stood over his brother, chest heaving, and with blood dripping from his claws.</p><p>“Looks like I’m still living just fine,” Iona murmured to the dead werewolf. She was living, and Latham had finally gotten just what he deserved.</p><p>His eyes were wide open. His face twisted in horrified disbelief. He truly hadn’t thought that he’d die.</p> <p>He’d been wrong.</p><p>She stared down into his eyes. She could still see the madness there. Even in death. “I went to Latham...” It seemed like another life. Maybe because it was. “Because I wanted to form a truce between the vampires and the werewolves. I didn’t want more bloodshed.”</p><p>When blood was all they had around them.</p><p>She looked away from Latham. Stared up at Jamie. “I wish you’d been in the pack when I came calling.”</p><p>“So do I.”</p> <p>Her head tilted as she studied him. “What would you have done?”</p><p>“Loved you from the start.”</p><p>She blinked and shook her head. “No, you—”</p><p>“I know you don’t love me, Iona.”</p><p>They were standing over his brother’s body. It wasn’t a place to talk about love. Not the right place. Not the right time. There was too much death here. Too many memories.</p><p>And she wouldn’t lie. “I don’t know what I feel for you.” At that moment, she just felt...relieved. One less monster to face.</p> <p>Finally, she was free. Latham would never hurt her again. Free.</p><p>Jamie’s gaze held her own. “Do you think,” he asked her softly, “that one day, you might?”</p><p>Her eyes wanted to sting with tears. Tears, from the Blood Queen? What had happened to her? Maybe it was the place. The echoes of pain and sadness. Get away. She couldn’t be there any longer.</p><p>Or maybe...maybe it was Jamie. He was asking for things that she wasn’t sure that she could give to him. Fifteen years...gone. She wanted to see the world again. See what had changed. Learn how she’d changed.</p><p>She couldn’t talk to him about love then. She needed her freedom.</p><p>A freedom that their bond had taken away.</p><p>Iona spun around, giving him her back. Then she began to walk away, from Latham and from Jamie. Every step that she took tore at her heart.</p><p>What was she supposed to feel for Jamie? Everything had happened too soon. Love couldn’t come this way for her.</p> <p>She needed time. Time was stolen from me. Now I have to learn to live again.</p><p>Good thing that she was a vampire. Time was on her side. Always.</p><p>“Iona!” Jamie’s cry stopped her. Not because he yelled after her with fury or desperation. But because he said her name with...love. Maybe he’d been saying it that way for a while now, and she just hadn’t noticed.</p><p>He’d stopped calling me ‘baby’ and he’d been calling me ‘love.’” Her throat ached. She glanced back at him. He hadn’t moved. He wasn’t trying to stop her from leaving him. Maybe because Jamie knew that she’d have to come back to him, sooner or later.</p><p>The blood would always bind them.</p><p>“Do you think you ever might?” Jamie said the words softly, with blood on his flesh, with his claws out, and with his eyes so fierce and bright.</p><p>She needed to give him an answer. Iona just wasn’t sure what to say. So she didn’t speak, but, almost helplessly, she found herself nodding. It was a small movement, and she wasn’t even sure he noticed it. Then she saw the hope on his face and knew that he had.</p><p>“But I can’t stay with you because we have to be together.” She’d come to hate him then, just as he’d hate her if she forced him to stay at her side. “It should be...we should be together because that’s what we want. Because anything else is unthinkable to us.” That was why she had to get away then. Latham was dead. The battle over. Now she had to figure out what the hell she wanted. What she needed.</p><p>So with her head up and her back straight, she began walking once more. She passed by the dead. Passed a silent Sean. She didn’t let her tears fall. After all, she truly was the daughter of a king, and she wouldn’t let anyone see her break. Not Sean. And not even the one man who’d managed to touch a heart she’d long thought was ice-cold.</p><p>Chapter Eight</p><p>“Are you sure that you’re ready for this?” The witch stood over Jamie, a silver knife gripped in his hand.</p><p>The tip of that knife burned molten.</p><p>“It’s going to hurt like a bitch,” the witch warned then the guy gave a long whistle. “I sure as hell hope the woman is worth it.”</p><p>Jamie gritted his teeth. Ray was a smart-ass, some witch that Sean had literally dug up from a hole in Mexico, but the guy knew his magic.</p><p>Well, his dark magic anyway.</p><p>And he knew how to break the bond that locked Jamie’s blood to Iona’s.</p><p>Two months. Two long fucking months had passed since she’d walked away from him in LA.</p><p>He knew where she was, of course, because it wasn’t easy to overlook a woman like her.</p><p>He’d sent his blood sent to her. Werewolf take-out. But he hadn’t gone to her, because he couldn’t offer her the one thing that she needed.</p><p>Choice.</p><p>He’d taken that from Iona when he gave her his blood.</p><p>I can’t stay with you because we have to be together. Her voice haunted his nights. And his days. It should be...we should be together because that’s what we want. Because anything else is unthinkable to us.</p><p>Anything else was unthinkable to him, and without her, he was going insane. Slowly, moment-by-brittle-moment insane.</p><p>He needed her. He wanted her. And, hell, yeah, he’d get his heart cut out for her. Not because you have to be with me. Once the spell was broken, she could stay because that was what she wanted to do.</p><p>“You have to sever the bond to free your vampire.” Ray looked a little too comfortable holding that knife three inches above Jamie’s chest.</p><p>Sean stood in the background muttering once more about bad ideas and wrong choices. The same song he’d been singing when they first went to wake up Iona.</p><p>“Am I gonna live through this?” Jamie asked the witch.</p><p>Ray frowned at that. “You expect to live?” He seemed surprised. “I thought it was just about her living.” He began to lower the knife. “I can’t make any guarantees for you.”</p><p>Sean lunged forward and grabbed Ray’s wrist. “Guarantee it.” Lethally soft.</p><p>Ray swallowed.</p><p>Jamie stared at the tip of the knife.</p><p>“I-I...he should survive. It will hurt, probably worse than anything he’s ever felt, but he’ll live...and his vampire will be free.”</p><p>That was what he needed to know. “Cut me,” Jamie ordered and his hands fisted, pulling against the heavy chains that held him place. Silver chains that Ray insisted were necessary.</p><p>Not a good sign. But at least he’d stopped feeling the burn from those chains now.</p><p>Jamie closed his eyes. Pictured Iona. His beautiful queen.</p><p>Then the knife stabbed into his chest, bringing the fires of hell, and he roared her name.</p><p>Pain exploded in her chest. Burning, white-hot, twisting and cutting and tearing into her flesh.</p><p>Iona opened her mouth to scream but found she didn’t have any breath. The smell of burning flesh filled her nose even as bile rose in her throat.</p><p>What is happening to me?</p><p>She’d been on her way to find Jamie. She’d discovered a witch who knew a way to break their bond. Only...</p><p>Another burst of pain had her nearly on her knees.</p><p>Iona screamed and realized that another cry had echoed her own.</p><p>Her head lifted as sweat soaked her clothes. She stared at the house before her, the one nestled off the main road and hiding in the shadow of thick trees.</p><p>Jamie’s house. The roar she’d heard, it had been her name. His voice.</p><p>Iona forced her body to straighten. Jamie. Fear and adrenaline rushed through her.</p><p>Another pain-filled roar shook the night, and she ran forward. Iona kicked in the house’s front door.</p><p>Two men—probably werewolves—turned and lunged at her. She knocked them back and followed the echo of that roar down a hallway. Then to the right. Another kick and the door before her flew off its hinges.</p><p>A man whirled toward her. Some guy with too-long red hair. He had a long, wickedly sharp knife in his hand. The blade was glowing red.</p><p>Jamie was on a table, chained. Smoke rose slowly from his flesh.</p><p>“What are you doing to him?” Iona leapt for him.</p><p>Someone grabbed her from behind. “Wait!” A familiar voice shouted in her ear. “He’s a witch, he’s breaking the bond and—”</p><p>And she tossed Sean into the nearest wall. Iona advanced on the witch. “You’re hurting him.” Us. She rubbed her own aching chest. “You’re dead.” She raised her hands. Let the fire burn.</p><p>“Oh, shit,” the man muttered with eyes that had doubled in size.</p><p>“No!” Jamie’s snarl.</p><p>Her head snapped toward him. Surely he wasn’t protecting his attacker?</p><p>“It’s...almost...finished...” Sweat soaked his body. The brightness of his eyes had dimmed. “One more slice, and you’re free.”</p><p>She pushed the man—now she knew he was a witch—away and rushed to Jamie’s side. When she saw his chest, she had to bite her lip to hold back her own scream of fury. It looked like the skin had been branded, a dark, fierce red. But she knew the knife was enchanted and the branding wasn’t just on the surface.</p><p>The brand would go all the way around his heart.</p><p>No, not all the way, not yet. Jamie had said that he needed one more slice.</p><p>The floor creaked behind her.</p><p>Iona spun around and grabbed the knife from the witch’s hands.</p><p>“Do it,” Jamie urged her. “Finish it. Be free...then you can come back to me.”</p><p>“The witch was cutting out your heart!” She’d found her own witch, a woman who told her this could be done, that this was the way to sever the tie between them.</p><p>Take out the heart and the bond is broken.</p><p>“No.” Jamie shook his head and jerked on the chains. Silver chains. The fool werewolf had let himself be locked down with silver chains. “I’ll still live,” Jamie told her. “Ray’s not actually taking my heart—”</p><p>Yes, yes, she knew how the magic worked. The enchanted blade both cut and healed at the same time. The witch would cut a circle around the heart, severing its connection to the body. Then, in the next instant, the blade would burn and heal—reconnecting the heart with magic. The severing and healing would continue until a full circle had been cast around the heart.</p><p>Brutal. Hellish. Iona knew that the agony she’d felt was just a psychic echo of the pain that he’d experienced. Her witch had warned her of that, too.</p><p>When one is sacrificed, the other will feel the whisper of the pain. Just a whisper. The real agony is a hundred times stronger than that whisper.</p><p>“A spell.” She glared at the knife.</p><p>“The knife cuts through the magic that binds you, but he still lives.” Did the witch think those words would make her feel better?</p><p>She knew their hearts were linked. The blood pumping from her heart linked to the blood pumping from his. To cut their ties, a heart had to be severed.</p><p>And Jamie, he was willing to face the agony, for her?</p><p>She licked her lips. Felt tears on her cheeks. Not about breaking. About living. “You’re not like Latham.”</p><p>He stared up at her. His face was too pale. Her wolf looked too weak. “Told...you...”</p><p>She snapped the knife and let the pieces fall from her fingers. The witch gasped and got the hell back.</p><p>Sean had picked himself off the floor. He stood back, too. Smart guy.</p><p>She grabbed the chain around Jamie’s right wrist. Shattered the heavy silver. Did the same with the links that bound his left hand.</p><p>“I can feel you...” Iona told him, and brought his hand to rest over her heart, “in here.” Even when they were apart, she felt him. Like a caress in her soul, she could feel him touching her.</p><p>His gaze searched hers.</p><p>“You let him come at you with that knife...” Well, the witch wouldn’t be comingagain since she’d destroyed his knife. “He would have cut me out of your heart.” And taken you from mine.</p><p>Jamie rose. The back of his hand slid down her cheek, and she turned her face to better feel his touch.</p><p>“Nothing will ever take you from my heart,” he told her. The words sounded like a promise.</p><p>He’d been willing to suffer so much...for her.</p><p>Jamie sucked in a deep breath. “I can...I can still send you the blood. I can do whatever you want...”</p><p>“Kiss me.”</p><p>He frowned, then shook his head.</p><p>She put her hands on his shoulders. Those shoulders of his seemed even bigger than before.</p><p>I missed him. “I want you to kiss me, Jamie.”</p><p>His mouth took hers. Ravenous and wild with its hunger. The same hunger that she felt.</p><p>Tears pricked at her eyes. She’d lived so long and had never expected to find a man who looked at the Blood Queen and...loved.</p><p>He loves me.</p><p>So she kissed him back. Hot, eager, their mouths met. She didn’t care about the others in the room. They didn’t matter. Nothing, no one mattered to her except him.</p><p>His arms locked around her. He pulled her close, right between his legs as they hung over the edge of the table. His mouth was feverish on hers, his hands seeming to touch her everywhere.</p><p>“Missed you...” Jamie growled the words against her lips. Then his head rose. He stared at her with the eyes of a beast in the face of a man. “You’re...giving us a chance?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She had to shake her head, and when she did, pain flashed in his gaze. Iona spoke quickly, desperate to make him understand as she said, “No, Jamie, I’m giving us more than a chance.” Her shoe crunched over the remains of the knife. “I want to give us forever.”</p><p>His hands tightened around her. “Be...sure.”</p><p>“I’ve never been more sure of anything.” Or anyone. He’d been willing to suffer such torture, for her.</p> <p>And she’d seen more of Jamie’s secrets in her dreams.</p><p>Him, watching her with not just lust, but longing.</p><p>Him...rushing through the day and night as he tracked her to LA, desperate to find her before Latham got to her.</p><p>She’d seen a wolf run until he’d his paws had bled. Watched through his eyes as Jamie drove a truck like a madman until he’d arrived outside the dark walls of her old home. She’d felt his fear...until he’d seen her.</p><p>Her lips brushed over his once more. He’d woken her up, but not just from Latham’s spell. He’d given her life again.</p> <p>He’d given her love, and it was exactly what she wanted. No, he was what she wanted now.</p><p>Not because they had to be together.</p><p>“Because anything else is unthinkable,” she whispered. And it was. Her body and soul had ached for him. She needed him. Couldn’t imagine going another single day without her werewolf.</p><p>The door squeaked closed behind them, and she knew that Sean had grabbed the witch and gotten out of there.</p><p>Good.</p><p>Because the Blood Queen had finally found her werewolf king, and she wasn’t letting him go.</p> <p>Not now. Not ever.</p><p>Some bonds weren’t meant to be broken.</p><p>“Forever,” Jamie said against her lips. A demand.</p><p>Her werewolf had just spoken true...some bonds really were meant to last forever.</p><p>They kissed again. She tasted the wildness of his beast. The love of the man.</p><p>Forever. </p> </body></html>"]