["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>One</p><p>Paine</p><p>“Where the fuck did that piece of ass come from?” Pulling my head out from under the hood of the car, I follow Butch’s line of sight. He lets out a low whistle while staring out one of the garage doors. Irritation and jealousy shoot through my body, and I have no fucking clue why. Maybe it’s the way he said it or the tone of his voice, but I look past him to see what he’s talking about.</p><p>The blonde we both have our eyes on now looks like she stepped off a runway. Or what I’m guessing a runway model would look like. Although from the pictures I’ve seen in magazines of models, her curves are better. Her platinum-blonde hair hangs all the way to her waist where the ends start to curl. It makes me want to wrap my finger around one of them, grab a fistful of it as I pump my cock inside her. I wonder how she’d moan as I drove in and out of her.</p><p>Her short dress hugs her curves in all the right places and shows off her long legs. My eyes track down her stems to the ridiculously tall heels she’s wearing. I have no idea how she’s even walking in them on the uneven concrete that covers the front of my shop. The way she’s dressed makes me think she must be rich royalty. What she’s doing here I have no fucking clue because she clearly doesn’t fit.</p><p>She looks over at us, like she feels us watching her. Her gray eyes meet mine, and it’s like a sucker punch to my system. All the air leaves my lungs, and all my blood rushes to my cock. It makes me feel light-headed, and I grip the car I’m working on for support.</p><p>I’m too fucking old to get a hard-on just by looking at a chick. Twenty-eight isn’t old, but it’s too old to be getting turned on by something so simple. Too old to be having dirty thoughts about a random chick, something I haven’t done since I was a randy teenager. I don’t go dipping my dick into any random hole. A half-smile pulls at her lips, and it’s as if she’s trying to play innocent or some shit. Must be part of her game.</p><p>When she finally pulls her eyes from mine, I feel an unexplainable loss. Shit. That can’t be good.</p><p>“I got this one boss,” Butch says with a shit-eating grin on his face. It’s a look I know all too well, and I can see he’s making like he’s going to go greet the blonde piece of ass at the front of the office. Before he can make it two feet, I’m grabbing him by the arm.</p><p>That isn’t fucking happening. Butch always has women wrapped around his finger. Scratch that, wrapped around his dick is more like it. He’s got women falling at his feet whenever we go out, and it’s probably because he’s always running his mouth. From what he says, I seem to have a ‘don’t talk to me’ look pasted across my face, scaring them all away.</p><p>I have the urge to lay him out for just thinking about talking to her, but I push the feeling back because it’s fucking ridiculous. Like either one of us have a chance with a woman like that. Who knows what she’s doing in a small-ass town like this. Probably passing through and something went wrong with her ride. Here today, gone tomorrow. The thought makes my gut clench. I’ll need a taste before she’s gone. Something I’m sure won’t be easy.</p><p>“Finish dropping the engine in. I got her.” The irritation in my voice is clear as I order him back to work. I want to be the first to talk to her, but I see Joey beat me to the punch when I enter the front of the office.</p><p>“How long has it been making that sound?” Joey asks, pulling a pen from her dark black ponytail. When her hair catches the light a certain way, it almost looks blue.</p><p>“Well I was—” The blonde duchess stops talking when she finally notices I’ve joined them in the office. A slight blush hits her cheeks, and it makes my cock jerk. Double shit. A goddamn blush is making my cock ache with need.</p><p>I hear Joey drop the notepad down onto the counter, and I look over to see her rolling her eyes and returning the pen to her ponytail.</p><p>“I was sure it would be Butch.” Joey says with a smirk on her face. I’m sure she did think it would be Butch. Because chasing ass isn’t something I do. But it seems this little duchess has me bending some rules.</p><p>“He’s busy and he needs your help.” It’s a lie. Butch can finish the job on his own, but I don’t need Joey in here giving me lip or stocking up on things she can give me shit about later.</p><p>She snorts, but exits out the door I just entered and leaves me and the duchess all alone.</p><p>We both just stare at each. I’ve never seen a woman so perfect in my life. There is something about her, how flawlessly she is put together, that makes me want to throw her on the floor and fuck her right there. She’d be so dirty when I was done with her. The grease on my hands would smudge all over her clothes, her hair would be wild after I drove in and out of her, and her make-up would be smeared. I could look at her and know I did that. That I made this perfect little slip of a woman get dirty for me and she’d love it, beg me to do it over and over again until she was dripping with my cum.</p><p>She finally breaks eye contact, pulling those gray eyes from mine. It’s then I realize that I’m staring at her like a love-struck puppy. I clear my throat and get to the subject before I cum in my pants thinking about all the things I want to do to her.</p><p>“Your ride?” My voice comes out deeper than I mean for it to be as I make my way around the counter. I need to get a little space between us and cover up my hard cock before I scare her off.</p><p>“Oh yeah,” she says, biting her lip. I want to tell her to stop that, but I just brace my arms on the counter, waiting for her to continue. “I just got to town, and it started making some weird thumping noise.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She looks like a scared rabbit, ready to bolt at any moment. I need to pull it back before I make her run. If she knew the things I was thinking about moments ago, she’d be long gone. I’m guessing the men she’s been with were smooth and soft with her, something I’m not sure I could be, but hell, if she asked I would sure as hell try just to have her beneath me for a few minutes. But I don’t think a few minutes would ever be enough with someone like her. I bet a taste would drive a man to his knees. She’s not used to talking to a dirty grease monkey like me. No, she’s more into suits and polos down at the country club. The thought of someone else touching her has a red haze hitting my eyes. They wouldn’t know what to do with her. I may not even know what to do with her, but I would die trying to give it to her. A woman like her should be worshiped and fucked regularly.</p><p>“It’s probably just your fan belt,” I finally say, trying to pull my thoughts from wanting to fuck her.</p><p>“Is that an easy fix? I have a ton of stuff I need to get done.”</p><p>I bite my tongue to keep from saying something rude. I’m sure duchess here has a big day of shopping ahead of her and doesn’t want to spend it in a dirty garage with the likes of me. I reach out wanting her keys, and she jumps back. She looks down at my hands, and I realize they aren’t the prettiest. They’re still smeared with grease from the last car I had my hands inside of. They show signs of manual labor, something she’s probably never done before. I bet her skin is soft and silky all over. Her hands wrapped around my cock would feel a whole lot better than my own, which is all my dick has been getting for a very long time. Maybe that’s why my dick is begging for something it shouldn’t be wanting right now.</p> <p>“Keys,” I snap, making her jump again. I’m irritated that my hand repulsed her, and I can’t help the tone of my voice. I look up, and I can see the pulse in her neck start to pick up as she looks back at the door. I see what she’s thinking, but I put a stop to it.</p><p>“Only shop in town, duchess. Give me the keys.”</p><p>Her gray eyes go hard at the nickname, and she gives me an icy glare. Fuck. Even that turns me on. I’m starting to think there isn’t anything she could do to turn me off. How can someone piss you off and turn you on at the same time? I’m not sure how she’s doing it, but she is.</p><p>She digs in her purse, pulling her keys out and tossing them to me. I catch them in the air, wishing she would have just handed them to me. I could have stolen a touch and found out if she’s as soft as she looks.</p><p>“Come back in hour and she’ll be good to go.” I point to the clipboard on the counter. “Fill out your name and number so I can call you if I’m done before you’re back.”</p> <p>She quickly scribbles down her number before turning and leaving the shop, giving me a nice view of her ass as she stomps out. I pull out my phone and look down to see her number and name and laugh when I see she identified herself as ‘Duchess.’ I program it into my phone before ripping her number off the sheet and putting it in my pocket. I hate the idea that it’s just sitting there for anyone to access it.</p><p>I quickly pull her Carrera GT into the shop and change her fan belt in record time. I’d like to say it’s because I’m just trying to get shit done, but I’d be lying to myself. I just want her back in here. The whole time I’m working on her car, I’m irritated at the idea that she’ll never give me the time of day. I’m a fucking joke to someone like her. Why even try?</p><p>Pulling out my phone to give her a call, I look up and see she’s already standing in the front office again. This time I see her laughing at something Butch just said, more at ease with him then she was with me.</p><p>I’m going to fucking kill him. He may be a little rough around the edges, but his blond hair and blue eyes always seem to pull the women in. He cleans up nicer than I seem to be able to. I look over to see Joey trying to hold back a laugh as she looks between me and what’s happening in the front office.</p><p>“Pull the fucking car out and drop the keys on the front counter when you’re done,” I snap at her, only making her laugh more. After a second she lifts her hand, extending her middle finger at me.</p><p>I stomp across the garage and throw the door open a little harder than I mean to. I’m shocked the glass window in the door doesn’t shatter when the door hits the wall. The sound makes Duchess jump again. Shit. All I seem to do is make her jump.</p> <p>Butch just leans against the counter like he doesn’t have a care in the world, and irritation boils inside me. I look over at him and put an end to the conversation he’s having. “Back to work. I don’t pay you to flirt with customers.”</p><p>Duchess blushes at my words, looking embarrassed. If I had my way with her, that blush would cover every part of her skin. Yeah, like you’ll get that chance, a voice in the back of my mind says. Girls like her who ooze class won’t give me the time of day. No matter how hard I work, or what I have in my bank, they just think they’re better than me. Types like her want men in stiff suits and five-star dinners. I met a couple girls like her growing up, and I’ve learned to stay clear, and I always have, but something about her is pulling me in.</p><p>Butch winks at her on his way out, and it makes me grind my teeth as he strolls out the open door. If I blackened both of his eyes, he wouldn’t be able to wink again for a while, I think to myself. Once he’s through the door, I reach over and slam it shut. I try to get myself together and push back all these foreign emotions. I take a breath and try to smooth things over. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“All fixed up. It was the belt,” I confirm. “Follow me to my office, and I’ll write up your bill.” I start walking back towards my office and feel myself release the breath I was holding when I hear the click of her heels following me. I look at the windows that line the garage and see both Joey and Butch watching. Probably wondering why I’m taking her to my office and not just checking her out in the front. I want her in my space. Maybe when we’re in my small office, I can finally get a smell of her.</p><p>I motion for her to sit down when we reach my office, and I close the door behind her. Then I hit the blinds on the window that looks out into the shop so no one can see us. Just her and me now.</p><p>Taking my seat at my desk, I watch as she fidgets with the trim of her dress in her lap. Her pink nail polish is perfectly done, and as I watch her fingers play with the edge, all I can think about is flipping her dress up to see if her panties match.</p><p>She looks so out of place in here. Just like most of the shop, my office is a freaking mess. I never got a nice desk or chairs because they’d be stained in two weeks. Everything is worn and old so I don’t worry about it getting fucked up. The contrast between her and the room is another reminder that she’d never be with someone like me. Even if I pulled just as good of a living as a suit, it’s still all about appearances to people like her. I match their bank accounts, but I sure as shit don’t belong.</p> <p>“It was an easy fix.” I tell her as I start to fill out the receipt. I should have broken something else and made sure she stayed in town a little longer. “But I wouldn’t go too far for a while.” The lie trips off my tongue easily, but I don’t have a moment of guilt about it “Stay close to town, I mean.” I raise my eyebrows at her to gauge her reaction.</p><p>“Oh, I’m in town indefinitely.” The way she says it makes it clear she’s not happy about it. She doesn’t look like she belongs around here, seeing as there isn’t much to this small town. If you want something fancy, you have to make the two-hour drive into Denver.</p><p>“It’s one twenty-five for the belt with labor.”</p><p>Without hesitating she reaches into her purse and pulls out a silver American Express card.</p><p>“We don’t take those.” I don’t know why, but I don’t tell her that we take cards, just not Amex. I’m letting her draw her own conclusions.</p> <p>“It’s all I have on me unless I can run to an ATM or something real quick.” She starts to rise from the chair like she’s leaving.</p><p>“Sorry, no ATM, and the bank is closed. I’m closing up shop for the night, so I need to get paid.” I lie again just as easily as before. They keep slipping from me, but I want to see her again. Maybe if I can get her back here tomorrow, I can come up with a game plan of making a move on her, or at least find out who she is and why she’s here. Everyone knows everything in a small town like this.</p><p>She plops back down into the chair. “But—”</p><p>I cut her off. “Just come back in the morning with the money.” I stand up and walk to the door like I’m going to leave, but she stops me.</p><p>“I need my car tonight. I still have a few errands I need to run. I have plans.”</p><p>I pause at the door, turning to look at her. She’s still sitting in the chair, staring up at me. Her eyes are pleading, like she’s trying to get me to crack with a pout on her full lips.</p> <p>My eyes move to her chest and linger there, and it makes her breathing pick up. It gives me an opening, and I’m going to take it. I stroll back over to the front of my desk and sit my ass on the edge in front of her, my legs almost touching hers.</p><p>“You could pay me with something else.” My eyes roam her body, and I let my meaning become clear. I don’t know what made me say it, but the words are out of my mouth before I can pull them back. I expect her to stand up and slap me, or her to storm out of the office, but she just wiggles in her chair a little.</p><p>“Wha-what do...” She can’t even get the words out, and I don’t make her finish, because I’m impatient. If she isn’t running then I’m going to push a little more.</p><p>“Pull up your dress up. I want to see your panties.”</p><p>Her face turns red, but she grabs the hem of her skirt like she’s going to do it. But instead she just bunches it in her hands, her knuckles going white. Is she really this fucking shy? Nobody who looks like her, who’s dressed like that, is shy. She’s a rich duchess coming into a place like this and asking for it. Fuck it, if she wants to play shy, I’ll help her out.</p><p>Leaning forward, I grab her by the arms, her soft skin like silk against my fingers. I pull her to me so her legs go on either side of my large thighs as I stay seated on the edge of the desk. She lets out a squeak in response but makes no move to stop me. Interesting. I had no clue this would be so easy.</p><p>Reaching down with my stained hand, I flip her dress up, revealing white satin panties. Her legs are spread just enough that I can see a little wet spot.</p><p>Fuck.</p> <p>She’s turned on, and I haven’t even done anything to her. The sight has my cock pushing against the zipper of my jeans, and I welcome the pain. Because it stops me from cumming in my pants.</p><p>“Hold it,” I say, indicating that I want her to hold up her dress for me. I need my hand for this.</p><p>“But I showed you. Now give me my keys.”</p><p>“That was for the belt, materials. This next part is for the labor.” I lick my lips just thinking about the next part. God, what I’d give to bury my face between her thick thighs and make her scream my name. I’d make her tell her who’s giving it to her. That she’s fucking the local mechanic. Not some preppy dick in a suit, which I’m sure is what she’s used to. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m not sleeping with you,” she blurts out, and it makes me clench my teeth. In spite of her words, her dress remains bunched up in her hands and she keeps herself revealed to me. That’s fine, Duchess. Pretend all you want. I’ll play if it gets me a little bit of you.</p><p>“Trust me, when I fuck you, you’ll beg for it.” Reaching down, I run my fingers across the soft panties, just teasing her a bit. I feel the damp spot against my digits, and I need more. I use two fingers to pull them to the side and feel her bare pussy. No fucking hair. I bet she has it waxed off. But for who, I wonder. The thought makes me jealous and angry, and I can’t hold back the growl that leaves my chest.</p><p>Her eyes go big at the sound, and I yank at the panties, pulling them from her body. I want to see her bare pussy for myself, and I want to mark it as mine. The thought is primal and barbaric, but I don’t care. I want this pussy for myself. Only mine. She might have waxed it for someone else, but I’m sure as fuck going to put my mark on it.</p><p>“What are you doing?” Her words come out breathless, but she makes no move to stop me or drop her dress. In fact, she leans into me a little more. She says one thing, but her body is betraying her.</p><p>I bring the underwear to my nose, smelling her sweet scent, and I let it fill my lungs, I almost lose it when I feel the wet spot against my face. Knowing I don’t have much time before I lose my load of cum, I drop her panties onto my desk and free my cock from my jeans.</p><p>“Oh, my God. You’re—”</p><p>“Huge,” I finish for her. “I know.”</p><p>Grabbing one of her hips, I pull her closer to me. Using my other hand, I guide my cock to her pussy lips. They part easily for the head of my dick, and I find her hard little clit begging for attention.</p><p>“Oh, God.”</p><p>“Not God, baby. Paine,” I correct her as I start to move the head of my cock back and forth on her clit. I want to rip the top of her dress and suck her big tits, but it would ruin the dress, and I don’t want her walking out of here with them on display. So I grip her hip a little tighter, making my hand stay in place.</p><p>“What are you doing to me?” Her eyes look glassy, her pupils dilated. She’s so fucking turned on, the smell of her pussy fills the room. Her juices coat the head of my cock, showing me how much she wants this too. Her body is begging for some cock.</p><p>It takes everything in me not to say, “Playing with your pussy, which is now mine.” Instead I go with, “Collecting the bill with your cunt.”</p><p>She moans, dropping her head back, her hair brushing my fingers that are gripping her hip.</p><p>She looks so young and pure, like she’s never known this kind of pleasure before. Shit.</p><p>“Please tell me you’re legal,” I growl. I’m not sure if I could pull away if she told me she’s underage. It might just be worth the prison time.</p><p>“Twenty-one,” she mumbles, lost in the pleasure. Thank fuck. I don’t know what I would have done. I’m sure there isn’t a thing that could pull her from me in this moment.</p><p>“You like this?” I ask, picking up speed, rubbing her clit back and forth with the head of my dick, slipping easily through her juicy pussy lips. “You use this pussy to get whatever you want, don’t you? I bet you have men wrapped around your finger.” The words make me sound like an asshole, and I know it. I started this, but I hate that she so easily let me have her. Does she do this with everyone? Is this some game to her? Here I am, falling all over her and this could mean nothing to her, but maybe she thinks the same of me. She has no idea that I don’t fall all over women. Hell, I haven’t even thought about a woman in years. Too busy working on my shop. Until her.</p><p>I push the thoughts away because I won’t ruin this for myself. I’m going to enjoy this perfection I have in my hands while I’ve got it.</p><p>“Fuck you.” She says the words angrily as she tries to move her hips. She’s mad as hell but wants to make me go faster. I tighten my grip on her even more so she can’t take what she wants. She’s bound to have marks there tomorrow from the way I’m holding her.</p><p>I can tell she is about to cum, her body strung tight. I’m so fucking close too, but I’m controlling this. She already has too much control of me; I at least get this.</p><p>“Soon I’ll be fucking you, Duchess. You’ll take me inside your little cunt until I fill you with every drop of cum I have. Then I’ll do it over and over again until you beg me to stop.”</p><p>“Paine!” She yells my name, cumming at my filthy words. She’s probably never been talked to like that, and I fucking love it.</p><p>I let myself cum with her, releasing the cum that’s been building up in my balls since she strolled her ass into my shop. My cum coats her clit, her pussy lips, and thighs. I cum harder than I’ve ever cum in my entire life. I cum so hard, I see stars. The intensity rocks me to my core. It’s something I’ve never felt before, and warmth fills my chest.</p> <p>When I finally come back to earth, she’s dropping her skirt and backing away from me.</p><p>“Duchess,” I say, reaching for her and wanting to touch her lips to mine. I want to finally get a taste of her. She had to have felt what just happened here. It was life changing. There’s something between us, but she dodges my hand and bolts for the door.</p><p>It takes me a minute to get my still-hard cock back into my jeans before I run after her. By the time I make it to the front of the shop, I see her car pulling out, the screech of tires filling my ears. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“How’d she get the keys?” I look over and see Joey standing behind the counter. I give her a hard glare, and she holds her hands up in defense.</p><p>“They were sitting right here. I thought she was good to go.” She raises an eyebrow in question, but I don’t answer her.</p><p>Fuck me, I don’t even know her name.</p><p>Two</p> <p>Penelope</p><p>“Let’s do a shot!” my cousin Lizzy shouts as she jumps up from our table and starts dancing backwards to the bar. Her brown curly hair bounces with her steps as she nearly runs into two people along the way. Her moonwalk makes it clear she doesn’t need another drink, but I sure do.</p><p>My body is still buzzing from the orgasm Paine gave me hours ago, and I need something to take the edge off. If this is what orgasms are really like, I’ve been missing out. I’m starting to think the ones I’ve been giving myself aren’t orgasms at all. When Paine touched me, it was as if my body came to life for the first time.</p><p>I still can’t believe I did that. I’m chalking it up as one final dirty thing I did before I get married next week. I’m guessing Scott would never talk to me the way Paine did today. I know for a fact he doesn’t get the response from my body that Paine does.</p><p>I follow Lizzy to the bar, needing another shot so I can forget about my impending nuptials to a man I’ve met a handful of times. The only time I ever talk to him is when I’m trying to reach my father. I’ve not so much as hugged the guy. I was just as shocked as everyone else when I got the wedding invitation in the mail. An invitation to a wedding I didn’t even know was happening until two weeks ago. Apparently, right after I graduated from college I was to be wed. Glad I got the invitation, otherwise I may have not known.</p> <p>I’d planned to come to town and tell my father that I would marry his lawyer over my dead body, but I got shut down fast when he informed me that if I didn’t do as he commanded, he’d cut me off from seeing my grandmother. I’ve just graduated with my business degree, and I don’t need him or his money anymore. I can get a job and make my own life, but telling me he’ll never let me see my bedridden grandmother again was enough to have me doing whatever it is he wants. It was the nail in my wedding coffin.</p><p>My grandmother is all I have. I have no idea how she puts up with him, but she doesn’t have anyone else to rely on. Having never known my mother, I clung to her as I was growing up. She was the only softness in my life. My father just treats me like an object he can use to further his political career. I was shipped off to boarding school at the age of eight, where I stayed until I graduated high school and went right into college. Both were all-girls schools. My mother died in childbirth, so my grandmother stepped in as best as she could. My father had the final say, though, using my need for a good education as a reason to send me away. Thankfully, I had my grandmother’s letters to keep me company, and any holiday I had, she would come visit me, saying I didn’t need to come home. I think she knew even then that he held all the power over me, and as she got older and her health began to fail, he now has power over her. The two of us try to cling to one another while someone else calls the shots.</p><p>Maybe that’s why I had my reaction to Paine. I’d never met a man like him. He has power within him, but it didn’t feel like he wanted to control me. No, it felt like so much more than that. It felt like Paine wanted to devour me. He wanted to consume my body, yet in his presence I felt like I had the dominance. He oozed sex and masculinity, and it woke something inside me I didn’t even know was there.</p><p>“Two lemon drop shots, please,” Lizzy says to the bartender, and he gives her a look like really? What did she expect? The bar is worn, with old pool tables, dartboards, and a wooden floor that has seen better days. I like it, though. It goes with the town. The place feels homey, like everyone knows everyone else. Sadly, I don’t know anyone here, and I grew up in the town. Well, technically it was my home address, but I was never here. I was always away at school or some kind of summer program. When I did get to come home, I spent all my time with my grandmother at the family estate. My father now lives in the mayor’s mansion, and oddly enough, I’ve never even been inside it. Although I’m going to see it soon because I’m getting married there next week. I have to hold back the eye roll at my own thoughts.</p><p>“Two vodka shots will be fine,” I finally say, seeing that neither one of them is going to move. “Whatever kind of vodka you’ve got is fine.” The bartender fills two shot glasses and slides them across the bar to us.</p><p>“He didn’t even chill them.” Lizzy eyes the vodka like it might bite her. I don’t blame her, but at this point I just don’t care. I’d take a shot of anything. “Told you we should have gone to DeDe’s.” She pouts at not going to the nice bar in town, but I wanted to come here because it’s different to places I normally go to. I find myself wanting different a lot lately.</p> <p>“Just do it fast.” I grab one of the shots and shoot it back. The burn of cheap vodka makes me cringe, but for some reason I smile.</p><p>Lizzy coughs, then grabs the man’s beer next to us to use as a chaser. She’s comical about it, and it gives the stranger an in to talk to us. “Can I buy you ladies another? It’s the least I could do for the bride-to-be.”</p><p>I adjust the stupid sash I’m wearing. Lizzy and Deb demanded I put on the pink band emblazoned with ‘Bride-To-Be’ in pink lettering. The guy is hot, but not Paine-hot. The thought pulls my mind back to Paine again. His thick, muscular body leaning close into mine. His huge hand on my waist as he holds me in place. His dark-blond, shaggy hair and scruffy beard made him look wild. His waist was trim, exaggerating his broad shoulders, and those arms looked like he could pick up ten of me. He looked like he’d run a motorcycle club on one of those TV shows. I bet he even drives one. God, what would it feel like to be on the back of his bike? I squeeze my thighs together as I remember his long thick cock. I think about the vibrations from a motorcycle and having him between me like that, and it’s enough to have me soaking my panties all over again. Just the thought of Paine has me hotter than I’ve ever been in my life, and all I can think about are his dirty hands on me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Shot! Shot! Shot! Shot!” I hear the other girls from our table start to chant, and it pulls my thoughts away from Paine. I really wish Lizzy hadn’t set up this little bachelorette party, but she has no idea I have no desire to get married. We are distant cousins, not super close, having really only spent some holidays together over the years. Between that and a few random emails, she doesn’t know what’s really happening.</p><p>I had no idea she had anything planned, but when she told me we were going out, after the day I’d had, I just went with it. Now I’m wearing this stupid sash and crown, and I don’t know how my night could get worse. At least I convinced them to come to Smokey’s tonight instead of somewhere else. I just need a dive bar with lots of alcohol, and this is the perfect place.</p><p>We take the next round of shots that the guy next to Lizzy bought us, and I have to promise to save him a dance when the music starts up. We all chat and drink for a while until the bar finally fills with music, and all of us girls jump up. We head for the small makeshift dance floor as the house band starts to play. I’m feeling good from the alcohol, and I sway my hips, closing my eyes and enjoying the music.</p><p>“Holy shit. Paine’s here.” At Lizzy’s words, my eyes pop open. “God, he’s so fucking hot.” She knows Paine? Of course she does. She grew up here and everyone knows everybody, it seems. It takes everything in me not to turn and look at him, so I hold my drink and focus on the stage. I look down at myself, and it makes it me curse. Shit. The sash. Lizzy stares unabashedly, not an ounce of shame. “Oh my God, he’s coming this way. Damn, Penelope, he looks pissed.”</p> <p>Three</p><p>Paine</p><p>I walk into Smokey’s and head to the bar. It’s surprisingly busy considering this hole in the wall is usually half-empty. After the day I’ve had, I need a drink. I move over to my usual stool, and Jake, one of the bartenders, comes over with my usual beer. To say I’m a creature of habit is an understatement. I like my order, and I like things to be simple. But little Duchess came into the shop today and shook my whole world upside down. I need to have a drink and try to forget about her, something I haven’t been able to do since she strolled into my life.</p><p>Butch and Joey stand behind me, and Jake slides their usual to them. I grab mine and nod my thanks, but he stands in front of me, not going anywhere. When I raise an eyebrow in question, he leans over the bar like he’s got a secret for me. What the hell? Are we in sixth grade?</p><p>“There’s a bachelorette party happening here tonight if you guys are looking for some action.”</p> <p>I can feel Joey’s eye roll beside me, while Butch leans in a little closer. I, on the other hand, have no interest in getting laid tonight. I’ve had enough trouble with pussy today to last me a while.</p><p>An image of my little Duchess’ cunt flashes in my mind, and my dick twitches. What I wouldn’t give to have slipped my thick cock inside that tight hole. I bet she would have sucked it off just from the twitches of her orgasm. I shake my head and take a drink of my beer, hoping to wash the thoughts away.</p><p>“Point me in the right direction, Jake. You know I’m always looking for some fresh trim in this town.” Butch sits up and peers over the crowd as Jake points towards the dance floor. Curiosity gets the better of me, and my eyes follow Jake’s pointing finger. Suddenly, Butch laughs and looks back at me. “Looks like that rich chick with the Porsche is the bride-to-be.”</p><p>I grip the bottle of my beer so tightly, I’m surprised it doesn’t shatter. Everything in my vision goes red, and suddenly, my beer is being taken out of my hand. I look over and see Joey has taken it from me, and she’s giving me a look.</p><p>“I’ll hold it for you, boss,” she says, and nods over to the dance floor.</p><p>I don’t say a word as I get up and start to make my way over to a crowd of girls. There’s probably about a dozen of them, all in various stages of drunkenness. I see Lizzy Eastman standing just in front of what looks like the back of my Duchess’ head. She’s turned away from me, and Lizzy is standing in front of her, almost like she’s blocking her.</p> <p>“Hey, Paine! It’s so good to see your body, I mean, you.” Lizzy snorts as she slurs her words, and I’m a little concerned about how she’s going to get home. We aren’t best friends, but I know her name and have seen her grow up around here. This is a small town, so even if we’ve never been introduced, we know who the other one is.</p><p>“I got this one, boss,” Butch says, tapping my shoulder and stepping up beside me. “What’s up, Lizzy. Show me some of those dance moves.” Butch takes her hand and Lizzy follows him around to the other side. Butch may talk a lot of shit, but deep down he’s a good guy, and I know he’ll make sure she’s safe.</p><p>I’m still standing in the same spot, and little Duchess hasn’t moved an inch. She’s tight with tension and facing away from me. It’s as if she thinks if she doesn’t turn around, then I’m not really here.</p><p>“When’s the big day?”</p><p>I see her shoulders deflate a little, and she turns to face me. She looks me up and down and licks her lips, and it takes everything in me not to kiss her right here, right now. Those thick lips look like they’re just begging for a dick, and I want to help her out with that need.</p><p>“You gonna answer me, Duchess?” I try to keep the anger out of my voice, but I don’t think it’s working.</p><p>She looks around and then bites her lip, once again making me want to stuff my cock in her mouth. She finally brings her eyes back up to mine. “Next week.” The words are barely whispered, but I hear it over the music. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Why do her words feel like a shot to the heart? Like I’ve lost something that I never had to begin with? I need to get my shit together. Obviously, this little rich girl just wanted to play with a boy from the wrong side of the tracks before she got married. Have one last little fling. Well, I’ll give her something to remember before she says “I do.” I tell myself this, but it’s a lie. I want her myself.</p><p>Grabbing her by the arm, I start dragging her towards the back of the bar. I only feel a slight protest, but she quickly matches my pace and comes along willingly. I pull her down the long hallway that leads out to a back alley, but instead of going out there, I open the door to the back storage room and pull her inside. There’s just a single lightbulb overhead, and once I turn it on, I close the door behind us and lock it. The room is full of cleaning supplies, a bucket and a mop. It’s a small dirty room and just about perfect for what I want from her.</p><p>I turn to look at my Duchess and see her eyes are a little wide with fear. “What do you want, Paine?”</p><p>“I want you to leave that crown on while you suck me off.” My words are filthy and cocky, but I don’t care. She wants to be used up and have a fling, I’m going to get what I can. Never mind what my heart is telling me. I’ll ignore it for now.</p><p>Her little tongue comes out and licks her lips, like she’s preparing, but she shakes her head. I let out a short laugh and crowd her personal space.</p><p>“Are you trying to tell me no? You couldn’t seem to find that word earlier today either, Duchess.” I undo my belt and then my jeans. I keep eye contact with her as I reach into my boxer briefs and pull out my hard cock. I wrap my big hand around it and stroke it a few times. “You wanna get dirty with a man from the wrong side of town before you tie the knot, then you better get on your knees and get to it, Duchess.” I need those juicy lips surrounding my dick.</p><p>“It’s not like that,” she says, licking her lips again and looking down between us. Her eyes grow wide when she sees how big I am, and I feel my cock grin as she starts to reach out towards it. Before she makes contact, she looks up at me hesitantly. She’s had to have done this plenty of times, so I don’t know why she’s nervous. She needs to get on her knees and open up. I’m horny as fuck because of her, and she needs to fix it.</p><p>The thought of her with other men makes me so fucking jealous. I’ve never felt this kind of raw anger before, and it’s driving me crazy. Normally, I’m a laid-back guy who doesn’t get caught up in women, but one sight of this little thing and I’m being led around by my dick. The sight of her sash and the words ‘Bride-To-Be’ written across it make me even madder.</p><p>I reach out, quickly snatching her wrist. “You ran out so fast on me earlier, I didn’t get your name. Why don’t you use that sweet little tongue of yours to spell it out on my cock?”</p><p>Her mouth opens in shock, but I see her pupils dilate, the gray darkening as a shiver goes down her back. She can fight it all she wants, but she loves the dirty talk. If this is all I can have of her, I’ll take it and deal with the consequences later. I’ve got to cum before my balls explode, and this is all her fault. Time for her to pay up.</p><p>Slowly, she nods her head and runs her hands down my chest and stomach, making me hate my shirt as she moves lower down my body and gets on her knees in front of me. I hold my cock out for her, and I watch as she reaches out and takes it from my shaking hands. I feel a tremble go through my body at the same time, and I don’t know why I react to her the way I do. I don’t have any control over my need, and it’s maddening.</p><p>“Open up, Duchess. I want you to earn that crown you’re wearing.” She opens her mouth, and I reach down, grabbing her soft blonde hair in both hands. She looks up at me through her long black lashes just as the tip of my cock touches her lips. “And when you get me off, I want you to drink down my cum so that when you go back to that asshole you’re going to marry, you’ve got me in your belly.”</p><p>A white pearl of cum beads at the end of my dick and drops onto her bottom lip. She licks it up, and I feel her warm tongue against my cock, and it makes another white pearl appear. She wiggles the point of her tongue into the hole of my cock as if she’s trying to get all of the flavor she can. When I see a bit of cum coat her tongue, she closes her eyes and moans at my taste. At the sight, I almost lose it. “Fuck,” I moan, closing my eyes tightly and trying to think about baseball. I don’t want it to be over yet. Jesus, I don’t ever want it to be over.</p><p>Suddenly, I feel her warm mouth open wide over my dick, and she sucks me to the back of her throat. I look down, and the sight makes me grip her hair tighter. I feel her tongue licking the underside of my cock, and it massages more cum out of me. The thick vein underneath is pulsing, and I know she’s getting thick drop after thick drop in her mouth. It turns me on to think of me inside her and having her on her knees in front of me gives me power.</p><p>“Goddamn, Duchess. You give such good head. I think you might suck my soul out of my dick.” I feel her giggle around my cock, and the feeling goes straight to my balls. She’s got a mouth made for fucking, and I start to pump my hips a little while holding her hair. I fuck in and out of her mouth, and she just kneels there, taking it.</p><p>Her hands come up to stroke the length of my cock she can’t get in her mouth, and she grips me there, rubbing up and down as I keep up my shallow thrusts, her mouth open and taking what I give her. I want this to last forever, but her mouth is too sweet. It’s too hot and too good, and I won’t last much longer. I can feel her excitement while she’s licking me, and I can see her body moving to her own rhythm. She’s turned on by this, and knowing that takes me to the edge. Fast. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’s moaning around me and nearly giddy as she sucks my dick. She’s loving it, and I can’t hold on. “I’m gonna nut, baby. You want it in your mouth or on your face?”</p><p>She pulls back just a second and says, “Mouth,” while catching her breath and going back to my cock. She sucks harder and deeper, and it’s so good. I want to close my eyes, but I can’t stand the thought of missing a single second of this.</p><p>Just before I let go, I see one of her hands move from the base of my cock and go between her legs and up her dress. The fact that she’s touching her pussy while sucking my cum is all it takes to send me over. I grip her hair around her bridal crown and pull her down on my cock as I cum deep in her throat. I feel her swallow around the head of my dick, and I’m barely able to stand upright as she takes every drop of me.</p><p>I watch as the hand between her legs speeds up, and her body tenses at the same time as mine. Jesus Christ, she just came while sucking my dick. Goddamn, I wish I could taste that orgasm. I wanna get her on the ground and sixty-nine with her. If she cums just from sucking my cock, imagine what she’d do if I was eating her pussy at the same time.</p><p>After I come back down from outer space, I gently touch her hair and stroke her cheek with my thumb. I feel so protective of her, and right now, I just want to scoop her up in my arms and take her home with me. We lock eyes, and something passes between us. It’s as if she’s reading my mind and asking me to take her away.</p><p>I open my mouth to ask her to come with me. I could take her home and never let her leave, she’d be mine forever, but suddenly there’s a loud crash on the other side of the door. The spell is broken, and she’s on her feet in a flash. I hurriedly tuck my cock back into my jeans and turn around, pulling the door open.</p><p>“There you are!” Lizzy belts out, and I see Butch running up behind her, throwing his hands up in apology. “I’ve been looking for you for forever. We gotta go. One of your sorority sisters—Mindy, Wendy, Cindy, I can’t remember her name. Anyway, she threw up on the drummer and we gotta go. The limo is about to leave. Bye, Paine. Always nice to see your body, I mean, you.” Lizzy reaches out and snags my Duchess’ wrist, pulling her from me.</p><p>Just before I can reach out and pull her back to me, she’s through the door. I take one step, and she turns back to me, shouting over the music.</p><p>“Penelope. I was spelling out Penelope.”</p><p>Four</p><p>Paine</p><p>“Penelope,” I mumble to myself, taking another swig from my beer.</p><p>“If you say that word one more time, I’m going to knock you off that fucking stool,” Joey says, dropping her shot glass back on the bar. Seems I’m not the only one trying to drown my sorrows, but I’m half-failing at it because this is only my second beer. Maybe I should switch to the hard stuff like Joey. She seems well on her way to not remembering the night.</p><p>I can’t fucking believe I let her slip out of here. She’s probably going home to her fiancé. I should have made it clear there was no more fucking fiancé in her life. She may have been his yesterday, but she was mine tonight. I coated her pussy and mouth with my cum and marked her as my territory. She doesn’t know it, but now she’s mine. The sooner she comes to terms with it, the better.</p><p>Fuck, I don’t even know her last name. Everyone I asked in the bar has no clue who she is. Shit. I pull my hand through my shaggy hair, trying to release some of the tension. I haven’t even known this girl ten hours and I’m all kinds of fucked up. She’s got me twisted up like never before, and it was so hard and fast I couldn’t stop it.</p><p>“I fucked up,” I tell Joey, looking over at her fiddling with the paper on her beer bottle, pulling it off and sticking it back on.</p><p>“Yeah, you did. You went after something you can’t have and you shouldn’t want,” she says, her dark green eyes coming to mine. Something like understanding flashes in them. I wonder if she’s talking more about herself than she’s talking about me. I didn’t mean I fucked up by being with my little Duchess, I meant I fucked up by letting her slip through my fingers tonight. I don’t like the feeling of not knowing where she is. It doesn’t sit right with me.</p><p>“Evening, Sheriff. What can I do for you tonight?” the bartender says. It draws my eyes to the mirror behind the bar, and I see the sheriff standing five feet back from Joey and me. Joey flinches, and I see her grip the empty shot glass tightly in her hand.</p><p>Well, isn’t that interesting. I sure hope it’s not what I think it is. I’m still not sure how I feel about Sheriff Law Anderson, the Mayor’s son. The mayor named his kid Law, as if he knew that one day he’d use him, which is what worries me about him. Anyone under Mayor Anderson’s thumb is someone to keep an eye on.</p><p>I’d heard he used to be a big detective up in Chicago until Daddy Mayor made him come home. And he had himself a sheriff in his back pocket two point five seconds later. Law’s not the type I thought Joey would go for, or vice versa. Joey has jet-black hair, so dark it’s almost blue. Sometimes she’ll put wild colors in it that match the tats she’s got on her shoulders and back. She’s always in simple jeans, boots, and tees, and never has a trace of make-up or anything girly on her. I guess I always thought she’d go for some tatted-up motorcycle guy, or maybe a tatted-up motorcycle chick. I don’t ask her a lot of questions. But I never thought she’d go for the good ol’ boy next door like Law Anderson. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Just checking on things,” he responds, but his eyes stay on Joey’s back. She’s pretending he’s not there. Until he speaks to her. “How you doing, Josephine?”</p><p>Josephine? Fuck me. This isn’t good. I expect her to stand up and get in Law’s face, but she just raises her hand, giving him the finger. She still hasn’t turned around and refuses to meet his eyes in the mirror.</p><p>“Josephine, sweets, don’t—”</p><p>“Sweets—” I try to say something, but she cuts both of us off.</p> <p>“What the fuck are you doing here, Anderson? Pretty sure stalking is against the law.”</p><p>I watch the Sheriff’s jaw tick. The bar has become eerily quiet now because everyone is watching what’s happening. It seems to make the Sheriff uncomfortable, until he breaks the silence.</p><p>“Jake, my sister around? I thought they came in here tonight,” Law says, looking to the bartender.</p><p>“She with that bachelorette party?”</p><p>“That would have been them.” If Law’s sister was with the bachelorette party, I realize I might have a way to find out who my Penelope is. I start to speak up, but his next words hit me hard. “She’s the bachelorette.”</p> <p>Suddenly everything clicks into place.</p><p>A distant memory of the Mayor’s daughter coming home from college to marry his lawyer, Scott Winstead, has me clenching my teeth so hard I’m surprised they don’t crack. Scott and I go away back, and the history isn’t fucking good. The guy’s a cocky bastard who thinks his shit doesn’t stink, and he’s just as crooked as the mayor. Two peas in a fucking pod, those two are.</p><p>At least I know where to find her now. She’s either at the Mayor’s house or their old family estate. If she’s at fucking Scott’s house, I’ll burn the place to the ground with Scott still in it.</p><p>“They left here about two hours ago,” Jake says, pouring old Jim at the end of the bar another glass of cheap whiskey.</p><p>“All right, I was just checking in before I head home for the night.”</p><p>Joey snorts at his words like she doesn’t believe him. She mumbles something I don’t catch, but before I can ask, Law is speaking to her.</p> <p>“Josephine, can I have a word with you outside?” He shifts back and forth on his feet, looking nervous. Hell, I’d be nervous too if I kept calling Joey ‘Josephine,’ but he says it as if he’s always done it. The two can’t have a ton a history because Joey’s only been here a little over a year now.</p><p>“Who’s asking?” She motions for Sam to pour another shot. “The Sheriff or Law?”</p><p>“I’m asking, sweets.”</p><p>“Then the answer is no. Besides, you don’t like being seen with me in public.” She shrugs her shoulders like she doesn’t give a shit, but I can tell by how tense she is that it’s an act.</p><p>“That’s not fucking true and you know it.” Law takes a step towards her, but Joey slams her shot back and jumps up from the stool with a little wobble in her step. Both Law and I move at the same time to make sure she doesn’t fall.</p><p>“Don’t fucking touch her,” Law growls at me, pulling her towards himself in a possessive hold.</p><p>Normally, I’d tell him to go fuck himself, but Joey can hold her own, and I don’t want to start shit with Penelope’s brother. I already have a fight ahead of me, and I don’t want to throw fuel on the fire just yet. I want to keep my cards as close to my chest as I can.</p><p>Just as I thought, Joey pushes at Law’s chest and makes him take a step back from her. Joey is small, barely coming up to Law’s chest, but she knows how to defend herself.</p> <p>“You made your choice. Now live with it.” She tries to go past him, but he grabs her by the arm, and she gives him a look that would kill a lesser man.</p><p>“You’re too drunk to drive.” His words are soft and filled with concern.</p><p>She doesn’t even respond to him. Joey just calls out Butch’s name. He’s over at one of the pool tables, but when he hears her calling him, he walks over.</p><p>“Butch has me,” she says, and her voice is a little smug.</p><p>Law clenches his jaw again, but what can he really say? If he knows anything about Joey, he knows she shares a townhouse with Butch. He was friends with her brothers, and he was the reason Joey moved here. She’s been staying at his place since she got here, but as far as I know nothing’s happened between them. But again, I don’t ask a lot of questions.</p><p>“Pick up your phone,” Law says, but Joey isn’t having it.</p><p>“Fuck off.” With that, she’s gone, strolling from the bar. Butch gives me a ‘what the fuck?’ look before he follows her out, leaving the Sheriff just standing there looking like a kicked puppy. I’m not so sure he can handle Joey. She might be small, but she makes up for it with attitude and an iron will.</p><p>“You’re in over your head,’ I tell him, finally turning to look at him head on.</p><p>“As long as I’m somewhere with her, I’ll take it.” With that, he follows Joey and Butch.</p><p>Shaking my head, I get our tabs and close them out, thankful I didn’t let myself get drunk like I wanted to. No, I need to make sure my sweet Penelope is tucked into her own bed for the night. Alone. Once I get that squared away, maybe I can start to think of a way to dig out of this shitstorm I seem to have landed myself in.</p><p>This morning I woke up without a care in the world, and now I don’t know what’s up or down. It’s making me understand now what the Sheriff was saying. I’d rather be in this mess with Penelope than have no Penelope at all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Making my way out to my motorcycle, I hop on and drive past the Mayor’s place first. When I don’t see any cars or signs of anyone home, I head towards the old Anderson estate. I can’t believe that Penelope’s family has lived in the same town as me all these years and I’d never seen her before. There no way I wouldn‘t have remembered a girl walking around this town with hair and eyes like hers, no matter the age. Hell, I’d never met Law either until he came back to run for sheriff. Their father must have had them sent off to private schools their whole lives. Probably didn’t want them to see the fucked-up shit he does.</p><p>I’m sure he wanted to hide the fact that he fucks anything that moves. Mayor’s got a nasty reputation for not being able to keep it in his pants, even though he’s married to a woman who can in no way be Penelope’s mom. Unless she had her at five. I’ve also heard he likes his pills, too, but for all I know, that one could just be small-town gossip. Shit spreads like wildfire around here.</p><p>When I make it to the Anderson estate, I park my motorcycle outside of the north wall so no one can spot it or hear me pull up. Jumping the wall, I make my way up to the house. I’ve only ever seen it from a distance. My family was never invited to any of the charity events or parties that were held here. We didn’t meet a certain standard, so we weren’t allowed inside the gates. Seeing it up close, it looks like a fucking palace, making my Duchess’ nickname all the more fitting.</p><p>What’s the Mayor going to do when he finds out I’ve got my hooks so deep in his daughter they’ll never come out? I have a gut feeling things aren’t going to be easy after tonight.</p><p>When I make it to the front of the house, I say a silent thanks for her car being parked outside in the driveway. Bonus, the thing’s unlocked. Bad girl, Duchess. Popping the hood, I take out the ignition coil and disable it, ensuring someone’s going to need a tow right into my shop tomorrow morning.</p><p>You can run all you like, Duchess, but you’ll be tracking me down come morning. Quietly shutting the hood, I look around to see if I see Scott’s BMW. For all I know, it’s parked in the garage or outside Tammy Lean’s house. How the fuck did that slip my mind? Scott’s been nailing her since Butch peeled her off his dick.</p><p>Going back to my motorcycle, I head to the other side of town and release a breath when I see Scott’s car parked outside of Tammy’s. Thank fuck. I didn’t want to go kicking in the Andersons’ front door. Now I don’t feel so bad about stealing his girl. He doesn’t deserve her if he keeps dipping his dick into a viper like Tammy. Had to be something wrong with him, anyway, if he’d throw Penelope to the side so easily.</p><p>Glancing at my watch, I see that it’s already two in the morning. I head back to the shop, just deciding to crash in the apartment upstairs for the night. I want to make sure I’m there when she shows up in the morning.</p><p>When I get up into the apartment, I go over to the bed and flop back on it. Reaching down, I pull Penelope’s satin panties out of my pocket, then free my hard cock from my jeans. I bring the panties to my nose and breathe in her scent. Then I wrap them around my cock and slowly start stroking myself.</p><p>I picture her riding my dick and begging me to fill her with my cum. Her warm cunt would contract around me, sucking every drop into her willing body. The thought of her begging me to spill inside her has me cumming all over myself. Even after I’ve tried to get out every drop, it does nothing to lessen the ache in my cock.</p><p>Fuck. I’m never falling asleep.</p><p>Five</p><p>Paine</p><p>I’m sitting at the front desk with my boots kicked up on the counter and sipping some coffee. I gave up on sleep and decided to just wait down here, hoping she comes in before the shop opens. I’ve caught up on paperwork, done the bookkeeping, and checked over all the work being done in the garage.</p><p>I have nothing else to do besides sit and wait, and it’s killing me. The need for her is like a living and breathing thing.</p><p>About an hour later, the phone rings. It’s Eddie, the local guy who does the towing in our town. He’s calling to make sure someone’s here to sign for a Porsche, and I grin from ear to ear when I give him the okay.</p><p>After his phone call, I start pacing the shop, the anticipation killing me. I’ve still got at least another hour before anyone shows up for work at the shop, and I’m hoping I have that hour alone with my Duchess.</p><p>After what feels like an eternity, I see a flash of light, and then I hear the sound of a tow truck pulling in. I can’t help my excitement as I stand at the entrance, waiting on them to pull up. I feel a little of the pressure in my chest release when I see a blonde in Eddie’s passenger seat. I wasn’t sure if she’d come or not, but I’m happy she did. I’m also happy Eddie is a happily married man with three kids, or I wouldn’t have liked her riding alone in a truck with him.</p><p>I make my way outside, and I see her open the truck door and jump out. I feel an ache deep in my cock at the sight of her. She’s wearing a flannel shirt with jeans and cowboy boots. Her blonde hair is in a messy knot on top of her head, and she doesn’t have a speck of make-up on. She looks like she just woke up, and I suddenly have the urge to throw her on the back of my bike and take her to my bed. My God, she couldn’t be more beautiful than she is right now. All sweet and soft.</p><p>Slamming the door of the truck behind her, she stomps over to where I’m standing. When she gets in front of me, she puts her hands on her hips, and it’s then I notice that she’s pissed. It makes me smile. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Morning, Duchess. You miss me?”</p><p>“You messed with my car, didn’t you?”</p><p>I take a step forward, putting my body close to hers. We’re almost touching, but not quite. She looks away but then takes a breath and looks up at me through her lashes. “What’s wrong? Couldn’t get to Starbucks?”</p><p>“Actually, I was going for breakfast.”</p> <p>I reach out and gently stroke her cheek, tucking a strand of hair behind her ear. “Didn’t get enough to eat last night?” My insinuation is clear, and her cheeks redden at my words.</p><p>“I don’t know what you’re talking about.” She looks over her shoulder at Eddie, who’s unloading her car.</p><p>“Let me take you to breakfast. We can go to the diner around the corner.” I should have offered to make her breakfast, but there’s no food upstairs in the apartment, and I don’t know if she’ll go home with me yet.</p><p>Penelope turns back around and looks in my eyes. After a second she finally nods, and I feel like I gained a little more control. She’s got me so tied up over her.</p><p>Walking over to Eddie, I sign the paperwork and have him leave the car so I can fix it. Once he’s gone, I walk over to my Duchess and take her hand. I lead us to the direction of the diner, and she starts to pull her hand away. Feeling her resistance, I turn and look at her, wanting to make this clear.</p> <p>“You married yet?” I don’t mean the words to come out angry, but they do.</p><p>She looks away from me, shifting her gaze to the ground. I can barely make out the word as she whispers, “No.”</p><p>“Then you can hold my fucking hand and have breakfast with me.” Snatching her hand back, I walk us towards the diner again, and this time I don’t feel an ounce of fight from her. She may be promised to someone else, but she’s mine. And I’m going to do everything in my power to make sure it stays that way.</p><p>I try not to think about how warm and soft her hand is or about how I’m rubbing my thumb across her fingers as we walk. I’m trying to focus on my steps so I don’t fall flat on my face because I’m too busy thinking about how beautiful she is.</p><p>We walk into the diner and there are a few old-timers at the bar. They turn and give me a nod because I’m a regular. I’m normally in here at 5 a.m., having my coffee, so I expect a few looks when I pull Penelope in behind me. Nobody says anything. They just give her a long, lingering once-over and then go back to what they were doing. I can’t blame them. I’d have a hard time keeping my eyes off her, even if I was seventy years old.</p><p>We sit down, and old Rick comes over with the menus. I look at Penelope and wait on her to go first. She looks back at me, and I see some hesitation on her face, but I don’t know why.</p> <p>“Order what you want, Duchess.” She bites her bottom lip, and it has my dick rock hard. She looks so fucking cute that I want to come across the counter and bite her lips myself.</p><p>“I’ll have the Hungry Man’s Breakfast. Pancakes with chocolate chips, bacon, hash browns, eggs over easy, and a side of biscuits and gravy.” She looks at me and blushes, then slowly slides the menu back to Rick.</p><p>Just as I’m about to order, she interrupts. ‘Oh, and can I have coffee? But chocolate milk with my meal, please.”</p><p>Rick writes it all down and then looks at me. I feel the smile on my face as I pass him the menu. “I’ll have the same.”</p><p>When Rick walks away, she won’t meet my eyes, so I reach my hand across the table and wait for her to take it. She takes a second, but slowly she brings her hand from under the table and puts it in mine.</p><p>“People are going to talk,” she whispers, and looks out the window.</p><p>“About how much you ordered for breakfast? Guaranteed. Where the hell does a little thing like you put all that?”</p><p>She laughs and looks over at me, and we stare at each other in silence. She’s right. This is a small town, and people are gonna talk about seeing us together. I may not have been able to figure out who she is, but these guys in the diner know the Mayor. Whether they like him or not, I’m not sure, but I know for a fact they’ll talk. I smile as I run my finger over her wrist. I hope they tell the whole goddamn town.</p> <p>“You going to tell me why you messed with my car?”</p><p>“I think you know why.”</p><p>She looks up at me and lets go of my hand as Rick sets down our coffee. I pick up the mug and take a sip as I raise an eyebrow, daring her to reply.</p><p>“You could have just asked for my number.” She pours cream and sugar in her coffee, taking a sip and raising an eyebrow just like I did.</p><p>“Would you have given it to me?” I ask, not reminding her I already have it from the first time she came into the shop.</p><p>“No.” Her answer is quick, and we both know it’s the truth. She’s the type of woman who needs a firm hand. And it’s obvious she’s not getting that elsewhere. My cock hardens further as I think about dominating her little body. Filling her with me.</p><p>“Stop looking at me like that,” she whispers.</p><p>“Like what?”</p><p>“Like you’re going to fuck me on the table.”</p><p>I reach out, taking her hand again, and this time I bring it to my mouth, kissing her palm. “The thought crossed my mind. But I was afraid a few of the old guys might fall over dead from seeing a beauty like you laid out naked. And besides, I don’t show off what’s mine.”</p><p>“Yours?” The tone of her voice is irritated, but she doesn’t pull her hand away from my lips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Mine.” I growl the word and slide my teeth over her wrist. I feel her heartbeat pick up, and I lick her there, tasting her sweetness.</p><p>There’s something passing between us, and it’s intense. This is unlike anything I’ve ever felt before, and I can’t explain it. Being in her presence is like being punched in the gut and jerked off at the same time. It’s overwhelming and amazing.</p><p>“Here we go,” Rick says, breaking the spell. We sit back as he lays down plate after plate of food. The small table is comical, loaded with a ridiculous amount of food. I can’t help but laugh as Penelope smiles, reaching for the syrup and digging in.</p><p>“I can’t move.”</p><p>“Pussy,” Penelope says as we walk out of the diner.</p><p>I clutch my belly and laugh as I follow behind her, grabbing her hand. I can’t believe she out-ate me. I smile over to her and squeeze her hand a little. She doesn’t pull away from me as we walk back to the garage in silence.</p><p>When we get there, I see her car is already in the shop, and Butch is under the hood. I wrote up a work order and left it on the counter before we left so they would know what to fix. I just needed to get her here this morning, and now I need to make her stay.</p><p>“When will my car be ready? I’m supposed to be somewhere.” She pulls her hand from mine and crosses her arms, not looking at me.</p><p>“That someplace you gotta be have anything to do with you getting married?”</p><p>She snaps her head up and gives me a hard look. “That’s none of your business. I don’t have to explain myself to you. I don’t even know you.” She starts to look away, but I move in front of her and hold her jaw so she can’t look anywhere else but into my eyes.</p><p>“Don’t act like you don’t feel it, too, Duchess.”</p><p>“Feelings don’t have anything to do with this. We don’t always get what we want, Paine.”</p><p>The way she says my name sounds a lot like regret. “Fine. You wanna pretend? So can I.” With that, I grab her arm and pull her inside the shop to my office in the back. Once we get in there, I close the blinds and lock the door.</p><p>Turning around, I see Penelope has her arms crossed again, and she looks mad as hell. “You can go ahead and unlock that door. I’m not doing anything with you.”</p><p>I approach her slowly, making my moves clear.</p><p>“Sorry, but the work on your car isn’t free.”</p><p>Her eyes widen in shock. “You’re the one who broke it.”</p><p>“Cash or ass, Duchess. It’s time to pay up.”</p><p>“Fuck you, Paine. I’m not a whore.” She uncrosses her arms and makes fists at her hips. She’s pissed, and I love it. I get even harder seeing the fight in her. It’s going to make taming her so much sweeter. It’s clear that with her I have to push, and I’m willing to do that for her.</p><p>Standing in front of her, I push my big body against hers. I grab her upper arms and lift her onto the desk, pinning her there. “You’re not a whore, Duchess. You’re mine. And when I say it’s time to pay up, that means you’re gonna slide off those jeans and show me your cunt.”</p><p>I hear her intake of breath, and there’s a slight tremor to it. She likes my dirty talk. I lean over her more and push her all the way back so she’s lying on my desk, with her legs hanging over the edge. Once she’s down, I sit up and move my hands to the waistband of her jeans. When I grab for the zipper, she reaches out and tries to stop my hand. I push her fingers away and go back to what I was doing, unzipping her jeans and grabbing the top of them. Before I pull them down, I look up into her eyes and watch her reaction as I slowly pull her jeans and panties off her hips, down her thighs, and push them to her knees. I keep my eyes locked on hers, and I run my hands up her warm soft thighs, watching as she bites her lip. She looks nervous, as if she’s close to telling me to stop.</p><p>“You gonna try to tell me no?”</p><p>She closes her eyes when I rub the palm of my hand over her bare pussy and just rest it there. Letting the heat of my hand melt against the heat of her cunt. I don’t move, I just wait for her response, feeling her dampen my palm.</p> <p>“Duchess?”</p><p>She opens her eyes, and they are glazed over. She’s turned on by all of this, even if she doesn’t want to admit it. After a second she swallows, licks her lips. “I’ve never done this before.”</p><p>“I’ve never done anything like this either, baby.” I lean down and kiss her bare stomach where her flannel shirt has come open. “It’s been so long since I had anything to do with a woman, I’m not sure I know how anymore. Besides, any thought of someone else left my mind the day your ass walked into my shop.”</p><p>I feel her laugh nervously as I kiss her tummy and rub my beard across her delicate flesh. Seeing my stained hands against her creamy skin reminds me of how different we are. But that doesn’t matter right now. All that matters now is that I get to taste a little bit of heaven.</p><p>“That’s not what I mean, Paine.” I feel her tense against me, and I look up into her eyes. She looks almost scared.</p><p>“What do you mean?” I sit up but leave my hands on her body, hoping to calm her with my touch.</p><p>She bites her lip again and then takes another deep breath. “I hadn’t done anything before yesterday. Nothing. I’m a virgin.”</p><p>I think my jaw comes unhinged at the same time my cock swells to the point of pain in my jeans. She’s so fucking beautiful. I expected her to have left a trail of men behind her. But to know I’m the first to touch her makes me want to shoot off a cannon and plant a stake beside her that reads ‘This land is claimed.’ She’s an undiscovered country, and I wanna be the goddamn king of it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Paine?” Her voice brings me back to earth, and I shake my head, trying to find reality again. I close my eyes and lay my forehead against her belly. Breathing in the scent of her pussy.</p><p>“Just a taste. For now,” I say against her skin, and I lick around her belly button. I look up at her and move my hand so my fingers gently spread her lips and rub her damp clit. “I’m gonna be the first to get it, Duchess. But not here and not like this.”</p><p>She moans and closes her eyes, and I dip my fingers lower, playing at her entrance. I move down a little and kiss the insides of her thighs. Her sweet smell is making my mouth water, and I can’t wait any longer. Her legs are bound together at her knees by her jeans and panties, so I’m only able to spread them a little as I lick down between her legs. I grip her thighs, taking a handful of each as her nectar hits my tongue. She’s sweeter than anything I’ve ever tasted, and one drop has me addicted.</p><p>“Mmm,” is all I can say as my tongue moves all over her virgin pussy.</p><p>“Paine.” She moans out my name like she’s as desperate as my dick is. He’s begging to come out and play, but I know the second my cock hits air, I’m gonna need to fuck her. So for now, I keep it in my pants.</p><p>“Do it, Duchess. Show me what a dirty girl you can be.” I rub my chin on her clit, letting my beard soak up her juice. “That’s your payment, baby. You can’t get your car back until you cum on my face. Now wipe that pussy on my tongue and earn it.”</p><p>I feel her cunt pulse against my face as I devour her. I can’t get enough of her, and the more I drink her down, the closer she is to getting off. Hearing she’s never had this before has me wanting to give her the best. I want to be the only one she thinks of ever again.</p><p>Sucking her clit hard, I feel her body bow off the desk, and I squeeze her thighs tighter, holding her down. Her orgasm is hard and deep, and she shouts my name as she hits her peak.</p><p>Hearing her voice echo through my office makes me feel like a god. I’ve been places and done things in my life, but nothing compares to the feeling of being the first to eat her pussy.</p><p>And I’ll be her last, if I have anything to say about it.</p><p>Six</p><p>Penelope</p><p>“Try this one, Grandma.” I hand her another sample of cake, taking the two others from her lap. I stopped at the cake shop and brought all the samples back to the family estate. This isn’t the wedding I dreamed of, but I know my grandmother wants to be a part of it, and it’s something I want to give her. I could put on a fake smile and pretend this was what I wanted, because if I don’t I know she’d worry. She’d start asking questions and would probably be on the phone to my father, and he wouldn’t let me back on the property to see her. Probably make up some lie about me leaving the country or something. I don’t like lying to her, but I want us to be able to see each other, and I’ll do whatever I can to make that happen. I know our days are numbered as it is with her health declining.</p><p>“They all kind of taste the same,” she says, taking another bite of what seems like the twentieth sample of cake this afternoon. Maybe that giant breakfast was a bad idea. I tingle between my thighs just thinking about what Paine and I did afterwards. Nope, it was totally worth it. One of the small pleasures I was going to take for myself.</p><p>“Yeah, I say we just pick one.” Moving the plates over to a side table, I lie across the end of my grandma’s bed and unbutton my jeans. If I keep this up, I won’t fit into the wedding dress. Then maybe I won’t have to get married.</p><p>“Go with the vanilla bean then. It has a nice filling.” She sets the plate down on her nightstand, then pulls out a ring box from the drawer.</p><p>“I’ve been wanting to show you this. Do you remember it?” She hands me a small velvet box, and I open it, gasping at the ring inside. It’s a beautiful circular diamond, surrounded by a halo of sapphires. The band is studded with diamonds that wrap all the way around, making it look antique. It’s the most perfect ring I’ve ever seen.</p><p>“Your grandpa gave me that.”</p><p>I pull it out of the box and read the inscription.</p><p>Only you. Only us. Forever.</p><p>“I’ve never seen you wear it.” My eyes drop to her ring finger, which bears the wedding ring she’s worn ever since I can remember. It’s a simple gold band that looks beat up after all the years of wear.</p><p>“I did from time to time to make your grandpa happy when he was alive, but I could never bear to take this one off.” She runs her wrinkled hand over the gold band on her ring finger. “This was the one he gave me when he didn’t have a penny to his name. The one he asked me to marry him with. This is the one I’ll be buried with. He only gave me that one because he thought I’d want something better.”</p><p>She moves the gold band back and forth on her finger, and can I can tell she’s having memories about him. “I never cared about all this.” She waves her hands around, indicting the house and their wealth. Grandpa played the stock market, and it paid off big. “I’m happy that I don’t have to worry about you, and I know your grandpa felt the same. He wanted to make sure we never went without, but I’d give it all away to have even just one more day with him.”</p> <p>“I wish I could remember him better,” I tell her, putting the ring back in the box. Life seemed like it was so different before I was born. So much love filled the house. I don’t know how my father snaked his way in, but it just didn’t fit. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Grandpa died when I was young, and I can’t remember him at all. My mother died when I was born, and he followed soon after her. I’m not sure how my grandma survived losing her husband and her daughter so close together. Another reason I wouldn’t let her lose me.</p><p>“He’d light up whenever he looked at you. He loved you so much.” I love when she talks about my grandfather. Her whole face warms, and the love she has for him shows even after all these years of him being gone. I want a love like that one day. Maybe not today or tomorrow, but one day I’ll find that. I’ll just have to suffer through this marriage for a while and enjoy the time I have left with my grandmother. Life seems to be about living day to day at this point.</p><p>I reach over, handing her back the ring box, and she puts it in her bedside table. “Your grandpa got me that ring because he wanted to make me happy. It’s what he always wanted for his family. It’s a beautiful ring that he worked so hard for. And to me, it’s a sign of the purest love and devotion.” She smiles at me, and I can’t help but wish for that kind of love and happiness.</p><p>I know she wants me to be happy. Happiness is all she and my grandfather ever wanted for me. It’s a bitter pill to swallow because this wedding is a lie. I’ll be miserable.</p> <p>“Life is about being true to yourself and finding the love you deserve. It’s too short to do it any other way.” She rests her head back on her pillow, and I can tell she’s tired and probably needs one of her pills. She’s right, though. Maybe I can soak as much up as I can before I walk down the aisle to my fate.</p><p>Getting up from the bed, I go to the bathroom, get her pills, and fill her glass of water. Placing them next to her bed, I lean down and give her a kiss.</p><p>“I’m so happy you’re marrying someone from here. I missed you so much when you were away at school.”</p><p>“I’m not going anywhere, Grandma. I promise.”</p><p>Seven</p> <p>Paine</p><p>I’m losing my fucking mind, I think to myself as I see a clearly freshly fucked Tammy leave Scott’s law office, which sits in the center of town. Not ten minutes later, I see Scott exit his office, throw a bag in the trunk of his car, and turn, spotting me sitting on my motorcycle. I stare at him, and I can tell by the look on his face the whispers have already reached his ears.</p><p>He straightens his suit and starts to head my way. He thinks because we’re in the middle of town and he’s a lawyer, I won’t lay his ass out. He’s wrong. Normally, I wouldn’t. Not over something stupid or petty. But Penelope’s more than that, and she’s definitely worth a night in jail. Though I couldn’t track her that night if I was. I don’t like the idea of not being able to have my eyes on her if I wanted to. I sound like a stalker, but I don’t give a shit. If tracking my girl and showing up at random places keeps her out of another man’s hands, you can label me however you want, and I’ll wear that title proudly.</p><p>“Can’t you run over to Kirksville if you need to get your dick wet, Paine? I’ve never known you to dip into the local girls.”</p><p>My whole body goes rock solid at his words. Did he really just talk about the woman he was going to marry like that? Not only that, but he was just fucking local pussy himself. But that’s nothing new. I never understood the guys who chased women around here. Everyone would just be fucking each other at the end of the day. Not something that sounded appealing to me.</p><p>“I’ve never let Tammy suck my cock in the back of Smokey’s, no matter how much she begged me to do it. So it seems I’m not the one getting my dick wet.”</p> <p>I know we aren’t talking about Tammy, but I want him to know I’m on to his games. He hasn’t had my girl because she’s still cherry sweet and waiting for me to take it. I don’t know what’s going on with these two, but things aren’t adding up. I don’t see a girl like Penelope letting her man run around on her, so maybe she doesn’t know, or maybe she doesn’t care. She doesn’t seem like the kind of woman who just wants to be kept and made into a little trophy. I might have thought that when she first strolled into my office, but the woman I had in my arms while I ate her cunt this afternoon was nothing like that. She was different, no matter how this situation appears to be.</p><p>His eyes harden at my words. Seems Scott thought he was the only one Tammy liked to suck off. No, Tammy just goes for anyone with money. I may not be as flashy with mine as Scott is, but I make a good living, and that’s something someone like Tammy can easily sniff out.</p><p>“Stay away from her,” Scott says, the smugness he first had now long gone from his words.</p><p>“Who are we talking about here, Scott?” I bait him, because I’m not totally sure. He didn’t seem too pissed when he was warning me off Penelope, but one comment about Tammy and his tone completely changes.</p><p>“My fianc—”</p><p>I’m off my bike before he can finish the word. No way can I bear to hear him call her that. Not fucking happening. I have him by his suit jacket, lifting him so he’s eye level with me.</p><p>“Paine. Let him go.”</p><p>I feel Law’s hand come down on my shoulder, and I let go of Scott with enough force to send him falling to the ground. He’s lucky the Sheriff showed up.</p> <p>“I’m pressing charges!” Scott shouts, picking himself up off the ground and dusting the dirt off his suit.</p><p>Law lets my shoulder go, shaking his head at me. Shit, I should have had better control. No way Law isn’t going to throw my ass in jail after I just tossed his soon-to-be (or so he thinks) brother-in-law to the ground. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Scott, all I saw was you about to fall and Paine here tried to prevent that. Seems you tripped anyway.” Law’s words shock me.</p><p>“You can’t be fucking serious right now,” Scott barks out, but keeps his distance no matter how hostile his tone is. He’s smart enough now to keep a few feet between us. That’s good. At least he understands I’m not fucking around here.</p><p>“I don’t have time for your shit today.” I have a feeling the Sheriff Isn’t talking about mine and Scott’s shit, but probably the Mayor’s.</p><p>“He’s going to hear about this,” Scott fires back, but Law just shrugs his shoulders like he doesn’t give a shit. I find that hard to believe, with the Mayor being his father and all.</p> <p>“Whatever. I have a date to catch with Penelope.” He turns to walk off, and Law has me by the arm. I didn’t even realize I was lunging for the dipshit. “I’ll haul you in if you make me.”</p><p>I jerk from his hold but stay rooted as I watch Scott jump into his car and speed off. Looking around, I see a good portion of the town staring at us, probably having seen most of what just went down.</p><p>I don’t know much about Law other than Joey might be head over heels for the guy, judging by the song she was singing this morning at work. But how could he let a shit like Scott marry Penelope?</p><p>“You’re going to let that pompous fuck marry your little sister?” The distaste is clear in my voice.</p><p>“Stay out of it, Paine. This is family business you don’t know anything about.”</p> <p>“I know a man like Scott would ruin a woman like her.”</p><p>“I agree,” he says, and starts to walk away. I grab him by the shoulder like he did to me moments ago.</p><p>“You agree?” I’m being loud, and I don’t give a shit who hears us, but apparently Law does because he leans in closer to me.</p><p>“I’m doing what I can but trying to keep my hands clean. It’s not your concern. Like you said, she’s my sister.”</p><p>“She my woman.”</p><p>“I don’t believe town gossip,” he says, referring to the whispers running around town. “I’ve also never heard my sister even utter your name, so to me she’s not your anything.”</p> <p>It’s on the tip of my tongue to tell him she moaned my name over and over just today, but I won’t make what I have with her dirty. What we have and what we’ve done is special, and I won’t throw it around like that. It might be dirty between us, but between us is where it fucking stays.</p><p>“Please, Sherriff. Tell me where Dipshit and Penelope are going tonight and I’ll make sure she doesn’t end up with him. I’ll make it my life’s mission to keep her from making a mistake and walking down the aisle with that piece of shit.” I can see the hesitation in his eyes as he looks away and looks back at me. “Don’t let her do this.”</p><p>He takes a deep breath, making a decision, and nods his head.</p><p>“Deal.”</p><p>Eight</p><p>Paine</p><p>That’s it. I’m done fucking around. I tried being nice and talking sweet, but I’m through with that. I don’t care why she’s marrying that douche. It’s over.</p><p>I’ve got my bike parked in front of Lucinda’s, the fancy Italian place two towns over. It’s funny that Scott is willing to fuck Tammy in the middle of our small town, but he makes the woman he’s supposed to be getting married to have someone drive her almost an hour away. It’s as if Penelope is the dirty secret, and that thought makes me even madder. She’s mine, and she’s something to be proud of.</p> <p>I wait for a long time until I finally see a dark town car pull up and Penelope step out. Scott still isn’t here, but as the driver pulls away, I’m guessing the plan was for him to drive her back home. That thought has me off my bike in a flash and crossing the street to get to her.</p><p>Penelope is in a black dress and black heels. Her blonde hair is pulled into a tight knot at the nape of her neck, and it looks like she’s got on a ton of make-up. She looks like she’s a different person than the sweet sexy girl I had breakfast with this morning. I hate it.</p><p>When I get to the front of the restaurant, she turns and faces me, the shock clear in her eyes.</p><p>“Paine? What are you doing here? You have to leave. Scott is going to be here any second.”</p><p>“I don’t give a fuck.” I grab her by the wrist and pull her behind me, walking towards my motorcycle. I turn around and take off my leather jacket, holding it out for her to take. “Put this on and climb on the back.”</p><p>“Paine.” There’s a plea in her eyes, and as she looks over her shoulder to the restaurant and then turns back to look at me, indecision runs through her mind. “It’s not that I don’t want to go because believe me, I do. It’s because I can’t.</p><p>“Duchess, I don’t know what’s happening with you and that dipshit, but the wedding isn’t happening. You’re mine, so get your ass on the back of my bike. You’re coming home with me tonight and every night after.”</p><p>“This is ridiculous.” She stomps her foot when she says the last word, and it makes me smile. “I can’t go with you. Things could go really bad for me if I don’t do this.” She takes a small step towards me, and her eyes plead with me again. “I want more than anything to run away, but this isn’t just about me.”</p><p>I reach out, grabbing her chin, and keep my eyes locked with hers. I don’t want her to miss anything I’m about to say because this is crucial. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Do you trust me, Penelope?”</p><p>I see little tears start to form in her eyes, but they don’t fall. She just nods her head as I hold her in place.</p><p>“Then trust that no matter what is happening, I’ll take care of it. I’ve got all the money you could ever need and a house to keep you in. There isn’t anything I won’t do to make you happy, and no lengths I won’t go to fix what’s hurting you. You’re mine, that’s the bottom line. Now you tell me, do you feel what’s between us?”</p><p>She closes her eyes to try and shut out my words, but I squeeze her chin a little and she opens them back up. After just a second, she nods.</p><p>“That’s right, Duchess. This isn’t a bit of fun. This isn’t a fling. This is real. Now, you getting on my bike or do I have to tie you to it? Because I brought rope.”</p><p>She takes a deep breath and I release her chin, holding out my leather jacket to her once again. She looks at it and then reaches out, taking it and putting it on.</p><p>I turn around, get on my bike, and sit there, waiting for her to come with me. She turns and looks at the restaurant one last time before climbing on behind me, and I crank it up. It’s in that moment Scott pulls up and gets out of his car.</p><p>“Take your hair down, Duchess. I want it blowing in the wind on the back of my bike, and I want that fucker to see it so he knows.”</p><p>After a second I feel her warm hands come around my waist and her front press to my back. I pull out of my parking spot just as Scott turns and spots us. When we pass by, I reach one hand back, running it up Penelope’s thigh, and make sure he’s sees she’s mine.</p><p>Game over, Dipshit.</p><p>I keep my hand there the whole way back to my house, holding on to my girl.</p><p>“You’re gonna tell me everything after I have you in our bed. We clear?”</p><p>She nods, and I pick her up off my bike and hold her as I walk inside. Her legs go around my waist and her arms around my neck. The feeling of her pressed against me as we rode was wonderful, but I’m looking to press against her in a lot of other ways.</p><p>I take her through the main entrance and walk her down the long hallway to my bedroom. Once there, I stand her up in the middle of the room and take a step back.</p><p>“I want you to go into that bathroom and take off that dress you wore for him, and then I want you to wash your face. You’re too beautiful to hide under all that stuff, and I want to see the real you. After that, you come out here and lie on my bed with your legs open.” I reach out and touch her blonde locks, which are down and windblown. “You ready to do that for me? Give me that virgin pussy?”</p><p>She looks away as a blush creeps across her cheeks, and goddamn if it doesn’t make me harder. After just a second she nods and then walks past me to the master bath. I watch her go in there and shut the door, and I walk to my closet to undress. I pull off my white V-neck shirt and kick off my boots and jeans. I keep on my boxer briefs for now, wanting her to take them off me. I run my fingers through my dirty-blond hair and then over my dark-blond beard, thinking about what I’m going to do to her.</p><p>I walk out of the closet, my dick hard and ready to fuck. I have to wait for only a second before the bathroom door opens and she walks out, completely naked. Her face is rosy from washing it, but she looks like the girl I met this morning. She looks sweet and innocent, and I can’t wait to get my dirty hands on her pure body.</p><p>“On the bed, Duchess. Legs open for me. I want to see it all spread out for me. What you’re offering me. Only me. ”</p><p>I stalk closer as she climbs on and lies in the middle. After just a moment of hesitation, she spreads her legs wide. I move to the end of the bed and stand there with my arms crossed.</p><p>“Knees up, baby. I wanna see all your pretty pussy. Don’t hide from me.”</p><p>She takes a nervous breath and does what I ask, pulling her knees up and exposing everything. My mouth waters at the sight, and I can’t wait to stick my face all in it.</p><p>“Fuck, you look so beautiful like this. Laid back on my bed, legs spread, and ready to be taken.”</p><p>She’s too good for a dirty mechanic like me, but here she is, pussy out and open, begging me to fuck it. I can see her horny cunt dripping down to her asshole, and I lick my lips at the invitation it’s giving me.</p> <p>“You’re the only woman I’ve ever had in my house, Duchess. The only woman who’s ever been in my bed. And after tonight, you’re the only one who’s ever going to be in it again.”</p><p>I see her hands tremble a little at my words, and seeing her a little nervous makes me impossibly harder.</p><p>“I’m gonna eat that sweet pussy before I take your cherry. I want you nice and relaxed when I get inside you.” I reach down and rub my cock through my boxer briefs, trying to relieve the ache. “But after you cum and I get my cock in you, I wanna fuck you hard. I want you to remember this first time forever.”</p><p>I climb on the bed and dive between her legs, not wasting any more time. I push her thighs far apart and put my whole mouth on her pussy. I open wide, sucking her into my mouth and licking her at the same time. Her hands shoot out, grabbing my hair, and she grips me hard as I eat.</p><p>Her rich virgin cunt is so sweet and juicy. She’s like a warm peach, and I can’t get enough. I move down, sticking my tongue as far inside her unfucked pussy as I can go. I feel her hymen with my tongue, and I lick it, letting it know I’m about to fuck through it.</p><p>Moving down, I pull her ass cheeks apart and lick her there, feeling her tight ring. She moans again at the sensation, and I move over, biting her ass cheek hard, leaving teeth marks. I want to mark her body up with signs of me so that everyone knows who she belongs to. No more bullshit fiancé, no more wedding talk. That all ends tonight. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I move back up to her pussy, sucking on her lips and clit. I don’t have a lot of patience, so I focus on getting her off instead of dragging it out. When I suck her pussy in my mouth and give her clit a gentle bite, she nearly pulls my hair out as she climaxes, tensing up and shouting my name.</p><p>After I milk her orgasm, and she stutters, trying to push me away, I sit up and move over her body.</p><p>“Reach down and take my cock out, Duchess. I want you to be the one to put it in you. I want you to remember that you asked me to claim you.”</p><p>I lean down, taking her mouth in a kiss and letting her taste her pussy. Her juices are covering my beard, and the smell of her is driving me insane. Her warm tongue sweeps into my mouth as her hand goes between us and she pulls out my cock. I feel her grab the base of it and move it to her opening as she bites my bottom lip. When the tip of my cock is at her virgin entrance, I feel the head of it get coated in her sticky juice.</p><p>Pulling back from the kiss, I look down into her eyes and hold her face. “You ready?”</p><p>“Yes, Paine. I want you.” Her eyes are pleading and needy, and I can see that she wants this just as much as I do.</p><p>I run my stained hands over her creamy white skin, down to her tits. I grab one and lean down, taking her nipple in my mouth. I bite down on it hard as I thrust my bare cock into her virgin cunt. It’s tighter than my own hand. Tighter than anything else I’ve ever felt. She’s so hot and wet, and it’s pure heaven. I feel her tense under me, but I keep going. I told her I would fuck her rough, and I intend to. I want her sore and thinking of me every time she sits down. I’ll kiss it better later, but right now, I’m claiming it.</p><p>“You on the pill?” I grunt out as her nipple pops out of my mouth. I thrust hard again.</p><p>She lets out what sounds like a cross between a moan and a yell, and I grab her hands, holding them over her head. I pin them both down with one hand and with my other, I grab her leg and throw it over my shoulder. I want in there deep.</p><p>“Answer me, Duchess. You taking anything to keep me from breeding you?” Her eyes snap up to mine, and I feel the wicked smile spread across my face. “That’s right, baby. I plan on cumming in you until you’re bred. You’re not keeping me from that, are you?”</p><p>I feel her pussy clench at my words, and I thrust harder. After two more thrusts, she moans and shakes her head.</p><p>“Tell me, Duchess. Tell me you aren’t on anything and you want me to cum inside you.”</p><p>Looking up at me, she raises her hips at my thrusts, and moans, “I’m not on anything. Cum inside me, Paine.”</p><p>“Tell me you want my cum, Duchess. Tell me you want it deep inside you, coating your unprotected womb.”</p><p>“I want it,” she whispers, and raises her hips again.</p><p>I reach between us and rub her clit. With her leg over my shoulder, she’s wide open and taking only what only I can give her. It takes just a few strokes and she’s clenching around me, squeezing my cock and cumming on me.</p><p>I look down to where we are joined and see her cream spreading up and down my shaft as I fuck her. Seeing her go off has me losing it, and I thrust hard one last time, emptying my cum inside her.</p><p>My orgasm goes on for a solid minute as my balls draw up and unload into her waiting womb. After I release every drop, I keep her in place with my dick still inside her, holding her hips up, and making sure my cum stays there.</p><p>I lazily move my cock in and out just a little as we sit there.</p><p>“Come lie down beside me, Paine.” Penelope reaches for me but I shake my head.</p><p>“Just a little longer like this, baby. I wanna make sure my cum stays in you.” I want to make sure she’s bred. Nothing will take her.</p><p>Nine</p><p>Penelope</p> <p>I wake to kisses traveling down my spine, before they move to my butt cheeks. The whiskers of his beard make me giggle and try to wriggle away. I still feel the wetness of his cum inside me and on my thighs, and I get a soft bite on my ass to halt my movements.</p><p>“You passed out on me,” he mumbles against my skin, then takes another soft bite of the opposite ass cheek, like he is trying to give them equal attention.</p><p>“It’s all your fault. I passed out from exhaustion, and you didn’t even feed me.” I look over my shoulder at him to give my best pout.</p><p>“I’m sorry, Duchess. It slipped my mind. I filled up on your sweet cunt.” He kisses the same spots where he bit me, pulling himself from the bed and taking me with him up and over his shoulder, strolling through the house like I weigh nothing. I don’t even struggle with being carried around like I’m a doll. I have a nice view of his ass from this angle, but too bad he slipped on his boxer briefs. I watch his powerful leg muscles move us with ease down the hall, reminding me of how big he really is.</p><p>I’ve never had this closeness with someone before, and I’m going to suck up every second of it. I’m sick of fighting this. The last few hours of my life have been the best I can remember.</p><p>I’m through with everything, and it’s all going to change today. This is something I’ve never done. I’ve always done what my father’s wanted and that’s gotten me nowhere. Everything from the classes I took, to the activities I participated in, he had laid out for me.</p><p>It feels freeing to let go. I thought I would’ve had this freedom when I left college, but instead I came back to have control ripped away from me once again. It seems playing by my father’s rules got me nowhere, and no matter what I did, he would just make up new ones. It was an endless cycle of holding me down. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’m still a little worried about my grandma. Maybe I can just tell her what’s going on. I’m so worried that it might stress her out, and that’s something she doesn’t need right now. She seems to be so weak lately that she doesn’t need all this laid at her feet. I hate that I didn’t realize how sick she’s really been. I should’ve been coming home more, but every time I called she always said she was fine. It wasn’t until recently that I found out things haven’t really been all that fine after all. And now my father really has some leverage over me—the one thing he can use to control me.</p><p>I’m starting to wonder what he has over Law. Law and I have never been super close, both going off to different boarding schools and him being eight years older than me. His life was busy when he worked up in Chicago, and even when I could make it out to see him, he always had his head buried deep into whatever case he was working on.</p><p>I haven’t gotten much time to talk to him since I’ve gotten back. I was being pulled in so many directions, we didn’t have time to catch up. We’re going to have to sit down and work some stuff out because there’s no way I’m going to let Dad keep me from Grandma, and more than likely I’ll need Law’s help.</p><p>Paine sits me on the counter, making me squirm on the cold granite top. “Sorry, Duchess.” He reaches for a shirt hanging off the bar stool at the breakfast bar, sliding it over my head. “I love seeing you naked, but I don’t want you to be cold either.” Leaning in, he takes my mouth in a soft kiss. “You sore?” His eyes go soft, and I can see the concern in his face. “I took you hard.”</p> <p>“I’ve never been more perfect.” I smile when I say the words because they’re true. I feel so happy with him. Like I’m home. “And thanks,” I say, looking down at the worn shirt with an old car on it. I love it more than any piece of clothing I have. It’s completely Paine, complete with what looks like an old grease stain. Even better, it smells like him.</p><p>“You never have to thank me. Taking care of you is what I’m supposed to do.” He runs his thumb across my lip before pulling away.</p><p>“What do you fancy, Duchess?” he asks, pulling open the refrigerator door.</p><p>“You cook?” I can’t picture him working his way around a kitchen. A car, sure, but making spaghetti? Not so much.</p><p>“When I’ve got food I can, but I’ve been too busy to get to the store. Someone has had me chasing them all over town.” He turns to smile at me as he pulls eggs and cheese from the fridge.</p> <p>It’s crazy how easy this feels. Like we’ve been doing it forever. Maybe when it’s right, that’s just how it is. I don’t have experience with men, but my grandma told me when you find the right man, you just know.</p><p>I kept getting worried that she’s going to ask me if Scott was the one, but she hasn’t. Maybe she just thinks he is. Why else would I agree to marry him?</p><p>“Hope you like egg-and-cheese sandwiches. We can run to the store and stock up tomorrow on some stuff. I plan on keeping you in our bed for the next few days.”</p><p>Butterflies take flight in my stomach at the word ‘our.’ He’s acting like I’m never leaving. Maybe I’m not. I don’t think I’ll be able to go home when my dad finds out I’m not marrying Scott.</p><p>It’s all so simple here. I glance around, taking in Paine’s home. It’s warm and cozy. Hardwood floors run throughout, with deep gray-blue walls. The floor plan is open with the kitchen off to the side of the living room, and a big dining room to the other side of the kitchen. A giant fireplace takes up one wall, with silver tiles surrounding it.</p><p>One thing I’ve always disliked about my family home is that it is too big. I love the idea of being able to cook in the kitchen and still be able to talk to someone lying on the couch. I can easily picture a family here.</p> <p>Me in the kitchen cooking dinner, Paine lying on the couch watching a baseball game and talking to me while I cook. The kids at the dining-room table, doing their homework before dinner. It makes me miss something I never knew I wanted. Being here with Paine, it’s all so clear.</p><p>“What makes you have that look on your face?” I turn back from my domestic fantasies and study him. If he meant half of what he said when he took me to bed hours ago, then maybe we’re on the same page.</p><p>“How many?”</p><p>“How many what?” I ask.</p><p>“Kids.”</p><p>I run my hands down his tatted-up arms, pulling him closer. He sets a plate down on the counter next to me and wraps his arms around my waist.</p><p>“Three.”</p><p>“Only three?” he teases, and I’m relieved that the fairy tale I just dreamed up moments ago is so close. I can almost reach out and touch it, or maybe it’s already in my grasp.</p> <p>“Let’s start there. We still have an uphill battle,” I remind him.</p><p>“It’s time to start talking.” He jumps up on the counter with me, handing me one of the sandwiches he just made, and I lay it all out for him while we eat.</p><p>“I’ll figure it out. He can’t keep you from seeing your grandma.”</p><p>“I’m not so sure. Scott’s the family lawyer, and I have no idea who controls what. I’ve never had to worry about it before, and I know my father has some powerful friends, Paine. I just—”</p><p>“Baby, calm down.” He jumps back off the counter, grabbing my face between his hands. “I promise you. I won’t let him keep her from you. I told you, I’ll give you everything you’ve ever wanted, and if you want to see your grandma, you’ll see your grandma.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I believe him, and I don’t know why. I’ve only known him for such a short time, but I can tell by the look in his eyes he means it. And it’s quite clear Paine gets what he wants.</p><p>“Trust me, Duchess.”</p><p>“I do.” He pulls me to his chest and holds me tight, that feeling of being home warming me again.</p><p>A knock at the door pulls us from our embrace.</p> <p>“Who the fuck...” Paine glances over his shoulder to look at the clock on the stove. “It’s almost midnight.”</p><p>“Booty call?” I half-tease. Who else would show up at his house so late?</p><p>Paine gives me a stern look. “I told you I never invited a woman back here. Don’t push your luck or I’ll spank your ass.”</p><p>I wiggle at his words, thinking about him spanking me as he takes me from behind. The image makes everything in my core clench.</p><p>“My dirty Duchess. You like getting your ass spanked? I’ll have to remember that.”</p> <p>I go to lie and tell him I don’t, but another knock sounds on the door.</p><p>“I’m fucking coming,” he shouts. “Don’t move.” He shoots me a look, and I stay rooted.</p><p>I watch as he makes his way to the door, wearing just his underwear. It better not be a woman out there, because I don’t want someone else seeing his boxer briefs hugging his thighs tightly. It’s then I notice all of his tattoos across his arms and chest are on display. I didn’t realize he had so many. He was wearing long sleeves when I first met him, and only a few of the tattoos peeked out at his wrist. I don’t know what it is about his hard side that draws me to him. I’ve never met someone like him before, and men like him don’t run in the same circles as I have all my life. Maybe that’s why I never knew what attraction was until I met him.</p><p>When the door opens, I hear Paine sounding pissed at whoever it is. “This is private fucking property.” I can’t see around him, his big body filling the door and blocking the view, but I know who it is when a familiar voice speaks.</p><p>“Where’s my daughter?”</p><p>“Where she’s supposed to be,” Paine fire backs. I get down off the counter and try to get past him to face my father, not wanting them to go to blows.</p> <p>“I know for a fact she isn’t with her fiancé,” my father says, but it’s clear Scott told him who I was with. There’s no other way my father could possibly know I was here with Paine.</p><p>“Then you thought wrong because you’re looking at her fucking fiancé.” There’s no missing the possessive tone in Paine’s voice.</p><p>“Stop it. Both of you.” I finally make it past Paine, ducking under his arm in a quick move, but I don’t get far. He wraps an arm around my waist, pulling me back to his front.</p><p>The cold night air hits my legs, reminding me I’m only wear Paine’s shirt. Lucky for me, he’s a freaking giant and the thing comes almost to my knees.</p><p>My dad looks at me in disgust. Like he has room to talk. Not only is he married to a woman five years older than me, but everyone knows he sleeps around on her. I have a feeling she does, too, with the looks she shoots my brother at Thanksgiving dinner.</p><p>“Put some clothes on. We’re leaving.”</p><p>“She’s not going anywhere,” Paine answers for me. I don’t know why I’m so intimidated by my father, but I am, and I’m glad to have Paine standing behind me.</p><p>“Your grandmother got hurt. We had to call the doctor to come out. She’s asking for you, Penny,” my father says, using the nickname for me I haven’t heard in years.</p> <p>“Let me get my things.” I try to break from Paine’s arms, wanting to get to her as soon as possible, but he’s holding tight.</p><p>“Give us five and we’ll be ready,” Paine says, finally letting me go.</p><p>“I won’t let him on the property.” My dad’s tone is final, and I know he won’t. He’ll call the police and have Paine thrown in jail.</p><p>“I don’t go, she doesn’t go.”</p><p>“I’ll tell your grandmother you couldn’t be bothered then.” My father turns to leave, and I feel so angry at how he always says ‘your’ grandmother, like she’s nothing to him. Like she’s not the mother of his late wife. Like she’s not his mother-in-law.</p><p>“No, wait!” I yell at him, making him turn to look at me. He has a smirk on his face, which makes the wrinkles around his mouth more prominent. Time hasn’t been good to Dad these past five years. Most of his hair would be gray now if he didn’t dye it. He’s even put on some weight.</p><p>“Duchess,” Paine says, holding on to my arm. His grip makes it clear he isn’t letting me go.</p><p>“You asked me to trust you, Paine. Can you trust me? I have to go. I’ll come back.” I look up into his eyes, wanting him to see what I saw moments ago when we were in the kitchen together, talking about the life we wanted.</p><p>“Don’t count on it,” I hear my father say from behind me, and I can see the tension rolling off Paine.</p><p>“She’ll be out in a minute.” Paine pulls me into the house, slamming the door behind us. “I don’t like this. I think he’s playing at something.”</p><p>“Let me check.” Breaking away, I head back to his bedroom where I find my purse, and I pull my phone out to call Law. Paine watches my every move like a hawk while I call my brother. He picks up on the second ring and I get straight to the point. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hey. Is Grandma okay? Dad just told me—”</p><p>“I haven’t gotten to see her yet. The doctor is still in there, checking her over,” Law says, cutting me off.</p><p>“Okay. I’m on my way.”</p><p>I hang up the phone, putting it back into my purse. “I have to go.”</p> <p>“I know. I just don’t fucking like it.” Paine’s whole body looks like it’s filled with rage.</p><p>I walk over to him and reach up to grab his face. I pull it to mine so we’re only a breath apart. “I want what we talked about,” I tell him, letting him know I’ll come back to him.</p><p>He kisses me hard before reluctantly pulling away. “Don’t clean up. If you’re leaving this house without me, the cum on your thighs and pussy stays put.” I should be appalled, but I’m not. I like that I still smell of him. That when I leave, a part of him is coming with me. I nod, making my retreat into the bathroom.</p><p>I make quick work of putting my dress and shoes back on. I toss Paine’s shirt onto the bed. When I enter the bedroom, I see Paine is also dressed and is just pacing back and forth like a caged animal.</p><p>“Paine.” My voice makes him stop and turn to look at me.</p> <p>I can’t read the look on his face, but I reach out, wanting him to come to me. He walks over, his big hand engulfing mine. I lead him down the hallway and to the front door. I open it and see my father still standing there.</p><p>Turning back to Paine, I squeeze his hand. “I’ll call you when I have news.”</p><p>“You’ll call me every hour,” Paine corrects, but he’s not looking at me. He’s in a staring match with my father.</p><p>“Okay, I’ll call you every hour.” Which I will if it will cool him down a little and put him at ease.</p><p>“I don’t know what the fuck your game is, Mayor, but I’ll figure it out. And when I do, I’ll burn you.”</p><p>“Stick to things you know, Paine. Like fixing cars. You don’t want to get tangled with me.” My dad looks down his nose at Paine. Something he does to a lot to people, and it makes me want to lash out. Now is not the time to get on his bad side when he’s standing between me and my grandma.</p> <p>“We’re already tangled. You show up on my property, take my girl, and don’t think that’s all there is to it? Maybe you’re the one who’s not too bright.”</p><p>“Enough.” I break into the middle of their pissing match, which I know will just escalate. “Let’s go, I want to get there before the doctor leaves. I want to hear what he has to say.” I start to walk off the porch, but Paine pulls me back to him, kissing me hard and possessively.</p><p>“Take this.” He hands me his phone.</p><p>“I have mine.” I indicate to my purse under my arm.</p><p>“I want you to take this one.” I can tell by his tone that there is no arguing. He grabs my purse, taking my phone out of it, and hands the purse back. “I’m keeping yours. You can reach me on it.”</p><p>I don’t know what he’s doing, but I just go along with it. I take one last look at Paine as I get into my father’s car.</p><p>As the car pulls away, I expect him to lay into me about Paine and Scott, making threats and demanding I get back with Scott, but he doesn’t. He takes a different tactic.</p><p>“Paine will get you nowhere in life, Penny. I just want what’s best for you. I thought if I pushed you into marrying Scott, you’d see he was right for you. He’d be good for you. He’s going places.”</p> <p>“He’s not.” My response is flat and without emotion. It’s right there in his words. Scott is going places, and I’m guessing my dad wants his hand in those places. I have no idea what he’s playing at with this soft, caring approach. This is nothing like how he was days ago when he was telling me what I would and wouldn’t be doing.</p><p>He sighs deeply, making me look over at him. I see him glancing at the cell phone Paine gave me, making me grip it tighter before I put it into my purse.</p><p>“We’ll discuss this later. Let’s just get back home and see how your grandmother is doing.”</p><p>It’s silent the rest of the twenty minute drive home. I’m out of the car before it even comes to a full stop, rushing into the front door as fast as my heels will let me. I dash up the stairs and head for the east wing, and I’m out of breath when I reach her hallway.</p><p>When I get to the door, I see my brother sitting outside, still in uniform, his eyes coming to mine.</p><p>“The doctor just left. Grandma’s sleeping.”</p><p>I’m relieved and sad. I wanted to see her, but if the doctor left and isn’t having her transferred to the hospital then she must be okay.</p><p>“What happened?” I turn to see if my father followed me, but he didn’t. He hasn’t seemed too concerned about Grandma, but he doesn’t care about any of us unless he has a use for us. It’s clear from his not coming to check on her that she doesn’t have something he needs at the moment. Except maybe for her money.</p><p>“She had a dizzy spell, had a little fall, and hit her head. Thankfully, she didn’t break anything, and she’s just got a little bruise on her forehead.”</p><p>“Oh, thank God.’</p><p>Law pulls me into his arms, giving me a hug. “She’s fine. Why don’t you go lie down, and you can see her first thing in the morning.” I nod into his chest, but for some reason I feel like he’s trying to get rid of me. It’s not something I want to contemplate right now, so I let it go. This day has been long and filled with more emotions than I can handle. I need to crash, and my bed is calling me. I wish I could be in Paine’s bed, but this one is close to Grandma. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Letting go of Law, I say goodnight and head to the other side of the house. When I get to my room, I fall into my bed, flipping my shoes off and dumping my purse beside me, not caring that I’m still in my dress. I let my eyes fall closed until I hear a phone ringing. Absently, I reach for my purse, pulling Paine’s phone from it and put it to my ear.</p><p>“I’ve been so worried! You missed our sonogram appointment. Why haven’t you texted me back all day? Was the shop that busy?” The woman on the other end of the line explodes with questions as soon as I pick up.</p><p>“You must have the wrong number,” I tell her, thinking she’s way too wound up for nearly one in the morning.</p><p>She pauses for a second—checking the number she dialed, I’m guessing. “No, this is my boyfriend Paine’s number. The man whose baby I’m carrying. The baby appointment he missed today,” she screams each word louder than the last, and the urge to vomit makes me drop the phone. I run towards to bathroom, losing everything Paine made me eat earlier.</p> <p>I lie on the cold tile floor and let the tears flow. I can hear the phone ringing over and over in my bedroom.</p><p>How could I have been so freaking stupid? All the things Paine said tonight rush through my head. Suddenly, I’m thinking of all the times I remember girls at my dorm crying about men they had dated who had filled them with lies to get into their pants.</p><p>Peeling myself off the floor, I turn on the shower, wanting the smell of him off me. It’s too much to bear. I scrub my body clean, washing away his scent, but the little love bites he left still show. Seeing them makes a sob escape from deep inside me. Turning off the shower, I grab my robe, making my way back into the bedroom. I see six missed calls all from my number, meaning it’s Paine. I pull up his contacts, but the only number programed is mine.</p><p>Paine calls again, but I just clear it and click into his text messages. I see a bunch from the number that called, claiming to be Paine’s girlfriend. I scroll a few and read them. One is a picture of a sonogram pic. The others talk about missing him, and another is about all the dirty things she’s going to do to him. I drop the phone, not able to look at it any more.</p><p>What if I’m pregnant? Paine didn’t use anything with me. Maybe it’s, like, his weird kink or something. He liked going bareback, and maybe that’s why he has a baby on the way.</p> <p>The phone rings again. It’s Paine calling. I should just shut it off, but my anger gets the better of me. He couldn’t have faked everything with me tonight, and maybe he does feel something for me, but it’s clear he has someone else, too. What can he say? “No, Duchess, I want to be with you, not her.” Oh, sweet, just ditch your ex for the newest fling. What happens when someone else comes along that catches your attention? Thanks, but no thanks.</p><p>I pick up the phone, wanting to hurt him back. I don’t give him a chance to speak before I start in. “Paine, it’s over. Go back to your pregnant girlfriend and leave me alone. I’m marrying Scott.” I hang up before he can respond. I turn the phone on silent and put it back into my purse. I can’t bear to look at it because it’s something that will just remind me of him.</p><p>Tossing my purse on my nightstand, I knock over the ring box Scott gave me when he asked me to marry him. Well, I guess saying he asked isn’t correct. It was him and my father telling me how this was a great idea and how Scott and I were a great fit. I flip open the box and stare at the giant diamond. It’s nothing like the ring I thought I’d wear one day. The one my grandma gave me flashes through my mind, but I push the image away. If I’m not going to be with Paine, I might as well make things easier around here. I slide Scott’s ring onto my finger with no intention of marrying him, but maybe it will give me some time to figure things out. Get them off my back. I’m guessing Paine isn’t going to want to solve my problems now.</p><p>The tears start to flow again until exhaustion claims me.</p><p>Ten</p><p>Paine</p> <p>“Let me in, Law.”</p><p>“I’ve told you five times already. The answer is no. It’s three in the morning. Anything you need to say to Penelope can wait until morning.”</p><p>He’s standing in front of the house, in just jeans and a shirt. I’m sure he could get official and take me to jail, but he must sense the desperation in me enough to give me a pass.</p><p>I know it’s late and her grandmother is sick. I just need to wait until daylight and make this right, but I’m going crazy that for even a second she thinks that I’ve been with someone else. I haven’t touched a woman in years. Not so much as even had a kiss. It’s scientifically impossible for me to be having a baby with someone. I want to be able to talk to Penelope and explain this to her, but she won’t answer the damn phone.</p><p>Sighing, I turn and walk towards my car. I clench my hands into fists, frustrated beyond belief. All I can hear is her broken voice in my head. I’m shocked she would think I could ever do something like that to her, deceive her in that way. A pregnant girlfriend? She’s marrying Scott? I won’t stand for it.</p><p>I walk away from the house and get into my truck. I didn’t want to bring the motorcycle because it’s loud, and I know her grandmother isn’t doing well. I get in and drive away from the house, watching in the rearview as Law goes inside and shuts off the porch light.</p><p>I circle around the block and park along the fence at the back of the property. Silently, I jump the estate walls and creep along the trees through the woods. When I reach the back of the house, I climb up the railing along the porch. I’m able to lift myself onto the second-story balcony, and I hide in the shadows, not knowing whose room I’m outside. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It’s not too cool tonight, and lucky for me, the doors are open. I wait for a sound, and when I don’t hear one, I tiptoe inside. I don’t make it five steps before a bedside lamp clicks on. I stop mid-step, caught in the act.</p><p>“You must be the man my granddaughter is all twisted up about.”</p><p>I turn and face the bed, seeing what looks like a much-older Penelope. She and her grandmother are nearly identical, her grandmother just having a few soft lines. She’s in the bed, but wearing a robe, her long hair braided and falling down one elegant shoulder. She folds her hands across her lap, patiently waiting for me to speak.</p><p>“She told you about me?” I don’t know why these are the first words out of my mouth.</p> <p>“No, but she and I share a close bond. I know when something is troubling her, and you, my dear, are trouble.”</p><p>I hold my hands up and start to plead my case, but she cocks her head to the side and smiles at me. She reaches out and pats the chair next to her bed, and I walk over, taking a seat.</p><p>“Do you love her?” My mouth falls open at her candid questions. “Listen, when you get to be my age, things become simpler. If you want to know something, you ask. So I’m asking you. What is it that’s got you sneaking in here in the middle of the night?”</p><p>I feel a half-smile dance across my face. This is my kind of lady.</p><p>“She’s something special to me, and some things got twisted up tonight. I’m here because she won’t answer the phone and let me explain myself. She’s upset, and it’s because of a lie. I’m here to tell her the truth. And if you don’t mind, I’d like to reserve the confession of my feelings so that I can give them directly to Penelope. I think it’s only fair that she hears it first.”</p> <p>“Are you going to let her marry that idiot Scott?”</p><p>“No, ma’am.” My answer is fast and fierce. “She’s mine, and I swear to you that I’ll protect her and cherish her for the rest of our lives. I don’t know what happened tonight, but I will fix it, and then I’ll never let her leave my side. I may not be able to give her all this,” I wave my hand around to indicate the estate, “but I’ll treat her better than anyone ever could. There’s not a man alive who will take care of her better than I will.”</p><p>She gives me a soft smile and leans her head back against her pillow. After a second, she closes her eyes and then opens them again. She looks a little teary eyed as she reaches over to her bedside table and opens a drawer. She pulls out a small ring box and passes it to me.</p><p>“You remind me of my late husband, James. We started out with nothing but love, but damn if he didn’t love me enough that I never needed anything else.” She lets go of the box and wraps my hand around it. “She’s down the hall, fourth door on the right.”</p><p>I clutch the box and then slide it into my pocket. I know what it is, and I know what it means. As close as Penelope is to her grandmother, I’m relieved to have her blessing.</p><p>Standing up beside the bed, I look down at her, seeing how tired she looks. Leaning down, I lay a small kiss on her cheek, and her hand comes up to touch my beard. When I pull back, she’s smiling and then holds her cheek where I kissed her.</p> <p>“I forgot how much I missed my James’s beard. Go get your girl.”</p><p>With that, I turn and leave the room, making my way quietly down the hall. I count off and when I get to the fourth one, I put my ear to it and listen. I hear slight snoring, and smile. That’s my Duchess.</p><p>Opening the door, I see her silhouette on the bed. I can make her out from the moonlight streaming in. I walk over to the bed, stripping down as I go. When I’m completely naked, I strip back the covers and climb in behind Penelope.</p><p>She’s wrapped up in a robe that’s wriggled its way up her hips, and I can see she’s naked underneath. I move on top of her, and she comes awake, her gray eyes growing big. I put my hand over her mouth as she starts to shout, and I hold my finger over my lips.</p><p>“Shh, Duchess. You’re going to listen to me. Don’t panic.”</p><p>She’s shouting at me from under my hand, but I lean in, kissing her neck to help calm myself. I can still feel her struggling against me and calling me a few names.</p><p>Leaning up, I look into her eyes, and I can see she’s mad as hell at me. “You can call me every name you want to, Duchess. I’m not going anywhere until you hear me out.”</p><p>She tries to move her legs and kick at me, but all it does is open them further. The action also pushes my cock against her naked core.</p> <p>I hold her tightly and wait her out, kissing her neck and collarbone. “You’ve got yourself all worked up, and you haven’t even asked me if anything is true. You heard something from someone, and you assumed the worst. Why, baby? What have I done to you to make you think all my words aren’t true?”</p><p>Looking into her eyes, I can see she’s starting to hesitate, some of her anger falling away.</p><p>“Penelope, you said I had a pregnant girlfriend, which is impossible. I haven’t been with anyone but my hand in years. An embarrassing number of years, as a matter of fact. So I don’t know who told you what, but it’s all lies.”</p><p>I feel her deflate completely under me, and I slowly take my hand away. I don’t move my body off hers. Instead, I press against hers harder, letting her feel the ridge of my cock against her warm, open pussy.</p><p>“You think I’d lie to you about something like that?” She looks me in the eyes, and after a second, shakes her head. “That’s right, Duchess. I wouldn’t ever do anything to hurt you. I’ll always tell you the truth, and I would never keep something like that from you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I move my hips, dragging the thick vein on the underside of my cock across her sensitive clit. She moans at the movement, and I grab her wrists, holding her hands above her head. When I go to entwine my fingers with hers, I feel a ring on her finger. One that I sure as fuck didn’t put there.</p><p>Sitting up a little, I grab her hand and hold it up, seeing the diamond on her finger. “I wanna say a few choice words about this, but I’m thinking about how you jumped to conclusions with me, so I’m going to give you three seconds to explain this.”</p><p>She reaches up, taking the ring off her finger and putting it on the table beside the bed. “I was mad. And though I don’t have any intentions of marrying him, I thought it would make life easier if it appeared that way.”</p><p>I reach down between us, grabbing my cock and putting it at her entrance. I thrust hard inside her warm, willing cunt and fuck in and out of her. I grit my teeth and hold her legs open, letting her feel my need.</p><p>We lock eyes, and I reach up to grab her chin. “Nobody but me puts a ring on that finger. You got me, Duchess?”</p><p>She nods her head, and I keep thrusting hard, little moans escaping her. Her pussy is dripping wet and takes my fat cock easily. Her hips rise up a little, welcoming my dick deep.</p><p>“You feel me bare inside you, Duchess?” When she nods again, I hold her wrists down and lean in so her hard nipples rub against my chest. “I’ve never been raw with anyone until you. There’s never going to be anything between us. So don’t let people try to come between us, either. You got me? “</p><p>“I got you,” she whispers, and I take her mouth. I kiss her roughly, then break away to suck on her tit. She moans when I bite down on one, then lick it better. I can’t wait to breed her and have them dripping with milk.</p><p>Reaching down between us, I hold her hips with both hands, tilting them up a little so I can get a deep angle. I make sure I’m hitting her sweet spot when I bottom out, and I feel her pussy clench around my dick with every thrust.</p><p>When I feel her cervix kiss the tip of my cock, I hold it there and pulse in and out of her slightly. “I want you to cum like this so your body opens up to take my seed, Duchess. I’m gonna keep my dick right here, so when you cum, I can empty into you. Make sure I bred you good.”</p><p>She clenches at my words, and after just a few rocks against her, she cums. She has to pull a pillow over her face to muffle the shouts of ecstasy. Her hot cunt pulsing around my dick has me going off with her. I concentrate on shooting in her sweet spot, knowing I want my baby growing inside her.</p><p>After my balls are completely drained, and she’s come down from her peak, I roll us over so my cock is still inside her, and I hold her to me.</p><p>“I don’t want you to ever leave my side again.”</p><p>Penelope sits up and looks into my eyes, nodding her head. “Never again.”</p><p>I thrust lazily into her as she falls asleep on top of me. I rub her back with the tips of my fingers, finally calm now that we are back together.</p><p>Eleven</p><p>Penelope</p><p>Paine holds me to him, his arms wrapped tightly around me as I sob uncontrollably. I have no Idea what I would’ve done without him today. He’s been my rock through everything. Helping me move through the motions.</p><p>When I went to check on my grandma this morning, I found her unresponsive. The rest was a blur of red lights and the doctors telling me there was nothing they could do. She was gone. She had passed easily in her sleep sometime in the night.</p><p>It’s so eerie to be standing in a hospital, being told someone you love is gone. Then being told to go home. You just leave without your loved one. I don’t know why I thought this was so strange, but it hit me hard. I didn’t want to leave the hospital, it felt too soon and all too final. There was still so much more I needed to say as the nurses and doctors moved around me tending to other patients. But they were right. There was no reason to be there. But I didn’t want to go home.</p><p>“Let it all out, Duchess.” Paine strokes my hair as he slowly rocks me in his lap. We’re now back at his house, in his bed. I have no idea how long I’ve been in his lap now, but there’s nowhere else I want to be in this moment.</p><p>When the sobbing finally stops and I don’t think I can shed another tear, Paine lays me down in his bed, slipping me under the covers. “Baby, you need to eat.” The mention of food makes my stomach turn over, and I shake my head.</p><p>He drops down beside me. He gently pushes some of my hair out of my face, and I think how I could have ever believed that he’d hurt me. This man who’s been holding me together all day would never hurt a hair on my head. I want to kick myself for doubting him, which makes me cry even harder.</p> <p>“The last conversation I had with her was filled with lies,” I tell him, confessing my mistakes. “I talked about that stupid wedding. I wish I’d told her about you. Should would have loved that so much. You should’ve heard the way she talked about my grandpa.”</p><p>“I did, Duchess,” he whispers as he places a red velvet box between us. I realize it looks familiar because I’d been holding it the day before. “How did you...” I reach out to grab it, but he snatches it back, giving me a sweet smirk. I didn’t know a man like Paine could have a sweet smirk, but it’s there on his face now, all soft and warm.</p><p>“She let me in last night.” He opens the box, pulling out the beautiful ring, a contrast to his rough, hard hands. “She knew she wanted you to be happy, and I told her I’d spend my life making sure you were. She knew a lot more than you think she did, and I think she saw in me what you do. Then she gave me the ring.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sit up, not knowing what to say. He talked to my grandma last night, and she’d given him the ring? He stays on his knees next to the bed, me looking down at him.</p><p>“I wanted to do this differently, give you flowers and say words filled with poetry. Something a woman like you deserves.”</p><p>“A woman like me?” I question, not knowing what he means.</p><p>“A duchess.”</p> <p>“Your duchess,” I correct, making his eyes grow possessive.</p><p>“I may not have a castle to put you in, but I’ll build you one if that’s what you want.”</p><p>“I’d be happy being your duchess anywhere you put me, Paine. If you asked.”</p><p>“I’m trying, baby,” he teases, making me smile for the first time all day. This is what my grandma was talking about. She didn’t care about all the things my grandpa gave her. It was just being with him. I realize what she was getting at, and I don’t care about it either. The idea of going back to the giant family estate isn’t appealing. I want to stay right here in Paine’s house for the rest of my life.</p><p>Paine grabs my hand, his rough fingers running along my knuckles before he slides the ring on me. He leans up to kiss me, his mouth taking mine possessively like never before. This one is claiming, like he is trying to leave a mark on me for the world to see. Desire shoots through my body, and I try to pull him closer to me, wanting his body against mine. Just as I have this thought, he breaks the kiss and rubs his cheek against mine, both of us breathing heavily. His beard is rough against my soft skin, and I lean into it, loving the feeling.</p> <p>“None of that tonight, baby. You need to sleep.”</p><p>“You said you’d give me whatever I want.” I try to pout, but he turns me over, facing away from him as he comes crawling in behind me, wrapping his arms around me. He pulls my back to his front as he spoons me, and I close my eyes at the feeling of safety. This is something we’ll get to do for the rest of our lives, and I feel another smile pull at my lips.</p><p>“Sleep,” he whispers in my ear before placing a kiss on my neck.</p><p>“You didn’t even ask me to marry you.”</p><p>“Nope,” he says, and wraps his arms around me even tighter. I have a feeling a lot of things with Paine are going to go like this. He wants something and he takes it. It should make me mad, but all I do is smile and drift off to sleep.</p><p>Twelve</p> <p>Paine</p><p>Once I know she’s asleep, I slip from the bed, pressing a kiss to her bare shoulder. Fuck, I’m going to love having her in our bed every morning before I go to work. I’ll leave her warm in our bed, knowing she’ll be here when I get home. I may not be able to give her a castle like I told her, but she’ll never go without. The life we’re going to have together, I’ll do anything to have, and no one is going to fuck with my girl. These little games are so beyond over. Done. They keep trying to take her from me, and now I’m going to be the one doing the taking.</p><p>Her grandma left her to me, and I’m going to make sure she’s cared for like she should be. I know the next few days are going to be rough, and I don’t want anything making them any harder than they have to be. I’m going to make sure a few people stay out of our way. They’ve done enough damage. She’s spent the last two nights crying—last night because of some lies someone told her, and tonight because of her grandmother. The first night was all their fault, and that shit wasn’t okay.</p><p>I change my clothes and grab the keys to my bike, rolling it down the driveway so it doesn’t wake Penelope when I start it. She finally passed out, and she needs her rest to make it through all the details of the funeral. When I get far enough away, I flip my phone open, calling Butch.</p><p>“Yo,” he says over the heavy beat of dance music. He’s probably at some bar, chasing tail.</p><p>“I need you to watch my house for an hour.”</p><p>“On my way.” The line goes dead, and I know he’ll be here quick with no questions asked.</p><p>I hop on and start the engine, the chopper roaring to life. I head across town, one location in mind, knowing Butch will make sure no one bugs my girl while I’m gone.</p> <p>It didn’t take much for me to figure something wasn’t right. It started at the hospital when the doctors were directing all their questions at Penelope and Law while their father stood off silently to the side. I was a little surprised he’d shown up to the hospital at all, but how would it look if the Mayor hadn’t? Everything to him was about looking good in the public eye. He was good at hiding the shit he was covered in.</p><p>I hadn’t paid much attention to the Mayor before now because I hadn’t had a reason to. As long as he stayed out of my way I didn’t give two fucks. I’d often wondered how he got elected, but the simple answer was money, and now I’m starting to question if he has any. I know he married into Penelope’s family, but I didn’t know how much control he had over it. I’m really starting to suspect it’s none.</p><p>Things like making Penelope marry Scott, his right-hand man were really starting to make sense now. I didn’t understand why he was so hell-bent on it, going so far as to threaten his own daughter if she didn’t. Yeah, I can see a guy like him not wanting her slumming it with the local mechanic, but pushing her into marrying a certain man was outdated, unless he needed to control her. Seems he’s been doing that with Penelope’s grandma to a certain extent. I had a feeling some things were going to be coming to light every soon. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When I make it to Tammy’s, I pound on the door, not giving a shit how loud I’m being. I know Scott’s inside; his car’s parked in her driveway. I also know it was Tammy who made that call to my girl last night. I don’t give a fuck if she’s a woman. I’ll bury her right along with the Mayor and Scott. I called the number back on the phone, and when she picked up, I recognized her voice. I just hung up, and another thing clicked into place. I wasn’t going to have it out with her on the phone. No, I wanted to do it in person so she and Scott could see how much I wasn’t fucking around. That I’m not playing games.</p><p>When she answers the door, her face is surprised, but it quickly turns to what I think is supposed to be seductive. She pouts her lips and lets her robe fall open, revealing she only has on underwear. I glance past her to see Scott sitting on the sofa, not even looking this way, his eyes on the TV.</p><p>Who the fuck would let their woman answer the door after midnight dressed like that? “Close your fucking robe. You’ve got nothing I want to see.”</p><p>Scott jumps off the sofa after hearing my voice. I can tell he’s about to say something, but I cut him off.</p><p>“I don’t know what you’re fucking playing at, but either of you do another thing to hurt my woman and I’ll fucking kill you. I got a lot of land, and bodies aren’t that hard to hide.”</p><p>Tammy takes a step back, wrapping her robe around her tighter after hearing my warning. Scott still stands there and isn’t getting the fucking message.</p><p>“You can’t—” I shoot him a look, taking a step into the house, and he retreats, shutting his mouth. It’s the smartest thing he’s done yet.</p><p>“My lawyer will be in contact with you tomorrow, Scott. Penelope and I want to see all the paperwork on her family’s estate and the will. I don’t trust you, and if he finds even one thing out of place, anything that indicates that you and that fuckhead Mayor were doing something you shouldn’t have been doing, then you’d better hope Law gets his hands on you before I do.”</p><p>With that, I leave. No point arguing with him. I don’t want to hear what he has to say because it doesn’t matter. All that matters is getting back to my girl, making her something to eat, and climbing back into bed with her before she wakes.</p><p>Thirteen</p><p>Paine</p><p>She grinds her pussy down on my face as I grip her ass with both hands. I hold her tight so I don’t grab my cock and stroke myself as she takes her pleasure from my face—something I’m more than willing to give her.</p><p>“You like your throne, Duchess?” I rub my beard against her pussy, which makes her moan and push back into my face. Fuck, I love how much more open she’s become over the last two weeks. My cock isn’t so sure, because she always has him in a constant state of need. I’ll dump one load inside her only to have her start trying to get another one out of him. And right now he’s begging to release one, but I won’t let him. I want him deep inside her cunt before he gets his. I’ve been filling her with every drop I can, trying to get my baby inside her as soon as possible.</p><p>I look up as she rides my face, her hair falling all around her as she leans forward to grip the headboard. Her big tits bounce with each slide back and forth across my face. It makes cum leak down the head of my cock and drip down to my balls.</p><p>Waste of good seed if you ask me, but I’ll hold back the rest. Gripping her hips, I halt her movements, sucking her clit into my mouth. I’m going to fucking cum all over myself if I don’t get into her soon. She jerks against my face as I suck her orgasm from her body and drink it down my throat.</p><p>When the pulsing in her cunt stops, I flip her over and have her facedown on the bed. Using my knees to spread her legs, I thrust my thick cock home.</p><p>“Paine.” She moans my name, making a spurt of cum spill inside her. Fuck. Not yet.</p><p>“You like this? When I take over? Do whatever I want to this body now that it belongs to me?” I slide in, harder this time, my cock touching her womb. She grabs the headboard tighter to help her little body brace for my thrusts. She begs me for more and for me to fuck her harder. My dirty girl.</p><p>I drop down further onto her, giving her some of my weight as I use my knees to spread her even wider. I want in her as deep as I can get. My chest fully covers her back, and I grab a handful of her hair, turning her head so I can put my teeth on her neck. I bite and kiss her there, then work my way to her shoulder. I’ve learned her favorite spots and what to say. My little Duchess loves when I talk filthy to her. One night I was playing with her nipples, telling her all the things I was going to do to her, and she came without me so much as touching her pussy.</p><p>I spanked her ass for wasting an orgasm that my mouth or cock didn’t get to taste. Then I tied her to the bed while I cleaned it up with my mouth, and then made her give me two more to lick off her pretty pussy. I didn’t know a pussy could be so fucking pretty, but she proved me wrong.</p><p>“Say it,” I grunt, as I thrust over and over into her tight cunt, making the headboard knock the wall, the smell of our sex filling the room. I’ll have to fix that shit when we have kids. Maybe just nail the thing to the wall because there’s no way I’ll ever stop fucking her pussy like this. It’s begging me for it, gripping onto my dick with each thrust like it’s worried I’ll leave it. It should know by now I won’t leave it until it’s overflowing with me, my cum dripping out of her, spilling onto the bed.</p><p>“Please, Paine, cum inside me. I need it.” My fingers tighten in her hair. I can feel her try to lift her ass to meet my thrusts, but I have her pinned beneath me as I press harder and deeper into her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You’re going to take every drop of me.” It’s a command, not a question, and it’s enough to set her off. She cries out with a wild moan as she climaxes around my cock, gripping me in a vice-like hold. I keep thrusting, rocking her body against the mattress as her pussy pulls my own orgasm from me. It makes my cock swell even more, and a loud groan sounds from deep in my chest as I ejaculate inside her. Long jets of semen fill her as she continues to milk my cock.</p><p>Dropping to the side so I don’t crush her, I pull her into my arms so we’re both on our sides, my chest to her back. I wrap one leg around hers and spread her open, my cock still inside her. Reaching down, I spread her pussy lips and strum her clit, unable to stop touching her.</p><p>“I need you to cum again, baby. I want this pussy to clench up and pull all my cum deep inside you. You want that baby, don’t you? Your pussy has to suck all my cum deep so it can plant there.”</p><p>Just like always, her body jerks, cumming again, doing as I tell her. A little more cum spills from my cock, and her pussy takes it greedily.</p><p>She lies quietly against me, and I pepper kisses down her neck. Pulling out of her, I move and take her mouth in a soft kiss.</p><p>“I love you.”</p><p>“I love you, too.”</p><p>She runs her finger down my cheek and into my beard. She gives me a sexy, satisfied smile that makes my chest warm, knowing I did that shit to my woman. It makes me proud to know I put that look on her face</p><p>“We’ve never said that before today.” She whispers the words, as if speaking loudly will make them go away.</p><p>“I just wanted you to know that, before we go to the lawyer today. But I do love you. I have from the first day I laid eyes on you. Knew you were different. Knew I’d make you mine.”</p><p>Her eyes water, and she blinks a few times to keep the tears from escaping. “I don’t know what would’ve happened if my car hadn’t needed fixing. What if I hadn’t found you? I don’t think I could’ve made it without you these past weeks.”</p><p>“I would’ve found you.” I say the words with all the confidence in the world, not wanting her to think that way. I may not have known it, but being alone all those years, I thought it was because I was busy and had no interest in women. Now I know I was just waiting for her and no one else would do. A part of me knew she was out there, and I just had to wait and I’d find her. “No way would I have missed you walking around this town. Hell, if you hadn’t come into the shop, I would’ve found you at the bar that night.”</p><p>“I know. That’s what was I thinking. I’m kind of surprised you didn’t find me at birth with your ability to track me,” she giggles, and the sound makes my cock grow hard again. Not that it ever went down. Her being naked against me makes that impossible.</p><p>“Don’t even think about it.” She jumps from the bed, running towards the bathroom. I hear the shower turn on, and I pull myself from the bed, too. We need to get a move on. We have an appointment with the lawyers in an hour, but maybe I can milk one more orgasm from her.</p><p>Looks like I got two from her. She gave me one in my mouth and another on my cock before I pulled her from the shower and we both quickly got ready.</p><p>Now I’m sitting in a room with three lawyers, Scott, Law, and the Mayor, and my head is all but pounding.</p><p>“I can’t believe you forged my name. I never signed any of this.”</p><p>“Me neither,” Law says, taking Penelope’s hand in his. They’d never been close, but over the past two weeks they’ve been working on being a family again. “But I had a feeling something weird was going on so I started digging around. Seems like when something didn’t say something you liked, you just changed it, whether it’s legal or not.” Law’s stare bores straight into his father.</p><p>“I don’t know what you’re talking about. How dare you make those accusations! I’m your father.”</p><p>Law just runs a hand through his hair, not seeming to care. Both Penelope and Law have pretty much wiped their hands clean of him since the funeral. Their father tried to get them both banned and wouldn’t let them come to the will reading, saying their names weren’t listed in it. All bullshit, and they know it.</p><p>Scott stands, like he’s appalled at the accusations. “My client doesn’t have to entertain this line of questioning.” Maybe he should’ve been an actor instead of a lawyer.</p><p>“I’d sit down if I were you, Scott, because the Mayor’s hands aren’t the only ones that are dirty in this. Looks like you’re all over this, too.”</p><p>“We’re leaving.” Both of them storm out of the office, and I move to grab them, but Law stops me.</p> <p>“They aren’t getting away with this. They signed my woman’s name on all kinds of documents. Saying she gave up rights to things she never did, and you’re talking like they got their hands into something else as well.”</p><p>“Two FBI agents are going to grab them before they even make it off the curb.” Law leans back in his chair, and I understand his easy tone. Still, I’d like to have gotten my hands on them before the feds did.</p><p>“Not only did they try to change stuff in Grandma’s will and give us a fake one, seems good old Dad has dabbled in some campaign fraud, too. I’ve been tracking it for a few months now.”</p><p>I hear Penelope sniff beside me, and I pull her into my lap. She comes easily, leaning into me.</p><p>One of the lawyers clears his throat, reminding us he’s still here. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Like I was saying, here’s the real will. It’s quite simple really. Everything is split evenly between brother and sister. Everything. And she left a note. The rest is just legal work I’ll take care of, and we’ll have everything switched over to your names.”</p><p>“A note?” Penelope says, cutting the lawyer off. He walks across the room, handing her the note.</p><p>“I’ll leave you to it. I’ll be in contact.” With that, the two of them leave the three of us alone.</p><p>Law sits down beside us as Penelope opens the letter, and we all read it.</p><p>I was broken when I lost your grandfather and mother so close together. I let grief overtake me, and before I knew it, I’d lost almost all my family. Your father shipped you both off to school, and you seemed so happy. I thought it would be selfish to make you come home, but maybe, just maybe, with my passing we can finally pull this family back together again. Love and being together. Nothing is more important than that.</p><p>Love you always, Grandma.</p><p>“Are you leaving?” Penelope looks over at her brother, and we all know she means leaving town and going back to Chicago. If he is, I think she’ll want to follow, and I’m more than willing to do that for her. I just want to be wherever she is.</p><p>“No, Penelope, I’m never leaving again. We’re both staying.” He glances over at me, a knowing look on his face. “She’s right. We need to pull this family back together. It starts with you and me, and I think we’re both about to start our own little families.”</p><p>She sighs and nods. “I like the sound of that.”</p><p>Fourteen</p><p>Paine</p><p>“Oh fuck, Duchess, that’s it. All the way to the back of your throat, baby.” I feel her suck my cock down, and I bury my face back in her cunt. Her sticky sweetness coats my mouth and beard, driving my need higher and higher. Somehow we ended up on our bedroom floor. Why? I have no idea. We have a perfectly good king-size bed right beside us, but sometimes need gets in the way.</p><p>I’m taking her sixty-nine, and it’s killing me. She’s on top, and I’m having a hard time controlling anything like this. I’m at the mercy of her mouth, and I don’t know how much longer I can take it. Normally, if I can watch her go down on me, I can grab her hair and help control it. In this position, I’m utterly taken and completely off balance.</p><p>I try to focus on eating her pussy and sucking on her clit. I lick back, sticking my tongue deep inside her, and press a finger against her asshole. She cums so hard when I have just a little pressure there, so I rub her tight ring, making her moan louder around my dick. She tenses and grinds on my tongue, taking what she wants.</p><p>Feeling her mouth pop off my cock, she licks down to my balls, giving them attention. She sucks them into her mouth one at a time, licking them and nuzzling there with her face. I feel her gently rub her nose and cheek against me, and the intimate feeling nearly has me cumming on her face. It’s too intense and too perfect all at the same time.</p><p>Having her pussy on my mouth and her tongue on my dick is heavenly, but I can’t go off like this. I love cumming inside her too much to waste it.</p><p>I break my mouth away from her pussy, pushing her hips down my chest. ‘You gotta stop or I’m gonna bust too soon. Ride me, Duchess.” She lets out a little whine, like I took away her favorite toy, and in a way, I guess I did.</p><p>“Get on it, baby. I’ll give you what you want. I swear.” She sits up, and I help her squat down over my cock, getting in reverse cowgirl position. I’m so turned on, my cock is already standing straight up, so it’s easy to hold it in place as she slowly lowers herself down. When my thick cock is fully inside her, I thrust up, and she lets out a loud moan.</p><p>“I told you I’d give it back to you, Duchess.” Grabbing her hips, I help her bounce up and down on top of me. Her ass shakes with each thrust, and it makes my cock leak inside her tight pussy with every stroke.</p><p>“Lean forward a little, baby. Let me watch.” She does as I ask, leaning forward and bracing her hands on my knees.</p><p>I look at where we’re connected, watching my thick cock fuck in and out of her tight channel. Her pussy is so fresh and tight, I can see it holding on to my dick when I pull out. Her cunt gripping me and begging me to stay.</p><p>Every stroke in and out leaves a coating of her cream my dick. She’s so fucking horny for it, her pussy is dripping to the base of my cock and making a little puddle. Each time she drops down on my cock, a smacking sound echoes through the room.</p><p>After a few more bounces, I feel her hand rub my balls. I groan at the sensation, loving her gentle touch there. They tighten at her contact, so ready for release.</p> <p>“I’m going to rub them until you go off inside me, Paine. I just want to feel you pulse in me as you do it. I want your cum to warm me up.”</p><p>“Fuck.” I close my eyes tightly, trying to hang on until she’s cumming too. “Rub your pussy, Duchess. I’m close, and I want you with me.”</p><p>She rubs my balls, trying to milk them for me as her other hand goes to her pussy. I can feel it there because I can feel her fingers slip around my wet shaft. She rubs around the base of my cock where we are connected, scooping up our combined cream. She rubs it around and then slides it up to her clit, rubbing it there to get herself off. She glides up and down my cock while rubbing our cream on her cunt, and I can’t take it anymore. Seeing my dick disappear and reappear as I fuck her and feeling her tight pulses have me nearly cross-eyed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Paine.” She moans my name as my cum pumps up into her. Her pussy clenches as her orgasm hits. I can feel each time my dick contracts, sending a squirt of cum into her.</p><p>She rides it out, slowly moving up and down, taking all of me as she shouts out her orgasm. Squeezing me harder and harder, she tenses up at her peak.</p><p>I hold her hips and try to breathe, letting her ride it out. After a few seconds, she falls back on top of me, a sweaty heap lying across my body. I wrap my arms around her, holding her to me, kissing her neck as we both try to catch our breath. It was intense and hot as fuck, and I don’t know how long I lie there, holding her, trying to recover.</p><p>After a few moments, I kiss her shoulder and tell her it’s time. “It’s probably ready by now.”</p><p>“I’m nervous.”</p><p>“I’ll be right there with you the whole time.” I smile against her skin and squeeze her tighter, letting her know I’m never going anywhere.</p><p>She takes a deep breath and nods, and I get us both up off the floor. I take her by the hand and lead her to the master bathroom.</p><p>Penelope is a few steps behind me as I pull her to the sink with me. “You realize the test said we only had to wait sixty seconds, don’t you?”</p><p>I feel the cocky grin come appear on my face, and I turn to look at her. “Yes, and I told you sixty-nine sounded like a better idea, and that’s how we ended up on the floor. You didn’t put up much of a protest, if I recall.” She blushes a little, and I move in to kiss her.</p><p>These past weeks have been absolute heaven. I didn’t know love like this could be real, and each day I’m happier and happier. It’s only been about six weeks total since I first laid eyes on her, but I felt then what I feel now. I feel like I’m home.</p><p>When we left the lawyers that day, we went straight to the estate and got her things. There was plenty of time to go through the house and figure out what she wanted to do with it, but in that moment, we both wanted one thing, and that was to have her living with me.</p><p>I wanted her in our bed forever, and whatever it took to do that, that’s what we did. I asked her a couple of times what kind of wedding she wanted, and she finally decided she wanted to do something small in our home.</p><p>We got married in the backyard under the old oak tree. She wore her grandmother’s wedding dress, which was classic and simple. And she had her brother walk her down our makeshift aisle. Butch was my best man, and surprisingly, Penelope asked Joey to be her maid of honor. Over the past weeks, they’ve grown really close, and I think it has something to do with Joey being important to Law.</p><p>Neither of us cared about a big wedding or anything fancy. So we kept it simple. We just wanted something for us, and to make it legal. And I wanted to make sure the rings were exchanged.</p><p>She wears the ring her grandma gave me, and I wear a simple gold band. People tell me it’s dangerous to wear one while working on cars, but I think it’d be more dangerous not to wear one. I don’t want anyone thinking I’m not taken by the most beautiful woman in the world. I wear it with pride, and if you ask me about my wife, you better get comfortable. I’ve got a long list of what I love about her. I couldn’t be happier.</p><p>Standing in the bathroom, I break our kiss to reach over and grab the pregnancy test. I don’t look at it, just hold it out for her to take. Her nervous fingers take it from me, and she holds it, hesitating.</p><p>I pull her naked body close to mine, wrapping her up and kissing her forehead. “Turn it over, Duchess.”</p><p>She turns over the pregnancy test, and we look down, seeing the blue plus sign. I feel my heart nearly burst with love, knowing that we made a baby together. I knew at some point it would happen, but seeing the test makes it so much more real. I feel myself smile from ear to ear, and I look down to see Penelope shed a few tears. I kiss them away, scooping her up and carrying her to our bed.</p><p>Laying her down, I crawl in beside her, resting my hand on her belly. I feel a tear slip free from my eye, and she leans in to kiss it away, just as I did to her. I’m overflowing with happiness, and it’s coming out in the form of tears.</p><p>“Thank you for making me so happy, Penelope.” I hold her to me and think about how perfect everything is. I would fight to the death to keep this love, and I’ll never let anything come between me and my family. “I love you and our baby so much.”</p><p>“We love you, too, Paine.”</p><p>She puts her hand over mine, and we lie there talking about baby names and what kind of nursery we want. I don’t care what she chooses, as long as she’s happy. I’m just glad I’m the lucky son of a bitch she chose to take along for the ride.</p><p>Epilogue</p> <p>PENELOPE</p><p>5 years later</p><p>“You better quit that or we’re gonna be late.”</p><p>“It wouldn’t be the first time, and it won’t be the last,” Paine mumbles against my neck, sending chills down my spine.</p><p>“I mean it. I spent three hours cooking sides for this BBQ, and if we’re late and we miss Law pulling the pork off the smoker, you’re gonna have one pissed-off pregnant lady on your hands.”</p><p>Feeling Paine kneel down behind me, I start to wiggle. I know what he’s up to. It’s been five years and three—almost four—kids later. I know his moves.</p><p>He lifts up my summer dress and nibbles across my ass. I grip the counter top, some of my anger melting away. “Paine,” I warn, but he ignores me.</p><p>His tongue come out and moves from my ass cheeks to the area between my legs, and all my resistance disappears. Bending over as far as I can with an eight-month pregnant belly, I spread my legs, giving him all of me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I stopped wearing underwear years ago, getting tired of having them in the way. He always wants me, any time of the day, and I just gave up trying to block him. Instead, I’m almost always in dresses, with no panties, and it’s made for a very happy marriage.</p><p>It’s not always easy with three kids running around, but when love is important, you make the time. Thankfully, the kids had a slumber party at their cousin’s house last night, so we’re all alone. Law and Joey took them for the night, knowing how much their kids love having them over.</p><p>Paine licks the inside of my thigh, teasing me before going back to my core. I moan loudly and push back, wanting more. “Stop playing, Paine. Don’t tease me. I’ve got too many hormones right now.”</p><p>I feel him laugh against me, then his mouth goes to my clit. He eats me out from behind, and I give myself over to him. After just a few knowing strokes of his clever tongue, I’m cumming against his face, the release fast and hot. He knew what I needed, even if I didn’t know to ask for it. That’s what years of being together has done to us.</p><p>I rest my forehead against my arm on the counter as I feel Paine kiss my legs, loving every inch of me. He runs his hands up my hips, petting me as he flips my dress back down.</p><p>“Damn, I needed that,” I say as Paine stands up and rubs my back. He always knows exactly how to handle me in the sweetest way. I stay in that position, leaned over with him rubbing me, and I feel all the anxiety of today melt away.</p><p>I’m lucky I found such an amazing man who loves me unconditionally. He loves me when I’m moody and when I’m being a brat. And best of all, he knows just what to say to pull me out of it. I smile, thinking that he’s pretty damn lucky he’s got me, too.</p><p>“I’ve got everything taken care of, Duchess. You go sit your pretty ass in the truck and wait for me.”</p><p>I look over my shoulder and smile at him. I stand up, turning around to give him a kiss. I taste myself on him, and it has me excited, wanting more. Reaching down, I rub his hard cock, but he takes my hand and entwines our fingers together.</p><p>“That was just for you. We’ll have fun tonight after the kids are in bed.”</p><p>“Deal,” I say, and turn to walk out of the kitchen. He smacks my ass on my way out, and I turn around, laughing and rubbing the spot he smacked. I grab my bag, going out to the truck and doing what he says.</p><p>Our lives are loud, and messy, and a little crazy at times. But they’re overflowing with love, and that’s all that matters. When he climbs into the truck and smiles at me, I know I’ve won the husband lottery.</p><p>BONUS STORY!</p><p>Joey &amp; Law</p><p>Joey</p><p>Click, click, click, click.</p><p>“Stop that or you’re going to flood the engine.” I stare over at the Sheriff through his windshield as he tries to start his cruiser. I swear, everywhere I go in this town, there he is. Today it was the diner. I ate lunch there before I needed to get back to the shop, and there he popped up. Like always, he just stared at me, and it confused the ever-loving shit out of me. He’s never spoken to me before, even with all the staring, but then again, I give him a wide berth when I see him. He makes me feel things, things I’ve never felt before, and it would just be better for everyone if those feelings stayed buried.</p><p>“Just can’t seem to get the damn thing to start.” His deep voice rolls over my skin, making goose bumps break out, even though it’s a good ninety degrees right now.</p><p>“Hmm. Pop the hood.” I stumble over my words, and he shoots me a smirk. Prick. Probably used to women falling all over him. Not that I can blame them. I’d probably fall all over him, too, if I thought I was his type. Which I’m definitely not.</p><p>He’s clean-cut in a hard, pretty-boy kind of way. Blond hair, blue eyes, and a thousand-watt smile that comes out easy. He couldn’t be more of a good ol’ boy if he tried. Unfolding himself from his cruiser, he reaches down and pops the hood. I don’t wait for an invitation as I step off the sidewalk and lift the hood.</p><p>It’s an easy fix if it’s what I think it is. Retrieving my wrench out of my back pocket, I grab the battery cable, giving it a wiggle. It’s loose, just like I thought, so I screw it back on to the battery terminal tightly.</p><p>“Give that a try.” I straighten and turn around, knocking straight into a wall of chest. The badge clipped to his chest shines bright in my face. “Whoa there, Sheriff. I don’t need you up my ass.”</p><p>I snap the words, trying to take a step back as his masculine smell invades my senses. God, he smells good. I didn’t know a man could smell that good. Probably because he doesn’t work in an auto shop full of sweaty men all day. Jesus, his smell has me feeling those goose bumps again.</p> <p>“I don’t bite, Josephine.”</p><p>The use of my name has me glaring at him. No one calls me ‘Josephine.’ Only my mother ever did, and that name died when she did. It’s too intimate for him to be using that name, and I hate how I felt when he said it. It made me feel all feminine and shit. Nope. Not touching that.</p><p>“Name’s Joey,” I correct him, trying to put a firmness behind my tone. I want him to know I’m not fucking around. But he just shoots me that stupid perfect smile, making my heart flutter. I should take a step back, but I don’t want to seem like I’m intimidated by him. That, and I’m still rather enjoying the smell of him. I grew up with three older brothers who are all in the Air Force now. Surely I can handle one sexy, muscle-bound sheriff. I think. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I like ‘Josephine’ better. Fits you.” His hand goes to my shoulder, picking up the end of my ponytail as he twirls the black strands around his finger.</p><p>What.</p><p>The.</p><p>Fuck.</p><p>I don’t think I’ve ever twirled my hair, and the fact that I like him touching me bothers me. I bat his hand away, pretending to be annoyed. “How do you even know that name? Everyone calls me ‘Joey.’” I give my best stink-eye, which seems to have no effect on him, either. Normally, men scurry off when I give it, but I don’t think Sheriff Law has scurried from anything in his entire life.</p><p>“I know a lot of things about you.” His tone makes it sound like we’ve been intimate, like he knows every part of my body. It’s completely untrue, unless he can see through my clothes with all that staring he’s been doing.</p><p>“You stalking me?” I push my shoulders back, trying to make myself bigger, but my stature is dwarfed by his broad frame. I take a step into him, thinking he’ll retreat at my aggression, but he doesn’t. In fact he leans in a little more, making me feel the heat of his body.</p><p>“If stalking you is thinking about you every night while I stroke my cock and cumming with the sweet name ‘Josephine’ on my lips, then yeah, I’ve been stalking. I’ve been stalking the fuck out of you since I moved back here.”</p><p>All the blood rushes to my face, and I can feel it turning bright red. I’ve been around men my whole life who say the nastiest shit, and never once have I blushed. I’m used to it, and sometimes I even add a few jokes of my own. Being around my older brothers and working in an auto shop, there probably isn’t a thing I haven’t heard. What I’ve never heard is that filthy talk directed at me.</p><p>No, not me. Joey the tomboy who fits in better with the boys. Joey the chick who doesn’t know shit about being a chick.</p><p>“I can’t believe you said that.” The words leave my mouth breathily. I should shove my knee right in his balls, but I find myself wanting to touch him there, just not with my knee.</p><p>“That’s nothing compared to the things I’ve thought about doing to you, my sweet Josephine.”</p><p>“I’m not sweet,” I bite out. “Or yours, for the matter.”</p><p>He leans down, like he’s inhaling my scent. “Oh yeah, you’re sweet all right. You smell like sticky cotton candy on a warm summer day. Probably taste like it, too.”</p><p>“That’s grease you smell, jackass.” I want the words to come out mean, but they sound more like a tease. What is he doing to me?</p><p>“Go out with me,” he says, ignoring my statement. I’m just not buying it. Why now? We’ve both been in this town together for over a year, and this is the first time we’ve ever so much as talked. “Why are you asking me out now? Run out of local pussy and now you’re digging the bottom of the barrel? Thanks, but no thanks.”</p><p>I turn to leave, making the retreat that I didn’t want to make. I wanted him to back down, to get out of my space, but that clearly wasn’t happening. I’m in way over my head, and a little pissed, too. It burns that I’ve wanted him since he showed up in this town, but never once has he made a move. Now out of nowhere he’s all up my ass wanting to go out. Something stinks, and I don’t want any part of it, no matter what my body is begging to do. It’s not like I want him to actually do all those things he said he wanted to do to me. Nope, I lie to myself.</p><p>He grabs me by the waist, pulling me back to him, and my body embarrassingly melts into his. I can’t help loving the feeling of having him pressed up against me. My body is enjoying the physical contact so much, it almost makes me want to cry. The loneliness I’ve felt comes rushing forward, crashing against my chest, and reminding me how long it’s been since someone held me.</p><p>“The only pussy I’ve thought about is yours.” He flips the word ‘pussy’ off his tongue like he’s pissed he has to use the word. Which is crazy because not minutes ago he said cruder stuff to me. “In fact, I thought about it so fucking much I can’t seem to get my goddamn job done. I’m finished waiting, so I might as well take it now. Maybe after I get you under me, I can have some sanity and actually finish doing what I came here to do.”</p><p>“No.” The word has absolutely no power behind it. Something’s wrong with me. I’m broken. I’m letting him manhandle me, and I’m not even fighting it. Fuck. I don’t want to fight it. Why should I? I’m a twenty-two-year-old virgin whose body is screaming for some physical attention. Maybe it’s time to pull off the virgin Band-Aid. Maybe he’s looking for a good time, a roll in the sack, and needs to get me out of his system. Why I’m in his system to begin with, I have no idea, but maybe this could work. I see how other women in the town look at him. They flirt with him all the time, but I’ve always just seen him be professional. Until now. I like the idea that maybe I’ve made him crack, even if it isn’t true.</p><p>“I’ll cuff you and take you to the station until you agree.” He leans in to whisper into my ear. “Or just wait for everyone to leave the station and eat your pussy until you agree.” He takes my earlobe into his mouth, sucking it, then giving it a little bite. A moan escapes my lips, loving the sensation.</p><p>“Fuck. Don’t make that sound when we’re in public.” He lets go of me, and then I remember we’re standing in the middle of town, beside the diner. I look around, but no one seems to be looking our way or paying attention. Not much is going on. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Okay.”</p><p>“Okay?” He echoes the word, raising his eyebrows like he doesn’t believe me.</p><p>“Yeah, okay. I’ll go out with you.” His body loses some of the tension I didn’t notice was there before.</p><p>“Give me your number.” He pulls out his phone, and on the screen I see a picture of me standing in the auto shop. It looks like I’m laughing in it. I grab the phone from his hand, wondering how he got the photo.</p> <p>“What the fuck is this?” I look at the picture, but he snatches the phone away from me.</p><p>“I’ll get a better one tonight.” He ignores me, like it’s not weird that I’m his screensaver. I pretend like I’m appalled, but really, I want to jump up and down like a dork in high school who just found out the quarterback has the hots for me.</p><p>“Number?”</p><p>I just stare at him. “You think I really believe you don’t already have my number?” No way he doesn’t. Not after the picture thing and him knowing my real name.</p><p>He smiles, slipping his phone back in his pocket. “I’ll pick you up at seven.” He takes a step toward me, putting his finger under my chin, making me look up into his eyes. “And Josephine,” he says, looking into my eyes. “No more flirting with Butch. I don’t want to have to kill him.”</p> <p>With that, he turns, pushing the hood of his car down before getting in. It starts right up, the engine turning over as he pulls out and leaves me gaping. I don’t flirt with Butch.</p><p>Butch is one of my brother’s best friends. He’s the reason I even came to this town. He got me my job working at the auto shop. Otherwise I wouldn’t be here. Growing up with all boys, I could pretty much do anything they could, except pee standing up.</p><p>Fuck, do I love the thought of him getting jealous over Butch. He’s just like another brother to me, and besides, I’m not even Butch’s type. He likes them blonde, tall, with giant boobs, and as easy as they come.</p><p>My phone beeps, and I see I have a text from an unknown number. Sliding my finger across the screen, I read the message.</p><p>Stop missing me. I’ll see you in a couple of hours.</p><p>I roll my eyes, but then I find myself smiling as I walk back to the garage. “Asshole.”</p> <p>Law</p><p>I pump faster, speeding up my rhythm. My cock is aching for release, so this won’t take long.</p><p>Picturing Josephine standing in front of me, bent over, spreading her ass cheeks apart, I jerk off faster. I imagine her looking over her shoulder, giving me that sassy smirk, begging me to fill her up. I think about her smart mouth telling me how bad she wants me, and I start to cum.</p><p>Standing over the toilet, I watch as my cum drips down into the water. I hate to waste it, but no way can I sit through dinner and being so close to her without some kind of release. I won’t be able to control myself, so hopefully, this will take the edge off.</p><p>Jesus, it’s like I’m fifteen. I can’t last for more than sixty seconds when I’m thinking about my Josephine. I can’t wait until she’s under me, and I can get actual relief. Anytime I get hard, I can slide it into her body and empty my seed. After tonight’s hurdle, I’ll have her bred before the end of the week.</p><p>I smile to myself as I clean up and head out, not wanting to be late. I’ve driven to her townhouse a thousand times. I know she lives with Butch, but from what I can tell they are just friends. I still don’t like it, but for the moment there’s not much I can do. I’ll take care of that soon, but first I’ve got to get her in my bed. Then I’ll fix everything.</p><p>I pull up and take a breath, thinking that this probably isn’t the best timing with the case still going on. But I’ve waited almost a year to claim Josephine, and I can’t wait anymore. I’ve watched her like a hawk from the second I first saw her, unable to let her get too far from me. I’m not proud of some of the things I’ve done, but when it comes to ‘the one,’ the rules don’t apply. At least that’s what I keep telling myself.</p><p>Getting out of my cruiser, I walk by her car and think about the night I put the tracer on it. It’s hidden under the wheel rim and completely undetectable. Even if she took her car apart, she wouldn’t find it unless she was looking for it. Walking to the porch, I ring the doorbell, looking up to see the pinhead camera I installed around the same time. No one would know it was there unless you pointed it out. And even then it’s hard to tell. I wanted to know who was coming and going from her house at all times. Making sure she got home safe every night, too.</p> <p>Oh yes, I’ve done a lot of things to keep eyes on my Josephine. Almost a year later and I’ve had enough playing around. I don’t care if this fucks up my case, I’m a man, and I’m only so strong.</p><p>The door opens, and Butch is standing there with his shirt off. I clench my hands into fists, ready to rip his head off.</p><p>“Evening, Sheriff. What can we do for you?” He looks genuinely surprised to see me, and I shouldn’t be shocked Josephine didn’t tell him I was coming over.</p><p>Butch stands there waiting on a response, but my jaw is clenched too tight to speak. I’m seconds away from tackling him to the ground when Josephine walks around the corner.</p><p>I nearly stop breathing as she walks towards us, my heart beating out of my chest.</p><p>“Damn, Joey. Who died?”</p><p>“Eat a bag of dicks, Butch.” She walks past him, pulling the door closed behind her, and stands on the porch. She looks at me expectantly, but I still can’t speak. I blink a few times and try to focus. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, my earlier plan was a waste,” I mumble, thinking that jerking off twenty minutes ago was completely worthless. My dick is at full attention and trying to bust out of my slacks.</p><p>“What was that?”</p><p>“I said, you look utterly gorgeous, Josephine.” Her cheeks blush at my compliment as my eyes roam over her body. She’s wearing a fifties-style pinup outfit with a high-waisted pencil skirt that’s tight to her body. A white, button-up, short-sleeve blouse and shiny red peep-toe heels finish off her look. Her ink-black hair is pinned to one side, and her lips are lacquered in the same shade as her shoes. She looks like she should be laid across the front of a plane, motivating soldiers in World War II. Her dark eyes look up at me through her thick lashes, and I’m literally breathless at how beautiful she is.</p><p>“Are you ready?” she whispers, and I have no idea what she’s talking about.</p> <p>Leaning in, I find my words, pulling her against my hard body, “I think I should be asking you that question, love. Because with the way you’re dressed and the way you’re looking at me, you’re going to have to try to keep me off you.”</p><p>I expect her to pull away, upset by my crude words, but instead, she leans in closer. “What if I don’t want to keep you off me?”</p><p>She licks those shiny red lips, and I’ve had all I can stand. Reaching down, I snatch her wrist and pull her behind me to my cruiser. I’m nearly dragging her, but my need is too strong, and I can’t wait.</p><p>Taking her to the passenger side, I open the door and silently help her into the car. When I go around to the driver’s side, I get in and crank up the car, driving away from her townhouse.</p><p>“Where are we going?” she whispers, and I can hear the slight need in her voice.</p> <p>“My place. I’ve waited long enough.”</p><p>I hear her laugh, and I look over to see her lean back in the passenger seat. Her legs are together, but the slit on the skirt goes all the way up her thigh, making me grip the wheel harder.</p><p>“This is our first date, and you’re saying you’ve waited long enough?”</p><p>I look back to the road and hit the gas. I can’t get home soon enough. “You know damn well this has been coming.”</p><p>Suddenly, I feel her warm hand on my thigh, and I reach down and put my hand on top of hers. I look over and see her lick her full red lips. She’s got the prettiest mouth I’ve ever seen, with lips like something out of a magazine. I can’t wait to ruin her lipstick. I can see the shyness in her eyes, and I know reaching out to me was a bold move for her. She’s usually so tough, but tonight she’s giving in and letting her guard down. I want to show her how good it can be between us, so I push her a little further.</p><p>Gripping her hand slightly, I pull it over so her palm is resting on my hard cock. The heat from her palm nearly burns me through my slacks as she rubs her fingers along the ridge of my dick. I press her hand harder against me, and she grips me firmly. It’s all I can do to keep the car on the road as I turn down the long driveway to my house.</p> <p>I bought this cabin when I moved back, opting not to stay on the family estate. My dad had a few choice words about it, but fuck him. This place is beautiful. It’s a big cabin that sits just outside of town on a small lake. I bought this house the week after I first laid eyes on Josephine.</p><p>“Holy shit, this is your place?” She loosens her grip on my cock but doesn’t take her hand away. “That garage is sick.” There’s a little wonder in her voice as she sees the four-bay garage off to the right of the cabin.</p><p>“Yeah, apparently this used to be a hunting lodge, and they had the garage for guests. I had the inside of the place renovated, but kept the garage as is.”</p><p>She looks over at me and raises an eyebrow. “I thought you didn’t know anything about cars.”</p><p>“I don’t. But lucky for me, my woman does.” I had the garage redone for her. Once I got her here, I didn’t want her to have any reason to have to leave. Show her right up front I wasn’t fucking around. She was meant to be mine from the moment I laid eyes on her. I knew it down to my soul. I just had to get things ready so I could have her, but things weren’t moving as fast as I would have liked so I was jumping in to speed up the process.</p><p>Her mouth falls open a little as I reluctantly move her hand off my cock and get out of the car, going around to her side. I open the door and hold out my hand, helping her step out of the car.</p><p>I reach down, scooping her up, and carry her like a bride to the front of the house.</p><p>“Law, what the fuck are you doing? Put me down.” She tries to wriggle a little, but I grip her tighter.</p> <p>“Not a chance, love. It’s tradition.”</p><p>“You’re kidding me, right?” There’s a slight squeak to her voice that I can only assume is fear. It’s okay. That will pass the more we’re together.</p><p>“Josephine, I’m almost thirty years old. I’ve never once been in love or anything close to it. It’s been over a decade since I’ve so much as shaken a woman’s hand. So no, I’m not kidding.”</p><p>I look into her eyes as I open the front door and carry her over the threshold. I can see wonder there, and I can also see hope. I don’t know what kind of life she comes from, but from what I’ve seen over the past year of watching her, she’s built up a fortress to keep people out.</p><p>Kicking the door closed behind us, I carry her through the great room and walk down the hall. I take her straight to the master bedroom and stand her up at the end of it, holding her hips to steady her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Law, this is crazy. Tonight is just...it’s insane.” Her dark eyes search mine for guidance. She’s desperate for someone to take the reins, and lucky for us, I’m okay with that.</p><p>Cupping her neck with both hands, I rub my thumb across the bottom of her jaw. “Aren’t you tired, Josephine?” She looks at me questioningly. I lean in, just a hair’s breadth away from her lips. “Aren’t you tired of holding up all those walls? Let go, love. I’ll be here when they fall.”</p><p>I press my lips to hers, and she opens for me, letting me in. Her arms go around my waist, pulling me to her as my tongue sweeps in.</p><p>Her taste is so sweet, I have bite her bottom lip. I want to devour her body, starting with her lips.</p><p>“Law,” she whispers, her words like a balm to my aching body. I feel her let out a breath, and I pull back to look into her eyes. “I’m not...experienced.” She looks away and then looks back at me, clenching her jaw. “I’ve never done this before. I don’t know if that matters to you or not.”</p><p>I pull her to me with one arm, letting every curve of her body melt against mine. With the other hand, I reach up and start to undo the buttons of her blouse.</p><p>“It doesn’t matter to me who you’ve been with and what you have or haven’t done before me. All I care about is that I’m your last.” Once her blouse is open, I trace my fingers along the edge of her black lace bra and up the middle of her cleavage. “All I care about is that nothing comes between us tonight. Just you and me. Skin...” I lean down, kissing between her breasts. “...On skin.” I say the words against her lush tits, needing to suck on her more.</p><p>I let go of her waist, unzipping her skirt and taking off her clothes. She’s standing before me in her black lace bra, panties, and her blood-red high heels. She’s covered in ink, and she looks like a fucking rock star goddess. I burn the image into my brain, wanting to remember this when we are a hundred, and I remind her about the first time she gave me her body.</p><p>Reaching around her back, I unclasp her bra and let it drop to the floor. Her tits bounce free, making me lick my lips. Dipping my fingers into the waistband of her panties, I pull them down her thighs, down to her ankles. She goes to take off her shoes, but I touch her leg, stopping her movements.</p><p>“Leave those on, love. They’re beautiful and delicate, just like you.”</p><p>Kneeling down in front of her, I look up to see a deep blush spread across her cheeks. I help her step out of her panties and then stand back up to relish the sight of her completely naked. I grab my chest and try to breathe.</p><p>“Jesus Christ. My will is on my desk in my office if I don’t make it through tonight.”</p><p>Josephine laughs, and I snap out of my daze, removing my dress shirt and slacks as well. When I’m in front of her in my boxer briefs, she walks to me, putting her fingers in the waistband, pulling them down my hips. She kneels down in front of me as I did her as I step out of them. She stays on her knees in front of me, eyeing my cock. A drop of cum beads at the end of my dick, and she licks her luscious red lips.</p><p>I reach down and grab her arms, pulling her up from the floor and taking her over to the bed. “Not yet, love. Tonight is all about you.”</p><p>Laying her down in the middle of the bed, I crawl between her legs, spreading them wide. She’s a little tense, and I’m sure it’s because she’s shy. “Relax, Josephine. I’m going to make friends with your pussy for a little while. After that, we should all be better acquainted.”</p><p>I see the smile spread across her lips as I kiss the inside of her knee and work my way up her thigh. I lick and nibble between her legs, feeling her soft flesh against my tongue. When I get to her cunt, I nuzzle the short, soft curls and smell her sweetness. Goddamn, she smells so sweet. Sucking her fat lips into my mouth one at a time, I close my eyes and moan at her flavor.</p><p>I can’t decide if her cunt tastes better than her kisses, so I lick her clit to see. I feel her legs fall open farther, and her hands come to grip my hair as I eat her sugary sweet pussy.</p><p>Her warm juices run down my chin as I take up residence between her legs. I start humping the bed with every lick, envisioning my cock instead of my tongue in her pussy.</p><p>“Law, more. Please, I’m so close.”</p><p>Hearing her voice as she grips my hair tighter is enough to send me over the edge. I growl against her pussy as I cum on myself and the sheets, making a mess. I can’t control myself when it comes to her, and I want to make sure this first time is good for her.</p><p>Gripping her thighs harder, I suck on her clit, making it my job to pleasure her. I flick the hard bud with my tongue over and over, feeling her tense up. I don’t stop. I keep the same rhythm as she arches her back off the bed and screams my name.</p><p>I feel a splash on my chin and realize she just came so hard she squirted on me. I moan against her cunt, wanting to bathe in her orgasm. I feel like a goddamn superhero. I feel like her cum on my face is my trophy, and I want to scream to the world what she gave me.</p><p>Kissing up her body, I wipe my cum off my stomach and bring it up to her pussy, rubbing it against it. I want all of me on her. After it’s all smeared across her clit, I move between her legs, my dick at her opening. My cock is an angry purple color, like I didn’t just cum two minutes ago.</p> <p>Leaning down over her body, I hold her face and kiss her lips. She has a sleepy smile on her face, and she looks like a woman that just had a hell of an orgasm.</p><p>“That feel good, love?” She mumbles a yes against my lips, pulling me to her. “This part may sting a little, but I’ll take care of you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Josephine nods against me, and I kiss her jaw and move down her neck. I pinch her hard nipple with my two fingers as I move to her other one, sucking on it and giving it little bites.</p><p>When she’s raising her hips for me to enter her, I thrust in in one long plunge. She tenses under me and lets out a small grunt as I rip through her virginity. Her sheath is tight and grips me so hard that it’s all I can do to keep licking her tits and not cum.</p><p>I focus all my attention on her breasts, trying to pull her back from the edge of pain and bring her fully into pleasure. I lick and pinch, nibble and suck, until she’s gripping my hair and moaning.</p><p>I keep going for a little longer until she wriggles her hips and begs me for more. “Please, Law. I’m okay. Don’t stop.” She’s breathless with need, and I can’t deny her.</p><p>Moving my lips up her throat, I thrust hard into her willing cunt. “Nothing between us, love. Skin to skin with no barrier.” She moans at my words, growing wetter as I fuck deep, her cunt squeezing me so sweet when I bite her neck.</p><p>“Law, I’m not on the pill.”</p><p>“I didn’t think you were, love.”</p><p>Her head is thrown back, her eyes closed, and she’s lost in pleasure. “Oh God, I’m so close. Maybe you should pull out.”</p><p>I laugh against her throat. “No, baby, I don’t pull out of you. Ever.”</p><p>She clenches down on my dick hard, and I feel her juices all over me. I tilt my hips up a little, hitting her clit with every stroke. It has her scratching my back and moaning my name after only a few pumps.</p><p>“That’s it, Josephine. Cum all over my raw cock. Open that soft cunt up for me so I can go off inside you. I’m not pulling out, so if you cum on me, I’ll nut in you.”</p><p>My words are enough to send her over the edge, and she shouts her orgasm into the room. Our room. I feel her cunt wet my dick, and it’s all the invitation I need. I thrust against her one last time and hold it deep as I cum in her virgin pussy.</p><p>When I feel the last drop of my cum splash inside her, I roll us over, not breaking our connection. She lies on top of me, breathing hard, and I smile.</p><p>She’s mine now.</p><p>Joey</p><p>“Jesus H. Christ, Joey. You’ve got that stupid grin on your face again.”</p><p>I bite the inside of my cheek to try to stop the smile as I look out from under the hood of the old Lincoln I’m working on. I meet Butch’s eyes and fail miserably, busting out laughing at the look he’s giving me.</p><p>“I can’t believe a fucking copper put that look on your face.” He leans under the hood, using both hands to brace himself like we’re about to have some big conversation about this. And we’re not. This is my business, and for the first time in my life, I don’t have three giant older brothers in it.</p><p>“I don’t give you shit about whose legs you’re between, so why you giving me shit about who’s between mine?” I pull the rag from my back pocket and wipe the grease off my hands. Glancing up at the clock, I see I have about enough time to get home and shower before Law is at my door.</p><p>Like clockwork every day for the past two weeks, he’s at my door, picking me up at six thirty sharp. Each time he makes me pack a giant bag and asks me why I just don’t go straight to his house when I leave work. I’m slowly noticing that each day, more and more stuff is disappearing from my house and turning up at his.</p><p>It should piss me off, but it doesn’t. In fact, it just puts the stupid smile back on my face.</p><p>“Just making sure you’re good. You haven’t slept at home one time since the copper took you on that date. Don’t want you getting too deep into something and getting hurt.”</p><p>“Not all men are like you, Butch. Some of them actually don’t fuck ’em and leave ’em.”</p> <p>“I’m not trying to be an ass, I just want you to be careful is all.” He runs his hand through his shaggy brown hair like he’s mulling something over. “To be honest with you, you guys just don’t look like you fit together.”</p><p>“What the fuck does that mean?” I throw the towel down on the workbench, then motion for him to move so I can drop the hood down on the Lincoln.</p><p>“He just looks like the type to be with some snotty trophy wife. His father’s the Mayor, for fuck’s sake. You see that guy’s wife?” His words burn like acid in my stomach. Fuck this shit. I’m not even hearing it. I know what’s been happening between Law and me for the past two weeks, and it’s been perfect. The way he touches me and treats me, it’s like I’m the rarest thing on earth. Like he can’t live without me.</p><p>“Fuck you, Butch. Just because I’m not some rich socialite doesn’t mean I can’t attract a man.”</p><p>“Hold up. That’s not what I meant at all. That went both ways. He doesn’t seem like your type either. I thought you’d end up on the back of someone’s bike or something. Not with the quarterback of the football team.”</p><p>He’s got me there. I can see why he’d think that, but like most things in my life I don’t fit the mold of what people think. Why would who I end up with be any different.</p><p>“Thanks for your concern, but it’s not needed.” I unzip my coveralls, letting them hit the floor as I step out of them. Picking them up, I throw them into the bin with all the dirty, grease-covered clothes.</p><p>“Just be careful is all I’m saying.” Butch does the same, peeling off his work coveralls before throwing them into the bin. I feel my phone vibrate against my ass, warming my stomach because I know who it is. Sliding my finger over the phone, I read the message. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Law: Can’t make it tonight, sweets. Work came up. Call you when I can. Xoxox</p><p>“What’s that face?” Butch asks pulling my eyes from the text. The disappointment must be showing on my face. Maybe a night alone isn’t so bad. I could go to that cute lingerie place in town and get a few things. I own, like, two cute pairs of underwear, and I’ve already worn them both twice. I want something different and fun.</p><p>“Law just canceled on me.” I try to make my voice flat, like it’s no big deal, but Butch puts his arm around me.</p><p>“Come have a few beers with Paine and me.”</p> <p>It’s better than sitting at home. “Sure. I just need to run home and change before I make a quick stop. Meet you guys there?”</p><p>“Sounds good. You can help me poke bossman about the blonde piece of ass he was drooling all over today.”</p><p>I snort, remembering how Paine looked when the woman walked into the shop. I thought he might trip over his own feet to get to her. It was worse when she seemed to give him the slip. Now he’s been back in his office pouting about it for the last twenty minutes. I didn’t even know Paine could pout.</p><p>“See you guys there.” I head to my locker, grab my shit, and head home. I rush through a shower, and it only takes me thirty minutes to be back in town. I threw on some jeans and a simple black tee with my boots. It’s not like I’m trying to impress tonight. I have a man. The simple thought makes me blush and giddy with excitement. I have a man. I say it over and over again in my head, loving it more every time.</p><p>Deciding to drop my car in the bar parking lot, I walk towards Main Street in the direction of the lingerie shop. It’s a small town, and if you park anywhere by the main road, you can pretty much walk anywhere. Walking by the different shops and stores, I stop suddenly when a familiar face catches my attention. The sudden glance makes my stomach drop.</p> <p>There, in the little Italian restaurant, I see the Mayor and his wife, with Law, and a leggy blonde who I’ve never seen before. They’re all sitting at a table together, and Law is holding the blonde’s hand. Like he feels my eyes on him, he turns to look at me, but I sidestep the glass window and lean against the brick building, trying to get my pounding heart under control.</p><p>Fucking work shit, my ass. Jesus, could Butch have been more right? Suddenly, I feel like his dirty little secret. Law never takes me out to dinner, nor does he even talk about his family. If it wasn’t for the fact that it’s common knowledge that he’s the Mayor’s son, I would’ve never known.</p><p>It burns. Holy shit, does it fucking burn. I push the tears back and shake off the hurt, going with anger instead. I was about to go get lingerie for his ass and set up something sexy. I was going to call him out on taking shit from my house and putting it in his. Tell him he didn’t have to play games, that I wanted to be there.</p><p>Stupid. Stupid. Stupid.</p><p>I should’ve known better. I see how my brothers burn through beautiful women. Hell, I live with Butch, and I see how he burns through them. I’m a tomboy and a plain Jane at best. How did I expect to keep someone like Law?</p><p>My phone buzzes in my back pocket, and I see I have two texts. One from Butch and one from Law. Is he texting me while he’s on a date? A date he took to meet his father? I grit my teeth and click on Butch’s text.</p> <p>Butch: See your car in the bar parking lot. Where you at?</p><p>Me: Be there in five.</p><p>I cross the street, not wanting to walk right in front of the restaurant again, then head towards the bar. I can’t stop myself from clicking to see what Law said.</p><p>Law: Miss you, sweets.</p><p>I clutch the phone to keep myself from throwing it. Sweets. I loved that name. How he always said I smell so sweet, taste so sweet, am so sweet. No one had ever called me sweet before him, and I was eating it up. It was like he saw the real me. Yeah, I like to fix cars and watch football and dress down a lot, but I’m a woman, and when he called me sweet, it made me feel like one. Stupid, I snap at myself again. He played you. Got what we wanted. Sex. Some piece of ass on the side to fuck when he wanted, and no one had to know about it.</p><p>“You look fit to be tied.” I look up to see Butch and Paine waiting for me outside the bar.</p><p>“Don’t want to fucking talk about it.” My voice is firm but holds a little more emotion in it than I like, but they both just nod, getting it. That’s the great thing about having male friends. They don’t make you talk things to death. You say, “Conversation over,” and it wraps up pretty quickly.</p><p>Butch and I follow Paine in, and I can tell Paine is in just as much of a pissy mood as I am. The only one who looks like someone hasn’t kicked their puppy is Butch, but he’s always got a stupid easy smile on his face.</p> <p>Without asking, Jake the bartender slides us our drinks, and I quickly grab my beer, thinking I’m going to need something stronger tonight.</p><p>“There’s a bachelorette party happening here tonight if you guys are looking for some action,” Jake says, making me roll my eyes as I take my seat next to Paine.</p><p>“Point me in the right direction, Jake. You know I’m always looking for some fresh trim in this town.” Butch straightens and gives the crowd a once-over as Jake points towards the dance floor.</p><p>Not being able to help myself, I follow Jake’s finger to see who Butch’s prey for the night will be.</p><p>Suddenly, Butch is laughing and looking back, and I see why when I catch the blonde hair of the woman who ran out of the shop today with Paine hot on her ass. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Looks like that rich chick with the Porsche is the bride-to-be,” Butch says in a teasing tone, and I see Paine grip his beer bottle so tightly I’m shocked it doesn’t shatter in his hand.</p><p>I reach out and grab his bottle as his eyes meet mine. “I’ll hold it for you, boss,” I tell Paine because I know where he’s heading. Straight for the dance floor to get the girl Butch is following. I down my beer and order another, enjoying sitting at the bar by myself. I don’t feel like being social.</p><p>My phone buzzes across the bar top, and I check the message. I should turn it off because I know it can only be one person, but like a masochist, I click the message.</p><p>Law: Sweets, text me back. You got me worried.</p> <p>He’s fucking worried? Is he worried while he’s got his dick in some other chick’s cunt? The thought knocks the air out of my lungs. I motion for another drink, and Jake drops it down in front of me moments later.</p><p>Paine sits down next to me, and I don’t comment on where the little blonde went. Hell, I even see Butch behind me in the mirror over the bar, hitting on some chick. Are all men alike? I can’t believe I let myself think I found something different.</p><p>My phone buzzes again.</p><p>Law: Damn it, Joey, answer me or I’m going to spank your pussy when I get my hands on you.</p><p>How can he fucking talk to me like that when he’s out with another woman!</p> <p>Me: Why don’t you spank the pussy of the blonde you were having dinner with. You know, the one you introduced to your family.</p><p>With that, I power off my phone. I don’t want to read his excuses, or worse, see that he doesn’t respond at all. He probably knows he got busted, so I’m sure he’s done with me.</p><p>“Penelope,” Paine mumbles next to me for the tenth time since he sat down, taking another pull from his beer.</p><p>“If you say that word one more time, I’m going to knock you off that fucking stool,” I tell him. Can’t we both wallow in our misery in silence? I’m just thankful the bar finally turned the music down since the bachelorette party left.</p><p>“I fucked up,” Paine says, looking over at me while I fiddle with the paper on my beer bottle. I pull it off and stick it back on, annoyed at everything.</p><p>“Yeah, you did. You went after something you can’t have and you shouldn’t want,” I tell him as I meet his eyes. We both went after people who were out of our league and in a class we’d never understand. Law may just be a sheriff, but he comes from old money. Hell, his dad is the goddamn Mayor.</p> <p>“Evening, Sheriff. What can I do for you tonight?” the bartender says. My eyes snap to the mirror behind the bar, and I seeing Law standing five feet back from Paine and me. My whole body locks up, and I grab my beer, wanting something to hold on to. Play it cool, I repeat over and over again in my head. I’ve given him enough of myself. I won’t give him anymore. He’s already seen parts of me no one else ever has. The girl who lies beneath my layers. One who is going back into hiding to lick her wounds.</p><p>“Just checking on things,” Law responds, and I can feel his eyes on me. I try to pretend he’s not there until he speaks right to me. “How you doing, Josephine?”</p><p>My heart clenches at the use of my name. It bugged me at first when he called me that, like he knew me, but over the past few weeks, I’ve grown to love it. Crave him saying it. When we’d make love and he’d call it out, it was like the sweetest thing I’ve never known. I still refuse to meet his eyes in the mirror and just go on ignoring him. I can’t believe he’s doing this in the middle of the bar for everyone to see. Before today I wouldn’t have thought it a big deal, but after seeing him out with the other woman, the pieces click into place. He didn’t want people to know we were together. How didn’t I see it before? I was too content to spend our time together just holed up in his home, in his bed.</p><p>Instead of answering him, I just give him the middle finger. Because that’s what he can do. Fuck off</p><p>“Josephine, sweets, don’t—”</p><p>“Sweets—” Paine tries to say interject, but I cut them both off.</p><p>“What the fuck are you doing here, Anderson? Pretty sure stalking is against the law.”</p><p>The bar has become eerily quiet now, and I know everyone is watching what’s happening.</p> <p>“Jake, my sister around? I thought they came in here tonight,” Law says, pissing me off even more. He has a fucking sister? Law knows everything about me, and I didn’t even know he had a goddamn sister. Oh, I know why, there’s no point in introducing Joey because you’ll never meet her. You’re just the Sheriff’s dirty secret he fucks out in his cabin.</p><p>“She with that bachelorette party?”</p><p>“That would have been them. She’s the bachelorette.”</p><p>I almost want to laugh at the irony of Law’s words. Paine and I have been sitting at the bar, moping about a brother and sister who are way out of our range. But I have a feeling that won’t stop Paine. As for me, my ego can’t handle another round. I might shatter.</p><p>“They left here about two hours ago,” Jake says, pouring a glass of cheap whiskey.</p><p>“All right, I was just checking in before I head home for the night.”</p><p>I can’t help but snort at his words, not believing him. “Probably going to be fucking his date tonight since he won’t be fucking me,” I mumble to myself.</p><p>“Josephine, can I have a word with you outside?” I want to scream at him. Of course, so no one sees the sheriff is slumming it, but I can’t ignore him. He’s still the sheriff. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Who’s asking?” I motion for Jake to pour me another shot. “The Sheriff or Law?”</p><p>“I’m asking, sweets.”</p><p>“Then the answer is no. Besides, you don’t like being seen with me in public.” I shrug my shoulders, trying to pretend I don’t give a shit and failing. I can feel the tension in my whole body; I’m practically vibrating.</p><p>“That’s not fucking true and you know it,” Law snarls, and I can feel him getting closer to me, something I don’t want. He can’t touch me. I won’t be able to hold back the tears if he does, and I won’t give him my tears. I slam back my shot, jumping off the barstool, and I wobble a little. Both Law and Paine jump to steady me.</p> <p>“Don’t fucking touch her,” Law growls at Paine, pulling me towards his body in a possessive hold. I feel the dam inside me start to shake, and it takes everything in me to get my words out without it cracking.</p><p>“You made your choice. Now live with it.” I try to push past him, but he grabs me by the arm and I turn, shooting all my anger at him. I’ve got to hold on to that anger until I get out of this bar.</p><p>“You’re too drunk to drive.”</p><p>I don’t even respond to his words. I just call out Butch’s name. “Butch has me,” I say, hoping that fucking digs into his gut. Law may not want everyone to know we’re together, but I know he doesn’t want to share me. Double standard much?</p><p>Law clenches his jaw again, but what can he really say? Everyone in the bar is staring at us.</p> <p>“Pick up your phone,” he grits out at me, but I’m having no part of it.</p><p>“Fuck off.”</p><p>With that, I grab onto Butch’s arm, and he pulls me closer, probably because he sees the distress on my face.</p><p>“Get me home, please,” I whisper to him as the tears start to fall.</p><p>Law</p><p>“You’re in over your head.” Paine says the words, but I don’t look at him. I keep staring out the door Josephine just walked through, taking a part of me with her. When she hadn’t returned my text messages I got a little worried, but when she sent that last text, it felt like the bottom of my world dropped out from under me.</p> <p>I grit my teeth and clench my fists, trying to get my anger under control. I only have myself to be pissed at. I played this all wrong. The last year of my life has been miserable and fucking lonely, and the last two weeks were the best I’ve never known. I’m not letting it slip through my fingers so easily. One way or another, she’s going to listen to me. “As long as I’m somewhere with her, I’ll take it.” It’s the truth. I’ll take my girl any way I can get her. I may be in over my head with her, but that’s fine with me. I’ll drown in her, and it will be the sweetest death a man could ever ask for.</p><p>I walk out of the bar and make it in time to see her get into Butch’s car. I know they’re just friends, but fuck does it burn to see him taking care of her. She was hurting when I walked into the bar, and it isn’t Butch she should have been calling out for. No, it should’ve been me. But I fucked up. I want to be the man she runs to when she needs someone to lean on. I’d almost gotten all her trust, only to see it go up in smoke.</p><p>“Fuck!” I scream out to the empty parking lot before heading to my cruiser. I don’t give it a thought. I flip on the blue lights and the siren, chasing after them.</p><p>Butch pulls to the side of the road and I follow suit, turning off the siren but leaving the lights on. Butch goes to open his door, probably to argue with me, but I give him the same voice I used on thugs on the streets of Chicago when I worked patrol.</p><p>“Hands on the wheel and don’t so much as fucking move a finger.” It’s a dick move, using my power for my own ends, but I can’t bring myself to care. There isn’t anything I won’t do to have my sweet Josephine, even pissing a year-old case down the drain. I’ll find another way.</p><p>I go over to the passenger side, pulling the door open. Reaching in, I pop her seatbelt and pull her out of the car and sling her over my shoulder. She gives me a little bit of a fight, but she’s just so tiny it’s easy to get her under control.</p><p>Butch hops out of the car and I stop looking at him. I can tell from the indecisive look on his face that he’s debating what he wants to do. He may want to come at me, but I’m still the Sheriff.</p><p>“You made her cry. I’ve never seen her cry before, Law.”</p> <p>His words are like stones dropping into water. The first impact is brutal, the aftermath rips through my body, reaching to my soul. I did the very thing I was trying to prevent, and now I’m going to lay my cards on the table.</p><p>“I’m going to fix it,” I tell him, letting all my emotion out in my words. I won’t get any points with Josephine if I knock her best friend out on the side of the highway because she’s not going with him. Over my fucking dead body.</p><p>“I’m not fucking with you, Law. Fix it or Paine and I will be so far up your ass...”</p><p>“Butch! What the fuck? You’re just going to let this lying cheating bastard take me?” She starts kicking her feet again, and I slap her ass. I’m trying to get her under control before she tries to buck off my shoulder and I land her ass on the hard blacktop.</p><p>“Call me in the morning, Joey.” Butch gets back in his car and takes off, but Josephine still yells until she realizes he’s gone.</p><p>I go to the passenger side of the cruiser and place her on her feet, caging her in. She bucks against me, trying to free herself. She’s hitting at my chest while tears stream down her face. Each verbal blow she lands is a direct hit to my heart. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I fucking loved you! But I was just some dirty secret to you. Not good enough to take out in public. Not good enough to meet your parents.”</p><p>When the fight finally leaves her body, getting all of what she was holding in out, she sags against the car.</p><p>I drop to my knees in front of her, my hands engulfing her narrow hips, looking up as she looks down at me. The moon makes her big green eyes seem brighter than normal, and my heart aches twice as hard.</p><p>“You were right about my dirty secrets.” She starts to push my hands off her hips, but I just hold her tighter. “They are my secrets that I’ve been trying to hide from you. I didn’t want them touching you. I don’t want them anywhere near you.”</p><p>“I don’t believe you.” Her words say one thing, but her eyes fill with hope. Her hands come to rest on my shoulders, and I’m thankful she isn’t trying to push me back with them.</p><p>“I hate my father and can‘t stand to be in the same room as my stepmother.” I don’t let her know it’s because the woman has been trying to get in my fucking pants for years, something that makes me want to throw up, but I don’t want to make my girl jealous. Jealousy eats me up when it comes to her. Fuck, last week I got jealous of the goddamn straw in her drink, and I don’t want her to have those feelings. I want her to have no questions about what she is to me, or that I’d ever give another woman the time of day because I wouldn’t. Hell, women haven’t even been on my radar for years. I poured everything into my job. Until her. She turned my world upside down.</p><p>“That may be true, Law, but I saw you with another woman. You were holding her hand.”</p><p>“She’s with the FBI.” Her fingers tighten on my shoulders waiting for me to continue. “I’ve been building a case against my father, and she’s part of it. About a year ago he asked me to come back here to Springfield and run for Sheriff. At first I told him no, but he kept pressing. Then the FBI reached out to me, told me that things around my dad didn’t smell too good. I didn’t like that one bit. I just wanted to wash my hands of him, but I’d heard him talk about my sister. About roping her into coming back here, and I knew then he had plans to get her under his thumb. We may have never been close, but I couldn’t let him do that.”</p><p>“I went on the date tonight as a decoy. Go out to dinner, then back to my dad’s for drinks. I’d distract good old Dad and my stepmom while Debra, my fake date,” I emphasize ‘fake’ so she gets the point, “went to snoop around a little. But that all went out the window when you wouldn’t respond to my text messages.” I tell her even though I don’t care that the plan went to hell. I’ll find another way. Josephine is my number one priority. Not the cons my dad has been doing to move himself up in life.</p><p>“I blew your case?”</p><p>“Fuck the case,” I growl, because that isn’t the issue here. “Josephine, my sweet Josephine. Think of all the ways I’ve worshiped your body. Made love to you every night. You’re it for me. Nothing else in this whole world matters if I don’t have you.”</p><p>“Law.” Her eyes fill with tears again, but I can tell I’m getting through to her. Her beautiful face has gone soft. It’s the same face she gives me when I tell her how utterly sweet she is, and she tells me there’s nothing sweet about her, which is utter bullshit. She’s pure sweetness. A sweetness that only I get.</p><p>“Did you mean it?” I ask her. Her words still rolling around and around in my head.</p><p>“What?”</p><p>“When you said you loved me. Did you mean that? Do you still love me?” Her words ripped through me when she threw them at me in anger. I want them back. Need them. We’ve never said them to each other before, because I didn’t want to push. I’d pushed her so much already that I hadn’t wanted to add to it. And to be honest, I wanted them from her first. I had done so much to get her. Gone after her hard and just taking over. I wanted this to be something she gave me.</p><p>She drops down to her knees in front of me, but I scoop her up in my arms and stand. She wraps her legs around my waist, her hands around my neck, her fingers digging into my hair at the back of my head. “You don’t ever go to your knees.”</p><p>She ignores my words. “I’m sorry I overreacted. I just...you’re just...” She stumbles over her words, and I hold my breath, wondering if she’ll say it again. “Too perfect to be true. This is all so new to me. I’ve never done this before, but I should have known I feel it when you touch me, you love me and I love you.”</p><p>I take her in a deep kiss, pushing my tongue into her mouth, needing a taste of her more than I need to breathe right now. I was so fucking scared she’d never give me this again. Her body melts into mine, her sweetness seeping out. I press her up against the car, but I quickly pull back, remembering we’re still on the side of the road, and I don’t want anyone seeing her with all this passion on her face. It’s all mine, and I’m not sharing even a drop of it.</p><p>She tries to pull me back to her, and I can’t help but chuckle. Over the past few weeks she’s become more of the aggressor when it comes to the bedroom. It’s adorable as shit when she tries to boss me around in the bed and when she tries to attack my cock.</p><p>“Not here,” I tell her, trying to remind myself as much as her before my control starts to slip.</p><p>“Take me home.”</p><p>I pause at her words, and she must feel my body tense up. “Our home,” she finishes, making me smile. I’ve been slowly trying to move her in, and it seems she was on to me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I love you, sweetheart, and there’s nowhere I’d rather take you than to our home.”</p><p>Joey</p><p>Law carries me into the house, and I can’t keep my hands off him. The passion between us has ignited and there’s no putting it out.</p><p>When I open my eyes to see we are in our bedroom, I hop out of his arms and start taking off my boots. “Get on the bed, Sheriff. I’m in charge tonight.”</p><p>“Yes, Ma’am.”</p><p>Law gives me a cocky smile, letting me know that he’ll play along. I know he doesn’t really let go of his control. He just lets me play for a while. I felt like a jerk for messing up his case, but on the way home he got a call from his partner saying that she was able to sneak a wiretap in his father’s office tonight and that she should have all the evidence to sink his ship very soon. Law didn’t seem to really care, but I was grateful that he hadn’t given up on all that work just because I got mad and didn’t hear him out. I’m quick to heat, and I judge fast. I should have heard him out. That’s what you do when you love someone. You give them a chance. This is all crazy new to me, but with Law on my side, we can make it through anything.</p><p>Once he’s naked and climbs onto the bed, he lays his big body in the middle, spreading his arms and legs.</p><p>His hard cock is pointing straight up, and I can’t help but clench between my legs in excitement. Goddamn, do I love fucking him. We have times where it’s sweet and slow, and sometimes it’s rough and fast. I think tonight I want a little of both.</p><p>I slowly strip off my clothes, letting him get his fill. He reaches down between his legs, stroking his cock as I bend over to take off my panties, spreading my legs wide and letting him see all he’s about to get.</p><p>“Fuck, baby, I don’t know how long I can wait.”</p><p>Once I’m completely naked, I slowly crawl from the foot of the bed, up his body. I straddle his leg and rub my wet pussy up his thigh, letting him feel my heat and teasing us both. I rub back and forth, grinding on his hard muscle and feeling the friction of the hair he has there against my clit. It’s so good that I reach down and spread my pussy lips further apart, wanting all of me against him.</p><p>I grind down as I watch him stroke his cock, pearls of cum beading at the tip. He smears his pre-cum down his shaft and uses it as lube as I rotate my hips back and forth. My pussy is soaked, and I can hear the sticky sound of me against his skin, and it turns me on more.</p><p>“Please, Josephine.” I look up to see the desperate need in Law’s eyes, and I move up, straddling his cock, placing his thick tip at my opening.</p><p>“I love you, Law.” Slowly lowering myself down onto his wide cock, I feel him spread me open in the most delicious way.</p><p>“I love you, too, my sweetness.”</p><p>When I reach the root of his cock and I’m unable to take any more of him, I slowly pulse up and down. Gently wetting his length and trying to stretch my pussy to accommodate his big cock.</p><p>Even after all the times we’ve made love, I still have to get used to his size. I feel myself leaking down his cock, and I clench tighter with need. I think my body was so worked up from the stress earlier, and now I’m so relieved that everything is okay that I just need a release.</p><p>I rub circles around my clit as I start to move up and down Law’s cock. He grabs my hips, thrusting up into me, and I close my eyes and moan. After just a few thrusts, I feel him sit up and latch onto one of my nipples. He’s even deeper at this angle, and I can’t hold back my shout of surprised ecstasy.</p><p>“I’m close.” I barely get the words out as his teeth find my neck, and I use my free hand to grip his hair. My other hand is still on my clit, inching me closer and closer.</p><p>“Let go, Josephine. I’m right here to catch you.”</p><p>His words of trust and love send me over the edge, and I cum on his cock, releasing all the tension I’ve been holding on to. I melt into him and move up and down, riding out my orgasm and making it go on longer. He grips my hips and makes me grind down on him as he thrusts deep and fills me up. I feel his cock twitch inside me as his warm cum spreads through my pussy.</p><p>“I love you, baby.” I smile against his skin because I can’t stop saying it. I feel so silly and shy because I keep repeating it, but it just keeps coming out. I’m officially head over heels in love with this man of mine.</p><p>I hear him whisper the words against my neck, sending chills up and down my back. I move against him a little and feel that he’s still rock hard inside me. There’s not usually a time we are together that he isn’t hard, and if he isn’t, it only takes a wiggle of my ass to get him there.</p> <p>“Marry me, Law.”</p><p>He pulls back fast, grabbing my face and looking into my eyes. “Say it again.” It’s a demand, not a question. His look is intense, and I can’t tell if I’ve upset him or made him happy.</p><p>I take a deep breath and remind myself that this is what love is. Everything out on the table and heart wide open.</p><p>“I said, marry me, Law. Will you marry me?” I bite my lip and think that he may have wanted to do the asking. But he should know by now that I’m not a conventional girl, and this isn’t a conventional relationship. I’m different, he’s different, and that makes us different.</p><p>He closes his eyes tightly for a second and then opens them to look back at me. His big eyes are a little watery as he nods his head.</p><p>“You will?” My voice goes up on a squeak on the last word, but I’m too excited to care. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes, Josephine, I’ll marry you. Been waiting on you to ask that for a long time. And to be honest, I thought I’d have to wait a long time for it. I love you so much, baby. I can’t wait to make you my wife.”</p><p>He grabs me by the waist and picks me up from the bed, not breaking our connection. He walks me down the hall to his office, around his desk, and sits in his big chair, all while keeping his cock in me, with me wrapped around his hips.</p><p>Reaching over, he pulls out a black velvet box and hands it to me. There’s a receipt on top, and the date is circled. It’s from almost exactly a year ago today, and I look up at him in confusion.</p><p>“Since I first laid eyes on you, Josephine.” He pulls out the ring—an emerald-cut black diamond. “You’ve always been the only one.”</p> <p>He slides the ring onto my finger, and my lips fall on his, telling him what I can’t find the words to say. As he lays me back on the desk and makes love to me, I realize that he wanted me before he knew me. He took one look at me and knew I would be his best friend, his partner, his wife, and the mother of his children. He saw more in me in one glance than I’d seen in myself my whole life.</p><p>Goddamn, I’m a lucky woman.</p><p>Epilogue</p><p>LAW</p><p>Ten years later...</p> <p>“I’ve told you three times, I’m not doing it.”</p><p>“Josephine, I swear it’s an emergency.”</p><p>I hear the phone click, and I know she hung up on me. I feel the smug smile on my face as I lean my ass against my cruiser and wait for her to show up.</p><p>The kids are with Paine and Penelope this weekend, and what better way to start off our time alone than with a little fun.</p><p>We’ve been together so long that I’m sure she knows my game, but that sassy hard-ass of hers likes to play hard to get.</p><p>Things between us have only gotten better over time, and I still can’t get enough of her. She’s the love of my life, and even though things get hectic, we still find time to remember why we fell in love.</p> <p>I don’t have to wait long before she pulls up in her Corvette. I bought her the classic for her thirtieth birthday, and she looks sexy as fuck in it. She steps out, and my eyes roam up and down her tight body. She’s got on a black tank top, tight jeans, and her work boots. Her black hair is in messy waves down her back, and she looks like a fucking sex goddess. She stomps over to me and crosses her arms.</p><p>“What’s wrong with it?” She looks over my shoulder to see the hood of my cruiser up and raises an eyebrow.</p><p>“Don’t know. Damn thing won’t start.”</p><p>She bites her lip to keep from smiling and elbows past me to check it out. It won’t take her long to see the battery cable disconnected, but the real fun will begin after I get the cuffs on her.</p><p>I smile as I turn and follow her, thinking this is going to be a hell of a weekend. </p> </body></html>"]