["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>“You may as well stop complaining about it . It’s your responsibility as a Lycan alpha, and there’s no way to get out of it.” Larssen sat calmly in the comm seat, executing a maneuver that would take them through a wormhole to the Andromeda Galaxy. They could then travel to their destination, Lycanus 2, a sister planet to their own Lycanus 3. Unlike stargates, the wormholes weren’t permanent. Their connections lasted only for a short time, usually sixteen to forty-eight hours, and collapsed if too much mass passed through them. Their ship was small and fast, but it still took almost a full day of travel time to get through to the other side.</p><p>“Well, it may be my responsibility , and I’m fucking doing it. But I don’t have to like it,” Konnor grumbled. He’d been in a foul mood since Lucas, his pack alpha and his first cousin, told him he’d been chosen to preside over the Selection, the annual judging of a young pup’s status in the pack.</p><p>Konnor and his brother Larssen had been selected to serve on the Hierarchy Panel, an important duty that enabled them to select the new leaders while providing a smooth transition from childhood to adulthoodby deciding on each pup’s rank in the Lycan hierarchy. In their ancient history challenges and fights decided rank. The intense battles among the young pups, as the applicants were called, had sometimes led to unfortunate deaths, especially among the extremely dominant alphas who refused to yield.</p> <p>As Lycan wolf-shifters, rank was everything. The alphas were the controlling and sovereign leaders of the packs, assisted by their seconds in command, the powerful betas. The gammas were the soldiers, still forceful, as all wolf-shifters were, but they were the followers, comfortable in their roles as followers and rank and file. The lowest ranking, most submissive of the Lycans were the omegas. Omegas were rare, and thought by the Ruling Council to be slightly defective, good enough for only two things—service and fucking. Thus, omegas were taken as love slaves or concubines by the pack. Sometimes the gammas chose them, but if they were good-looking, then one of the dominant alphas usually took them on as their concubines and personal submissives.</p><p>It was an important but arduous process to determine the pups’ ranks, and one that the alphas took seriously. Each alpha had a duty to take his rotation as a judge. When Lucas called Konnor into his office to break the news to him, however, he’d still been apologetic.</p><p>“Sorry, Konnor, but it looks l ike yourand Larssen’s numbers have come up. The Ruling Council on Lycanus 2 has requested I send two of my alphas right away to participate in the Selection. Since Nikolai is still on his honeymoon, and Kyle and Blayde are both busy in different parts of the galaxy on their transports, all I have left is you and Larssen.”</p><p>“ Gods, Lucas, I’m supposed to be taking a little rest and relaxation here. Larssen and I have had three transports and two bounties back to back.”</p><p>“I know, Konnor, and I hate to ask you both, but it’s out of my hands. The Ruling Council is demanding your presence. We’ve been able to dodge their summons for a few cycles, but this time I have no choice but to send you both.”</p> <p>Alphas were comparatively rare, though Lucas’ family on Lycanus 3 had been cursed with not one but six alphas, all closely related. Their greatgrandfather’s concubine, a powerful warlock, had cursed the Balenescu family to have nothing but alpha male children. This was somewhat disastrous, as alphas simply could not live together in harmony. Luckily, only one of them, his cousin Lucas, was interested in leading the pack. The others became either bounty hunters, like Konnor, Larssen, and their cousin Blayde, or Voyagers like Kyle and Nikolai, delivering bauxite, their planet’s export, to planetary systems all over the galaxies. This enabled them to make their homes on Lycanus 3 but also to not be around a great deal. The six alphas, then, were able to remain close without rippingout each other’s throat. Blayde and Nikolai had recently found their mates, and this also helped to tone down some of the aggressive competition among them.</p><p>Konnor was only twenty-three, and hoped the other part of the family curse, the one that had to do with finding their mates, didn’t touch him for a long time. Konnor had no desire to become as besotted as Blayde and Nikolai, and be tied down to one mate for the rest of his very long life. Waiting another ten years would be just fine with him, and give him a chance to fully explore the galaxies, along with exploring his very dominant nature.</p><p>All alphas were dominant, but unlike his cousins, Konnor was an alpha who not only had a streak of sadism, but who also required his partners to be extremely submissive. Since he traveled so much, he’d actually given serious thought to purchasing a love slave from one of the many auctions throughout the galaxy. He was particularly drawn to sexy little humans, like the one his cousin Blayde had mated, but so long as they were on their knees and knew how to properly serve their masters, he was okay with other species too, like Nikolai’s gorgeous, exotic Jayronian. Not that Nikolai’s little Jayronian prince was particularly submissive. He had led Nikolai a merry chase during their courtship.</p><p>The only thing that stopped him from buying a love slave was the fucking curse his family was all under, thanks to that crazy old man his great-grandfather mated so long ago. Since Konnor was twenty-three, his number might be up soon. A love slave would then turn into a liability, because not only had the bastard cursed all the descendants to be alphas, but he had also fixed it so they would find their mates while they were really young. Even worse, once they found their mates, they would be irrevocably, passionately, wildly in love with them, and find themselves unable to be away from them for longer than a day or two. This was the most embarrassing part of the curse for Konnor. Possession, protection, and discipline for your submissive mate were all fine, and to be expected. But love? Love was for other people, but not him. Love only complicated an otherwise straightforward relationship.</p><p>“Lucas said there were about ten of them.”</p><p>“Huh? Ten what?” Konnor had been so deep in thought he’d lost the thread of their conversation.”Oh, the pups? And how many alpha judges? ”</p> <p>“Ten—one pup for each of us. That should make it go a lot faster. We’ll be able to really observe them well, and put them through their paces, though alphas are usually pretty easy to spot. They’re the ones who growl back at you and show their teeth when you try to dominate them,” he said with a laugh.“I hope we get a couple of those and then we can be on our way.”The young pups were all around the ages of seventeen and eighteen, with an occasional late-blooming nineteen-year-old. They were also at the age of puberty, which came extremely late for Lycans. Perhaps because of their long lives, sometimes over two or three hundred cycles, most male Lycans didn’t become fully grown until their late teens. Until about eighteen, most males lived at home with their parents, but when they hit puberty, they were expected to go through the Selection, which would decide their paths in life. From that moment on, they were considered fully adult and independent.</p><p>Alphas were put into tactical leadership training, betas were given educations in finance and psychology in preparation for becoming the bookkeepers and counselors of their packs, and gammas were put into some kind of apprenticeship with one of the packs, either on their home planet or on one of the other Lycan planets, wherever they were most needed. As for the omegas, if there were any, they would be put into submissive training and then put up for bidding as love slaves. Since they were still Lycan, they would be sold only to another Lycan for his pleasure, and their alpha leaders would ensure they received good homes. Though all other Lycans were dominants, they took good care of their own. The omegas were considered to be mentally defective dependents and were closely monitored throughout their lives by their alphas.</p><p>“Well, wake me up when we get close. I’m going to try to get a little sleep before my turn at the controls,” Konnor said.</p><p>“Yeah, maybe you’d better. I hear the nightlife on Lycan 2 can be wild.”</p><p>“Good. Maybe this trip won’t be a total waste after all.”</p><p>Konnor lay back in his seat on the comm deck, dropping almost immediately into a drowsy, half sleep. Used to grabbing a nap whenever they had a chance, he and his family were all experts at falling asleep quickly on a long voyage. Because of the wormhole’s instability, one of them needed to stay at the controls, and since it was Larssen’s turn, Konnor settled back to get comfortable. Before he sank completely down into sleep, he thought about what Larssen had just said. The nightlife on Lycan 2 was renowned throughout the galaxy, and that was saying something. Unlike the insular home planet of Lycanus, Lycanus 2 and 3 were much more socialized and open to visits from other species. Lycanus 2, in particular, had made an industry of providing pleasure. Not only did the planet boast beautiful mountains, waterfalls and rivers, but the southern hemisphere had arguably the best beaches in this part of the galaxy. The Amarinthine Ocean, with its purple, warm-asbathwater seas was Konnor’s favorite vacation spot, its black volcanic sands the perfect place to sunbathe under the twin suns.</p><p>But the Ruling Councilhadn’t forgotten the nightlife. Their planet boasted some of the best D/s clubs anywhere in this part of the galaxy. He planned to check one of them out at the earliest opportunity. He might find a pretty little human sub to sit on his lap and maybe ride his cock, while he indulged in a game of Palomian Poker and drank some smooth Lycan whiskey, his favorite refreshment. No, maybe this trip wouldn’t be so bad after all. It was just a simple judging, after all. What could possibly go wrong?</p><p>Ethan Capraru looked down at himself for the hundredth time. Naked. Naked as the day he was born, with nothing to hide behind. Not that he was the only one. All the other candidates were standing in a row beside him, equally uncovered as they awaited the call for their first interview with their alpha judge. New candidates always appeared before their judges in the nude. It made things easier if they were asked to shift so the judges could inspect their Lycan wolf. It was traditional, he supposed, and nothing to feel so uncomfortable about. Except that he did.</p> <p>In any group, he always felt that he didn’t quite measure up . Not physically. He was average height and weight for a Lycan male, and certainly his cock was as respectably sized as any of the other young men standing beside him. No, it was something inside him that didn’t quite fit, something he’d tried all his life to conceal. He’d never felt that he was enough, somehow. Not strong enough, not tough enough, not brave enough to survive without help. He was about to be judged on his fitness to rule, and he knew he would be found lacking. He thought he could be a good gamma, though. He was much more comfortable following orders and while he wasn’t as physically controlling and dominant as some of the others, he was intelligent, if just not terribly forceful or decisive. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was probably because of his childhood. He’d never really known his parents, having been left at an orphanage well before his second birthday. He had vague, shadowy memories of someone rocking him, holding him tightly in their arms, but that was all. He was given his name by the staff, and his surname even came from there, the Capraru Home, except it had never been much of a home to Ethan. His earliest memory was of standing up on the side of his bed, gripping the railings as he cried for something to eat. Food was a precious commodity at the Capraru Home, and always in short supply for the children.</p><p>By the time the authorities finally closed it down he was around four years old, and he was placed in another group home. He had weighed less than thirty kopins, and they had feared for his life, force-feeding him for the first few quarter-cycles until he finally began to put on weight. At that, he was luckier than some of the children from the orphanage, who had died from a combination of starvation and neglect. It was quite a scandal on his home planet of Lycanus, which prided itself on taking care of its citizens, and the children had mostly been quickly spirited away to a group home on a sister planet.</p><p>There on Lycanus 2, he’d received better treatment. He had enough to eat, at least, and no one was ever cruel to him, but he didn’t fit in well with the other children at the home. They were mostly a rough and tumble bunch, loving to play sports outdoors and wrestle with each other on the playing fields. He preferred to stay inside with his books and electronics. Sports mostly bored him, and he had no interest in the wrestling matches and domination games the other boys loved to play. The others seemed to sense he was different, too, but pretty much left him alone. The Headmistress, Doma Gerta, saw to that at least. She tolerated no teasing or hazing in her group, and while she wasn’t exactly warm and comforting, she at least kept the other boys from bothering him while he was growing up. Ethan had a caretaker kind of personality, and always had. He liked taking charge of the younger boys in the group home and didn’t mind helping Doma Gerta around the house with the cooking and cleaning. At least he felt like he was helping and it gave him some sense of self-worth when she gave him a rare word of praise. When he was seventeen, Doma Gerta left and a new doma came to the house. Her name was Helga, and she seemed to notice him immediately, often stroking his hair as she passed him in the house.</p> <p>As he had grown up, his hair never lost the blond color many of the babies on Lycanus started with, leaving his hair the unusual color it was now. He sometimes noticed Doma Helga looking at him oddly, almost appraisingly. She had even approached him once with strange questions about whether or not he would like to live off-planet and perhaps even travel the galaxy. But when he’d questioned her, she clammed up and refused to explain.</p><p>Now Ethan was entering puberty, a little late, even for a Lycan, as he was just past his nineteenth birthday, and he was facing the Selection. His hope was that he would be designated a gamma, and assigned to some apprenticeship where he could continue to be of service, maybe in the medical field, or perhaps working with children.</p><p>When he’d confided his hopes to Doma Helga, she had given him an odd look and p atted his hand.“You’re a good-looking boy, Ethan. If you don’t want to go through the selection, I could find you a place with my sister. She runs a very high-class restaurant on one of the Jupiter moons. I’m sure she could find a place for a pretty boy like you. If you’re interested, I can contact her...”</p><p>“N -No, I can’t do that. I want an apprenticeship. Maybe I’ll get a good one. At least I want my chance.”</p><p>“All right, suit yourself. But if it doesn’t work out for you, remember what I told you. I have a feeling you’re just the kind of boy who would do well in my sister’s establishment.”</p> <p>He’d felt a bit of a chill at her words, especially when a cloud seemed to pass over her face before she stood up, gave him another brisk pat on the shoulder and moved on to finish her dinner preparations. He wondered what she meant. The alphas would know he wasn’t a leader, and if they put him in a gamma apprenticeship that he didn’t like, there was always the possibility of a transfer, after a year or so, to a job he might like better. The council would never let him choose his own job off-planet, would they? No, he was doing the right thing, the only thing for Lycan males. He’d do his best and probably be designated a gamma and maybe get a good apprenticeship so he could finally be on his own.</p><p>He comforted himself with that thought as he waited for his name to be called. He’d been given a card with his alpha judge’s name on it—Konnor Balenescu. One of his housemates who was also going through Selection with him had pointed the big Lycan out to him, telling him he was from Lycanus 3 and he was one of the famous Balenescu bounty hunters. Even from a distance, Balenescu looked stern and dangerous, and Ethan was glad he would never be in a situation wherehe’d have to run from him.</p><p>Taller than average, at about six feet six, Balenescu was also solidly muscular. His hair was a beautiful shade of brown, shot through with red highlights, and would have fallen almost to his shoulders had he not kept it carelessly tied back. Ethan thought he was beautiful, and it only increased his nervousness. He shifted from foot to foot, feeling a little chilled, even though the weather was warm outside.</p><p>“Ethan Capraru. Come inside, please.” The beta who was assisting in the selections motioned to Ethan that he was next, and Ethan hurried to follow him. Thoughts of the handsome Balenescu had made him half-hard, and he was mortified to see his eager cock bouncing in front of him as he walked quickly down the corridor. He’d always known that he preferred males, a not unusual occurrence on his planet, where many Lycans liked both males and females, since either one might be their fated mate. Once the mate was found, an instant attraction was established, and once the two touched for the first time, they imprinted on each other, and mating followed shortly thereafter.</p><p>The beta opened a door farther down the corridor and waited for Ethan to precede him inside. Ethan stepped through the doorway, and immediately dropped his head, gaining only a vague impression in those first few seconds of a small room with two men sitting behind a table. Instinct made him move his hands to cover his rapidly stiffening cock.</p><p>He glanced up and saw that the one his housemate pointed out to him as Konnor Balenescu was gazing at him and cocking his head to the side, as if not quite sure what to make of him. The big alpha stood up and walked around the table, sauntering toward him with a confident air that Ethan admired. Gods, he was so good looking up close. Even better than expected. The big alpha walked up to him and surveyed him from head to toe, stopping to stare for a moment at his rigid cock. He glanced back up into Ethan’s eyes and his perfect lips turned up at the corners, giving just the barest hint of a smile. He reached out to shake his hand, saying, “Hello, Ethan. My name is KonnorBalenescu, and I’ll be your judge.”</p> <p>Ethan took his hand and began to give him a tremulous smile in return when the alpha threw his hand back at him as if it burned him. That’s when it happened. Balenescu’s fangs descended, his claws sprang out on the ends of his fingertips, and he literally jumped back away from Ethan, yelling, “Fuck! What the hell are you?”</p><p>When the two young pups came in the interview room, Konnor had been bored out of his mind. He’d just sat through a long and dull interview that Larssen was having with a young beta. At least they were both pretty sure he was a beta. He smelled like one, and he was strong, smart, and confident, but not overly dominant, like an alpha would have been. Poor guy didn’t have much personality either, though he could have been intimidated by the Balenescu brothers. They sometimes did that to people without realizing it. It was good for bounties, but did cause some social issues. They needed to run a few more tests and see him shift to be sure exactly what the pup’s rank was. As soon as Konnor’s applicant was interviewed they could begin with both of them.</p><p>When the door opened and his new pup came in, Konnor barely glanced up at him. He was reading over his file as he came in, and feeling a little sorry for the young Lycan who was to be his candidate. From the boy’s history, he’d had a rough time of things—an orphan who’d suffered through the terrible Capraru orphan scandal that had rocked Lycanus—could it really be seventeen years ago? Konnor had only been five years old himself when it happened, so he had no personal memory of it, but the scandal came up regularly whenever social reforms were up for a vote with the Lycan Ruling Council.</p><p>It was the smell that finally made Konnor look up, a sweet, sugary smell like something delicious to eat. It made his cock get thicker and his balls draw up to his body. It seemed to be radiating off the new pup, and Konnor wondered idly if he was using some kind of pheromone cologne, made popular by the love slaves in the clubs on Lycanus 2. He glanced up from the file and straight into a pair of the most beautiful sherrycolored eyes he’d ever seen, a dark, sensuous color like the sunset over Grekko Minor. Like that ocean on Jayron—what was it called? Oh yeah, the Carmine Sea. He wondered for a moment if he’d suddenly lost his mind, waxing poetic over a pup like this, or anyone for that matter. Curious, he stood up and walked toward the boy, who was standing nervously shifting from foot to foot. He noticed his hard-on right away, but decided to give the kid a break and not mention it, though it was a very nice erection, indeed.</p><p>The whole package was pretty nice. Beautiful, really. He was about average height and build for a Lycan, but not overly muscular. His body was quite pretty anyway, with pale, smooth skin and very little hair, except for the blond, shaggy mane on his head. The boy looked up at him again and Konnor smiled at his obvious embarrassment. Was Konnor ever so young? It didn’t feel like it. The pup had a pretty pink blush on his cheeks, and he kept wetting his luscious, pouty lips.</p><p>Konnor shook his head a bit. Damn, he needed to get laid and soon. He usually wasn’t attracted all that much to other Lycan males, but for this kid he’d make an exception. Alphas often took their pups to bed to teach them how to be good lovers. It was an ancient tradition called Topferort, and one Konnor thought he might just have to explore with this one. Having sex with adult, trained Lycans, though, was another matter. It usually just wasn’t done. Lycans were too damned dominant for anything other than the briefest encounter. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The boy was growing more nervous at his inspection, so he reached out to shake his hand. The second Konnor’s hand touched the pup’s a jolt of pure adrenalin hit him so hard he thought he might pass out. A dizzying sensation swept over him at the first touch of his hand, and he felt his fangs descend from his gums. His hands, when they clenched in panic, had fully extended claws sprouting from his fingers.</p><p>Dropping the boy’s hand like it was on fire, he jumped back and yelled out the first thing that popped into his mind.“What the hell are you?”</p><p>His chest heaving, he fought for control. An overwhelming primal urge came over him, and he was in actual physical pain. His cock strained against the fastenings of his trousers in a strong bid for freedom, and he turned and took a couple of steps back toward the boy, fully intending to throw him on the floor and fuck him into it. It was the young pup’s reaction that stopped him in his tracks.</p> <p>The boy’s entire body flushed, and he surged backward. Instantly, his head dropped, and he literally bent at the waist, wrapping his arms around himself. “I-I’m sorry! Please don’t hurt me!”</p><p>Konnor froze in horror. Hurt him? He had no intention of hurting the sweet pup. Kiss him into submission, maybe. Pull his naked body into his and grind his cock against him, perhaps. Fuck him senseless, yeah. But hurt him? No way. The boy was his, and he’d never allow any harm to come to him. Konnor was still glaring at the pup, aware that both Larssen and his new candidate both were looking at them with alarm. Larssen sprang to his feet and crossed over to him quickly. “Konnor,” he said in a low voice. “What the hell?”</p><p>Konnor wrenched himself away from the beautiful boy, pulling back his claws and trying to force his fangs back into his gums. “Get him outside for a bit, will you, Larssen?” he whispered hoarsely, the extra teeth in his mouth making it hard to speak. “Not too far! Just-just out of my sight for a few minutes.” Larssen turned away and Konnor grabbed his arm. “Don’t scare him. And don’t-don’t touch him, all right? ”</p><p>Larssen gave him a long, suspicious look but moved away, and Konnor could hear him murmuring something to the young man, then directing his own candidate to wait outside as well. He came back over to Konnor and stood regarding him silently for a long moment.</p><p>“Care to tell me what that was all about?”</p> <p>Konnor sighed in misery. “Oh damn it, Larssen. He’s my mate.”</p><p>“Your what?” Larssen looked from Konnor to the closed door and back again. “But-But that’s impossible. We don’t mate with other Lycan males! You’d both be too dominant. You’d wind up killing each other!”</p><p>“Yeah, well tell that to whatever fucked this thing up then. He’s my mate, I’m telling you. I smelled him when he first walked in the room, and when I touched him! God, I thought it would knock me down! I’ve already imprinted on him. I felt it the moment I touched him.”</p><p>Larssen was silent at first then nodded slowly with a wry smile. “Yeah, we all noticed your oh-so-subtle reaction to him. What now? I’ll do whatever you say, bro, including running like hell with you, if that’s what you want.”</p><p>That remark surprised a brief laugh out of Konnor and he shook his head. “You know that won’t do any good. I couldn’t stand to be away from him. No, I’ll just have to figure it out— bring him back in, please, Larssen. I don’t like him to be out of my sight.” Larssen turned toward the door and Konnor grabbed onto his arm, a terrified expression on his face. “Oh gods, you don’t think he’s an alpha, do you?</p><p>“Shit, I hope not. There are too many of us as it is, and as dominant as you are, you’d kill each other before the mating process was over. No, from the way he reacted when you yelled at him, I’d be surprised if he was anything more than a gamma, and a pretty submissive one at that.”</p> <p>“What? Why? What do you mean? ”</p><p>“When you yelled at him he almost shit himself. An alpha would have yelled back at you. A beta would have asked you what the hell you were yelling about, probably. Even a gamma would have just looked at you like you were nuts, not...”</p><p>“Not what?”</p><p>“Dropped his head and hugged himself like he was scared to death of you. He almost got down on his knees.”</p><p>Konnor snorted. “No way! Because I yelled at him? Why, he’d have to be omega to do something like that.” His eyebrows rose almost comically. “An omega? Oh gods, Larssen. Do you think...”</p><p>Larssen shrugged. “Only one way to find out. Talk to him for a while. Most folks say they’re...uh...you know, mentally defective.” He raised both hands in a defensive gesture when Konnor growled fiercely at him. “Not me! I’m not saying that. But if you get him back in here, and talk to him...and get him to shift. You’ll be able to tell right away what he is.”</p><p>Konnor nodded thoughtfully. “He’s mine, whatever he is, but if he turns out to be an omega, then I’ll have to buy him from the council. You saw him. As beautiful as he is, the bidding would go high.”</p><p>“One step at a time, little brother, one step at a time. Let’s make sure of him first.”</p> <p>“Bring him back in then, please, and give me a minute alone with him.”</p><p>Larssen nodded. “Get ready and I’ll send him in.” His eyes traveled down to the obvious bulge tenting out his trousers. “Might want to get behind the table before I bring them in. You’ve already scared him to death. Don’t want him passing out when he sees that.”</p><p>“Oh, very funny. Just get him, will you?” Konnor looked down at himself, though, and moved back behind the table where he’d been sitting earlier.</p><p>Larssen went to the door and motioned to someone in the corridor. In seconds, Ethan came hesitantly through the door, casting a fearful glance at Konnor before dropping his head. Larssen nodded at Konnor and shut the door, leaving them alone.</p><p>Konnor took a deep breath, inhaling his sweet scent. “Sorry I yelled before, Ethan,” he said quietly, not wishing to spook him again. “I...uh...remembered something and it surprised me, that’s all.”</p><p>Ethan nodded slightly, still not raising his gaze. Konnor tore his gaze away from the boy, looking blindly down at the interview questions, pretending he could see well enough to read through the red haze still clouding his vision.</p><p>“So, Blondie, how old are you?” He already had the information right in front of him. Shit, why couldn’t he think straight? That sweet scent was intoxicating.</p><p>“Nineteen, sir.”</p><p>“You’ve had some challenges in the past.”</p><p>Ethan regarded him solemnly, looking as if he wondered whether or not to respond. Finally, he nodded. “Yes sir.”</p><p>“And what rank do you think you are?”</p><p>Ethan finally glanced up at him. “I-I think probably gamma, sir.”</p><p>“Oh, and why’s that?”</p><p>“I-I don’t think I’d be a good leader. But II don’t mind following orders.” Konnor smiled at him encouragingly, and he seemed to warm to his subject. “I-I like following orders, actually. You know, having someone else in charge. It makes me feel safe, and I always know exactly what’s expected of me.” Oh, fuck. Konnor got an instantaneous erection at his words, so marblehard he had to adjust his pants. “And I like to be of service whenever I can. I’m very good at serving others.” Okay, shit, this was killing him. “I’d do whatever it took to make my alpha proud of me.”</p><p>Konnor cleared his throat. “I see,” his voice came out about an octave higher than normal, so he cleared his throat again. “Well, I don’t believe I have any more questions. You know you’ll have to face the others in the ring? We’ll be monitoring the confrontation carefully, of course, but that will go a long way to determining your rank.”</p><p>Ethan nodded. “Yes, sir, I understand.”</p><p>“You’ll be shifting into your Lycan wolf. Are you good with that?” Konnor noticed a worried frown appearingon Ethan’s face. “Problem, Blondie? ”</p><p>“N-No sir. It’s just that I have only shifted one time before this. It was in my sleep, and I woke up as it was happening. It scared me so much I stopped. I just hope I can do it, sir.”</p><p>Konnor got up from his chair and walked around the table, getting closer to him. It was dangerous to be so close to him, but he was fairly certain he had it under control. Pretty much. He wanted to take Ethan on his lap and tell him everything would be fine—while he stroked his cock and sucked on his nipples. “I’ll talk you through it, Ethan. For practice. Just close your eyes now and concentrate on your wolf. Really seehim in your mind’s eye. Can you do that? ”</p><p>“Yes, sir,” Ethan said, closing his pretty, sparkling eyes.</p><p>“Good boy.” Konnor shook himself. That last part came out like a purr. He had to get control over this thing. Damn that fucking warlock and his curse! “Okay, Blondie, just relax and tell him he can come forward.”</p><p>A popping, crackling sound came asEthan’s joints stretched and his body morphed into his Lycan wolf. Most Lycans loomed upwards to about seven feet tall in their wolf forms, their upper bodies becoming extremely muscular and covered in stiff black hair. Their heads became that of wolves, with glowing red eyes and wicked fangs. Long, fierce claws sprang from their fingers and toes, and they became fearsome and savage creatures. With Ethan, however, this didn’t exactly happen.</p><p>Ethan’s body did elongate a little, but he failed to really bulk up. His body stayed softer and less muscle-bound than normal. Instead of black hair, his body became covered in a soft, silvergray fur. His head was that of a wolf, but he didn’t look fierce or savage. His fangs didn’t hang down from his mouth and his claws looked more like long fingernails. Even his eyelashes curled! Though he was smaller and less fierce than any Lycan wolf Konnor had ever seen, Konnor thought he was also just about the most beautiful. And damned near perfect. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Konnor tore off his own clothes and shifted almost before he thought about it. His wolf sprang forth eagerly, anxious to dominate the smaller wolf and make him submit. His rational mind supplanted by the wolf’s, Konnor stalked slowly toward Ethan, feeling satisfaction when the smaller animal dropped unhesitatingly to the floor, falling to his knees and presenting his vulnerable throat to him. He was the absolute picture of submission, and both Konnor and his wolf felt their hearts palpitating wildly. Both he and his wolf realized they were well and truly caught, and neither of them ever wanted to get away.</p><p>Chapter Two</p><p>Ethan felt a whimper rising from his throat as the huge Lycan creature came toward him. Standing perhaps seven feet tall, with muscles bulging all over his body, the alpha was absolutely terrifying, his red eyes glowing, and his fearsome fangs showing as he drew back his lips in a feral snarl. Ethan turned his head as the creature approached, sniffing at him. Some primal part of his brain urged him to submit utterly to the predator standing over him. Surprisingly, when he did, he felt a complete peace come over him, a rightness. This was where he was supposed to be and his submission completed him and made him feel whole for the first time in his life.</p> <p>The huge alpha wolf sniffed him all over, and finally came back to his head. He bent over, placing his snout near Ethan’s, growling softly. The little Lycan moved his head toward the larger animal, but kept his gaze lowered. The alpha’s mouth came down around his snout, clamping down firmly, but not injuring him, only holding him there until he whimpered his total surrender. The alpha made a soft sound in its throat then and released him, moving away. With a snap of his bones, Ethan shifted back, so quickly it surprised him. He found himself kneeling on the floor with the big alpha judge standing over him, also shifted back, naked and glorious, his big body still rippling with muscles. The most surprising thing, though,was the alpha’s rock- hard erection.</p><p>Standing up proudly, Balenescu’s big, beautiful cock was impressive, to say the least. His dick was thick and long, with a bulging nutsac that made Ethan harden instantly. His big cock jutted in front of him, smelling clean and soapy, like he’d bathed recently. But there was another scent coming off him that enticed Ethan so much he couldn’t stay still. The thick, musky arousal beckoned him and forced Ethan to crawl on his knees toward his master.</p><p>Though he’d never taken a man in his mouth before, he seemed to know instinctively what to do. He knelt before him, pulling back the foreskin of his cock with both hands and lowering his mouth over the broad velvety head of his cock. He ran his tongue around it, worshipping it with his lips. Ethan’s hands dropped down to Balenescu’s balls, and he fondled them reverently. He could feel them tighten as the muscles clenched. A big hand dropped down to his head, tangling in his hair and holding him in place, though it wasn’t necessary. There was nowhere else on the planet he’d have rather been at that moment.</p><p>The big hands tightened on the sides of his head anyway and held him still. Ethan whimpered, thinking he meant to pull him away, but instead, he began to thrust, slowly at first, giving him a chance to tilt his head back and try to open his throat while covering his teeth. Soon, though, Balenescu’s thrusts became stronger, deeper. Though Ethan had the alpha’s cock in his mouth, he was no longer in control of anything. The alpha had taken over, and Ethan was only too happy that he led the way. Ethan’s own cock throbbed for release, and his hand strayed down to it, his fingers skimming it lightly. Immediately, the thrusting stopped, though Balenescu’s cock was deep inside Ethan’s mouth. Ethan shifted on his knees uncomfortably and raised his gaze, confused as to why the thrusting was over. A sudden image of how he must look raced through his mind—on his knees, his eyes wide and unfocused, the huge cock still inside his mouth, stretching his lips wide. He glanced up at Balenescu questioningly.</p><p>“Don’t touch yourself , Ethan. You belong to me now and you come only at my pleasure. Do you understand?” Balenescu’s voice was hoarse and rough with passion, but no less authoritative.</p> <p>Ethan stared up at him, his eyes wide with trepidation. “Do you understand, Blondie? It’s not a rhetorical question. Answer me when I speak to you. Nod if you understand.”</p><p>Ethan nodded quickly, and Balenescu smiled. “Good. Now, hands behind your back.”</p><p>Quickly, Ethan put them behind him, clasping a wrist with one hand.</p><p>“Keep your eyes on your master.”</p><p>He raised his gaze up to the alpha, feeling safer right away.</p><p>The alpha began to move again, his thrusts slow and steady, giving Ethan a chance to adjust to them again. His grip tightened on Ethan’s hair and he pulled him even closer. The huge cock hit the back of Ethan’s throat and he gagged. Instantly, his master stopped, pulling back a little until he regained control. His hands moved gently in Ethan’s hair, caressing and petting him. When Ethan got control again, he nodded, looking back up at the alpha.</p> <p>Balenescu groaned, and his breathing became faster and more irregular, as did his thrusts. His orgasm erupted from him without warning, his cock pulsing in Ethan’s mouth. Ethan gazed up at him as he spilled, and tried hard to swallow every drop, his throat working desperately to keep up. Balenescu threw his head back as he came and howled his pleasure as every muscle in his body tensed.</p><p>As the pumping lessened, Ethan didn’t try to pull away. He stayed on his knees in front of the alpha, still suckling gently, letting him soften in his mouth without even an order to do so, as the strong hand fell away from the back of his head. He dropped his eyes again, listening as the larger man regained his breath. Hands pushed him gently away then, and tilted his chin upwards. “Stand up, little one.”</p><p>Ethan got to his feet and felt an arm go around his waist. The alpha took hold of his hands, still clasped behind his back, and held them firmly. At the same time, he reached down between their bodies with his other hand and took hold of Ethan’s hard, leaking cock. He gave it two or three hard pulls, as he dipped his head and captured Ethan’s mouth, and Ethan was groaning and squirming in his arms. “Please,” he murmuredagainst the alpha’s lips. “Please, sir.”</p><p>Balenescu pulled his head away and smiled gently down at him. “Come for me, pretty baby. Come in my hand.”</p><p>With a loud groan ofpleasure, Ethan shot into his master’s fist, his whole body shivering with aftershocks of pleasurein the alpha’s arms. His knees buckled, but the alpha held to him tightly, pulling his body close. Slowly, Ethan came back to himself and realized he was trapped against hisalpha’s body, his hands held behind him and his toes just touching the floor. He felt weak and sated, and he let his head fall forward to the larger man’s shoulder, hoping he didn’t mind.</p><p>Balenescu held him there a few seconds longer before lowering him gently to the floor and putting him back firmly on his feet. He held him steady for several minutes until he was sure he could stand without falling and then he stepped away, back toward the table to retrieve his clothes. As Ethan watched, he pulled his jeans back on and threw his briefs over to Ethan. “Clean yourself up before I tell them to come back in.”</p><p>Ethan did as he asked, his whole body still trembling. He held the soiled briefs out hesitantly to the alpha when he was finished, and the bigger man sighed impatiently. “Bring them over here and throw them in the trash, and then make yourself ready. They’ll be back in a moment.”</p><p>Ethan did as he asked, still moving as if in a daze. The alpha called to him then in a soft tone. “Blondie? Come here, baby.”</p> <p>Trembling, Ethan walked slowly over to him, his feet dragging, feeling somehow ashamed after what had just happened. Had he really just been on his knees in front of the older man, his mouth on the alpha’s cock? He felt a hot flush moving up over his body. Unable to make eye contact with him, he went to stand beside him and was shocked when Balenescu reached for him and drew him down to sit on his lap. He held him so his legs dangled off either side of the alpha’s lap, his back against the alpha’s warm, hard chest. The alpha’s voice rumbled in his ear. “Was that your first time, baby?”</p><p>Ethan nodded, and the alpha pulled him back and settled him so Ethan’s head fell back onto the older man’s shoulder. “Good,” he said softly. For the next five minutes, Balenescu held him there, trailing his fingers gently over his chest and abs as he held him until Ethan’s trembling stopped. Finally, when Ethan began to feel foolish sitting on the alpha’s lap, he began to squirm uncomfortably.</p><p>The alpha laughed softly in his ear. “Are you trying to tell me something, sweetheart? Don’t ever feel embarrassed to let your master take care of you.”</p><p>“Y-Yes, sir,” Ethan replied. “It’s just...if someone came in...”</p><p>“No one will come in until I allow them to. And you don’t have to worry about what anyone other than your master thinks. No one else’s opinion matters.”</p><p>“Y-Yes sir.” Ethan still felt stunned by all that had happened. Why was Balenescu talking like this? Why was he saying he was Ethan’s master? Was that what alphas on Lycanus 3 called themselves? He’d certainly never heard that before, though it did somehow seem right.</p><p>Balenescu sighed and tapped his thigh. “All right. Back on your feet with you. It’s time to let the others in.”</p><p>Ethan scrambled off his lap, and when he stood again by the door, the alpha nodded and pressed a button under the table. The door opened right away and the other big alpha and his charge came back inside the room. Ethan wondered if they had been right outside all this time, and he felt his face burning again.</p><p>The young beta gave them both a curious glance as he stepped inside, until he looked into Konnor Balenescu’s face. Then his gaze dropped quickly, and he glanced over at his own alpha for guidance. Larssen growled something low in his ear and the boy lowered his gaze again and shuffled his feet uncomfortably.</p><p>Konnor settled back in his chair and stared at both of them for a moment. “The two of you are dismissed for now. This afternoon you’ll both report to the Selection Ring. Keep yourself availableand don’t leave the area. You’ll be summoned when it’s time.” Both young Lycans nodded and backed respectfully from the room, closing the door softly behind them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The other boy glanced over at Ethan. “Well, that was pretty intense. I’ve never seen such strong alphas. Scary as hell, right? ”</p><p>Ethan nodded, but he remembered how Balenescu had held him on his lap, soothing him. Inside him a little voice chanted to him. Not my alpha. He’s not scary at all.</p><p>“Tell me what happened . You had sex with him, didn’t you?” Larssen shook his head and perched a hip on the table. “You know we’re not supposed to touch them unless they’re given to us to train by the council. Even then we’re supposed to only teach them about giving pleasure, not take it for ourselves.”</p> <p>“He came to me on his knees . You think I was going to turn him down? He’s my mate, Larssen. I need to claim him so bad it’s killing me. I could barely let him leave just now. This curse thing is a bitch!”</p><p>“He was on his knees to you? Gods, he is an omega then.” “Yes, I’m sure of it . I hate to even put him in the ring,but there’s no avoiding it. We’ll just have to alert the referees to keep a close watch on him.”</p><p>“You’ll have to tell the council.”</p><p>“Of course,” Konnor nodded. “But before that happens, I need to contact Lucas. He needs to use his influence with the Ruling Council to make sure they know Ethan belongs to me.”</p><p>“They’ll only give him to you for training. Then he’ll go up for bidding as a love slave.”</p> <p>Konnor glanced over at him, a sneer on his lips. “You think I’d allow anyone to outbid me? Or pay any attention to it if they did? I’d take him with me to the farthest reaches of the galaxy. Or else I’ll kill anyone who dares to challenge me for him.”</p><p>Larssen nodded. “I know. And we’d all be there to back you up if you needed it.” He gave a short bark of laughter. “I have to say I never thought I’d see you like this. Makes me thankful the curse hasn’t hit me yet.”</p><p>“It’s powerful. I regret the way I teased Nikolai and Blayde now. They’re going to give me hell over this, aren’t they? ”</p><p>Larssen laughed and punched his younger brother on the shoulder. “Maybe just a little. Okay, c’mon and let’s contact Lucas so he’ll have time before the Challenge to speak to the Ruling Council.” He straightened up and turned back to Konnor. “How do you think your Ethan will react when he finds out he’s an omega?”</p><p>Konnor shrugged. “I’m sure he won’t be happy about it. There has always been such a stigma attached to the name. I don’t think he has any idea, but I think he knows somewhere deep inside him that he’s different. He wants to believe he’s a gamma. I have to show him that there’s nothing wrong with accepting who he really is.”</p><p>“None of us would want to be an omega,” Larssen said gently, shaking his head.</p> <p>“That’s partly because you’re an alpha, and you can’t imagine submitting to anyone. Neither can I. I don’t know much about omegas, but I do know submissives. I play with them all the time at the clubs, and they’re wired differently. They enjoy giving their submission to the one of their choice. I think omegas must be the same. The problem is that in the past the omegas haven’t had a choice—the Ruling Council has always tried to say they’re defectives. They take care of them by ensuring they have a good master, who won’t abuse them, but maybe they need to take other factors into consideration—let them choose their own masters, for one thing, and stop treating them like they’re mentally challenged. Ethan, for example, is smart and sensitive.”</p><p>“I’m sure he is, Konnor, but then again, you’re not giving him much choice either,” Larssen reminded him gently.</p><p>Konnor bristled and glared at his brother. “He’s my mate. He feels it too. He came to me, I told you. He’s made his choice, and I could feel it. I could see it on his beautiful face. He may not be totally aware yet of what he was doing, but he came to me instinctively. We have a mating bond, and if I feel it this strong, I know he must feel something too.”</p><p>“Whatever you say,” Larssen said with a laugh, holding up his hands. “I just hope he doesn’t turn against you when you tell him who he really is.”</p><p>Konnor sighed. “He’ll probably hate me at first for exposing him. Can’t be helped though. It’s the first, necessary step to claiming my boy. The sooner he understands he belongs to me, the better off he’ll be.”</p><p>The hours until the Challenge passed quickly because Konnor had so much to do. As soon as he’d talked to Lucas and explained the situation to him, Lucas promised him he’d handle the council. The alphas on Lycanus 3 were important and powerful, becauseof their planet’s highly valuable main export, bauxite. Because of this, the Ruling Council would surely keep the Lycanus 3 contingent happy by agreeing to allow Konnor to train the omega pup. Afterward, of course, the law demanded that he be put up for bidding to the entire Lycan population. In the meantime, the Ruling Council would be only too happy to curry favor with the powerful Balenescus.</p><p>Descendants of an ancient Lycan pack on the home planet of Lycanus, the Balenescu family had first come to start a new life on Lycanus 3, away from their political enemies. Centuries later, long after the ancient political struggle ended, the Balanescu pack were still on Lycanus 3, having made a good life for themselves on the desolate, yet mineral rich planet. It was the site of one of the largest bauxite mining operations in the galaxy. Bauxite was used in the making of aluminum, and in the manufacture of the space transports. Formerly a plentiful metal on many planets, overly zealous mining operations had extracted so much over the mega-cycles that it had become scarce. The mines on Lycanus 3 had become as valuable as the diamond mines on the home planet of Lycanus, and the diamond was now a galactic monetary standard. Only the planet of Tygeria, in the far northern reaches of the galaxy, had as many diamond deposits.</p><p>Konnor was busy the rest of the morning and early afternoon making preparations for their departure immediately after the Selection. Just before they left for the Challenge Ring, Lucas contacted Konnor to let him know the Ruling Council had given their permission for him to train the young omega for a period of three months. After that his training and care would revert to his new owner, who would be the highest bidder.</p> <p>“Over my dead body,” Konnor had growled into the communicator. “Yes, yes,” Lucas said in a soothing tone .“I know you won’t give him up, but I couldn’t very well tell that to the council, now could I? ”</p><p>Konnor controlled his tone to sound respectful. “Thank you, Lucas. I appreciate your talking to them for me.”</p><p>“No problem, but we need the two, or I should say, the three of you back here as soon as you can. We have an important shipment to get out and neither Blayde nor Kyle will be back in time. Nikolai’s on his way, and he can help you, but I was hoping you two would be available to transport it.”</p><p>“We can leave here this afternoon right after the Selection. Everything’s ready for takeoff and I’ll be bringing Ethan with me,” Konnor said.</p><p>“Good. Give me a call when you’re en route, so I can get everything ready on this end.”</p><p>Lucas ended the transmission and the other two alphas headed for the arena. The arena was located inside a huge sporting complex near the center of the capital city, Zebulara. As they approached the area, they could already hear sounds of a large crowd of people in the viewing stands. Konnor and Larssen made their way inside to the judging stands to sit beside the other alpha judges, a few of whom were already in place. Konnor scanned the arena for a glimpse of Ethan, finally spotting him standing at the back of the group of pups, looking scared and nervous, his eyes on the big crowd in the arena.</p><p>The pups were already outfitted in protective gear, a loose fitting harness of sorts strapped around their chests and waists. It extended down past their groins and tied off on their thighs. Everything was oversized since once they shifted, they would bulk up considerably. Konnor signaled to one of the referees on the arena floor, an alpha he knew casually. The man moved over to the side of the stands and Konnor bent over to shout down to him. With all the noise of the crowd, he felt fairly confident that the pups across the floor couldn’t hear him. “I’d like you to watch my pup closely when he gets in the ring. I’ve examined him carefully, and I’m almost positivehe’s an omega. If any of the others get too excited and overly aggressive with him, he could get badly hurt. I doubt he would make any attempt to defend himself.”</p><p>The referee’s eyes widened in surprise. “Are you sure? We haven’t had an omega come through in a long time.”</p><p>“I’m almost positive. My brother concurs with my evaluation, and the Ruling Council has already been notified it’s a distinct possibility.”</p><p>The other alpha nodded. “All right then. I’ll watch him, and if I think anything’s about to happen to him, I’ll pull him out.” He turned to look at the group of young men. “Which one is he? ”</p><p>Konnor pointed at Ethan. “The blond in the back.”</p><p>The referee turned his head a bit to regard him. “Nice. I wouldn’t mind bidding on that once he’s properly trained.”</p><p>Konnor felt his hackles rise, but he forced his voice to remain calm, with only a slight growl tingeing his voice, even though inside him his wolf was raging at the other alpha, ready to tear out his throat. “If you pull him, bring him to me.”</p><p>The referee went back to his post and Konnor was glad to see the games were beginning. The three Lycan pups who had been initially identified as alphas came out against the four betas first. As Larssen said the day before, alphas were always easiest to pick out. In their shifted form, they were usually the largest, most aggressively feral ones on the field.</p><p>None of the pups had weapons of any kind, using only their fierce claws and teeth against each other once they’d shifted. There was the usual posturing and a couple of fights broke out, but it didn’t take long for all three alphas to be confirmed. Mostly the combatants circled each other, growling and threatening, until the weaker pups lowered their heads and bared their throats in submission. Once this happened, the officials took the stronger Lycans from the ring and the ones left faced a new batch of opponents. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Next, the betas went up against the gammas, and Konnor leaned forward nervously. The gammas came out into the ring, and immediately shifted into their wolves. Right away, Ethan stuck out like a proverbial sore thumb. He was smaller than the other gammas and his coloration was completely different, but the most telling sign was his nearly complete lack of aggression. When any of the betas approached him, Konnor was instantly on the alert, ready to signal to the referee to step in, but it wasn’t necessary. Ethan’s wolf immediately sank lower than the beta, never quite dropping to his knees, but making his submission plain by offering his throat. Three of the betas satisfied themselves with biting his snout and then contemptuously turned their backs and walked away. One, slightly more aggressive beta wasn’t happy until he forced Ethan to his knees, but he didn’t make any attempt to follow it up with a further attack.</p><p>The betas were taken out of the ring, and it was then that Konnor noticed the two gammas left in the arena with Ethan. They were circling him, snarling fiercely, while Ethan tried to keep an eye on both of them and failed miserably. As they circled him, they bit at his flanks and one swiped a lethal claw at his head. Ethan was on his knees by this time between them. Konnor was on his feet and running down to the floor of the arena before he could stop himself, his fangs and claws dropping as he ran. Just before he completed his shift though, he saw that both alpha referees were on their way and would make it long before he did. One of the referees knelt beside Ethan, speaking to him urgently, while the other alpha sent the two gammas cowering out of the ring.</p><p>Forcing himself to calm down, he was aware of Larssen beside him, also partially shifted. Konnor knew that if he’d gone into the ring, he wouldn’t have been alone, not that he needed any help against the cowardly punks. Konnor made a mental note to see about arranging a garbage scow apprenticeship for both gammas. The referee stayed beside Ethan while he shifted back and then took his arm to lead him from the arena as Konnor watched, wanting badly to get his hands on the boy.</p> <p>Larssen clapped a large hand on his shoulder. “He’s okay, little brother. They have him now.”</p><p>The referee was bringing him out. Konnor watched as the big alpha leaned down to speak to Ethan and Ethan looked up at him in confusion. The referee waited while Ethan untied his protective harness and handed it over. The other pups who had gone behind the fences now were all staring at him and talking among themselves, and as he noticed, his cheeks turned pink. Naked, he followed the referee back across the ring. His cheeks turned an even brighter shade, and Konnor knew it cost him to expose his body in front of so many onlookers. It was killing Konnor too.</p><p>Konnor calledto the alpha he’d spoken to earlier, and he changed courses, signaling for Ethan to wait for him, and headed toward Konnor.</p><p>“I’ll take him. He can go with me now to get his bags.”</p><p>“Have you received the appropriate permission from the council?” the referee asked.</p> <p>“Of course,” Konnor snapped, impatient to get his hands back on his pup.</p><p>The alpha nodded and motioned for Ethan to join them. He came over quickly, glancing up once at Konnor before lowering his head again as if he couldn’t bear to meet Konnor’s gaze.</p><p>The referee showed Ethan the small door to enter the stands and then left as Ethan began to climb up the steps to reach Konnor. He came to stand on the step below Konnor, his head respectfully bowed. “Y-You wanted to see me, sir?”</p><p>Konnor took off his shirt and handed it to Ethan. “Here, Blondie, put this on.”</p><p>Ethan’s head shot up. “Have I done something wrong, sir? The other alphawouldn’t tell me what was happening. Did my wolf not do well in the challenges? ”</p><p>Konnor shook his head impatiently. He longed to comfort the boy, but this was neither the time nor place to get into this. Instead, he made his voice firm as he told him, “Take the shirt, Ethan and cover yourself.” The boy looked crestfallen, hurt, even bewildered, but he nodded obediently and quickly put on the shirt.</p> <p>“Sir?” Ethan shifted his gaze up to search Konnor’s face. “Can you tell me what happened in the ring? OnceI shifted, I...”</p><p>Konnor remembered this was only the second time he’d shifted. Sometimes an inexperienced pup had problems remembering exactly what went on during the shifts, their minds overpowered by their beasts. He may not have realized he was almost mauled by the gammas.</p><p>He took Ethan’s bags from his hand and held onto them, afraid they were too heavy after what he’d been through, and surveyed the smaller figure. The shirt was long enough on Ethan to cover his genitals, coming to the top of his thighs. It would have to do until he could get him to the ship. The strong protective urges he was having were playing havoc with his nerves, and he longed to take his hand, but knew Ethan wouldn’t appreciate approached, glancing at the young man standing in front of Konnor.</p><p>“Are you, uh, ready to go, little brother?”</p><p>or understand it. Larssen</p><p>“More t han ready.” Konnor turned toward Ethan. “Ethan, the determinations have been made. You’ll be going with me.”</p><p>The boy cocked his head. “With you? But I don’t understand...am I going into an apprenticeship w-with you, sir?”</p><p>“Um, in a manner of speaking, yes. We’ll talk more about it when I get you to my ship. You’ll be traveling with us to Lycanus 3.”</p> <p>“Yes sir,” he said, nodding slowly. Before he lowered his gaze again, Konnor caught a flash of some strong emotion. Konnor dreaded the coming confrontation on his ship when he would explain to Ethan exactly what was going on. He just hoped Ethanwouldn’t be too distraught. He motioned for Ethan to precede him, watching the sway of his hips as he walked slowly toward the dressing room for his suitcases.</p><p>Chapter Three</p><p>Inside the small dressing area was a scene of chaos. Ethan had always hated a noisy crowd of people, and he was still feeling confused by what was happening. He had almost no memory of what happened in the ring, and he hoped he had acquitted himself well. He must not have done too badly if Konnor wanted to apprentice him. He hugged his excitement to him and turned to look at the big alpha. He and his brother were easily the largest, most handsome men in the room, and exuded power and confidence.</p><p>The nine other young Lycans inside were laughing and talking excitedly, putting on their clothes and gathering their things. Most of them looked up and stopped talking as Ethan and the two alphas, Konnor and Larssen, entered the room. A few of the bolder ones, looked as if they wanted to say something to him, but their glances shied away again at the forbidding look on Konnor’s face. He seemed almost angry, like he was daring them to say something. But what? Why was everyone looking at him like he had suddenly sprouted wings or something? One of the boys actually seemed contemptuous of him, flaring his nostrils as he sneaked a glance. Uneasy, he wondered again just what had happened in that ring.</p><p>The room was already clearing, and their presence seemed to be the catalyst for everyone else to take off. Ethan walked over to get his bag and looked up at the alpha trustingly, thinking perhaps he would explain why no one seemed to be able to speak to him or meet his gaze, but he didn’t. Instead he seemed to be anxious about something. Unusual for alphas, who were arrogant enough to always act as if they had no need for anxiety about anything. Balenescu, though, actually shuffled from foot to foot in seeming unease for a moment, as Larssen looked up at the ceiling or down at his communicator, anywhere but directly at Ethan.</p><p>“They’ve sent a message that the paperwork is ready,” Larssen said. “I’ll go get it and be right back.” Konnor nodded and rested a hip against a table in the room. Once Larssen closed the door behind him, his eyes flickered up at Ethan. “He’ll be back in a half hour or so, Ethan. You can rest here until then.”</p><p>Sighing, Ethan nodded and sat down on a bench to wait. He wanted to question his alpha about what was happening, but he didn’t quite have the nerve. The other boys had told him Balenescu was a bounty hunter. Surely the council didn’t think such an apprenticeship would be a good fit for Ethan. Or was there some other reason he’d been assigned to the Balenescus? To teach him piloting skills maybe? He wouldn’t mind that job. He’d always hungered to travel around the galaxy and see new worlds. Perhaps they thought that Konnor could show him the confidence he would need as an adult on his own? Konnor and his brother certainly had an abundance of that.</p><p>Actually, a part of him didn’t really care. He was secretly thrilled to be here with the man he considered to be his alpha. It seemed like a dream come true, and he wondered with a little thrill if he’d be allowed to service him again sexually. He’d never done anything like it before, but the time he’d spent with Konnor in the judging chamber had been beyond wonderful. He knew Lycan males didn’t normally like to have sex with other Lycans, but maybe his alpha would make an exception. Ethan realized he had a huge crush on the alpha and that it probably wasn’t reciprocated, but he didn’t care. Just the opportunity to be around Konnor and be trained by him for the next few months was exhilarating.</p><p>He realized with a little start that he was still wearing only Konnor’s shirt, and got up quickly to dress himself again, carefully folding up his alpha’s shirt and offering it back to him. He took it and shrugged it on carelessly, his eyes never leaving Ethan’s face. His gaze was so intent, it was making Ethan really uncomfortable.</p><p>He felt an overpowering urge to drop down to his knees, but instead he lowered his eyes and sat quietly, hoping his alpha would speak to him and answer some of his questions. In surprise, he heard the door close and the lock snick into place. Balenescu had gotten up to lock the door. He came and sat back down beside Ethan on the bench, and Ethan glanced over at him nervously.</p><p>“I can see you have a lot of questions. Is there something you’d like to ask me, Blondie? ” Ethan blushed at the strange nickname the alpha was calling him. He’d never had any kind of nickname before, and wasn’t totally sure he liked this one. It didn’t sound very manly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I...uh...will you train me to be a bounty hunter, sir?”</p><p>Konnor looked surprised. “A bounty hunter? No, Ethan.” He ran a big hand over his face and took a deep breath. “I need to explain some things to you, and I need you to listen carefully. I was going to wait until I got you on the ship, but I don’t like to see you looking so lost and worried. You need to listen to what I have to tell you and not get excited. Can you do that for me? ”</p><p>Ethan nodded and then remembered his alpha liked him to answer him out loud. “Yes, sir, I can do that.”</p> <p>“Good. Blondie, do you know what it means to be...omega?”</p><p>Ethan glanced up at him sharply. “Omega? You mean a defective?”</p><p>His alpha shook his head firmly. “No, they’re not defective. They’re simply submissive. It’s unusual for a Lycan, but they do exist.” He reached for Ethan’s hand and held it firmly in his. “With what happened in the ring today, and from my examination...Ethan, you’ve been found to be omega.”</p><p>Shocked, Ethan’s first impulse was to pull his hand away sharply, but Balenescu refused to release him, pulling him back down beside him.</p><p>“No!” Ethan yelled, surprised at the sudden feelings of outrage and shame that washed over him. “I’m not omega!” He tried again to pull away, frantic to escape this room, escape what the alpha was saying.</p> <p>Omegas were weak and unintelligent. They were useless for anything except the most menial work. Some of them, the better looking ones, were taken as love slaves, doomed to a life of sexual subjugation. He looked around wildly for someplace to run from this. To hide from what the alpha was saying. He was pulled down to the bench instead and the alpha held to his biceps, forcing him to sit still. “Settle down. You can’t run away from this. You’re omega, and you have to deal with it.”</p><p>Ethan’s eyes filled with scalding tears that spilled down his face. “But that means you all think I’m stupid! That I’m a mental defective. I’m not! I’m not!” He tried desperately to break hisalpha’s grip, misery flooding his body. “Gods, I’ll be sold as a slave! I couldn’t stand that. I’ll kill myself first!” He made a grab for the gun the alpha wore strapped to his thigh, getting a hand on it before Balenescu knocked it away and gripped bothof Ethan’s wrists in his hands.</p><p>“If you don’t want to be thought mentally defective, stop acting like it! Do you really think you can get this gun away from me? That I’d let you hurt yourself? Settle down, now, or I’ll put you down myself.”</p><p>Ethan’s adrenalin was churning through him and making him ill. He sagged in despair. He raised his gaze to his alpha, who was almost nose to nose with him. “Please,” he whispered frantically, not sure what he was begging for. To be told it was all a mistake? To be put out of his misery?</p><p>“There’s nothing to be so upset about,” the big Lycan said gently. “I’ll be taking over your training, and nothing at all will happen for at least a few months. After that, we’ll have to come back here for an auction, but Idon’t want you to worry about it. Leave it all to me. I’m taking care of things.”</p><p>Ethan barely heard anything he was saying to him. A few months? So he was to be given a kind of reprieve, a few months to be with the handsome Konnor before being sold as a slave for the rest of his life. For what? A sudden thought struck him and he glanced back up in horror. For sexual training? So he would be one of those pathetic sex slaves? That’s what this was all about then. The handsome man in front of him, the one he had such a huge crush on, was about to become his...master.</p> <p>This couldn’t be happening to him. He shook his head in misery, remembering the look of contempt on the other pups’ faces when he came into the room.</p><p>“Have you calmed down some now so I can explain?” Konnor’s voice was gentle, and Ethan nodded slightly. Konnor stared down into his face for a moment and finally released him.</p><p>Right away, Ethan stood up and began backing toward the door. He had to leave this room. He had to get somewhere safe so he could think about what to do.</p><p>“Ethan,” Konnor’s voice was stern. Normally it would have frozen him in his tracks, but he was so sunk in abject misery, his only thought was to get away, to leave this room and this man who was saying things he never thought he’d hear about himself. “What the hell are you doing now? Sit down.”</p><p>He kept moving slowly backward, his thoughts a jumble in his head. He was omega...a defective...no wonder his parents had abandoned him when he was a baby. They must have known what he was...what he would become, and couldn’t bear to live with the shame.</p><p>Konnor stood up and took a step toward him. “Blondie, get back over here and sit down. Let me explain things to you.”</p><p>Explain? Explain what? How his life would be a series of degrading acts from this point on? How he would belong to someone, forced to perform whatever depraved sex acts they might wish him to for the rest of his life? No, death would be much better. He took another step backward, and Konnor came at him with an outstretched hand. Before he could even think about what he was doing, Ethan’s hands shot out and he pushed as hard as he could against Konnor’s chest. The big alpha, taken off guard, stumbled backward. He would have recovered had it not been for the sturdy wooden bench behind him. The backs of his knees hit the bench and he went over backwards, wedged between the bench and the lockers.</p><p>Seizing what might be his last chance, Ethan turned and sprinted for the door. He had it unlocked and open in seconds and was out the door and running down the hall, hearing crashing sounds behind him. As he reached the end of the hallway, he turned a corner and ducked into a side corridor that led to another exit. Instead of going out the door, he slipped into a closet beside it, desperately fighting to still his breathing. He was in some kind of janitor’s closet, surrounded by mops, brooms and bottles of chemicals. Quickly he opened one of the bottles and dumped it on himself, hoping to disguise his scent. He knew he had only seconds before the alpha would sniff him out otherwise.</p> <p>Hearing Konnor’s shouts in the corridor, he shrank as far as he could back against the mops and brooms, praying the alpha would think he’d made it outside and look for him there. His luck held as he heard the outside door slamback against the wall, and the sounds of the alpha’s voice fade a little as he ran outside, calling his name. Acting quickly, before Konnor figured out the ruse, Ethan slipped out of the closet and ran back down the corridor the way he’d come. He’d seen another exit when he’d been brought into the arena area. If he could somehow reach it in time, he might be able to make good his escape.</p><p>His luck held, and he didn’t pass anyone in the hallway as he hurtled through, searching for the other exit. When he found it, he cautiously made his way outside, looking around him for any sign he’d been spotted. The large crowd of spectators was still leaving the stadium over on his left, so he ran toward them and shoved his way in among them. He received a few outraged glances as he jostled his way into the heart of the throng, but no one seemed to pay him much mind. He lowered his head as much as he dared, knowing that his bright blond hair would stand out among all the others, and he fearfully shuffled along with the slow-moving crowd.</p><p>When he finally got outside the stadium, he felt a moment of exultation. He’d made it. He was free. Then reality slammed back into him. Free to do what? To go where? That Konnor and the other officials would be after him, he had no doubt. His freedom would be short-lived unless he could somehow find his way off this planet. He turned his feet toward the only refuge he knew—the only person who might take him in and tell him what to do. He had to make it back home before it was too late.</p><p>“Damn it !” Konnor slammed his hand down on the table in front of him, rage and frustration almost choking him. “He couldn’t have just disappeared! Someone has to be helping him hide, and if I find out who, I swear to the gods...”</p><p>“I know you’re angry, but this isn’t helping,” Larssen said sternly. Konnor slanted a glance over to him. He wanted to shout and rail at him, but he knew Larssen was right and only trying to help. They were in a bar near the city center, having had a late supper. For the past week, they’d spent every day searching for Konnor’s mate, scouring the city, and had come up empty handed. Konnor was almost frantic with worry and self-loathing. Why had he not waited until he had Ethan safely aboard the ship before he told him that he was omega? If only he hadn’t looked so lost and confused sitting on the bench in the dressing room. Konnor had wanted to take away some of the hurt he’d seen in his eyes by explaining to him that even though he was omega, he had nothing to worry about. Konnor was his mate and would always care for him and protect him. He never got a chance to tell him any of that. Ethan had exploded in rage and fear when he told him he was omega, taking off out the door before he could explain further.</p><p>Konnor blew out a long breath. “I know you’re right, but I feel so damned frustrated. Lucas was waiting on us, counting on us to get back home for that shipment over a week ago. Now...”</p><p>“Now Blayde has cut short his trip and come home to take over. Lucas understands, Konnor. Everyone does. We all know you have to find your mate.”</p><p>Konnor glanced up into the steady eyes of his older brother. He didn’t know what he would have done without his support and help over the past week. “I have to find him, Lars. If I don’t...”</p><p>“You will,” Larssen said firmly. “Now let’s go over it one more time. Is there anything we’re missing? Any friends or acquaintances who might be helping him hide? ”</p><p>Konnor shook his head. “According to the doma in his group home, he was a loner. No real friends or buddies he hung out with. He seemed to gravitate toward the younger children, she said.”</p><p>“And he helped her out a lot, right? Didn’t she say he worked around the home, helping her in the kitchen?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes...”</p><p>“So, in effect, the doma herself was the one he was closest to, the one he went to with his problems, maybe?”</p><p>“Yes, she seemed protective of him, in a way. She said she thought we might have made a terrible mistake, that he was just sensitive, and that she’d never thought he was omega. She said she hadn’t seen him since the day he left, though.”</p><p>“Still, the thing about us making a mistake was kind of an odd thing for a doma to say, I thought. Most of the domas who run the homes are strong gammas, not exactly known for their overabundance of compassion or deep analytical thinking.”</p> <p>“You think she could have been hiding something? Trying to throw us off track?” Konnor looked up eagerly, anxious to latch onto any lead.</p><p>“I think we should definitely speak to her again. I think she may know more than she’s letting on,” Larssen said. “This time, why not let your alpha take over just a bit? You can be pretty intimidating when you do. Hell, sometimes you scare the shit out of me.”</p><p>Konnor permitted himself a slight smile, but leaned forward eagerly. “You really think she was hiding something, then?”</p><p>“I didn’t at the time, but the more I think about it, who else would Ethan have run to for help? He was with her at that group home for along time, wasn’t he? ”</p><p>“A couple of years...” Konnor’s head came up. “She’s the closest thing to a friend that he has. He probably trusts her. Of course, he went to her.” He jumped to his feet. “Let’s get out of here. I have a gamma I need to choke the truth out of.”</p> <p>“Okay, but calm down,” Larssen said, getting to his own feet and throwing some money down on the table. “You can’t very well beat the information out of her, despite that look on your face. Remember, she may have thought she was helping him.”</p><p>“If she helped him, she was breaking the law, and she knew it.”</p><p>“Well, maybe she thought of him as kind of a son...”</p><p>“Son, my ass. I doubt she would have risked hiding him because of compassion. As you said, gammas aren’t known for it. No, there had to be something in it for her. Some kind of profit. She could have sold him to one of the slave brokers and made a lot of money. A Lycan omega is rare and valuable, and one as beautiful as Ethan would fetch a high price. Besides, she didn’t strike me as the overly maternal type. C’mon, Larssen, if she’s hurt him in any way...”</p><p>“Settle down. They wouldn’t have hurt him; he’d be too valuable to them. If he was sold, they’d have to give him some training first, and that would take some time. A trained Lycan love slave is worth much more to them. But first we have to find out if we’re even on the right track. Maybe we’re just grasping at this idea because it’s all we have.”</p><p>“Maybe, but it feels right. I don’t know why I didn’t think of it before, except I haven’t been exactly thinking straight since he ran away from me. Let’s get to her before she goes to bed for the night. Not that I wouldn’t enjoy pulling her big ass out of it.”</p> <p>They left the bar and quickly caught a land transport to the northern city limits, where Ethan’s group home was located. The lights were still on downstairs as they got out of the transport, asking the driver to wait for them. Konnor stormed up the path and banged on the door until it was pulled sharply open by the large woman inside, Doma Helga. She narrowed her dark, surprisingly long-lashed eyes when she saw the two alphas at her door and stood with her large body blocking the entry.</p><p>“Alphas,” she said, barely nodding her head. “To what do I owe this pleasure at this time of night?”</p><p>“The time an alpha chooses is none of your concern, mistress,” Konnor said in a gruff tone, pushing past her to step inside. His eyes roamed the entryway, and he sniffed suspiciously, trying to pick up any recent scent of Ethan. Nothing but cooking smells and the doma’s own sour, unwashed odor came back to him, along with the faint scents of her young charges upstairs. No sweet, delicious scent of his mate.</p><p>He could hear the woman berating Larssen behind him for the late hour again, and he turned and took hold of her arm. “We have questions for you, Doma, on the disappearance of Ethan Capraru. Stop your complaining and show us to a seat.”</p><p>She cast him a hard, resentful glance before lowering her gaze, but not before Konnor noticed a hint of naked aggression in her gaze. If this was a gamma, she was the most quarrelsome one he’d ever seen. She almost presented herself as alpha, but what in the world would an alpha be doing in a job like this? Of course, if she was a predator, what better position to be in to take advantage of innocent children? The thought made him ill, and he resolved to talk to the authorities about the woman as soon as he left here, regardless of the outcome.</p><p>The last time he’d been here was right after Ethan’s disappearance, and he’d been so distracted and upset, her odd attitude hadn’t registered on him. Now she was making him apprehensive and doubtful.</p><p>Motioning them into a small parlor, she stood back and allowed them to enter in front of her and be seated as custom dictated. She came in behind them and perched on the edge of a chair, staring at them almost resentfully, and again, not respectfully dropping her gaze in the least. Konnor got the feeling she’d much rather challenge their right to even be in her home, definitely not gamma behavior.</p><p>Before Konnor could say anything, Larssen leaned forward. “Doma Helga, has Ethan Capraru contacted you in the last few days since we saw you?”</p> <p>She blew out an impatient breath. “No. I would, of course, have contacted someone in the Ruling Council immediately had that happened.”</p><p>“Would you?” Konnor asked in a deceptively mild tone.</p><p>“Of course!” she snapped back at him, again challenging him with her gaze. Konnor stared back at her, holding that gaze until she flushed, her coarse olive skin turning a dusky purple shade, and finally dropped her head.</p><p>Konnor stood up and leaned over her chair, his face only inches from hers. Up this close the sour smell registered not only as sweat, but fear. What was she so frightened of? “I think you’re a liar, Helga. A fucking liar.”</p><p>At that, she raised her head and snarled at him, her red eyes darkening and her fangs dropping down. Konnor allowed his fangs to drop from his gums too, and he leaned even farther forward, right in her face now, his saliva dripping on her broad bosom.</p><p>“You challenge me, bitch?” Konnor’s voice had deepened as he entered his partial shift. She didn’t back down, though. Instead she pushed up on his chest and almost managed to push him aside. Konnor was younger and stronger, though, and easily managed to control her, putting a huge hand around her throat and forcing her head against the back of the chair. By this time, Larssen loomed over her as well, his own beast coming out a bit at the threat to his brother.</p><p>Her eyes flashed from Konnor back to Larssen and she slumped in defeat, lowering her eyes and offering her throat. “Don’t hurt me,” she cried out. “I don’t know where the boy is!”</p><p>“And like I said before, you’re a fucking liar. Tell me where he is or I’ll rip off your head and stuff it down your throat. You sold him, didn’t you? Tell me, damn it! ”</p><p>She hesitated for another instant, and then seemed to give in. “All right,” she snapped.”I’ll tell you, but let me up.”</p><p>“Not a chance, bitch,” Konnor said. “If you tell me, I might let you live, but I make no promises beyond that.”</p><p>Her eyes widened in fear. “What is he to you? Why do you want to find him so bad?”</p><p>Larssen spoke up beside her. “Ethan is his mate. If you know anything about alphas, and I’m beginning to suspect you do, you know a Lycan alpha, especially a Balenescu, will never stop searching until he finds his mate. And he’ll kill anyone who gets in his way without a second thought. When he gets like this, I can’t control him. If you know where he is, you have about five seconds before he tears you apart.”</p><p>“All right! I’ll tell you!” Her face was turning an even more alarming shade of deep purple, so Konnor let the pressure up slightly, even though his wolf was clamoring at him to kill her.</p><p>“You’re right. I did sell him to my sister on Europa, the pleasure moon of Jupiter. She runs a high-end establishment there,and she wouldn’t allow anyone to hurt him. He was happy to go! He wanted to get off this planet as soon as he could before you found him. If he had listened to me in the first place, he never would have met you. He’d have been sent to my sister long ago.”</p><p>“You sent him to a brothel!” Konnor shifted completely and only the quick thinking of Larssen, who threw himself over the matron’s body prevented Konnor from ripping her apart.</p><p>“Calm down!” Larssen yelled at him. “We have to find out exactly where he is! If you kill her, she can’t tell us anything.”</p><p>Helga’s eyes were shifting back and forth between the alphas, looking for an advantage. Konnor leaned over her again. “Tell me where he is.” He could barely get the words out of his mouth with it so full of extra teeth. His voice sounded more like a ferocious growl than actual words.</p><p>“On Europa, like I said. In The Pleasure Palace. That’s the name of her place. It’s very popular—anyone can direct you once you arrive. You can contact her online too. She probably has his ad up by now...”</p><p>“His ad?” Larssen broke in.</p><p>She glanced nervously over at him. “He’s being trained, I assume, before she sells him to the highest bidder. She’ll post an advertisement for him before he actually goes up for sale.”</p><p>Konnor raised a horrified and tortured gaze up to his brother, who clasped his shoulder. “At least we know now where to look. We’ll find him, little brother, I promise you. We won’t rest until we do.”</p><p>Konnor released the doma and staggered back away from her, the bile rising in his throat. Europa...one of the most decadent destinations in the galaxy, and his sweet man was there being trained. Other hands were touching what belonged only to him. He fell back on the sofa behind him, sick and distracted by the images going through his head. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Europa, one of the six moons of the planet Jupiter, was covered in a layer of ice, but years ago, it had been colonized by the Alliance and underneath the ice they had found liquid oceans, full of oxygen. Alliance scientists were fascinated by the amount of life they found in the oceans and built science stations beneath the ice, where they explored the oceans for many cycles. The huge underwater complex had been abandoned after a while and for almost a hundred cycles it lay empty, until an enterprising group of businessmen purchased it from the Alliance and made it into a recreational destination. Bars, hotels, clubs and brothels soon sprang up, free of the much tighter restrictions on Earth. It was a place where anything went, a rough and dangerous place where even a big Lycan like Konnor would be afraid to go alone. The idea of his sweet mate in that den of iniquity made his stomach clench with fear.</p><p>Chapter Four</p><p>Ethan stuck his hand in the bucket of hot, sudsy water, thinking about Konnor, just like he had for everyday of the past two weeks since he’d run away from his handsome, perfect alpha. He sighed and watched a teardrop fall from his face into the sudsy water, knowing he had no one to blame but his own stupid self. He had been in such a panic when he first ranthat he hadn’t stopped to really think things through, and now he found himself in his current mess, and he had a feeling he wasn’t getting out of this one nearly as easily. He was stuck doing menial chores, like today, scrubbing the floors on his hands and knees, instead of learning a trade like he’d been promised. Worst of all, he was doing it all on camera.</p> <p>He had to be naked while he did his chores, with cameras catching every move he made as he scrubbed away at the wooden floor, his ass in the air and his dick swinging under him as he moved back and forth with the large brush. He had a whole series of these little jobs he had to do while Mistress Katya’s film crew got it all on camera. Things like washing windows, cleaning toilets, and doing dishes, all while he was naked and wearing a slave collar. Later they would splice it all into a film advertising him for sale. The film would show not only Mistress Katya putting him through his paces as a submissive sex slave, but also his value as a decorative domestic slave. Mistress Katya had been confident this combination would raise his price considerably.</p><p>Within minutes of his arrival on the moon Europa, Ethan suspected he had made a horrible mistake, and had jumped from the cooking pot into the fire. He thought about how his life might have turned out had he not run away from his alpha. The gorgeous Lycan would have trained him at least, like Mistress Katya was doing now. How much more pleasurable it would have been if Konnor Balenescu had been his master. The only saving grace for him so far was that his mistress was not sexually attracted to men at all, so while she made it look as if she were being serviced by the handsome young omega, there had been almost no real sex involved. She did let her servants handle him frequently, but there had never been any penetration, only embarrassing intimacy that made him cringe. That would, of course, all change once he was purchased. Then his new owner would be able to use him any way he liked.</p><p>As he continued to scrub at the floor, the director yelled at him to tilt up his chin, straighten out his body more and push his ass up higher in the air. Meanwhile, he was freezing on this cold floor, despite the hot water. In fact, the water was cooling off at a rapid rate, and he was then left soaking and shivering so the director could get the shot he was looking for.</p><p>Finally, the director yelled cut, and his mistress, who had been watching him came over and snapped a leash to his collar, pulling him to his feet. “Come, boy, you have a potential buyer coming to see you tonight. I want you to be ready for him. I think I’ll put you through your paces once more today before I’ll let you go and get some rest. This buyer has very deep pockets, and I’m hoping you’ll please him.”</p><p>Ethan nodded, keeping his eyes on the floor like Mistress Katya had taught him. His training had begun almost as soon as he arrived on Europa. Katya had met the transport and clipped the slave collar on his neck as soon as she saw him. When he looked at her in shock, she struck him across his cheek. “Don’t look me in the eye! How impertinent. A good slave never looks his master or mistress in the eye unless he is invited to do so. And stop pouting! You belong to me now, Ethan, and don’t forget it.”</p> <p>He wa sn’t given much chance to forget. Using pain sticks to control him, she also whipped him that night, and for several nights after that, not because he had displeased her, but because she said she was training him to endure pain. She never broke his skin, of course, because she said she didn’t want to lower his price, but she raised welts on his sensitive back and buttocks and even on his penis and scrotum. He wondered if this was what his life was to be from this time on. If it was, he’d have to find a way to kill himself and end it. For now, he was watched like one of the predatory birds on Randgus 7 by his mistress and the men who worked for her. She called them her boys. At night, Ethan was tied in his bed until he was released the next morning. One day began to fade into the next, a haze of pain and humiliation, until he could sometimes go for long periods of time when he was not completely aware of his surroundings. It was like a small world he’d created for himself, one that was infinitely safer than reality. Sometimes, he would be there, looking at Ethan with his smoldering wine-colored eyes. Those were the best times, the ones he looked forward to the most. If only he could stay in that world forever.</p><p>“Ethan, stop daydreaming ! We have very little time to prepare you before the new buyer comes. Now present yourself!”</p><p>Ethan struggled to arrange his body the way she had taught him. “Is this how I’m supposed to be, Mistress?”</p><p>Katya looked his body over carefully. His feet were wide apart, his shoulders squared, and he had his hands clasped behind his back. His blond head was bent over, his eyes lowered demurely to the floor. “Very nice, Ethan. Stand up just a little straighter,” she tapped his thigh. “Good. That’s how you should stand if I tell you to present yourself, but you can look up at the client just a bit. Some masters don’t like their submissives to make eye contact, but put your chin up. You have quite pretty eyes, so you’ll have to gauge what your master wants to see. Always start with your eyes firmly on the floor, and you may look up through your lashes if he asks you to.”</p><p>Ethan felt the heat of a blush on his cheeks.“Will this buyer bid on me tonight, Mistress?”</p><p>“If he likes what he sees, I expect a bid, yes. But he is very sophisticated in his tastes. That’s why he’s coming personally to see you. He will expect perfection, and I expect you to give it to him.”</p> <p>“I’ll try my best, Mistress.”</p><p>“See to it that you do.” She walked over to sit down, dragging Ethan behind her and puffing a little. Katya was fat, her figure having long passed the point where euphemisms like plump or overweight could be used to describe her. Big rolls of flab cascaded down her body, pooling at her ankles, and she was no longer able to walk without a cane. The electrified cane served a dual purpose, doubling as a pain stick. She wore a platinum blonde wig piled high on her head and falling to her shoulders in ringlets. Her dresses were all sequined, as if she were about to go onstage somewhere. She wore black, pointy-toed shoes that might have looked attractive with a higher heel. Hers were flat, however, because high heels hurt her feet and there was no way she could walk in them. She used the pointed toes to her advantage though, digging into Ethan’s body with them when he displeased her.</p><p>She threw a pillow on the floor beside her and tapped the floor with her cane. “Down on the floor, boy.”</p><p>Ethan quickly sank to his knees beside her chair, his hands behind his back and his right hand holding his left wrist. His back was straight and his knees apart. Again, his eyes were firmly on the floor. He had practiced this stance the most because at first he’d had a hard time staying on his knees for any length of time. He was able to do it now for over an hour after having practiced it so often. He had learned the trick of letting his mind sink into that other world he’d created for himself while he was on his knees, the one where nothing hurt him.</p><p>His mistress had also taught him how to walk at heel or on a leash. He’d spent one whole day walking behind one of her boys at the end of his leash, stopping when they stopped, starting up again when they did, all while never raising his eyes from the floor. He had learned the trick of watching their feet, and predicting when they were about to take a step or come to a stop. It didn’t take him long after he learned that every time he failed or stumbled, he got a stripe on his ass from a whip the man was holding.</p><p>Katya signaled for a servant to bring her a dish of fruit and she practiced feeding Ethan. He had been taught to be careful never to touch his master’s fingers with any part of his mouth, but merely to allow the food to be placed on his tongue before he swallowed it. His head was to be lowered at all times in this position and he was not to make eye contact unless his master allowed it. Of course, it went without saying that he had to swallow every bite put on his tongue, whether or not he liked it.</p><p>After she’d practiced with him for a few bites, she sighed and glanced down at the digital display on her wrist. “Well, I suppose that’s as good as we can do. Some masters don’t like their pets to be too well-trained, in case they have ideas of their own. Go and get a nice hot shower, and I’ll be in later to check you and get you ready.” She gripped his hair in her hands and brandished the pain stick at him. “I need this sale, Ethan. If he doesn’t buy you after tonight, I can promise you that you’ll be very sorry.”</p><p>“Yes, Mistress,” Ethan whispered, and she gave him one final menacing gaze before she released him. “Go. Make yourself presentable. He’ll be here in two hours.”</p> <p>One of her boys came for him, jerking his leash impatiently and led him to the preparation room. He unsnapped the leash and gestured toward the shower, already bored by his assignment to watch Ethan until Katya arrived to inspect him. Knowing what was expected of him, Ethan stepped into the shower and turned on the water as hot as he could stand it, before using the floral scented soap Katya preferred to wash his body. He was careful to scrub himself all over, using the removable shower head and a rough sponge to clean his backside carefully. That would be the first place Katya would inspect when she returned, so he had to be squeaky clean or she would direct one of her boys to clean him again. Ethan’s cheeks burned at the memory of the last time she’d subjected him to such a thing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He applied the soap to himself all over once more and used the razor to carefully remove any trace of body hair. Lycans actually had surprisingly little body hair in their humanoid forms and Ethan, like other Lycans, found it unattractive anyway, so he didn’t mind this part of his daily ritual. He rinsed himself carefully then and finally turned off the hot spray. Drying himself off, he stepped to the mirror and inspected his hair. It was longer than he liked, but Katya wouldn’t let him cut it. Instead he applied some of the hair products she kept on hand and scrunched up his curls with his fingers like she’d taught him. By this time, he could hear her loud, strident voice in the other room, squared his shoulders and went out to face her.</p><p>“About time you got here, boy. Come over here and bend over. Let me look at you.” The omega came over to her quickly, perhaps knowing the consequences of a slow response. When she got nervous like she was now, she sometimes lost her temper, and had been known to use the pain stick on her charges repeatedly. Since the last time she’d lost her temper with this boy, though, and he’d passed out, she had been more careful. He was too valuable to damage in any permanent way and too frequent use of the pain sticks had been known to cause nerve damage.</p><p>She inspected him carefully as he bent over in front of her and satisfied, she grunted at him to kneel in front of her and raise his face. She’d brought in some of her makeup to use on him. He had naturally pink lips and cheeks, but a little enhancement never hurt. First perhaps, a little kohl for his eyes. She had thought about permanent tattoos but some buyers didn’t care for it, though with this boy, it would have been striking. Those red, glowing eyes would have looked beautiful with permanent eyeliner. Sighing, she settled for a thick layer of kohl around his eyes and then applied a pink lip-gloss to his lips. She signaled for a servant to bring her a platinum slave collar to put around his neck in place of the plain one he was now wearing. The platinum looked good against his skin, and besides, she always added the cost to her bottom line, with just a little extra for profit. It was little enhancements like these that earned her repeat business.</p> <p>The blond in front of her should bring in enough to keep her bottom line nice and healthy for a long time to come. A Lycan omega was a rare commodity and almost never became available to the general public. She’d actually been surprised when it was a Lycan who’d contacted her about his purchase, a very rich, very powerful Lycan at that. He would have had access to bid on omegas on his home planet, but as he told her on their holo-cam conversation, omegas were exceedingly rare, and he’d been after one for a long time. He would be coming in person soon to inspect this one, and she felt confident he would make the purchase. After all, the omega’s blond hair was pretty and most unusual, and she had trained the beautiful boy herself.</p><p>The omega was quite malleable, really, and in only two weeks’ time, she had done won ders with him. Of course, he was an omega, so he was born to serve.</p><p>One of her servants came to whisper in her ear that her visitor had arrived and was most impatient to get negotiations started. Anxious, was he? She automatically jacked the price up a few thousand diamond standards. She didn’t dare go higher than that, as the boy was already at the top price for a slave as it was. She didn’t want to queer the deal. She glared down at the boy, who was kneeling at her feet. “Stand up and bend over the table.”</p><p>The boy got to his feet on shaky legs and she pulled the anal plug from her pocket. It wasn’t a large one, but her clients liked the boys to be ready for them. She applied a little lube from a tube in her pocket—wouldn’t do to forego its use and injure him just before his buyer had a chance to look him over—and inserted the plug inside the boy. His entire body turned red, and she gave him a slap on his butt and laughed. “Still able to blush after all you’ve been through? You really were a find. I’ll have to send Helga a thank you gift along with her percentage.” Katya heaved herself to her feet and went to meet the Lycan. If things went as planned, by the time this night was over, she’d be a great deal richer.</p><p>She entered the waiting area where the Lycan was, and was surprised to see two huge men in the parlor. Her eyes darted back and forth between them until one of them stepped forward.</p> <p>“Mistress Katya? My name is Konnor Balenescu, and I’ve come for the omega.”</p><p>“Have you now?” she said, permitting a small smile to turn up the corners of her mouth. “He’s certainly for sale, if we can come to an agreement.”</p><p>Something savage peeked out of the Lycan’s eyes for a moment and Katya took an involuntary step backward. So, his beast was close to the surface. This one could be dangerous. She clutched her pain stick closer and her thumb slipped down to the switch on the side of the cane to ratchet up the intensity, just in case.</p><p>Right away, the other Lycan came forward and put his big body between them. “Thank you, Mistress. I’m sure an agreement can be reached. Money is no object if the omega meets my brother’s needs.”</p><p>Katya peered around the man in front of her to regard the one who called himself Konnor. She cleared her throat nervously. “Of course I meant no disrespect.” She lowered her gaze. It had been a long time since she’d been in a room with two alphas. “I’ve had several bids on him so far, but no one besides you has been willing to meet my price.”</p><p>She spoke directly to Konnor Balenescu. “Did you watch the video ad on the young omega while you were waiting? We’ve only just completed it, but I think it turned out quite nicely.”</p> <p>Konnor’s lips tightened. “Yes. We watched it.”</p><p>“Delicious, isn’t he? I particularly enjoyed watching him scrub the floors, that pert little ass up in the air. Very tempting, yes? ”</p><p>Konnor pushed his brother impatiently out of his way. “Is he...untouched? Has anyone else had him? ”</p><p>“Well, not quite,” she said. No one, including Katya, had ever had sex with him at her establishment. Katya herself had no interest in men, so other than putting him through his paces with whippings and the like, she’d not so much as touched him sexually. However, most of her clients liked a boy with experience, so she lied. “He’s not exactly a virgin, buthe’s barely broken in,” she said with a laugh that she’d been told sounded surprisingly young. “He confessed he had one small adventurebefore he came into my hands,” she said. “So, sincehe wasn’t a virgin and most of my clients appreciate a boy who knows his way around a bedroom, I took the opportunity to teach him a few morethings...”A low growl began in the Lycan’s throat and she glanced over at the other nervously. “Of course, if he won’t suit you, I can find you a virgin.”</p><p>“No.” The word was accompanied by an emphatic shake of the head. “He’s the one I want. When can I see him? ”</p><p>“Right away, of course. My, you areeager, aren’t you? I’ve arranged for you to have some time alone with him, just in case you’d like a small sample of his charms. Or perhaps both of you...”</p><p>“No!” The single word spoken with great intensity came from both of them almost in unison. She glanced up in surprise, and Konnor shook his head. “No thank you. My brother will stand watch outside the door, however. I...wouldn’t like to be disturbed.”</p><p>“Certainly. No one would dream of disturbing you, no matter what...um...noises should come from the room. Your privacy is most important here. Feel free to take as much time as you like with him.”</p> <p>The big Lycan nodded grimly, and Katya led them down a short corridor to the room. “You can wait in here and I’ll fetch him.”</p><p>She turned her back and went down the hall to get the boy. Katya had been off Lycanus 2 for many cycles, and she’d almost forgotten how intense Lycan alphas could be.She’d be glad to make this deal and get the boy off her hands. These two made her nervous.</p><p>Ethan’s knees were shaking as he walked down the hallway at the end of his leash to enter the room where the potential buyer was waiting. Mistress Katya led him, jerking impatiently at the chain when he let his nerves get the better of him and stumbled. She pulled him to the door where someone was sitting quietly in a chair by the door. He kept his eyes firmly on the floor in front of him ashe’d been ordered, but he could hear a slight gasp come from whoever sat watching his approach.</p><p>“Yes, he’s quite beautiful, isn’t he ? One of the nicest specimens we’ve had to come through in a long time.” The other person merely grunted his assent and Mistress Katya used her knuckles to rap on the door.</p><p>It swung open and she led Ethan inside. “Here he is, sir. I’ll leave you alone with him to get acquainted. Take your time and just come find me when you’re ready.” She turned to Ethan. “Present yourself, boy.” She unsnapped his collar and stood back. Ethan took his position in the middle of the room, afraid to look up and see who his potential buyer might be. He was standing like Katya had taught him, legs apart, shoulders back, chin up, but eyes focused on the floor. A chill breeze swept into the room and over his naked skin, causing goose bumps to rise on his flesh. The damned anal plug Mistress Katya put in him was giving him an uncomfortable feeling of fullness and every few steps down the hallway it had jostled against some secret place inside him that gave him a pleasurable jolt. How could he possibly get pleasure from such a thing? He really must be as depraved and defective as Mistress Katya told him he was.</p><p>“Oh, I forgot to tell you,” Mistress Kat ya said on her way out the door. “His name is Ethan, though he’ll answer to whatever you want to call him.” The door closed softly behind her.</p><p>Another long moment passed and then a deep, rumbling voice spoke up from across the room. “I think I’ll call you...Blondie.”</p><p>Ethan’s head shot up at the name, and he almost fainted from shock. It was his alpha, Konnor Balenescu standing not five feet away from him, his handsome face frowning as he gazed at Ethan. “K-Konnor...” he said softly, taking a half step toward him. Konnor’s next words, though, stopped him in his tracks. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“It’s Masterto you, boy, and don’t you forget it again!”</p><p>Ethan hissed in a shocked little breath, confusion and fear flooding him as he gazed at Konnor. This wasn’t the kind alpha he remembered. This man was fierce and angry looking, his beautiful red eyes glowing dangerously. He crossed the room in two steps and took hold of Ethan’s chin roughly, tilting his head up toward the light. “What’s this shit on your face?” he snarled, and rubbed at his bottom lip contemptuously with his thumb. “What have you let them do to you?”</p><p>He dropped his hand and turned away, as if he could no longer bear to touch Ethan or look at him. Ethan was almost in shock. To have endured so much over the past two weeks and now to be so close to his alpha again. He had dreamed of this moment so many times,and he’d tortured himself over and over at his stupidity in running from him. Konnor was right here in front of him, but he had given Ethan a look of such repulsion and disappointment that it was like a physical pain in Ethan’s heart. Fear gripped him. What if he so disgusted his alpha now that he turned around and left him here? Terrified, he reached for Konnor, putting a hand on his arm.</p><p>“Konnor...Master...please...”</p><p>A spark seemed to leap between them at his touch and with a snarl on his lips, Konnor backed Ethan up to the wall. When he could go no further, Konnor slammed both hands on the wall beside his head and bared his teeth at him. “You were mine, damn you. Mine. And you ran from me.”</p><p>Ethan flinched at the anger in his voice and opened his mouth to speak, but before he could say a word, Konnor lowered his mouth to take possession of Ethan’s. He was surprisingly gentle at first, running his tongue over Ethan’s lips.“This was mine.” He nipped at his bottom lip and Ethan gasped, opening to him. His tongue delved inside his mouth and swept over it, making Ethan weak in the knees.</p><p>Ethan couldn’t be this close to his alpha without touching him one more time. He slid his arms around Konnor’s waist and held on tightly. Konnor moved his big body so it was pressing against every inch of Ethan’s. “You were mine,” he murmured against his lips. “Why did you leave me?” He pulled his head back and stared searchingly down into Ethan’s eyes.</p><p>“I-I was afraid,” Ethan said. “I didn’t want to run from you.”</p><p>“But you did,” Konnor said almost viciously, putting one hand around Ethan’s throat. “You left me and now you’re...” He looked down at Ethan’s bare body. “You’re like this.”</p><p>He hauled him closer, crushing their mouths together. At the same time he tightened his grip around Ethan’s throat, ever so slightly, until Ethan couldn’t breathe, trapped against his alpha’s unyielding body and the solid wall behind him, he had nowhere to go to get away from the pressure on his throat. He relaxed his body, giving into it, not fighting it. Death at Konnor’s hand was much preferable to staying here and living like this. Black stars had just begun to dance behind his eyes when Konnor loosened his grip,and Ethan’s legs gave way.</p><p>Konnor’s arm behind his knees scooped him up, and he carried him to the bed. Ethan’s eyes fluttered open,and he looked up into Konnor’s face, poised right over his.</p><p>“From this moment on, you belong only to me, do you understand? I’m your alpha, your master. For now and always. You’re mine, damn you.”</p><p>Ethan’s eyes shone up at him. “Yes, alpha. Yours...I belong to you.”</p><p>“Fuck yes, you do,” he growled, and took Ethan’s lips in a fierce kiss that may have been meant to punish him, but though it was hurtful and harsh, it was also fucking wonderful and made his toes curl up.</p><p>“I’m going to mate with you now, Ethan,” Konnor murmured against his lips. “No matter what you are, I have to have you. I’m giving you my knot, and you’ll belong to me forever. Forever, and no one will dare lay a hand on you again.” Despite the harsh words, Konnor lowered his gaze and took a deep, shuddering breath, as if he tried to calm himself. His next words were surprisingly gentle. “Is that...is that what you want?”</p><p>“Y-yes,” Ethan said softly, his throat choked with emotion. He wanted this so much. This beautiful alpha wanted to own him, to possess him, and Ethan would belong to him forever. He yearned for it so much he began to tremble. “I want you, Master.”</p><p>Konnor pulled away from him, but only for a moment. Ethan saw him fumble for something on the table by the bed. He found a tube of lubricant and turned Ethan over on his side. When he hesitated, Ethan looked at him over his shoulder and his lips tightened again. He touched the anal plug with a curse and then pulled itfrom Ethan’s ass and threw it across the room. Coating his fingers with lube, hecircled Ethan’s entrance, keeping eye contact with Ethan as he stared at Konnor over his shoulder. At the first touch of the cool lube as it entered his body, Ethan tensed. But when he looked into the eyes of his master, he relaxed again. He trusted Konnor—his alpha—totally. He tried to completely relax his body as the finger probed inside him, further stretching him. Even though the plug had stretched him some already, the burn of Konnor’s fingers made him jump a little. Soon Konnor was whispering in his ear.</p><p>“Move your leg up. Push out, baby. That’s it.” And the burn lessened when he did. More lube and two more fingers, and he felt impossibly full, but he’d seen his mate’s dick. Had sucked it in his mouth, so he knew how large it was. He really didn’t think it would fit, especially if he gave him his knot, but he would try anything to please Konnor. He wanted to be able to do this for his master. He’d already disappointed him so much.</p><p>Concentrating only on relaxing his body and pushing out as hard as he could, he was surprised to feel an amazing sensation as Konnor’s probing fingers found a spot inside him that lit him up like a torch. It was the same spot the plug had touched, but this was Konnor’s fingers. He felt like he was on fire and moved restlessly under his master’s touch. It hurt, but it felt so good all at the same time</p><p>Konnor leaned down close to his ear and his breathing was fast and unsteady. Ethan saw that Konnor’s fangs had dropped, filling his mouth, and Ethan knew instinctively that he was having a hard time controlling his beast. “I’m going to bite you, Ethan.” He groaned into his ear, sending a little thrill of excitement down Ethan’s spine. “It may hurt at first, so hang on.”</p><p>Konnor sank his fangs deep into the side of Ethan’s throat, and the pain at first was terrible. Ethan gasped and would have pulled away, but his master clutched him tightly around the chest, not letting him move. Then as the venom spread through his veins, he found himself writhing, not in pain, but in ecstasy. A powerful orgasm racked his body and his cum shot from his cock, splashing on his chest. He screamed and threw back his head so that it restedon Konnor’s shoulder. At the same time his orgasm hit, Konnor thrust into his hole, hard and fast and deep.</p><p>He screamed again, and the scream became a howl. He realized that his howl was mingling with his mate’s, creating a chilling primal sound in the small room. Before he could even register the pain of being impaled on Konnor’s cock, his master took Ethan’s cock in his hand and began to pull the foreskin up and then push it back down rapidly. He’d never felt such exquisite torture. The spot inside him that Konnor touched was also being rubbed up and down, causing him to arch backward for more, but the pressure on his cock made him want to thrust forward. He didn’t know which way to go, and it was driving him crazy.</p> <p>He knew the knot would tie them together for long time, and he didn’t think he’d be able to stand much more. The venom was racing through his veins, making him hot all over. He broke out in a sweat as he felt another orgasm coming on fast. He couldn’t stop it, and it was too much sensation, too intense. He felt Konnor’s orgasm flooding him, the hot cum spilling out and running down the back of his thighs. Then he was falling into a deep, black pit and he cried out for Konnor to save him.</p><p>“Let go,” he said, his voice deep and rumbling. “I’ve got you.” Ethan sank down into the darkness, and he wasn’t afraid, because he wasn’t alone. His master had him, and he’d never be alone again.</p><p>Konnor opened the door to the room and motioned for Larssen to come in. He’d been dozing in the chair by the bed for some three hours now, and he rose stiffly, looking around him. His gaze swept the hallway, but no one seemed to be stirring. It was well past midnight.</p><p>Larssen stepped inside and Konnor closed the door after him. Larssen glanced toward the bed where Ethan seemed to be fast asleep, covered in a blanket so only the top of his head was showing. Larssen leaned against the door frame and smiled. “Well, did you show him who’s boss?”</p><p>Konnor frowned at him. “Very funny. I mated with him...it’s done.” Larssen’s eyebrows rose . “Already? I thought you might wait until we got him safely to the ship.”</p><p>Konnor glanced back at the bed. “I couldn’t wait any longer. I didn’t mean to...”He sighed. “I couldn’t wait.”</p><p>Larssen put a comforting hand on his brother’s shoulder. “Is he all right? I must admit I was shocked when I first saw him in the corridor.”</p><p>“He seems all right. He’s not injured anywhere, physically. I can only imagine what he’s been through.” His face tightened in anger. “Damn it, if he’d only listened to me instead of running off like he did.”</p><p>“Should I call the old bitch and give her the money for him?”</p><p>“Yes, may as well. It might be better if I don’t see her again. I wasn’t sure I could hold onto my temper after she told me she’d broken him in.” He fairly spit the last words out of his mouth, and Larssen knew him well enough to know his stomach must be churning at the thought of the creature with his sweet boy.</p><p>“Yes,” Larssen agreed, a little smirk on his lips. “I thought I was going to have to break up the fight. Don’t be hard on Ethan for it, though, Konnor. He couldn’t have helped what she did to him.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know that. I’m trying, but all I can think of is that creature with her filthy hands on him. It makes me...” He dropped his head into his hands, and Larssen nodded sympathetically. Part of the curse put on the Balenescu family so long ago by his greatgrandfather’s concubine was that when it came to their mates, the brothers were almost irrationally possessive and jealous. He’d already seen his cousins Blayde and Nikolai going through it, and neither of them had to experience this much provocation. He was worried about his little brother, who had an uneven temper at best, and had always been the most dominant, controlling member of the family when it came to his lovers.</p><p>Clearing his throat, Larssen nodded toward the bed. “Do you want to get him ready to go? I’ll go make the final payment so we can get the fuck out of here.”</p><p>Konnor nodded and as he walked toward the bed, Larssen slipped out to go search out the madam. She couldn’t be far away. Walking down the long hallway toward the reception room, he thought of the moment he’d first found her website.</p> <p>After they got the information they needed out of Doma Helga, they had contacted the authorities and stayed with her to make sure she didn’t get away. Not only did they want to make sure she wasn’t left alone with the children under her care, but they wanted to make sure she didn’t warn her sister.</p><p>Konnor had made her give him the website information, and he used his personal comnet device to look it up. They found the graphic pictures of Ethan right away, some of which even made Larssen’s stomach clench in sympathy and fear for the boy. Konnor was holding on by his fingertips.</p><p>Larssen contacted Mistress Katya and began the complicated negotiations, demanding that no one else be allowed to sample the boy and promising they would match and exceed any other bid that came in for him. When he’d read her quick reply, he could almost hear the calculations running up in her head.</p><p>They’d left the same night, anxious to get to Ethan as quickly as they could. Still Konnor had paced the floor of the comm deck practically all the way.</p><p>Larssen came into the parlor as Katya called the reception area and pressed a button on the desk. Within minutes, Katya arrived, her face looking even more swollen and puffy than usual, having been dozing, apparently.</p> <p>“Well, has your friend decided? Will he take the boy?”</p><p>“Yes, he will,” Larssen said shortly. “Do you have the final invoice ready?”</p><p>She pulled it from her pocket and pushed it at Larssen. “Here it is. I trust it meets with your approval?”</p><p>Larssen glanced down at the exorbitant price that she’d jacked up as high as she could in the past few days they’d been negotiating. He saw the addition of the platinum collar at a price that was truly excessive. It didn’t really matter what price she was asking. They would pay it and get Ethan out of there. The Alliance had already been notified of what was going in her high-end establishment, as Helga had called it, and were set to raid her and shut her down just as soon as the Lycans gave the signal that their people were clear. All of the money would be returned to his family eventually.</p><p>Larssen counted out the diamond standards in her hand and she nodded with satisfaction. “He’s all yours, or I should say your friend’s. Are you quite sure I can’t offer you some little distraction? I have a nice selection of love-slaves, even a few humans that are nice. Very tempting...”</p><p>“No thank you,” Larssen said firmly. He was happy that the Alliance would be rescuing these tempting humans soon. He had little doubt that Katya had acquired most, if not all of them, nefariously.</p> <p>He heard a noise behind him and saw Konnor standing in the hallway, his lips set in a grim line. He had Ethan, still wrapped in the madam’s blanket, in his arms, Ethan’s head resting on his shoulder, his big eyes filled with fright as he caught a glimpse of Katya before he nuzzled his face into the hollow between Konnor’s neck and shoulder. Ethan was a big boy, but Konnor didn’t seem to feel any strain as he carried him to the dock. Larssen knew Ethan was still suffering the effects of the venom and must be running a fever by now. It would only last a few hours, but would leave him weak and shaky.</p><p>They had to take a small, submarine vehicle to the surface of the moon and once they emerged, the small group walked over the completely enclosed ice bridge, complete with breathable atmosphere, to their waiting ship. Their ship was tethered to the dock by means of a sleeve to protect them from the extreme temperatures and thin atmosphere on Europa as they entered or exited the ship. Once they were safely inside, with the sleeve retracted, Konnor carried Ethan up to his room while Larssen detached from the dock and made preparations to take off. Within a short time, Konnor joined him and they navigated the ship away from the moon and into orbit around Jupiter. Only then did Larssen notify the Alliance they could move in.</p><p>A couple of hours later, after setting a course for home, and learning that Katya and her employees were taken into custody with little incidence, Larssen sat back and regarded Konnor carefully. “You have to put this behind you, Konnor, and stop brooding about it. Ethanwasn’t running away from you, so much as he was running from being an omega. That title has come to mean something very degrading to Lycans, and with good reason. Most Lycans believe omegas are second-class citizens. There are Lycan rights groups that have denounced the Ruling Council’s actions toward omegas, but public opinion hasn’t changed. People still consider them to be mental defectives and good only for the most menial jobs. Not to mention using the goodlooking ones for sexual slavery. Who wouldn’t run from that?”</p><p>“You think I don’t know that, Larssen?” Konnor said quietly, staring at the screen on the comm deck where the stars were flashing past them. “I’m angry at myself for letting these emotions get the better of me, for blaming him for something that wasn’t really his fault. Once he was in Katya’s hands, there was nothing he could do. I know that, and I want to forgive him. Hell, even that word isn’t right. It wasn’t his fault so there’s nothing to forgive. But how could Ethan run from me? I keep coming back to that.” He turned his head to gaze over at his brother. “He’s Lycan, so he had to feel the mating connection between us, even if he didn’t know exactly what it was he was feeling. Yet he ran from it and never looked back. Hell, he might still be running if this hadn’t happened to him. Sure, he was glad to be rescued from that creature, but was that all it was? Was he even happy to see me?”</p><p>Larssen stretched out his legs and shrugged. “You’re sounding a little like a girl, here, bro. A bitchy one at that.”</p><p>Konnor gave a surprised bark of laughter. “Yeah, I guess I do. I know what I should do. Put the whole thing behind us. I have no choice in who I feel the mating call for. We’re mated now, and it’s a done deal. I know that. But I feel so damned...wounded. I know it’s stupid, and it’s stemming from this ridiculous jealousy the curse foisted on us. But every time I think of him on his knees to that woman... On her fucking leash! I can’t get the image of her having sex with himout of my head, and I can’t help but think of him as damaged goods.”</p><p>A small voice behind them made Larssen jump in surprise. “Is that what I am to you, Konnor? Damaged goods? I can’t imagine why you tied yourself to someone who was both damaged and defective. Is it so you can be thought of as a kind of martyr the rest of your life? Poor Konnor. His mate was an omega, you know. He had to take him on because he had no choice.”</p><p>Konnor’s face was a mask of guilt and shock. He stood up and took a step toward Ethan, who wore what looked like some of Konnor’s old clothes. He backed away with his hands raised in front of him. “No, it’s good that I know the truth. You can’t help the way you feel, I suppose. No, please!” he said, as Konnor made another move toward him. “Please let me think about this for a little while. I don’t want to be this weight around your neck, Konnor, but I’m kind of trapped too, so I need a few minutes to work this out in my mind.” He turned to go back below decks. Just before he reached the door he stopped, his back still toward them. “Please give me a little time, Konnor, before you come down. I know this is your ship, and I don’t have any rights, butI’m begging you...it’s all I ask.”</p> <p>He went out the door and Konnor threw himself back down in his chair, lifting a tortured gaze to Larssen. “What can I do now, Lars? How could I have fucked this up so totally? Basically, he heard me say, yeah, Ethan, you’ve been kidnapped and degraded and forced to have sex with that fat bitch, but hey, you haven’t suffered enough yet to make my ego feel better about it. Let me rub your nose in it for the next thirty or forty years. Let me tell you how worthless you are. Gods, Larssen! I’m a bigger monster than Katya is! He’s going to hate me forever.”</p><p>Chapter Five</p><p>Ethan lay on his back in the tiny room, staring up at the ceiling. He had awakened earlier from a troubling sleep and felt the strong urge to be with his mate. His fever was gone, and his stomach ached a little. He’d heard the stories about how Lycans trained their mates, and knew the stomach pain usually meant that the less dominant mate—definitely him in this case—felt as if his partner were upset or angry with him. It was a potent side effect of the venom in the mating bite, but he’d always thought he’d have to worry about not hurting his own mate. He never dreamed he would be the one being trained. Ethan knew only too well that Konnor felt anger toward him. He hadn’t hidden the fact, and this was no doubt where these feelings were coming from.</p><p>He got up, disentangled himself from the blanket Konnor had wrapped him in, and shuffled over to the closet to see if he could find something to wear. He didn’t think Konnor would mind if he wore some of his clothing until he could get some of his own. The few things he’d had were taken from him when he’d arrived on Europa and he’d never seen them again.</p><p>After rummaging around, he found a pair of pants that almost fit and an old, worn sweater, stretched and soft from too many washings and still smelling a little like Konnor. All of Konnor’s shoes were way too large, but he found a pair of thick socks and then made his way out into the corridor to try to find Konnor and Larssen. He figured they would be on the comm deck, and since the ship really wasn’t too large, he thought he’d be able to find it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He heard the voices before he got to the deck and when he heard his name, he stood very still just inside the door to the comm, and listened to what was being said. The words that came from Konnor’s mouth didn’t shock him, really. He had a feeling that was what Konnor was thinking all along, but it did hurt. Badly. His stomach started the cramping immediately, and the pain was steadily growing. He had to find a way to stop it soon, but for now he just didn’t have the energy.</p><p>What could he do? He couldn’t leave, even if he wanted to. He was on a ship, for the gods’ sake, in the middle of who knew where. Besides, though he didn’t care so much about himself, it would hurt Konnor physically, because of the damned mating bond, and he didn’t want that. His actions had caused him enough pain already.</p><p>When the idea came to him, it seemed so simple and so obvious he should have thought of it right away. Ethan was omega, so he would simply be the best omega slave anyone ever had. Katya had trained him well. He’d overheard Konnor say that Katya had sex with Ethan, and it simply wasn’t true. She’d never touched him in that way, and he wondered what she’d said to Konnor to make him think she had. It didn’t really much matter. She had still degraded him and made him unworthy to be the mate of an alpha. He touched the heavy platinum collar around his neck that Konnor had never removed. She had also trained him well to be a love slave, and that would have to be his new role with Konnor.</p> <p>He wouldn’t tie Konnor down with any demands as a mate . That would be wrong, considering how Konnor felt about Ethan. But if he were to act as his love slave, he could still keep Ethan close by, and thus avoid the physical pain it would cause them both, and yet he wouldn’t be tied down by him. He would be free to be with other lovers and if he found a person he could fall in love with, he could simply keep Ethan on the side for occasional sex and take the other person for his true mate.</p><p>That’s what a lot of Lycan males did with their love slaves . They were usually mated and took the slaves when their wives were too tired or just didn’t want sex so often anymore. A love slave ensured they could then satisfy the strong Lycan male sex drive and keep their mates happy at the same time.</p><p>The only flaw in his plan was Konnor himself. He knew that Konnor would never agree, because he would never want to hurt Ethan. No, his only chance was to make Konnor think it was what Ethan wanted, to make him think Ethan didn’t care for Konnor in the least and would be happier making their arrangement strictly a master-slave arrangement. If Konnor wished, he could even let his brother, cousins and friends use Ethan. It would kill Ethan for that to happen, but if thatwas what would make Konnor happy, then he’d find a way to go along with it. Besides, if Konnor liked to play at the clubs that catered to masters and their submissive slaves, then he could show Ethan off and participate in public displays. Konnor might enjoy that. Yes, he thought it was a good plan, but first he had to get Konnor on board and not have him hesitate out of some misguided feelings of pity. His disappointment in Ethan and his hatred for him would be better than his pity.</p><p>He got up off the bed and slowly started to remove his clothes. Eventually he would need the leather thong that loveslaves wore on Lycanus, but for now, he’d leave on just the underwear he’d borrowed from Konnor. It was brief and tight-fitting. And his collar. The collar was a nice touch and would let Konnor know what he had planned. After taking everything else off and hanging it back in Konnor’s closet, he sat on the bed and waited for Konnor to come in.</p><p>Konnor felt terrible about Ethan overhearing the conversation he had with Larssen, and he didn’t know exactly how to make it better. Of course, he knew he had to apologize, and he planned on doing that now, but how could he get Ethan to believe him again when he told him being an omega was nothing to be ashamed of? He was such a damned hypocrite. And the feelings he had didn’t really stem from the fact Ethan was omega. Well, not much, anyway. Old habits and ways of thinking really did die hard, it seemed. But his feelings really stemmed from the fact that Ethan had rejected him and run from him, right into the hands of people who robbed him of his innocence. The sweet innocence Konnor loved so much about him. Squaring his shoulders, he put his hand on the button that would allow entry to his room. He would go inside and make up with Ethan and apologize for his stupid remarks, and Ethan would forgive him. He had to.</p> <p>Opening the door, he was surprised to see Ethan sitting on the side of the bed wearing only a pair of Konnor’s underwear, and that damned collar. “Ethan, baby?” Konnor stepped further inside the room and Ethan turned a cool, distant face toward him.“You were wearing some of my things earlier. What happened? Didn’t they fit well? I can try to find you something else to wear.”</p><p>“Don’t bother . As soon as we get back to your home, you can buy me some of the leather thongs the love slaves wear on Lycanus.I’d prefer that, actually. It clearly denotes exactly what I am.”</p><p>Konnor took a deep breath and tried to calm himself. “Ethan, I know you’re angry over what you thought you heard...”</p><p>“I’m not angry. What you said were your honest feelings, and you can’t hide the way you really feel. I’d be insulted if you tried. No, it’s better to get everything out in the open between us, so there won’t be any misunderstandings in the future.”</p><p>“Ethan—”</p><p>“No, please let me have my say, sir. Please hear me out, and then ofcourse, I’ll abide by whatever you decide.”</p> <p>Konnor leaned against the door and narrowed his eyes. What was going on in that head of his? Konnor nodded, and motioned for him to go ahead and speak.</p><p>“Thank you. As I see it, we’ve both been put in a very awkward position by the urge for us to be mated. I felt the attractiontoo, right away, but I didn’t think it was possible for a powerful alpha such as you to be mated to someone like me. I only really became aware of the mating urge after I ran away, but I did feel it too, and missing you made me really miserable.” He glanced up at Konnor to see if he had any comment. When he simply gazed back at him, he continued.</p><p>“So here we are in the middle of this thing, and I know you’re feeling trapped—”</p><p>“Ethan—”</p><p>Ethan held up a hand. “Please sir, you promised to let me have my say.”</p><p>Konnor blew out a harsh breath, but he nodded again. “Well, then, spit it out, Blondie.”</p><p>“I’m trying, sir. I only see one way out of this for both of us, and I hope you’ll agree to it.”</p><p>“You see only one way out, huh? And what might that be? And why would it entail you being almost naked on my bed?”</p> <p>“I’m trying to get to it, sir. I’m an omega and destined by fate to be a love slave. There’s no way around it, and I’ve tried to run from it and we both saw how that turned out.”</p><p>“Mmm, so we did.”</p><p>“So I have a proposal for you. Treat me as your love slave, as your submissive. I’ve been well-trained. Mistress Katya even gave me pain training with whips and canes.” He glanced up at the small sound like a growl that came from Konnor, but nervously, he kept going. “I’m a very good slave, sir, and I’d make you a fantastic submissive. I can let you off the hook as far as treating me like a mate. I know you don’t want to be tied down to someone like me. You’re an alpha,and I’m the lowest rank possible, an omega. I understand that. AndI don’t want you for a mate either.”</p><p>Konnor, who’d been about to interrupt this load of crap, suddenly straightened up at that last comment. “You don’t want me as your mate?”</p><p>“No, sir. What in the world would I do with an alpha as my mate? You’re very handsome, but I can’t deal with all the drama, frankly, and I wouldn’t feel equal to the task of being around your alpha brother and all your alpha cousins. I’d constantly feel the strain and it would make both of us unhappy. No, I don’t love you, and I never could.”</p><p>Konnor felt his cheeks growing warm. “You don’t love me. And you’d be unhappy as my mate?”</p><p>“Oh, yes, sir, I would. And you needn’t sound so hurt about my feelings for you. I know very well that you don’t love me. I mean, how could you? You barely know me, really, and then there’s the rank thing. There may be some less dominant, less powerfulalphas who wouldn’t make me feel like a second class citizen, but I’m sorry, sir, you’re just not one of them. I’d always know you felt embarrassed by me as your mate, and that wouldn’t be good for either of us.”</p><p>“I see...”</p><p>“So I can be your love slave. I’d be happier that way, and then if you meet someone and fall in love with them, you’d be free to make them your mate. No one would ever have to know I’m your real mate. I’d certainly never tell anyone. You can keep me around so you don’t get physicallyill, and I wouldn’t interfere in any way.”</p><p>Konnor looked down at his feet. He was so angry, he had to be careful not to explode and choke the shit out of his mate. “And what about you, Ethan? What if you fall in love with someone else?” He was very proud of how even and calm he’d kept his voice. Only the crumbling woodwork under his fingers would give him away, so he shifted his body to stand in front of it.</p><p>Ethan shook his head. “I don’t ever expect to fall in love, sir. I imagine you’ll keep me busy with plenty of sex, though...” He angled a glance over at Konnor. “If you’d like me to service your brother and your cousins, I could do that.”</p><p>The wood on the frame came apart in his hands. “Service them?” he asked in a voice only a bit higher than his normal tone.</p><p>“Yes, sir. I’ll do whatever you tell me to do.” He stood up and came over to where Konnor stood at the door, dropping fluidly and gracefully to his knees in front of him. “I’d like to service you now, sir, if that’s all right.”</p><p>Konnor nodded, unable to speak past the sudden lump in his throat. His damn balls were drawn up so tight that it could be them half choking him. Ethan’s graceful, long fingers soon unbuttoned his trousers and slid them down his hips. His warm lips engulfed Konnor, and on the upward stroke of his tongue, he ran it over the long vein throbbing up the length ofKonnor’s shaft. Konnor made an involuntary cry of pleasure, his knees so weak he had to lean heavily against the woodwork. Ethan bent to his task, taking Konnor’s shaft deep in his mouth. Ethan’s lips were stoking a fire in Konnor’s blood. He cupped Konnor’s balls in his hand, kneading them and massaging as Konnor arched into him. He slid his tongue down farther, taking each of his balls in his mouth and even lapping his tongue across his hole. Konnor pinched his eyes shut and held on as Ethan moved back up to suck the head of his cock, swirling his tongue over it again and again. He nibbled gently at the head, and Konnor’s cock became even more huge, and harder than he thought possible. When Ethan licked a longstripe up Konnor’s cock, looking up at him wickedly through his eyelashes, Konnor had enough. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grasped Ethan’s hair in his hands and made him keep still while he began to slowly thrust into his hot mouth, slow, steady strokes that took them both to the edge. Time seemed to stand still, and he could have been here forever, slowly thrusting into the velvety soft, hot as hell mouth. Konnor was so close, and then Ethan made a little move with his tongue that took him over the edge completely, his hips bucking and his mouth opening to let out a long, feral groan of pleasure.</p><p>Ethan swallowed every drop, and then sucked and licked to clean up, even holding Konnor’s softening cock in his mouth until he pushed him gently away. Konnor’s voice sounded rusty and hoarse even to him as he spoke breathlessly. “I don’t even want to know where you learned to do that. Don’t tell me.”</p><p>Ethan gazed up at him sadly, and whispered, “Yes, sir.” He sat back on his heels and waited for Konnor to move. Finally Konnor pulled up his pants, tucking himself back in. Still a little breathless, he put a hand on Ethan’s cheek, rubbing his thumb over it for a long moment. Then without another word, he turned and left the room.</p><p>“Well, did you get things straightened out between you?” Larssen asked.</p><p>Konnor eased himself down in the chair next to Larssen and shook his head. “Not exactly. H-he wants me to treat him as my love slave .”</p><p>“What?”</p><p>“He has it all figured out. He said he knows I can never love himbecause he’s just an omega</p><p>and I’m an alpha, and never the twain shall meet, or some such shit . He would only embarrass me, blah, blah, blah, and I would be miserable. So since he doesn’t want me either, because I’m a high-maintenance alpha and it would keep him under a strain always trying to keep up, he will just be my love slave, which will, of course, free me up to find someone else. Oh, and I can give him to you and the cousins too, andhe’ll service you whenever I want him to.”</p><p>“ What?”</p><p>“Don’t keep saying what like that. I’m telling you what the man said.”</p><p>“What did you say?”</p><p>“Not too much. It’s kind of hard to talk when he’s got his mouth wrapped around my dick.” “Okay, too much information. Tell me the part again where he’s going to service me.” “Not if you want to keep breathing.” Konnor gave his brother a dark look, and Larssen held</p><p>up his hands in front of him.</p><p>“I’m joking, little brother. Sorry. But seriously, what are you going to do?” “Well, I’m not going to let him walk around in a leather thong like he wants to, unless we’re alone, of course. And I’m not going to take any other lovers or allow him to either. And I’m definitely not going to let him be my damn love slave. He’s my mate, and he needs to get over all this shit and act like it.” Konnor flopped back in his chair and crossed his arm over his chest. “If I’d known he was going to be this much trouble, I might have given some thought to just leaving him with that woman, I can tell you that.”</p><p>“No you wouldn’t, so don’t even t ry to lie about it.” Larssen said, smiling. Konnor made a rude noise and stared straight ahead, not giving an inch.</p><p>“Do you remember when we were little kids and we’d go over to our grandmother’s house?”</p><p>“What in the fuck has this got to do with anything?”</p><p>“I’m trying to make a point here, just work with me. Do you remember?”</p><p>“Of course I do, but what does this walk down memory lane have to do...”</p><p>“I’m getting to it. I was older than you, and you remember grandmother lived with our other Nana. Nana was her human concubine, did you ever know that?”</p><p>Konnor shrugged. “I guess so. I don’t know. She was just Nana to me.”</p><p>“Right. Well, she used to tell us those human fairy tales. But after a few years, I decided I was way too big to listen to those stories of hers about princes and elves and all that. I told her that I didn’t want to hear any more of them.”</p> <p>“Yeah, so?”</p><p>“So I knew right away I’d made a big mistake. Thereyou’d be, sitting in her lap, getting all the attention as she told you those dumb stories. She’d pat your hair and whisper in your ear, and I thought I’d die from jealousy.”</p><p>Konnor was staring at him Larssen now, his eyes narrowed. “So what’s the connection?”</p><p>“Don’t you get it, Konnor? Ethan is telling you he wants to just be your love slave, your concubine, and that he wouldn’t mind if you fell in love with someone else. I, for one, don’t believe a word of it. I don’t think he’d like it at all, and I think if you tried to take another lover, it would kill him. He’s your mate, and the mating connection goes both ways.”</p><p>“So you’re saying I should make him jealous?”</p><p>Larssen shrugged. “No, but I’m saying take him at his word. Treat him a little like a submissive slave. Maybe flirt with other attractive men. Call his bluff. It’s what he asked for, after all. Let him try it for himself and see if he likes it.”</p><p>Konnor laughed. “I think I like this. I don’t want to flirt with any other men, but if he wants to be my slave, how can I disappoint him, huh?” He stood up and rubbed his hands together. “Sometimes you really do get just exactly what you’ve been asking for.”</p><p>Ethan was still sitting on the side of the bed when Konnor came back in. He was afraid he’d said too much, especially when he lied and told him he didn’t love him. That was such an obvious lie he must know it. Hell, he’d dropped to his knees and sucked his cock the first time he ever saw him. When he heard Konnor at the door, he immediately, dropped to his knees and assumed the position Katya had taught him, hands behind his back, knees apart, eyes lowered respectfully. Konnor’s feet moved into his line of sight, and he simply stood there for a long moment.</p><p>“Kiss my boots, Blondie.” Startled by the request, Ethan raised his head and looked up at his mate. Konnor’s lips were set in a firm line, and he looked down at Ethan with a stern expression. “Did I tell you to look at me, slave?”</p><p>“N -no, sir. Sorry,sir,” Ethan said, quickly lowering his gaze. He could feel his cheeks burning. Well, this was what he asked for. It looked like Konnor was giving it to him, all right. He bent his head and pressed his lips chastely to each of his master’s boots. When Konnor continued to stand there, Ethan reminded himself he promised to be the best love slave ever, so he bent to this new task. He kissed all the way up each boot, and then licked his way back down. It helped that Konnor’s scent was strong, and it was really making Ethan excited. He spent a long time sucking a little wrinkle of leather into his mouth around the ankle and licking his way back down to the toe. He glanced up under his eyelashes and saw a distinct bulge in Konnor’s pants.</p><p>Finally, his master put a hand on his head. “Enough. Unlace them for me, so I can take them off. I want to get some sleep, if I can.” Sleep? What happened to supper? Maybe Konnor and his brother had eaten a big meal and forgotten all about him. His stomach was growling, but he said nothing, just busily unlaced his master’s boots and then sat back on his heels to await his next order. Konnor stepped around him instead and sat down on the bed to take off his boots. He stretched out on his back and gave a deep sigh of contentment, leaving Ethan on the floor, wondering what he should do next. This love slave thing was confusing. He was used to responding to firm orders, not wondering what his next move should be.</p><p>“Uh, sir ?”</p><p>“Yes, Blondie? What is it now? I’m trying to get to sleep.”</p><p>“Well, I just wondered...that is, should I...”</p><p>“Should you what?” Konnor sat up propped on one elbow and looked down at him. “You</p><p>can go to sleep too, if you want to.” Ethan started to stand up and Konnor gave him a cold stare. “On the floor, Blondie. That’s where slaves sleep.”</p><p>Ethan blushed. “Oh...all right. May I...may I have a pillow, sir?”</p><p>Konnor threw a pillow at him, and Ethan stretched out on the floor. The only problem was that he was freezing. Air currents drifted over his body down there, and he realized all the air vents were low to the floor. He turned to his side and hugged his arms around his body. That worked for about thirty seconds until he became aware his hipbone was digging into the hard floor tiles beneath him. He flopped to his back and stretched out, but that didn’t work either, because now his back started to ache. He turned to his other side, shivering a little. His stomach growled again, and he wondered if he should ask his master to feed him. No, it would be better not to disturb him again. He flopped back over on his back, trying to find a comfortable position.</p><p>“Good gods, what are you doing down there, Blondie? It sounds like one of those animals on Tasmore 9, the ones that spin themselves along rather than walking in a straight line.”</p><p>“I-I’m sorry, sir, but I can’t seem to get comfortable. Do you think you could spare a blanket?”</p><p>“I only have one.”</p><p>“Oh. All right, sir, I’ll try to be quieter.”</p><p>“Oh shit, just get up here.”</p><p>Ethan scrambled to crawl up on the bed beside Konnor, careful not to touch any part of him, which was no mean feat in the tiny bed. It meant hanging one leg off the bed, but at least he was mostly under a blanket now. Konnor still wasn’t through with him quite yet, however. He grabbed his left wrist and stretched it above his head. Ethan craned to see what was happening and was a little shocked to see handcuffs attached to the wall. Of course, he’d always heard rumors that alphas were very dominant and liked to play a little rough. Some even enjoyed a little kink, or a lot, according to Mistress Katya, so perhaps he shouldn’t have been surprised. Konnor put the cuff around his wrist and snapped it closed, then leaned down to gaze into his face. “Maybe that will keep you still. Now turn on your side. Pull your damned leg up here. That’s right.”</p><p>When Konnor had him arranged the way he wanted him, he lay down behind him, spooning him, a heavy arm around his waistand one long leg wrapped around Ethan’s. His master was deliciously warm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Now go to sleep,” Konnor said, and laid his head down on the pillow behind him.</p><p>Ethan was pretty much unable to move, so he had little choice but to go to sleep. Just as he was drifting off, he felt Konnor’s nose nuzzling his hair at the back of his head. It felt so wonderful he leaned back into it and felt a kiss, so soft he might have imagined it at the nape of his neck.</p><p>He awoke what must have been hours later, still on his side, his arm still stretched above his head. Someone was rubbing their hands all over his body, and somehow he had lost his underwear, so their hands were taking a lot of liberties with his cock and balls.</p> <p>“Finally awake, Blondie?” A sultry, sexy voice asked by his ear. Ethan nodded and a big hand slapped his ass, leaving a sting. “I expect you to answer me, boy.”</p><p>“Yes, sir. I’m awake.”</p><p>Konnor rolled him on his back and leaned down to take his nipple in his mouth. He started a slow, steady suction while he put his free hand around Ethan’s prick, rubbing slowly up and down on his flesh. Adding his teeth to the pressureon Ethan’s nipple, he nibbled at him, squeezing and pulling on Ethan’s cock. Ethan gave a low moan of pleasure. His balls were aching, and he started driving his hips up into Konnor’s touch. Konnor put a stop to that by taking his hand away from his cock and pushingEthan’s hips back down on the mattress.</p><p>“Don’t move,” Konnor said, moving his hand back up to Ethan’s cock, rubbing the tip with his thumb and delving down into his slit.</p><p>“Oh, gods,” Ethan moaned. “Please, sir.”</p> <p>“Please what?”</p><p>“It-it feels so...”</p><p>Konnor bent his head and pushed his hot tongue into the slit, fucking it. Ethan’s hips rose off the bed and he screamed.</p><p>Konnor laughed, looking back up at him. “Shhh...you’ll have Larssen down here in a minute, thinking I’m killing you.”</p><p>“I-I’m sorry, sir.”</p><p>He gazed down at him for a long moment. “Turn over on your side, baby.”</p> <p>Ethan rolled back over and saw Konnor’s hand reach past him to find a tube of lube on the table next to the bed. He spread the gel on his fingers and stroked over his hole with the lubricant a few times before delving a finger inside and gently stretching him. “This is something Helga couldn’t do for you, unless she used a dildo. Is that what she did, boy?” His voice had grown tight and angry and his finger, now joined by another, became rougher.</p><p>“N-no, sir. She never touched me that way.”</p><p>The finger stilled and Ethan felt a hot whisper in his ear. “Don’t lie to me. She said she had you.”</p><p>Ethan shook his head frantically. It was important that Konnor believe him. “She didn’t, sir. I don’t know why she said that, but it was a lie. She told me she preferred females.”</p><p>Konnor pulled his head back and stared down into his eyes before cursing softly. “That bitch. She was just winding me up.” His gaze fell back to pin Ethan again. “Anyone else touch you? Did anyone fuck this little hole?”</p><p>“Never, sir. No one touched me...that way. They just beat me and made me...”</p><p>“Made you what?” Konnor’s tone was sharp and demanding.</p><p>Ethan took a deep breath and a little sob caught in his throat. “They made me get naked and scrub floors and clean their nasty toilets.” He turned his face toward Konnor to let him see his pain and outrage.” And they filmed it!”</p> <p>Konnor laughed out loud. At the look of betrayal on Ethan’s face, he looked as if he tried to stop and rubbed a hand across his mouth. “I’m sorry, Blondie, that must have been awful for you, and I didn’t mean to laugh. It’s just...I thought they raped you, baby.”</p><p>“Raped me? Oh no. She did ask me if I was a virgin, though, and I told her no.”</p><p>Konnor stiffened again, and his fingers started moving slowly in and out. “Yes, that’s right, she said you told her that. Who else have you been with, Ethan? One of those boys from your group home? That damned beta you kept talking to at the arena?” His voice had become low and sexy again, but there was a kind of growl to it at the same time that chilled Ethan. He turned his head and stared into Konnor’s eyes.</p><p>“Why, no, it was you, sir. Don’t you remember? In the judging room?”</p><p>Ethan saw another change come overKonnor’s face,and he bent suddenly to take Ethan’s mouth possessively. He plundered his mouth for several minutes before he finally released him. Ethan was breathless and he felt like thrusting his hips again. “That’s what you were talking about? So when we mated was your first time to make love, baby?”</p><p>“Yes, sir.”</p><p>Konnor made another sound and then he was pulling his fingers out and lining up his cock with Ethan’s hole. He thrust inside and kept still for a moment. Ethan figured he must be letting him get used to it, but he wanted it now. He pushed his ass back against him. “Please sir. I need it.”</p><p>“I know what you need, Blondie, and I’ll decide when you get it.”</p><p>“Yes,sir,” Ethan said miserably, his voice sounding a little desperate, even to his own ears. He felt Konnor slide in then, big and thick and filling him up. It burned some, but when his big prick rubbed over the spot deep inside him he’d discovered the last time Konnor did this, Ethan moaned and squirmed with pleasure. Konnor kissed the back ofEthan’s neck and licked at the skin over the still-healingmating bite, while he kept one hand flat on Ethan’s belly, not letting him get away, pushing in deeper. Konnor thrust again and again and at the same time moved his hand up and down Ethan’s cock, pulling and pushing him toward a climax.</p><p>Konnor bent over him. “Come for me, baby.” And Ethan came hard, Konnor joining him, his spunk pulsing into Ethan, hot and wet and damn near perfect.</p><p>He lay still inside Ethan for a long time and then finally pulled out and swung his legs over the bed. He walked into the adjoining bathroom, and Ethan heard the shower start up. He came back to the bed and unsnapped the cuff on Ethan’s wrist, holding out his hand. “Come with me, Ethan.”</p><p>Ethan hurried to get up and follow him to the shower. He got inside with Konnor and let the warm water soak him. Konnor handed him the soap. “Wash me, slave.”</p><p>After all the endearments of the last few minutes, the word surprised and hurt him a little, but he shook himself and remembered his place. This was what he’d asked for, after all. He dutifully soaped up his hands and ran them all over his master’s beautiful, muscular body. Konnor made no move to do anything other than stand still and let him bathe his body, and in a few minutes he stepped from the shower and dried himself, glancing over his shoulder at Ethan. Ethan hurriedly jumped out, dried off and walked behind him back to the bedroom.</p><p>Konnor got dressed and tossed a pair of pants and a soft shirt over to Ethan. “Put these on. I don’t want you naked in front of my family. That’s for me, only, understand?”</p><p>“Yes, sir.” He put the clothes on and stood with his hands behind his back in the presentation position when he was finished.</p><p>Konnor nodded. “Come with me. We’ll have breakfast and then we’ll relieve Larssen. We should be getting back home pretty soon.”</p><p>Ethan nodded, but the idea of arriving on Konnor’s planet was alarming. He’d have to face Konnor’s family, and the butterflies that already churned in his stomach went into overdrive. Somehow he had to do it. He had to face all those alphas, knowing they knew exactly what he was. All the lost, lonely feelings that were never far from the surface came roaring back to taunt him.</p><p>Chapter Six</p><p>The mention of food had Ethan eagerly following his master down the corridors. His stomach must have thought his throat had been cut, because it was jumpy and unsettled. Konnor went into a small galley and opened some cabinets. He found the food packets and thrust two of them into a small food processing machine. In seconds, the smells of his favorite breakfast assailed his nostrils. It was standard Lycan fare, Levolian sausage and yams. His mouth watering, he leaned forward eagerly as Konnor took the packets from the machine. He opened up his own packet, and Ethan’s stomach growled. It looked so delicious, the sausage done to a perfect golden color and light steam coming off the yams. Then Konnor opened Ethan’s packet. It was cereal and milk.</p><p>Konnor’s lips turned up at the look on Ethan’s face . “Less calories, baby. Love slaves have to watch their figures, you know. We don’t want you getting a fat belly.”</p><p>Fat belly? Ethan looked down at his flat stomach in horror, but Konnor just laughed and ruffled his hair. “You can sit on the chair to eat when it’s just the two of us, but of course, when we have company in the future, you’ll have to sit at my feet.”</p><p>Ethan nodded and resentfully took a bite of his cereal. Any old port in a storm, after all, and he was starving. They ate companionably for a few minutes, and then Konnor stood up, tapping his foot impatiently. Ethan gazed up at him in astonishment. How could he have eaten so quickly? He choked down a few more bites as Konnor frowned at him.</p><p>“I thought you told me you were well-trained, and you were going to be the perfect love slave? So far, I’m not seeing it.”</p><p>Ethan felt the flush travel all over his body as he jumped to his feet. “I’m sorry. I’ll try harder.”</p><p>“Hmm...” Konnor said skeptically. “You’d better or you’ll be spending a lot of time over my knee. Now hurry up and dispose of the packets. Then follow me up to the comm deck.”</p><p>Ethan rushed to gather up the packets, wincing in real emotional pain when he dropped one in his hurry, spilling the remains of his cereal all over the floor. He heard a little growl behind him and thrust the packets quickly into the trash incinerator, and grabbed some napkins to wipe up his spill. He turned to step up close to Konnor, his head lowered. Konnor took his arm, whirled him around and gave him a hard swat on his butt. Ethan opened his mouth in shock and moved his hands back to the offended flesh, but Konnor fixed him with a stern look. “Don’t you dare rub it or you’ll get two more twice as hard.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes,sir,” Ethan said breathlessly, letting his hands fall back to his sides. Konnor looked him up and down, then came over and tucked in his shirt and buttoned the top button. Giving Ethan a satisfied nod, he turned and left the room without another word, leaving Ethan to scramble after him.</p><p>When they entered the comm, Ethan thought he saw Konnor give Larssen a slow wink, but it was over so fast he couldn’t be sure. Larssen stood up, stretching. “I’m going down to grab a quick nap, little brother. We’ll be landing on Lycanus 3 in a few hours, so wake me when we get close.”</p><p>Larssen walked toward the door and Konnor slipped in his seat and began checking instruments. Ethan was standing beside Konnor uneasily, wondering what to do next, when Larssen turned to look at Ethan with speculation.</p> <p>“Hey, Konnor. You think I’d sleep better if your boy serviced me first?”</p><p>Ethan froze in horror, his eyes darting over to Konnor, who sat very still, his lips twitching a bit. He glanced over at Ethan, who tried to beg him with his gaze not to send him with Larssen, who was very handsome but stillwasn’t his alpha. Even though Ethan had offered to do this very thing, he didn’t know now if he could go through with it. Konnor hesitated just long enough to have Ethan really squirming and then he shook his head. “No, I might need him here. Maybe later.”</p><p>Larssen turned and left,and Ethan sank down to the floor beside Konnor’s legs, his own legs not really wanting to hold him up just then. He hadn’t realized he’d been holding his breath until it whooshed out of him, leaving him lightheaded.</p><p>He heard Konnor chuckling and felt his hand on his head, pulling it toward his knee. He wondered what he might do to pass the time. It seemed pretty boring to just sit here at Konnor’s feet. This whole slave thing wasn’t exactly what he thought it might be. Of course, Konnor could make him go clean the floors or something. That idea got him to settle down quickly, and not make any moves that might remind his master he was there. After a while, his eyes began to burn a bit, so he closed them for just a minute. He rested his head against Konnor’s knee, and Konnor’s fingers teased through his hair. Before he even knew it, he dozed off on the floor at Konnor’s feet. He was so tired and worn out from all he’d been through that he fell deeply asleep and didn’t wake until Konnor nudged him. He woke up with a start and was mortified to see that he’d drooled all over his alpha’s knee while he’d been sleeping. He scrubbed at it furiously with his sleeve, but Konnor just gazed down at him with that same half smile playing around his lips. “Leave it,” he said. “We’re about to land. Sit up here on my lap while Larssen takes us in.”</p><p>Ethan whipped his head around to see Larssen sitting beside him in the other comm chair, smiling gently as he stared straight ahead. Ethan looked back up at Konnor in confusion as he pulled him up onto his lap. “You slept almost two hours,” he told him, answering his unspoken question. “You were pretty tired, I guess.”</p> <p>He pulled him back against his chest and strapped them both in for the landing. Ethan was too big to sit on anybody’s lap and his legs hung off awkwardly to the sides. It was comfortable enough for him, Konnor’s warmth radiating through him, butwas that Konnor’s dick growing larger and harder beneath his ass? The idea made him feel warm all over, and he hoped he wasn’t blushing again, even though Katya had assured him his blushes were charming.</p><p>They were already almost on the ground, coming in low and fast, the red dust of Lycanus 3 blowing up around the ship to greet them. Ethan could see several people standing on the landing dock as they pulled up alongside it. Through the glass window on the side of the craft, he could see that the men were all large and handsome, like Konnor and Larssen, and they had the same confident air. Thesemust be the Balenescu alphas he’d heard so much about back home. He got that nervous feeling in the pit of his stomach that he always got when he had to meet new people. Especially these people who were all powerful alphas and who all knew exactly what he was by now.</p><p>Konnor unstrapped them, and he stood up so Konnor could exit. He walked right behind him, his feet seeming to be unable not to follow Konnor wherever he went. He kept his head firmly down, though, and stayed close to Konnor. The hot, dry air hit him when he stepped off the ship, a welcome change after Europa. He could hear all the men greeting each other with loud talk and laughter. He could barely pay attention to what was said because of his nerves. When he heard Konnor say his name he jumped, realizing from Konnor’s expression that it hadn’t been the first time he’d called him.</p><p>“Ethan, I’d like you to meet the alpha of Lycanus 3, my cousin, Lucas.” Ethan glanced up and saw a huge, good-looking alpha nodding to him.</p><p>Quickly, he bowed from the waist, respectfully. “An honor to meet you, Alpha Lucas.”</p><p>Konnor quickly introduced him to two other men standing on the dock beside Lucas, but the names didn’t register on Ethan, who was beginning to feel overwhelmed again. To his horror, he heard Larssen speak up beside him. “Lucas, if you’d like, Ethan has made a kind offer to take care of all of our sexual needs. Since you’re the alpha, you can go first.”</p> <p>Ethan sucked in a terrified breath and saw Lucas look from Larssen to Konnor in complete confusion. One of Konnor’s big, muscular cousins standing next to Lucas laughed out loud and said, “Where do I sign up?”</p><p>Lucas shot him a quelling glance, and he stepped back, as did Ethan, backing up into Konnor’s warm body and turning his face in toward his chest. Konnor put a hand on the back of his head and spoke up quietly. “Knock it off, Kyle. I don’t think Ethan is quite ready for all that. I’ll explain later, Lucas. For now, I think I’ll take Ethan home. He’s worn out.”</p><p>“Of course,” Lucas said. “When you get him settled, come over to my place for a few minutes. I need to talk to you about some things and get your report.”</p><p>“Of course,” Konnor said, and put a hand on Ethan’s wrist to pull him along behind him to a large jeep that sat on ridiculously high treads, making it possible to move through the sandy terrain of Lycanus 3. The others all piled on board, and the jeep took off at a more rapid rate of speed than Ethan would have thought possible in the deep sand. The place was like a big desert for almost as far as he could see, except for the faraway mountains that were a deep green. It was a strange, stark landscape, but beautiful in a way. The jeep, driven by the alpha Lucas, traveled quicklythough there didn’t seem to be actual roads, and they soon came to a large grid of houses and shops, seemingly in the middle of nowhere. Traveling down a wide space between the houses, which was like a driveway, only with swing sets and lawn furniture at the sides, Konnor spoke in a low voice in his ear. “This is where we live, Ethan. All the alphas live in homes close to each other, with the different ranks spreading out around us. This will be your new home.”</p><p>Ethan nodded and settled himself closer to Konnor, who didn’t move away. Maybe that meant that he wasn’t so mad at him anymore. Ethan certainly hoped that was the case. The jeep pulled up to a large home and stopped in front. Konnor got out and pulled Ethan with him, waving at his cousins and his brother. The house was the standard Lycan concrete, fairly large with the big windows Lycans liked to let in plenty of light. Once inside, Ethan could see Konnor wasn’t home much. The furniture had a thin layer of red dust on it, and Konnor flipped on a vacuum switch as they walked in. Right away the vacuum system started its hum and a gentle swirl of dust began as the suction all over the house cleared it away. They stood by the door until it finished and within minutes, all the dust was gone and the air was left fresh smelling and sweet.</p><p>There wasn’t a great deal of furniture in the house so far as Ethan could see, but it was functional and nice. Konnor led Ethan down the hall to a bedroom and nodded toward the bed. “Take off your clothes and lie down. I’m putting you to bed for the rest of the day.”</p><p>Ethan glanced up in surprise, and Konnor pointed again. “Go. You’re pale and you look exhausted. The fever from the venom has only just stopped, and it’s left you weak. I want to find you in that bed when I get home. Got it?”</p><p>Ethan nodded.</p> <p>“Ethan, I don’t ask rhetorical questions. Do you understand? ”</p><p>“Yes, sir. I understand. Stay in bed, yes, sir.”</p><p>Konnor nodded and then surprised Ethan by dropping a kiss on his forehead. “I’ll wake you up later and make you something to eat. For now, go to sleep.” Konnor gave him a gentle shove inside and closed the door. Ethan took off all his clothes—Konnor didn’t say to leave anything on—and lay down on the soft bed. Maybe he’d close his eyes for a few minutes, but he really didn’t think he’d be able to sleep. After all, Konnor had to wake him up just before they landed and he’d slept for over two hours then, Konnor told him. Sighing, he closed his eyes anyway, and was completely taken by surprise when sleep swallowed him up.</p><p>Late that afternoon, Konnor came back home, feeling ready to get something to eat and just sit around relaxing for a change. He wondered if Ethan followed his instructions and slept the afternoon away. He’d been worried about him earlier that day when he’d seemed to droop back against him after meeting most of his family on the dock. Come to think of it, his family probably was a loud, intimidating group,and Larssen’s teasing hadn’t helped. He wished he’d never told Larssen what Ethan had said. He hated to embarrass him. He’d have a word with Larssen later.</p><p>He let himself in and noticed how quiet the house was. Checking the bedroom, he found Ethan curled up with the covers over his head. Konnor left him sleeping and went into the kitchen for a food packet and some beer. As he prepared his meal, he took a long swig and thought about the cereal he’d given his mate earlier. It had been a little mean, and he regretted it now, but he wanted to teach Ethan just how undesirable his little plan to be his love slave really was. Still, he must be starving, and Konnor was trying to decide if he should go wake him when he heard a slight noise behind him. It was a sleepy-eyed Ethan, wearing the shirt from earlier and not much else. His blond hair was tousled and looked soft and silky. The shirt hit him at the top of his thighs and Konnor could see a tiny bit of flesh peeking through. He felt the slam of attraction hit him hard andturned back to the counter so Ethan wouldn’t see his erection. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hi,” Ethan said softly . “Is it okay if I get up for a while, sir? I hope you don’t mind that I put on your shirt when I got up. II’m a little hungry, and I smelled the food.”</p><p>“Since you’re already up, I wonder why you bothered to ask,” Konnor said, more sternly than he’d meant to. He was still struggling to find the right tone to take with his mate. On the one hand he wanted to show him how silly this idea of being his slave was, and make him want to embrace his role as his mate. On the other, what he really wanted to do was throw him down on the floor right damn now and fuck him till he screamed his name. He knew Ethan didn’t love him...he’d been quite clear about that fact. But Konnor had increasingly strong feelings for Ethan. At first it had been a strong sense of possessiveness and a need to protect him, but with every passing hour he was with him, he could feel his love and attraction for the boy growing stronger.</p><p>If he could get him to admit he wanted to be Konnor’s mate, then he hoped that with time, Ethan might grow to love him. In the meantime, Konnor had to admit, making Ethan submit to him was hot. He didn’t want to live that way all the time, but in their most intimate moments, it was exciting and what he’d always needed with his lovers. As a matter of fact, he owed his boy a little punishment for all he’d put him through. He decided he’d had enough of this stupid game. It was time to push his boy to his limits so they could end this shit and have the relationship he thought they both really wanted. He needed to get Ethan to the point where he could admit what he really wanted and take his place as Konnor’s mate, albeit his submissive mate. He wanted to pamper him and take care of him and spank his round ass until it was bright pink. Konnor squared his shoulders and prepared to do battle.</p><p>“I’m sorry,” Ethan said softly, interrupting his thoughts. “I thought maybe you wouldn’t mind if I had something to eat...”</p><p>“You thought...” Konnor turned back around to glare at him. “That’s the problem with you, Blondie, you try to think too much. It’s what gets you in trouble. I know what you need, and your only job should be to trust me to give it to you. On my own schedule, not yours. Do you understand that?”</p><p>Ethan shuffled his feet and stared at the floor. “Yes, sir.”</p><p>“Do you? I wonder. Maybe this love slave idea is too hard? I seem to remember a lot of bold promises made to me not too long ago. Maybe you’re not quite so ready to be a slave, after all. Is that it, Ethan?”</p><p>Ethan surprised him by shaking his head firmly. “No! ” His voice rang out loud in the quiet kitchen. “I can’t go back to Mistress Katya. I can’t!” He fell on his knees and looked up at Konnor through a curtain of blond hair falling in his eyes. “Please, master. Let me stay with you.”</p><p>Konnor was horrified. Scaring his mate was the last thing he’d intended. He went to him and pulled him up into his arms, holding him tightly against him until the trembling began to ease. Drawing him over to a chair in the living area, he pulled him onto his lap and settled him there before he trusted himself to speak again. “Ethan, honey, you’ll never have to go back to Katya. I didn’t realize until just now that I never told you that I had her arrested. She and her whole operation are officially out of business and that includes that bitch Doma Helga, who sold you to her in the first place. I’m sorry I didn’t tell you sooner. There’s been so much going on in my mind since then...but it’s no excuse. There’s no question of you going someplace else. You’re mine, and I take care of what’s mine, understand?”</p><p>Ethan nodded against his shirt. “All right,” Konnor said. “But that doesn’t mean you get away with bad behavior. Running from me, for example, will get you a spanking if you ever do it again, and I mean it. You won’t sit down for a week, understand?”</p><p>Ethan nodded again, but more slowly this time. “As for your other bad behavior, like making decisions on your own, I have ways of dealing with that too. Tonight, for example, since you can’t seem to stay still on your own, I’ll help you to remember how. Now sit down at the table and eat your dinner. Then go to the bathroom and back to bed. Got it?”</p><p>He pushed Ethan up and pointed toward the table. Ethan went over and sat down quickly, attacking his food with gusto when Konnor placed the food packet in front of him. When he finished, he realized Konnor was staring at him, and he wiped his mouth and started to ask a question before thinking it would probably get him in more trouble. Konnor would tell him whatever he wanted him to know. He closed his mouth quickly and lowered his gaze.</p><p>“Bathroom,” Konnor said and Ethan got up and went unhesitatingly to the room he’d passed in the hallway. After relieving himself, he walked to the door and found Konnor waiting for him. He jerked his head toward the bedroom, and Ethan dragged his feet slowly inside the room, feeling apprehensive about what was about to happen. Konnor said he’d remind him how to be still. Did that mean the cuffs again? Last time when he’d cuffed him, it hadn’t been so bad, but Konnor had been with him the whole time. He wondered if he’d be alone this time.</p><p>“Face down on the bed,” Konnor said, and Ethan complied, glancing up nervously at him. “What part of face down do I need to explain to you, Blondie?” Ethan turned his nose toward the mattress and closed his eyes until he heard Konnor take something from the drawer beside the bed. He moved his eyes desperately to the side, trying to see out of his peripheral vision, but he couldn’t see a thing. Then Konnor pulled Ethan’s hands behind his back and snapped a pair of handcuffs on his wrists. Ethan gasped, and raised his head, only to get a resounding slap on his ass.</p><p>“Apparently you’re having trouble understanding.” Ethan put his face back down. A tug on his ankles told him that something was happening at the foot of the bed, and soon he felt tightness around his ankles and managed to look over his shoulder in time to catch sight of a long strap. Another tug and he could only guess that his ankles had been cuffed and then the cuffs strapped to the bed frame. He ducked his head back down to avoid another reprimand and missed seeing Konnor hook a chain to the platinum collar still around his neck and then attach the other end to the head of the bed.</p><p>“Maybe this will help keep your head still,” Konnor said softly. “Do you need a blindfold too? ”</p><p>Ethan shook his head. “No, sir.”</p><p>Konnor wasn’t through with him yet, however. He felt a sudden wet coolness on his ass, and Konnor’s fingers slipping inside him. “Relax for me. That’s it. Blondie, I’m going to put a small plug inside. Hold still and push back against it.” Instinct made Ethan pull sharply away, but the plug was sliding in, stretching him open and burning his muscles. He cried out and instantly, he felt Konnor’s free hand on his hip, caressing it and rubbing a slow circle over the skin. “Shhh...it’s not very large. You need to get used to wearing one for me. Relax.”</p><p>Ethan tried hard to do as Konnor told him, but just when he was beginning to calm down and his body was beginning to adjust to this invasion and feeling of being stuffed full, the plug gave off a gentle vibration. He moaned aloud, and again Konnor put a hand on his hip. “Quiet now and try to relax. I’m right here.” He got up off the bed though, and moved away. Ethan immediately started to panic, his breathing getting harsh and fast, but he heard Konnor’s voice from the chair beside the bed. “Hush. I’m here, and you have one hour of punishment coming to you. Don’t whine,and it’ll be over soon.”</p><p>The next half hour was torturous because not only could he not move, but the damn plug in his ass was pushed up against that spot inside him that made him feel so excited. The gentle vibration against it was driving him crazy. It was enough to make him excited, but not enough to get him off. Soon he began to rub his cock into the blanket beneath him to try to get some relief. He tried not to be noticeable about it, but a heavy hand soon popped his ass again. “Be. Still.”</p><p>Ethan whimpered and held himself as still as he possibly could, but this was torture. Nothing Mistress Katya had done to him even came close, not even the beating with the cane that one time. He’d passed out after the first four strokes of the cane, so he only really had the bruises to contend with after he woke up. But this...this was agonizing and truly evil. Yet some perverse part of him didn’t want to miss a minute of it.</p><p>It wasn’t the pain...there was very little of that. It was the sense of being completely subjugated and controlled. Why this made him so hard and aching for release, he wasn’t sure. Maybe it was the idea that his whole world was dominated by Konnor. He was owned by him, in every sense of the word, and Ethan found to his surprise that he wanted it that way. He’d fought so hard against the idea that he was a submissive, but why, really?</p> <p>For the first time, he had to look the idea squarely in the face, and found that it wasn’t so scary after all. He trusted Konnor to know what was best for him, so why did he keep secondguessing him? Was it the concept that all Lycans had to be dominant and powerful? That it was somehow an integral part of their nature, and if they weren’t then they were defective? It was what he’d been taught all his life, and old habits die hard. But what if these ideas were wrong?</p><p>As the plug continued its vibrations, Ethan could feel the pressure building in his balls, and they rose up tightly in protest. His dick was aching and hard, and he longed for just a tiny bit of friction on it. There was no doubt in his head that he would mind Konnor’s orders in the future. No way could he go through this again, and Konnor seemed to know what was best for him in the long run. If he followed his orders, he wouldn’t keep getting himself in trouble. Why did he keep trying to make decisions for himself even after he’d told Konnor he would submit?</p><p>The pressure in his balls continued. Ethan tensed as his body began to give in to the instinct to panic. Then Konnor made a little noise as he shifted in his chair and Ethan felt the tension drain from his shoulders. Konnor was here, and he’d take care of him. The knowledge that he wasn’t in control of anything...that he would stay right where he was until his master decided to let him out of this rushed to his cock with a vengeance. To his horror, he felt himself coming, and could not stop the jerking motion of his hips. He cried out, overcome with humiliation and the knowledge that he’d failed yet another test of his submission. When it was finally over, he lay still, gasping for breath, his tears falling to make the mattress even wetter beneath him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He heard Konnor say softly, “I’m glad you got that out of your system. Of course, you just added another fifteen minutes to your punishment.”</p><p>Ethan didn’t even bother to whimper, knowing it would do him no good. Instead, the orgasm, along with the stress and the strain of the last two weeks began to take its toll on him. Even though he’d spent the entire afternoon in bed, he could feel a bone-deep tiredness settling over him. He closed his eyes and finally gave in, sinking down into a calm acceptance of his alpha’s authority over him.</p><p>He came back to himself when he felt Konnor tugging on his ankles again. He had barely even realized any time at all had passed. Konnor had already unstrapped him and now he was taking off the cuffs. He finished and reached over Ethan’s head to unsnap the collar and then put an arm around his shoulders to help him sit up on the side of the bed.</p> <p>“I’m going to take off your cuffs, now, baby, but keep still. Wait for me to help. When the blood rushes back in, it’s going to hurt.”</p><p>Ethan nodded, yet when the cuffs were taken off, he moved his arms reflexively and the pain as he did made him weak as stars danced in front of his eyes for a moment. He gradually became aware again and found that he was half lying across Konnor’s lap, as he massaged his shoulders and upper arms. Ethan raised his gaze up to Konnor’s. “Hard-headed, stubborn boy. What did I just tell you?”</p><p>“T-to keep still and wait for you.”</p><p>“And did you listen? Hell no. What am I going to do with you?” He kept massaging and fussing until the rubbing gradually turned into caresses, and Konnor began to drop little kisses all over his shoulders. Ethan leaned back into his chest and turned his face toward Konnor’s throat.</p><p>Konnor bent to kiss the tip of his nose. “I guess I’ll have to figure it out, won’t I? In the meantime, maybe you’d like me to help you with your otherlittle problem...”</p> <p>“My prob...” The problem in question gave off a gentle pulse again in his backside and Ethan squirmed uncomfortably. “Oh gods. Yes, please. I can’t believe I forgot about it.”</p><p>“Mm-hm. Lie down on your stomach again.”</p><p>Ethan stretched out on his stomach and dutifully raised his bottom for easier access. Konnor pulled the plug out gently, and Ethan made a whimpering sound as it came out. He was surprised at how his hole clenched and contracted, obviously reacting to its loss. “Oh, I feel...”</p><p>“Empty? Neglected?” Konnor asked as he rose on his knees behind him and slid down his pants. “Hang on, baby. Help is on the way.”</p><p>“I bought him in Tygeria a few years ago from a breeder . Expensive as hell, but he’s a beautiful thing.”</p><p>Ethan gazed over at Konnor, loving the way he looked. His face was flushed with excitement and his wine-colored eyes were dark this morning and sparkling with passion. They were on their way to meet his cousin Nikolai and his mate to ride vetamis. Ethan had never heard of one before that morning, but apparently they were some kind of giant half-bird, half-lizard creature. Wild and hard to tame, they were indigenous to a planet called Tygeria, covered in dense forests and jungles on the other side of the galaxy. The inhabitants rode these creatures for pleasure, even though they were dangerous and highly unpredictable. Part of the fun, according to Konnor, though Ethan was far from convinced.</p> <p>He was unaccountably shy this morning with Konnor. For the past several days, they had lived together quite companionably, and the sex between them had been frequent and amazing. Konnor treated him more like a lover than a slave, and Ethan was growing more attached to him every day. Whenever Konnor left the room, even for a few minutes, Ethan found himself going in search of him and simply watching him at whatever he was doing. Konnor would look up at him with his beautiful, warm eyes and seem glad to see him.</p><p>So far, Lucas, the alpha of Lycanus 3 had left Konnor alone with Ethan, not giving Konnor any assignments and saying they needed time together to figure things out, in his words. Ethan was uneasy, though, about the implication that Konnor could leave soon to go after a bounty or to take a shipment of bauxite somewhere. How could he stand to be away from Konnor so long? He had no idea if Konnor would take him along, as the other alphas did with their mates. But he wasn’t a mate anymore. He’s asked to be treated like a slave, even though he could have kicked himself a million times since then. The idea of being left behind made his stomach ache, but he refused to ask Konnor. He was working hard to just accept whatever he gave him and stop trying to worry over things. It wasn’t working well so far, but he was trying.</p><p>“Ethan? Are you listening to me? ”</p><p>Ethan jumped, turning toward Konnor. “I’m sorry, yes, sir. You were talking about the vetami.”</p><p>Konnor grinned at him. “I want you to ride with me, Blondie. It’s so much fun. Nikolai and Jagger are coming too, so we can race.”</p><p>The idea of sitting on the back of a huge half-bird, half lizard while it soared over the treetops didn’t seem exciting to Ethan. Terrifying, maybe...</p><p>“I...uh...I think I’m afraid of heights.”</p><p>Konnor looked at him in amazement. “What? That’s just silly. I’ll be with you the whole time,” he said with supreme confidence. “You’ll love it.”</p> <p>Ethan was pretty sure he wouldn’t love it, but he kept quiet and stared straight ahead. They were getting closer to the stables where the vetamis were being kept, and he could see a tall, muscular figure already there, standing next to a smaller, more elegant man with a long curtain of dark hair.</p><p>“There’s Nikolai now with his little prince,” Konnor said. “It’s about time you got acquainted more with my family and their mates.”</p><p>Ethan nodded. “I’d like to meet them. Did you say Jagger is a prince?”</p><p>“Yes, from Jayron. And he’s something. Beautiful, as you can see, but also very imperious and demanding and hard to please. I understand all of that changes when they close the door to their bedroom.” Konnor turned to him with a twinkle in his eye.</p><p>“Really? Ethan’s raised one eyebrow suspiciously.</p><p>“Oh, yes,” he said with a laugh. They parked the jeep, and Konnor jumped out to catch his cousin in a big hug. They started joking and wrestling with each other while Jagger came forward with his hand outstretched.</p><p>“Hello, Ethan. I’m Jagger. This is probably going to take a while, so I decided to go ahead and introduce myself, since my mate can’t be bothered.”</p><p>The mate in question was currently on his back on the ground, holding Konnor in a headlock. Ethan shook his hand and smiled at him. “I’m very glad to meet you, too, Jagger. Konnor said you were from Jayron.”</p><p>Jagger brightened immediately. “Yes, do you know it? It’s a small planet, and kind of old- fashioned. Not much technology. We actually held Niki prisoner there for a while. Long story I’ll have to tell you sometime.” He glanced down at Nikolai fondly, shaking his head. “Maybe I should have kept his leash. It might have come in handy.”</p><p>Ethan’s eyes grew wide. “His leash? You put an alpha on a leash? I can’t even imagine.”</p><p>Jagger laughed gaily. He was exotic looking, small, with long, silky navy blue hair and slanted eyes of a color that perfectly matched his hair. He really was quite beautiful, especially when he laughed. “Of course, it was all a sham on his part, but he fooled me for a while.” He took one slender booted foot and dug into his mate’s side. “Are you quite finished rolling around in the dirt, Niki? I want to ride.”</p><p>Nikolai got to his feet, pushing Konnor off him with a parting cuff to his ear that would have probably knocked Ethan flat. Konnor seemed unfazed by it and dusted himself off as he came toward Ethan and put a proprietary arm around Ethan’s waist. “Nikolai, Jagger, this is my...uh...this is Ethan.”</p><p>Nikolai grabbed him in a big hug, slanting a smirking look over at Konnor, who pulled Ethan back possessively and shoved Nikolai away. “Maul Jagger, why don’t you? Leave Ethan alone,” Konnor said, but his tone was good natured, and it was obvious the two were very close.</p><p>Ethan glanced over to see Jagger regarding him closely. Jagger was so elegant in his black, silk tunic and leggings that Ethan felt like a big, overgrown ox next to him. But Jagger put him at ease right away by putting a warm hand on his arm and fingering his sweater. “This is lovely. Did it come from the local shops?”</p><p>Ethan looked down at himself. He was wearing new dark pants and a rich red sweater that was soft and probably expensive, though Konnorwouldn’t tell him how much it had cost. He’d gone out a few days before with Ethan in tow, and bought him an entire wardrobe of clothing and shoes and coats, paying no attention to his protests about the cost.</p><p>“Yes,” Ethan said. “The one on the corner by our house. The shopkeeper said it was Meruvian wool.”</p><p>Jagger raised his eyebrows. “Ooh, nice. I think this color would look very goodon me, don’t you, Niki?”</p><p>Niki put an arm around his mate. “Anything looks good on you, princeling.” He dropped a kiss on the top of Jagger’s head, and Jagger punched him in the arm.</p><p>“Watch the hair,” he rolled his eyes at Ethan. “It’s like living with a giant, badly behaved puppy.”</p><p>Nikolai grabbed him and bent him back across his arm, kissing him thoroughly, and completely ignoring his attempts to kick his way out of the embrace by wrapping a leg around Jagger’s to keep him still. When Jagger finally gave in and stopped struggling, he let him up for air, but kept an arm around his shoulders. “Fortunately,” he said with a smirk. “Jagger loves puppies.”</p><p>“Idiot,” Jagger murmured, but Ethan saw his lips twist up a bit at the corners. “Why don’t you lie on your back, and I’ll rub your tummy.”</p><p>“You first,” Nikolai said with a leer and kissed his mate again.</p><p>Konnor began pulling Ethan toward the stables. “C’mon, Nikolai, you can play with your mate later. Let’s go get our vetamis so I can beat your ass in a race.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah, you wish,” Nikolai said, tugging Jagger along by the hand as he followed.</p><p>As they entered the stable, Ethan noticed a strong, gamey smell coming off the beasts. They were behind large metal wire doors in their big stalls, and Jagger pulled Ethan up to a door on the end. “Hello, Jaxx, I’ve come to show you who’s boss again.” The big creature ignored them completely.</p><p>Ethan looked at the creature with trepidation. It was a massive black bat-like beast, with oily looking wings. Its head was lizard-like, and covered with black scales, though feathers covered the rest of its body. The creature rolled its black eyes at them and Ethan took a backward step. “I’m not getting anywhere near that thing, Konnor. You can ride him if you want to, but I don’t want anything to do with him.”</p> <p>Jagger, who was standing in front of the stall next to him came over closer and spoke quietly in Ethan’s ear. “They’re not as scary as they look, although I admit, I was pretty frightened the first time I rode one of them with Niki.”</p><p>Nikolai and Konnor already had the doors of the stalls open and were putting some kind of harness around the vetamis’ necks. Ethan followed slowly as Konnor then led the thing from the stables and out into the open area in the yard. He jumped astride the massive black creature, his legs locked around its neck and held out a hand to Ethan. “Come on, Blondie. Up you go in front.”</p><p>Ethan shook his head, knowing he’d probably be disciplined for his defiance, but not caring at that moment. He tried not to flinch as the beast shifted and cast a wild black eye toward him.</p><p>“Put your foot on the wing and hold up your arms. Come on!”</p><p>Not wanting to get anywhere close to the creature, he shook his head. “No, Konnor. I’m not going near that thing.”</p> <p>Konnor frowned at him impatiently. “If I have to get off to make you come to me, I will spank your ass, Ethan. Vetamis are difficult to control. Come. Now!”</p><p>Ethan clenched his jaw. Reluctantly he stepped forward, put a foot up on the wing, which was resting on the ground, and extended his hand to Konnor. Konnor pulled him up in front of him and settled him between his thighs, putting an arm around his waist. Konnor was gripping the harness around the beast’s neck and seemed to be totally at ease.</p><p>“Lean back, Blondie. Hold on with your knees. I’ve got you.”</p><p>Ethan gripped the beast with his knees as best he could, uncomfortable sitting between Konnor’s thighs. Even though he was fully clothed, he could feel Konnor’s hot, enormous cock burning through his pants and against his flesh. He was so aware of him all the time, and he was getting an erection as he did every time Konnor got near him. He needed to concentrate on his terror at the moment and try his best to stay alive. He leaned forward to get some distance between him and Konnor but that lasted only until they took to the air.</p><p>Konnor laughed as the creature seemed to soar straight up toward the sky with a hideous screeching sound. Ethan fell back in terror against Konnor’s chest, closing his eyes, sure that he and Konnor were in imminent danger of falling to their deaths. Konnor’s strong arm pulled him back against his chest, but Ethan was feeling out of control with fear. The huge bat-like creature flew over the forest that he’d only seen so far from a distance, beyond the desert sand, and he realized the giant tree tops were only inches beneath them. The beast flew with a dipping, up and down motion that madeEthan’s stomach flip over, and he became afraid that he was about to be very sick.</p><p>Konnor must have realized how he was struggling, because he whispered urgently in his ear. “Take deep breaths. Don’t look down, baby. That’s right. Keep your eyes up.” Ethan did as he was told, and the nausea eased off some.</p> <p>Then off to their left, Nikolai’s vetami swooped by, and Nikolai yelled some kind of challenge to Konnor. Instantly, Konnor called out a command to his beast, and it began to put on extra speed. Ethan could only close his eyes and grab a fistful of feathers in his hands, needing to hold onto something for dear life. The next few minutes were like a nightmare to Ethan, filled with terrifying climbs and then even more frightening dives, when his legs came up off Konnor’s thighs, and he thought he would fly out over the beast and hurtle to the ground. Konnor’s arm around him always prevented it from happening, but that didn’t convince Ethan’s stomach, which was clenching and unclenching in terror, filling his throat with bile.</p><p>When after what seemed like an interminable time, they came in for a surprisingly soft landing, and Konnor brought the vetami to a sedate kind of trot back to the stables, Ethan made a desperate groan and pushed back on Konnor’s arms. Konnor let him go and Ethan fell off to the ground, vomiting helplessly as soon as his knees hit the ground. Shaking with chills that racked his body, he couldn’t remember a time when he’d been quite so ill before. He heard shouts around him and then soft hands were on his back, rubbing circles there to comfort him. He glanced up to see Jagger beside him, his handsome face frowning with concern.</p><p>“Konnor and Niki have gone to put the vetamis away in their stalls, Ethan. They’re too wild to be let loose. Konnor will be here soon, though.”</p><p>Ethan nodded, embarrassed that he had caused a scene. He hugged himself around the waist and tried to control his nausea, but every time he closed his eyes he was back in the air, climbing and dipping. The hot bile forced itself from his lips again and splashed on the ground in front of him. He moaned in misery, and then he felt Konnor’s arms around him, pulling his head back on his shoulder.</p><p>“Blondie, what am I going to do with you, baby?” He picked him up in his arms and carried him as if he were as small as Jagger, putting him down in the front seat of the Jeep. “Don’t close your eyes, honey. It only makes the dizziness worse.” He yelled something to Nikolai, and then they were driving on the sandy terrain again.</p><p>Ethan saw that Konnor’s hands were gripping the steering wheel so tightly his knuckles were white. “I’m sorry I ruined your day, Konnor.”</p><p>Konnor glanced over at him and shook his head. “Just be quiet for now, and let me get you home. Jagger and Nikolai are following us.”</p><p>Ethan struggled to sit up straighter in the seat. “Oh, but I didn’t clean up much this morning. I was in such a hurry after...” Ethan blushed as he remembered earlier that morning when he’d been bending over bundling up the garbage to be incinerated, and Konnor had come up behind him. Some time later as he lay naked on the floor of the kitchen with Konnor catching his breath beside him, he realized there wouldn’t be enough time left to clean up the house.</p> <p>“Don’t worry about it. They’re just concerned about you. They’re not coming to check up on your cleaning abilities.”</p><p>“Oh.” Ethan bit his lower lip and glanced at Konnor nervously. He seemed almost angry about something, and Ethan was sure it was because his day had been ruined by his stupid sickness. He laid his head back against the seat and was quiet the rest of the ride home.</p><p>Once they arrived, Konnor gave him medicine and made him go lie down in the bedroom and wouldn’t hear of him staying in the living area to visit with Nikolai and Jagger. “I might let you get up after a nap, if you’re good, but I want you to rest for now,” he said sternly. “No arguments. I’m leaving the house monitor on, so I can hear you if you need anything. Call me,” he said, pointing a finger at him. “Don’t get up until I say so.”</p><p>Ethan nodded obediently, but he felt a little resentful, like he was some kind of child that had to lie down for a nap. His stomach did feel queasy still, and that awful dizziness was there threatening to come back if he thought about the wild vetami ride. Whatever the medicine was that Konnor had given him must have been working on him, though, and a big yawn took him by surprise. Maybe just a little nap. He closed his eyes, and let sleep drift gently over him as he heard Konnor’s soft murmurs coming through the monitors on the wall.</p><p>“So how much do you think he’ll go for?” Ethan woke up gr adually, realizing he’d been hearing voices for a while, but had been too sleepy to wake up and listen. Nikolai must have been sitting near the monitoring station because his voice was coming through loud and clear through the speaker on the wall. Ethan smiled as he heard Konnor’s voice answering him. His voice always made him feel safer and not so alone.</p><p>“A lot,” came Konnor’s reply . “At least a hundred thousand diamond standards. Maybe more.”</p><p>A low whistle greeted his comment. “Damn, that’s a lot of money. When will the auction take place?”</p><p>“Just as soon as I can get back to Lycanus 2. Everything’s set up, and he’ll go to the highest bidder at the auction. As beautiful as he is, the bidding will go high.”</p><p>Ethan froze in horror. Auction? Highest bidder? Was Konnor talking about him? About selling him at auction? He remembered with a start that his initial training period had only been for three months and that time would soon be up. What was it Konnor had told him that day in the locker rooms at the ranking tournament as they waited for his brother to come back with the paperwork?</p><p>“There’s nothing to be so upset about,” Konnor had said to him. “I’ll be taking over your training, and nothing at all will happen for at least a few months. After that, we’ll have to come back here for an auction, but I don’t want you to worry about it. Leave it all to me. I’m taking care of things.”</p><p>The hot bile rose in his throat again, and he gagged helplessly. His head was whirling, but he fought down the panic threatening to overwhelm him. He had to control it for a few more seconds at least. Maybe there was some horrible mistake. Konnor was his mate. Wasn’t he? Had it been a trick? Had everything just been a lie? A mean, cruel lie to get him to cooperate and stop fighting his omega status so much? Had Konnor been planning on taking him back to Lycanus 2 all this time to sell him at a slave auction?</p><p>Jumping to his feet, he edged closer to the speaker on the wall. The volume was low, and he had to hear what Konnor was saying. “Well, I need the money...” Static that was persistent and grating interrupted his next few words, as Ethan strained to hear. Finally, when he was almost frantic enough to tear the speakers from the wall in frustration, the static cleared. “...he’s not worth any more than that. Not to me, anyway. I can buy others like him at auction, if I ever decide I want one again, and let’s face it, one’s about as good as another.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ethan grabbed himself around the middle, as if to keep from flying apart. Black dots began to swarm in front of his eyes. He bit down on his lip hard, tasting blood in his mouth. The pain helped him focus again on the poisonous words spewing from the speaker.</p><p>“Won’t you be sorry to see him go ?” The question seemed to come from Jagger. Were they all discussing him then? Laughing at how worthless he was. A stupid omega, only fit to sell to the highest bidder.</p><p>“Not really,” Konnor replied . “I mean, sure I’m a little attached to him, but I’ll get over that. After all, he’s a lot of work.No, he’s just become a great deal of trouble, and someone else could give him a better home. I’ll sell him and get what I can for him.”</p> <p>Ethan slammed his fist into his mouth, biting down hard as icy, black self-loathing filled his heart, crowding out all the other emotions. So he’d never really cared for him at all. It had all been lies. ‘Trust me,’ Konnor had told him. ‘I’ll take care of you.’</p><p>Ethan should have killed himself like he wanted to that first day. For some time now, there had been no mention ofEthan’s offer to act as Konnor’s slave. Konnor had been treating him more like a mate, even though most of what they did in the bedroom was rough and hot. He’d loved it, though, and his submission in the bedroom was exactly what he wanted. He’d begun to think that Konnor really cared for him.</p><p>His ridiculous fantasies of a life as an alpha’s mate se emed to rise up and mock him. Was that what was really behind all the Dominance and submission play with Konnor? That must be it. How could an omega ever be good enough for any self-respecting Lycan, let alone an important alpha like Konnor Balenescu?</p><p>He thought about how tenderly Konnor made love to him each night after their play, how he kissed him like he couldn’t get enough of him. Yeah, right. From what he just heard, Konnor had more than enough of him. Stupid, worthless Ethan. Only a burden. What was it he said? A great deal of trouble. Just like today. Konnor had to cut short his ride on his vetami to bring Ethan back home because he got motion sickness.</p><p>A stab of pain jolted his stomach like the time he was in the orphanage, and they gave him spoiled milk. He’d known it was spoiled—it smelled and tasted awful, but he’d been so hungry, so anxious for somethingto fill the void, he’d taken the first thing he was offered. Latched onto it and gulped it down, not caring that it might ultimately sicken or even kill him.</p> <p>Still holding himself around the waist, he eased the door open quietly and carefully slipped down the hall. There was a back exit, so it took only minutes to make his escape. He ran outside blindly, not caring where he went or what happened to him. He only wanted to get away to clear his head. He ran behind the house and down toward the city center, only a few blocks away, not really caring or even noticing which direction he was moving in.</p><p>Konnor had told him these streets were dangerous, because of the taverns. There weren’t a great deal of visitors to Lycanus 2, but they did have a few traders and businessmen coming in and out of the city. Some of these men were Voyagers, not known for their overly civilized demeanors. That must have been why Konnor had warned him about walking alone in the area, because naturally, he wanted to safeguard his property. After all, he was planning on the council selling him to the highest bidder and he would get a nice percentage for his training efforts. He said he needed the money. Another sob racked his body, and he ran blindly out into the street.</p><p>A strong hand grabbed his arm and pulled him back, just as a jeep whizzed past on its huge tires, barely missing him. Ethan looked up dazedly into a pair of black eyes. “Look out there, pretty boy, you were about to have an accident.” The man peered down into his face, his bushy black beard bristling. “Are you Lycan?”</p><p>Ethan gazed back at him for only a moment before he closed his eyes in misery, nodding his head. “I’m an omega,” he said softly, sagging in the man’s arms. He wasn’t sure why he was telling him, other than the fact it was uppermost in his mind. He had to face what he was now, with no more pretense.</p><p>The man hissed in a breath. “A Lycan omega?” He glanced around uneasily. “Where’s your master?”</p><p>Ethan shook his head. “I don’t have one. I don’t belong to anyone.”</p> <p>The man with the beard smiled, and fastened the hand on his arm more tightly. “You do now, boy. You do now! Do you have any idea how much I can get for you? ”He put his hand on Ethan’s hip and drew him in closer. Ethan could smell the strong Lycan whiskey on his breath. “What’s your name, pretty thing? Or maybe I should just call you Blondie.”</p><p>A strange, deep voice sounded behind the man who was holding him. “Over my dead body, you son of a bitch!”</p><p>Ethan looked over the man’s shoulder to see Konnor coming at them, already half shifted, his head changing into a Lycan wolf head, and his fangs and claws extending. The bearded man holding him, his face a mask of terror, shoved him away as hard as he could, right into Konnor’s arms. Konnor gave a terrifying growl and pushed Ethan down on the ground behind him, his claws biting into Ethan’s shoulders. Once he had Ethan safely on the ground, he whirled back around to go after the trader, who was running at full tilt down the street, and only the arrival of Nikolai on the scene prevented him from catching up to him and leaping on the man, tearing him apart. Nikolai did the only thing he could do to stop him. He tackled Konnor to the ground and sat on him until Konnor calmed down enough to shift back.</p><p>When Konnor was finally back to himself, he looked up at Nikolai. “Get off me, you big bastard.”</p><p>Nikolai laughed and stood up, offering Konnor his hand. “Sorry, cousin, but Lucas doesn’t like it when we kill our visitors. I was only saving you from filling out all kinds of paperwork.”</p><p>“Yeah, whatever,” Konnor grumbled and turned a furious gaze on his mate. Ethan was still sitting on the ground where Konnor had put him and watching in fascination. “You,” Konnor said, pointing at him. “Have some explaining to do.” He jerked Ethan to his feet and held him at arm’s length, looking him up and down. “Did he hurt you? If he did, I’ll...”</p><p>“N-No...” Ethan said in a shaky voice. “He didn’t hurt me. I’m fine.”</p><p>“What in the hell are you doing out here? Why did you leave the house? If I hadn’t come to check on you when I did and found you gone...” He shook Ethan hard. “What if he’d hurt you? Or tried to steal you away?”</p> <p>“Then you’d have lost your investment, I guess,” Ethan said in a small voice.</p><p>“My investment? What in the fuck are you talking about?”</p><p>“When you sell me at auction on Lycanus 2. I heard you talking about it when I woke up.”</p><p>“When I...” Konnor looked confused at first and then he shook his head in disbelief. “Oh, for the gods’ sake.” He took Ethan’s wrist tightly in his hand and pulled him along the street behind him. “I’m not going to discuss my personal business in the streets for everyone to hear. I’ll talk to you when I get you home,” he said gruffly, over his shoulder.</p><p>When they reached the house, Konnor took Ethan directly to their bedroom, pushed him in and locked the door behind him. Ethan could hear the voices of Nikolai and Jagger outside in the hallway for a while, but they gradually faded, and he heard the front door close. Everything was so quiet after that, he figured they had left, and Konnor was too angry to come and speak with him. At least thirty minutes passed before the door opened and Konnor stepped inside. He leaned back against the closed door and stared at Ethan, saying nothing for so long that Ethan got fidgety and he spoke, even though he’d promised himself he wouldn’t be the one to say anything first.</p><p>“Well, are you just going to stand there and stare at me?” Ethan asked, irritation evident in his voice.</p><p>“You don’t really want to smart off to me right now, Ethan. I’m trying to be calm.”</p><p>“Why, or you might beat me? Isn’t that what you like to do? Why deny yourself the pleasure? What do my feelings mean anyway? I’m just a slave.”</p><p>“Ethan, Nikolai warned me not to discipline you while I’m so angry, but you’re making it very hard. You remember what I told you I’d do to you if you ever ran away from me again?”</p><p>“S-Spank me?” His voice shook a little, but he squared his shoulders, stood up and leaned over the bed. “Well, go ahead. I’m not afraid of you.”</p><p>“Oh really?” Konnor said, walking slowly toward him. He took hold of the waistband of Ethan’s pants and pulled them down to his knees in one rough motion. He put a hand on the curve of Ethan’s hip and let his fingers trail over his ass gently. “Anything you’d like to say, Ethan?”</p><p>“No. Just do it.”</p><p>A hard slap landed on his ass cheek and Ethan winced, but stood still. “One more chance. Tell me why you ran away from me again.”</p><p>“No.” Another hard slap came down on his bottom, and Ethan let out a single sob.</p><p>“Oh, damn it!” Konnor pulled him around to face him. “Stop fucking around, Blondie. I want to know what’s going on with you, and if you don’t tell me, I swear I’ll...”</p><p>“Beat me? Sell me at auction?”</p><p>“That’s the second time you said that. What is going on in that head of yours?”</p><p>Ethan cast a hurt gaze up to him. “Why didn’t you just tell me I wasn’t really your mate? Why did you have to lie about it?”</p><p>“Not my mate? What do you mean?”</p><p>“Oh, stop pretending, Konnor. I overheard you talking with Nikolai and Jagger while you thought I was asleep. I heard you tell them how you planned to sell me at the slave auction.”</p><p>A light seemed to dawn on Konnor’s face. “Not you, damn it. I was talking about selling the vetami. There are auctions for livestock on Lycanus 2 every month, and I decided to sell the vetami. No sense in keeping him if you get sick when you ride. I’m not home enough to make it worth the money to stable him anyway. He’s an expensive luxury I don’t need, especially if I can’t enjoy riding him with you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, but I...I thought...”</p><p>“Yeah, you thought I was talking about you for some crazy reason, and instead of asking me about it, you hauled your ass out of the house and took off.” Konnor shook him a little before lowering his mouth to take Ethan’s lips, thoroughly kissing him until his knees went a little weak.</p><p>He sat down on the bed and pulled Ethan onto his lap, Konnor’s warm thighs on Ethan’s naked ass caused Ethan’s cock to slowly start to fill out. Konnor looked down at it and put his hand on it, stroking up and down slowly.</p><p>“I’m sorry. I thought...I remembered what you said that first day in the arena. You told me I had to go for an auction with the council,and I’d be sold to the highest bidder.”</p><p>“That was before you became my mate, baby. They didn’t like it much when they found out, but Lucas paid them well, and they’ll get over it . Don’t you know how much I love you?”</p><p>“You love me?” Ethan asked, shocked to hear the words.</p><p>“Yes, I do, though I can’t imagine why. Oh, you’re beautiful and sweet, but you want to give yourself to my family, have me treat you like a slave, and you said you not only didn’t want to be my mate, but you didn’t love me, never would and would be unhappy as my mate.”</p><p>“Did I really say all that?” Ethan shook his head and felt a blush start up his neck. “I didn’t mean it. Not any of it. I love you so much! I’m so sorry I keep disappointing you,” he said softly.</p><p>“Who said you did?” Konnor replied, nibbling on his ear. “You’re everything I ever wanted in a mate. I think I mentioned beautiful, and sexy, and even a natural submissive. It’s still a struggle for you, that’s all. It’s my job to help you with that.”</p><p>“So you don’t think I’m a terrible submissive?”</p><p>“Well, let’s just say you still have a way to go, but you’re finding out some things about what you like, aren’t you?”</p><p>“I am? Like what?”</p><p>Konnor chuckled. “Like you don’t mind giving your submission to me, but you really don’t want to give it to anyone else, do you?”</p><p>“No,” Ethan said firmly. “Even though your brother and your cousins are handsome, they’re not you.”</p><p>“That’s good, because you belong to only me. Let ’em find their own blonds.”</p><p>Ethan sighed in contentment and snuggled closer in Konnor’s arms.</p><p>Konnor kissed his temple. “And you like being tied up.”</p><p>Ethan felt a blush from his toes to his cheeks. “I-I...”</p><p>“And spanked...”</p><p>Ethan hid his face against Konnor’s chest.</p><p>“No you don’t. Look at me.”</p><p>Ethan raised his gaze, his cheeks burning so hot he thought he must have a fever. “Yes, I like it. All of it. MostlyI liked knowing you were in control of me...but I knew I could trust you to take care of me if I got in trouble or if anything went really wrong.”</p> <p>“Good. So you like submitting to me, and you trust me...yet you still don’t want to be my mate.”</p><p>“But I am your mate, aren’t I?” Ethan asked softly.</p><p>“Yes, you are. And you have the mating bite to prove it. But you said there was too much drama in being a mate to an alpha. Too scary and stressful.”</p><p>“I-I did? I guess I said a lot of stupid things.”</p><p>“Yes, you did. Do you...still feel the same way?” Konnor’s body had gone very still and Ethan could feel his muscles tense beneath him. He gazed up at Konnor and shook his head.</p><p>“No, I love you so much it hurts, and it doesn’t scare me anymore. I can’t stand to be away from you or to have you mad at me.”</p><p>“And no more running away? When you get upset, you’ll come to me for help, right?”</p><p>“Yes, sir,” he said, nodding solemnly. “I’m sorry for all the things I said.”</p><p>Konnor bent down and took his lips possessively. He kissed him for a long time, and then raised his head to look down at him. “I think we both said a lot of stupid things when I found you again. I was angry and hurt because you ran from me, and furious at the idea that Katya hurt you and I couldn’t prevent it. I’m sorry if what I said hurt you. I never want to hurt you again, baby.”</p><p>Ethan turned in his arms and put a hand to his cheek. “I just don’t want to be something you have to take on...out of pity or a sense of responsibility.”</p><p>Konnor shook him. “Listen to me. This is not pity I feel for you. You’re omega. So what? It will only help you with your submission, and the only one you’ll ever be submitting to from now on is me. You’re not the only submissive mate of the Balenescus, you know. Both my cousins, Blayde and Nikolai, have submissive mates.”</p><p>“They do? I know you told me Jagger is, but...”</p><p>“Well, believe it—he is. He might give Nikolai hell from time to time, but in the bedroom, he’d get his bottom spanked for it.”</p><p>Ethan smiled happily. “Like you were about to do for me.”</p><p>“Exactly. But I won’t spank you now, because I know what you heard was my fault. I should have put an end to this slave nonsense a long time ago and made sure you knew how much I love you.”</p><p>Ethan bent his head and bit Konnor’s lower lip. Konnor put a hand to his mouth in surprise. “Ow! What the hell was that for?”</p><p>“Just a reminder that I have been pretty bad...maybe I need that spanking after all.”</p><p>Konnor got a gleam in his eye. “I think that can be arranged. Lie down across my knees and get comfortable, Blondie. This may take a while.”</p><p>The End </p> </body></html>"]