["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He twisted away, but her hands were still there. Burning him. Whispering across his chest like wind over water. He shivered. He sweat. He gasped for air but inhaled only her scent. He reached for sanity and found his fingers entangled in short, satiny hair. He opened his eyes and found them captured by hers. Huge, dark, innocent. Imploring, hot, sexy eyes, staring down at him as he lay trembling with desire on his bed. And he knew he was lost. He lifted his arms, slid them around her small body to pull her down to his chest. Parted his lips to taste her succulent mouth...</p><p>And there was nothing there. He lay panting and alone, his torso and face coated in a slick sheen, his arms wrapped around themselves. He sat up fast, blinking in the gathering dusk, grabbing the first thing his fist closed on and hurling it into the opposite wall. Both hands pushed through his hair. Dammit, he was still shaking, still hotter than hell for some fantasy woman; a dreamworld pixie who looked more like Peter Pan's Tinkerbell than a swimsuit-issue cover girl.</p><p>What the hell was the matter with him?</p><p>\"Pressure.\" He muttered the word to himself and slid naked from the bed for his ritual cold shower. The dreams had been coming for months on a regular basis.</p> <p>\"Stress,\" he added, stomping into the hotel bathroom, flicking the light, twisting the knobs.</p><p>It was the job. Hell, it would get to anyone. He'd failed his last mission, damned near got himself killed while he was at it.</p><p>His latest assignment had been handed down eight months ago and he still hadn't had any success. So many close calls, so many near misses. Every time he thought he had her, she pulled some trick out of her sleeve and slipped right through his fingers. And almost didn't cut the mustard with DPI. An agent for the CIA's secretive Division of Paranormal Investigations had to deliver the goods. He was closer than he'd ever been to doing just that. She was here, in this small, middle-of-nowhere town in northern Maine.</p><p>Stephen \"Ramsey\" Bachman was a hunter of sorts, but his quarry wasn't human. She was a vampire.</p><p>It was her house and she had finally come home to roost. The place was like something out of an old Vincent Price movie. Big and gothic and sadly in need of a coat of paint. The front door was unlocked. It was just before dusk.</p> <p>Finally, he had her cornered, right in her own backyard. She'd been on DPI's Most Wanted List for more than a decade. He didn't know why. It wasn't his business to know why, just to bring her in. And he had a feeling he was about to do it.</p><p>He gripped a small leather satchel in his right hand. Inside were three syringes, each containing a dose of tranquilizer developed by legendary DPI researcher Curtis Rogers. His original formula had been lost when he had been killed, probably by one of them, though no one had ever proven it. But Bachman didn't need proof. They were all the same, ruthless killers who preyed on the innocent.</p><p>DPI's scientists had been painstakingly working to recreate Rogers's tranquilizer and they thought they'd finally succeeded. He swallowed hard.</p><p>Tonight would be its first actual test.</p><p>The huge, darkly stained door groaned when he pushed it open. His steps echoed on the dusty, time-dulled parquet. He ignored the baroque furnishings, the dark woodwork, the cobwebs, the dust, and he headed straight for the spiral staircase. It creaked with every step.</p><p>He'd cased this house early on, as soon as he'd learned she owned it. He knew the basement was prone to flooding and that there was only one room in the place with no windows. That room was where he was heading right now. It had been empty the first time he'd seen it, but he had a strong feeling it wouldn't be vacant tonight.</p> <p>He reached the top of the stairs and started down the tall, narrow corridor, moving right past the rows of closed doors. He knew which door hid his nemesis.</p><p>When he reached it he paused with his hand on the knob.</p><p>His first inkling that something wasn't quite right came when he turned the knob and it gave without resistance. His feet planted, he stood still a moment, listened, feeling the very air around him for a warning, a sound.</p><p>Nothing.</p><p>He pushed the door inward and stepped slowly inside. Nightmarish candlelight illuminated the entire room. A hundred tapers danced and flickered, casting lively shadows on the walls, the ceiling, the floor. And there was music. The melodramatic chords of a ghostly pipe organ floated softly on the air. A little chill raced up his spine. Not one of fear, induced by the music and candles. But one of foreboding, as he wondered just what in hell she was up to this time.</p><p>The coffin gleamed black with shining brass trim from atop a flower-strewn bier.</p><p>He stepped forward, noting the dead roses at the head and foot. Nice touch. If he found her, he thought he'd choke her before he ever took her in. He was tired of this, tired of her games and jokes, all of them seemingly designed to make him look like a fool.</p><p>He approached the coffin, glancing over his shoulder every second or two, just in case.</p> <p>A thick curtain of cobwebs stuck to his face and he swept it aside with an angry gesture. The music swelled a little louder, he thought as he put his hands on the lid.</p><p>Jaw clenching, he opened it.</p><p>Then he stood there, blinking in shock as he stared down at the most horrendous creature he'd ever seen. She had hair like a matted rat's nest, tight facial skin tinted blue, with black rings encircling the sunken, closed eyes. The cheeks were hollow, gaunt. The lips were pulled back in an almost snarl, baring the pointy tips of yellowed incisors. He could count the bones in the narrow hands that lay crossed upon her chest. The gruesome image, along with his own, was reflected in a mirror on the inside of the lid.</p><p>Ramsey poked a finger into the skin of her arm, then let his chin fall to his chest as he blew every bit of air from his lungs. She'd done it to him again, damn her. The body in the coffin was made of wax. And Cuyler Jade was probably a hundred miles away from here by now.</p><p>Soft laughter, like crystal water bubbling over smooth stones, filled the room.</p><p>He stiffened and spun around. The woman stood in the doorway, her hand over her mouth, her mischievous eyes twinkling with candlelight and mirth.</p><p>\"If you could have seen your face...\" She laughed some more, closing her eyes and tipping her head back.</p><p>She was tiny. Her gleaming black hair was cut short, with spiky bangs on her forehead and jagged ends laying on her neck. She brought her head level and tilted it slightly as she studied him. She looked like a pixie, like Peter Pan's Tinkerbell.</p><p>Impossible. It's your imagination, dammit. She's not the woman in your dreams.</p><p>He said nothing. She stepped into the room, bold as brass. \"I'm kinda tired of this endless chase, Ramsey.\"</p><p>He blinked. \"What did you call me?\"</p><p>\"Ramsey. Isn't that what all the guys in military school dubbed you? Stephen Bachman from Ramsey, Indiana, became Ramsey in the tenth grade, if I remember correctly.\" She smiled and moved closer. \"Don't look so surprised. Isn't the first rule of all you secret agent types to know your enemy?\"</p><p>He watched her approach until she stood only inches away from him. She wasn't the one he was after. She couldn't be. She was the imp from his dreams. The erotic, sexy, innocent-eyed devil that smiled as she touched him. The one that drove him half out of his head with pure animal lust. She wasn't a monster.</p><p>She offered a tiny hand, and as he closed his huge one around it she told him the last thing he wanted to hear. \"I'm Cuyler Jade. The one you've been chasing all over the country for the past eight months.\"</p><p>He swallowed the sand-covered rock that seemed to have lodged in his throat, and quickly dropped her hand.</p><p>\"So here I am,\" she told him. The impish light in her eyes was tempered with a hint of uncertainty. The brazen smile on her lips, a little unsteady. \"Question is, Ramsey, now that you've got me, what are you gonna do with me?\"</p><p>He stiffened his back. Okay, so she was a vampire. And he'd had recurring, wildly erotic dreams about her for the past several months. Almost as long as he'd been after her. So what? He had a job to do, and that was his priority-not his unruly libido.</p><p>\"I'm going to arrest you.\" His voice sounded cold, harsh. Good. \"You're now a federal prisoner, Ms. Jade. I'm taking you back to New York, to our headquarters in White Plains.\"</p><p>\"Are you?\"</p><p>God, her eyes were big. And dark. And those thick lashes made him think of Bambi, made him feel like the heartless hunter.</p><p>\"Afraid so.\"</p><p>\"And what if I won't go with you? You going to overpower me?\"</p><p>She knew he couldn't do that. Remarkably, she stood still while he opened the satchel and brought out one of the syringes. \"I could tranquilize you.\"</p><p>She frowned at the hypodermic. \"That stuff work?\"</p><p>He shrugged. \"One way to find out.\"</p><p>He reached for her arm, but she danced away from him before he could grip it.</p><p>Tapping her chin with a coral-tipped finger, she faced him once again. \"Suppose I was to come along peacefully?\"</p><p>He studied her through narrowed eyes, all too aware of her knack for tricks and pranks. \"Why would you do that?\"</p><p>Her black eyes narrowed. She came back to him, leaned in so close her breath fanned his throat. One of her small hands came up and her fingertips danced over his nape. \"'Cause you're not going to go through with it, Ramsey.\"</p><p>He swallowed again, hoping she wouldn't press any closer and accidentally discover the effect she was having on him. He shifted his stance and tried to remind himself what she was. She only looked like a woman. Beads of sweat popped out on his forehead, and he tried to summon the will to jab the needle into her arm before she could slip away again.</p><p>Instead he only managed, \"What makes you think so?\" His voice sounded coarse.</p><p>Not at all as intimidating as it ought to.</p><p>Her lips curved upward just a little. \"I know about the dreams,\" she whispered.</p><p>He didn't let it shake him. All right, it shook him, but he didn't let it show.</p><p>\"Because you caused them? Another one of your tricks?\"</p><p>She shook her head. \"I don't know what caused them, Ramsey. But I've been having them, too.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She watched him, waited to see his reaction to her words. She truly believed what she'd told him, that he wouldn't be able to take her into custody. But she didn't think he was fully aware of it. Not yet, anyway. Ramsey Bachman had a thing or two to learn about himself. And Cuyler had decided she was the only one who could teach him.</p><p>He was speechless for a long moment. Then he shook his head, staring at her from wary, deep gray eyes. \"You're a good liar, Cuyler. But not that good. You haven't had any dreams about me.\"</p><p>\"No? Want me to describe them to you?\"</p><p>\"No.\" He said it too quickly.</p> <p>She smiled. \"I get to you, Ramsey. You know I do. It's not a big surprise, really. You get to me, too. I'm not afraid to admit it.\"</p><p>\"Dream on, Cuyler.\" Still holding the syringe in one hand, he clasped her arm with the other and turned her toward the door. \"Come on, if you're so eager to surrender. My car's out front. You want to pack a bag?\"</p><p>\"Not just yet.\" She resisted the urge to pull her arm away yet again. She couldn't do that, couldn't let him think she was up to something. But the big boys from DPI were getting restless waiting for Ramsey to bring her in. Much longer and they'd come for her themselves, and she'd rather take her chances with Ramsey than with them. She had to play her cards fast and well.</p><p>The wariness had never left his eyes. It only intensified \"You're trying to pull something on me.\"</p><p>\"I have a deal to offer you. Take it or leave it, it's up to you.\"</p> <p>\"No deals. You're coming with me. Now.\"</p><p>\"No. I'll come in with you in a few days. Without a peep. No tricks, no struggles, no fuss. I promise.\"</p><p>\"And I'm supposed to believe you?\"</p><p>\"You want me to write it in blood?\"</p><p>He released her arm, let his own hang loosely at his side, and stared at her so hard she could feel the touch of those eyes. More than that, she could feel the anger behind them, and the pain. And her arm still tingled where he'd held it.</p><p>It still baffled her, this awareness between the two of them. This attraction.</p> <p>She'd felt it before she'd even laid eyes on him.</p><p>\"What do you want in return?\"</p><p>\"Hmm, a hunk with a brain. You're a rare specimen, Ramsey.\"</p><p>\"What do you want?\" he repeated, impatience giving an edge to his voice.</p><p>She tilted her head, shrugging delicately, walking in a small circle with a happy bounce in her steps. He was faltering. He wouldn't even have asked unless he was considering giving in. \"Nothing much. Just a little bit of your time.</p><p>Three nights of it should be enough.\"</p><p>\"Three-\"</p><p>She stopped, spinning on her heel and pointing at him. \"You spend three nights with me. At dusk on the fourth, I'll be ready and willing to head off to Nazi headquarters with you. Okay?\"</p> <p>He shook his head slowly. \"Three nights...doing what with you?\"</p><p>She rolled her eyes, threw her palms up. \"Not that, for crying out loud. Crimey, if that was all I wanted from you, I could have had it months ago!\"</p><p>\"The hell you could.\"</p><p>Forget it, Ramsey. I'm right and you know it. Picture it. You from one of those hot and heavy dreams to find the real thing naked in your arms. You tellin' me you'd roll over and go back to sleep?\" She moved closer as she spoke, leaned into him, stood on tiptoe until her nose nearly touched his chin. \"I don't think so.\"</p><p>\"I don't give a damn what you think.\"</p><p>She shrugged, but backed down and resumed her circular pacing.</p><p>\"So if you don't want me sleeping with you, then what are the three nights for?\"</p><p>\"I sleep during the day.\" She ruffled the short layers of her hair with both hands. He was exasperating. She hadn't expected it to be this difficult. She turned away from him, picked a slender white candle from its holder and tilted the flame to an incense dish, igniting the cone in its center. She inhaled the sweet fragrance. Just because she hadn't expected difficulty didn't mean she hadn't prepared for it.</p><p>\"Look, Ramsey, I need to spend some time with you if I'm going to figure this out, that's all. I just want to get to the bottom of this...this thing.\"</p><p>\"What thing?\"</p><p>She made two fists, held them near her temples and squeezed her eyes tight. She was going to hit him if he didn't stop acting so obtuse. She took a step backward, and he very logically advanced an equal distance. He stood near the incense. A spiral of scented smoke rose around his head.</p><p>\"You know I could have killed you months ago, or hurt you so badly you would have been off my case for a long time,\" she told him. \"I could have closed my eyes and given one good mental scream and had half a dozen older, stronger ones here to get rid of you for me.\"</p><p>\"Then why the hell didn't you?\"</p><p>\"I don't know! That's the thing I want to get to the bottom of! I can't even think about hurting you. Hell, I've got this off-the-notion that I ought to be looking out for you, but-\"</p><p>\"You? Looking out for me? That's a laugh.\"</p><p>\"Damn straight, when I know you're planning to haul me off to a death camp.\"</p><p>\"It's not-\"</p><p>\"Don't bother, Ramsey. DPI's research techniques are well documented. Look, I made you an offer. What's your answer?\"</p><p>He shook his head slowly, then pinched the bridge of his nose with two fingers and shook it again. Glancing down at the syringe in his hand, he straightened a little. \"Sorry, Cuyler. I've been the butt of too many of your tricks. I don't believe you for a minute, and whether it's three nights from now or not, I'm still taking you in. Why delay the inevitable?\"</p><p>She lowered her head, looked at the floor. \"Well, I'm sorry, too. But I'm afraid you don't have a choice in the matter.\"</p><p>He lunged toward her, but she'd known he would. She was ready. Before he could blink, she snatched the offensive little hypodermic from his hand. She snapped the needle with her thumb, dropped it on the floor and crushed it under her foot. Facing him, she lifted her palms. \"Try again?\"</p><p>\"Damn you...\" His voice trailed off. He squeezed his eyes tight, opened them, closed them again.</p><p>She stepped closer to him.</p><p>\"What...what did you...\" He swayed backward.</p><p>Cuyler gripped his shoulders, held him steady. \"You'd better sit down, Ramsey.\"</p><p>He did. His legs folded and he hit the floor hard, but remained upright, one palm pressed to his right temple. He lifted his head to look at her, the gleam of anger in his eyes dulling. \"I knew...I couldn't...trust one of you.\"</p><p>\"You can, Ramsey. I promise, you can.\" She knelt beside him as his eyes closed.</p><p>His body fell backward, but she caught him and eased his shoulders and head to the floor. She bent close to his ear and whispered, \"You'll see.\" She stood and snuffed out the drugged incense.</p><p>He opened his eyes slowly, warily, and registered surprise that he was still able to do so. The throbbing in his head was enough proof that he was still alive. So she'd only drugged him. But for what purpose?</p><p>He struggled to sit up, only to feel her hands on his shoulders pressing him back down. \"Lie still for a while. Here, this will help\" She laid a hot cloth across his forehead.</p><p>He blinked her into focus, then looked beyond her. The room was dim, but he knew with a glance that they weren't in her tumbledown house. He'd been all through it. There'd been no canopy bed surrounded by sheer black curtains. No stone walls. No fireplace snapping and crackling with red-orange heat.</p><p>\"Where the hell am I?\"</p><p>She pursed her lips. \"My hideaway. I can't tell you where, exactly. Just in case I'm wrong about your inherent sense of decency. I wouldn't want you running back to DPI with directions to my one and only haven.\"</p><p>He grated his teeth. He'd strangle her as soon as he got his strength back. He didn't think he could stop himself. With an angry snarl he sat up, brushing her hands away. His feet swung to the floor and he got up, swayed a little, caught himself. Then he walked unevenly toward the arched window cut into the thick Stone wall. He braced himself against the cold sill and stared through the thick, tinted glass.</p><p>All he saw was snow. Gentle hills and valleys of it, without end, unrolling like a lumpy sheet beneath a starry sky.</p><p>He turned toward her again, dazed with disbelief. \"Where the hell am I?\" he repeated.</p><p>\"North. You are definitely north.\"</p><p>\"North of what?\"</p><p>\"Just about everything.\" She ended with a little laugh, those eyes of hers glittering with mischief.</p><p>\"Dammit, Cuyler-\"</p><p>\"Look, all you need to know is that you're miles from another human being. There are no roads, no transportation, and no Phones. Nothing. Just you and me, together for the next three nights. Just like I told you.\"</p><p>Letting his head fall backward, he stared up at the vaulted ceiling, the gaslights glowing in the chandelier.</p><p>\"Don't look so upset. I'll take you back when I know what I need to know.\"</p><p>He shook his head, met her gaze. \"If there's no transportation, then how the hell did we get here?\"</p><p>\"That doesn't really matter.\"</p><p>He pushed one hand through his hair, scanned the room, spotted the open door and left her standing there. She followed him. He heard her steps on the ceramic-tiled floors as he moved quickly through the corridor, glancing into rooms furnished as if for some fairy-tale princess. Satins and ruffles and lace.</p><p>Trinkets he didn't take time to examine littered every surface.</p><p>He found the stairway, broad and stone with a gleaming hardwood banister, and he hurried down it. Another fireplace. More gaslights, more stone. More expensive-looking antique furniture.</p><p>The front doors were huge, and double, with stained-glass panes in starburst patterns centering each of them. And they were unlocked. He flung them wide and stepped out into the biting wind, bitter cold. There was nothing. As far as he could see, there was just nothing. A sense of doom settled on his shoulders like a thousand-pound pillar.</p><p>She touched him again. Her small hands closed around his upper arm and tugged at him. \"Come back inside, Ramsey. It's going to be all right, I promise you.\"</p><p>He lowered his head. The wind stung his face, his ears. He let her pull him back inside, but he was shaking his head. \"It isn't.\"</p><p>\"It will.\" She closed the doors, turned to face him.</p><p>\"There are things I need...\"</p><p>\"I know. The insulin.\"</p><p>His head came up fast. \"How do you-\"</p><p>\"I brought everything from your hotel room. Your clothes, the medicine, everything. The only thing I didn't bring was that nasty drug you were planning to inject me with.\" She closed her eyes, shook her head slowly. \"That really disappointed me, Ramsey. I didn't think you'd do it to me, but you were going to.\"</p><p>\"Immoral bastard that I am, right? I notice you didn't hesitate to do the same to me.\"</p><p>Her brows rose, then she smiled a little and gave a shrug. \"Guess you have me on that one. But, honestly, the incense is harmless. It just lasts a few hours and the only side effect is a bad headache.\"</p><p>He rubbed one throbbing temple with his forefinger. \"Tell me about it.\"</p><p>\"You want something for it? Aspirin or-\"</p><p>\"I don't want anything except to get the hell out of here.\" He was angry. He hated feeling trapped, forced into a situation he didn't like. And he sure as hell didn't like this. Being locked away in a miniature castle with the object of his most vivid, graphic fantasies. Knowing he couldn't lay a hand on her.</p><p>Hell. That's what this was. Hell on earth.</p><p>\"And you will. Soon. But, Ramsey, there are things I have to know.\"</p><p>\"If you think you can pry any DPI secrets out of me-\"</p><p>\"Not about your precious organization. About you.\" She reached out to him, took his hand, drew him into the huge room, and pressed him into a chair near the fire. \"Relax, Ramsey. Please, just try to accept that you're going to be here for a few days, so we can get on with this. Think of it as a mini-vacation.\"</p><p>He looked up into her innocent eyes, marveling that they could hide so much deceit. \"A vacation?\"</p><p>\"It's warm and safe. There's plenty of food. I have wine, too. Your favorite kind. You want some?\"</p><p>\"So you can knock me out again?\"</p><p>\"I don't need to knock you out again.\"</p><p>She turned and walked away from him, fishing a bottle of white zinfandel from an ice bucket on a nearby pedestal table. She poured some into a glittering cut-crystal glass and brought it to him, pressing it into his hand. He'd had time to get up and run, but what was the use? There was nowhere to go.</p><p>She knelt down in front of his chair, her hands resting on his knees, and stared up at him with more intensity in her eyes than he'd ever seen. He braced himself against that look. He wasn't going to believe a word that fell from those full, moist lips. And he wasn't going to entertain a single erotic thought about her current position.</p><p>\"I want to tell you something, and I want you to listen to me. I'm out of tricks and tired of games. Everything I say to you from here on will be nothing but the truth. I'd like for you to return the favor.\"</p><p>She paused, waiting. He said nothing.</p><p>\"Ramsey, if you take me to that research lab in White Plains, I'll die. And I won't be the first.\"</p><p>\"That's bull. DPI isn't in the habit of murdering-\"</p><p>\"But they are.\"</p><p>Ramsey shook his head hard. \"They're scientists. They want to learn all about you-\"</p><p>\"They want to eradicate us from the planet.\"</p><p>\"Yes.\" He sighed, admitting that much. \"Yes, but not by killing you. By finding a cure.\"</p><p>Her eyes flashed with anger and for just a second he felt the force of her rage.</p><p>\"A cure. Where do you get this stuff, Ramsey? It's not a disease. We don't need a cure for what we are any more than you need one for being tall or for having gray eyes.\"</p><p>He was skeptical. \"You wouldn't like to be human again, to feel again?\"</p><p>\"I'm as human as you are, dammit. And what makes you think I don't feel?\"</p><p>She stared up into his eyes, her own brimming with so much emotion he almost wondered if she might somehow be an exception to the rule. But her eyes narrowed and she looked at the floor.</p><p>\"The good ol' DPI handbook, right, Ramsey? We're all animals. Emotionless, cold-blooded killers.\"</p><p>He swallowed the lump in his throat. \"Aren't you?\" He wasn't asking. Not really.</p><p>He knew what they were.</p><p>She bit her lower lip, blinked fast. \"No. But they are. Do you have any idea how many of us have died at their hands, in the name of their so-called research?\"</p><p>\"And yet you promised to go there with me, willingly, after these three nights.\"</p><p>If he sounded skeptical, then he was. He wasn't as gullible as she apparently thought he was.</p><p>\"Yes. If you still want to take me there.\"</p><p>\"Why?\"</p><p>\"Because I know that you won't. I'm as sure of that as I am of my own name, Ramsey. I don't know why, but I am.\"</p><p>He shook his head slowly. \"That doesn't make any more sense than dragging me up here.\"</p><p>\"I think it does.\" She closed her hand around his, held it there, and he felt the warmth of her flowing into him, through him. A tingling awareness skittered along his nape, up his spine. Something odd happened to him. He felt invaded, as if her very soul was seeping into him, or his into her, or something.</p><p>\"Do you feel it?\" she whispered. \"There's something between us, Ramsey. You know there is.\"</p><p>He shook his head in denial and tugged his hand away from hers. It was no more than another of her tricks.</p><p>\"It's more powerful than the connection I feel with one of the Chosen.\" She said it softly, eyes downcast.</p><p>\"The Chosen...that's your term for humans with that rare belladonna antigen in their blood?\" He sat forward a little, thinking maybe he'd get something out of this forced incarceration, some kernel of knowledge to take back with him. If he ever got back.</p><p>She nodded. \"They're the only ones who can be transformed. We all had that antigen as mortals. But you don't have it. I'd have known right away if you did.\"</p><p>\"How?\"</p><p>She rose, chewing her full lower lip with even, white teeth. \"We sense them. I can't explain it, but we always know. We have an instinctive need to watch over them, protect them- \"Make them into what you are?\"</p><p>She shook her head. \"No. Never, unless they want it and we're sure they can handle it. Most couldn't deal with it, I think.\"</p><p>He leaned back in the chair, studying her face for a long time. She was telling him things she didn't have to tell him. And she was being honest. He'd read up on the connections between certain humans and vampires. What she said matched the research DPI had done on the subject. So, was she serious about not lying to him, or was she just trying to gain his confidence?</p><p>Stupid to even consider that she was sincere. She was just baiting her trap.</p><p>\"There's usually one person in particular to whom a vampire feels the strongest connection,\" he said, quoting almost verbatim from the studies he'd read. \"Is that right?\"</p><p>She paced away from him, nodding as she went.</p><p>\"So, who's your pet mortal?\"</p><p>She stood right in front of the fire, her back to him. \"You are.\"</p><p>Ramsey blinked, then forced the shock into submission and tried to keep a logical, analytical mindset. \"That doesn't make any sense, Cuyler. I don't have the antigen.\"</p><p>\"You think I don't know that?\" She shouted it as she whirled to face him.</p><p>He stood and slowly moved toward her, searching her face for a sign she was lying. He saw only turmoil and frustration in her eyes, as real as if she were honestly experiencing those feelings. She had him completely confused, and he didn't like it.</p><p>\"Then why do you think-\"</p><p>\"I dream about you, Ramsey. I think about you when I'm awake. I know when you're angry, when you're sick, when you're in pain.\"</p><p>She grasped his shoulders, and he couldn't believe that there was moisture in her eyes.</p><p>\"I want you to the point of madness, but it's more than that.\"</p><p>She wanted him. And that should scare the hell out of him, because he knew that with her kind, sexual desire was so closely entwined with the bloodlust that the two became inseparable. If she wanted him, then she not only wanted him in bed.</p><p>She probably wanted to drain him dry, too.</p><p>Another reason to keep his mounting desire under control. Hell, if he gave in to it, he'd end up dead.</p><p>\"You're out to destroy me,\" she went on, her voice catching in her throat. \"I ought to be running away from you as fast as I can go. But all I feel is this longing to be as close to you as I can get.\"</p><p>She released him, looked at the floor, and he saw the way her lips trembled.</p><p>\"My rest is torment. I wake up frustrated and confused instead of rested and strong. It's driving me crazy, Ramsey. All I want to do is figure out why. Can you really blame me for that?\"</p><p>Ramsey had trouble swallowing when a single tear spilled onto her cheek. Not a manufactured one. She quickly turned away from him, brushing the back of one hand over her face to wipe it away. For some reason he had the urge to wrap his arms around this suffering pixie and make it all right for her. He grated his teeth, stiffened himself against the softening that seemed to be happening inside him. She was the enemy. She was a master of lies. She had murder on her mind; his murder. He had to remember that. He didn't know what she could possibly have to gain by convincing him of all this bull, but there had to be something.</p><p>In a private office on the fifth floor of a building in White Plains, N.Y., three men stared at a small, lighted screen, watching the little red blip flash on and off incessantly.</p><p>\"It has to be a malfunction,\" Stiles said.</p><p>\"No. No, it makes perfect sense. It's dark there eighteen hours straight, this time of year,\" Whaley argued. \"Perfect for one of them.\"</p><p>\"But why would she take him there?\"</p><p>The third man hadn't spoken yet. He removed a pipe from his teeth and tapped spent tobacco into a plastic ashtray on his desk. \"I knew he'd turn on us. Hell, it was a given. A matter of time. I'm just glad we planted the tracking device in his suitcase.\"</p><p>\"A matter of time?\" Stiles frowned, puzzled. \"You sound as if you were expecting this.\"</p><p>\"I was,\" Fuller said.</p><p>\"But, Mr. Fuller, I don't-\"</p><p>\"Until you need to know, don't bother asking.\"</p><p>Stiles sighed hard, but nodded his acceptance. \"So, what do we do?\"</p><p>Wes Fuller paced the room for a moment, his bulk making his steps fall heavily.</p><p>Then he calmly began refilling his pipe. \"We get some maps, some more information, some equipment, and we go up there. Get ourselves two research subjects for the price of one.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It wasn't the castle it at first appeared to be. It was actually no bigger than an average house, all made of stone, blocks of it two feet in depth. Deep gray here, lighter there. Sometimes nearly white. It had the huge rooms and high ceilings of a mansion. But the place wasn't what it seemed. The ground floor consisted of only three rooms. The palatial front one with the fireplace, a dining room fit for a king, and a tiny cubbyhole of a kitchen with a fridge and stove that appeared to be gas-powered, like the lights. He tried the faucets, found they worked. Hot and cold. The place had every comfort.</p><p>It was a whimsical place. Made him think of the castles and enchanted cottages in fairy tales. Everywhere he looked there were crystals. Huge blocks of quartz with jagged points like countless fingers, sparkling at him. Glittering purple amethysts. Lapis lazuli, so blue it hurt your eyes to look at it too long.</p><p>Tiger's eye, flashing and winking yellow and gold at him as he passed. And a hundred others he couldn't identify. Tiny pewter statuettes peered up at him from every inch of space not occupied by a stone. There were fairies, unicorns, dragons, wizards, castles on high. My God, there Were hundreds of them. And the art that adorned her walls held similar themes. No pastels, though. Grim colors, grays and browns and dull blues. Lots of charcoal sketches. Pegasus. Pan. An ugly creature that might have been a troll.</p><p>Interesting.</p> <p>\"Looked your fill yet?\" She sat on a beanbag chair near the fire-a beanbag!-with her legs curled beneath her. She hadn't followed him, seeming content to let him explore the house on his own. More evidence there was really no way out. If there was a chance he could escape, she wouldn't have let him out of her sight.</p><p>\"I haven't looked upstairs yet.\"</p><p>\"Three bedrooms, with a bathroom between two of them. No big deal. Can we sit down and talk now?\"</p><p>\"The place is smaller than it looks. The size of the room is deceptive.\"</p><p>\"Astute observation. Please, Ramsey, I have so much I want to know.\" She sat a little straighter, pleading with those big, round eyes that seemed to want to suck him into their depths.</p> <p>\"How'd you ever find this place?\" He poured himself some more wine, his back to her. He had to avoid looking at her if he was going to manage to remain in control, maybe get her to let something slip, like how the hell he could get out of here.</p><p>\"I had it built. Always wanted a castle all my own. Ever since I was a little girl.\"</p><p>That tidbit made him turn to face her. His next question was impulsive and not at all what he'd intended to ask. \"How old are you, Cuyler?\"</p><p>\"Ninety-nine.\" She smiled fully when she said it. Her smile was something to see. Made her eyes crinkle at the corners and sparkle with mischief. \"Pretty spry for my age, huh?\"</p><p>\"How long have you been-\"</p><p>\"Didn't do much research on me, did you, Ramsey?\"</p> <p>He shook his head. \"Research isn't my job.\"</p><p>\"Right. I forgot. You just hunt us down and bring us in.\"</p><p>\"I'm not going to apologize for it.\"</p><p>\"Who asked you to? I just wondered why you suddenly wanted to know about me.\"</p><p>She turned to stare into the firelight. It made her eyes glow, and gleamed its reflection on her multilayered ebony hair.</p><p>\"I'm curious.\"</p><p>\"Is that all?\" She didn't look at him. Just sighed softly before she went on. \"I was twenty-five. My sister and I danced at a gin joint in Chicago during the height of Prohibition.\"</p><p>He stopped with his wine halfway to his lips and just stared at her with his mouth gaping. \"You were a flapper?\"</p> <p>She shrugged, looking at him, grinning. \"I was young and I needed the money.\"</p><p>He laughed. He couldn't help it, she was funny. She'd always been funny. Every time she'd pulled one of her pranks on him and slipped out of his reach, she'd done it with a stroke of humor that couldn't be ignored. More than once he'd been in the midst of anger and frustration, only to find himself smiling and shaking his head at her wit. That dummy in the coffin at her house had been just one more example of her impish streak.</p><p>He stared at her, tilted his head a little. He could see her very clearly in his imagination, wearing a fringe-covered sac dress and a headband with a feather.</p><p>Then his laugh died. He wasn't sure he wanted to hear any more. Seeing her as a real person with a life and a past would only make this harder.</p><p>\"Honestly, I loved to dance. We both did. And we were good at it.\"</p><p>\"I'll bet you were.\" It slipped out before he thought about it. He averted his eyes, cleared his throat. \"So, what happened?\" He could have kicked himself.</p><p>Hadn't he just decided he didn't want to know?</p><p>\"There was this woman, the most beautiful woman I'd ever seen in my life. She was elegant. No, regal is a better word. But she was fun, too. She used to come in all the time, bugged us to teach her the dances. One night she came in dressed as a flapper and joined us on stage.\" Cuyler shook her head slowly, smiling, the movement drawing his gaze against his will. \"She was something.</p><p>Every man there wanted her, but she never seemed interested. And when the lushes got a little out of hand with us, she'd step in and scare the hell out of them.\"</p><p>Ramsey wondered what man in his right mind would be interested in any other woman when Cuyler was in the room, then frowned and reminded himself what he was doing here. \"Who was she?\"</p><p>Cuyler only leaned back in her beanbag, drew her knees up to her chest and wrapped her arms around them. She ignored his question. \"One night there was a raid. FBI. G-men as we called 'em back then. The owners fought back, naturally.</p><p>The rest of us got caught between machine guns.\"</p><p>She released her legs and rolled to her feet with a little bounce. She walked toward him, stopped when she stood right in front of him, then caught the hem of her blouse and lifted it.</p><p>Ramsey licked his lips and tried to deny his instant reaction to the sight of that taut skin, her flat belly, the curve of her waist, the dark well of her navel. He stiffened when she took his hand and pulled it toward her, but he didn't pull away. And then his palm was pressing to her warm flesh and he felt odd puckers that shouldn't be there. They barely showed, but he could feel them.</p><p>He frowned, moving his hand over her waist, feeling more of the puckers, and more on her rib cage. Slowly, it dawned on him just what these scars had to be, and for some reason his stomach convulsed, twisting into a knot, and a hot fury came to life in its center. He set the wine on a stand and stood, both hands on her warm skin now. Clasping her waist, he turned her slowly and ran his palms over the small of her back, as well, then higher, slipping them beneath her blouse and up to her shoulder blades.</p><p>He tried to swallow as he felt the scars left on her smooth flesh where the bullets had passed through her body. But he couldn't. His throat had closed off.</p><p>He had a sudden image of her, with her short ruffly hair held in place by a feathered headband, her fringed dress filled with holes, her small pixie's body riddled by bullets.</p><p>His hands stilled on her skin. He closed his eyes, trying to block out the image.</p><p>She leaned back just slightly, pressing herself closer to his touch. \"My sister was killed, and I wasn't far behind her. But that woman found me in the chaos.</p><p>She took me out of there while the bullets were still flying. I don't know how, but she did. She laid me down in the alley and she asked me if I wanted to live.\"</p><p>\"And you said yes.\"</p><p>She turned to face him and somehow his hands ended up on her shoulders. He ought to move them away. He really ought to.</p><p>\"What would you have said?\"</p><p>He shook his head slowly. It wasn't a clear decision between good and evil. It wasn't an easy question to answer. Not the way he'd always thought it would be.</p><p>He couldn't get the image of it out of his mind, her small body jerking like a marionette's as bullets tore hot paths right through her. Her lying still, the life seeping away from her. Why was this so vivid to him? Why did he feel as if he'd witnessed the whole thing? His hands tightened a little on her shoulders, a natural reaction to the sensation of her life slipping away. \"I don't know.\"</p><p>Her hands rose in slow motion, came to rest lightly on his chest. \"I probably wouldn't have known, either, if she'd asked me while I was strong and alive. But I was bleeding. I was dying. I couldn't even feel the pain by then. And I said yes.\"</p><p>He couldn't blame her. He couldn't imagine himself in the same situation doing anything differently. But the decision, that single moment in time, was only the beginning. And he found himself wanting to know more. \"What about afterward?</p><p>When you were changed, a completely different being? Did you regret your choice?\"</p><p>She closed her eyes, smiled softly. \"But I wasn't a different being. Ramsey, the changes were physical. I was the same person inside. A little flaky, maybe. A believer in fairy tales. A practical joker. I was the same. I still am.\"</p><p>His stomach clenched. For a second he wondered what right he had to drag this woman off to DPI's research center. He stared down at her wide eyes, her moist lips, and felt her lean toward him. His hands tightened on her shoulders. She rose on tiptoe and tilted her head up, fit her mouth to his...</p><p>The hiss of resin seeping from the firewood got louder just as he caught her lips, began sucking at them, tracing their shape with his tongue. A loud snap worked like an electric shock, jarring him out of the spell she'd woven around them. He wouldn't have fallen so easily unless she had. He deliberately called up the image of his mother's lifeless body and unseeing eyes, focused on it to remind himself of why he'd joined DPI in the first place.</p><p>He lifted his head and pushed her away. Dammit, she was playing with his mind, making him feel things he had no business feeling. Those dreams he'd had of her, these pictures she was drawing for him, it was all part of her plan.</p><p>He looked at her. She was biting her lip, shaking her head, looking everywhere except at him. \"I'm sorry. I didn't mean to-\" She spun in a circle, pushing both hands through her dark hair, ruffling it until its short layers resembled the feathers of a flustered raven. \"It won't happen again. That's not why I brought you here.\"</p><p>She was apologizing. He gave his head a shake. Why the hell was she apologizing?</p><p>\"Look, Ramsey, I'm not trying to seduce you into anything. If we can come to an understanding, I want it to be because you've thought things through and listened, and you believe me. Not because your libido was too strong to resist.\"</p><p>He blinked twice, more confused than ever. Seduction would be her best weapon here. Did she mean to tell him she wasn't even going to try? And why did that idea feel like such a letdown? Hell, he ought to be relieved. At least he wouldn't have to worry about her passions taking over and him ending up dead.</p><p>Glancing at the grandfather clock in the corner, he felt his eyes widen. They'd been talking for a couple of hours, yet it hadn't seemed more than a few minutes.</p><p>She followed his gaze, shook her head. \"You ought to eat, Ramsey. And take your insulin before you get sick.\"</p><p>He frowned, glancing through the windows where the pale winter darkness still reigned. \"Just how far north are we, Cuyler? Shouldn't it be light by now?\"</p><p>She shook her head. \"Dawn around 9:00 a.m. Dusk again by three this afternoon.</p><p>That's part of what I like about this place in the winter.\"</p><p>\"Don't you get tired on so little rest?\"</p><p>\"Hell, Ramsey, since you've been on my tail my rest hasn't been very restful, anyway.\"</p><p>He knew she was referring to the dreams. Maybe she really had experienced them.</p><p>He doubted it, but there was probably a slight chance. And there was also a slight chance, he conceded at last, that she was being straight with him about her reasons for bringing him here. For, even though he couldn't admit it to her, she'd been haunting his life the same way she claimed he'd been haunting hers.</p><p>Only difference was, he hadn't known who she was. Just the pixie with the big sexy eyes that seduced him in his dreams. So maybe she did want to understand this thing, and maybe she would let him go when she had her answers. Maybe she was telling the truth.</p><p>But he doubted it.</p><p>Wes Fuller held the lighter to the tobacco in the bowl and inhaled until it caught. He puffed appreciatively, then held the pipe in his hand and blew smoke rings as he studied the maps tacked to the wall.</p><p>\"Only way in will be by helicopter. And then they'll hear us coming.\" It was Stiles, his chief aide. Stiles, always the cautious one, always wary. \"We could land a few miles away, though, and hike in. But we'll want to be sure we can get in and out by daylight. We want to be well out of there before dark.\"</p><p>\"What's the matter, Stiles? Afraid the three of us can't handle her?\" And that was Whaley, the intrepid. He wanted a battle. It gleamed from his eyes like a fever.</p><p>\"Stiles is right in this case,\" Wes said slowly. \"We have no way of knowing whether she's alone up there or not. There might be half a dozen others with her.\"</p><p>Stiles's eyes widened. \"I hadn't thought of that. My God, do you supposed Bachman is still alive? I mean, what if they just took him up there to-\"</p><p>\"He's alive.\"</p><p>\"But, sir, how can you-\"</p><p>\"He's alive. There's not one of them who'd hurt Bachman. If there was, he'd have been long dead by now. God knows, I've given him the riskiest assignments, sent him up against the worst of them. But he's never been hurt beyond repair, and he's never brought one in.\"</p><p>Stiles blinked.</p><p>Whaley frowned. \"You telling me you've deliberately put Bachman in high-risk situations with them? Including this one?\"</p><p>Fuller nodded. Whaley wanted to hit him. Fuller could see it in his flashing eyes. But he wouldn't. He was a subordinate and he knew his place. \"You'll understand in time, Whaley. Till then, you'll just have to trust my judgment.</p><p>Bachman's been one long experiment. And his usefulness to us has just about run out. Don't trust him, whatever you do. He's never really been one of us. He just didn't know it.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He'd eaten, injected his insulin, and searched the house from top to bottom. For what it had been worth. The most interesting thing he'd found had been a sled in the basement and some harnesses hanging on the wall. No dogs, though. No outbuildings where any might be kept. So the sled was useless. Everything he'd found had been useless.</p><p>Interesting, but useless. He'd left her bedroom for last. He figured the longer he waited, the more deeply she'd rest. Now he stood at the foot of the fanciful bed and stared at her through the sheer red bed curtains. She lay uncovered, curled on her side, hugging her pillow. A gossamer bit of a nightgown hid very little. Her legs were not long, but so shapely he caught his eyes roaming them from her exposed slender hip to her small toes.</p><p>He blinked fast and forced himself to look somewhere else. He'd come to see if she had secrets hidden in her bedroom, hadn't he? Well, he ought to be looking for them, not gawking at her perfect little body and wondering if she would wake up if he went over there for a better look. He hadn't expected this. He didn't know what he'd expected. Maybe that she'd seem like a corpse as she rested, lying flat on her back, hands folded over her chest, not breathing, cold, white.</p><p>Instead she looked just like any other woman. Relaxed. Warm. Breathing deeply and steadily. No, not like any other woman. Much better. Almost irresistibly innocent and vulnerable right now.</p> <p>He swallowed hard and walked to the dresser against the stone wall. There were three black-and-white framed snapshots of Cuyler and another young woman in full flapper regalia. He didn't like looking at her that way. He knew she'd been mortal when the photo had been taken. Vampires didn't show up in photographs.</p><p>But, honestly, he couldn't spot a single difference in her. Mischievous grin, sparkling black eyes, innocence and sex appeal all wrapped up in the most appealing package imaginable.</p><p>He turned from the photos to examine the books. There were at least a hundred of them lining the shelves that stood against the wall, and as he scanned the titles, he noted they were all high fantasies. Sword and sorcery stories, with knights and dragons and magic. She was really into that stuff.</p><p>He gave up on the bedroom, because no matter what he chose to investigate, he found his gaze drawn back to her again and again. He couldn't stay in that room with her. It was dangerous. God, could she weave spells even in her sleep?</p><p>He headed back downstairs into the dining room. He hadn't examined the books on the shelf there, but as he did, he noted they were the same. Fantasy stories about other worlds where good always won over evil. Ironic.</p> <p>Then he spotted a few that were different. He pulled one out, frowning. He grinned as he scanned the blurb. It was about vampires, of all things! He slipped the book back into its place, wishing he had time to read a little of it, see what the latest fiction writer had dreamed up and whether it compared with the real McCoy. But he had to catch a few hours' sleep while he had the chance. From the looks of things, there wasn't much else he could do right now.</p><p>She writhed in her bed, knowing all of this was just a dream, but dying of sheer, tormented pleasure all the same. He was kissing her. His mouth was warm, wet, eager as it moved from her fingertips over her wrist, along the inside of her arm and into the hollow of her elbow. He tickled the sensitive skin there with his tongue, then moved higher, up to her shoulder, over it to her neck. She tipped her head back, closed her eyes, moaned softly. Her fingers buried themselves in his hair as he pushed the nightgown from her shoulders. Then he moved to her breasts, taking one in his hungry mouth, feeding on it like a starving man while he tormented the other with his fingers. His knee moved between her thighs, nudging them apart.</p><p>She touched his unclothed chest, raked her nails lightly over his nipples until he panted. Then her hand slipped lower, finding the smooth, rigid core of him, encircling it, squeezing, running her fingers over the tip.</p><p>He stared down at her, saying nothing, just watching. Then he closed his eyes, and she knew his need was almost painful. She opened to him, and he settled himself on top of her, nudged against her slick opening. She lifted her knees, desperate for him, for fulfillment. She needed this, needed him. No one else could fill the emptiness inside her. And she knew that he needed her just as desperately. Only she could soothe his wounded heart, erase the pain that darkened his soul, replace his anger and hatred with tenderness and love.</p><p>Her hands reached for him, to pull him to her...</p><p>But there was only air. Her eyes flew wide and she screamed in frustration, tugging at her hair. She punched the pillow, threw it, knocking half a dozen pewter figurines from the stand beside the bed, then pressed balled-up fists to her eyes and moaned like a wounded animal.</p> <p>Her door banged open and he stood there, staring at her. His face was flushed, beads of sweat stood on his brow. His breathing was uneven. He looked at her, and when their eyes met she knew he'd had the same dream. Every image she remembered was reflected in his eyes. He must know it, because he averted them, as if that would stop her from seeing.</p><p>\"You cried out. Are you okay?\"</p><p>She drew three open-mouthed breaths, closed her eyes, and finally shook her head. Her palms rose to her face and she lowered her head. \"I can't take this anymore, Ramsey. I can't. I'm gonna go stark raving-\"</p><p>His weight made the mattress sink, and then his hands gripped her shoulders.</p><p>\"You think I don't know? It's driving me to the edge, too, Cuyler.\"</p><p>She sobbed, and he drew her head to his chest. She felt the warm skin, the muscle, smelled him, wanted him. She slipped her arms around his waist and clung tighter.</p><p>\"Dammit, Ramsey, why'd you come in here? You're only making it worse. She turned her face to his chest, pressed her mouth to his skin and tasted it. She kneaded his shoulders with her nails as her pulse thundered in her temples.</p><p>One of his hands lowered to her waist. The other crept over her nape, up into her hair, and he tipped her head back. Then his mouth came to hers. She parted her lips, and his tongue dug into her, stroking deep and pulling back in an erotic pattern. She fell backward on the bed, and he came down on top of her, feeding on her mouth, crushing her body to his. She felt his arousal pressing hard between her legs, and she arched against it.</p> <p>Then he stiffened and rolled off her. Sitting on the edge of the bed with his back to her, he pushed both hands into his hair, clenching fistfuls of it, and swore in a voice rougher than tree bark.</p><p>\"Damn you, Ramsey...\" She rolled onto her side to face the other way and tried to stop the flow of frustrated tears.</p><p>\"I can't. I can't do this.\"</p><p>\"Then why did you-\"</p><p>\"I didn't mean to. Hell, Cuyler, I was still half-asleep, probably having the same dream you just had.\"</p><p>He got up and paced away from the bed, the front of his jeans poking out like a tent.</p><p>\"This is crazy. It's crazy.\"</p><p>She blinked, sitting up and fighting the tears into submission. \"Maybe if we just did it, the dreams would stop...\"</p><p>He turned slowly to face her and his eyes were hard, cold. \"No.\"</p><p>The finality in his tone cut to the quick, and for a second she thought she saw the reason. \"You're afraid of me, aren't you? You're afraid I'll take more than just your body.\"</p><p>He faced her head-on, not flinching. \"Wouldn't you?\"</p><p>Cuyler closed her eyes, grated her teeth. As much as she wanted him, who was to say she wouldn't lose control of her deepest desires in the heights of passion?</p><p>Bracing her shoulders, she forced herself to be honest. \"Maybe I would. But I'd never hurt you, Ramsey. You have to know that. I couldn't if I wanted to.\"</p><p>He searched her eyes for a long moment, and she felt as if her very soul were being scoured. \"If you'd been capable of hurting me, I doubt I'd still be breathing. So I guess I have to believe that.\"</p><p>\"Then why-\"</p><p>\"Look, I told you, I can't. It'd be unnatural for...\" He stopped midsentence, maybe due to the shock and pain that must have shown on her face, or perhaps it was the involuntary cry she uttered. \"That isn't what I meant. Wait-\"</p><p>\"Go to hell, Ramsey!\" She was on her feet and through the bathroom door almost before he could blink. She slammed it so hard she loosened the hinges, then she turned the locks.</p><p>She didn't say a word to him when she came out, freshly showered, dressed in dark gray stirrup pants and a long, fuzzy, white sweater. She didn't have to say anything. He could see the hurt in her eyes. He felt like an assassin's bullet, like a cobra's venom. He felt like the lowest, meanest form of being in the universe for blurting what he had. Worst of all, he hadn't meant it. It had been his own voice of self-preservation trying to convince him to keep his hands off her. It had been desperation, searching for any excuse that would pull his hormones off the scent and tame his libido. Hell, he'd been holding himself back by believing she'd do him some kind of harm if he took her. But he hadn't believed it. Not really, and once his conscious mind admitted that, he'd had to come up with another reason to abstain from the erotic feast he imagined every time he looked at her.</p><p>Unnatural. He'd blurted it and she'd looked as if he'd just kicked her right in the gut. It hadn't been what he really thought. And that was kind of odd, when he considered it. Because it used to be what he really thought. When had his spin on things undergone such a radical change?</p><p>She plopped down onto the bed and leaned over to pull on slouchy white socks. He walked over and sat down beside her. The second his backside touched the mattress she shot to her feet as if she'd forgotten something in the bathroom.</p><p>\"Cuyler, listen for a-\" The whir of a battery-powered hair dryer cut him off.</p><p>Ramsey blew air through his teeth and went into the bathroom with her. She sat on the vanity's padded stool, hair flying all over the place as she whipped the dryer through it. There was no mirror. He wanted to say something. He just wasn't sure what. He didn't want to make amends, exactly. Hell, she was still his enemy. The fact that he was burning up inside for her didn't change that.</p><p>But he'd hurt her. And despite his years of learning that vampires had no feelings, he regretted it.</p><p>Opening the cabinet, for want of anything better to do, he found his kit right where she'd left it. He unwrapped a fresh needle and took out a color-coded strip. With a quick, practiced flick of his wrist, he poked the forefinger of his left hand, squeezed a fat drop of blood out, and smeared it on the strip.</p><p>Then he watched for the color change. He was moving like a robot, doing the things that came automatically, without really giving any thought to them.</p><p>He felt her gaze on him, heard the hair dryer flick off, and looked at her.</p><p>\"Are you sick?\" If her eyes got any bigger, they'd swallow him whole.</p><p>\"Just checking the blood sugar.\" He glanced at the strip again.</p><p>\"And how is it?\"</p><p>\"Fine.\" He put the used needle and strip back into the container. He'd dispose of them properly when he got back to civilization.</p><p>\"Do you have to do that every day?\"</p><p>He nodded as he held his finger under the cold water tap for a second or two.</p><p>\"Has it ever been out of whack?\"</p><p>\"My sugar level? No. It's always within normal range. I have a good doctor who keeps me in great shape. Hell, I'm the healthiest diabetic I know.\"</p><p>Her eyes narrowed to slits as she studied him. \"And who is this Marcus Welby of the nineties?\"</p><p>\"Just one of the best hematologists in the country.\"</p><p>\"Don't tell me. A DPI staffer.\"</p><p>Ramsey shrugged, wondering about her line of questioning, but relieved she'd apparently forgotten his earlier slam. \"Yup. One of the perks of being an agent.\"</p><p>\"Kind of balances out against having to work around us animals, doesn't it?\" She got up and brushed past him, going back into the bedroom, yanking a pair of huge, fluffy slippers with unicorn heads on them from under her bed.</p><p>\"Look, I didn't mean that.\"</p><p>\"Sure you didn't.\" She lifted one foot, put a slipper on it. \"Ramsey, if you didn't mean it, then why are we both dressed and vertical?\" She never even looked at him. Just hopped on the slippered foot and dressed the other one.</p><p>It came out before he could order it not to. \"Because I know damned well it'll do me in. Cuyler, once wouldn't be enough. I'd be addicted, and I know, as sure as I'm standing here, that I could OD on you. You really think I could take you to bed and then take you in? If I had you once, I...\"</p><p>He glanced up at her, saw her blinking rapidly, staring at him in something like childish wonder. \"What?\"</p><p>Her lips curved upward a little. \"I just didn't know you wanted me that much.\"</p><p>And she shouldn't have known. It didn't do any good tipping his hand to the enemy. But he'd been honest, if nothing else. He was determined to take her in, and he knew he couldn't do it if he ever made love to her. He lowered his head, refusing to meet her eyes. \"I didn't say I did-\"</p><p>\"Sure you did, Ramsey. Don't try and take it back now.\" She took his arm in her warm hand and tugged him along beside her back into the bathroom. \"Come on downstairs after you've had your shower,\" she told him softly. \"I'll get you some breakfast I don't want you getting sick.\"</p><p>Then she left him. And he had to wonder when he'd stopped seeing her as something abnormal, something frightening, and started seeing her as a woman with a few special needs. One of which he'd really love to fulfill for her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'll keep this impersonal, Ramsey.\"</p><p>\"What?\" He finished the whole-wheat muffin, washed it down with a gulp of remarkably good coffee.</p><p>\"As long as you find the idea of laying a finger on me so frightening-tempting, but still frightening-I'll try and make it as easy on you as I can. But we have to talk.\"</p><p>\"We talked last night. I don't see that it's helped matters any.\" He wanted to correct her, tell her he didn't find the idea frightening at all, anything but, in fact. But it was probably better to let her hurt a little, let her hate him.</p> <p>And he wasn't satisfied with what he'd gotten out of her last night. He wanted to know more.</p><p>\"I talked, you didn't.\"</p><p>He stiffened a little, watching her. \"What do you want to know?\"</p><p>\"How you wound up working for DPI. When did they approach you, Ramsey?\"</p><p>\"My senior year at military school.\" It was a lie, but he figured the less she knew about the truth, the better off he'd be.</p> <p>\"And don't you find that a little odd? DPI's a secret organization. Even most of the CIA's top dogs don't know about its existence. They obviously don't make a habit of announcing their Presence, or drafting high school students. So why you?\"</p><p>He took another sip of the coffee. \"How do you know so much about DPI?\"</p><p>\"Their exploits are well documented. I probably know more about them than you do.\"</p><p>\"How? Where is all this documentation you keep mentioning? Where's the proof that they're guilty of all the crimes you accuse them of?\"</p><p>She sighed and got up from her seat. Walking to the bookshelf he'd so closely examined last night, she pulled several titles from it, brought them to the table and set them in front of him.</p><p>The vampire books. He frowned up at her. \"You call this proof? It's fiction.\"</p> <p>\"The world in general seems to believe that. Those of us who know better have good reasons to let them keep believing it.\"</p><p>He glanced down again at the books, shaking his head in disbelief. He picked one up.</p><p>\"You ought to read them, Ramsey. See the whole hunt through the eyes of the prey for a change, instead of the predator.\"</p><p>He riffled the pages, scanned a few, felt his blood chill. \"There's classified information in here! Hell, this is a blow-by-blow account of a DPI investigation!\"</p><p>She only shrugged. \"Like I said, the world thinks it's fiction.\"</p><p>He slammed the book down on the table and stood, facing the bookshelves. \"What about the rest of them?\"</p><p>She smiled slightly, lifted her eyebrows. \"What, my fairy stories? Who knows?\"</p><p>She turned to a shelf lined with pewter figurines, picked up a winged dragon and lovingly stroked its fierce-looking head. \"I like to think they could be real, that there could be some other world where fairies and magic exist. I mean, why not? Vampires are real, and most people consider us fantasy.\"</p> <p>He should be angry. He had been for all too brief a time. Why, then, was he feeling so enchanted all of a sudden? Couldn't DPI have sent him after a monster? Why the hell did they have to pick a beautiful pixie who believed in fairy tales? He cleared his throat and tried to focus on business.</p><p>\"Does DPI know about these books?\"</p><p>She shrugged. \"I don't know. Are you going to tell them?\" She looked at him with those huge dark eyes, all innocence and beauty.</p><p>He lowered his head. \"I have to, Cuyler.\"</p><p>She was standing in front of him before he knew she'd moved. Her small hand lifted his chin a little, and she stared up into his eyes. \"Why are you so dedicated to them? What did we ever do to you to make you hate us so much?\"</p><p>He only shook his head. He couldn't tell her. It was bad enough that these traitorous feelings for her assaulted him with every breath he drew. His betrayal stung, and if he spent much more time with her, it would be complete.</p><p>\"Tell me about your childhood, Ramsey. What was your family like?\"</p><p>He stiffened. Was she reading something in his eyes, his thoughts? \"There's not much to tell. I was my mother's only child. Never knew my father.\"</p><p>She lowered her head, walked slowly away from him, then reached for a battery-powered boom box on a low shelf. She pushed a button and soft, hauntingly beautiful music filled the room. A woman's voice, like a gossamer strand wavering in a slight breeze, singing in what sounded like Gaelic. New Age stuff.</p><p>Cuyler closed her eyes for a second, listening. Softly, she prompted him. \"Tell me about your mother.\"</p><p>Hot blades ran through his chest. \"She died when I was twelve.\" He turned his back to her, walking into the front room and sitting down in a chair near the fireplace. He stared into the flames, remembering.</p><p>Her hands closed on his shoulders. \"She was all you had, and you lost her. No wonder I see so much pain in your eyes.\"</p><p>He said nothing, and tried not to feel her soothing touch as she began a rhythmic massage.</p><p>\"How did she die?\"</p><p>\"I don't remember.\" His eyes wanted to close. He hadn't slept much, and when he did, he didn't rest. He only dreamed about making frantic, hot, imaginative love to Cuyler.</p><p>\"Why are you lying to me, Ramsey?\"</p><p>Her fingers kneaded the sides of his neck. He let his head fall sideways to give her more access. \"I'm not going to talk to you about my mother,\" he said, but his voice lacked conviction. He sighed as the image of her danced through his memory. \"She was beautiful, all carrot-colored curls and pale blue eyes. And she'd sing... Sometimes, right before I fell asleep at night, I can still hear her singing to me. Wild Irish Rose, that was her favorite.\" For a few seconds his mother's lilting voice played in his memory. Then he felt Cuyler's lips on his head. She bent and pressed her cheek to his, and he felt the dampness on her skin.</p><p>\"I'd take the pain away, if I knew how.\"</p><p>\"I know you would.\" Why did he say that? And why did it sound so true? He swallowed and tried to regain his strength. \"We all have pain, Cuyler. Just part of life. You must have hurt, too, when you lost your sister.\"</p><p>She sniffed, and her hands slid down his chest to rest near his heart. \"For a while I wanted to die. Then I wanted vengeance. I thought about hunting down every man involved in that raid. But it wouldn't have eased the pain. It wouldn't have brought Cindy back.\"</p><p>\"Might have stopped them from snuffing out another life, though.\"</p><p>She straightened, came around the chair and knelt in front of him. He shouldn't have been surprised at the tears on her cheeks, but he was. Her kind wasn't supposed to have human emotions, wasn't supposed to care. Wasn't that what he'd been taught? And hadn't that particular bit of DPI doctrine been losing validity with every second he'd spent near Cuyler?</p><p>\"What happened to you then?\"</p><p>\"A military school. Some benevolent organization foot the bill. I lived there, stayed with relatives who'd rather not have had me during vacations. Then the DPI academy, for training.\"</p><p>\"And indoctrination.\"</p><p>He shook his head slowly, staring down into her beautiful face. \"It wasn't like that.\"</p><p>But it was. Since he'd been twelve years old, he'd been educated under the organization's watchful eye, beginning with the debriefing right after his mother's murder. They were the ones who'd paid for his education, who'd provided a private tutor to teach him the things he wouldn't learn in any school. He'd been filled with hatred already, and that hatred found validation in his secret lessons, the ones he'd been warned not to talk about. He supposed now, that they'd seen him as the perfect candidate. He'd had a score to settle. He'd been seeking vengeance all his life. They'd known that, and offered him the means to achieve it.</p><p>And now he was sitting here with one of those he'd spent his life hating. He was sitting here wanting her with every cell in his body, talking to her like a cherished friend, finding a kind of understanding he'd never expected shining from her teary eyes.</p><p>But it was all a lie. It had to be.</p><p>\"I don't want to be here with you, Cuyler. You're too damned convincing.\" He pushed her hands away from him and got to his feet. Leaning against the hearth, he closed his eyes.</p><p>\"Why do you hate me so much?\"</p><p>Lifting his head, he looked down at her, still kneeling in front of the chair.</p><p>\"My mother was killed by a vampire. One of you. Someone that feeds on the innocent without a hint of remorse. A killer.\" He hoped his words would rekindle the hatred in his soul, reinforce his resistance to Cuyler and her wiles.</p><p>Her eyes widened and for a moment she only stared at him in stunned silence.</p><p>Finally she shook her head. \"It wasn't me.\"</p><p>\"You're all the same.\" He looked away from her. Dammit, he couldn't spout DPI policy while he was looking into those eyes. \"So now you know. Nothing you can say is going to change it. You can pretend to be just like us all you want, Cuyler, but I know what you are. And I'll never stop hating you.\"</p><p>She rose slowly, anger beginning to simmer in her eyes. \"You're lying. You don't hate me. If anything, you hate yourself for not being able to-\"</p><p>He lifted a hand, cutting her off. \"Don't bother. You're only trying to convince yourself.\"</p><p>\"But it's so stupid! Ramsey, one of your kind murdered my sister and pumped enough bullets through my body to kill an elephant. But I don't hate you for it.</p><p>I don't lump all mortals in with the few truly evil ones. I don't go out hunting them down like animals to exact vengeance.\"</p><p>\"Don't you?\"</p><p>She flinched as if he'd slapped her. \"How can you ask me that?\"</p><p>God, the hurt in her eyes... He looked at the floor, at the bean-bag, at the fire.</p><p>Anything but at that pain he'd caused. \"Look, you got what you wanted. We've talked. Do you think we can get the hell out of here now?\"</p><p>She stood so still, stunned maybe. \"I don't have what I wanted. I still don't know why there's this connection between us. I still don't know what misguided force makes me give a damn about a man like you.\"</p><p>\"Let's chalk it up to physical attraction and call it even.\"</p><p>\"It's more than that and you know it!\"</p><p>He faced her, forced his expression to remain hard as stone. \"Maybe for you it is, but not for me, Cuyler.\" He strode to the stairway, started up it. \"I'm packing my things. You line up whatever means of transportation got us here, and have it ready.\"</p><p>\"I won't.\"</p><p>He never broke his stride. \"Then I'll go on foot.\"</p><p>\"I won't let you!\" She came up the stairs behind him.</p><p>\"You have to sleep sometime, Cuyler. One way or another, I'm out of here.\" He went into the bedroom, slammed the door and turned the lock. He couldn't look at her, listen to her, for one more second or he'd break. It was all a game, some mind game she was playing to win his trust, and it had been working all too well. Until he'd brought the memory of his mother's death back to burning life, anyway. Damn Cuyler for making him talk about his mother, for stirring up that old pain, and especially for acting as if she cared. Damn her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Like a potent corrosive, his rejection burned through her. But he didn't hate her. She knew better. It was in his eyes, in his voice. She was so attuned to his feelings that it was impossible to be fooled by his stubborn resistance. He liked her, in spite of his determination not to. He wanted her, though it went against everything he'd ever believed in. But she also knew that the conflicting emotions were slowly tearing his soul apart. She sensed his every emotion, even the ones he denied; frustration, confusion, anger, desire. Bringing him here, forcing him to see her as she was, instead of as DPI had painted her, was the same as torturing him. It was cruel to put him through this, especially now that she knew where his hatred originated. To see Cuyler as a woman and not a monster was, in Ramsey's mind, to betray his mother. To side with her murderer.</p><p>Maybe she ought to just take him back, let him go.</p><p>She twisted the doorknob, freeing the lock with her mind the way Rhiannon had taught her. Ramsey was asleep. He reclined on the bed, his back against the headboard, his head cocked to one side until his ear touched his shoulder. He looked as if he'd sat down there with no intention of going to sleep.</p><p>Cuyler walked softly to him. Even in sleep, he seemed strained. A slight frown puckered his brows. His lips were tight. His pain showed in his face, a pain he'd felt for a very long time. For a moment, as she looked at him there, she saw the image of the boy he'd been. A boy whose innocence and mischief had been stolen from him along with his mother. A boy forced to become a man before his time, a man who'd forgotten how to love.</p> <p>She stared at him, sending silent, soothing messages from her mind to his. She focused her energy on relaxing him into a deeper sleep and chasing his worries from his mind the way an autumn wind chases fallen leaves. Then she leaned closer, clasping his sturdy shoulders and easing him lower until his head rested on the soft pillows and his back wasn't bent so severely. She tugged a blanket from the foot of the bed to cover him. Then she bent and brushed her lips across his, a whisper of a kiss.</p><p>When she straightened away from him, his hand reached toward her. He whispered her name.</p><p>She ran a hand over his cheek, into his hair. \"I'm here. Rest now. Just rest.\"</p><p>His body relaxed again, and he sank back into his deep slumber. Cuyler sighed softly, shaking her head in remorse. She couldn't let him go. Not now. DPI had targeted Ramsey for their vile organization from the second his mother had been killed, she was sure of it. They must have known of his anger, his fury and feelings of helplessness. The guilt even a boy of that age would suffer; that he hadn't been there, hadn't been able to help her. Those ruthless men had stoked the fire of Ramsey's anger, built it into the blazing inferno that was rapidly devouring his soul. They were using a young boy's pain as a weapon against Cuyler and her kind. And she couldn't shake the feeling that they intended to use it against Ramsey, as well. DPI would see both of them destroyed unless she could find a way to fight them.</p><p>She understood so much more now. But still not enough. There was no explanation for the connection between her and Ramsey. She sensed the solution to all of this hinged on her discovering the cause of that emotional, mental link. And until she did that, despite the pain it caused him, she had to keep Ramsey here, with her.</p> <p>Ramsey trudged through the snow, half-blinded by the brilliant sun flashing from its pristine surface into his eyes. He had to find a way out of this mess. He was desperate, and this was his last-ditch effort. There had to be some means of transportation, somewhere. A plane, a snowmobile, something. Clever as she was, Cuyler had probably hidden it a distance from the house to keep him from escaping. He didn't know why he hadn't thought of the possibility sooner.</p><p>He hadn't meant to fall asleep. He supposed the stress and sleepless nights were beginning to wear on him. It was only when he woke to see bright winter sunlight slanting through the window that he'd realized just how tired he'd been. Oddly, he felt rested, refreshed even. No dreams, for a change.</p><p>But that wasn't right, was it? There had been dreams, just not the usual wildly erotic ones that left him exhausted. He'd dreamed of Cuyler. She'd been leaning over the bed, touching his face, stroking his hair and whispering softly to him.</p><p>Her touch had been soothing, her voice like a salve on his oldest wounds. He hadn't wanted her to leave.</p><p>He stopped walking and closed his eyes as a shaft of pain bisected his chest.</p><p>There'd been a blanket over him when he woke. He didn't remember putting it there. Had Cuyler really come to stand over him, touched him that way, whispered so lovingly, so gently, as he'd slept?</p> <p>She'd kissed him. Her soft, moist mouth had touched his for the barest instant, and he'd wanted to pull her into his arms, into his bed. He'd wanted to feel her smiling lips caress every inch of him, and then he'd wanted to do the same to her. The hell with the danger that she might go too far. The hell with the fact that they were sworn enemies. He wanted her with a passion above and beyond all of that. Above and beyond everything.</p><p>He opened his eyes and drew a deep breath, steadying himself. He had to get away from her. She was bewitching him, using her mental powers to make him forget his life's work, driving him so with desire he'd gladly exchange his every principle for a night in her arms. He was in danger with her, and he had to get out or lose his mind.</p><p>But now that he had, he almost wished he hadn't. He'd trudged a couple of miles, he figured, and the scenery hadn't changed in the least. Nothing but white. No trees. No vegetation of any kind. Hardly any hills. He was pretty sure what he was looking at could be described as tundra. He hoped to God he found some form of aid soon. He wasn't exactly dressed for long periods of exposure. Only thin rubbers separated his shoes from the hard-packed snow. His ski jacket was hardly sufficient, and he didn't even have a hat with him. The wind whipped hard out here with nothing to break its progress.</p><p>He walked a little farther, then frowned and tilted his head. What was that sound? A motor of some sort growled in the distance. He turned slowly, trying to gauge the source, then realization dawned. A snowmobile. No, more than one. And the sound came from the direction of the house, though he couldn't see it anymore. His first thought was that Cuyler was coming after him, using a machine she'd had hidden somewhere.</p><p>But that thought was quickly banished. It was still daylight. She wouldn't even be awake yet.</p><p>He blinked slowly as that thought sunk in. She wouldn't be awake. She'd be lying in her bed, behind unlocked doors, thinking she was completely safe up here in the middle of nowhere.</p><p>The motors died abruptly. They didn't fade away, but simply cut out. The snowmobiles had stopped, and as near as he could guess, they'd stopped near the house. Someone was there, and with a churning in his gut, Ramsey thought he could guess who.</p><p>It made no sense to think DPI had somehow tracked them here. But it made less sense to think some harmless folks had just decided to take a snowmobile ride north of the Arctic circle and happened upon her house. Cuyler was there, alone and completely helpless. Her stories of torture and murder were utter fabrications. He knew that. But they were echoing through his soul all the same as Ramsey started walking back the way he'd come. Then he started running.</p> <p>He followed his own tracks for several yards, hands shoved deep in his jacket pockets, shoulders hunched against the biting wind. But the tracks got harder and harder to see as he went. He frowned hard, and whispered a little prayer they wouldn't disappear entirely before the house came into view. Damn, he'd been an idiot not to take windblown snow into account. It had been filling his tracks behind him all the way out here.</p><p>And then he couldn't see them at all. Not even the tiny depressions he'd been following this far. Dammit to hell, he couldn't see the house. Everything looked the same in every direction. The wind was blowing harder, its bite sharper with every gust. It would be dark soon, and colder than ever. He tried not to think about what might be happening in the house right now, but images danced through his thoughts anyway. Cuyler's warnings about DPI's tactics rang in his ears, no matter how he tried to tune them out. He hadn't believed her. He'd told himself she was just trying to convince him not to take her in. But he now found himself wondering if there was even the slightest chance of truth in her horror stories.</p><p>He didn't want to believe that, wouldn't let himself believe it. But the idea that anyone might deliberately hurt her...</p><p>Why the hell did it drive him to the brink of madness to consider it? Why?</p><p>The motor sounds came to life again. He was closer. He tried to run faster, but the frigid air burned his lungs and throat. They were moving, fast, in the opposite direction.</p><p>\"Ah, God, no...\" He tried for more speed, but he was out of breath. His muscles screamed in protest. His legs gave out just as the house came into view, and he dropped to his knees in the snow, scanning the horizon where the sun hovered, about to set.</p><p>And then he spotted them. Three snowmobiles zipping over the tundra in the distance. One pulled something behind it. Something long and narrow that looked like a box. He groaned in anguish as they moved out of sight.</p><p>He wasn't sure how long he knelt there. Emotions raced through him, so potent and confusing that he felt dizzy. Hadn't he been determined to take Cuyler in himself? Hadn't he vowed that he'd never stop hating her and everyone like her for what they'd done to his mother?</p><p>Why, for God's sake, was he racked with guilt that he hadn't been there to protect her? The frustration was as bad as what had consumed him as a result of not having been there to protect his mother. Why? Why was he kneeling in the snow, burning inside with the urge to go after them, to somehow get her away from them? He cursed softly at the thought of riding in like some knight on a charger to rescue his damsel from villains. It wasn't like that. She was the villain of this piece.</p><p>Wasn't she?</p><p>He got to his feet and made his way back to the house, not even bothering to stomp the snow from his shoes as he ran through it and up to her bedroom, already knowing he wouldn't find her there.</p><p>The empty bed was rumpled, the drawers and closet gaping wide, clothes strewn everywhere. When he went back downstairs, he found more of the same. The place had been searched, hurriedly and recklessly, before they'd taken her away. Her pewter figurines lay strewn everywhere. Her crystals had tumbled helter-skelter to the floor. The bookshelves had been emptied, her precious fairy-tale stories trampled beneath uncaring feet.</p><p>He bent to pick up the first of the vampire books she'd shown him, and bit his lip against the burning in his throat and eyes.</p><p>He couldn't hope to hike out of here tonight. He'd die of exposure before he reached help, and then Cuyler would be on her own. He had to wait, though it would damn near kill him to do it. At first light, he'd go, with as many provisions as he could carry. He'd get out of here, somehow. And he'd find her.</p><p>After that, he didn't have a clue what he'd do.</p><p>For now, though, he had to sit tight and await the cold dawn. He sank into a chair, weak from turmoil, and opened the book in his hands. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It took him two hours to read the entire book. And Cuyler had been right. The entirety of one of DPI's most disastrous investigations had been documented there, from the viewpoint of its subjects. It was quite a different take on things from the one in the official records. Oh, the facts were the same, but DPI's methods and motivations and the characteristics of the subjects of that investigation, couldn't have differed more. Ramsey had to believe it was all propaganda. Because if it were true...</p><p>He groaned in undisguised agony. If it were true, then Cuyler had been right about the torture involved in DPI's research. Even several deaths, all detailed here in these pages.</p><p>But it wasn't true. It couldn't be.</p><p>He knew, though, that it very well could be. He'd never been involved in the research end of things, never actually witnessed the so-called harmless studies performed on the subjects. He wasn't a scientist. And while he'd been told that the prisoners brought in would be kept for a week or two and then released, unharmed, he'd never actually seen that happen, either.</p> <p>DPI believed Cuyler and her kind to be no better than animals. Beings without emotions, incapable of caring. Heartless, soulless beasts who preyed on the innocent with no sense of remorse. That much he knew. And it wasn't so farfetched to think that an organization who believed that about a group might want to annihilate that group. Was it? So why hadn't he known about it? And would it have made a difference to him if he had?</p><p>Up until a few days ago he'd believed everything DPI said about the undead. And he'd had a personal vendetta, to boot. But not against Cuyler. Everything he'd ever believed had been a lie, at least where she was concerned.</p><p>He got up, intending to go to the little kitchen and begin packing supplies for his trek out. He was no longer so certain he could wait for dawn to break. There was a new urgency eating at his soul. He had to get to her, just to prove to himself that she was all right and not being subjected to the torments described in the book. With every second that passed, those scenes embedded themselves more deeply in his mind, only the victim wore Cuyler's beautiful face.</p><p>He stopped halfway to the kitchen, stiffening at the scraping sounds coming from the front door.</p><p>\"Cuyler?\" Hope surged in his chest as he sprinted and yanked the door open.</p> <p>A big, furry dog stood there, staring at him. It barked twice when he only stared back in confusion. Where the hell had it come from? More barking followed, and he looked up in amazement to see three other dogs, identical to the first, sitting patiently in the snow. Huskies, all of them. Silvery fur and ice blue eyes. Magnificent, wide chests.</p><p>Sled dogs?</p><p>The one at the door barked again. Ramsey frowned, thinking of the sled and harnesses he'd seen in the basement. Was this how Cuyler had brought him here?</p><p>Were these dogs hers? But what were they doing here now? Where had they been?</p><p>It didn't matter. He saw the means to get out of there, and he knew he had to take it. Leaving the door wide, he ran into the basement and hauled the awkward sled up the stairs. He dragged it outside, and went back for the harnesses, praying he could figure out how to put them on properly, hoping the dogs would allow it.</p><p>Hell, he didn't know what good it would do. He had no idea which way to go, even with transportation.</p> <p>When he brought the harnesses outside, the dogs surrounded him, barking excitedly, tails wagging. They seemed impatient as he stretched the straps out, trying to see which way they went. But they stood motionless when he draped the things around them, and he knew they were used to this procedure.</p><p>Once he got them hooked to the sled, he ran back inside long enough to get his coat. That was all. His thoughts of bringing provisions had fled. All that remained was his urgent need to get to Cuyler, to make sure she was all right.</p><p>He stood on the back of the sled and picked up the reins. The dogs were off like a shot the minute his feet touched the narrow platform, nearly jarring him off into the snow. He didn't try to guide them. They seemed to know exactly where they were going. All Ramsey could do was hang on and pray that they really did know.</p><p>He wasn't sure his prayers were answered until several hours later when the dogs stopped and stood barking like a raucous group of soldiers celebrating victory.</p><p>A huge, barnlike structure stood in the middle of the perfectly flat, snowy plain. As Ramsey tried to adjust to the oddness of finding it here, a gruff voice called out to him.</p><p>\"I expect you'll be wanting to fly out of here, after that other plane.\"</p><p>Ramsey turned and gave his head a shake. A grizzled old man, his face completely obliterated by a massive gray beard, came from the barn and bent to expertly release the dogs from their harnesses.</p><p>\"Who are you?\"</p> <p>\"Just call me Kirkland. Did they take Miss Jade?\"</p><p>\"How do you-\"</p><p>\"Miss Jade, she told me there might come some men someday to try and take her.</p><p>Warned me not to tell a soul about her house out there. And I never did.\" His tone suggested he thought Ramsey might have.</p><p>He couldn't believe this old man knew the truth about Cuyler couldn't imagine her entrusting him with it. \"Did she tell you why they would want to?\"</p><p>\"Nope. And I never asked. Ain't my business.\" He slung the harnesses over his shoulder, absently stroking the heads of the dogs who milled and danced around his legs. \"Knew there was trouble, though, soon as I spotted that other plane.</p><p>Miss Jade's a good woman. Kind of heart. Nursed one o' my dogs after he'd tangled with a wolf. Took care of him as if he'd been her own. Even sat up all night with him, didn't she, Duke?\" He ruffled the fur of the dog in question before turning his attention back to Ramsey. \"So are you gonna help her?\"</p><p>Ramsey could only nod mutely.</p><p>\"Good, then.\" He walked into the barn and Ramsey followed, watching him hang the harnesses on the wall. A small plane sat like a giant bird at rest, taking up most of the space. The old man tugged a large, sliding door and Ramsey helped him open it.</p><p>\"I don't get this. What are you doing up here?\" Ramsey followed him, getting into the plane behind him. He ducked his head and settled into the seat beside Kirkland in the cockpit.</p><p>\"Livin', mostly. I fly folks in and out for hunting and such. Transport supplies for the Inuit village a few miles off.\" He slanted a sideways glance at Ramsey.</p><p>\"Best buckle up. Takeoffs are rough.\"</p><p>\"Do you know where they went?\"</p><p>The old man nodded, but didn't say a word as the engines came to life and the craft rolled slowly out of the barn.</p><p>\"Where is he?\" The man blew his offensive tobacco smoke into her face, and Cuyler turned her head as much as she could. It wasn't much.</p><p>She was handcuffed to a chair in what she took to be a bedroom, with three cruel faces watching her every move. Ordinarily she'd have simply snapped free of the cuffs, knocked the men on their arrogant backsides, and made her escape.</p><p>Unfortunately she'd had the extreme displeasure of proving their newly developed tranquilizer did, indeed, work. She'd been injected just as she'd begun to rouse with the sunset. And now she was as weak as a mortal. A tired mortal. Her mind was murky at best.</p><p>Not so murky that she couldn't wonder about Ramsey, though. At first she'd thought he might have been involved in her capture. The relief that filled her when they'd begun asking her for his whereabouts had made her weaker than she already was.</p><p>\"Miss Jade, don't make us resort to drastic measures.\" The fat, white-haired man had cruel eyes, like two small blue buttons on his face. Emotionless, snake's eyes. \"We all know how sensitive your kind is to physical pain. Don't make us hurt you.\"</p><p>When she averted her face, he caught her chin and forced her to look at him.</p><p>Another gentle puff of smoke in her face. She coughed.</p><p>\"Tell me where Bachman is.\"</p><p>\"I told you already, I don't know what you're talking about. I was alone in the house.\"</p><p>The man-the others called him Fuller-smiled grimly and shook his head. \"His suitcase was there. We know he was with you.\"</p><p>\"I stole it,\" she lied. \"He'd been hounding me for months. I thought I might find out why if I took his things and went through them.\" She tried to keep her chin up, defiantly. She forced her sagging spine stiffer. She had to be strong, but she couldn't help but wonder where Ramsey had gone. Maybe the dogs had come early. Maybe he'd found them and run away from her while she'd slept. God, she hoped that was the case. She'd arranged with old Kirkland to turn the dogs loose on the third day, knowing they'd make a beeline for her home. If Ramsey found them, if he knew how to use them, he'd be okay. They knew the way to Kirkland's hangar as well as they knew each other.</p><p>Fuller turned to the thin, dark one. \"What do you think of that, Whaley?\"</p><p>\"I think she's lying.\"</p><p>\"I'm not.\" She blinked and tried to think of a way to convince them, but only came up blank. \"Why are you after him, anyway? I thought he was one of you.\"</p><p>\"So did he-\" Whaley began, but his reply was cut off by a swift look from Fuller.</p><p>The third man sat in a chair, silent. He didn't appear to have the same stomach for abuse his two colleagues shared.</p><p>\"You're going to have to tell us, Miss Jade. We can't go back to headquarters without him.\"</p><p>She sagged inwardly. They were taking her there. And if they did, she'd die. She could have called mentally, begged others of her kind to come to her aid. But with this tranquilizer in DPI's arsenal, any who tried to help her might end up sharing her fate. She didn't want to die with that on her conscience. God, if only she knew Ramsey was all right.</p><p>Fuller's hand disappeared into his pocket. It came out with a big, shiny pair of pliers. He opened and closed their ridged teeth slowly, right in front of her face. Then he handed them to Whaley, who moved around behind her.</p><p>\"Begin with the little finger of her left hand,\" Fuller said matter-of-factly.</p><p>\"Crush it.\"</p><p>She felt the cold instrument touch her finger. \"Wait! All right. All right, I'll tell you the truth.\"</p><p>The tool moved away from her hand. Fuller looked down at her, smiling grimly.</p><p>\"That's more like it. Where is he?\"</p><p>Kirkland brought the plane in expertly at a small airport.</p><p>\"This is it? This is where they landed?\"</p><p>\"Nope.\"</p><p>Ramsey drew a sharp breath and waited. Kirkland had already explained that he'd been able to track the other plane with the sonar equipment back at his hangar.</p><p>But the guy was a man of few words.</p><p>\"Landed at Loring, not too far off. Couldn't very well take you to an air force base now, could I?\"</p><p>Grating his teeth, Ramsey prayed for patience, and time. He kept telling himself that Cuyler was fine. They wouldn't hurt her. But more and more, his own voice of reason sounded like a liar.</p><p>Kirkland opened the hatch and Ramsey jumped to the ground. He took a look around, but apart from the runways and hangars and small planes, there was nothing to give him a clue. \"Where the hell are we, Kirkland?\"</p><p>\"Northern part of Maine.\"</p><p>Northern Maine? Why the hell would they bring her here? Why not go straight on to White Plains? He scanned the place, sifting his mind for answers.</p><p>\"Nearest city's Limestone,\" Kirkland continued. \"Caribou's a little farther. You got any idea where they took her?\"</p><p>\"Limestone?\" He almost sagged in relief. DPI had safehouses scattered all over the country, kept them at their agents' disposal. If an operative got into trouble, he could take refuge at one of them. They had security systems like Fort Knox, and direct phone and computer links to headquarters. Like the obedient, devoted agent he'd always been, Ramsey had memorized the addresses of every safehouse in the northeast. There was one just past Limestone.</p><p>He didn't know why they'd have taken her there. Capturing her had been their goal, and now that they'd done that, what could they have to gain by delaying their return?</p><p>Unless she wasn't their only goal? Maybe there was something else, something here, that they were after.</p><p>Ramsey faced the grizzled man beside him. \"I need a car.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It was ridiculous to be going about it this way. He worked for DPI. He was one of them. He could punch in the code, walk right through the gates, up to the front door, and demand to see the prisoner.</p><p>But something held him back, made him cautious. Crazy, vague suspicions clouded his mind. He'd put them to rest when he saw that she was okay, but until then, he figured he'd be better off erring on the side of caution.</p><p>He'd had to argue with Kirkland to get him to stay behind. Hell, the guy had no idea what he'd be getting into if he came along. DPI was big. Powerful. It was dangerous to get on the wrong side of them. It was bad enough Kirkland was going to make the call.</p><p>Vaguely, she heard the phone and the low muttering from beyond the closed bedroom door. Two of the men remained with her. One, the one called Fuller, had gone out to answer it. Seconds later, he returned.</p> <p>\"We've got him.\"</p><p>Whaley rose from where he'd been comfy on the bed. \"Bachman?\"</p><p>Fuller nodded. \"That was the hospital in Caribou. Seems Bachman was brought in, unconscious. They found this number on him.\"</p><p>Cuyler bit her lip to keep from gasping. God, what had happened to Ramsey?</p><p>\"What the hell was he doing in Caribou?\" Whaley asked.</p> <p>\"Probably trying to make his way here, to the safehouse. I still think you guys are wrong about him.\" That was Stiles, the most gentle of the three. \"How bad is he?\"</p><p>\"Doesn't look like he'll make it through the night. We'd better get over there.\"</p><p>Pain tore through her heart. Dying? Ramsey was dying? She squeezed her eyes tighter to stop the tears that burned in them.</p><p>\"What about her?\"</p><p>Fuller glanced at Stiles, who stood unspeaking in the corner. \"Can you handle her?\"</p><p>The pale man nodded.</p> <p>\"She gets too lively, just give her another shot. We'll call in from the hospital.\"</p><p>She didn't lift her head as the two walked out. Just let it hang. She'd be damned if she'd give them any reason to inject her with more of that awful, debilitating drug.</p><p>Ramsey crouched behind a shrub near the gate and waited. Two men came out of the house. Their car started up, headlights came on, and he cringed lower. An electronic hum, a metallic groan, and the gates swung open. The car rolled through, and they began to close again.</p><p>He watched the car accelerate as soon as it hit the road. The gates were still closing. Taillights disappeared around a bend, and Ramsey lunged to his feet and dove. The metal scraped his sides as he threw himself in, then banged solidly as his body hit the ground. Closing his eyes, he drew three steadying breaths.</p><p>Night birds slowly resumed their nightly serenade. A few seconds later, frogs joined in. The wind rustled the trees again. Other than that, Ramsey heard nothing. He got to his feet, brushed himself off, and started toward the house.</p><p>The numbered panel beside the door stared at him, the System Armed light glaring like an evil eye. If they'd changed the entry code and he punched in the wrong numbers, an alarm would tell anyone inside of his presence. And he was certain there was still someone inside. They wouldn't leave Cuyler unguarded.</p><p>His tongue darted out to moisten dry lips, and he tasted the sweat on his upper lip. There was no other way. If he opened a window or door without entering the code, the alarm would sound anyway. His hand rose slowly, hovering at the panel.</p><p>He wiggled his fingers, grated his teeth, and entered the four-digit code he'd committed to memory.</p> <p>The red light blinked out. A green one came on instead.</p><p>Ramsey pressed his ear to the door, listening. Only silence came from within. He gripped the knob and his hand slipped on its surface when he tried to turn it.</p><p>Rubbing his palm against his pant leg, he tried again.</p><p>The door opened without a creak, and Ramsey ducked inside, closing it quickly and quietly behind him. He didn't hesitate, but went directly to the staircase and up it, straining every cell in his body to be quiet.</p><p>At the top, he froze as heavy footsteps sounded. Pressing his back to the wall, he waited and watched. A door opened down the hall. In the muted light he recognized the man who emerged. Ron Stiles. Ramsey had worked with him before.</p><p>He'd personally thought the guy lacked the grit to be with DPI. Tonight, though, he was secretly relieved the mild-mannered agent was the one guarding Cuyler.</p><p>Stiles crossed the hall and ducked into a bathroom, never once glancing Ramsey's way. When the door closed, Ramsey hurried to the room Stiles had exited and slipped inside.</p><p>Cuyler sat in a hard chair, her arms pulled severely behind her. Her head leaned forward unnaturally. She wasn't moving, and Ramsey felt his pulse skid to a stop. Dropping to his knees in front of her, he caught her chin and lifted it.</p><p>Her eyes were tear-swollen and closed. A vivid purple bruise marred her cheek, and her lower lip was crusted with dried blood. He just stared at her, unable to form words.</p><p>Weakly, she tugged her chin away from his hand. \"Leave me alone,\" she murmured.</p><p>\"Please, just leave me alone.\"</p><p>\"Cuyler...\"</p><p>Her eyes opened, but they were unfocused. She stared at him from somewhere behind that drugged haze. \"Ramsey?\"</p><p>The toilet across the hall flushed and a second later steps came toward him.</p><p>Ramsey fell back a few steps, so he'd be behind the door when it opened. Stiles came inside.</p><p>\"If you twitch, I'll have to shoot you, Ron.\" Big words, he thought, for a man with no gun.</p><p>Stiles's narrow back stiffened, but he didn't move. His hands rose slowly on either side of his head. \"Bachman? I thought you were- \"Never mind what you thought.\" Ramsey came closer, reached around Stiles and took his side arm. \"Now get me the key to the handcuffs. Quick.\" He prodded the man's back with his own gun, glad Stiles had fallen for the bluff.</p><p>Stiles nodded hard, dipped into his pants pocket and brought out the key. He held it up, and Ramsey prodded him again. \"Get those cuffs off her.\"</p><p>\"Damn.\"</p><p>\"Do it!\"</p><p>Stiles moved slowly around to the back of Cuyler's chair, bent down and unlocked the cuffs. He stood again, dangling them from one crooked finger. \"I didn't believe Fuller when he said you'd turn on us.\" He shook his head. \"Guess he was right.\"</p><p>Ramsey moved forward, keeping the gun leveled on his former colleague. \"Why did he think that?\"</p><p>Stiles just shook his head. \"I'm not saying any more. Kill me if you have to.\"</p><p>\"Okay, if I have to.\" Ramsey nodded toward the man. \"Snap one of those cuffs to your wrist, Stiles.\" He waited while the other man complied. \"Good. Now turn around, hands behind your back. Come on, you know the drill.\" Stiles turned. \"On your knees.\" When he complied, Ramsey moved quickly to slip one cuff through the foot of the bed, around the frame, and then snapped it around Stiles's other hand.</p><p>\"You won't get far, Bachman. Fuller and Whaley will be back here just as soon as-\"</p><p>\"Fuller?\" Ramsey gave his head a shake, stuffing the automatic into his waistband. Fuller was his immediate superior, a man he'd trusted. And Whaley was the crudest's.o.b. ever to walk the planet.</p><p>Ramsey went around in front of Cuyler again, kneeling. She sat limply, rubbing her wrists. Ramsey's anger grew when he saw the way the cuffs had cut into her flesh. He grew still more angry when she lifted her head to look into his eyes and he saw the pain in hers.</p><p>\"Which one of you did this to her, Stiles?\"</p><p>Stiles only glared at him and shook his head.</p><p>\"And why, for God's sake? It's pretty obvious the tranquilizer works. Why'd they have to hit her?\"</p><p>Stiles swore viciously. \"She wouldn't tell us where you were. You'd think she was human the way you're carrying on. Hell, Bachman, she's only one of them. An animal, like the rest.\" At Ramsey's glare, he lowered his head. \"I forgot, though. You are, too, aren't you? Just like them.\"</p><p>\"What the hell do you mean by that?\" Ramsey rose, towering over the man on the floor, his fists opening and closing at his sides.</p><p>Stiles clamped his jaw and refused to say another word. Ramsey turned back to Cuyler, bent over her, gripping her shoulders. \"Can you stand?\"</p><p>She nodded, and tried to rise to her feet, only to have her knees buckle as she collapsed against him. Ramsey caught her, slipped one hand beneath her legs and lifted her. He carried her across the hall and into the bathroom. Propping her against the sink, he ran cold water onto a washcloth. Carefully, he bathed her bruised face, her swollen eyes. He dabbed the blood from her lip.</p><p>\"Here, hold this to that bruise and I'll look for something to put on your wrists.\"</p><p>She took it, but shook her head. \"We have to get out of here, Ramsey. Those other two...\" Her words trailed off and she swayed a little.</p><p>Ramsey found a tube of ointment and some bandages in the cabinet and stuffed them into his pocket. Then he bent to scoop her up again. He carried her down the stairs, toward the front door.</p><p>Cuyler's eyes had fallen closed again. The damned drug. And God only knew what else they'd done to her. His fury was beyond anything he'd felt in his life. The closest he'd come was the rage he'd felt when his own mother had been murdered.</p><p>But that had been a child's rage. It didn't compare to the full-blown tempest whirling inside him now. He wanted to kill the DPI bastards for hurting her this way.</p><p>He carried her out into the chilly autumn night, marveling at the way her small body fit in his arms. He cradled her to his chest as if she were something precious. Hell, she was! Why was that so hard for him to admit? Cuyler was special, no matter what else she might be, and she didn't deserve what they'd done to her.</p><p>His shoes ground over gravel as he ran to the gate, opening it. He didn't care that it set off alarms inside...it didn't matter now.</p><p>Ramsey reached the twisting, narrow road and started up the opposite direction from the one Whaley and Fuller had gone. The car sat off the roadside where he'd left it, surrounded by scraggly brush and branches. He managed to open the passenger door with one hand and lower Cuyler to the seat. He forced his hands to remain steady as he snapped the safety belt around her, but it wasn't easy.</p><p>She looked bad, and he had no idea what to do for her. She might be dying for all he knew.</p><p>Gently he pushed her hair out of her eyes. Why had he left her the way he had?</p><p>Why the hell hadn't he been there when those bastards had shown up? Why hadn't he believed what she'd told him about DPI?</p><p>Her eyes opened, mere slits fringed by damp black lashes. \"Hurry.\"</p><p>Nodding, he slammed her door and raced around to the driver's side. Seconds later the car reversed out of its hiding place and onto the road. Grinding gears in his haste, Ramsey shifted, and spun tires as they sped away from the safehouse, away from DPI, away from everything Ramsey had known in his life.</p><p>Ron Stiles twisted and squirmed until he managed to work the extra key out of his back pocket. It took some maneuvering to fit it into the lock without being able to see what he was doing, but he did it. The cuffs sprang free and he automatically brought his hands around in front of him and rubbed his wrists.</p><p>Then he stopped and looked down at them. Cuyler Jade's wrists had been rubbed raw, bleeding. There'd been no reason for Fuller to put the handcuffs on so tightly. But he had, and it had pricked Stiles's conscience to see it. Still, he hadn't said anything.</p><p>And there'd really been no reason for Whaley to hit her. Not once, but twice.</p><p>And they hadn't been slaps. The bruises on her face had come from Whaley's knuckles when she'd told them more lies about Ramsey's whereabouts. Once again, Stiles hadn't voiced his objections. If Ramsey cared about her at all, Stiles supposed it was little wonder he'd been furious to see her that way.</p><p>But that was the question, wasn't it? Why on earth did Ramsey care about her?</p><p>How had he gotten so mixed up with her that he'd toss his career-his life-in the toilet by coming to her rescue that way? God, he knew she wasn't human. He knew.</p><p>So what was going on in his head?</p><p>Stiles hadn't wanted to believe what he'd read in Ramsey's files. He'd balked against what Fuller had said. That Ramsey had turned on them. That he was the enemy now. But now that he'd seen the proof of it with his own eyes, he couldn't doubt anymore. He just wished he understood.</p><p>Stiles left the bedroom, jogged down the stairs, and picked up the phone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She couldn't believe he'd done it. As Ramsey drove the car through the night, Cuyler forced her heavy eyes open and looked at him. His knuckles were white on the steering wheel. His jaw tensed as if he were grating his teeth. Perspiration made his forehead shiny in the glow of the dash lights, and dark stubble coated his face. Gray eyes, intense with concentration and maybe a little fear, darted her way every few seconds. And when he saw her gaze on him, one side of his mouth pulled upward slightly and briefly. An almost smile, meant to reassure her. No more.</p><p>\"You really came for me.\"</p><p>\"Don't tell me you're surprised.\" He shook his head, sighing. \"You've been saying all along I wouldn't take you in.\"</p><p>She bit her lower lip, unable to take her eyes from his face, from the strength she saw in it. And the turmoil. \"You risked everything...\"</p> <p>He turned onto a larger road and increased his speed. Then, licking his lips, he glanced her way again. One hand left the steering wheel and he brushed it lightly over her bruised cheek. His lips thinned. \"I'm sorry, Cuyler.\"</p><p>\"Sorry? You just saved my life-\"</p><p>\"If I'd listened to you in the first place, I wouldn't have had to. If I hadn't left you there, alone...\" He blinked slowly, lowering his hand and focusing his vision on the road once again. \"I tried to get back when I heard the snowmobiles, but-\"</p><p>\"It doesn't matter.\" She slid her hand over his on the wheel. \"You came after me. You got me out of there.\"</p><p>He shook his head. \"It's not over yet, Cuyler. They aren't going to let us go without a fight. And they're after both of us now.\"</p> <p>\"They were always after both of us.\"</p><p>He frowned, slanting her a sidelong glance.</p><p>\"Ramsey, they kept asking me where you were. The fat one, Fuller, he told the others that you were never really one of them, that it was only a matter of time before you turned on them.\"</p><p>Ramsey blew all the air out of his lungs. \"That doesn't make a damn bit of sense. Why would he say something like that? I've never given them any reason to question my loyalty.\"</p><p>\"I don't know.\"</p><p>Ramsey swore under his breath and hit the brakes, snapping the headlights off as he pulled the car onto the shoulder. Cuyler followed his gaze and saw the flashing lights ahead, on the ramp to the highway. A roadblock.</p> <p>\"Do you think they're looking for us? Already?\"</p><p>\"DPI works fast.\" He pulled the car around in a U-turn and slowly drove back the other way, flicking the headlights back on when they were out of sight. \"We'll have to take back roads out of here.\"</p><p>\"To where? Ramsey, where can we go?\"</p><p>He closed his eyes slowly. \"I don't know.\" He turned onto a side road, and then another. \"There's a map in the glove compartment.\"</p><p>She took out the map, unfolded it on her lap, and tried to keep her still-clouded mind focused on finding out where they were, and on discovering a safe route. \"Okay, at the end of this road, turn left. That one runs parallel to the highway.\"</p><p>He followed her directions, but even before they reached the road she'd pointed out, Cuyler saw the glow of more flashing lights in the distance.</p><p>Ramsey swore. \"They've got us boxed in.\" He stopped the car, shut it off, and turned to face her. \"We're not gonna get by them in this car. How do you feel?</p><p>You up to a walk?\"</p> <p>She lifted her chin and swallowed her fear. She had to be strong to help him through this, even though the pain they'd inflicted and the blood she'd lost made her weaker than she'd ever felt in her life. \"I'm fine. Let's go.\"</p><p>With a nod, Ramsey shrugged out of his jacket, then used the sleeve to wipe the steering wheel and gearshift, the headlight button, and anything else he might have touched. \"No sense leaving them any clues.\"</p><p>She nodded, taking the map with her as she got out of the car. Then he got out, and came around the car. He put his jacket around her shoulders, folded his big hand around hers, and led her into the woods at the roadside.</p><p>The darkness worked in their favor as they made their way from one small patch of woods to another, keeping the road in sight but staying far enough away from it to remain concealed by the trees.</p><p>She was exhausted. He knew she was. And frightened. Hell, he couldn't blame her.</p><p>He was scared himself. DPI was not going to be easy to elude. Besides, he had other reasons to worry. He didn't have a drop of insulin on him. And if he didn't get some soon, he fully expected to start feeling the effects.</p><p>His watch told him there was an hour before dawn, when Cuyler suddenly stopped, clutched her stomach and doubled over. She fell to her knees, groaning and then retching violently.</p><p>Ramsey knelt beside her, held her shoulders. Fear made him shudder as he wondered what could be wrong. God, she was so weak, already.</p><p>She rose, unsteadily, leaning on him for support. \"It's all right. I'm all right.\"</p><p>\"No, you're not. Cuyler, what the hell is it?\"</p><p>She sniffed, still not standing very steadily. \"I don't know. Maybe the drug they injected me with. I don't know. It's all right now, though.\"</p><p>It wasn't. It was perfectly clear that she was anything but all right. She was pale, trembling, cold. She needed someplace warm to rest and... Hell, he didn't know what else she needed. But whatever, he was determined to get it for her.</p><p>They were approaching a town, of sorts. A small grouping of neat little houses, with cars and the occasional bicycle in short, paved driveways. Supporting Cuyler with an arm around her shoulders, tucking her body close to his, he took her toward them, scanning for someplace, anyplace, where she might lie down for a while.</p><p>She stiffened when he pulled her out of the sheltering trees and toward clipped back lawns, all of them littered with colorful leaves. \"It's all right,\" he whispered. \"Come on, trust me.\"</p><p>She did, but hesitantly. They crossed three backyards before they found one with a prefab shed standing in it. Ramsey sighed in relief and started toward it, only to come to an abrupt halt when a huge dog lunged out of its doghouse and began barking loudly.</p><p>He took a single step backward, ready to duck back into the trees, but Cuyler caught his arm, stopping him. She didn't say a word. Just moved closer to the dog, staring at it with an intensity that was palpable. The dog stopped barking.</p><p>It stared right back at her, ears pricked forward, head tilted to one side. Then its tail wagged. She bent forward to stroke his big head. Ramsey only stood, dumbfounded, watching.</p><p>She turned to face him, smiling weakly. \"He'll keep quiet now;\"</p><p>Ramsey shook his head. \"So, should I start calling you Dr. Doolittle?\"</p><p>\"It doesn't always work. But sometimes, I can let animals know I'm a friend.\"</p><p>He took her hand again and led her to the shed, thanking his lucky stars there was no lock on the door. It opened easily, without a creak, and he pulled her inside. When he closed the door behind him they were in total darkness. He held her close to his side as he moved to the back, tripping once over what felt like a lawn mower, knocking over a shovel. Against the back wall, he urged her to the floor, then went back, feeling his way. He found a tarp that covered some piece of small machinery, and tugged it away.</p><p>He returned and settled beside her, tucking the tarp around both of them for warmth.</p><p>\"We could have gone farther.\" She snuggled close to him, resting her head on his shoulder.</p><p>\"You're barely putting one foot in front of the other, Cuyler. You're sick and you know it.\" He ran one hand through her tousled hair. \"What can I do to make it better?\"</p><p>He felt her hesitation, could almost feel her deciding not to tell him.</p><p>\"Nothing. It'll pass.\"</p><p>\"Funny how I can tell when you're lying.\" He drew a breath. \"It's not just the drug, is it, Cuyler?\"</p><p>She didn't answer.</p><p>\"Cuyler, if there's something I can do to help you, I want to do it.\"</p><p>Her hand touched the side of his face. \"No, you don't.\"</p><p>It was her tone, more than her words, that tripped the knowledge in his brain.</p><p>\"It's the blood loss, isn't it?\" He felt her stiffen, knew he'd hit on it. \"Your wrists bled, your lip. Quite a lot from the look of your blouse.\"</p><p>\"The injuries aren't that bad, Ramsey. We tend to bleed a lot. That's all.\"</p><p>\"So you need to replenish it.\"</p><p>\"Tomorrow night. We'll find a blood bank somewhere or-\"</p><p>\"You could take some of mine.\"</p><p>\"Ramsey, no-\"</p><p>\"You'd feel stronger, better, wouldn't you? Cuyler, it's all right. I trust you.\"</p><p>She sighed and sat up a little straighter. \"That isn't the point. Look, Ramsey, it would make us even more connected than we already are. The link between us is already tearing you apart inside. I don't want to make it even stronger.\"</p><p>He sat up, too, gripped her shoulders and turned her toward him. \"I don't go ten minutes without thinking about you, Cuyler. I've gone against everything I've ever believed in just to make sure you're all right. I don't see how it can get any stronger.\"</p><p>He felt her shake her head. \"It's the situation. Ramsey, you'd made up your mind to get away from me. You struck out through the frozen wilderness on foot, you were so desperate to leave. And if those men hadn't shown up, I don't think you'd have come back. You'd have found a way out, gone back to your old life and stayed as far away from me as you could get. You still might want to do that, if we survive this.\"</p><p>He closed his eyes and drew a steady breath. \"I was still fighting what I felt.</p><p>Dammit, you can understand that, can't you? One of you killed my mother, for God's sake. How could I-\"</p><p>\"One of us. You see? You still see it that way. An individual killed your mother, Ramsey. I had nothing to do with it.\"</p><p>\"I know that-\"</p><p>\"I could get help for us. I could summon others to help us out of this mess. We could stay with them until the danger passes. I could do it right now, Ramsey.\"</p><p>He went utterly silent at her words. Others. Others like her. Vampires. The beings he'd been taught to hate for most of his life. He breathed deeply, and shook his head. He couldn't trust his life to them. Just because he'd finally realized that Cuyler wasn't a heartless predator, didn't mean the others weren't.</p><p>She sighed deeply, and he thought he heard sadness in the sound. \"It's all right. I won't do it. I wasn't considering it, anyway. I wouldn't want to bring anyone else into DPI's sights. I only wanted to make a point.\"</p><p>\"Cuyler, you can't expect me to put my life in their hands.\"</p><p>\"No. And I don't. But, Ramsey, they're just people. We were all human once, just like you. There are good and bad in any group, and you can't just write off an entire race because of one incident. It's bigotry, can't you see that?\"</p><p>\"No, it's not. It's different-\"</p><p>\"It's different because we're different, right?\" She leaned against the wall, turning her back to him.</p><p>He knew he'd hurt her, angered her. But, dammit, it had been a major leap for him to see her as less than a monster, as a caring woman with thoughts and feelings like any other. Now she expected him to accept the entire race as just ordinary folks with a slight aversion to sunlight and solid food? They'd been different, even as humans. That damned antigen in their blood made them different.</p><p>No, dammit, he wasn't ready to concede that everything he'd ever learned had been wrong. DPI may have gone too far in their persecution, but they'd had reasons. Ramsey had reasons, too. His mother. She was his reason, and he couldn't let go of his old anger so easily.</p><p>Ramsey dozed, and it was full daylight when he woke. Cuyler slept in a corner, far away from him. It was the darkest spot in the shed, and while no sunlight touched her body, he covered her entirely with the tarp, just in case. There were no windows in the metal shed, but light spilled through seams in the tin here and there. He worried about the beams moving as the sun did.</p><p>Sounds of life-motors, air brakes-floated toward him. He opened the door a crack and peeked outside, checking first to make sure the light didn't touch Cuyler. A school bus rolled to a stop in front of the house. He couldn't see who boarded, since the house itself blocked his view, but a few seconds later it rolled away, followed closely by the two cars that had been in the driveway.</p><p>God, could he be so lucky? A two-career family with all the kids in school? He slipped out of the shed, glancing in both directions to be sure no one could see. He gave the dog a cursory glance, but the huge Newfoundland was busy devouring a fresh supply of kibble and didn't even look his way.</p><p>Swallowing a healthy dose of anxiety, Ramsey walked up to the back door and knocked as hard as he could. What better way to find out if anyone was home? He waited, rehearsing what he'd say if someone answered. He figured he could pretend he was at the wrong house. But no answer came. The lock was a snap for any government agent worth his salt. In a few seconds he was inside, carefully and quietly searching the place just to be sure no one was around. Sighing in relief when there wasn't.</p><p>It was too much to hope that one of the residents might be diabetic and have some insulin lying around. But he checked anyway. Not finding any, he was extremely careful when he raided the fridge. He had to eat, but God only knew what his system would do with whatever he put into it. He made do with a few stalks of celery and a sugar-free rice cake. There was a little coffee left in the pot, and he heated it in the microwave and gulped it down. Then he headed for the living room and snapped on the television, only to stumble a few steps backward when he saw his own face and a composite drawing of Cuyler's on the screen, with a 1-800 number beneath them.</p><p>He only heard the words \"Armed and extremely dangerous,\" before the picture changed and the reporter launched into another story.</p><p>His initial reaction was to head for the shed, gather Cuyler up, and run as fast as they could go. But he couldn't do that. He had to wait until sunset. There was no other way.</p><p>He got another rice cake, and sat down to work out the most immediate problem.</p><p>Cuyler's condition. She was weak, sick. He knew what she needed to feel strong again. And he knew she wouldn't take it from him no matter how often he offered.</p><p>So he had to come up with some way to convince her. And there was only one that came to mind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She woke to the warning vibrations skittering over her nerve endings. The tarp slipped from her shoulders as she sat up, calling out to Ramsey.</p><p>\"Right here. I'm right here.\" There was a click, and then the beam of a flashlight bathed the space between them. One side of Ramsey's mouth curved upward before the other, but she got the feeling his smile was hiding some new turmoil. \"Found a few treasures in the house.\"</p><p>She sat up straighter, but dizziness swamped her. He saw it, frowned at her, and she tried to change the subject. \"You were in the house?\"</p><p>\"Yeah. No one was home.\" His smile died slowly. \"I only took what we needed.</p> <p>They won't even notice it's missing.\"</p><p>Her breath escaped in a rush. \"Just what did we need so badly I you had to steal for it?\"</p><p>His head came up fast, a look of surprise on his face. \"Didn't mean to shock you like that, Ramsey. I forgot, my kind isn't supposed to have any moral values at all. You're not going to faint on me, are you?\"</p><p>His brows drew together. \"You wake up cranky, anybody ever tell you that? You still don't feel very well, do you?\" She refused to answer. Ramsey scanned her face. \"You sure as hell don't look as if you do. Anyway, I didn't steal this stuff, exactly. I left some money. Stuffed it under the sofa cushion.\"</p><p>She rolled her eyes. \"Wonderful. But it still wasn't worth the risk. You could have been seen.\"</p> <p>\"But I wasn't. And I got us a much-needed flashlight. Ought to come in handy, since we can only travel by night.\"</p><p>\"I have excellent night vision.\"</p><p>\"A sleeping bag, so we don't catch pneumonia.\"</p><p>\"I can't catch pneumonia.\"</p><p>\"Some food-\"</p><p>She crooked an eyebrow at him.</p> <p>\"Yeah, right. I forgot. How about this, then?\" He handed her some folded clothing, and she took it.</p><p>\"What-\"</p><p>\"One pair of jeans, size six, petite. They must have a teenager about your size.</p><p>And a warm sweater. Now put them on and quit griping. We have to move.\"</p><p>She got to her feet, set the clothes aside, and grabbed the hem of her blouse.</p><p>Then she paused. \"Well?\"</p><p>Ramsey blinked, breaking his intense stare. \"Well, what?\"</p><p>\"You going to turn off that light?\"</p> <p>\"Sure.\" There was a soft click, and the shed was once again bathed in darkness.</p><p>Cuyler heeled off her shoes, pulled her blouse over her head, then stepped out of her pants. She reached for the clothing she'd set aside, but Ramsey's hand closed over hers, stopping her.</p><p>She drew a quick breath, looking behind her. \"What is it?\"</p><p>\"Not dark enough in here, I guess.\"</p><p>He stood closer, his shirt brushing her back. Then his hands crept around her waist, pulling her back against his strong chest. \"I still want you, Cuyler. I'm still having those damned dreams.\"</p><p>She closed her eyes tightly, stiffening herself against the onslaught of desire that rocked her. She couldn't let this happen, not now, not when her hunger was so strong. She hadn't fed in such a long time. Didn't he realize what would happen if they...</p><p>\"I can't...\"</p><p>\"Why not?\" His head bent over her shoulder, his lips finding and nuzzling her neck. The brush of his new whiskers scraped over her skin, and she shivered.</p><p>Any excuse would do. She had to stop this craziness. \"You still see me...as... Stop, Ramsey.\" Her head tipped sideways as his mouth moved over her shoulder. Warm fingertips trailed upward, along her spine. \"I don't want...\" The words became a sigh.</p><p>\"Yes, you do. And so do I. Hell, I'm tired of fighting it, Cuyler. I'm tired of trying to deny it, hoping it will go away. It won't. I think we both know that.\"</p><p>\"But...\" His palms came up beneath her breasts, cupped them, squeezed. \"Ramsey,\"</p><p>she breathed. \"Ramsey, you still believe...\"</p><p>\"The hell with what I believe. This is physical. Beliefs don't enter into it.\"</p><p>His fingertips closed on her nipples. She caught her breath. He applied more pressure and she sighed. In one quick motion he turned her around, caught her mouth beneath his, dug his tongue into her. She responded, sucking it, running her hands up his back, under his shirt.</p><p>He gripped her buttocks in his hands, lifting her as he sat down on the seat of a lawn tractor, pulling her onto his lap so she was straddling him. Then he attacked her breasts with his mouth, sucking, biting, licking at them until she writhed against the hardness she felt poking up through his jeans. \"This isn't fair,\" she whispered.</p><p>\"It was your idea. You said back at the house that if we just did it once, we might get over it. Well, here we are, Cuyler. Let's test your theory.\"</p><p>He devoured her nipples again, one after the other, all the while holding her hard to his lap and moving his hips against her. Then his hands closed on her waist and he lifted her, higher, until her backside rested in the curve of the steering wheel.</p><p>\"What-?\"</p><p>\"I did this in my dreams, Cuyler. I want to try it for real.\" His hands slipped up the insides of her thighs, and he pressed them Open. Then he dropped kisses along them, moving higher, ever higher. Finally his mouth found its goal and he pressed his face to her. His tongue parted her and found its way inside.</p><p>Cuyler's head fell backward as she felt him licking her, scraping her with his teeth, sucking at her until she trembled all over.</p><p>Her hands tangled into his hair and he lifted his head, staring up at her as his hands moved to his jeans. Then he returned them to her waist, to pull her down to him. As he filled her, she felt the current that moved through both of them.</p><p>Twining her arms around his neck, burying her face there, she sank lower. He clasped her hips, lifting her, lowering her again, plunging deeper inside her with every thrust.</p><p>Her lips caressed his neck, and her need mounted, beginning to build as she'd known it would. Every step she took toward fulfillment fired the hunger. She tasted the salt of his skin, felt the blood rushing beneath it.</p><p>He moved faster. Ecstasy hovered just beyond her reach, and the thirst raged.</p><p>She tore her head away from his muscled neck, averting her face.</p><p>His hands slid up over her back, captured her face and turned it toward him again. He kissed her, deeply, desperately. \"It's all right, Cuyler.\" His lips moved over hers as he whispered. He guided her head to his neck once more. \"It's all right. Do it.\"</p><p>Her lips trembled on his skin, then parted. Only a sip, only one small taste of his essence. Just enough to get her through this night.</p><p>He stiffened, moaning deep and hoarse as her teeth pierced his throat. His hands pressed to the back of her head even as his body rocked harder and faster in time with hers. The climax claimed her, held her in its shattering grip for an instant, and forever.</p><p>As it slowly faded, the ripples of pleasure smoothing and stilling, Cuyler lifted her head away and closed her eyes to prevent the tears from spilling over. \"God, what have I done?\" She couldn't look at him, couldn't bear to see condemnation in his eyes. She began to rise, but he held her to him.</p><p>\"You had to, Cuyler. You needed-\"</p><p>Her sudden stare stopped his words. She searched his face, not believing what she was thinking, not wanting to think it. \"You knew, didn't you? You knew the way desire would heighten the need until I couldn't fight it?\"</p><p>He nodded once. \"Yeah. I knew. And I also knew you couldn't take another night on the run without it.\" He shrugged, his hands moving into her hair, stroking it. \"I offered earlier. You refused. I couldn't think of any other way.\"</p><p>That's all it was, then. Physical needs that needed fulfillment, just as he'd said. Only he'd been referring to hers, not to his own.</p><p>She slid to the floor, pulling from his grasp when he tried to keep her with him. Without a word, she picked up the clothes and began to dress. He got up, as well, but she didn't look at him. She couldn't. Making love to him had filled her heart to overflowing. Realizing how little it meant to him had broken it in two, and she could almost feel the fragile contents spilling onto the floor.</p><p>Cuyler heard him moving around, packing up his treasures, she imagined. Then he stood still, and she felt his gaze on her.</p><p>\"I hurt you,\" he said softly. \"I didn't mean to.\"</p><p>Blinking her eyes dry, she fixed her face into a smiling mask, and turned to face him. \"No, Ramsey. It was physical, right? No feelings involved.\"</p><p>His eyes probed hers, reaching through the darkness, it seemed, into the depths of her soul. \"Maybe...\" He stopped speaking, his head coming up slowly. \"What is that? Sounds like a flock of geese, or...\"</p><p>Cuyler listened, and then her broken heart froze inside her. \"Dogs! God, they've got dogs!\" The crying of what sounded like a hundred hounds filled the night, louder when she flung the door open and ran outside.</p><p>Ramsey grasped her hand and headed for the street. She knew there was no use creeping through the woods, not now. Speed was what mattered. Calming one family pet with the power of her mind Was a simple trick. She knew better than to try it with an entire pack of vicious hounds.</p><p>Cuyler's heart hammered with fear as she ran beside Ramsey. The baying drew nearer, louder. In moments the dogs would burst out of the woods where they were searching. They'd be on them seconds later, and it would be over.</p><p>Everything-life-would be over.</p><p>\"There! Look!\" Ramsey didn't slow down. He kept running, but veered into a driveway, only stopping when he came to a mean-looking black motorcycle leaning on its kickstand. Releasing her hand, he straddled the seat. One kick, two. The motor roared and Ramsey twisted the accelerator, revving it. Puffs of black smoke belched from twin pipes at the back. Cuyler leapt on behind him, clinging to his waist as he released the clutch and the bike lurched into motion.</p><p>Inexpertly, he turned it around, lowering one foot for balance. Then he shifted, gunned it, and they shot out of the driveway and down the street.</p><p>She might be killed on this suicide machine, she thought vaguely. But at least she couldn't hear those damn dogs anymore.</p><p>Okay, so he'd hurt her...again. He could only pray there would be time to make it up later.</p><p>When he'd decided to make love to Cuyler, he'd told himself he was doing it for her, so she wouldn't wilt and die of her brand of starvation before he could get her to safety. The problem was, what he'd told himself had been a lie. And not even a very convincing one. He'd wanted her. Hell, he still wanted her. Instead of dulling this rampant lust he felt, being with her had only sharpened it to a razor's edge. It hadn't been physical, dammit. It had been something more, something deeper, almost...almost spiritual. And when she'd finally done what he'd wanted her to do...</p><p>He shook his head in wonder. For a few brief seconds he'd felt everything she was feeling. He'd experienced her thoughts, known her emotions, felt every sensation that rippled through her body. It had been as if their minds had melded into one. He'd had the shocking sensation of her heart beating beside his within his own chest.</p><p>All of that had combined with the passion he felt for her and exploded into something he'd never felt before. It wasn't like sex with a...with a normal woman.</p><p>It was above and beyond, a whole other world.</p><p>And so what had he done with all this newfound knowledge about her? Nothing.</p><p>He'd ignored it, pretended it hadn't happened, let her go on thinking the entire exchange had been his own clever plot to get her to drink.</p><p>She was hurting over that, now. There was a real, physical pain where her heart lived. She felt as if her soul was bleeding, and she was battling tears.</p><p>Ramsey blinked in shock as those emotions flicked through his mind just as clearly as if they were his own. What the hell?</p><p>A police car blocked the road ahead. Ramsey leaned left, turning the handlebars and heading the bike over someone's back lawn. They bounded up and down on the seat as he drove over what felt like a washboard, up a shallow hill, and onto another road, then continued in the direction he'd been going. The ploy worked.</p><p>The police couldn't get ahead of him in time to block his way, and he realized he could get to the road that ran parallel to the highway in the same manner.</p><p>This time, though, he didn't wait for a cruiser with flashing lights to force him off. He drove across a farmer's field, rutted and rough all the way, and he had to struggle to keep the bike upright. The cops would converge on the road where he'd been. But he would zip right past them by another route. For the first time tonight he thought they just might get out of this mess alive.</p><p>Cuyler was beginning to think so, too.</p><p>Ramsey frowned, glancing at her behind him. Her arms tightened a little at his waist, and her head rested against his back. He supposed he could no longer doubt that she had feelings and emotions. Not when he was experiencing everything she thought, everything she felt. This must have been what she'd meant when she'd told him that the connection between them would be even more powerful if she drank from him.</p><p>He felt her emotions. She was scared. But beyond that, a profound sadness made her keep fighting back tears. She thought that maybe she'd been wrong about him, all along. She thought that he'd never be able to see that his mistrust of her kind was a mistake, a product of the hatred he'd nurtured for so long. And she thought...</p><p>Ramsey blinked in shock and nearly dumped the bike. She thought she might be falling in love with him.</p><p>\"Have we lost them?\" She had to yell close to his ear to make herself heard over the motorcycle.</p><p>\"Only for the moment,\" he shouted back. \"Once they get a chopper up, they'll spot us again.\" The road they were on veered away from the highway, but he followed it anyway. It took her a moment to realize where he was going, but when she saw the sign, she stiffened. Limestone 5 Miles.</p><p>\"Ramsey, you're going the wrong way! This is where we started!\"</p><p>\"Exactly what they'll be thinking,\" he told her. He took a turn, then another, and within a few minutes they were on a road Cuyler recognized. Ramsey stopped the bike, and when they both got off, he pushed it into the trees at the roadside. Taking her hand, he pulled her along beside him, right up to the gates of the house where she'd been held prisoner such a short time ago. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She shivered uncontrollably as Ramsey pulled her through the gates, along the path, right through the front door. He knew what she must be thinking. That he'd lost his mind, or that he'd decided to turn her over to DPI after all. It amazed him that she didn't argue with him, just came along, completely trusting a man who'd given her nothing but reasons not to.</p><p>Sensing her turmoil, he gave her hand a reassuring squeeze as he closed the door behind them. \"It's gonna be all right, Cuyler. This is the safest place we could be right now. The last place they'd think to look for us. And you can bet Fuller and his men won't be back here as long as they think they're on our trail.\"</p><p>She bit her lip, her gaze scanning the living room. The place looked like the home of a wealthy, tasteless individual. Not a branch office for a government agency. But then, that was the whole idea. DPI's anonymity was vital to its success.</p><p>Ramsey armed the security device, then began fiddling with the buttons, programming a new entry code, one Fuller wouldn't know. Cuyler walked slowly away from him, and he heard her exhausted sigh. Fortunately, though, her wounds had healed with the daytime rest. Her wrists were no longer cut and bruised. The purple mark on her face had vanished, and her cut lip had healed.</p> <p>But some wounds were tougher to heal than others. And he still felt her pain, the one he'd caused himself. He a nave to find a way to remedy that soon, or he'd lose her. He wasn't sure they could get out of this alive, but if they did, and if they went their separate ways the way Cuyler seemed to have decided they must he was going to hurt for a very long time.</p><p>He paused in punching buttons, to slant her a glance. \"Cuyler, you're wrung out, Why don't you go upstairs, take a nice hot bath, relax for a while?\"</p><p>She blinked slowly, and he knew she was tempted by the suggestion. \"No, Ramsey.</p><p>Two sets of eyes are better than one. Suppose I go up there and a swarm of agents kick the door in?\"</p><p>\"I don't think that's likely to happen anytime soon.\"</p> <p>He finished punching in the new entry code. No one would open this door, or the front gate, without him knowing about it. Then he turned to her again, saw the uncertainty in her eyes. \"Go on, Cuyler. Ask me.\"</p><p>\"Ask you what?\" Her chin lifted a little, and he saw her trying to mask her doubts.</p><p>\"Why I brought you here,\" he said softly. He ran one hand over the side of her face, cupped her cheek. God, her skin was soft. \"Not to give you up, Cuyler. If they want you, they'll have to go through me.\"</p><p>She bit her lower lip, nodding, but he knew she wasn't as sure of that as he was.</p><p>\"You don't believe it?\"</p><p>\"I...\" She shook her head, paced away from him. \"How can I believe you'd lay your life on the line to protect someone you still see as some kind of inferior species?\"</p> <p>\"That isn't-\"</p><p>\"I know. That isn't what you meant to say.\" She shook her head, turning to face him again, her gaze steady, strong. \"But it's how you feel.\"</p><p>He shook his head slowly. \"You're wrong, Cuyler. There's nothing inferior about you.\"</p><p>\"Just the rest of my kind, right, Ramsey? So what does that make me? An exception? A freak?\"</p><p>He lifted his hands, palms up, struggling to find words that would convince her how wrong she was, but she gave him a single glance that told him it would do no good. She wouldn't listen. He let his hands fall to his sides, sighing in defeat.</p><p>\"So, why did you bring me here?\"</p><p>Ramsey closed his eyes, tried to find some patience. It would take time to get her to trust him again. She'd believed so strongly in him before, and his fall from grace must have been a damaging one. But not fatal. \"Come here. I'll show you.\"</p><p>He took her hand in his and laced his fingers with hers. Such a small hand, silky soft, steady now, despite her fears. He thought about the way that hand had felt tangled in his hair, those fingertips sinking into his shoulders. He glanced down at her, caught her staring up at him, but she looked away fast. He cleared his throat and pulled her with him to the door at the far end of the room. When he stepped through, he waved an arm at the equipment that covered every inch of the counters that lined the room. Computers, faxes, phones, radios, an entire bank of video screens, each showing a steady view of a different room within this house.</p> <p>He heard the air escape her in a rush, heard her murmured exclamation. Ignoring it, he moved forward, snapping on the police band receiver, and then the more sophisticated radio. The one DPI used to keep in touch. He listened for a minute, heard nothing but static. Then he sank into a chair and flicked on a computer.</p><p>\"What are you doing?\"</p><p>He glanced sideways at her, but his attention shot right back to the screen.</p><p>\"I'll know everything they do, every move they make from here on in, Cuyler.</p><p>We'll figure a safe way out of here before morning. Meanwhile, this system is a direct link to the main one in White Plains. I'd like to see what they have on me, find out why Fuller's been doubting my loyalty.\"</p><p>He heard her move, then turned to see her leaning against a wall, chewing her lower lip. \"There's not much you can do here, really. I'll be on top of things.</p><p>Take that bath.\"</p><p>Cuyler bathed. She didn't do as Ramsey had suggested, though, and lounge around in steaming water for hours. She made it quick and efficient. Then she scoured the house for extra clothes, finding none. She made do with the jeans and sweater she'd been wearing. After she'd towel dried her hair, she wandered back down to the first floor, located the kitchen, and brewed a pot of coffee.</p><p>With a cup in her hand, she went back to the room, tapped once, and walked in.</p><p>Ramsey's face did a lousy job of hiding his emotions, and the look it wore made her heart trip over itself. He faced her when he heard her come in, tried to mask his bewildered expression, but still failed miserably.</p><p>She crossed to where he sat, pressed the mug into his hand. \"How bad is it?\"</p><p>He licked his lips, lowering his eyes. \"Pretty bad.\"</p><p>\"Tell me.\"</p><p>He glanced at the screen in front of him. It showed a spider web of lines that looked like a map, with little red lights glowing at intervals. He pointed to one of them. \"These are the roadblocks. There's not one route out of here they haven't plugged tight. They're checking every vehicle that passes.\"</p><p>\"So we can't get out by car. We can go on foot.\"</p><p>\"They have choppers up, scanning the ground for us. And the dogs are working the woods. Cuyler, I don't think-\"</p><p>The front door slammed and both of them went stiff, whirling toward the sound.</p><p>\"You don't think at all, Bachman. That's part of the problem.\"</p><p>The deep voice was one Ramsey had heard before. He recognized it, and rose slowly.</p><p>The dark form filled the doorway, nodding once to Ramsey. \"Hello again, Agent Bachman.\"</p><p>Ramsey tried to swallow, but found his throat blocked by a brick of hatred. This man was a killer, a killer Ramsey had been sent to bring in. But he'd failed.</p><p>\"Damien.\"</p><p>\"Aren't you glad to see me, Bachman? Thought you'd be overjoyed, after chasing me all those months, trying to capture me for your bosses at DPI.\"</p><p>Ramsey took a single step forward. \"You killed two women, you bastard. And you-\"</p><p>Damien glared at him, his black eyes glittering with unconcealed dislike. \"I killed one man. A vampire. The one responsible for the two murders you were sent to investigate.\"</p><p>\"Liar!\" Ramsey lunged toward him, only to have Cuyler leap in front of him, her palms flat to his chest.</p><p>\"It's true, Ramsey! There were witnesses. I've read the whole account, and he's telling you the truth.\"</p><p>Ramsey glanced down at her, then at the man he'd spent months trying to capture, the man who'd made a beautiful young woman into a creature like himself.</p><p>Damien blinked and held his gaze. Some of the fury left the vampire's eyes. \"She was dying,\" he said simply. \"I loved her, Bachman. I couldn't just stand by and let her go.\"</p><p>Ramsey narrowed his eyes and shook his head.</p><p>\"Check your precious DPI files, if you don't believe me.\" Damien lowered his head and paced in a small circle. \"They know now it wasn't me who murdered those two. They know it was Anthar, the vampire I killed. Yet the hunt for me continues.\" He stood still, shot Ramsey a glare. \"Go on, check. You have the information at your fingertips. Or are you afraid of what you'll find?\"</p><p>Ramsey blinked twice, and stared at him, stunned speechless. \"Anthar?\" he finally managed. He glanced toward Cuyler, and she nodded confirmation. Sighing hard, Ramsey sank back into his chair. He closed his eyes. \"All right. I believe you.\"</p><p>Cuyler sighed in relief, but Damien only cocked his brows in surprise. \"You don't need to see the proof?\"</p><p>\"No.\" Ramsey shook his head slowly. \"No. I've found quite a few surprises in my own DPI files. Enough to show me what they're really about.\" He shook his head, meeting Cuyler's gaze. \"You were right all along. I just wish I'd believed you sooner.\"</p><p>Cuyler blinked moisture away from her eyes, and faced Damien. If she looked a bit awed, Ramsey figured it was natural. She was in the same room with the man reputed to be the oldest of all of them, the first. \"Why are you here?\" she asked him.</p><p>\"To get you out.\"</p><p>\"But how did you know-\"</p><p>\"No time for that, child. You must come with me now.\" He took her hand and tugged her toward the doorway.</p><p>She pulled free. \"I'm not leaving him.\"</p><p>Damien's eyes took on a feral gleam. \"He's not worth your devotion, Cuyler. He's one of them, those same bastards who make our very existence a game of hide-and-seek. The ones who see to it we never know peace. If they've turned on him now, then all the better. Poetic justice, if you ask me.\"</p><p>\"I didn't ask you!\"</p><p>His glare grew sharper still.</p><p>\"They had me, Damien. He got me out. He risked his life to do it.\"</p><p>\"Too little, too late. What good did it do? He's one of them, Cuyler! Leave him here and be rid of him for good.\"</p><p>\"Damn you with your us-and-them mentality! Don't you see that's exactly the bigotry that got us to this point in the first place! Damien, your way of thinking is just as twisted as DPI's. Can't you see that?\"</p><p>Ramsey touched her shoulder, his hands squeezing gently, but his gaze remained on Damien. \"Can you get her out?\"</p><p>\"There's no doubt.\"</p><p>\"No!\" She twisted her head to stare into Ramsey's eyes just before he slammed them shut.</p><p>\"Go with him, Cuyler.\"</p><p>\"I won't! Dammit, I won't!\"</p><p>\"There's no time to argue,\" Damien said softly, though his eyes had lost some of their anger, and a frown that might have been one of confusion had taken up residence between his brows. \"Have you noticed the radio silence, Ramsey? The sudden stop in all radio contact?\"</p><p>Ramsey opened his eyes and turned slowly to stare at the computer screen that glowed like an all-seeing oracle.</p><p>\"They knew the second you turned it on and began accessing information,\" Damien said softly. \"They're probably already on their-\"</p><p>A bullhorn-enhanced voice apparently shattered the slight grip Cuyler had on her composure. She screamed at the first words, but Ramsey still heard them.</p><p>\"Bachman, we have the house surrounded. There's no way out. Give yourselves up.\"</p><p>Ramsey lowered his head. \"Can you still get her out, Damien?\"</p><p>\"Ramsey-\"</p><p>\"If we can get to the roof,\" Damien replied, cutting her off.</p><p>She threw her arms around Ramsey's neck. \"No! I won't do it. I love you-\"</p><p>The bullhorn-enhanced voice came again. \"We'll give you ten minutes, Bachman.</p><p>Then we come in shooting.\"</p><p>The sharpshooter in the tallest pine tree whistled, and when he had Fuller's attention, he whispered loudly, \"There's a third person in there, Fuller. A man, tall, very dark complexion.\"</p><p>\"How the hell-\" Fuller nodded, and hurried toward the DPI van, glancing as he did at the miniature dish on the top. \"Can you get this thing up and operational? I need to hear what's being said inside.\"</p><p>The technician only held up one hand for patience, adjusting his headset and fiddling with dials. Finally he nodded and smiled. He handed the headset to Fuller, who held it up to one ear. Then his eyes widened, and he smiled.</p><p>\"It's him!\" He shook his head slowly. \"We've hit the damn jackpot this time, fellas. Get me a line to Bachman. It's time to make a deal.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Damien studied Ramsey as if seeing him for the first time. \"Hard to believe we have one common goal, after all this. We both want to see Cuyler get out of this alive.\"</p><p>Ramsey lowered his eyes. \"We have more in common than you know, Damien.\"</p><p>The other man frowned, parted his lips to ask something, but Ramsey cut him off.</p><p>\"Look, it's no secret that I don't like you.\"</p> <p>\"You're not exactly my favorite person, either, Ramsey.\"</p><p>\"Unpleasant as you are, though, you're not a killer.\"</p><p>\"Thanks so much for informing me.\"</p><p>Ramsey blew air through his teeth. \"You want to shut the hell up and let me apologize!\"</p><p>\"Is that what you were doing?\"</p> <p>Damien's stare was as hateful as ever, and Ramsey knew the one he sent back was as bad, or worse. Ramsey wanted to deck the guy, but he restrained himself.</p><p>There was another part of him that wanted to shake Damien's hand, call him friend.</p><p>\"The one you killed, Anthar...\" Ramsey swallowed the lump in his throat and shook his head.</p><p>\"What about him?\"</p><p>Clearing his throat, stiffening his spine, Ramsey answered. \"He was the one who murdered my mother.\" He heard Cuyler catch her breath. \"DPI knew all along. It's in my files, along with a lot of other...\" He bit his lip, shook his head.</p><p>\"Doesn't matter now, I guess. I just thought you ought to know.\"</p> <p>\"Know?\"</p><p>\"That you're not quite the bastard I had you pegged as being, all right? Now, if you don't mind, can we quit talking and get Cuyler out of here?\"</p><p>Damien tilted his head to one side. \"You aren't a bit afraid of me, are you?\"</p><p>\"Oh, hell yes, Damien. Scared witless. Don't you see my knees knocking?\"</p><p>Damien chewed his inner cheek, eyes narrow. \"You're an unusual mortal.\"</p><p>\"You're both idiots!\" Cuyler shouted the words as she crossed into the living room and peered through a curtain. \"And insane, to boot, if you think I'm leaving here without you, Ramsey.\" There were tears glittering in her eyes. \"We go together or not at all.\"</p><p>He went to her, unable to stop himself. Vaguely he was aware of Damien tactfully slipping out of the room, but his mind was focused on Cuyler. Her heart was breaking. He could feel it. Or was that his own? His hands slipped around her waist as she turned to him and he pulled her close.</p><p>\"I'm not worth dying for,\" he whispered. \"Cuyler, you have to go with him.\"</p> <p>She threaded her fingers in his hair. \"You love me, don't you, Ramsey?\"</p><p>His eyes devoured her face. Her turned-up nose, her huge, dark eyes. That ruffly jet hair.</p><p>\"Say it, just once, say it.\"</p><p>He nodded, his mind reeling with the force of what he felt. \"I don't think love is a strong enough word. Hell, Cuyler, you've turned me inside out. Before you, I swear there was ice running in my veins instead of blood. A big hunk of granite hatred where my heart ought to be. You changed that.\" He lowered his head, captured her sweet mouth one last time, kissed her the way he'd been wanting to all night long. When he pulled away, he licked the taste of her from his lips. \"Yes, Cuyler. I love you.\"</p><p>Tears flowed like rivers on her cheeks. \"Then don't ask me to go on without you.\" She sniffed, swallowed, her voice became tight and thin. '\"Cause I don't think I can.\"</p><p>\"You'd have to sooner or later anyway.\" His thumbs swept the moisture from her cheeks. \"You're immortal. I'm not and there's no way I can be.\" God, how it tore him apart to utter that lie. There was a way. He knew that now, was still jolted by the knowledge. But he couldn't tell her. She'd never leave if she knew.</p><p>She shook her head fast and hard, but he caught her face between his palms, held it still. \"It's the truth. We would have had to face it eventually.\"</p><p>\"I don't want to hear this!\" She whirled away from him.</p><p>Damien reentered the room, clearing his throat to announce his presence. Ramsey met his probing gaze. It was knowing, that look.</p><p>\"There's a door to the roof through the attic,\" Ramsey said, fighting for a level tone. \"I want you to go with Damien now. They won't wait patiently much longer.\"</p><p>Damien went to Cuyler, took a gentle hold on her arm, and started for the stairs. The telephone jangled and Ramsey went rigid. It rang again, and this time the voice on the bullhorn shouted at him to pick it up.</p><p>His hands damp with sweat, he did.</p><p>\"Bachman?\"</p><p>His lips thinned. The voice belonged to Wes Fuller, his trusted superior. \"What the hell do you want?\"</p><p>\"Wouldn't be a good idea for your two pals to go up on the roof, Bachman. We have sharpshooters high enough to hit them there.\"</p><p>He swore his heart turned to ice in his chest. He covered the mouth piece with one hand, waved to get Damien's attention. Damien halted halfway up the stairs and waited, watching Ramsey's face intently.</p><p>Ramsey cleared his throat. \"What makes you think anyone was thinking about going to the roof?\"</p><p>\"Oh, we don't think. We know. I've been listening in on your touching little conversation.\"</p><p>\"Maybe you'd like to meet me one on one, Fuller? Maybe you need a little dental work done, hmm?\"</p><p>Fuller's laugh was low and throaty. \"No, thanks. Look, I know you've been sniffing around in your files... among other things. How much do you know?\"</p><p>\"About what?\"</p><p>The other man hesitated, then went on. \"Your diabetes, for starters.\"</p><p>\"I know I don't have it. Never did.\"</p><p>\"And your insulin?\"</p><p>\"An experiment. To mask...\" Ramsey glanced toward Cuyler on the stairs, and decided not to say any more.</p><p>\"Go on, Bachman. Tell me, do you know about your blood type?\"</p><p>\"I know,\" he said softly, slowly.</p><p>\"So you know all that crap you just fed the...lady was bull. You could join the ranks and live happily ever after with her. You realize that?\"</p><p>Ramsey stiffened. \"What's your point, Fuller?\"</p><p>\"I could let you go. Her, too. I could pull back and let you both walk out of here, right now. I have the authority.\"</p><p>Just like that. Fuller let the words hang in the air for a long moment. But Ramsey wasn't stupid. There was more. It was either a trick to get them to let their guard down, or Fuller wanted something. He wasn't certain which.</p><p>\"What's the catch?\" He tried not to let the sudden surge of hope come through in his voice.</p><p>\"Finish the assignment you had before this one. That's all. Not so much to ask, is it, Bachman?\"</p><p>Ramsey closed his eyes, knowing exactly what Fuller wanted. The job before this one had been the capture of Damien Namtar, the most powerful, the oldest, probably the first of all vampires.</p><p>Ramsey had had no qualms about hunting him down a year ago, when he'd believed with everything in him that the man was a heartless predator, a killer. But now he knew better. He'd wronged Damien with his persecution. And he owed the man.</p><p>More than ever, Ramsey knew what would happen to Damien if he were turned over to DPI. They were the heartless killers, not him. God, it was all so clear now.</p><p>Why had it taken so long?</p><p>\"How do you expect me to do that?\" he asked, just to stall, trying to think of some way out of this trap.</p><p>\"The tranquilizer, Bachman. There are filled syringes in the desk, bottom drawer. Just stick him, and leave the rest to us. You and your pet can walk away and never look back.\"</p><p>Ramsey turned and met Damien's steady gaze. Not looking away, he replied, \"It might take a little while.\"</p><p>\"I can give you an hour, Bachman. Not a minute longer.\" The connection was broken.</p><p>Ramsey licked his lips and put the phone back in its cradle.</p><p>\"What?\" Cuyler whispered. \"What's going on?\"</p><p>\"Nothing.\" His gaze shifted to Damien's and he got the odd feeling the man knew every word that had been said. \"I bought us some time, is all.\" He reached for a piece of paper and a pencil, and scribbled quickly. \"They can hear every word we say, so be careful.\"</p><p>When he held it up, Damien and Cuyler came back down the stairs. Cuyler looked at it, blinked in surprise, and showed it to Damien.</p><p>Ramsey looked around the house, feeling more trapped and helpless than he ever had before. More, even, than when he'd awakened in Cuyler's castlelike hideaway.</p><p>The thought made him close his eyes and wince inwardly. He'd give a limb to be there with her right now. He'd let so much time go to waste, time when he'd been alone with her in that magical place.</p><p>They could never go back there now.</p><p>Inspiration struck, and Ramsey tilted his head so they'd follow, and headed for the basement. The place was solid, lead-lined and secure. Ramsey didn't think they'd be heard down here. Still, he whispered what he had to say.</p><p>\"Damien, we need to exchange clothes.\"</p><p>Damien lifted one brow, then lowered it, his eyes narrowing in understanding.</p><p>\"Why?\"</p><p>\"There's no time to go into it,\" Ramsey lied. \"Look, there are sharpshooters out there. If you head for the roof, they'll pick you off so fast it'll make your head spin. I have a plan.\"</p><p>Damien nodded thoughtfully and lowered himself to the bottom step. \"Tell me about it.\"</p><p>\"I told you, there isn't time.\"</p><p>Cuyler looked from one to the other. \"I don't like this, Ramsey. Tell me the truth, what did that bastard say to you on the phone?\"</p><p>Ramsey looked away, chewing his lip. \"Nothing you need to be concerned about.\"</p><p>\"No,\" Damien agreed. \"He simply offered to let you and Cuyler go free, in exchange for my capture. That's it, isn't it?\"</p><p>Ramsey's head came up and his eyes flashed angrily. The jerk was going to ruin everything.</p><p>\"And you planned to put on my clothes, pretend to be me, and give Cuyler and me time to escape.\"</p><p>\"Ramsey, you can't!\"</p><p>Ramsey clasped her hands in his, squeezing to calm her, while glaring at Damien.</p><p>\"You had to spill it all? You couldn't just take her and go?\"</p><p>Damien gave his head an almost imperceptible shake. \"An unusual mortal,\" he said again, as if to himself.</p><p>\"I've had enough of both of you!\" Cuyler tugged her hands from Ramsey's and stalked through the basement, peering through the narrow windows, whose bottoms were level with the ground outside. One after another, pacing back to the first again as Damien and Ramsey continued their silent battle of wills.</p><p>\"Here!\" Her shout caught both men's attention. \"Okay, see that DPI car right there? It's the closest one to the house.\"</p><p>Damien glanced at Ramsey. Ramsey only shook his head.</p><p>\"I won't bother trying to explain to you two. You're too busy with your own tug-of-war to listen. Ramsey, get Fuller on the line again. Tell him you agree to his terms, but he has to pull all the police off the highways. The chopper has to land. Tell him you'll surrender Damien only to him and those two clowns he has with him. Everyone else has to leave. Especially those sharpshooters. I can see one from here, up in a tree. We won't stand a chance unless we get rid of them.\"</p><p>Ramsey frowned, rising, gripping her shoulders. \"Honey, I don't know what-\"</p><p>\"We'll need a distraction. Then we make a run for that car. We'll squeeze through this window, and...\" Her words came to a stop as she pulled free of Ramsey, clambered onto a wooden box, and pried the window from its opening.</p><p>Ramsey could only watch in wonder as she wrestled it free, and very quietly climbed down, setting it aside.</p><p>\"Look,\" she whispered, even more softly than before. She pointed to the shrubs growing between the house and the car. There would only be a few yards without cover.</p><p>She nudged Ramsey's shoulder. \"Go on, get up there and make that call.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They hovered at the open window as Ramsey conversed via the cordless phone with Fuller. No one was in sight outside now. Only two DPI cars and three agents.</p><p>They must want Damien very badly, Cuyler mused, to take such a chance.</p><p>Either that or they were playing a huge bluff. Maybe the others were only out of sight, waiting. Maybe Fuller and DPI had no intention of letting any of them go.</p><p>\"He's out cold, Fuller,\" Ramsey said into the phone. \"Apparently your tranquilizer works. Cuyler and I want transportation out of here. Now.\"</p> <p>Ramsey held the phone away from his ear, and Cuyler leaned in close to hear the reply. Damien didn't bother. Cuyler wondered if perhaps he didn't need to. She had no idea the extent of his powers.</p><p>\"You and Cuyler stay put. We're coming in. When we see for ourselves that he's incapacitated, we'll let you go.\"</p><p>Ramsey covered the mouthpiece with his hand. \"Lying through his teeth.\" Removing his hand, he said, \"All right, Fuller. But you better keep your word.\"</p><p>They waited, all of them pressed to the opening in the window. Cuyler knew Damien could leave if he wanted to. He had the ability. But he stayed, all the same.</p><p>When they heard the front door open, and Fuller calling Ramsey's name, Ramsey made a stirrup of his hands, and bent. Cuyler stepped up, pushing herself through the window. She emerged kneeling, concealed by the shrubbery, still close enough to hear Fuller's voice raised in alarm.</p> <p>\"Where the hell are you, Bachman?\" Then, \"Dammit, he's up to something. Search the place.\"</p><p>Damien was beside her a second later. Then Ramsey himself crawled through. She bit her lip as Damien reached back, offering a hand, which Ramsey took.</p><p>Sandwiched between the two men, she glanced toward the car.</p><p>\"We move as one,\" Ramsey said, his body shielding hers on one side. Damien nodded. Bending low, they ran toward the car. Just as they reached the end of the shrub cover, the front door of the house burst open and several shots rang out.</p><p>She felt Ramsey stiffen beside her, but he never faltered. One arm came around her and he moved faster, around the far side of the car. Ramsey opened the back door, bending over her body as she threw herself inside, facedown on the floor.</p><p>The window above her exploded and glass rained down into her hair. She tried to turn, tried to see Ramsey and Damien, but the bullets whizzed near her face, bringing back a flood of horrifying memories, until she could only lower her head again, covering it with her hands. She heard the door slam and felt the car jerk into motion. And then the bullets stopped ringing in her ears. She chanced lifting her head, only to see Damien on the back seat, sitting calmly amid the gunfire, his gaze so intense... and then glowing as he stared at something behind them.</p> <p>Curious, even while shaking all over, she sat up a bit, following his gaze. She saw the DPI men running toward their car. But before they reached it, it exploded in a ball of blinding white flame.</p><p>Shielding her eyes and gasping, she glanced at Damien. But he didn't notice, still too focused on what was behind them. He stared at the house now, even as the confused men turned to scramble toward it.</p><p>All three flew backward when it exploded. This time, the ground beneath the car rocked with the impact. She heard Ramsey swear, saw him twist in the driver's seat to look at the sight. Then she was looking, too. The entire house was nothing but a flaming framework, rapidly disintegrating to ash. Great beam-shaped lengths of fire fell in slow motion, disappearing into the mouth of the inferno waiting below to devour them.</p><p>She still felt the vibrations of the explosion, and the house was all but gone already.</p><p>My God.</p><p>They rounded a bend. The car weaved in and out of its lane and steadily lost speed. Cuyler frowned, clambering over the seat. \"Ramsey, what's wrong? What's-\"</p><p>She bit off the rest of her words, seeing the blood that soaked the front of him. His grip on the steering wheel was white-knuckled, his eyes steadily glazing over, his back bowing more and more as his right leg began a spastic dance. The car jerked with his foot's movements on the accelerator.</p><p>\"Ramsey!\" She swung her leg over his, jamming her foot down on the brake and jerking the gearshift into Neutral. She gripped the wheel, guided the car to the roadside, slammed it into Park, and grabbed Ramsey's shoulders, shaking him.</p> <p>\"Dammit, Ramsey, don't do this to me! Ramsey! Ramsey!\"</p><p>He focused on her eyes, and she could see it was a struggle. One side of his mouth pulled into that half smile of his, and he managed to wink. \"Maybe Damien oughta drive, hmm?\" Both his legs trembled now. Then they stopped, and his eyelids fell closed.</p><p>Cuyler buried her face in the crook of his neck, crying uncontrollably. \"It isn't over, Ramsey. Damn you, it isn't over. Not yet, not like this!\"</p><p>A firm hand on her shoulder drew her gaze upward to look into Damien's solemn eyes. \"No, Cuyler. It isn't over. Not yet.\" He got out of the car, opened the front door, hauled Ramsey out, then carefully placed him across the back seat.</p><p>Cuyler got back there, too, and lifted Ramsey's head as she slid in, so she could cradle it in her lap. Damien got behind the wheel. \"Hold on to him, Cuyler. I'll drive you somewhere safe. And the rest...\" He glanced over his shoulder at the man she held, his eyes narrow. \"The rest, I guess, will be up to Ramsey.\"</p><p>Ramsey woke to the most incredible, burning pain he'd ever felt in his life. But at least he woke. He supposed he ought to be grateful for small favors.</p><p>His chest was bandaged. His legs had gone numb. But there was warmth, softness. His head was pillowed on what felt like satin. Small hands were running over his face, through his hair. A musical voice, like the wind, begged him to wake up.</p><p>Salty tears rained down on his face. Trembling lips pressed to his over and over again.</p><p>He opened his eyes. Hazy, everything was so hazy. His body felt weak, drained. And there was this incredible urge to just close his eyes again and float away.</p><p>\"Ramsey?\"</p><p>God, but he didn't want to float away. Not if \"away\" meant away from Cuyler. \"Right here.\" That didn't sound like his voice. It sounded far away, echoing back to his ears from the other end of a hollow tunnel. Man, he was fading fast. He tried to look around, but could only make out several halos of golden light. Candles? And one bigger one, a fireplace, maybe. He felt the warmth, smelled the fragrance. Yes, a fireplace. And he thought he was on a bed, but he couldn't be sure. \"Where are we?\"</p><p>\"Damien's house...one of his houses, as he put it. We're safe here, Ramsey. Damien went to get rid of the car. When he comes back, I'm sending him for a doctor.\"</p><p>\"A doctor can't help, Cuyler.\" He knew it, somewhere deep in his soul. Just the same way he knew her devastation. She sensed him slipping away, just as he did. And she was dying a little bit, right along with him.</p><p>He struggled to sit up, and she helped him. \"I can't stand this, Ramsey. I can't stand losing you.\" She propped pillows at his back.</p><p>He caught her hands, brought them to his lips. \"I've been a fool.\"</p><p>\"You saved our lives, Ramsey. Even Damien knows what you did back there.\"</p><p>\"A fool,\" he whispered. God, it was getting harder and harder to speak, to string words together. He had to focus every ounce of strength on saying what he had to say. \"He's a decent man, Damien. I was wrong... about him. About...about everything.\"</p><p>\"It doesn't matter now-\"</p><p>\"Yes. Yes, it does. I'm not...\" He drew a painful breath, grated his teeth. \"I'm not what you think I am, Cuyler. The insulin... all this time...they tricked me.\" She sank onto the edge of the bed, running her hands through his hair. \"Don't try to talk. Just rest-\"</p><p>\"I don't deserve...to be...to live. But I'm not ready to die, either.\"</p><p>She choked on a sob. Shaking all over, she lowered her head to his chest, clung to him.</p><p>\"But I'll...make it up to you...to all of you.\"</p><p>She lifted her head and stared into his eyes. \"What do you mean?\"</p><p>\"I want to live, Cuyler.\" He wanted to stop. He was panting, out of breath as if he'd just run a marathon, but he had to continue. \"I want to be able...to love you...the way you deserve.\" The pain in his chest was unbearable. But the pain in his heart was worse. \"I want it. I want you to do it to me, Cuyler. Right now.\"</p><p>Her brows drew together as she searched his face, desperation etched in her every feature. \"Do... Ramsey, what are you saying? I can't transform you. The antigen-\"</p><p>\"I have it.\" He inhaled, but it was too shallow. His voice grew weaker with every word. \"I have...all along. The insulin...\" That was it. It was the end. He felt himself slipping steadily away from her. He tried to tighten his hold on her, but didn't have the strength. With supreme effort, he gasped, and in a harsh whisper, went on. \"I love you, Cuyler...\"</p><p>His eyes fell closed and the breath slowly escaped his lungs.</p><p>\"Ramsey! Ramsey, no...\"</p><p>But she knew the end was here. And she knew he'd been telling her something... something she didn't understand.</p><p>Go on, Cuyler. Damien's soft, deep voice floated across the boundaries of time and space. He's one of us. Always has been. It's all in the files. They've masked it with some new drug or other. Told him it was insulin and that he was diabetic. They've brainwashed him through most of his life, and still he found his way to you. Go on, bring him over. If ever a man was worthy of the gift, it's him.</p><p>Cuyler felt her eyes widen. She was shocked beyond belief, and half wondered if the voice in her mind might have been her own imagination. But if there was a chance...</p><p>She bent her head and kissed Ramsey's slack mouth. Then she bent lower, sliding her lips over his bristly jaw, to his throat. \"Come back to me, love,\" she whispered, her lips moving over his salty skin.</p><p>When Ramsey opened his eyes a long while later, there were a hundred new and unbelievable sensations coursing through him. Things he'd never felt before, didn't understand, a sense of elation and strength and vitality he'd never had before.</p><p>But all of that paled beside the joy he felt at finding Cuyler cradling him in her arms. He looked up at her, saw the uncertainty in her huge onyx eyes as they searched his face.</p><p>\"You did it, didn't you?\" he asked her, and even his voice seemed different. Or maybe it was his hearing that had taken on a new intensity.</p><p>She nodded. \"You said... I thought...\" She bit her lip. \"Don't hate me for it, Ramsey. It seemed to be what you wanted. If I misunderstood, then-\"</p><p>\"It's what I wanted.\"</p><p>\"But-\"</p><p>He lifted his head, silencing her by pressing his lips to hers. \"I love you, Cuyler Jade. You know that, don't you?\"</p><p>The worry fled her eyes and she smiled. \"Of course I do. I knew it before you did. And it's a good thing.\"</p><p>\"Why's that?\"</p><p>She kissed his forehead, then his mouth. \"Because, Ramsey, I love you, and I wouldn't settle for anything less in return. Especially since I have to put up with you for the rest of eternity.\"</p><p>\"Eternity with Tinkerbell,\" he said, grinning. He gathered her into his arms and held her close. \"I can't think of a sweeter fate.\" </p> </body></html>"]