["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER ONE</p><p>Madison Philips knew she was dreaming.</p><p>Not only was she suddenly eight years younger, but there was that weird sense of floating outside her body as she watched the last of the teenage girls drive away from the cramped trailer on the outskirts of Las Vegas.</p><p>It was a familiar dream.</p> <p>Too damned familiar.</p><p>Grimly, Madison tried to call on her well-honed skill at yanking herself out of the nightmare. She’d done it a hundred times over the years. But tonight, she found herself floundering. Instead of waking, she discovered herself sinking even deeper into the dream.</p><p>Until she was no longer watching the past unfold, but actually reliving the event.</p><p>Lost in the dream, it felt shockingly real as she tidied the shabby living room before heading to the back of the trailer.</p><p>It’d been a fun enough birthday party with her friends, she acknowledged, once again that young, shockingly innocent girl. In fact it’d been her best party ever, as long as she didn’t dwell on the two notable no-shows.</p> <p>It wasn’t as if she’d actually expected her mother to remember it was her only child’s eighteenth birthday. Hell, Connie Philips hadn’t been to the trailer in two weeks. Madison assumed she was still holed up in some sleazy hotel with her latest lover.</p><p>And of course, she’d been an idiot to think for a second that Luc Angeli, the Dark Angel, who was three years older than her and the focus of her avid teenage fantasies, would actually stop by.</p><p>It’d obviously been a figment of her imagination to think there’d been a spark of interest in his dark eyes when she’d gone to his house and practically begged him to stop by for...well, she’d said she wanted him to share a slice of birthday cake, but they both knew what she was truly offering.</p><p>Unlike most of her friends, she’d avoided becoming sexually involved with any of the boys she dated. A part of her refused to walk in her mother’s failed footsteps, sleeping with every man who would pay her attention.</p><p>But a larger part was longing to give her virginity to the man who’d filled her dreams for the past three years.</p><p>And she hadn’t kept her desire a secret.</p> <p>Luc was well aware that she wanted him to initiate her into her burgeoning sensuality.</p><p>Heaving a sigh, Maddy pushed open the door to her bedroom, flipping on the table light that bathed the small room in a muted glow. She preferred to keep most of the room in shadows, not wanting to dwell on the shabbiness of her surroundings.</p><p>In her mind this wasn’t her home. It was just a place she stayed until she moved on to bigger and better things.</p><p>But tonight, there was an unexpected bonus waiting for her.</p><p>The one and only birthday present she truly wanted.</p><p>Automatically closing the door behind her, Maddy leaned against it as her astonished gaze took in the sight of Luc Angeli stretched on her bed, his hands locked behind his head. He’d obviously used the back door to enter the trailer while she was watching her friends leave.</p><p>Her heart slammed against her ribs. God almighty. He looked too beautiful to be real.</p><p>His black hair was left just long enough to curl at his nape. His skin was darkly bronzed. His velvet eyes were as black as a midnight sky and framed by a tangle of impossibly long lashes. His features were so finely honed they might have been pretty if he weren’t so potently male. And his lean body was rock hard from his summers spent working construction.</p> <p>“Luc?” she breathed in shock, briefly wondering if she was hallucinating as he slowly rose to his feet, his muscles moving with liquid ease beneath his faded jeans and tight black T-shirt. “What are you doing here?”</p><p>His brooding gaze watched as she nervously pushed her heavy curtain of smooth black hair from her face that remained pale no matter how many hours she spent in the scorching Nevada sunlight.</p><p>“Waiting for you.”</p><p>“But—”</p><p>“You did invite me, didn’t you?” he interrupted, his gaze lingering on the lush curve of her lips.</p><p>Her mouth went dry. His presence seemed to consume the small room, filling it with the scent of sandalwood soap and clean male skin.</p><p>“Yes.” She was forced to clear the nervous lump from her throat. “But why didn’t you join the party?”</p><p>“You know why, Maddy.” His eyes lifted to meet her dazzled gaze. “I wanted to be alone with you.”</p><p>Excitement streaked through her, clenching her pussy with anticipation. “I didn’t think you would come.”</p><p>His lips twisted into a humorless smile. “Neither did I, but it seems I’m not as immune as I should be to your tempting...invitation.”</p><p>She ignored his hint of self-mockery, too exhilarated by the thought of fulfilling her fantasies to pay heed to the subtle warning.</p><p>“Good,” she murmured, tossing her long hair over her shoulder in an unconsciously provocative motion.</p><p>He sucked in a sharp breath. “You’re certain?”</p><p>Maddy leaned against the door, barely able to breathe. The man was making her shiver and he hadn’t even touched her yet. It had to be the heat in his gaze. It was like being branded by fire as he took a slow, thorough survey of her slender body barely covered by her short, black leather skirt and the corset top she’d borrowed from a friend.</p><p>“I’m sure.”</p><p>“Then prove it,” he rasped.</p><p>Maddy licked her dry lips. “How?”</p><p>“Take off your clothes.”</p><p>She blinked at the blunt command before a slow smile curved her lips. It was a challenge. Even as an innocent she understood he was testing the depth of her commitment to parting with her virginity.</p><p>The least hesitation and he’d walk out the door and never return.</p><p>“Like this?” she asked huskily.</p><p>She hooked her thumbs into the waistband of her leather skirt, pulling it down her hips and allowing it to pool at her feet. She used the toe of her three inch stilettos to kick it away, acutely aware that Luc had just realized she’d deliberately gone bare beneath the skirt.</p><p>No panties. No hose.</p><p>Just her and her fresh Brazilian wax.</p><p>Her courage nearly faltered as he drew in a deep, slow breath, his hands clenching at his side. Luc wasn’t just an overeager teenage boy hoping for a grope in the dark. He was a fully mature male with years of experience. Dark...fierce...demanding. And right now, his hunger was a tangible force in the air.</p><p>If she continued he would consume her.</p><p>Completely and utterly.</p><p>The thought should have terrified an inexperienced virgin.</p><p>Instead Maddy felt a thrill of volatile excitement.</p><p>She reached up to grasp the side of the corset top, pulling it tight to unhook it with an unconscious grace. It’d taken her years to gain control of her body that had shot up to five foot nine almost overnight. Now she stripped away the corset and tossed it aside with a smooth elegance that wrenched a low groan from the man watching her with the avid gaze of a predator.</p><p>“Keep them on,” Luc abruptly broke the silence as she lifted a foot to remove one of the stilettos. She shivered, replacing her foot on the ground. She felt oddly vulnerable wearing nothing but the leather shoes. As if sensing her unexpected flare of embarrassment, Luc held up his hand, gesturing her closer. “Come here, Maddy.”</p><p>She took an uncertain step forward. And then another. Finally, she stood just inches away.</p><p>He studied her with a brooding gaze, a visible bulge pressing against the fly of his faded denims. Reaching out, he took her hand, tugging her until she was pressed against his hard body. Her stomach clenched as he grabbed her by the nape of her neck, his breath brushing over her cheeks before he was capturing her lips in a kiss that made her heart slam against her ribs.</p><p>She’d been kissed before.</p><p>Awkward meeting of the lips that had left her cringing in distaste.</p><p>But this...</p><p>It was wondrous.</p><p>His fingers threaded through her hair, tugging on the silken strands as he lifted his head to study her flushed face.</p><p>“Do you have any idea what’s about to happen?” he demanded.</p><p>“I know I want you,” she whispered. “I’ve always wanted you.”</p><p>“There’s no going back.” The words were more a promise than a threat, wrapping around her with the pleasure of paradise.</p><p>She trembled. “Good.”</p><p>He slid his hand from her hair, lightly tracing the line of her throat before his fingers were cupping her bare breast. With a gasp she grasped his upper arms, her knees threatening to give way as he bent down to suck her nipple between his lips.</p><p>She moaned, pleasure cascading through her as his tongue teased the puckered tip.</p><p>Barely giving her time to become accustomed to the exquisite jolts of sensation, he turned his attention to her other breast, tormenting the tender nipple until it was hard and begging for the warmth of his mouth.</p><p>Her nails dug into his arms left bare by his tight T-shirt, her back arching as he continued to pleasure her with his teeth and tongue.</p><p>Only when she was moaning beneath his expert touch did he trace his fingers down the flat plane of her stomach, urging her to part her legs.</p><p>She clung to him as she obeyed his silent command, careful not to twist her ankle as the heels threatened to catch on the ragged carpet. Luc murmured his approval, his fingers sliding between her spread thighs. His touch was gentle as stroked through the damp flesh of her pussy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Maddy gave a choked cry of shock as he found her responsive clit, her entire body clenching with bliss. He used his thumb to continue to torment her pleasure point while one finger found the entrance to her body.</p><p>She instinctively gasped.</p><p>She’d never let anyone to touch her so intimately before. It was...stunningly perfect.</p><p>Or maybe it was just Luc Angeli who was stunningly perfect.</p><p>As if to prove her point, Luc returned his mouth to her breast, tugging at her nipple with an insistence that made her feel as if she were going up in flames. At the same time his finger pressed inside her, wrenching another moan from her lips.</p><p>She could feel him sliding through the tight tissue of her channel, his thumb lightly circling her clit. She clutched his arms, the sensations overwhelming as he allowed his lips to trail up to the pulse thundering at the base of his neck.</p><p>Moaning softly, she stirred against him. There was a glorious pressure beginning to build between her legs. A tension that was making her entire body clench in anticipation.</p><p>“Don’t fight it, Maddy,” Luc said. “Let me feel your climax.”</p><p>He stroked his finger in and out, pressing deeper as he prepared her for his ultimate invasion. She sank her teeth in her lower lip as his thumb continued its magical massage over her clit, and his lips slid up her throat. It was that or scream out her joy as an explosion of pleasure rocked through her, the intensity of her release making her shake all over.</p><p>“It’s okay, Maddy. I’ve got you.”</p><p>“Luc,” she breathed.</p><p>She leaned heavily against him, her knees threatening to buckle. He wrapped his arms tightly around her, pressing his lips to her forehead as she tried to recover from the shocking vibrations that continued to spread through her body.</p><p>His lips continued to soothe over her upturned face as he lifted her into his arms and headed for her narrow bed. A few steps and he was lowering her onto the mattress before straightening to yank off his clothing.</p><p>She watched with bemused eyes as his T-shirt was jerked over his head and his boots kicked off before he was shoving his jeans downward. She shivered, her pussy clenching as her gaze slid down his hard, chiseled body to linger on the proud thrust of his erection.</p><p>God, he was beautiful. All sculpted muscles and bronzed, ruthless male.</p><p>He paused to remove a condom from the front pocket of his jeans, ripping open the package and slipping it on with practiced ease.</p><p>Then, moving slowly, as if giving her one last opportunity to change her mind, he placed a knee on the mattress.</p><p>“I don’t have any experience with virgins, but I suspect this might hurt, Maddy,” he said, his voice tight with strain. “I’ll try to go slow, but I want you.” His lips twisted with a hint of self-derision as his gaze slowly took in her naked curves spread on the bed, lingering for a second on the heels that he insisted she keep on. “I don’t think anything could stop me from taking you tonight.”</p><p>“I’m ready,” she breathed.</p><p>Holding her wide gaze, Luc stretched onto the mattress beside her, giving her time to become accustomed to the scorching heat of his bare skin. His fingers ran up and down the front of her body. Traveling from her throat down to her quivering stomach, his light caress set off tiny sparks of excitement.</p><p>Shockingly, Maddy felt herself melting in anticipation, her legs readily parting as he rolled on top of her.</p><p>Still keeping their gazes locked, Luc settled between her thighs, the head of his cock forging a slow path into her body. He hesitated for a brief second, then with one steady surge he was seated deeply inside her. Her gasp echoed through the room.</p> <p>It wasn’t true pain, more a sense of being stretched to the max.</p><p>He gave a harsh groan, his hands framing her face as he studied her with a darkened gaze.</p><p>“Did I hurt you?” he demanded.</p><p>Maddy sensed his struggle to leash his hunger, knowing it was taking all his willpower not to pound into her.</p><p>His fierce desire was as thrilling as the obvious concern in his voice.</p><p>He wanted her. He really, truly wanted her.</p><p>“I’m fine,” she assured him, her hands running over the bunched muscles of his shoulders. “Don’t stop.”</p><p>He gave a choked laugh, his brow damp with perspiration. “It’s no longer a choice, Maddy. You have become a necessity.”</p><p>She trembled at the husky edge of need in his voice, her hands tentatively exploring the wide expanse of his chest. She’d never realized there could be so much pleasure in touching. The warm, satin skin. The ripple of muscles. The rapid beat of his heart that revealed his out of control emotions. Growing bolder, she explored downward, finding the washboard abs. She could spend the rest of the night stroking her hands over his sculpted form.</p><p>Luc, however, had other ideas.</p><p>With a muttered curse, he grasped her hands, pinning them over her head. Her eyes widened, her heart missing a beat at the savage need that smoldered in his eyes.</p><p>“Don’t move,” he growled, his voice barely recognizable. “I’m hanging on by a thread, sweetheart.”</p><p>Maddy savored the exquisite moment. This was what she’d craved. The feel of him buried deep inside her, the intoxicating knowledge she’d driven him to the edge of reason. It all combined to stir her excitement to a fever pitch.</p><p>With obvious care, Luc withdrew until just the tip remained inside her, then as her hips lifted to maintain the contact, he was surging forward.</p><p>She shuddered at the erotic slide of his cock inside her, his breath searing over her face as he pressed his forehead to hers.</p><p>“Luc...” she moaned, instinctively wrapping her legs around his hips. “It feels so good.”</p><p>“Shit, Maddy,” he groaned, sinking even deeper. “You’re killing me.”</p><p>Maddy wasn’t sure what he meant, but at the moment it didn’t matter. That delectable, addictive pleasure was beginning to build as he thrust into her with a ruthless rhythm.</p><p>“I don’t know what to do,” she rasped, needing to give him the same bliss that was jolting through her.</p><p>“Just let me please you,”</p><p>“You do,” she whimpered, her body bowing beneath him. Her heart felt as if it was going to beat out of her chest, her nails digging into his fingers that were wrapped around her wrists. “You’re the only one who could ever please me.”</p><p>“You shouldn’t tell a man that,” he muttered, burying his face in the curve of her neck as his hands lowered to cup her ass, angling her for even deeper penetration. “Especially not one with my ego.”</p><p>Her toes curled as shockwaves of pleasure rushed through her. “You know how I feel,” she recklessly groaned. “It’s always been you.”</p><p>A dark, possessive satisfaction blazed in his eyes. “You’re mine.”</p><p>She smiled. She was.</p><p>It might be politically incorrect. It might even be foolish.</p><p>But she understood she belonged to this man on a primitive level.</p><p>“Always,” she breathed, the word a solemn promise.</p><p>Luc groaned, his fingers digging into the soft flesh of her ass. “God, you feel perfect, Maddy. So tight around my cock...” He lowered his head to tongue the tip of her breast. “Come for me.”</p><p>“Luc.” She arched upward, her breath wrenched from her lungs as he reached between them to tease her swollen clit.</p><p>“Come for me, sweetheart,” he rasped. “I’m not going to last.”</p><p>She cried out as her orgasm swelled to a near painful peak, before it exploded through her with the force of a nuclear bomb.</p><p>Good lord.</p><p>“Yes,” he hissed, plunging swiftly in and out of her body.</p><p>His lips found hers as he grabbed her hips, giving one last thrust before he went rigid against her, his groan of completion rumbling from the depths of his chest.</p><p>Remaining lodged inside her, Luc spread tiny kisses over her face, his tenderness bringing tears of joy to her eyes.</p><p>She’d fantasized about this moment since she’d first caught sight of Luc walking down the halls of the local high school.</p><p>She’d been a lowly freshman and he’d been ‘Mr. Popular.’ Even worse, he was the son of Vigo Angeli, owner of two high-end casinos. It was rumored he was worth millions, while Maddy was the daughter of a barmaid who rarely remembered she had a child who shared her cheap trailer on the edge of town.</p><p>It’d seemed an impossible dream. But now...</p><p>“I love you, Luc,” she murmured, her heart overflowing with happiness.</p><p>Instantly he stiffened, his breath hissing between his clenched teeth, as if she’d struck him instead of confessing her love. Then, before she knew what was happening, he was pulling out of her and shoving himself off the bed, his expression hard as he reached to grab his jeans off the floor.</p><p>“Don’t make this into something it’s not, Maddy,” he warned, his voice painfully harsh.</p><p>Suddenly chilled to the bone, Maddy reached for the sheet, covering her naked body. “Luc, what’s wrong?”</p><p>“Everything.” He dressed with an efficient swiftness. “This should never have happened.”</p><p>Shivering with a sense of baffled betrayal, she watched as Luc moved toward the door. “You’re leaving?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He paused, turning to regard her with an expression that was impossible to read. “Do yourself a favor, Maddy. Save your love for some man who actually deserves it.”</p><p>The sound of her alarm thankfully jerked Madison out of the nightmare.</p><p>Shit.</p> <p>Throwing back the covers, she climbed out of bed and headed into the attached bathroom.</p><p>There was no mystery why she’d been plagued by that particular dream.</p><p>The day after her disastrous eighteenth birthday she’d left Vegas and traveled to New York to follow her dream of becoming a model. For once in her life, good luck had smiled on her, landing her a spot as the spokeswoman for a new brand of tequila. Her career had taken off with record speed, and thanks to the grinding poverty of her childhood, she’d had enough sense to demand a part of her salary be paid in company stocks. By the time she’d reached the age of twenty-four she’d made a small fortune, which she’d used to open her own modeling agency.</p><p>Now she was not only rich, but she owned a thriving business that gave her a power she’d never imagined possible when she was a young girl just trying to survive.</p><p>And for the first time in eight years she’d returned to Vegas.</p> <p>Yeah, everything was great. Except that her dreams of love had been ruined by the Dark Angel.</p><p>Taking a swift shower, Madison pulled on a casual pair of white shorts and a yellow, stretchy top. She gathered her dark, shoulder-length hair into a high ponytail, pausing long enough to grimace at her reflection.</p><p>Without makeup she looked younger than her twenty-six years, but it was the shadows beneath her wide hazel eyes and the paleness of her creamy skin that made her wrinkle her nose in disgust.</p><p>Soon, she silently promised herself.</p><p>Soon she would be done with the nightmares of her past.</p><p>And Luc Angeli would be nothing but a distant memory.</p> <p>Leaving the guest bedroom, Madison headed into the kitchen of the luxury condo just off the Strip.</p><p>The home belonged to her best friend during high school, Kristen Roth. The two had been inseparable despite the fact that Kristen had a very different background than Madison. And even after she’d left Vegas they’d remained in contact, meeting for a “girls’ weekend” at least twice a year in various exotic locations.</p><p>When she’d decided it was time to return to Vegas, Madison had known she couldn’t stay anywhere but the condo without hurting Kristen’s feelings.</p><p>An unfortunate necessity, she belatedly realized as she strolled into the kitchen to discover her friend already dressed in a gray power suit with her honey-blonde hair pulled into a smooth knot at her nape. Instantly, Kristen’s indigo blue gaze latched onto Madison’s pale face and the obvious signs of sleepless nights.</p><p>Kristen possessed a laser-sharp mind that had landed her a position at the top law firm in Nevada. Nothing could get past her perceptive gaze.</p><p>“What are you doing up at this hour?” she demanded, instantly moving to pour Madison a large mug of coffee.</p><p>Taking a seat at the breakfast bar, Madison readily reached for the coffee, smiling at the rich aroma. Kristen, of course, remembered that she took it strong and black. Her ruthless competence was sometimes frightening.</p><p>“After years of traveling I’ve discovered the only way to deal with jet lag is to force myself to adjust to the local time as soon as I arrive,” she said, the words not entirely a lie.</p> <p>She’d arrived in Vegas late last night from a trip to Paris to recruit new models, and while she’d set her alarm, she’d intended to laze in bed for at least a few hours as she adjusted to the abrupt change in time.</p><p>“Hmm.” Kristen studied her pale face. “Jet lag didn’t put dark circles under those eyes.”</p><p>Madison blew out a sigh. “I’ve looked in the mirror, thank you very much. I don’t need you to point out I look like a zombie.”</p><p>Kristen shook her head, her classic beauty shown to advantage surrounded by the white and silver condo, with its glass walls that revealed a stunning view of the city.</p><p>It was like her. Sleek. Modern. Efficient.</p><p>“Don’t be an idiot,” Kristen chided. “You always look spectacular. If you weren’t my best friend, I’d be morally obligated to hate you. But you’ve obviously had more than one sleepless night. Tell me what’s going on.”</p><p>Madison shrugged. She hadn’t revealed the truth of her return to Vegas to anyone. Not even her best friend.</p><p>“Bad dreams.”</p><p>Kristen arched a honey brow. “Does this bad dream happen to go by the name Luc Angeli?”</p><p>“Luc?” Madison blinked in genuine shock. How the hell had she guessed? “I don’t know who you’re talking about.”</p><p>Kristen waved aside her ridiculous pretense of ignorance. “Don’t be coy. No woman forgets her first.”</p><p>“Really?” Madison took a sip of her coffee, hoping the caffeine would snap her sluggish mind into gear. “So you spend your nights dreaming about Jack Roberts?”</p><p>“Oh hell no.” Kristen shuddered in horror. “But my first was a quickie in the boys’ locker room...with an emphasis on the quickie,” she said in wry tones. “Yours, on the other hand, was an epic event.”</p><p>Madison stiffened, wishing to god she’d never called Kristen after Luc had walked out on her. At the time she’d needed someone to sympathize with her brutal humiliation. Now she hated the knowledge that she’d shared her pathetic heartbreak over a man who wasn’t worth a single tear.</p><p>“Hardly epic.”</p><p>“Oh, come on, Maddy—”</p><p>“It’s Madison,” she firmly corrected.</p><p>Maddy was a needy child searching for love in all the wrong places. Madison was a successful woman who molded the world to suit her needs.</p><p>Or at least she did in all facets of her life...except one.</p><p>And that one she intended to sort out in the next couple of days.</p><p>“Fine. Madison,” Kristen obediently said. “You lusted after Luc for years. You had your walls plastered with pictures of him, you walked past his house a dozen times a day, and never missed a football game when he was playing. Hell, you had his name tattooed on your ass with a heart around it.”</p><p>Madison thinned her lips. The tattoo was going, along with the memories.</p><p>“And you had a poster of the Backstreet Boys pinned over your bed,” Madison countered, taking another gulp of her coffee, wincing as it scalded her tongue. “Big deal.”</p><p>Kristen refused to be diverted. “But the Backstreet Boys didn’t take my virginity on my eighteenth birthday and then walk away with the comment that I should find someone else to obsess over,” she pointed out. “And I didn’t leave Vegas swearing to return one day and make them pay for humiliating me.”</p><p>With a weary groan, Madison planted her elbow on the bar, her chin resting on her palm. “You always did have an overactive imagination.”</p><p>“I also have enough intelligence to know that this trip to Vegas isn’t just a whim.”</p><p>“Why not? It’s been years since I’ve been home.”</p><p>“Because there’s no reason to be here. Your mother died shortly after you left and you don’t have any other family,” Kristen said, as usual not bothering to tiptoe around the fact that Madison’s mother had taken off with one of her lovers who’d then crashed their car just outside Denver. “And if you wanted to see me, you know you only have to call and I’ll fly to join you wherever you are.”</p><p>“It’s still where I was born,” Madison stubbornly tried to hold her ground against the merciless interrogation. “Maybe I was feeling nostalgic.”</p><p>“Bullshit. You have a fabulous life in New York.”</p><p>“True.”</p><p>Kristen moved to place her hands flat on the bar, her expression warning she was ready to continue her cross-examination until Madison cracked.</p><p>“Tell me the truth,” she commanded. “Why are you in Vegas?”</p><p>Madison gave a resigned shake of her head. Hell, Kristen no doubt terrified poor juries into submission.</p><p>“To put the past behind me,” she grudgingly admitted.</p><p>“Luc?”</p><p>“Yes.” Madison made a sound of frustration. “I know it’s stupid, but I can’t get him out of my head.”</p><p>“Not really surprising. He’s always been drop-dead gorgeous,” Kristen admitted. “Of course, I’ve heard that he’s now supposedly reformed.”</p><p>“Reformed?”</p><p>“He stopped hopping from bed to bed.”</p><p>Madison made a sound of disbelief. “Yeah, right. And I’m about to sprout wings and fly to the moon.”</p><p>“Oh my god.” Kristen widened her eyes in shock at Madison’s bitter tone. “You’re still in love with him.”</p><p>“No,” Madison snapped. “I was never in love with the bastard. But he’s like a virus that’s infected my life. I’m here to purge him once and for all.”</p><p>The charity event being held at the upscale hotel was like any other charity event.</p><p>A mediocre dinner that cost the social elite five hundred dollars a plate. An auction where they were expected to overbid on ridiculous items that no one wanted. Followed by a dance where bored husbands flirted with the scantily-dressed barmaids, and equally bored wives exchanged vicious gossip. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Unfortunately, he couldn’t risk offending the hostess who’d arranged the event for a new science building at the local university, or endangered muskrats, or whatever happened to be the current flavor of the month. Not when her husband was an investor in Luc’s real estate company.</p><p>Much to everyone’s astonishment, including his own, Luc had walked away from his father’s casino empire five years ago. He was done trying to earn the old man’s respect, choosing instead to try and halt the steady decline of the city he loved.</p><p>Buying corporate buildings and new construction in foreclosure, he used his contacts spread throughout the world to flip the properties and bring in new businesses.</p> <p>In some ways he was still in the gambling business. Only this time it was with his money and the money of his investors.</p><p>And he’d been highly successful.</p><p>But he was in the delicate process of expanding his business, which meant rubbing elbows with the rich and powerful to keep his investors happy.</p><p>It also meant he couldn’t just leave when his current stalker followed him onto the balcony overlooking the gaudy, spectacular beauty of Vegas.</p><p>“Please, Luc,” the voluptuous redhead pleaded, her fake lashes framing her green eyes like stiff spikes, and her lips slick with red gloss. “Would you just listen to me?”</p> <p>Luc downed the last of his aged whiskey, wishing to hell he’d never given in to his rash impulse to ask out the persistent female.</p><p>His only excuse was that he’d been bored and searching for something he couldn’t seem to find.</p><p>Something he still couldn’t find.</p><p>“I told you not to follow me here, Sherri,” he growled, shaking off her clinging grip.</p><p>“What choice did I have?” she pouted. “You won’t accept my phone calls.”</p><p>“Because we have nothing to say.” He sent her a warning glare that not even she could fail to comprehend. “Walk away or I’ll tell your father about that vial of white power you keep in your purse.”</p> <p>Her expression abruptly hardened, the green eyes glittering like chips of emeralds. “Bastard.”</p><p>With a flounce, Sherri turned to head back into the crowded party, leaving behind the overwhelming stench of her expensive perfume.</p><p>Luc grimaced, wishing to god he’d made up an excuse to avoid the evening. Especially when yet another female appeared in the open doorway, her slender form outlined by the lights of the ballroom.</p><p>“The Dark Angel strikes again,” a low, delectably feminine voice purred. “Do you actually keep a tally of how many hearts you’ve broken over the years?”</p><p>“Hardly. I...” His annoyed denial died away as the woman stepped onto the balcony, the moonlight gliding over her tall, willowy body. His breath caught in his throat. Her feminine shape was shown to advantage in the long black Dior gown that split up the sides to reveal slender, impossibly long legs, and a tight bodice that hugged the curve of her breasts. Her glossy dark hair was left free to tumble over her bare shoulders, the silken strands emphasizing the creamy perfection of her skin. A shockingly intense arousal blasted through him, followed by an equally shocking recognition. “Christ. Maddy?”</p><p>A cool smile touched her lips. “It’s Madison.”</p><p>Luc’s boredom was seared away by a thrilling sense of pleasure as he studied the female who’d invaded his dreams a hundred times over the years.</p><p>“Madison,” he murmured, his gaze drinking in her astonishing beauty.</p> <p>She’d always been pretty. A fresh-faced innocent who’d tempted him more than he’d ever wanted to admit.</p><p>Until that night...</p><p>Luc hissed as he instantly became hard at the memory of sliding into the tight, exquisite heat of her body. Shit. Nothing had ever felt so good.</p><p>“Long time, no see,” she said, moving to lean her hip against the iron balustrade, her movements hypnotically graceful.</p><p>Luc smiled, a tingle of erotic anticipation racing through his body.</p><p>“That’s not entirely true. I’ve seen you everywhere over the years,” he admitted, belatedly realizing why he’d been so obsessed with following her rocketing launch into fame. He’d never gotten her out of his system. Madison Philips was not only the one who gotten away, but she was the only one worth keeping. “Magazines, billboards, even TV. The face of Tivago Tequila.” He lifted his empty glass in a toast of genuine appreciation. This woman had every excuse to fail, and instead she’d risen above her past to become an international star. “It was a great campaign. And very clever of you to take your payment in stocks rather than cash.”</p><p>“Modeling has a limited lifespan.” She shrugged aside his admiration, her pale features unreadable. Odd. Before she’d left Vegas her face had revealed her every emotion. He’d never forgotten the devotion that had glowed in her spectacular hazel eyes when she glanced in his direction. Or the sated pleasure on her face as she’d reached her climax in his arms. Now he had no idea what she was thinking. “It seemed prudent to have a nest egg for the future.”</p><p>“Especially when you’re capable of taking that nest egg and turning it into a rapidly expanding business.”</p><p>“I’m flattered.” Her smile didn’t reach her eyes. “I didn’t know you bothered to notice a woman unless she’s in your bed.”</p><p>Luc grimaced. Madison had crossed his path at a difficult time in his life.</p><p>When he was young he’d done his best to earn his father’s love. He’d been a top athlete. He’d made straight A’s. And following in his father’s footsteps, he’d bedded every willing female who’d crossed his path.</p><p>He’d just accepted the painful truth that there was nothing in the world he could do to ever win his father’s approval, let alone his love, when Madison had invited him to her party.</p><p>He’d been determined to say no.</p><p>She was an innocent and he was...truly screwed up.</p><p>She deserved better.</p><p>But none of his good intentions had the power to overcome his fierce need to taste her forbidden desire.</p><p>“I suppose I deserve that,” he grimly admitted. “I’ve always regretted...”</p><p>She arched a brow. “What?”</p><p>“Hurting you.” He set his empty glass on a low table, moving so he was close enough to catch the delicate scent of vanilla that clung to her skin. His erection pressed painfully against his zipper, making him glad the black tuxedo jacket covered his arousal. Considering their current conversation, he didn’t think she would appreciate the knowledge that he was already plotting how quickly he could get her into his bed. “I know it’s hard to believe, but that was never my intention.”</p><p>“Is that an apology?”</p><p>His gaze slid over her stunningly beautiful face, lingering on the lush fullness of her mouth.</p><p>His breath tangled in his throat. Christ, how many times had he imagined those lips wrapped around the tip of his cock?</p><p>Too many to count.</p><p>“I apologize for not being the man you needed me to be when I took your virginity, but truthfully, I can’t be sorry that I made love to you,” he admitted, his voice thick. “It’s a night that’s branded into my memory.”</p><p>An indefinable emotion flared through the hazel eyes before she was lowering her thick lashes that were thankfully natural. In fact, he realized with stab of male satisfaction, everything about this woman was natural, from the rich color of her hair to the perfect swell of her small breasts.</p><p>“There are no doubt a lot of nights branded in your memory,” she said in dry tones.</p><p>“There are some more special than others.”</p><p>“Nice line. Did you make it up yourself or do you have someone on your staff that makes up cheesy lines?”</p><p>Luc hesitated, his lips twisting into a rueful smile as he was forced to accept that this female was no longer the giddy schoolgirl who’d worshipped the ground he walked on.</p><p>It was going to take more than casual charm to earn his way back into her bed. The knowledge only intensified his glorious sense of anticipation.</p><p>There was nothing he loved more than a challenge.</p><p>He took a step closer, barely resisting the urge to stroke his fingers through the satin-smooth strands of her hair. “What are you doing in Las Vegas?” he asked.</p><p>A smile touched her lips. “Tying up some loose ends.”</p><p>Hmm. He sensed there was a mystery behind her words. “Alone?”</p><p>She lifted her lashes, her hazel eyes running a blatant survey down the length of his body. “Are you asking me if I have a significant other with me?”</p><p>A raw surge of need coiled his muscles as her eyes traveled back to meet his smoldering gaze. “That’s exactly what I’m asking,” he admitted without hesitation.</p><p>“What about the lovely Sherri?”</p><p>Her words were mocking, but Luc didn’t miss the edge in her voice. Was she jealous? Hell, he hoped so. God knew he’d pummel any man at the party who tried to put his hands on this woman.</p><p>For tonight she belonged to him.</p><p>“I asked her out over a month ago,” he explained. “Five minutes into our date I knew I’d made a serious error in judgment, but with my only options to stick it out or humiliate her by simply walking away, I chose to be a gentleman.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“But you’re so good at walking away.”</p><p>The insult was delivered with a saccharin-sweet smile, making Luc grimace. She obviously wanted her pound of flesh.</p><p>“What can I do to convince you I’ve changed?”</p> <p>“Why would you want to go to the effort?” She waved a slender hand toward the French doors. Inside, a glittering array of beautiful women were gliding through the ballroom. “There are plenty of fish in the sea.”</p><p>Luc never allowed his gaze to stray from her exquisite face. “Because you’re the catch that I was stupid enough to let get away.”</p><p>He thought he heard her breath catch at his low words, but her aloof expression was impossible to read.</p><p>“Get away?” she demanded. “As I remember it, you were the one running, not me.”</p><p>Okay. He had let her vent her grievances. Now it was time to assure her that he wasn’t a total jerk.</p> <p>Well...at least not anymore.</p><p>“Believe it or not, I was trying to protect you.”</p><p>She rolled her eyes. “Really?”</p><p>“I was in a bad place,” he said with simple honesty. “You deserved better.”</p><p>“How could the son of a millionaire, the star football player and darling of every female in the state of Nevada possibly be in a bad place?”</p><p>The muscles of his jaw clenched, a familiar anger twisting his gut. He was sick to fucking death of people assuming that his father’s money somehow made his life a fairytale. Okay, he’d had it better than a lot of people, but living with Vigo Angeli was no picnic.</p> <p>He narrowed his gaze, studying her pale, perfect face. “Are you really interested?”</p><p>“Of course.”</p><p>She didn’t sound particularly sincere, but he answered her anyway.</p><p>“I’d just come to the conclusion that after years of trying to emulate my father, I’d become a man who I didn’t particularly like, and respected even less.” He reached up to smooth her hair behind her ear, unable to resist the temptation to touch her. “I was determined to change, which meant I wasn’t going to take advantage of an innocent teenager who’d convinced herself she was in love with me.”</p><p>Madison stiffened as his fingers traced the shell of her ear, but she made no move to pull away.</p><p>“Then why did you come to the trailer?”</p><p>“Because I couldn’t get you out of my mind.” His fingers drifted to trace the perfect arch of her dark brows. “Those big hazel eyes pleading for my touch.” He caressed the cool silk of her cheek. “That slender body with its lethal curves. Your shy smile. And those lips...” He used the tip of his index finger to outline the mouth that had given him so many sleepless nights. “Hell, there’s not a man who could have resisted.”</p><p>“Ah. So it was my fault,” she said in dangerous tones, although she couldn’t disguise the flare of response that darkened her hazel eyes.</p> <p>She was rapidly becoming as aroused as he was.</p><p>“The temptation was yours. The weakness was mine,” he murmured, his seeking fingers moving to follow the delicate curve of her neck. His cock twitched in appreciation. Her skin felt like molten silk. He needed her spread across his bed so he could explore every inch of that creamy perfection. “A weakness it seems I haven’t outgrown.”</p><p>Cupping the back of her head, Luc leashed his greedy urge to crush her lips in a demanding kiss. Instead he lightly brushed his mouth over hers in a gentle caress.</p><p>Last time he took.</p><p>This time he fully intended to give.</p><p>Her hands slowly lifted to land against his chest, her breath quickening as she pulled back to study him with a guarded gaze.</p><p>“Wait,” she breathed.</p><p>Wait? He might not have realized it until she’d stepped on the balcony, but he’d been waiting for this reunion since he’d discovered she’d fled Vegas.</p><p>“Why?”</p><p>“You were explaining why you were such an ass,” she reminded him.</p><p>He swallowed a rueful sigh. Why was she dwelling on the past when the future promised to be filled with sensual pleasure?</p><p>“You looked at me as if you were picturing your Prince Charming,” he reluctantly conceded. “I panicked.”</p><p>Her body remained pliant, but he sensed a tangle of emotion behind her smooth expression.</p><p>“You didn’t want to be Prince Charming?”</p><p>His lips twisted, remembering his fierce pleasure as he’d taken her virginity. Hardly the behavior of a Prince Charming.</p><p>“I was more the big bad wolf type.”</p><p>“And now?”</p><p>He tugged her against his chest, his head dipping down to trace the line of her throat with his lips.</p><p>“Now I can be whatever you need me to be.”</p><p>Her hands clutched at his shoulders as he found the sensitive spot at the base of her neck, but she refused to melt against him as he wanted. Dammit. He needed to feel her pressed tight against his aching erection.</p><p>“Actually I’ve discovered I’m no longer a Cinderella wannabe,” she informed him. “I don’t need a man.”</p><p>He nuzzled downward, discovering the prominent thrust of her collarbone. Too prominent, he abruptly decided. Her slender body was beautiful, but she felt too fragile. Clearly she wasn’t taking adequate care of herself.</p><p>Something he intended to change.</p><p>“That would be a shame,” he murmured.</p><p>She made a choked sound, shivering as he reached the top curve of her breasts. “A typical male response.”</p><p>His hand tangled in her hair, desire blasting through him as he felt her nipples harden through the silk of her gown. A part of him desperately wanted to strip off her dress and take her against the French doors.</p><p>Another part wanted to take her back to his home and spend the next month making slow, delicious love to the woman who’d done what no other woman had done.</p><p>Remained in his thoughts long after he’d left her bed.</p><p>“Doesn’t your glamorous lifestyle ever get lonely?” he asked, his arms sliding around her waist to press her tight against his aching body.</p><p>“Does yours?” she easily deflected his question.</p><p>“Yes,” he readily admitted. “Sometimes it’s unbearable.”</p><p>He felt her tiny jerk, as if she was startled by his answer.</p><p>“So find a Sherri to share your bed.”</p><p>“I don’t want Sherri.” He lifted his head to meet her wary gaze. “I want you.”</p><p>CHAPTER TWO</p><p>I want you...</p><p>They were precisely the words that Madison had been waiting to hear. Weren’t they?</p><p>It was why she’d returned to Vegas. Why she was at this ridiculous party.</p><p>Why she was on this balcony with Luc’s arms wrapped around her.</p><p>But now, for the first time since tracking down Luc Angeli, she found herself wavering.</p><p>It didn’t make sense.</p><p>Was it because Luc was forcing her to consider the possibility he might not be the complete asshole she’d always believed? Or because she was reacting to him with the same giddy, heart-racing excitement as when she was an overly-hormonal teenager?</p><p>Whatever the explanation, she found herself debating the very sensible option of turning on her heel and walking away.</p><p>Briefly she hesitated, balanced between flight and fight. Then the memory of how this man had plagued her over the past eight years at last hardened her resolve.</p><p>This ended tonight.</p><p>A teasing smile curved her lips as she slowly untangled herself from his arms.</p><p>He’d claimed he was lonely, but what did he know about it?</p><p>He’d probably had hundreds of lovers since she’d left Vegas, while she...</p><p>Her spine stiffened, her expression deliberately provocative. She couldn’t make it too easy. Even a man with Luc’s massive ego would be suspicious if she didn’t make him work to earn her forgiveness.</p><p>“You think I’m going to fall back into bed with you?”</p><p>His dark eyes smoldered with a growing frustration. Unlike her, he felt no need to disguise his consuming desire.</p><p>“I think the fire that burned between us eight years ago is still there, just waiting for an opportunity to reignite,” he growled, his gaze lowering to where her nipples pressed against the silky fabric of her dress. “Don’t deny that you feel it, too.”</p><p>She did, of course.</p><p>She might have spent the past years fiercely regretting giving her virginity to this man, but the second she’d stepped onto the balcony she’d been blasted with an unwelcomed awareness.</p><p>A knowledge that was rubbing against her already raw nerves.</p><p>She’d expected to find Luc attractive.</p><p>He’d always been indecently handsome, with the charm of the devil. And the years had only emphasized his potent attractions.</p><p>His narrow, bronzed face was leaner and his features even more finely sculpted. The dark eyes were filled with a newfound confidence. And his body more sleekly muscled beneath his Armani tux.</p><p>He was all male temptation. The sort of man who would make any woman melt.</p><p>But the unexpected realization that he had the power to arouse her with a mere glance was annoying as hell.</p><p>Dammit. This time she was the one in charge of the seduction, not Luc Angeli. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She tilted her head to the side, deliberately allowing her hair to slide over her bare shoulder.</p><p>Madison hadn’t spent years in front of a camera without learning a few tricks. “I see your arrogance hasn’t changed.”</p><p>Luc sucked in a slow, deep breath, the dark eyes predictably lowering to the gentle swell of her breasts before returning to meet her faintly mocking gaze.</p> <p>“Perhaps not, but I have,” he said, his voice low with sensual invitation. “I promise this time will be different.”</p><p>“Changed how?” She deliberately glanced down at his bare fingers. “You clearly still avoid commitment like the plague. Unless there’s a little woman at home you haven’t mentioned?”</p><p>He arched a brow, nodding toward fingers that were bare of rings. “Isn’t there a saying about people who live in glass houses?”</p><p>She shrugged. “I intend to marry and start a family once my business has gained a firm footing.”</p><p>“So do I.”</p> <p>Madison blinked, caught off guard by his swift retort. The thought of him married with a pack of children was...</p><p>Agonizing.</p><p>“You?” She tried to laugh off the unexpected pain.</p><p>“Why not me?” he murmured, reaching up to brush her hair back over her shoulder, his touch heart-stoppingly gentle. “Of course, first I need to find my Cinderella.”</p><p>For a crazed minute, Madison allowed herself to become lost in the dark promise of his eyes. How many years had she spent fantasizing that she could be the woman to earn this man’s love? That she alone could mold him from a ruthless playboy to a man dedicated to one woman.</p><p>Even after he’d walked out of the trailer, leaving her completely humiliated, she’d harbored a secret hope he would change his mind and return.</p> <p>She gave a sharp shake of her head.</p><p>Christ. She was an idiot.</p><p>This was no fairytale. She was here for a purpose and clearly the sooner she got it finished, the better.</p><p>Before she did something truly stupid.</p><p>She forced her lips into an inviting smile, grimly assuring herself that the streaks of lightning searing through her body as his fingers skimmed down the line of her body were nothing more than lust.</p><p>Something she could use to her advantage.</p><p>“Cinderella? Really?”</p><p>“You don’t believe me?”</p> <p>She reached up to brush a piece of lint from the lapel of his jacket, allowing her fingers to linger against the strong width of his chest.</p><p>“I was actually thinking that it would be a sin against nature to tame the Dark Angel with minivans and dirty diapers.”</p><p>His eyes narrowed at her abrupt shift from bitter ex-lover to femme fatale.</p><p>“You were just complaining that I—”</p><p>Madison pressed a hasty finger to his lips. Crap. It’d all seemed so easy when she was plotting her strategy in the comfort of her New York apartment.</p><p>“Like any young girl I dreamed of taming the bad boy, and I was hurt when you walked away,” she said, not having to fake the edge to her voice.</p><p>He studied her with a puzzled gaze. “And now?”</p><p>Her hand pressed over his heart, feeling the steady beat increase as she stepped close enough to whisper directly in his ear.</p><p>“For tonight, I just want you to be bad.”</p><p>His breath hissed between his clenched teeth, his hands gripping her slender waist. “You’re sure?”</p><p>“You were right.” She nipped the lobe of his ear. “There’s always been an attraction between us, and I’m no longer that girl looking for Prince Charming. Why shouldn’t we have some fun?”</p><p>She felt him stiffen at her teasing words. Had she managed to wound him? No, that would be ridiculous.</p><p>As if to prove his point, Luc nuzzled his lips along her jaw. “I’ll have my car—”</p><p>“No need,” she interrupted. “I have a room.”</p><p>Luc pulled back, his surprise deepening. “You’re staying at the hotel?”</p><p>“Yes.” She’d checked as soon as she’d been sure that Luc was attending the party. There was no way she was completing the last act of her revenge in Kristen’s house. “Shall we?”</p><p>The dark gaze ran a slow, heated path down the length of her body before a smile of anticipation curled his lips.</p><p>“Lead the way.”</p><p>Luc stepped into the luxurious suite, barely paying attention to the muted ivory and tan furnishings and spectacular view from the wall of windows. He was utterly consumed with the driving need to get this woman into the closest bed.</p><p>Okay, that wasn’t entirely true.</p><p>There was a very small part of his mind that was brooding on Madison’s abrupt capitulation.</p><p>His less than admirable past meant that he was a man who understood every nuance of the fairer sex.</p><p>He knew when a glance was more than a glance. When a female was susceptible to his touch. When to advance and when to retreat.</p><p>It was a familiar dance that he’d recognized the moment Madison had stepped onto the balcony.</p><p>He understood her need to punish him for his past sins. It only added a spice to their flirtation. And he fully intended to earn her forgiveness. Even if it meant following her back to New York.</p><p>He’d walked away from her once.</p><p>It wasn’t going to happen again.</p><p>But just when he was about to suggest they return to the charity event so he could at least hold her in his arms and sweep her around the dance floor, she’d given him a smile that didn’t quite reach her stunning hazel eyes, and practically dragged him to her conveniently located hotel suite.</p><p>He wasn’t complaining, he acknowledged, his gaze glued to the tempting sway of her ass as she led him directly to the bedroom.</p><p>His entire body was vibrating with an anticipation he hadn’t felt for years.</p><p>Not since the last time he’d been headed toward Madison Philips’ bed.</p><p>Still, there was a tiny voice in the back of his mind whispering that there was more going on here than just a chance encounter.</p><p>Entering the bedroom, Madison pressed a switch on the wall, flooding the room with a low, golden glow.</p><p>Luc was abruptly reminded of that night eight years ago.</p><p>Oh, not their surroundings. Hell, it still made him furious to think of the wreck of a trailer where Madison’s worthless mother had dumped her. Now her beauty was suitably emphasized by the elegant ivory and black room that was dominated by a king-sized bed set in the middle of the floor.</p><p>But there was the same fragile tension humming around her that reminded him of their first night together as she turned and tossed her purse onto a small, glass table.</p><p>He reached up to tug off his bowtie, shrugging out of his jacket as he studied her with a searching gaze.</p><p>“You’re sure this is what you want, Madison?”</p><p>With a practiced smile she lifted her hand toward the zipper hidden on the side of her gown.</p><p>“Why wouldn’t I be sure?” she demanded, slowly tugging down the zipper.</p><p>He kicked off his Italian leather shoes, easily dealing with his cuff links so he could remove his silk shirt. Then he forgot how to breathe as the black silk gown slithered down the length of her body to pool at her feet.</p><p>God almighty.</p><p>She was...magnificent.</p><p>He forgot how to breathe as his gaze slid down the slender curves, revealing she wore nothing beneath the gown.</p><p>It was a repeat of their first night together.</p><p>Her creamy skin shimmering in the low glow of the lamp. The tightly trimmed curls just above her pussy. And the spike heels that made her legs appear as if they were designed to wrap around a man’s waist.</p><p>But there was a new maturity in the sleek muscles and the proud set of her shoulders.</p><p>She’d been a pretty when she was young. Now she was drop-dead, gut-wrenching gorgeous.</p><p>Compelled by an invisible force, he moved forward, the nagging suspicion there was something odd about Madison’s behavior increasingly difficult to remember. Halting directly in front of her, he studied her with a fascinated gaze.</p><p>“I left you with regrets last time.” He slowly leaned forward, allowing his lips to softly touch the base of her throat. The kiss was feather-light, more of a promise than an actual caress. As much as he wanted this woman, he wasn’t going to press for more until she’d given him the signal she was ready and willing. “This time I intend to make sure you’re utterly...” His lips skimmed to the hollow just below her ear. She gave a soft moan that sounded as if it’d been wrenched from her throat against her will. “Completely...” He nibbled kisses along the line of her jaw before using the tip of his tongue to trace the lush curve of her lower lip. “And so thoroughly satisfied, that it will wipe away all memory of our first time together.”</p><p>Her lips parted on a tiny gasp, a flush of desire staining her prominent cheekbones, but frustratingly she hid her expressive eyes beneath the thick tangle of her lowered lashes.</p><p>“That’s the plan,” she murmured.</p><p>He frowned at her strange response.</p><p>“Look at me, Madison,” he said, his voice an unmistakable command. Slowly her lashes lifted to reveal the hazel beauty of her eyes. His fingers threaded through the silken strands of her hair, holding her a willing captive as he studied her guarded face. “I might have walked away that night, but I never forgot you.” His thumb brushed her heated cheek. “Your skin was as silky smooth as satin, your hair looked like finest sable spread across the pillow, and your lips...Christ, they could bring a man to his knees.” His cock twitched, begging to be taken between those sweet lips. “Literally.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There’s no need to pretend,” she said with a shrug. “It’s time to put the past behind us.”</p><p>He studied her pale face, wishing he could read the emotions that churned just below the composed surface.</p><p>He didn’t doubt her desire. Her slender body was shivering with the same excitement that pulsed through him, her nipples already hard and begging for attention. And he didn’t doubt for a minute that he could arouse her to the point she would forget everything but their mutual passion.</p> <p>But he didn’t like the suspicion she was holding a part of herself separate from him.</p><p>He grimaced. Did she think he intended to do another hit and run?</p><p>Damn. Maybe it was time for a full confession.</p><p>“I’m all for concentrating on the here and now.” He allowed his gaze to run an appreciative glance down the perfect lines of her body, taking pleasure in the sight of her black, fuck-me-now stilettos. “But there’s something you should know—”</p><p>“No,” she sharply interrupted. “There’s been enough talking.”</p> <p>Luc’s body agreed as she turned to cross the ivory carpet, crawling onto the bed with a sensuous grace. He was briefly distracted by the faintly darker patch of skin on her lower back. It almost looked like...makeup? Odd. Unless she had a birthmark she was covering up.</p><p>Then his curiosity was forgotten as she laid back, her hair flowing across the ivory pillows.</p><p>Shit. He reached down to undo his pants, releasing his erection that was painfully sensitive. With concise movements he had them shoved down his legs along with his silk underwear. He kicked them off, ridding himself of his socks as he prowled toward the bed.</p><p>Madison watched his approach from beneath lowered lids, provocatively licking her lips as he perched on the mattress next to her.</p><p>“What are you waiting for?” she asked in husky tones.</p><p>“I’m trying to remember,” he muttered wryly.</p> <p>She reached to run a finger down his arm. “Stop thinking,” she urged. “God knows that I have.”</p><p>It was the hint of self-derision in her tone that forced him to think past the lust thundering through his body. He wanted to claim more than just her body.</p><p>A knowledge that should have been terrifying.</p><p>Instead it just felt...right.</p><p>“Not until I’ve confessed the truth.”</p><p>Her eyes narrowed at his soft demand. “What truth?”</p><p>“I came back,” he said with blunt simplicity.</p><p>She stiffened, something that might have been denial rippling over her face. “I don’t know what you’re talking about.”</p> <p>“The next morning,” he said, deeply regretting when her fingers fell away. He loved the feel of her light caress. “I returned to the trailer.”</p><p>She shook her head. “You don’t have to lie.”</p><p>“It’s no lie.” He leaned down to steal a slow, searching kiss, tasting expensive champagne and pure female desire. It was intoxicating. “I knew when I was fleeing from your bed that I was acting like a coward. Unfortunately I didn’t have the backbone to return and face you like a man. Instead I went back to my apartment and drank myself into oblivion.” Their lips brushed as he spoke, sending white-hot darts of pleasure straight to his aching cock. “It wasn’t until I woke hours later with a pounding head and a nasty taste of shame in my mouth that I knew I had to go back.” Another long, lingering kiss. Who knew kissing could be so addictive? “When I couldn’t find you, I assumed you must be with your mother. It wasn’t until nearly a week later that I finally accepted that you’d left town.”</p><p>“It doesn’t matter,” she muttered, sounding as if she was speaking more to herself than him. But she readily tilted back her head as his mouth moved to plant a line of kisses down her throat. “Nothing matters but tonight.”</p><p>“It will be different, Madison,” he promised, his tongue pressed against the pulse racing at the base of her throat.</p><p>She shivered, her breath coming in tiny pants. “Please...no more talking about the past.”</p><p>“I want you to trust me.”</p><p>CHAPTER THREE</p><p>Madison struggled to think. Hell, she struggled to breathe as the erotic sensations thundered through her.</p><p>Why was he doing this?</p><p>She didn’t want to know that Luc Angeli had gone back to the trailer. Or that he might actually have felt guilt for having broken her heart.</p><p>Tonight was all about revenge. A revenge she’d dreamed about for eight long years.</p><p>Of course, her dreams had never matched this moment.</p><p>She’d forgotten that a mere brush of his fingers could send lust jolting through her. And that his kiss would make her feel as if she were melting.</p><p>She’d been a starry-eyed innocent the first time she’d shared her body with Luc, so overwhelmed with giddy excitement she’d barely been able to appreciate being seduced by a master. Now she was all woman, and while the giddy excitement remained, it was edged with a sharp-edged hunger that was demanding satisfaction.</p><p>A realization that was both annoying and inevitable.</p><p>Tonight was not going at all like she planned, but grimly ignoring the whispers of warning in the back of her mind, Madison placed her hands on his chest, exploring the satin heat of his skin.</p><p>“This isn’t about trust,” she told him, relieved when his eyes darkened at her soft caress. “This is all about need.”</p><p>There was a brief hesitation before Luc gave a low growl, allowing himself to unleash the hunger that she could see smoldering in his dark eyes.</p><p>“Yes.”</p><p>He turned on the edge of the mattress, leaning toward her reclined body.</p><p>Madison’s breath tangled in her throat as his bronzed skin glowed in the muted light.</p><p>He was stunning. Broad shoulders. A toned chest that was lightly dusted with black hair. Washboard abs, a narrow waist and a thick erection that made her pussy clench in anticipation.</p><p>God almighty.</p><p>It’d been so long since she’d felt this near-painful excitement. Eight long years. She’d forgotten just how overwhelming it could be.</p><p>“No man should be so beautiful,” she whispered, openly staring.</p><p>“I’m not beautiful. But you...” He sucked in a slow, deep breath, his eyes darkening until they looked black in the shadowed light. “I need you.”</p><p>She licked her lips. Christ. Was she really going to do this?</p><p>Was she going to have revenge sex with a man in the hopes it could purge him from her system?</p><p>The answer came without hesitation.</p><p>YES.</p><p>And she was going to savor every second of it.</p><p>Easily sensing the last of her hesitation being seared away beneath the heat of his hungry gaze, Luc was swooping down to claim her lips in a shattering kiss that demanded utter surrender.</p><p>He rolled on top of her, pressing her into the mattress. She groaned in pleasure. The heat of his skin scorched her with a dizzying pleasure, the drift of his fingers down her arms leaving trails of fire behind. Everywhere he touched was tingling with an excruciating arousal, the faint tang of his male cologne teasing at her senses.</p><p>“You feel perfect in my arms, Madison.” He cupped one breast in his hand, gently taking her nipple into his mouth.</p><p>Madison hissed out a shaky breath at the feel of his tongue lashing the tip of her sensitive nipple, the sensation arrowing straight to her pussy. How could he enthrall her with such ease?</p><p>And why the hell couldn’t she feel this with any other man?</p><p>Was it because she’d fantasized about Luc from the second she’d become aware of her own sexuality?</p><p>Or was it the simple fact that he was the most gorgeous man she’d ever laid eyes on?</p><p>Lifting her hands, she slid them over his hot skin, stroking them down his back. Smug satisfaction spiraled through her at his low moan of pleasure. It was proof that he wanted her with the same intensity as she wanted him.</p><p>As if the thick erection pressed against her inner thigh wasn’t proof enough.</p><p>“You’re good at this,” she muttered.</p><p>He lifted his head to smile down at her.</p><p>“We’re good together.”</p><p>“Yes.” Emotions long forgotten seared through her at the familiar bad boy smile and the heat in his eyes. The intensity of them was unnerving. As if she’d harbored a portion of her childish crush beneath the years of seething anger. All at once her instinctive fear threatened to yank her out of her sensual daze.</p><p>No.</p><p>It couldn’t be possible.</p><p>Could it?</p><p>“Luc—”</p><p>“You were right, Madison, there’s no more need for words.” He kissed her, using his tongue to deepen his possession. Madison shuddered, her body arching beneath the greedy demand of his hands that stroked over her naked body. “Just feel.”</p><p>Excitement raced through her like wildfire, the sheer force of his demands overriding her annoying inner voice.</p><p>Feel...</p><p>She closed her eyes, concentrating on the sensation of his thumbs teasing at her tightened nipples, and the hair-roughened thigh that slid between her legs to press against her sensitive clitoris. With every caress he spoke of his need for her. His blatant hunger was the finest aphrodisiac, making her wet and ready. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Madison plunged her fingers into his hair, refusing to allow anything to destroy this perfect, wondrous night.</p><p>“That’s it, Madison,” he whispered, his lips moving down the curve of her throat. His hand caressed the soft weight of her breast. “Let yourself go.”</p><p>“You make my head spin,” she husked.</p><p>“I intend to do more than make your head spin.” Nibbling a path over her collarbone, he slid down to suck a nipple between his teeth. He gently bit, making her gasp as the pleasure/pain jolted through her body. He pressed a soft kiss to the tingling nipple, then slid his mouth downward. “I’ve never wanted a woman as badly as I want you.”</p><p>Her heart gave a sharp leap of renegade pleasure at his muttered words before she sternly chastised herself for stupidity. Luc would say anything in bed. It meant nothing.</p><p>Instead she focused on the savage pleasure of his touch.</p><p>She lifted her hips in a silent invitation. “What are you waiting for?”</p><p>“Your body to tell me it’s ready,” he informed her, kissing a path down the center of her stomach. “Pleasure is all about patience.”</p><p>Madison rubbed against the hard muscle of his thigh. “Trust me, I’m ready.”</p><p>She tugged on his hair, trying to urge him up so she could kiss him. He refused to budge. Lifting his head, he studied her flushed face with a brooding gaze.</p><p>“I want to lick your cunt, Madison, until you’re so mindless with need you won’t think of anything but how desperately you want me.”</p><p>A violent surge of arousal rushed through her. Odd. She hated when men talked so bluntly about sex.</p><p>But then, none of them had been Luc.</p><p>Damn him.</p><p>Slowly, deliberately Luc slid lower, keeping careful watch on her expression. She shivered at the tenderness that lurked just below his fierce hunger.</p><p>He was acting as if he cared about her. Really and truly cared.</p><p>She squashed her dangerous reaction to his pretense, instead concentrating on the raw anticipation humming through her body.</p><p>He settled between her legs, his hands gripping her inner thighs as he ran his tongue through her cleft. She nearly jerked off the bed at the powerful shock of bliss that exploded through her. God almighty. Her entire body was going up in flames.</p><p>“Please, Luc.”</p><p>He chuckled, swiping his tongue over her clitoris. “Soon.”</p><p>Her toes curled, a delicious pressure building beneath the stroke of his tongue. “You’re tormenting me.”</p><p>“Sweet torment,” he muttered, pushing his tongue deep inside her.</p> <p>Madison made a sound of pure need, her gaze riveted to the sight of him perched between her legs, his tongue fucking her as he watched every flicker of emotion over her face.</p><p>She’d never been so turned on.</p><p>“Come, Madison,” he growled, pressing his tongue against her swollen clitoris. Instantly, a violent orgasm ripped through her, making her body shake from the force of the raw, explosive pleasure.</p><p>She cried out, feeling as if she’d lost touch with the world as he continued to tongue her with a groan of satisfaction.</p><p>On and on the climax rolled through her, prolonged by the stroke of his tongue.</p><p>Come, indeed. Her head fell back on the pillow, her entire body trembling from the glorious release.</p><p>Still, Luc wasn’t done, his tongue dipping in and out of the entrance to her body, swiftly teasing her back toward another climax.</p><p>He’d always been an overachiever, she dreamily acknowledged, savoring his expertise.</p><p>She hissed as he found her swollen clitoris and gently sucked it, at the same time sinking a finger deep into her body. It was almost too much. The sensual assault beating against her most vulnerable emotions.</p><p>He was shattering her, and she wasn’t certain she would be able to put herself back together.</p><p>He turned his head to nibble at her inner thigh, his voice a low growl. “You’re protected?”</p><p>She nodded. She’d been planning for this night for a very, very long time. “Yes.”</p><p>“Good. I don’t want anything between us.” He returned to tormenting her clit, his finger stroking a spot deep inside her that made her pussy flutter with bliss. “I swear I’m clean.”</p><p>“Luc...I’m getting close. I want you inside me.”</p><p>He gave her one last, lingering suck before he was sliding upward, the hairs of his chest tickling her tightly budded nipples. The sensation made her moan, her hands gripping his shoulders as he reached down to tug her legs apart, his rough urgency sending sparks of excitement down her spine. No man had ever revealed such a raw passion toward her. Was that what made it so thrilling?</p><p>Barely able to accept this was more than just another heated dream, Madison kept her gaze glued to the dark beauty of his face. His expression was tight with the strain of leashing his passion, but the stark perfection of his features and the satin ebony of his hair made her heart leap. Then she met the midnight fire of his eyes and she was lost in the power of his need.</p><p>Luc.</p><p>The bane of her existence.</p><p>“Are you ready?”</p><p>She knew what he was asking. He’d given her the sweet rapture of his mouth. Now he intended to fuck her.</p><p>“God, yes,” she breathed, sinking her nails into his shoulders as he plunged into her wet pussy with one hard surge of his hips.</p><p>She made a sound of shock as his large cock stretched her to the edge of pain. He was so deep she could feel his balls pressed against her ass. She felt invaded. Possessed. God. It was...frighteningly intimate.</p><p>As if he’d become a part of her.</p><p>Their gazes locked and held as an emotion she couldn’t name wove between them, joining them on a level that had nothing to do with their tense, sweat-drenched bodies.</p><p>“Shit, you feel so perfect,” he at last rasped, slowly pulling out of her body before ramming forward with enough force to make her slide up the bed. He studied her flushed face, his body trembling. “Are you okay?”</p><p>She nodded, knowing he was desperate to unleash his hunger, but terrified he might frighten her.</p><p>“I want you,” she rasped. “Don’t hold back.”</p><p>A dark flush stained his cheekbones and he grasped her by her wrists, pinning them above her head.</p><p>“Hold on, Madison. You’re about to go for a ride.”</p><p>Spreading her legs, he surged forward, impaling her with a fierce, ruthless pace.</p><p>She released a shaky groan, her hips lifting to meet his hard thrusts. Pleasure spiked through her as her body easily accepted his savage need. He leaned down to claim her lips in a kiss of sheer possession.</p><p>This was how sex was supposed to be.</p><p>It wasn’t convenient, or civilized, or a tedious expectation at the end of the night.</p><p>It was hot, and raw, and so intense she felt as if her nerves had been stripped and exposed to this man in a way that would bind them forever.</p><p>Over and over he shoved his cock deep inside her, his tongue mimicking the hectic pace of his body. Madison wrapped her legs around his pistoning hips, realizing another massive orgasm was rapidly clenching her lower muscles.</p><p>“That’s it, Madison,” he muttered against her lips, his body slick against hers as he moved with primitive force. “Let go. I’ve got you.”</p><p>She tilted her head back as he moved to press his lips against the pulse that thundered at the base of her throat, his hand slipping between them to press against her clit.</p><p>One flick of his finger was all it took to send her vaulting over the edge, the orgasm ripping through her as she cried out his name in stunned pleasure.</p><p>Luc struggled to catch his breath, seismic quakes from his orgasm still jolting through his body.</p><p>Christ, he hadn’t felt such intense pleasure since...</p><p>Since the last time he’d been in bed with Madison, he ruefully acknowledged.</p><p>He had no explanation.</p><p>He’d been with women during the past eight years, although not as many as people assumed. Once he’d ended his competition for his father’s approval he’d learned that he needed more than just a willing female to stir his libido. But absolutely none of them had been capable of making him feel as if he was connected to them on some level that went way beyond the physical.</p><p>Only Madison.</p><p>Rolling to the side, he held her tightly in his arms, trying to work up the energy to reach for the phone to call room service.</p><p>Tonight deserved a bottle of champagne. The finest the hotel had to offer.</p><p>Madison stirred against him and Luc instinctively tightened his arms around her. “God. That was—”</p><p>“Sex,” she interrupted his fervent words.</p><p>Luc frowned. Was she serious?</p><p>“No,” he growled. “Sex doesn’t make the earth move.”</p><p>She tensed at his description, almost as if he’d embarrassed her. “So poetic.”</p><p>“I have my moments.” He buried his face in the satin softness of her hair, breathing deeply of her sweet, vanilla scent. Instantly he hardened, ready to feel the wet heat of her body wrapped around his thickening erection. Or maybe this time he had the control to actually feel her lips wrap around his cock. “In fact, I feel another moment coming on.”</p><p>Allowing his hands to lower, he cupped the smooth curve of her ass, tugging her closer. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not just because he wanted to feel her warm body pressed against his aching cock, but because he suddenly sensed that she was pulling away from him.</p><p>And that was...unacceptable.</p><p>As if to prove his point, Madison laid her hands against his chest. “Luc.”</p> <p>He pressed his lips to the top of her head, sucking in a deep breath. He didn’t want to discuss what had just happened between them.</p><p>He just wanted to savor round two. And three.</p><p>Tomorrow they could dissect this passion that had only become more explosive over the past eight years.</p><p>“Mmm. Vanilla,” he murmured. “Every time I smell it I think of you.”</p><p>She pressed her palms against his chest. “Luc, wait.”</p> <p>Reluctantly, he pulled back to study her face that was still flushed with arousal. “What’s wrong?”</p><p>“I need to get up.”</p><p>Every instinct rebelled against the thought of allowing her to leave the warmth of his arms.</p><p>“Why? We have all night.” He peered deep into the hazel eyes, searching for...what? An assurance that she’d been as shaken as he’d been by the intensity of their lovemaking? “Hell, we have as long as you want.”</p><p>“I...I have to use the bathroom.”</p><p>“Damn.” He grimaced, loosening his grip so she could scramble off the bed and head for the bathroom. “Don’t be long,” he called after her retreating form, again noticing the smudge of makeup on her lower hip. Sometime he intended to ask her if she had a birthmark. He didn’t want her to feel as if she ever had to hide anything from him.</p> <p>Scooting up on the headboard, Luc phoned down to order the champagne and a plate of fresh fruit and chocolates. He hoped that Madison wasn’t one of those women who always felt the need to starve herself. He had an erotic vision of her eating her dinner off his body.</p><p>Just the thought of her tongue lapping champagne off his bare skin was enough to make him groan. Christ. He needed Madison back in this bed.</p><p>He glared across the hotel suite, wondering what could possibly be taking so long.</p><p>Surely she didn’t think she needed to fuss over her makeup and hair?</p><p>Yeah, he was male enough to appreciate her beauty, but it wasn’t what made her so fascinating.</p><p>Or why he was so desperate to have her back in his arms.</p><p>He’d known a hundred beautiful females who hadn’t made him look twice.</p><p>On the point of barging his way into the bathroom and hauling her back to the bed—or maybe he’d just lure her into the shower—the connecting door was shoved open.</p> <p>“At last—” His words came to a sharp halt, his brows snapping together at the sight of Madison wearing a casual yellow sundress with a scooped neckline and spaghetti straps. Her hair pulled into a simple ponytail. “Why are you dressed?”</p><p>Opening a large Gucci bag, she set it on a chair and began collecting her clothes that were scattered over the carpet.</p><p>“I think that should be obvious.”</p><p>Luc watched her jerky movements with a strange sense of incredulity. Was this the same woman who’d just shattered in his arms? Who’d cried out his name at the height of her pleasure?</p><p>“Obvious to whom?” he demanded. “Certainly not me.”</p><p>She shoved her gown and shoes into the bag, not even glancing in his direction. “I’ve done what I came to do and now I’m leaving.”</p><p>“Leaving?” His sluggish thoughts struggled to make sense of this abrupt change from lover to stranger. “You said this was your room.”</p><p>“I paid for the night.” She at last turned to face him, her expression unreadable. “Feel free to stay if you want.”</p><p>With an impatient growl, Luc shoved himself off the bed, stalking toward her. “What the hell is going on here?”</p><p>She tilted her chin, her body rigid. “Come on, Luc. You’re an intelligent man.”</p><p>He halted directly in front of her. “I used to think so, but clearly there’s something wrong with my brain since I can’t think of one reason you aren’t in this bed with me.”</p><p>“I told you, I finished what I came to Vegas to do.”</p><p>Luc flicked his gaze toward the packed bag before returning to Madison’s aloof expression. Anger abruptly replaced his confusion.</p><p>She was packing to leave.</p><p>“You came to screw me?” he snarled.</p><p>“To seduce you,” she corrected.</p><p>“Why?” He glared at her in disbelief. “You wanted a quickie for old times’ sake?”</p><p>She kept her chin at a defiant angle, but Luc didn’t miss her covert step away from his tightly coiled body.</p><p>“I wanted you to feel what it’s like to be lying in a bed when someone else walks away.”</p><p>“Son of a bitch,” he breathed, suddenly remembering his earlier suspicion that Madison was hiding something from him. Now he knew. “This was revenge sex.”</p><p>“Precisely.” A sweet smile curved the lush lips he’d so recently imagined wrapped around his cock, but it did nothing to warm the cold hazel eyes. She grabbed her bag. “Goodbye, Luc.”</p><p>Luc was standing in front of the door before he even realized he was moving. “I don’t think so.”</p><p>She narrowed her eyes. “Get out of my way.”</p><p>He folded his arms over his naked chest, his gaze taking in the frantic pulse at the base of her throat.</p><p>So. She wasn’t the ice queen she was pretending to be.</p><p>“No,” he said, grabbing her by the waist and tossing her over his shoulder.</p><p>He hadn’t built a financial empire without developing the ability to take command of a situation.</p><p>No matter how crazy-ass the situation might be.</p><p>“Stop,” she rasped, slamming her fists against his back. “What are you doing?”</p><p>With a smooth motion he had her off his shoulder and dumped onto the mattress. She landed with a furious gasp, tangled in her yellow silk dress.</p><p>“You’re not leaving until you tell me what’s wrong with you,” he warned.</p><p>“Wrong with me?” She shoved herself onto her elbows, glaring at him with a combination of fury and something that might have been fear. Not of him. She had to know he’d never do anything to hurt her. At least not physically. Her fear was of losing control of the situation. “You’re the lunatic who won’t let me leave.”</p><p>“I will once I have the truth.”</p><p>Her lashes swept down, hiding her eyes. “I told you the truth.”</p><p>“That you spent the past eight years plotting revenge because I hurt your feelings?” he demanded, anger still clouding his mind.</p><p>“You humiliated me,” she muttered, refusing to meet his outraged stare. “And I didn’t spend eight years plotting. As you pointed out, I’ve built a successful career. That doesn’t happen without dedicated attention to my work.”</p><p>“Exactly,” he snapped. “Which means you should have outgrown this petty need for vengeance a long time ago.”</p><p>She hunched a shoulder. “You ruined what should have been a special occasion.”</p><p>He had.</p><p>There was no denying he’d botched the entire night. Starting with showing up at the trailer in the first place. He’d known she was innocent, and that she would expect more than he could offer at that time.</p><p>Still it seemed extreme to devote eight years to payback.</p><p>In fact, it seemed preposterous.</p><p>He frowned, forcing aside the fury clouding his mind.</p><p>Madison wasn’t a bunny-burner. She was intelligent, driven, and successful on a level that only a small percentage of people ever achieved.</p><p>So why be obsessed with one lousy jackass from her past?</p><p>“No.” He gave a sharp shake of his head. His disreputable past as a womanizer meant he understood human nature. Especially when it came to the fairer sex. This wasn’t adding up. “There’s more to this.”</p><p>She turned her head to glare at the far wall, a brittle tension vibrating around her. “If you insist on this pointless conversation, would you put on some clothes?”</p><p>He snorted. “Why? Does my body bother you?”</p><p>“I’m tired of seeing you naked.”</p><p>“Odd,” he purred, his gaze sliding down her slender form. The sundress had twisted around her thighs, revealing the spectacular length of her legs. Legs that had recently wrapped around his waist as he’d pounded into her. “Just a half hour ago you couldn’t wait to see me naked,” he reminded her, taking pleasure as she flinched. “And you certainly weren’t complaining about my lack of clothes when I was buried deep inside your body and you were groaning in pleasure.”</p><p>She jerked her head back to meet his mocking gaze, her cheeks flushing with embarrassment.</p><p>“No one could ever claim you aren’t a stud who knows how to use his equipment. You’ve practiced enough, after all.”</p><p>His eyes narrowed at the hostility that edged her voice. “That’s it.”</p><p>She frowned. “What?”</p><p>“That bitterness,” he said. “It’s more than a woman disappointed at having her virginity taken by an immature son of a bitch.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her breath caught, her gaze becoming wary. “No. You just can’t accept that for once you are the one being used and dumped.”</p><p>“I’ve been used more times than I can count,” he dryly assured her. Women weren’t the only ones who were chosen just because of their looks. “Certainly enough times to know the difference between a woman who is just looking to scratch an itch and one who is so consumed with need for me she melts at my touch.”</p><p>“Arrogant bastard,” she muttered, scrambling off the far side of the bed and heading toward the door.</p> <p>Once again he moved to block her path, lightly grasping her upper arms to halt her retreat.</p><p>“Why, Maddy?”</p><p>The hazel eyes flashed with an emotion impossible to decipher. “My name is Madison.”</p><p>“You’ll always be Maddy to me.” His voice lowered, his gaze stroking over the features that were astonishingly familiar despite their eight year separation. Almost as if they’d been held as a precious treasure in his mind. “The young beauty who wore her secondhand clothes with such pride and dignity you outshone every other girl in school. The girl who was too shy to say hello, but watched me with those big, innocent eyes. The girl who should have been crushed by the crappy hand she’d been dealt, but instead had the courage to leave behind her past and create a new life.” He gave a slow shake of his head. “Only you haven’t left the past behind. Have you?”</p><p>She tried to pull out of his grasp, her eyes clouding with something that might have been panic.</p> <p>“I’m leaving.”</p><p>“Tell me what’s going on, Maddy,” he commanded, his voice harsh with frustration. “There has to be more than revenge that brought you to Vegas.”</p><p>CHAPTER FOUR</p><p>Madison whirled away from her tormentor and paced toward the center of the hotel room.</p><p>Dammit. Nothing was going right.</p><p>He was supposed to be lying in the bed, too stunned by her abrupt departure to do anything but watch her walk away in silence.</p> <p>And then...</p><p>Well, her imagination hadn’t gone beyond that moment, but she’d assumed that she would return to New York; a woman at last at peace with her past.</p><p>Instead, Luc refused to let her leave the room, badgering her with questions that he had no right to ask.</p><p>Spinning back around, she sent Luc a glare, doing her best to ignore the bronzed, shockingly beautiful male body.</p><p>It would have been easier if she wasn’t abruptly fantasizing about running her lips over those washboard abs and allowing her tongue to tease his cock back to full, erect glory.</p><p>A heat bloomed between her legs, making her hands clench in frustration.</p><p>No, no, no.</p><p>Tonight was about new beginnings...not indulging her senses with Luc Angeli.</p> <p>Even if her entire body ached to feel his touch.</p><p>“Why do you have to ruin this?” she growled.</p><p>He scowled, as if he didn’t know exactly what he was doing. “Ruin what?”</p><p>She pointed toward the door. “My walk-away.”</p><p>His brows arched. “Your what?”</p><p>“My walk-away.”</p><p>“Christ, Maddy.” He shoved his fingers through tousled hair, managing to look completely baffled. “What are you talking about now?”</p><p>“When you left me I allowed you to make your grand exit,” she said, torn between punching him in the nose and kissing him. “But you just had to be a bully and take mine away.”</p><p>His expression softened as he finally understood why she was so pissed, but did he move aside and allow her to walk away with some dignity?</p><p>No.</p><p>He stubbornly paced to stand directly in front of her, his hands framing her face in a gentle grasp.</p><p>“Because this isn’t you,” he murmured, his thumb brushing her lower lip. “You aren’t cruel. You don’t deliberately try to hurt people.” His lips twisted in a wry smile. “Not even those people who might deserve it.”</p><p>The heat from his body blasted through the thin silk of her dress, a raw surge of need making her shiver.</p><p>“I—”</p><p>His brows snapped together as her words trailed away. “Maddy, for god’s sake,” he rasped. “Tell me the truth.”</p><p>She ground her teeth together. Dammit. Obviously, the only way she was getting out of the hotel room was to give him what he wanted.</p><p>Pigheaded pain in the ass.</p><p>“I want you out of my head,” she said, offering him the stark truth he claimed to want.</p><p>He blinked. Then blinked again. “You mean the memory of that night?”</p><p>She planted her hands on her hips. “No, the memory of you.”</p><p>He flinched, as if he were bothered by her confession. “Did I truly hurt you that badly?”</p><p>“I was hurt and humiliated when you walked out, but it’s...”</p><p>“What?”</p><p>She hunched her shoulder, her cheeks heating with embarrassment. “I can’t enjoy myself with another man.”</p><p>There was a startled silence, Luc searching her carefully composed expression. “You don’t like men?”</p><p>“Of course I like men,” she snapped, deliberately narrowing her gaze. “When they aren’t being jackasses.”</p><p>He rolled his eyes at her inability to resist another jab. “Then explain what the hell you’re talking about.”</p><p>Unable to reveal her darkest secret while being watched by Luc’s piercing dark gaze, she turned to pace toward the windows overlooking Vegas.</p><p>“Over the years I’ve met dozens of wonderful men,” she said, her voice so low Luc had to move closer to hear her. “Handsome, successful, charming.”</p><p>His breath brushed the bare skin of her shoulder. “You didn’t like any of them?”</p><p>She grimaced. A part of her wished she could say that she’d chosen a string of complete losers. That would easily explain why she hadn’t managed to create a lasting relationship. Unfortunately, there had been more than one man who should have been perfect for her.</p><p>“Actually I liked several,” she grudgingly admitted. “A few I even dated for several months.”</p><p>He was close enough behind her that she could feel him tense, almost as if he didn’t like her talking about other men.</p><p>Which was stupid considering he was the one who’d forced this unpleasant conversation.</p><p>“Why didn’t the relationships last?” he asked.</p><p>“Because I couldn’t—” The words stuck in her throat.</p><p>“What?”</p><p>“Orgasm,” she at last spit out, unable to resist watching his reaction in the reflection of the window. “Are you happy?”</p><p>Shock rippled over his fiercely beautiful face, swiftly followed by a frown of disbelief.</p><p>“Why would I be happy?”</p><p>She hunched her shoulder, feeling raw and exposed now that the truth was out. “You’ve obviously spoiled me for other men.”</p><p>She expected smug contentment. Didn’t most men long to think that they were such fantastic studs that no other man could satisfy their previous lovers?</p><p>Instead, Luc appeared troubled. Grabbing her shoulders, he turned her to meet his searching gaze.</p><p>“Because I walked out?” he demanded, his voice thick with regret. “Are you afraid the men will hurt you?”</p><p>It would be so easy to say yes. To let him think that he’d destroyed her life by leaving her that night. She sensed that far from being proud at her inability to find pleasure with another man, it would truly torture him to believe he’d caused such damage.</p><p>But he was right.</p><p>She’d never been deliberately cruel.</p><p>“I don’t know.” She gave a helpless shake of her head. “I can date a guy, enjoy his company, and even be aroused when we go to bed, but then...” She sucked in a deep breath. “Then suddenly my mind is filled with images of you touching and kissing me and the moment is lost.”</p><p>He took a second to analyze her words before his fingers tightened on her arms, his eyes narrowing.</p><p>“And because I happened to pop up in your sexual fantasies, you returned to Vegas to sleep with me again?” he rasped. “Is that supposed to make sense?”</p><p>She licked her dry lips, her breath catching as his gaze was dragged downward to watch the unconsciously provocative movement.</p><p>“I thought...” She grimaced. It was going to sound stupid no matter how she said it. “I hoped that once I’d slept with you and walked away I would feel...empowered.”</p><p>His brows arched. “Empowered?”</p><p>Yep. It sounded stupid.</p><p>She clicked her tongue with impatience. “It was supposed to be an exorcism that would get you out of my head for good.”</p><p>The dark eyes flared with a sudden fury. “Of all the asinine—” He bit off his angry words, sucking in a deep breath. “Did you ever consider the fact that your inability to enjoy intimacy with a man has nothing to do with me, and everything to do with you?”</p><p>She pulled out of his grip, her chin tilting to a defiant angle.</p><p>“What are you implying?”</p><p>“I’m not implying anything. I’m saying that there are two obvious explanations.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She met his smoldering gaze without flinching. Maybe she’d been an idiot to return to Vegas, but she’d be damned if she let Luc intimidate her.</p><p>“Fine.” She folded her arms over her stomach, wishing to hell he’d put some clothes on. “Let’s hear your brilliant psychoanalysis.”</p><p>A portion of his anger seemed to ease at her taunting tone, his hand reaching to cup her chin. Did he sense her defensive vulnerability?</p> <p>“It’s possible that you used the memory of me as a subconscious method of keeping other men at a distance,” he said, holding her derisive gaze. “Making me the bad guy was easier than admitting that you couldn’t open yourself up enough to reach your climax.”</p><p>“So why would I be able to—”</p><p>“Orgasm with me?” He finished her sentence, his lips twitching with a wry amusement at the heat that stained her cheeks.</p><p>She scowled. “Yes.”</p><p>“Because you trusted me.”</p> <p>She snorted at his ridiculous explanation. “Then more the fool me.”</p><p>He grimaced at yet another reminder of his jackass behavior. “You trusted that I wasn’t going to press for more than you were willing to offer,” he clarified. “In your mind I was the guy who loved ‘em and left ‘em. No danger to your closely guarded heart.”</p><p>Madison barely resisted the urge to roll her eyes. She wasn’t about to admit that far from believing he was going to love and leave her, she’d devoted endless hours to fantasizing over the moment that Luc Angeli, the Dark Angel, would realize she was his one and only soul mate.</p><p>She’d truly thought she was the woman to tame the bad boy.</p><p>What an idiot.</p><p>“So I want to be alone?” she instead played along.</p> <p>“You want a life where you’re in complete control.” He stepped closer, watching her tense as the heat of his naked body wrapped around her. “Not surprising. You were abandoned by your mother. It had to leave you with a fear of opening yourself up to anyone.”</p><p>Her lips thinned. Logically she knew her past had been a driving force in leaving Vegas, as well as in her success in her career. She’d been obsessed with the need to build a sense of security.</p><p>But she’d never been bitter.</p><p>Her mother was who she was: a weak, pathetic woman who’d spent her whole life searching for happiness that forever remained out of reach.</p><p>Madison felt nothing but pity for the woman who’d chosen a life of addicted misery. It certainly hadn’t twisted her ability to connect with other people.</p><p>“A fine theory, except for one glaringly obvious flaw,” she said in dry tones.</p><p>“And what’s that?”</p><p>“I’ve met hundreds of guys that I knew were without a doubt love ‘em and leave ‘em assholes.” Her smug expression dared him to deny her logic. “Why didn’t I crawl into bed with them?”</p> <p>He smiled. A slow, wicked curling of his lips.</p><p>She shivered, feeling the power of his male charm tingle all the way to the tips of her toes.</p><p>“There’s another explanation,” he assured her.</p><p>“I’m afraid to ask,” she muttered, taking a discreet step backward.</p><p>One touch and she would be melting at his feet.</p><p>“You’re still in love with me.”</p><p>The breath was slammed from her lungs at his teasing words.</p><p>Still in love with him...</p><p>The accusation had been tossed at her only hours earlier by Kristen and she’d readily denied the claim. Now she realized that it wasn’t nearly so easy.</p><p>No. God, no.</p><p>She wasn’t so pathetic that she could have harbored an unrequited love for this man for eight years.</p><p>Was she?</p><p>A sick ball of dread lodged in the pit of her stomach as she recalled how often she’d compared her male companions to Luc’s dark, sinful beauty. Or how she’d returned from a night out feeling oddly restless, as if she’d been searching for some special quality in her date that was missing.</p><p>The sickness intensified. Christ. Could she have more of her mother in her than she originally suspected? Was she constantly seeking the one man she couldn’t have?</p><p>Madison gave an automatic shake of her head.</p><p>It’d been a stressful night that had become a damned mess.</p><p>After a good night’s sleep she’d be laughing at the mere suggestion she could still be in love with Luc Angeli.</p><p>“Screw this—I’m out of here,” she growled, pointing a finger in Luc’s face as he held up a hand to halt her retreat. “Touch me and I’ll kick you in the nuts.”</p><p>His brows snapped together at her threat, but his hand fell to his side. “Fine. You can run all you want, Maddy. Eventually the past will catch up with you.”</p><p>CHAPTER FIVE</p><p>If Madison possessed a gun she would have shot the alarm when it jolted her out of her restless sleep.</p><p>With a groan, she lifted her head, blearily reaching to grab her phone and end the chirping.</p><p>Eight thirty.</p><p>Crap. She’d been asleep less than two hours.</p><p>She hadn’t actually expected a good night’s sleep after she’d returned to Kristen’s apartment. Not after the way she’d parted from Luc. But it was still aggravating that she’d tossed and turned until after six a.m.</p><p>Even worse, she had an appointment at nine thirty that she couldn’t miss.</p><p>Cursing at the headache that felt as if it was drilling a hole in her brain, Madison stumbled from bed and into the shower.</p><p>Thirty minutes later she was clean and dressed in faded jeans and a casual stretchy top. She pulled her hair into a braid, but she left her face bare of makeup.</p><p>Her appointment was at a shop known for its discretion, but there was no point in trying to attract unwanted attention. She was famous enough to occasionally capture the interest of the paparazzi.</p><p>Besides, there wasn’t enough makeup in the world to disguise the pallor of her skin or the purple shadows beneath her eyes.</p><p>Grabbing her purse, Madison stumbled out of her bedroom, lured toward the kitchen by the scent of freshly brewed coffee.</p><p>She ignored Kristen’s curious gaze as she moved to take a seat at the breakfast bar, deeply relieved when a cup of steaming black coffee was placed on the counter in front of her.</p><p>“Thank god,” she muttered.</p><p>“And good morning to you too, sunshine,” Kristen mocked, appearing nauseatingly perfect in her black pencil skirt and crisp white shirt. There wasn’t so much as a strand of honey hair out of place.</p><p>“Ugh.” Kristen sipped the coffee, sending her friend a jaundiced scowl. “Why are you shouting?”</p><p>The indigo eyes widened with surprise. “Do you need my famous cure for a hangover?”</p><p>Madison shuddered in horror. She’d only tasted the infamous cure one time, but it was enough to have left the hideous taste scorched into her memory.</p><p>“Not even if I was on my deathbed,” she muttered.</p><p>“Hey,” Kristen protested. “It’s guaranteed to work.”</p><p>Madison grimaced. “It also tastes like snail sludge.”</p><p>“How would you know?” Kristen narrowed her gaze. “Have you actually tasted snail sludge?”</p><p>Madison held up a hand, her brain still throbbing. “It doesn’t matter. I don’t have a hangover.”</p><p>“Uh-oh.” Kristen turned to cross the tiled floor, swiftly returning to place a small bakery bag in front of Madison. “Here.”</p><p>Madison frowned as she reached into the bag. “What’s this?”</p><p>“An emergency red velvet cupcake,” Kristen said. “I swung by the bakery last night just in case you failed in your mission.”</p><p>Madison pulled out the cupcake, her mouth watering at the sight of the cream cheese frosting topped with sprinkles.</p><p>“I didn’t fail,” she said, concentrating on pulling the wrapping from the cupcake in an effort to avoid her friend’s searching gaze.</p><p>Kristen made a sound of disbelief. “This is what you look like when you succeed?”</p><p>“It’s...complicated.”</p><p>“Somehow I’m not at all surprised,” Kristen said on a sigh. “Eat.”</p><p>Ignoring the massive calories that would have to be worked off at the gym, Madison demolished the cupcake in record time, pleased when her headache became almost bearable.</p><p>Nothing like sweet, gooey goodness to ease the pain.</p><p>“Mmm.” Madison licked her fingers. “Much better than your nasty hangover remedy.”</p><p>Kristen rolled her eyes, cleaning away the mess Madison had made. The woman was a true neat freak.</p><p>“Now tell me what happened,” Kristen commanded.</p><p>Madison wrinkled her nose, taking another sip of the coffee. “Luc Angeli happened.”</p><p>“Ah.” Kristen leaned against the edge of the counter, her expression warning she wasn’t going to allow Madison to leave until she had the full story. “So he was at the hotel.”</p><p>“Yes.”</p><p>“And as handsome as ever, the annoying devil,” the blonde-haired woman said, obviously having seen Luc around town.</p><p>“And as arrogant,” Madison muttered. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“What did you expect?”</p><p>Madison gave a short, humorless laugh. “A good question.”</p><p>Kristen stilled, studying Madison with a growing concern. “Maddy...” She abruptly grimaced. “Sorry, I meant—”</p> <p>“Maddy’s fine,” she assured her friend. She’d ridiculously thought that insisting on being called Madison would somehow separate her from the naïve girl who’d so eagerly invited Luc into her bed.</p><p>The truth was that she would never be able to rid herself of Maddy.</p><p>Her past was simply a part of her.</p><p>“What happened?” Kristen prompted.</p><p>“It went just as I planned.” Madison grimaced as she was forced to relive her latest humiliation. “I met Luc at the party and less than a half hour later he was in my hotel room.”</p> <p>“Not surprising,” Kristen murmured, her gaze closely studying Madison’s pale face. “No man could resist a night with Madison Philips.”</p><p>Madison shook her head. There were some men who would be attracted to her because she was a famous model, but that wasn’t why Luc had been so eager.</p><p>“Luc couldn’t resist a night with any woman willing to spread her legs,” she said in dry tones.</p><p>Kristen arched a brow. “I told you earlier that the rumor around Vegas is that Luc has become very particular in his choice of companions. I heard one of his friends say that he’d become a monk over the past couple of years.”</p><p>Madison ignored her friend’s words. Just as she’d ignored Luc’s claim that he’d changed from the shallow flirt he’d been when she’d known him.</p><p>“More likely he became more discreet.”</p> <p>“That’s possible, I suppose,” Kristen slowly agreed, frowning as if troubled by Madison’s stark refusal to believe that Luc could change. “What happened when you got to the hotel room?”</p><p>Madison felt her cheeks heat. She told herself it was embarrassment. She wasn’t the sort of woman who enjoyed sharing the details of her sexual encounters with anyone, not even her best friend. But deep inside she knew that it was the remembered pleasure that made her face flush.</p><p>God. She ached in places that she’d never realized could ache.</p><p>The delectable ache of a woman who’d been well loved.</p><p>Her blush deepened as Kristen raised a questioning brow.</p><p>“I would think that was pretty obvious,” she mumbled.</p><p>Kristen chuckled. “So you did the deed?”</p><p>Madison nodded, although she’d never, ever call what happened between her and Luc ‘doing the deed.’</p> <p>That implied a casual hookup. What happened last night was...</p><p>Anything but casual.</p><p>At least for her.</p><p>“We were together...yes,” she confessed.</p><p>Kristen leaned forward. “And how was it?”</p><p>“Mind-blowing.”</p><p>Kristen flashed a teasing smile. “Good for you, girlfriend.”</p><p>“No,” Madison growled, shoving away the coffee as her stomach twisted with a sick sense of inevitability. “Not good for me.”</p><p>Kristen’s smile faltered. “You wanted it to be a failure?”</p><p>“I wanted...” She made a sound of disgust at the memory of her smug confidence when she’d planned her trip to Vegas. She’d been so certain she wanted nothing more than revenge. It’d never occurred to her that she was using any excuse, no matter how pathetic, just to be with Luc Angeli. “Shit.” She rubbed her temples, the headache better, but still a dull throb behind her eyes. “I’m losing my mind.”</p><p>“I’m sorry, Maddy.” Kristen grimaced with regret. “If you don’t want to talk about this—”</p><p>“He claimed that I’m still in love with him,” Madison broke into her friend’s apology, abruptly revealing the truth.</p><p>Why not?</p><p>Kristen would worm it out of her one way or another.</p><p>Kristen abruptly frowned, her eyes searching Madison’s pale face. “You told me—”</p><p>“I know what I said.” Madison heaved a resigned sigh. “But I think I must have been in denial.”</p><p>Silence.</p><p>At last, Kristen cleared her throat. “Denial?”</p><p>“I wanted to believe I hated him.” Madison gave a helpless lift of her hands. “It was certainly better than accepting I couldn’t grow past my childish, schoolgirl crush.”</p><p>“What are you going to do?”</p><p>It was the first question that Madison had no trouble answering. She’d made her decision during the long hours of staring at the ceiling.</p><p>“I’m going to my appointment then I’m returning to New York as I planned.”</p><p>Kristen looked like she’d just been slapped. “Going back to New York?”</p><p>“Yes.”</p><p>“You can’t.”</p><p>Madison blinked in surprise. She’d expected sympathy from her friend, not an adamant rejection of her plan.</p><p>“Why not?”</p><p>“Because you have to talk to Luc,” Kristen said.</p><p>Madison slid off her stool, her brows furrowed as she glared at her companion. “Have you gone insane? He’s the last person I want to see.”</p><p>“But...” Kristen looked as if she wanted to give Madison a good kick in the ass. “If you still love him then you have to see if this could work.”</p><p>Madison was shaking her head before Kristen finished speaking.</p><p>A part of her desperately wanted to stay. Just to be near Luc.</p><p>Then she realized just how sad and pathetic that would be.</p><p>Spending her days hoping to catch some glimpse of Luc, while he was constantly chasing another woman.</p><p>She shuddered.</p><p>“I can’t.”</p><p>“How do you know?” Kristen pressed.</p><p>“Because he’s Luc Angeli.”</p><p>“And?”</p><p>Madison wondered if her friend was being deliberately obtuse. She knew as well as Madison that staying in Vegas would offer her nothing more than heartache.</p><p>“And he’s not forever-after material,” she muttered in exasperation.</p><p>Kristen shrugged. “Who says?”</p><p>“I do.”</p><p>The indigo eyes narrowed. “Only because you’re a coward.”</p><p>Madison flinched at the accusation. “What the hell is that supposed to mean?”</p><p>Kristen moved to stand directly in front of Madison, her expression unrepentant.</p><p>“You love Luc, but you’re too afraid of another rejection to give him a chance.”</p><p>Madison reached for her purse.</p><p>This had nothing to do with courage, she silently reassured herself.</p><p>Hadn’t she proved she could face whatever life could throw at her? That she could overcome any challenge and come out on top?</p><p>She was just smart enough to avoid repeating her mistakes.</p><p>“I’m late,” she muttered, turning to head for the door.</p><p>“Maddy,” Kristen called from behind her. “Dammit, I’m not going to let you throw away a chance at happiness.”</p><p>Luc had broken all speed limits to get to the remote parking lot near Red Rocks. There was a shop on the other side of the lot, but he’d deliberately tucked his Jag behind a large rock formation at the back.</p><p>He didn’t know why he was there.</p><p>No, that wasn’t true.</p><p>He’d already been headed to Kristen’s condo when she’d texted him with the info that Madison was going to be at this location and that he needed to be here to meet her.</p><p>But he didn’t have any idea why Madison would be traveling to this desolate spot.</p><p>And right now, he didn’t give a shit.</p><p>Nothing mattered but having the opportunity to speak with her before she left town.</p><p>Climbing out of his car, he impatiently glanced at the expensive watch wrapped around his wrist.</p><p>Dammit. He’d been so pissed when Madison had left the hotel last night that he’d drunk the entire bottle of champagne that’d arrived only moments after her dramatic departure.</p><p>The expensive wine had helped to dull his outrage at her claim that she’d used him as some sort of sexual purge. But as his anger had cooled, he deeply regretted having consumed so much alcohol.</p><p>He knew damned well and good that Madison hadn’t sought him out just for revenge.</p><p>It simply wasn’t her nature.</p><p>She had to have some lingering love for him, even if she refused to admit it.</p><p>Unfortunately, he’d been on the wrong side of tipsy from the champagne, and was forced to sober up before he could go in pursuit. A man didn’t try to convince the woman of his dreams to give him a second chance while he was drunk.</p><p>So he’d done his best to sleep off his uncharacteristic overindulgence before returning to his home to shower and shave, swiftly changing into a pair of well-worn jeans and T-shirt before heading to out to find Madison.</p><p>Now he awaited her arrival with a growing frustration.</p><p>Was it possible that Kristen had sent him to the middle of nowhere so Madison had time to escape him?</p><p>It was exactly the sort of plot the devious young lawyer would concoct.</p><p>Especially if Kristen thought he intended to hurt her friend... </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sound of an approaching car broke into his dark brooding and Luc backed into the shadows of the rocks, watching the silver sedan pull into the lot.</p><p>A grim smile touched his lips as he caught sight of the dark-haired beauty seated behind the steering wheel of the rental car.</p><p>Madison.</p> <p>Angling to avoid being seen in her rearview mirror, Luc jogged across the lot, swiftly reaching the car. Then, with a yank on the handle, he had the door open and was sliding into the passenger seat.</p><p>“Morning, Maddy.”</p><p>There was a feminine screech as Madison jerked her head to the side to watch him slam the door shut, her hand pressed to the center of her chest.</p><p>“Good god, you nearly gave me a heart attack,” she rasped, her eyes narrowing as suspicion replaced her initial fear. “What the hell are you doing here?”</p><p>He slid an appreciative glance over her slender body before returning to her furious face. Even in jeans and no makeup she was still the most beautiful woman he’d ever seen, but there was no mistaking the shadows beneath her glorious eyes and the pallor of her skin.</p> <p>A part of him was instantly concerned by the signs of a sleepless night, while a much larger part of him felt a stab of hope.</p><p>Surely a woman who’d accomplished her mission would have slept soundly?</p><p>“Weird,” he drawled, holding her wary gaze. “That’s the precise question I was about to ask you.”</p><p>Her scowl deepened. “Did you follow me?”</p><p>“Actually I’ve been waiting for you.”</p><p>“How could you possibly have known I was coming—” Annoyance abruptly flared through her hazel eyes. “Kristen,” she muttered.</p> <p>“She sent me a text,” Luc admitted. “She said that you were coming here to complete some unfinished business. She also said that I needed to stop you.”</p><p>Madison’s breath hissed between her clenched teeth. “Meddlesome pain in the ass.”</p><p>He leaned toward her, resting his forearm on the center console as he carefully monitored her expressive face.</p><p>“Why are you here, Maddy?”</p><p>She gave a shake of her head, her braid brushing her shoulder. “It’s none of your business.”</p><p>“What would it take to make it my business?” he asked, reaching to grasp the braid and tug the band off the end.</p><p>“I...” She licked her dry lips, looking incredibly young and vulnerable as the morning sunlight streamed through the windshield. “Don’t understand.”</p><p>His heart twisted, the familiar affection he’d always felt for this woman deepening into a richer, more lasting emotion.</p> <p>Avoiding her wary gaze, Luc concentrated on unraveling her hair from the braid. “When I caught sight of you last night it all became clear.”</p><p>“What did?”</p><p>“Why I could never commit to another woman.” He unraveled the last of the braid and combed his fingers through the satin softness. His breath caught as a fierce arousal slammed into him. Oh...man. Just being near this woman was enough to make him hard with need. The sooner he had her in his arms, the better. “And why I kept such a close watch on your career,” he continued, leaning even closer. “And why I felt as if I’d been living my life in black and white until you walked onto that balcony and filled the night with beauty.”</p><p>He was near enough to see her eyes darken at his soft words. Of course, her expression remained stubbornly defensive.</p><p>Nothing about Madison Philips would ever be easy.</p><p>And he didn’t give a shit.</p><p>He would give whatever necessary to make her happy.</p><p>“Did you practice that?” she tried to mock, grimacing as her words came out as a husky whisper.</p><p>“You want it in simple terms?” he asked, his expression somber. “I never stopped regretting walking away from you. And now that you’re back I’m never letting you go again.”</p><p>Her lips parted at his blunt warning, the pulse at the base of her neck fluttering at a rapid beat.</p><p>“Luc.”</p><p>Luc sucked in a deep breath. It was now or never.</p><p>Unless he overcame his aversion to making himself vulnerable, then she was going to walk away.</p><p>“I love you, Maddy.”</p><p>The hazel eyes widened, her shock tangible in the close confines of the car. “You can’t,” she breathed.</p><p>He lifted his brows. “I can’t?”</p><p>She gave a restless shrug. “You barely know me.”</p><p>Luc gave a laugh at her ridiculous words.</p><p>“I’ve known you all my life,” he reminded her, able to recall the precise minute he’d glanced down the hall of their school to see those big, beautiful hazel eyes focused on him. At the time he hadn’t understood why he’d felt as if he’d been struck by lightning. Or why he’d always checked the stands before he jogged onto the football field to make sure she was seated in her familiar spot. He’d always been aware that she was a constant backdrop in his life. “I know you have a generous heart despite the hardships you were forced to endure, you have endless courage, and an independent spirit that I deeply admire.” His fingers slid out of her hair to lightly trace the line of her stubborn jaw. “Everything else we’ll discover during our future together.”</p><p>She shivered beneath his light caress, but she made no protest to pull away. “Future?”</p><p>He leaned forward, pressing a soft, lingering kiss on her lips. “A very long future.”</p><p>Her hands lifted to lie against his chest, her breath coming in tiny pants between her parted lips.</p><p>“Are you asking me to...” She had to stop to clear her throat. “To marry you?”</p><p>He pulled back with a wry smile.</p><p>He didn’t blame her for the disbelief in her expression.</p><p>Hell, his own mother would be shocked when he confessed he was ready to give up his bachelor days and take a wife.</p><p>And his father...</p><p>No. He gave a shake of his head.</p><p>He wasn’t anything like his father.</p><p>He only needed one woman to make him happy.</p><p>“Eventually,” he hedged, not wanting to terrify her into bolting. “First I just want the opportunity to prove I’m no longer that stupid kid who hurt you.” He cupped her chin, forcing her to meet his pleading gaze. “Will you give me a chance?”</p><p>“I...” His heart halted as she hesitated, panicked by the thought she might say no. Dammit. He was going to lock her in his bedroom until she accepted he’d never meant to hurt her.</p><p>Then, without warning, her hazel eyes warmed with an emotion that sent hope sizzling through his body. “Yes.”</p><p>A dizzying relief exploded through Luc. “Thank god.” Framing her face in his hands, he covered her lips in a desperate kiss, nipping her full bottom lip in punishment for terrifying him. He moaned as she readily melted against him, his erection thickening as he wrapped his arms around her. His tongue dipped into the warm wetness of her mouth, tasting her passion as she grabbed his T-shirt and tried to drag him closer. He growled in frustration as the console kept them separated, the heat of the sun already making the air uncomfortably hot. “Damn...” he muttered, reluctantly lifting his head to study her face that was now flushed with desire. “This car wasn’t made for making love to my woman.”</p><p>A tiny smile curved her lips. “Your woman?”</p><p>“Mine,” he growled with full male possession.</p><p>She kissed the tip of his chin. “I like that.”</p><p>So did he.</p><p>A lot.</p><p>“Are you going to tell me what you’re doing here?” he demanded, nuzzling a path of kisses down her throat.</p><p>She tilted back her head, offering him better access. “When I was seventeen, Kristen stole a bottle of tequila and brought it to the trailer,” she murmured, clearly distracted as his tongue teased the pulse that pounded at the base of her neck.</p><p>Luc felt a stab of surprise. Madison had never attended the private parties where there was alcohol. No doubt the example of her mother had taught her the emptiness of trying to find pleasure in a bottle. And in truth, he’d admired her for resisting the peer pressure.</p><p>Her respect for her body was far sexier than any amount of trying to impress him.</p><p>“You never used to drink in high school,” he said, breathing deep of her vanilla scent.</p><p>“Which only made it worse,” she admitted, shivering as he traced the neckline of her top. “After a couple of shots I decided I had to have some tangible proof of my love for you.”</p><p>He abruptly straightened, smiling with wicked amusement. “Hmm. I like the sound of that.”</p><p>She rolled her eyes. “You would.”</p><p>“What was this tangible proof?”</p><p>“A tattoo of your name in a heart.”</p><p>A tattoo? He was momentarily stunned, then he suddenly recalled the strange smear of makeup he’d noticed last night.</p><p>“On your lower back,” he said.</p><p>“Yes.”</p><p>His hand skimmed down to the spot just above her firm ass. The knowledge that she had his name forever imprinted on her skin was hot as hell.</p><p>Of course, as far as he was concerned, there was nothing about this woman that wasn’t hot as hell. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That explains the makeup.” His hand drifted lower, cupping the firm curve of hip. “I thought you were trying to hide a birthmark.”</p><p>She grimaced. “Needless to say, it was the last time I ever drank tequila.”</p><p>“That still doesn’t explain why you’re here.” He nodded his head toward the building.</p> <p>“Wicked Ink is the best tattoo shop in the world at turning mistakes into works of art,” she explained.</p><p>It took a minute to realize she meant to have her tattoo turned into some design that disguised his name.</p><p>Once he did, he felt a surprising anger at the thought that she’d planned to erase him so thoroughly from her life.</p><p>First with her revenge sex, and then with some magical tattoo artist.</p><p>“You consider me a mistake,” he said, his voice flat.</p> <p>She gave a slow nod, reaching up to lightly touch his face. “I did.”</p><p>“And now?”</p><p>Her finger stroked his lower lip, the gold in her hazel eyes shimmering in the morning sunlight.</p><p>“Now I think maybe I’ll keep it.”</p><p>He lowered his head to brush her lips with the light promise of a kiss. It was all he dared allow himself when they were in full daylight in the middle of a public parking lot.</p><p>“And perhaps I’ll get one that matches yours,” he murmured against her lips.</p> <p>“A heart on your lower back?” she teased, her hands exploring the rigid muscles of his chest. “Won’t you get beat up at the gym?”</p><p>“I don’t care if they put a petunia on my ass just as long as it proves how much I want a second chance,” he assured her.</p><p>“You don’t need a petunia,” she assured him, a small smile curving her lips. “Although I’m not opposed to having my name permanently etched onto your body. I want all those women to know you’re mine.”</p><p>“I am yours,” he said, his voice rough with sincerity as he buried his face in the curve of her throat. “I’ve always been yours.”</p><p>Her arms circled his shoulders, her fingers tangling in his hair. “It’s true, you know.”</p><p>He was having a difficult time thinking as he relished the joy that was surging through him.</p><p>“What is?”</p><p>She whispered directly in his ear. “A woman never forgets her first.”</p> <p>EPILOGUE</p><p>One year later</p><p>Madison stood in front of the newly renovated brick building on the outskirts of Vegas.</p><p>Once an abandoned business center, it had been transformed into an afterschool program where kids in need could come for tutoring, a hot meal, clothing, medical care...or just a safe place to be.</p><p>Madison smiled. She’d mentioned her dream of helping children whose parents couldn’t, or wouldn’t, properly care for them shortly after her quiet wedding to Luc, and within days he had a building purchased and the first plans drawn up.</p><p>At first his driving force had made her head spin, but she’d quickly adjusted, and now they were a true power couple, dividing their time between Vegas and New York. A journey made easy by Luc’s private jet.</p><p>Sensing his intense scrutiny, Madison turned her head to meet his dark gaze, her heart giving a familiar leap of joy.</p><p>It didn’t seem to matter how many days they spent together, or how many nights they devoted to making love. She never got over the thrill of simply being with this man.</p><p>“Well, Ms. Angeli, is it everything you dreamed it would be?” he asked.</p><p>“And more.” She turned, wrapping her arms around his neck. “So much more.”</p><p>He grasped her waist, tugging her intimately against his body. For today, the Maddy Center was closed for a last inspection. Tomorrow the doors would be opened to the public.</p><p>“You’re happy?” he asked softly.</p><p>She smiled. “Mr. Angeli, are you fishing for compliments?”</p><p>He chuckled, appearing indecently gorgeous in his black chinos and white silk shirt that was left open to offer a glimpse of his bronzed chest.</p><p>“If you were in the mood to share a few, I wouldn’t object.”</p><p>A heat that had nothing to do with the scorching Nevada sunlight spread through her.</p><p>“Actually, I’m in the mood—” Going up on tiptoe, Madison whispered in his ear exactly what she was in the mood to do.</p><p>Luc gave low growl, his hands tightening on her waist. “Why, Ms. Angeli, you are a wicked girl.”</p><p>She kissed him with all the love that filled her heart. “Just perfect for the Dark Angel,” she murmured.</p><p>“Perfect,” he agreed, scooping her into his arms and heading for the waiting car.</p><p>THE END </p> </body></html>"]