["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>Noel had been given a promotion in being assigned to the lush green state of Louisiana, but the position was a double- edged sword. Though the area was part of Raphael’s territory, the archangel had assigned the day–to–day ruling of it to Nimra, an angel who had lived six hundred years. Nowhere close to Raphael in age, but old enough— even if age alone was not the arbiter of power when it came to the immortal race.</p><p>Nimra had more strength in her fine bones than angels twice her age and had ruled this region for eighty years; she’d been considered a power when most of her peers were still working in the courts of their seniors. Hardly surprising when it was said that she had a will of iron and a capacity for cruelty untempered by mercy.</p><p>He was no fool. He knew this “promotion” was in truth a silent, cutting statement that he was no longer the man he’d once been— and no longer of use. His hand fisted. The torn and bloodied flesh, the broken bones, the glass that had been driven into his wounds by the servants of a crazed angel, it was all gone courtesy of his vampirism. The only things that remained were the nightmares... and the damage within.</p> <p>Noel didn’t see the same man he always had when he looked in the mirror. He saw a victim, someone who had been beaten to a pulp and left to die. They’d taken his eyes, shattered his legs, crushed his fingers until the pieces were pebbles in a sack of flesh. The recovery process had been brutal, had taken every ounce of his will. But if this insulting position was to be his fate, it would’ve been better not to survive. Before the attack, he’d been on the short list for a senior position in the Tower from which Raphael ruled North America. Now he was a second- tier guard in one of the darkest of courts.</p><p>At its center stood Nimra.</p><p>Only five feet tall, she had the most delicate of builds. But the angel was no girlish- appearing waif. No, Nimra had curves that had probably led more than one man to his ruin. She also had skin the shade of melted toffee, a glowing complement to the luxuriant warmth of this region she called her own, and tumbling curls that gleamed blue- black against the dark jade of her gown. Those heavy curls cascaded down her back with a playfulness that suited neither her reputation nor the cold heart that had to beat beneath a chest that spoke of sin and seduction, her breasts ripe and almost too full for her frame.</p><p>Her eyes slammed into his at that moment, as if she’d sensed his scrutiny. Those eyes, a deep topaz painted with shimmering streaks of amber, were sharp and incisive. And right now, they were focused on him as she walked across the large room she used as her audience chamber, the only sounds the rustle of her wings, the soft caress of her gown against her skin.</p><p>She dressed like an angel of old, the quiet elegance of her clothing reminiscent of ancient Greece. He hadn’t been born then, but he’d seen the paintings kept in the angelic stronghold that was the Refuge, seen, too, other angels who continued to dress in a way they considered far more regal than the clothing of modern times. None had looked like this— with her gown held up by simple clasps of gold at the shoulders and a thin braided rope of the same color around her waist, Nimra could’ve been some ancient goddess.</p> <p>Beautiful.</p><p>Powerful.</p><p>Lethal.</p><p>“Noel,” she said and the sound of his name was touched with the whisper of an accent that was of this region, and yet held echoes of other places, other times. “You will attend me.” With that, she swept out of the room, her wings a rich, deep brown shot with glittering streaks that echoed the color of her eyes. Arching over her shoulders and stroking down to caress the gleaming wood of the floor, those wings were the only things in his vision as he turned to follow.</p><p>The exquisite shade of her wings spoke not of the cold viciousness of a dark court, but of the solid calm of the earth and the trees. That much, at least, wasn’t false advertising. Nimra’s home was not what he’d been expecting. A sprawling and graceful old lady with soaring ceilings situated on an extensive estate about an hour out of New Orleans, it had a multitude of windows as well as balconies ringing every level. Most had no railing— as befitted the home of a being with wings. The roof, too, had been built with an angel in mind. It sloped, but not at an acute angle, not enough to make it dangerous for landings.</p><p>However, notwithstanding the beauty of the house, it was the gardens that made the place. Cascading with blooms both exotic and ordinary, and full of trees gnarled with age alongside newly budding plants, those gardens whispered of peace... the kind of place where a broken man might sit, try to find himself again. Except, Noel thought as he followed Nimra up a flight of stairs, he was fairly certain that what he’d lost when he’d been ambushed and then debased until his face was unrecognizable, his body so much meat, was gone forever.</p> <p>Nimra halted in front of a pair of large wooden doors carved with a filigree of jasmine in bloom, shooting him an expectant look over her shoulder when he stopped behind her. “The doors,” she said with what he was certain was a thread of amusement in that voice kissed by the music of the bayou.</p><p>Taking care not to brush her wings, he walked around to pull one open. “I apologize.” The words came out harsh, his throat unaccustomed to speech these days. “I’m not used to being a—” He cut himself off in midsentence, having no idea what to call himself.</p><p>“Come.” Nimra continued to walk down the corridor lined with windows that bathed the varnished floors in the molten, languid sunlight of this place that held both the bold, brazen beauty of New Orleans as well as an older, quieter elegance. Each windowsill was set with earth- toned pots that overflowed with the most cheerful, unexpected bursts of color— pansies and wildflowers, daisies and chrysanthemums.</p><p>Noel found himself fighting the desire to stroke their petals, feel the velvet softness against his skin. It was an unexpected urge, and it made him pull back, tug his shields even tighter around himself. He couldn’t afford to be vulnerable here, in this court where he’d been sent to rot— it wasn’t a stretch to believe that everyone was waiting for him to give up on life and complete what his attackers had begun.</p><p>His jaw set in a brutal line just as Nimra spoke again. While her tone was rough silk— the kind that spoke of secrets in the bedroom and pleasure that could turn to pain— her words were pragmatic. “We will talk in my chambers.”</p><p>Those chambers lay beyond another set of wooden doors, these painted with images of exotic birds flitting through blossom- heavy trees. Feminine and pretty, there was nothing in the images that spoke of the hardness that was part of Nimra’s reputation, but if Noel knew one thing after his more than two centuries of existence, it was that any being who had lived more than half a millennium had long learned to hide what she didn’t wish to show.</p><p>His guard up, he walked in behind her, closing the painted doors quietly at his back. He didn’t know what he’d expected, but it wasn’t the graceful white furniture scattered with jewel- toned cushions, the liquid sunlight pouring in through the open French doors, the well- read books set on an end table. The plants, however, were no longer a surprise, and they gave him a sense of freedom even as he stood stifled and imprisoned by his broken self, his pledge of service to Raphael, and thus to Nimra.</p><p>Walking to the French doors, Nimra closed them, shutting out the world before she turned to face him once more. “We will speak in privacy.”</p> <p>Noel gave a stiff nod, another thought cutting through his mind with punishing suddenness. Some of the angelic race, old and jaded, found pleasure in taking lovers they could control, treating those lovers like... fresh meat, to be used and then discarded. He would never be that, and if Nimra expected it of him...</p><p>He was a vampire, an almost- immortal who’d had more than two hundred years to grow into his power. She might kill him, but he’d draw blood before it was over. “What would you have of me?”</p><p>Nimra heard the menace beneath the outwardly polite question and wondered who exactly Raphael had sent her. She’d made some quiet inquiries of a scholar she knew in the Refuge, had learned of the horrific assault Noel had survived, but the man himself remained a mystery. When she’d asked Raphael to tell her more than the bare facts about the vampire he was assigning to her court, he’d said only, “He is loyal and highly capable. He is what you need.”</p><p>What the archangel had not said was that Noel had eyes of a piercing ice blue filled with so many shadows she could almost touch them, and a face that was hewn out of roughest stone. Not a beautiful man— no, he was too harshly put together for that—but one who would never want for female attention; he was so very, very male. From the hard set of his jaw to the deep brown of his hair, to the muscular strength of his body, he drew the eye... much as a mountain lion did.</p><p>Dressed in blue jeans and a white T–shirt, utterly unlike the formal clothing favored by the other men in her court, he’d nonetheless overshadowed them with the silent intensity of his presence. Now he threatened to take over her rooms, his masculine energy a stark counterpoint to the femininity of the furnishings.</p><p>It annoyed her that this vampire of not much more than two hundred could inspire such feelings in her, an angel who demanded respect from those twice her age and who had the trust of an archangel. Which was why she said, “Would you give me anything I asked?” in a tone laced with power.</p><p>White lines bracketed his lips. “I’ll be no one’s slave.”</p><p>Nimra blinked, realization swift and dark. It did her vanity no good to see that he believed she had to force her lovers, but she knew enough of her own kind to understand the thought wasn’t unwarranted. However, the fact that it had been the first one in his mind... No, she thought, surely Raphael would have warned her if Noel had been misused in that way. Then again, the archangel who held enough power in his body to level cities and burn empires was a law unto himself. She could assume nothing.</p><p>“Slavery,” she said, turning to another set of doors, “offers no challenges. I have never understood the allure.”</p><p>As he followed at her back, she had the sense of having a great beast on a leash— and that beast wasn’t at all happy with the situation. Intriguing, even if it did prick at her temper that there was so much power in him, this vampire Raphael had sent in response to her request. That, of course, was the crux of it— Noel was Raphael’s man, and Raphael did not suffer the weak. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Once inside the chamber, she nodded at him to close the door behind himself. She wouldn’t have thought to take such measures even a month ago, she’d had such trust in her people. Now... The pain was one she’d had to live with for the past fourteen days, and it had become no easier to bear in that time.</p><p>Walking past the smooth and well- loved wooden desk situated beside the large window, a place where she often sat to write her personal correspondence, she lifted her hands to unlock the upper doors of the armoire against the wall. The curling tendrils of a fine fern brushed the backs of her hands, a whispered caress as she revealed— set into the back wall of the armoire— the door to what appeared to be a simple safe, but one no burglar would ever be able to crack.</p><p>Retrieving a tiny vial half- filled with a luminescent fluid from within, she turned and said, “Do you know what this is?” to the man who stood immobile as stone several feet from her.</p> <p>A shuttered expression but there was no discounting the intelligence in that penetrating gaze. “I haven’t seen anything like it before.”</p><p>So beautiful, she thought, watching the colors tumble and foam within the vial when she tilted it to the light, the crystal itself etched only with a simple sigil, signifying her name, and thin, decorative lines in fine gold. “That is because this fluid is beyond rare,” she murmured, “created from the extract of a plant found in the deepest, most impenetrable part of Borneo’s rain forests.” Closing the distance between them, she held it out toward him.</p><p>The vial looked ridiculously small in his big hand, a toy stolen from a crying child. Lifting it to his eyes, he tilted it with care. The fluid spread on the crystal, making the surface glow. “What is it?”</p><p>“Midnight.” Taking the vial when he returned it, she placed it on her writing desk. “A hint of it will kill a human, a fraction more will place a vampire into a coma, and a quarter of an ounce is enough to ensure most angels of less than eight hundred will not wake for ten long hours.”</p><p>Noel’s gaze crashed into hers. “So your intended victim doesn’t stand the smallest chance.”</p> <p>She was unsurprised by his conclusion— it was nothing less than could be expected, given her reputation. “I have had this for three hundred years. It was gifted to me by a friend who thought I might one day have need of it.” Her lips lifted at the corners at the thought of the angel who had given her this most lethal of weapons— as a human older brother might give his sister a knife or a gun. “He has ever seen me as fragile.”</p><p>Noel thought this friend couldn’t know her well. Nimra might look as if she’d break under the slightest pressure, but she didn’t hold Louisiana against all the other powers in the wider region, including the brutal Nazarach, by being a wilting lily. Not being as blind, he never took his eyes off her, even when she picked up the vial and returned it to the safe, her wings so exquisite and inviting in front of him.</p><p>Their tactile beauty was a trap, a lure to the unwary to drop their guard. Noel had never been that innocent— and after the events in the Refuge... If there had been any innocence left in him, it was long dead.</p><p>“Two weeks ago,” Nimra murmured, closing the armoire doors and turning to face him once more, “someone attempted to use Midnight on me.”</p><p>CHAPTER 2</p><p>Noel sucked in a breath. “Did they succeed?”</p> <p>The relief that rushed through him when she shook her head was a ravaging storm. He’d been helpless in the Refuge, bound and trapped as pieces of glass and metal were shoved into his very flesh until that flesh grew over it, trapping the excruciating shards of pain— and though he had no loyalty to Nimra except through his ties to Raphael, he didn’t want to think of her with her spirit broken and her wings crumpled. “How did you escape?”</p><p>“The poison was placed into a glass of iced tea,” she said, shifting to touch her finger to the glossy leaf of a plant by the writing desk. “It is tasteless and colorless once blended with any other liquid, so I wouldn’t have noticed it, had no reason to consider that anything in my home might be unsafe for me. But I had a cat, Queen.” Her breath caught for a fragment of a second, sharp and brittle. “She jumped up onto the table when I wasn’t watching and sipped at the drink. She was dead before I even had a chance to scold her for her misbehavior.”</p><p>Noel knew the sorrow that marked Nimra’s face was, in all probability, an attempt to manipulate his emotions, but still he found himself liking her better for being saddened by the death of her pet. “I’m sorry.”</p><p>A slight incline of her head, a regal acknowledgment. “I had the tea tested without alerting anyone in this court, discovered it held Midnight.” Smooth honey brown skin stretched tight over the line of her jaw. “If the assassin had succeeded, I would have been insensible for hours— and those who knew of my incapacitated state could have come in and ensured full death.”</p><p>Angels were as close to immortal as was possible in this world. The only beings more powerful were the Cadre of Ten, the archangels who ruled the world. Unless they pissed off one of the Cadre, death wasn’t something angels had to worry about except in very limited circumstances— depending on the years they’d lived and their inherent power.</p><p>Noel didn’t know Nimra’s level of power but he knew that if someone were to decapitate a strong angel, remove his or her organs, including the brain, then burn everything, it was unlikely the angel would survive. Unlikely but not impossible. Noel had no way of knowing the truth of it, but it was said angels of a certain age and strength could regenerate from the ashes of a normal fire.</p><p>“Or worse,” he added softly, because while death might be the ultimate goal, many of the oldest immortals lived only for the pain and suffering of others, as if their capacity for gentler emotions had been corroded away long ago. He could well imagine what someone like Nazarach would do to Nimra if he had her alone and vulnerable.</p><p>“Yes.” She turned to the windows beyond that little writing desk— formed with a daintiness that would crumble under one of Noel’s fists— her gaze on the wild beauty of the gardens below. “Only those who are trusted enough to be in my inner court, and carefully vetted servants, are ever anywhere near my food.</p> <p>“Because of this act of treachery, I can no longer trust men and women who have been with me for decades, if not centuries.” Calm, tempered words sliced with anger. “Midnight is near impossible to acquire, even for angels— which means the one who betrayed me is working in the service of someone who holds considerable power.”</p><p>Noel felt a spark within him, one he’d thought had been extinguished in that blood- soaked room where his abductors had brutalized him for no reason except that it gave them a twisted kind of pleasure. They might have justified the act by calling it a political ploy, but he’d heard their laughter, felt the black that stained their souls. “Why are you telling me this?”</p><p>An arch look over her shoulder. “I do not need a slave, Noel”—his name carried a slight French emphasis that turned it into something exotic—“but I do need someone whose loyalty is beyond question. Raphael says you are that man.”</p><p>He had not been cast aside after all.</p><p>It was a shock to the system, a jolt that brought him to life when he’d been the walking dead for so long. “You’re certain it’s one of your people?” he asked, his blood pumping in hard pulses through his veins.</p><p>Her answer was oblique and it held a quiet, thrumming anger. “There were no strangers in my home the day the Midnight was used.” Her wings flared out, blocking the light as she continued to focus beyond the windows. “They are mine, but one has been tainted.”</p><p>“You’re six hundred years old,” Noel said, knowing she saw nothing of the gardens at that instant. “You can force them to speak the truth.”</p><p>“I cannot bend wills,” she said, surprising him with the straight answer. “That has never been one of my gifts— and torturing my entire court to unearth one traitor seems a trifle extreme.”</p><p>He thought he heard a dark amusement beneath the anger, but with her face turned to the window, her profile shadowed by the tumble of those blue- black curls, he couldn’t tell for sure. “Do they know why I’m here?”</p><p>Shaking her head, Nimra turned to him once more, her expression betraying nothing, the flawless mask of an immortal. “It is probable they believe the very thing you did— that Raphael has sent you to me because you are broken and I need a toy.” A lifted eyebrow.</p><p>He felt as if he’d been called to the carpet. “My apologies, Lady Nimra.”</p><p>“Do attempt to sound a fraction more sincere”—a cool order—“or this deception will fail miserably.”</p><p>“I’m afraid I’ll never be able to pull off being a poodle.”</p><p>To his shock, she laughed, the sound a husky feminine stroke across his senses. “Very well,” she said, eyes glittering with gemstone brightness in the sunlight. “You may be a wolf on a long leash.”</p><p>Noel was startled to feel a different kind of heat within him, a slow- burning ember, dark and potent. Since waking in the Medica, his body destroyed, he’d felt no desire, had thought that part of him dead. But Nimra’s laugh made his body stir enough that he noticed. It was tempting to follow that flicker of heat, to hold the ember up to the light of day, but he didn’t allow her laugh or the exquisite caress of her femininity to wipe the truth from his mind— that the angel with the jewel- dusted wings was deadly. And that while she might be in the right in this particular game, she was no innocent.</p><p>He heard screams that night. The nightmare always surprised him, though he’d been having it since he opened his eyes in the Medica after the assault. Because the fact was, he’d lost the ability to scream several hours into the torture, remaining conscious only because his attackers had made it a point to never cross that fine line. Broken bones, torn flesh, excruciating burns— vampires could take a lot of damage without the escape of the cold dark of unconsciousness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He didn’t remember screaming even at the start, determined not to give in, but he must have— for the echo of it haunted his dreams. Or perhaps the screams rang inside his mind because that was the sole place he’d had that had been his own, his strength, his dignity stripped from him with malicious force.</p><p>Throwing off the sweat- soaked sheets as he shoved away the memories, he got out of bed and walked to the window he’d left open to the honeysuckle- scented air. The heavy warmth of it stroked over his cheeks, fingered its way through his hair, but did nothing to cool his overheated flesh. Still, he lingered, staring out into the inky dark of the night and the slumbering silhouettes of the gardens and trees that sprawled out in every direction.</p><p>It was perhaps twenty minutes later, right when he was about to turn away, that he glimpsed wings. They weren’t Nimra’s. Frowning, he angled himself so as to be invisible from the ground and watched. The angel appeared out of the shadows a minute later and stopped, his face lifted up toward Nimra’s window— a long, motionless moment— before he carried on.</p> <p>Interesting.</p><p>Pushing away from the window when there was no further movement, Noel walked into the shower, realizing he’d glimpsed the tall male in the audience chamber earlier. The angel had stood on Nimra’s right as she dealt with a number of important petitions, so there was no doubting the fact that he was one of her inner circle. Noel intended to find out everything else about him later today.</p><p>It was still dark when he walked out of the shower, but he knew there was no point in attempting to sleep now— and as a vampire, he could go without sleep for long periods. Part of him didn’t know why he even tried to find such rest. Even on the nights when he didn’t hear the screams, he heard the laughter.</p><p>Nimra walked out into the gardens the next morning to find that Noel had beaten her to the dawn. He sat on a wrought- iron bench beneath the branches of an old cypress, his eyes on the clear waters of the stream that snaked through her lands before joining a wider tributary that led into the bayou. He was so motionless, he appeared carved from the same stone as the silken moss- covered rocks that guarded the waterway.</p><p>She stepped quietly, intending to take the path that would skirt away from him, for she understood the value of silence, but he lifted his head at that instant. Even with the distance between them, she was caught by the wintry blue of those eyes—eyes she knew had been destroyed in the attack at the Refuge, his face beaten in with such viciousness he’d been recognized only because of a ring worn on a shattered finger.</p> <p>Anger, cold and dangerous, slid through her veins, but she kept her tone easy. “Bonjour, Noel.” Her wings brushed the curling white and pink flowers of the wild azalea bushes on either side of her, and the dew showered a welcome caress on her feathers.</p><p>He rose to his feet, a big man who moved with predatory grace. “You wake early, Lady Nimra.”</p><p>And you, Nimra thought, do not sleep. “Walk with me.”</p><p>“A command?”</p><p>Definitely a wolf. “A request.”</p><p>He fell into step beside her, and they walked in silence through the rows of flowers nodding sleepily in the hazy early-morning light, their petals seeking the red- orange rays of the rising sun. It was her habit to spread her wings when she was outdoors thus, but she kept them folded today, maintaining a small distance between her and this vampire who was so very contained, she couldn’t help but wonder what lay beneath the surface.</p> <p>A plaintive meow had her bending to look under the hedgerow. “There you are, Mimosa.” She plucked the elderly cat out from under the dark green shade of a plant dotted with bursts of tiny yellow flowers. “What are you doing awake and about so very early?” The gray cat, her fur sprinkled with white, nuzzled at her chin before settling down in her arms for another nap.</p><p>She was aware of Noel glancing at her as she stroked her hand over Mimosa’s fur, but said nothing. Like a wounded animal, he would not react well to pressure. He would have to come to her— if he ever did— in his own time, at his own pace.</p><p>“Those tufted ears,” he said at last, looking at the comical puffs that tipped Mimosa’s otherwise neat head. “That’s why you call her Mimosa.”</p><p>It made her smile that he’d guessed. “Yes— and because the first time I saw her, she was standing near a mimosa plant, snapping her paw out at the leaves, then jumping back as they closed.” In the process, she’d managed to get several of the fluffy dandelion- like flowers on her head, a tiny crown.</p><p>“How many pets do you have?”</p><p>She rubbed Mimosa’s back, felt the old cat purr against her ribs. “Just Mimosa now. She misses Queen, though Queen used to tire her out with her antics, she was so young.”</p><p>Noel wasn’t used to seeing angels acting in any way human. Yet Nimra, her arms full of that ancient feline, appeared very much so. “Would you like me to hold her?”</p><p>“No. Mimosa weighs far less than she should— it’s only her fur that makes her appear so.” Her face was solemn in the hushed secrecy of dawn. “Grief has put her off her food, and she has lived so many years already...”</p> <p>It was instinct to reach out, to rub his finger along the top of the cat’s head. “She’s been with you a long time.”</p><p>“Two decades,” Nimra said. “I don’t know where she came from. She looked up from her game with the mimosa plant that day and decided I was hers.” A slow smile that blew the embers within him to darker, hotter life. “She has ever accompanied me on my morning walks since then, though now the cold bothers her.”</p><p>The gentle care in those words went against everything he’d heard of Nimra. She was feared by vampires and angels across the country. Even the most aggressive angels stayed clear of Nimra’s territory— when to all outward appearances, her powers were nothing compared to many of theirs. Which made Noel wonder exactly how much of what he saw before him was the truth, and how much a well- practiced illusion.</p><p>She lifted her head at that moment and the soft gold of the rising sun touched her face, lit up those topaz eyes, so bright and luminous. “This is my favorite time of day, when everything is still full of promise.”</p><p>Around him, the gardens began to stir to life as the sky became ablaze with streaks of deep orange and a pink so dark it was almost crimson, and in front of him stood a beautiful woman with wings of jewel- dusted brown. A man could surrender to such a moment... but the very strength of that allure made him take a step back, remind himself of the cold, hard facts behind his presence here. “Is there anyone you suspect of being the traitor?”</p><p>Nimra didn’t protest the sudden change in the direction of the conversation. “I cannot bring myself to suspect any of my own of such an act.” Her hand moved over the slumbering cat in her arms, slow and with an endless patience. “It is worse than a knife in the dark, for at least then I would have a shadow to focus on. This... I do not like it, Noel.”</p><p>Something about the way she said his name curled around him, a subtle magic that had his shields slamming shut. Perhaps this was Nimra’s power— the ability to entice people into believing whatever she wished them to believe. The idea of it made his jaw go tight, every cell in his body on alert for the danger he was certain lurked behind the delicate bones of that exquisite face.</p><p>As if she’d heard his thoughts, she shook her head. “Such mistrust.” It was a murmur. “Such age in your eyes, as if you have lived far more centuries than I know you to have done.”</p><p>Noel said nothing.</p><p>Soft ebony curls glimmered with deepest blue in the dawn sunlight as she continued to pet Mimosa. “I will formally introduce you to my people this—”</p><p>“I’d prefer to meet them on my own.”</p><p>One eyebrow rose at the interruption, the first hint of true arrogance he’d seen. It was strangely comforting. Angels of Nimra’s age and strength were used to power, used to being in control. He’d have been more suspicious if she’d taken the interruption and disagreement with the unruffled tranquillity she’d shown to date.</p><p>“Why?” The demand of an immortal who held a territory in an iron grip.</p><p>But Noel had found his way again after months in the impenetrable darkness, would allow no one to push him off course. “If there is a traitor, it makes no sense to alienate your entire court,” he reminded her. “Which will happen very quickly if you make it a point to introduce your new... amusement to them all.”</p><p>She continued to watch him with eyes full of power.</p><p>Perhaps other men might’ve been intimidated, but, illusion or truth, Noel was fascinated by the layers of her. “Are your people truly dim enough,” he said, “to accept that story once you make it clear I have value to you?”</p><p>Nimra’s hand stilled on her pet’s fur. “Take care, Noel,” she said in a quiet voice that hummed with the reality of the strength contained within her small frame. “I have not held this land by allowing anyone to walk over me.”</p><p>“That,” he said, holding a gaze gone stormy with warning, “is not something I ever doubted.” Never did he forget that behind her delicate build and feminine beauty lay an immortal who was said to be so cruel that she caused bone- chilling terror in even those of her own kind.</p><p>CHAPTER 3</p><p>The first person Noel met when he stepped into the huge room at the front of the house was a tall, dark- eyed, dark- haired angel who had the look of arrogance Noel associated with angels beyond a certain level of power— but with an edge of condescension thrown in for flavor. “Christian,” the angel said, his wings a soft white with a few sharp threads of black... the same wings Noel had seen from his bedroom window earlier that morning.</p><p>Nodding, he said, “Noel,” and held out his hand.</p><p>Christian ignored it. “You’re new to the court.” A smile as serrated as a saw blade. “I hear you come to us from the Refuge.”</p><p>Noel didn’t miss the unspoken message— Christian knew what had been done to him, and the angel would use that knowledge to twist the knife deeper when he wished. “Yes.” He smiled, as if he hadn’t caught either the warning, or the implicit threat. “Nimra’s court isn’t what I expected.” There was no overt opulence, no miasma of fear. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Don’t be taken in,” Christian said, his eyes as hard as diamonds though his facade of arctic politeness never slipped. “There is a reason the others fear her teeth.”</p><p>Noel rocked back lazily on his heels. “Been bitten?”</p><p>The angel’s wings spread a fraction, then snapped tight. “Insolence will only be tolerated so long as you warm her bed.”</p> <p>“Then I better warm it for a long time.” Noel shot him a cocky grin, figuring he might as well play the part to the hilt.</p><p>“Is Christian giving you a hard time?” The question came from a long- legged female dressed in a tight black knee- length skirt and white shirt that flattered a slender figure with graceful curves. Paired with those legs and uptilted eyes of a deep, impossible turquoise against sun- golden skin, it made her a stunner. Not an angel, but a vampire old enough that immortality had worked its magic on what had surely been a spectacular canvas to begin with.</p><p>Noel deepened his smile in response to her flirtatious wink. “I think I can handle Christian,” he said, holding out his hand once again. “I’m Noel.”</p><p>“Asirani.” Her fingers closed over his own. He allowed it but he felt nothing. He’d felt nothing ever since he’d been taken... except for that odd, unexpected ember of sensation stirred awake by Nimra’s laugh.</p><p>Releasing Asirani’s hand, he looked from the vampire to the angel. “So, tell me about this court.”</p> <p>Christian ignored him, while Asirani twined an arm through his own and led him across the huge central room that appeared to function as the audience chamber when necessary, but was otherwise the center of the court. “Have you eaten?” Thick black lashes lifted, turquoise eyes looking meaningfully into his.</p><p>“I’m afraid Lady Nimra doesn’t like to share,” he murmured, thinking of the sealed bags of blood that had been left in the small fridge in his room. “I thank you for the offer.” Whatever her motive, it had been a considerate question.</p><p>Fact was, taking blood from a human or vampiric donor wasn’t something he’d had any inclination to do since waking from the assault. The head healer at the Medica, Keir, had been very good about providing him with stored blood without question. Maybe Nimra’s courtesy, too, was as a result of Keir’s influence. The healer seemed to command a great deal of respect from angelkind— even the archangels themselves.</p><p>“Hmm.” Asirani squeezed his arm, her fingers brushing his biceps. “You are a surprising choice.”</p><p>“Am I?”</p><p>A throaty laugh. “Ah, cleverer than you look, aren’t you?” Eyes dancing, she stopped beside a window, her face to the room. “Nimra,” she said in a low tone, “has not taken a lover for many years. Christian always believed that when she chose to break her fast, it would be with him.”</p> <p>Noel glanced over at the angel, who was now talking to an older human male, and found himself wondering why Nimra hadn’t invited Christian to her bed. In spite of the appearance he gave of being a stuffy aristocrat, the man was clearly sharply intelligent, and he moved in a way that said he’d had training in how to fight. No useless fop, but an asset.</p><p>As Asirani was no vacant hanger–on.</p><p>“Do you all live here?” he asked her, intrigued that this court appeared to be made up of the strong.</p><p>“Some of us have rooms here, but Nimra maintains a wing that is hers alone.” Leading him to the long table set with food to the side of the room, she released his arm to pluck a plump grape from an assortment of fruit and pop it into her mouth. Though vampires couldn’t gain the nourishment they needed from food, they could digest and appreciate the taste— Asirani’s hum of pleasure made it plain she enjoyed utilizing every one of her senses.</p><p>Noel had no interest in such sensuality, but he was moving to pick up a couple of blueberries so as not to stand out, when the hairs rose on the back of his neck. Not fear, but an instinctive, primal awareness. He wasn’t the least surprised to turn around to discover that Nimra had entered the room. The others receded from his consciousness, his eyes locking with the power and intensity of her own.</p><p>“Excuse me,” he murmured to Asirani, crossing the gleaming wood of the floor to come to a halt in front of the angel who was proving to be an irresistible enigma. “My lady.”</p><p>Her gaze was impenetrable. “I see you have met Asirani.”</p><p>“And Christian.”</p> <p>A slight tightening of her mouth. “I do not think you have met Fen. Come.”</p><p>She led him toward the elderly human man Noel had seen with Christian. He sat surrounded by papers at a desk in a sun- drenched corner of the room. As they neared him, it became clear the man was even older than Noel had first guessed, his nut- brown skin lined with countless wrinkles. Yet his eyes were dark little pebbles, shiny with life, his lips mobile. They lifted in a smile as Nimra got closer, and Noel realized the man’s eyesight was deteriorating in spite of the flashing brightness of his gaze.</p><p>Nimra stopped him with a hand on his shoulder when he began to struggle to his feet. “How many times must I tell you, Fen? You’ve earned the right to sit in my presence.” A smile so vibrant, it cut at Noel’s heart. “In fact, you’ve earned the right to dance naked in my presence should you so wish.”</p><p>The old man laughed, his voice cracked with age. “That would be a sight, eh, my lady?” Squeezing her hand, he looked up at Noel. “Have you let a man make an honest woman of you at last?”</p><p>Leaning forward, Nimra kissed Fen on both cheeks, her wings brushing inadvertently against Noel. “You are my only love, you know that.”</p><p>Fen’s laughter segued into a deep smile, his fingers lighting on Nimra’s cheek before dropping to the desk once more. “I am a blessed man indeed.”</p><p>Noel could almost feel the history that ran between the two of them, but no matter their words, there was nothing loverlike in that richness of memory. There was instead an almost father- daughter element to it, in spite of the fact that Nimra remained immortally young, while the march of time had caught up with Fen.</p><p>Rising to her full height, Nimra said, “This is Noel,” before returning her attention to Fen. “He is my guest.”</p><p>“Is that what they’re calling it these days?” Twinkling eyes shifted to give Noel a closer inspection. “He isn’t as pretty as Christian.”</p><p>“Somehow,” Noel muttered, “I think I’ll survive.”</p><p>The riposte caused Fen to laugh in that hacking old- man way. “I like this one, Nimra. You should keep him.”</p><p>“We shall see,” Nimra said, a tart bite to her words. “As we both know, people are not always who they appear to be.”</p><p>Something unseen passed between the angel and the aged human at that instant, with Fen raising Nimra’s hand to his lips and pressing a kiss to the back. “Sometimes, they are more.” Fen’s eyes lifted for a bare instant to snap across Noel’s and he had the feeling the words were meant for him rather than the angel whose hand Fen still held.</p><p>Then Asirani click- clacked into his vision on sky- high heels and the moment broke. “My lady,” the vampire said to Nimra, “Augustus is here and insisting he speak with you.”</p><p>Nimra’s expression turned dark. “He’s beginning to try my patience.” Folding back her wings tight to her spine, she nodded good- bye to Fen and strode off without a word to Noel, Asirani by her side.</p><p>Fen nudged at Noel with a cane he hadn’t seen until that moment. “Perhaps not quite what you expected, eh?”</p><p>Noel raised an eyebrow. “If you mean the arrogance, I’m well versed in it. I worked with Raphael’s Seven.” The vampires and angels in service to the archangel were powerful immortals in their own right. Dmitri, the leader of the Seven, was stronger than a large number of angels; he could take and hold a territory if he so chose.</p><p>“But,” Fen insisted, lips curved in a shrewd smile, “have you experienced it in a woman? In a lover?”</p><p>“Blindness has never been one of my faults.” The bitter irony of his words made him laugh within. After the assault, he hadn’t even had eyes for the days it had taken his flesh to regenerate. “It’s not yours, either, though it looks to me as if you prefer to give the appearance of it.” He’d seen the way the old man’s gaze had turned dull when Asirani neared.</p><p>“Smart, too.” Fen waved him to a chair across from his own. Taking it, Noel braced his forearm on the gleaming cherrywood of the desk and looked out at the vast main area. Christian was deep in conversation with another woman, a curvaceous beauty with long, straight hair to the base of her spine and the most guileless face Noel had ever seen. “Who’s that?” he asked, having guessed what role Fen played in Nimra’s court.</p><p>The old man’s expression softened to utter tenderness. “My daughter, Amariyah.” Smiling at her when she turned to wave at him, he sighed. “She was Made at twenty- seven. It does my heart good to know that she’ll live on long after I’m gone.”</p><p>Vampirism did turn humans into almost- immortals, but the life was hardly an easy one, especially the first hundred years after the Making, when the vampire was in service to an angel. The century- long Contract was the price the angels demanded for the gift of being able to live long past the span of a mortal life. “How much of her Contract remains?”</p><p>“None,” Fen said, to Noel’s surprise.</p><p>“Unless you had her before you were born,” Noel said, continuing to watch Amariyah and Christian, “that’s impossible.”</p><p>“Even I’m not that efficient.” A phlegmy laugh. “I’ve been in service to Nimra since I was a lad of but twenty. Mariyah was born a year later. Been some sixty- five years that I’ve served my lady— the Contract was written to take that into account.”</p><p>Noel had never heard of such a concession. That the angel who ruled New Orleans and its surrounds had done this said a great deal about both Fen’s worth to her, and her own capacity for loyalty. It wasn’t a trait he’d expected to find in an angel known far and wide for the harshness of her punishments. “Your daughter is beautiful,” he said, but his mind was on another woman, one with wings that had lain so warm and heavy against him for a fleeting moment earlier. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Fen sighed. “Yes, too beautiful. And too sweet a soul. I wouldn’t have permitted her to be Made if Nimra hadn’t vowed to care for her.”</p><p>Amariyah broke off her conversation at that instant to walk over. “Papa,” she said and, unlike the echoes of another continent that flavored her father’s speech, the bayou ran dark and languid in her voice, “you did not eat your breakfast today. Do you think you can fool your Amariyah?”</p><p>“Ach, girl. You’re embarrassing me in front of my new friend.”</p> <p>Amariyah held out her hand. “Good morning, Noel. You are quite the topic of conversation in this court.”</p><p>Shaking that hand, with its skin several shades lighter than her father’s, Noel gave what he hoped was an easy smile. “All good, I’m sure.”</p><p>Fen’s daughter shook her head, the dimples that dented her cheeks making her appear even more innocent. “I’m afraid not. Christian is, as my grandmother would’ve said, ‘very put out.’ Excuse me a moment.” Bustling over to the sideboard, she filled a plate before returning. “You will eat, Papa, or I will tell Lady Nimra.”</p><p>Fen grumbled but Noel could see he was pleased at the attention. Rising, Noel waved a hand at his seat. “I think your father would prefer your company to mine.”</p><p>Amariyah dimpled again. “Thank you, Noel. If you need anything in the court, let me know.” Walking with him a few steps, she smiled again, and this time there was nothing guileless about it. “My father likes to see me as an innocent,” she murmured in a low voice, “and so I am one for him. But I am a woman grown.” With that unsubtle message, she was gone.</p> <p>Frowning, Noel went to leave the audience chamber, skirting a young maid walking in with a fresh carafe of coffee. Then again... Turning, he walked back to snag a cup off a small side table. “May I beg a cup?” he asked, making sure to keep his voice gentle.</p><p>Her cheeks colored a pretty red, but she poured for him with steady hands.</p><p>“Thank you.”</p><p>Nodding, she dropped her head and headed to the main table, placing the carafe on the surface. No one paid her any mind, and— their potential complicity in the attempted assassination aside— it made Noel wonder just how much the servants heard, how much they remembered.</p><p>Nimra stared at Augustus across the length of the small formal library where she handled her day–to–day affairs. “You know I won’t change my mind,” she said, “and still you insist.”</p><p>The big man, his skin a gleaming dark mahogany, snapped out wings of a deep russet streaked with white, his arms folded across his massive chest. “You are a woman, Nimra,” he boomed. “It’s unnatural that you should be this alone.”</p> <p>Other female angels would’ve done something nasty to Augustus by now. Theirs was not a society where men alone held power. The most powerful of the archangels was Lijuan, and she was very much a woman. Or had been. No one knew what she’d become since her “evolution.”</p><p>It was Nimra’s cross to bear that Augustus was a childhood friend, less than two decades older than her. Nothing in the scheme of things, given the length of angelic lives. “Friendship,” she said to Augustus, “will only get you so far.”</p><p>The idiot male smiled that huge smile that always made her feel as if the sun had come out. “I would treat you as a queen.” Dropping his arms and folding back his wings, he moved across the room. “You know I am no Eitriel.”</p><p>Her heart pulsed into a hard knot of pain at the sound of that name. So many years now, and yet the bruise remained. She no longer missed Eitriel, but she missed what he’d stolen from her, hated the scars he’d left behind. “Be that as it may,” she said, stepping nimbly to the side when Augustus would have taken her into his arms, “my mind is made up. I have no wish to tie my life to a man’s again.”</p><p>“Then what am I?” came a rough male voice from the doorway. “A meaningless diversion?”</p><p>CHAPTER 4</p><p>Startled, Nimra looked up to meet the frigid blue gaze of a vampire who shouldn’t have been there.</p><p>“Who,” Augustus roared at the same time, “is he?!”</p> <p>“The man Nimra has chosen,” Noel said with what she knew was deliberate disrespect in his tone.</p><p>Augustus’s massive hands fisted. “I’m going to break your scrawny neck, bloodsucker.”</p><p>“Make sure you rip it off or I’ll regenerate,” Noel drawled back, settling his body into a combative stance.</p><p>“Enough.” Nimra had no idea what Noel thought he was doing, but they’d deal with that after she sorted out the problem of Augustus. “Noel is my guest,” she said to the other angel, “and so are you. If you can’t behave like a civilized being, the door is right there.”</p><p>Augustus actually growled at her, betraying the years he’d spent as a warrior in Titus’s court, conquering and pillaging. “I waited for you, and you throw me over for a pretty- boy vampire?”</p><p>Nimra knew she should have been angered but all she felt was an exasperated affection. “Do you really think I don’t know about the harem of dancing girls you keep in that castle of yours?”</p><p>He had the grace to bow his head a fraction. “None of them are you.”</p><p>“The past is past,” she whispered, placing a hand on his chest and rising up on tiptoe to press a kiss to his jaw. “Eitriel was a friend to us both, and he betrayed us both. You do not have to pay the penance.”</p><p>His arms came around her, solid and strong. “You are not penance, Nimra.”</p><p>“But I am not your lodestar, either.” She brushed a hand down the primaries of his right wing. It was a familiar caress, but not an intimate one. “Go home, Augustus. Your women will be pining for you.”</p><p>Grumbling, he glared at Noel. “Put a bruise on her heart and I’ll turn your entire body into a bruise.” With that, he was gone.</p><p>Noel stared after the angel until he disappeared from sight. “Who is Eitriel?”</p><p>Nimra’s gaze glittered with anger when it slammed into his. “That is none of your concern.” The door to the library banged shut in a display of cold temper. “You are here for one purpose only.”</p><p>Very carefully worded, Noel thought, watching as she walked to the sliding doors that led out into the gardens and pushed them open. Anyone listening would come to the obvious conclusion.</p><p>“As I said, Noel,” Nimra continued, “take care you do not go too far. I am not a maiden for you to protect.”</p><p>Stepping out into the gardens with her, he said nothing until they came to the edge of the stream that ran through her land, the water cool and clear. “No,” he agreed, knowing he’d crossed a line. Yet he couldn’t form an apology— because he wasn’t sorry he’d intervened. “You have an interesting court,” he said instead when he was certain they were alone, the scent of honeysuckle heavy in the air, though he couldn’t see any evidence of the vine.</p><p>“Do I?” Tone still touched with the frost of power, Nimra sat down on the same wrought- iron bench he’d used earlier, her wings spread out behind her, strands of topaz shimmering in the sunlight.</p><p>“Fen is your eyes and ears and has been for a long time,” he said, “while Amariyah was only Made because it soothes his heart to know that she’ll live even after he is gone.”</p><p>Nimra’s response had nothing to do with his conclusions. “Noel. Understand this. I can never appear weak.”</p><p>“Understood.” Weakness could get her killed. “However, there’s no weakness in having a wolf by your side.”</p><p>“So long as that wolf does not aspire to seize the reins.”</p><p>“This wolf has no such desire.” Going down on his haunches, he played a river- smoothed pebble over and through his fingers as he returned to the topic of Fen and Amariyah. “Are you always so kind to your court?”</p><p>“Fen has earned far more than he has ever asked,” Nimra said, wondering if Noel was truly capable of being her wolf without grasping for power. “I will miss him terribly when he is gone.” She could see she’d surprised Noel with her confession. Angels, especially those old and powerful enough to hold territories, were not meant to be creatures of emotion, of heart.</p><p>“Who will you miss when they are gone?” she asked, deeply curious about what lay behind the hard shield of his personality. “Do you have human acquaintances and friends?” She didn’t expect him to answer, so when he did, she had to hide her own surprise. Only decades of experience made that possible— Eitriel had left her with that, if nothing else.</p><p>“I was born on an English moor,” he said, his voice shifting to betray the faintest trace of an accent from times long gone.</p><p>She found it fascinating. “When were you Made?” she asked. “You were older.” Vampires did age, but so slowly that the changes were imperceptible. The lines of maturity on Noel’s face came from his human lifetime.</p><p>“Thirty- two,” he said, his eyes on a plump bumblebee as it buzzed over to the dewberry shrub heavy with fruit on Nimra’s right. “I thought I had another life in front of me, but when I found that road cut off, I decided what the hell, I might as well attempt to become a Candidate. I never expected to be chosen on the first attempt.”</p><p>Nimra angled her head, conscious that angels would’ve fought to claim him for their courts, this male with both strength and intelligence. “This other life, did it involve a woman?”</p><p>“Doesn’t it always?” There was no bitterness in his words. “She chose another, and I wanted no one else. After I was Made, I watched over her and her children, and somewhere along the way, I became a friend rather than a former lover. Her descendants call me Uncle. I mourn them when they pass.”</p><p>Nimra thought of the wild windswept beauty of the land where he’d been born, found it fit him to perfection. “Do they still live on the moors?”</p><p>A nod, his hair shining in the sunlight. “They are a proud lot, prouder yet of the land they call their own.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“And you?”</p><p>“The moor takes ahold of your soul,” he said, the rhythms of his homeland dark and rich in his voice. “I return when it calls to me.”</p><p>Compelled by the glimpse into his past, this complex man, she found her wings unfolding even farther, the Louisiana sun a warm caress across her feathers. “Why does your accent disappear in normal conversation?”</p> <p>A shrug. “I’ve spent many, many years away from the moors, but for visits here and there.” Dropping the stone, he rose to his feet, six feet plus of tall, muscled male with an expression that was suddenly all business. “Fen, Asirani, Christian, and Amariyah,” he said. “Are they the only ones who have access to you on that intimate a level?”</p><p>“There is one other,” she said, aware the moment was over. “Exeter is an angel who has been with me for over a century. He prefers to spend his time in his room in the western wing, going over his scholarly books.”</p><p>“Will he be at dinner?”</p><p>“I’ll ask him to attend.” It was difficult to think of sweet, absentminded Exeter wanting to cause her harm. “I cannot suspect him, but then, I cannot suspect any of them.”</p><p>“At present, there’s nothing that points to any one of them beyond the others, so no one can be eliminated.” Arms folded, he turned to face her. “Augustus—tell me about him.”</p> <p>“There’s nothing to tell.” Snapping her wings shut, she rose to her feet. “He is a friend who thinks he needs to be more, that I need him to be more. It has been handled.”</p><p>Noel could see that Nimra wasn’t used to being questioned or pushed. “I don’t think Augustus believes it has been handled.”</p><p>A cold- eyed smile. “As we discussed earlier,” she said, “such things are not in your purview.”</p><p>“On the contrary.” Closing the distance between them, he braced his hands on his hips. “Frustrated men do stupid and sometimes deadly things.”</p><p>A hint of a frown as she reached up to brush away a tiny white blossom that had fallen on her shoulder. “Not Augustus. He has always been a friend first.”</p><p>“No matter what you choose to believe, his feelings aren’t those of a friend.” Noel had glimpsed untrammeled rage on the big angel’s face when Augustus had first realized what Noel apparently was to Nimra.</p> <p>White lines bracketed Nimra’s mouth. “The point is moot. Augustus visits, but he wasn’t here when the Midnight was put into my tea.”</p><p>“You said certain servants are trusted with your food,” Noel pointed out, an exquisite, enticing scent twining through his veins, one that had nothing to do with the gardens. “Yet your focus is clearly on your inner court in the hunt for the traitor. Why?”</p><p>“The servants are human. Why would they chance the lethal punishment?” she asked with what appeared to be genuine puzzlement. “Their lives are already so short.”</p><p>“You’d be surprised what mortals will chance.” He thrust a hand through his hair to quell the urge to reach out, twist a blue- black curl around his finger. It continued to disquiet him, how easily she drew him when nothing had penetrated the numbness inside him for months— especially when he had yet to glimpse the nature of the power that was at the root of her reputation. “How many servants do I have to take into account?”</p><p>“Three,” Nimra informed him. “Violet, Sammi, and Richard.”</p><p>He made a mental note of the names, then asked, “What will you do today?”</p><p>Obviously still annoyed at him for daring to disagree with her, she shot him a look that was pure regal arrogance. “Again, it’s nothing you need to know.”</p><p>He was “only” two hundred and twenty- one years old, but he’d spent that time in the ranks of an archangel’s men, the past hundred years in the guard just below the Seven. He had his own arrogance. “It might not be,” he said, stepping close enough that she had to tip back her head to meet his gaze, something he knew she would not appreciate, “but I was being polite and civilized, trying to make conversation.”</p> <p>Nimra’s eyes narrowed a fraction. “I think you have never been polite and civilized. Stop making the effort— it’s ridiculous.”</p><p>The statement startled a laugh out of him, the sound rough and unused, his chest muscles stretching in a way they hadn’t done for a long time.</p><p>Nimra found herself taken aback by the impact of Noel’s laugh, by the way it transformed his face, lit up the blue of his eyes. It was a glimpse of who he’d been before the events at the Refuge— a man with a hint of wicked in his eyes and the ability to laugh at himself. So when he angled an elbow in invitation, she slipped her hand into the crook of it.</p><p>His body heat seeped through the thin fabric of the shirt he wore rolled up to his elbows, to touch her skin, his muscles fluid under her fingers as they walked. For a moment, she forgot that she was an angel four hundred years his senior, an angel someone wanted dead, and simply became a woman taking a walk with a handsome man who was beginning to fascinate her, rough edges and all.</p><p>Three days later, Noel had a very good idea of how the court functioned. Nimra was its undisputed center, but she was no prima donna. The word “court” was in fact a misnomer. This was no extravagant place with formal dinners every night and courtiers dressed up to impress, their primary tasks being to look pretty and kiss ass.</p><p>Nimra’s court was a highly functional unit, the capable skill of her men and women evident. Christian— who showed no sign of thawing to Noel’s presence— handled the day–to–day business affairs, including managing the investments that kept the court wealthy. He was assisted in certain tasks by Fen, though from what Noel had seen, it was more of a mentor- mentee relationship. Fen was passing the torch to Christian, who might’ve been older in years, but was younger in experience.</p><p>Asirani, by contrast, was Nimra’s social secretary. “She rejects the majority of the invitations,” the frustrated vampire said to him on the second day, “which makes my job very challenging.” However, the invitations— from other angels, high- level vampires, and humans eager to make contact with the ruling angel— continued to pour in, which meant Asirani was kept busy.</p><p>Exeter, the scholar, lived up to his reputation. An eccentric- appearing individual with tufts of dusty gray hair that stuck out in all directions and wings of an astonishing deep yellow stroked with copper, he seemed to spend his time with his head in the clouds. However, a closer look proved him to be a source of both advice and information for Nimra when it came to angelic politics. Fen, by contrast, had his finger on the pulse when it came to the vampiric and human populations.</p><p>It was only Amariyah who seemed to have no real position, aside from her care of her father. “Do you remain in this court because of Fen?” he asked her that night after a rare formal dinner, as they stood on the balcony under the silver light of a half- moon, the humid air tangled with the sounds of insects going about their business and a lush dark that was the bayou.</p><p>The other vampire sipped from a wineglass of bloodred liquid that sang to Noel’s own senses. But he’d fed earlier, and so the hunger was nothing urgent, simply a humming awareness of the potent taste of iron. Before, he would’ve ignored the glass in her hand to focus on the pulse in her neck, on her wrist, but the idea of putting his mouth to her skin, anyone’s skin, of having someone that close—it made his entire body burn cold, the hunger shutting down with harsh finality.</p><p>“No,” she said at last, flicking out her tongue to collect a drop of blood on her plump lower lip. “I owe Nimra my allegiance for the way I was Made, and while I have nothing to compare it to, the others say this is a good territory. I’ve heard stories of other courts that make the hairs rise on my arms.”</p><p>Noel knew those stories were more apt to be true than not. Many immortals were so inhuman that they considered humans and vampires nothing but toys for their amusement, ruling through a mix of bone- deep terror and sadistic pain. In contrast, while Nimra’s servants and courtiers treated her with utmost respect, there was no acrid touch of fear, no skittering nervousness.</p><p>And yet... No ruler who had even a vein of kindness within her could’ve held off challengers as brutal as Nazarach. It made him question the truth of everything he’d seen to date, wonder if he was being played by the most skillful of adversaries, an angel who’d had six centuries to learn her craft.</p><p>Amariyah took a step closer, too close. “You sense it, too, don’t you? The lies here.” A whisper. “The hints of truth concealed.” Her scent was deep and luxuriant, hotly sensual with no subtle undertones.</p><p>The bold scent suited the truth of her nature— all color and sex and beauty with no thought to future consequences. Young. He felt ancient in comparison. “I’m new to this court,” he said, though he was disturbed by her question, her implication. “I’m very aware of what I don’t know.”</p><p>A curve to her lips that held a vicious edge. “And you must of course please your mistress. Without her, you have no place here.”</p><p>“I’m no cipher,” Noel said, knowing that everyone here had to have investigated his background by now. Christian clearly had, though Noel didn’t think the angel would’ve shared what he’d dug up— there was a stiff kind of pride to Christian that said he was above gossip— but he wasn’t the only one with connections. The safest course would be to assume the entire inner court knew of his past— the good, and the ugly. “I can always return to my service in Raphael’s guard.”</p><p>Fingers brushing his jaw, warm and caressing. “Why did you leave it?”</p><p>He took a discreet step back, recoiling inwardly from the uninvited touch. “I completed my Contract over a century ago, but remained with Raphael because working for an archangel is exhilarating.” He’d seen and done incredible things, used every bit of his skill and intelligence to complete the tasks he’d been set. “But Nimra is... unique.” That, too, was true. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Amariyah’s tone tried for a false lightness but her bitterness was too deep to be hidden. “She’s an angel. Vampires are no match for their beauty and grace.”</p><p>“It depends on the vampire,” Noel said, turning to face the open balcony doors. His gaze caught on the tableau inside the main room— Asirani touching Christian’s arm in an invitation that was unmistakable. Dressed in a cheongsam of deepest indigo bordered with gold, her hair swept off her face, her vibrant beauty was a stunning counterpoint to Christian’s almost acetic elegance.</p><p>The angelic male leaned down to hear what it was she had to say, but he held himself with a severity that was unnatural, his mouth set in an unsmiling line.</p> <p>“Look at them,” Amariyah murmured, and he realized she’d followed his line of sight. “Asirani has ever tried to gain Christian’s affections, but she falls a poor second in comparison to Nimra.” Again, the words held hidden blades.</p><p>“Asirani is a stunning woman in her own right.” Noel watched as Christian tugged off the vampire’s hands with implacable gentleness and walked away. Asirani’s expression shut down, her spine a rod of steel.</p><p>Amariyah shrugged. “Shall we walk back inside?”</p><p>Noel had the feeling she’d expected far more support for her views than she’d received from him. “I think I’ll stay awhile longer.”</p><p>She left without a word, stalking into the main room in a flash of brilliant red that was the tight silk of her ankle- length dress, the fall of her coal black hair stroking over the lush curves of her body. He watched her walk up to Asirani, lay her hand on the other woman’s shoulder, squeeze. As she dipped her head to speak to the vampire, he sensed another feminine presence, this one a complex, mysterious orchid to Amariyah’s showy rose.</p> <p>CHAPTER 5</p><p>When he glanced over the balcony, it was to see Nimra walking arm in arm with Fen along an avenue of night- blooming flowers, the elderly man’s steps slow and awkward in comparison to her grace, his hand trembling on the cane. Yet the way Nimra compensated for his age and speed told Noel that this was something they did often, the angel with her wings of jewel- dusted brown, and the human man in the twilight of his life.</p><p>Compelled by the puzzle of her, Noel found himself walking down the steps to the garden to follow in their wake. An unexpected meow had him stopping on the last step and looking down into the dark, his vision more acute than a mortal’s. Mimosa lay under a bush full of tiny starlike flowers closed up for the night, her body quivering.</p><p>The intrepid cat hadn’t come to Noel in the days he’d been here, but tonight she stayed in place as he bent down and picked her up, holding her close to the warmth of his chest. “Are you cold, old girl?” he murmured, stroking her with one hand. When she continued to shiver, he opened up the buttons of his formal black shirt and put her against his skin. Dropping her head, she curled into him, her shivers starting to fade. “There you go.”</p><p>He continued to stroke her as he walked the way Fen and Nimra had disappeared. Mimosa was fragile under his hand, as fine boned as her mistress. It was strangely soothing to hold her, and for the first time in a long while, Noel thought back to the boy he’d been. He’d had a pet, too, a great old mutt who had followed Noel around with utter faithfulness until his body gave out. Noel had buried him on the moor, steeped the ground in his tears where no one could see him.</p><p>Mimosa stirred against his chest as he turned the corner, catching the scent of her mistress. Nimra was on the other side of the moon- silvered pond in front of him, her wings sweeping over the grass as she bent to check some drowsy blooms, the lazy wind shaping the dark blue of her gown to her body with a lover’s attention. Fen sat on a stone bench on this side, and the quiet patience with which he watched her held complete devotion.</p> <p>Not Fen, Noel decided. The old man had always been an unlikely conspirator in the plot to disable or kill Nimra, but the expression on his face this night destroyed even the faintest glimmer of suspicion. No man could look at a woman in such a way and then watch the light fade forever from her eyes. “Strength and heart and courage,” Fen said without turning around. “There is no other like her.”</p><p>“Yes.” Walking closer, Noel took a seat beside Fen, Mimosa purring against his skin. “I think,” he said, his gaze on the angel who even now tugged at things deep inside of him, “you need to send Amariyah from this court.”</p><p>A quiet sigh, a weathered hand clenching on the cane. “She has ever had a jealousy toward angels that I’ve never understood. She is a beautiful woman, a near- immortal, and yet all she sees are the things she can’t have, can’t do.”</p><p>Noel said nothing, because Fen spoke the truth. Amariyah might see herself as an adult, but she was a spoiled child in many ways.</p><p>“I sometimes think,” Fen continued, “I did her a disfavor by asking Nimra to take my years of service into account as part of my daughter’s Contract. A century of service might have taught her to value what she is— for the angels value it.”</p><p>Noel wasn’t so sure. He’d seen Amariyah hold up a cup of coffee in front of Violet only the day before, tell the little maid that it was cold, then pour the liquid very deliberately onto the floor. There had been other acts when she thought herself unseen, and then the conversation tonight. The selfishness in her nature seemed innate, as immutable as stone. But whether it had turned deadly remained to be seen.</p><p>“Yours was a gift of love,” he said to Fen as Nimra rose from her investigation of the plants, looked over her shoulder.</p><p>It was familiar now, the way his skin went tense in a waiting kind of expectation at the touch of her gaze. They hadn’t made physical contact again since that walk in the garden, but Noel was discovering that, doubts about her true nature or not, his body was no longer averse to the idea of intimacy. Not when it came to this one woman.</p> <p>He’d never had an angelic lover before. He wasn’t pretty enough to be pursued by those angels who kept harems of men, and he was glad for it. On the flip side, most angels were far too inhuman for the raw sexuality of his nature. Nimra, however, was like no other angel he’d ever met, a mystery within an enigma.</p><p>He’d seen her in the gardens more than once, her fingers literally in the earth. Once or twice, when he’d muttered something less than sophisticated under his breath, her eyes had sparkled not with rebuke, but with humor. And now, as she circled the pond to come to stand with her hand on Fen’s shoulder, her hair tumbling around her in soft curls, her expression was curious in a way he found unexpected in an angel of her age and strength.</p><p>“Are you seducing my cat, Noel?”</p><p>He stroked his palm over Mimosa’s slumbering body. “It is I who have been seduced.”</p><p>“Indeed.” A single word twined with power. “I see the women of the court are quite taken with you. Even shy Violet blushes when you are near.”</p><p>The little maidservant had proven to be a fount of information about the court when Noel tracked her down in the kitchens and charmed her into speaking with him. He’d already pushed the other two servants down the list of suspects after a subtle investigation— utilizing his access to Tower resources— had revealed no weak points in their lives that could make Sammi or Richard vulnerable to being turned, or signs of any sudden wealth. And after his discussion with Violet, he was certain beyond any doubt that she’d had nothing to do with the attempted assassination, either. Unlike Amariyah’s faux guilelessness, Violet’s was very much real— in spite of the ugliness of her past.</p><p>A runaway from a stepfather who had looked at her with far too much interest, Violet had collapsed half- starved on the edge of Nimra’s estate. The angel had been flying over her lands, seen the girl, carried her home in her own arms. She’d nursed Violet back to health and, when the teenager shied at the thought of school, hired a tutor for her. Though Nimra expected no service from one so young, the proud girl insisted on “earning her way” with her duties in the mornings, the afternoons being set aside for her studies.</p><p>“I adore her,” Violet had told Noel with fierce loyalty. “There isn’t anything I wouldn’t do for Lady Nimra. Anything.”</p><p>Now Noel looked up. “Violet is more apt to ambush me on a dark night, if she considers me a threat to you, than flirt with me.”</p><p>Fen cackled. “He has the right of it. That child worships the ground you walk on.”</p><p>“We are not gods, to be worshipped,” Nimra said, a troubled look on her face. “I would not wish it of her— she needs to spread her wings, live her own life.”</p><p>“She’s like a rescued pup,” Fen said, coughing into a trembling fist. “Even if you cast her out, send her into the world, she’ll return most stubbornly to your side. You may as well let her be— she’ll find her own happiness faster if she’s able to do what she can to ensure yours.”</p><p>“So wise.” Nimra made no effort to assist the old man as Fen struggled to get to his feet.</p><p>Help, Noel understood as he rose as well, would neither be welcomed nor accepted.</p><p>The walk back was slow and quiet, Nimra’s wings brushing the grass in front of him as she walked arm in arm with Fen. Strolling along behind them, Noel felt content in a way that was difficult to describe. The humid Louisiana night, the air filled with the sounds of frogs croaking and leaves rustling, Nimra’s soft voice as she spoke with Fen, it was a lush sea that embraced him, blunting the raw edges within, the parts yet broken.</p><p>“Good night, my lady,” Fen said when they reached the small, freestanding cottage that he shared with Amariyah. To Noel, he said, “I’ll think on what you said. But I’m an old man— she’ll go when I am no longer here in any case.”</p><p>Nimra’s wings made a rustling sound as she resettled them before joining Noel to return to the house. Skirting the main rooms in unspoken agreement, they turned toward her personal wing— Noel’s room was next to her own, the area private. “Amariyah may have her faults,” Nimra said at last, holding out her arms when Mimosa stirred again, “but she does love Fen.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Noel passed the cat over with care.</p><p>Purring happily in her mistress’s embrace, Mimosa returned to her slumber. Noel did up a couple of the buttons on his shirt but left the rest undone, the night breeze languid against his skin. “Did you know that Asirani is in love with Christian?”</p><p>A sigh. “I was hoping it was an infatuation, would pass.” She shook her head. “Christian is very rigid in his views— he believes angels should mate only among our own kind.”</p> <p>“Ah.” That explained the intensity of the angel’s response to Noel. “It’s not a common view.” Especially when it came to the most powerful vampires.</p><p>“Christian thinks angel- vampire pairings are undesirable, as such a pairing cannot create a child— and we have so few children already.”</p><p>Noel thought of the angelic children at the Refuge, so vulnerable with their unwieldy wings and plump childish legs, their trilling laughter a constant music. “Children are a gift,” he agreed. “Is it something you—” He stopped speaking as Mimosa made a tiny sound of distress.</p><p>“My apologies, little one,” Nimra said, petting the cat until it laid its head back down. “I will not squeeze you so tight again.”</p><p>A chill speared through Noel’s veins. When Nimra didn’t say anything else, he thought about letting it go, but the slowly reawakening part of him insisted on engaging with her, on discovering her secrets. “You lost a child.”</p> <p>It was the gentleness in Noel’s voice that tore the wound wide-open. “He didn’t have the chance to become a child,” Nimra said, the words shards of glass in her throat, the blood pooling in her chest as it once had at her feet. “My womb couldn’t carry him, and so I lost him before he was truly formed.” She hadn’t spoken of her lost babe since that terrible night when the storm had crashed against the house with unrelenting fury. Fen had been the one who’d found her, the only one who knew what had happened. Eitriel had left a month prior, after stabbing a knife straight into her heart.</p><p>“I’m sorry.” Noel’s hand on the back of her head, strong and masculine as he stroked her in much the same way he’d stroked Mimosa moments before. But he didn’t stop with her hair, moving his hand down to her lower back, careful not to touch the inner surfaces of her wings— that was an intimacy to be given, not taken.</p><p>He pressed against the base of her spine. She jerked up her head, startled. Instead of backing away, he curved his body toward her own, Mimosa slumbering in between them. He had no right to hold her in such a familiar way, no right to touch an angel of her power... but she didn’t stop him. Didn’t want to stop him.</p><p>It had been a long time since she’d been held.</p><p>Laying her head against his chest, the beat of his heart strong and steady, she lifted her eyes to the silver light of the half- moon. “The moon was dark that night,” she said, the memory imprinted into her very cells, to be carried through all eternity, “the air torn with the scream of a storm that felled trees and lifted roofs. I didn’t want my babe to leave me in the dark, but there was nothing I could do.”</p><p>He held her tighter, his arm brushing against her wing. Still he didn’t withdraw, though all vampires were trained to know that angels did not like their wings touched except by those they considered their intimates. Part of her, the part that held the arrogance of a race that ruled the world, was affronted. But most of her was quietly pleased by Noel’s refusal to follow the rules in a situation that wouldn’t be served by them.</p> <p>“I had no children as a mortal,” he murmured, his free hand moving over her hair, “and I know it’s unlikely I’ll ever have them now.”</p><p>“Unlikely, but not impossible.” Vampires had a window of opportunity of roughly two hundred years after their Making to sire children, those offspring being mortal. Noel had been Made two hundred and twenty- one years ago. She’d heard of one or two children being conceived after that period of time. “Do you wish to sire a child?”</p><p>“Only if that child is created in love.” His hand fisted in her hair. “And I do have children I consider family.”</p><p>“Yes.” The thought of children’s laughter dancing over the moors eased the ache in her heart. “I think I should like to spend time with them.”</p><p>“I’ll take you if you want,” he offered with a laugh. “But I warn you— they’re a wild, wild lot. The babes are likely to pull at your wings and expect to be cuddled on the slightest pretext.”</p><p>“True torture.”</p><p>Another laugh, his chest vibrating under her cheek.</p><p>“You do not sleep, Noel,” she said to him after long, quiet moments held against the steady beat of his heart, that big body warm around her own. “I hear you walking in the hall.”</p> <p>The first night, she’d wondered why he didn’t leave the wing and head out into the gardens. Only later had she understood that he was acting as what she’d named him— her wolf. Any assassin would have to go through Noel to get to her. Though she was the more powerful, his act had left her with a sense of trust that the Midnight had stolen from her.</p><p>“Vampires need little sleep,” he said, his voice distant, though he continued to hold her.</p><p>She knew that wasn’t the reason he stalked the corridors like a beast caged, but decided to keep her silence. Too many lines had already been crossed this night, and there would be consequences, things neither one of them was yet ready to face.</p><p>It was the next day that Nimra’s heart broke all over again.</p><p>She was in the library, working through her contacts for hints about who in her court might have links to someone who could access Midnight— a fact she’d checked earlier without result, but that Noel had requested she recheck, in case anything new had floated up— when Violet ran into the room. Tears streaked the girl’s face. “My lady, Mimosa—”</p><p>Nimra was running around the desk before Violet finished speaking. “Where?”</p><p>“The garden, by the balcony.”</p><p>It was a favorite sunning spot for the aged cat. Sweeping through the hallways, Nimra ran out onto the balcony to find both Noel and Christian crouching at the bottom of the steps. Noel had his arms full of something, and Nimra’s heart clenched at the realization of his burden, her sorrow tempered only by the knowledge that Mimosa had lived a full and happy life.</p><p>Then Christian saw her and rose into the air to land on the balcony in front of her. “My lady, it’s better if you don’t—”</p><p>Nimra was already rising over him, her wings spread wide, her sorrow transmuting into a strange kind of panic at his attempt to stop her from going to Mimosa. When she landed opposite Noel, the first thing she saw was the limp gray tail hanging over his arm. “I am too late...”</p><p>A weak meow had her jumping forward to take Mimosa from his arms. He passed the cat over without a word. Mimosa seemed to settle as soon as she was in her mistress’s arms, her head lying heavily against Nimra’s breast as Nimra hummed to her. Five quiet minutes later, and her beloved companion of many years was gone.</p><p>Fighting tears, for an angel of her power and responsibility could not be seen to break, Nimra raised her head, met blue eyes gone flinty with anger. “What do I need to know?”</p><p>CHAPTER 6</p><p>He nodded at a piece of meat sitting on the ground beside where Mimosa had liked to soak up the sun. “It’ll have to be tested, but I believe it was poisoned.” He brought her attention to where poor Mimosa had thrown up after chewing on the meat. “Violet.”</p><p>The maid ran down with a plastic bag. Taking it, Noel bagged the meat. “I’ll handle it,” he said to Violet when she went to take it from him.</p><p>Nodding, the maid hesitated, then ran back up the steps. “I’ll make my lady some tea.”</p><p>No tea would calm the rage in Nimra’s heart, but she wouldn’t taint Mimosa’s spirit with it. Holding her dear old pet, she turned to walk in the direction of the southern gardens, a wild wonderland that had been Mimosa’s favorite playground before age clipped her wings. She was aware of two deep male voices behind her, knew Noel had won whatever argument had taken place, for he appeared at her side.</p><p>He didn’t say a word until Christian landed beside him with a small shovel in hand. Grasping it, she heard him murmur something to the angel before Christian left in a rustle of wings. She didn’t make any effort to listen to their conversation, her attention on cradling Mimosa as gently as possible. “You were a faithful companion,” she told the cat, her throat catching. “I shall miss you.” Some— mortals and immortals alike— would call her stupid for bestowing so much love on a creature with such an ephemeral life span, but they did not understand.</p><p>“Immortals,” she said to Noel as they neared the southern gardens, “live so long that we become jaded, our hearts hardened. For some, cruelty and pain are the only things that engender an emotion.” Nazarach, ruler of Atlanta and adjacent areas, was one such angel, his home saturated with screams.</p><p>“An animal is innocent,” Noel said, “without guile or hidden motivation. To love one is to nurture softness within your own heart.”</p><p>It didn’t surprise her that he comprehended that quiet truth. “She taught me so much.” Nimra stepped through the curved stone archway that led into the concealed gardens Mimosa had adored. She heard Noel suck in a breath when he glimpsed the tangle of roses and wildflowers, sweet pecan and other trees heavy with fruit, pathways overgrown until they were near impassable.</p><p>“I didn’t know this existed.” He reached out to touch an extravagant white rose.</p><p>She knew he felt not shock, but wonder. Like the young kitten Mimosa had once been, Noel carried a touch of wildness within him. “She will enjoy being a part of this garden, I think.” Her throat felt raw, lined with sandpaper.</p><p>Noel followed her in silence as she walked through the tangled pathways to a spot under the sheltering arms of a magnolia that had stood through storm and wind and time. When she stopped, he hefted the shovel and began to dig. It didn’t take long to dig deep enough for Mimosa’s body, but instead of nodding at her to lay her pet down, Noel went to the closest bush heavy with blooms. Plucking off handfuls of color, he walked back and lined the bottom of the tiny grave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nimra couldn’t hold back the tears any longer. They rolled down her face in silence as Noel went back two more times. When he was done, the grave held a velvet carpet of pink, white, and yellow petals, soft as fresh- fallen snow. Going to her knees, Nimra brushed a kiss to her pet’s head and laid her down.</p><p>The petals stroked against the backs of her hands as she lifted them out from under Mimosa. “I should’ve brought something to wrap her in.”</p><p>“I think,” Noel said, showering more blooms over Mimosa, “she would prefer this. It is a fitting burial for a cat who loved to roam, don’t you think?”</p> <p>She gave a jerky nod and reached back to tug out several of her primary feathers. “When she was a kitten,” she told Noel, “Mimosa was fascinated by my feathers. She would attempt to steal them when I wasn’t looking.”</p><p>“Was she ever successful?”</p><p>“Once or twice,” she said, a watery laugh escaping her. “And then she’d run so fast, it was as if she were the wind itself. I never did find where she hid my feathers.” With those words, she placed the primaries beside Mimosa before blanketing her in another layer of petals. “Good- bye, little one.”</p><p>Noel covered up the grave in quiet, and she placed more blossoms over the top, along with a large stone Noel found in the garden. They stayed for long, still minutes beside the grave, until Nimra felt a caress of wind along her senses, gentle as a sigh. Releasing a silent breath, she turned and began to walk back, Noel by her side.</p><p>He touched a hand to her shoulder. “Wait.” Propping the shovel against one thigh, he used the thumbs of both hands to wipe away the tears on her face. “There,” he whispered, “now you are Nimra again. Strong and cruel and pitiless.”</p> <p>She leaned into the touch, and when he cupped her face, when he touched his lips to her own, she didn’t remind him that his role was as her wolf, not her lover. Instead, she let him sip at her mouth, let him warm the cold place in her heart with the rough heat of his masculinity.</p><p>When he lifted his mouth, she fisted her hand in his shirt. “More, Noel.” Almost an order.</p><p>Shaking his head, he brushed back her hair with a tenderness she’d never felt from a lover. “I won’t take advantage of you. Today, I’ll be your friend.”</p><p>“Fen has been my friend for decades,” she said, sliding her arm into his when he offered it to her. “And he never presumed to put his mouth on mine.”</p><p>“Obviously I’ll be a different kind of friend.”</p><p>The lighthearted words served to calm her, until by the time they emerged into the main gardens, she was the angel who ruled New Orleans and its surrounds once more— hard and powerful and without vulnerability. “You will discover who hurt Mimosa,” she said to Noel, “and you will tell me.” There would be no mercy for the perpetrator.</p> <p>The first thing Noel did after escorting Nimra to her personal study, was to head out to track down Violet. The maid had given him a fleeting but significant look when she’d brought him the plastic bag— the contents of which he’d surrendered to Christian earlier, because he’d needed to be by Nimra’s side when she buried Mimosa.</p><p>However, he hadn’t taken more than three steps out of the private wing when Violet walked into the corridor with a tea tray. “I saw Lady Nimra return,” she said, lines of worry around her eyes. “Should I...?”</p><p>“I’ll take it in,” Noel said. “Wait for me here.”</p><p>The teenager gave a swift bob of her head while Noel ducked inside. Nimra was standing by the window, her back to the door. Leaving the tray on the coffee table, he walked to stand behind her, his hands on her shoulders. “Eat something.”</p><p>“Not yet, Noel.”</p><p>Knowing she needed to grieve in private, this strong woman who had the heart to love a creature so very small and defenseless, he left her with a fleeting stroke through her hair.</p><p>Violet was half hiding in an alcove, her eyes fearful. “If she sees me, Noel, she’ll know.”</p><p>“Who?” he asked, though he had a very good idea.</p> <p>“Amariyah.” The girl hugged herself tight. “She thought no one was in the kitchens when she came in because I always hide when she’s near— she’s spiteful.” A gulping breath. “I saw her take the meat, and thought it was strange but didn’t really worry about it.”</p><p>“Thank you, Violet,” he said, certain she spoke the truth. “No one will know the information came from you.”</p><p>The maid drew up her shoulders. “If you need me to, I’ll swear witness before the whole court. Mimosa dying so soon after Queen, it’ll have broken my lady’s heart. Some say she doesn’t have one, but I know different.”</p><p>Noel stayed in the corridor for long minutes after Violet left, considering the maid’s statement. His faith in her aside, the fact was, it was her word against that of a vampire. A vampire who was the child of the most trusted member of Nimra’s court. Amariyah could turn around and accuse Violet of the same act.</p><p>It was dusk by the time he decided on a course of action. Heading away from the private wing, he walked down not to the main dining room, but toward Fen’s cottage. As he’d expected, Amariyah was at home with her father. Entering at Fen’s invitation, Noel sat with the elderly man for a while, talking of nothing and everything.</p><p>When the subject of Mimosa came up, he made sure his gaze met Amariyah’s. “I have a very good idea of the person behind the cowardly act,” he said, making no effort to hide his contempt. “It’s just a case of how hard they’ll make it.”</p><p>From the way Amariyah’s face drained of blood, it was clear she understood the threat. And if there was one thing in the vampire that was true and good, it was her love for her father. Her eyes beseeched him not to bring up the subject in front of Fen. Since Noel had no desire to hurt the old man— would’ve never carried through with the unspoken threat— he excused himself after a few more minutes.</p><p>“I’ll walk with Noel a little, Father,” the female vampire said, rising to her feet in a fall of vivid violet fabric that appeared as light and airy as the wind, the simple gown leaving her arms bare and flirting with her ankles.</p><p>“Go, go.” Fen chuckled. “Just remember, he belongs to an angel. Don’t go poaching there.”</p><p>From the rigidity of Amariyah’s smile, she didn’t appreciate the reminder of her place in the hierarchy of things. But her tone was light as she said, “Do credit me with a few brain cells.”</p><p>That elicited a wracking laugh from Fen, his chest rattling in a way that concerned Noel. Amariyah was immediately by his side. “Papa.”</p><p>Fen waved off the help. “Go on, Mariyah.”</p><p>“We should call a doctor,” Noel said, not liking the strain in Fen’s breathing.</p><p>Fen’s response was a laugh, his dark eyes twinkling. “Ain’t nothing a doctor can do about age. I’m an old man with an old man’s bones.”</p><p>When Amariyah hesitated, Fen urged Noel to take her outside. Noel would’ve insisted on a doctor, but one look at Fen’s face told him that would be a lost battle— the elderly man’s body might’ve turned frail, but his will remained strong as steel. Such a will demanded respect.</p><p>“Until we next speak,” he said to Fen as he left with a nod, taking Amariyah with him.</p><p>Fen’s daughter was silent as they walked deep into the verdant spread of the gardens, her steps jerky, her spine stiff. “How did you know it was me?” she said the instant they were in a private spot, beneath the arms of a gnarled old tree with bark of darkest brown.</p><p>“That doesn’t matter. What matters is the why of it.”</p><p>Her shrug was graceful, her beauty marred by the petulant ugliness of her expression. “What do you care? Her ladyship will execute me for putting that horrid old thing out of its misery, and all will be well with her perfect world.”</p><p>Noel had glimpsed Amariyah’s inexplicable animosity toward Nimra soon after their first meeting, but this callousness was something unexpected. “Why, Amariyah?” he asked again, catching a leaf as it floated to the ground.</p><p>Hissing out a breath, the vampire pointed a trembling finger at him. “She’ll live forever, while I have to watch my father die.” A fist slamming into her heart. “He asked to be Made, and she refused him! Now he is an old man taking his last breaths, and hurting every instant.”</p><p>Noel didn’t know how angels picked those who were to be Made, but he’d been part of Raphael’s senior guard long enough to understand that there was a level of biological compatibility involved. From everything he’d witnessed of Nimra and Fen’s relationship, it was clear the angel would’ve Made Fen if she’d been able. “Does your father know you feel this way?” he asked, rubbing his thumb over the smooth green surface of the leaf in his hand.</p><p>Her face twisted into a mask of rage. “He adores her— as far as he’s concerned, the bitch can do no wrong. He doesn’t even blame her for the fact that he’s dying! He told me that there are things I don’t know! That was his justification for her.”</p><p>It was impossible not to pity the pain that had driven Amariyah to such an abhorrent act, but it didn’t in any way lessen her crime or his anger. “And the Midnight?”</p><p>“I didn’t do anything at midnight.” A scathing response. “I gave the cat the meat just after dawn. There, you have your confession. Take me to the one who holds your leash.”</p><p>The dig had no impact. Unlike Amariyah, Noel knew who he was, and, though Nimra might disagree, he understood that even an angel could not stand alone. Raphael had his Seven. Nimra would have Noel. For, secrets or not, he was becoming ever more convinced that what he saw was the truth, Nimra’s cruel reputation the cleverest of illusions.</p><p>Instead of taking Fen’s daughter to the private wing, he put her in the downstairs library and— seeing Christian— asked him to make sure she remained there. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Do I look like your servant?” A glacial question.</p><p>“Now’s not the time, Christian.”</p><p>The angel’s shrewd eyes narrowed before he nodded. “I’ll keep watch.”</p> <p>Nimra shook her head in stunned disbelief when Noel told her the identity of the perpetrator. “I knew she was a little resentful, but never would I have believed her capable of such.”</p><p>“I’m convinced she had nothing to do with the Midnight,” Noel continued in a pragmatic tone, but in his eyes she saw the cutting edge of blackest anger. “She seemed genuinely confused when I mentioned it.”</p><p>Ice, bleak and cold, invaded her veins. “So I have two who hate me in my court— it puts my ability to read my people in the spotlight, does it not?”</p><p>“This court has a heart that is missing in most.” Fierce words from her wolf. “Don’t let those of Amariyah and her ilk steal what you’ve built here.” He held out a hand.</p><p>And waited.</p> <p>I can never appear weak.</p><p>Still, she reached out and slid her hand into the rough warmth of his own, wanting to feel “human,” if only for a bare few instants, before she had to become a monster. His fingers curled around her own, a small act of possession. She wondered if he sought to press a claim now, when she could not accept it, but he released her hand the instant they hit the hallways where they might encounter others, watching with eyes of keen blue as she became Nimra the ruler once more.</p><p>“Does Fen know?” she asked, wanting no such pain for her friend.</p><p>“I didn’t tell him.”</p><p>Nimra nodded. “Good.”</p><p>Neither one of them spoke again until they walked into the library, Christian exchanging a stiff nod with Noel before the other angel left. Closing the doors, Noel stood with his back to them while she walked across the floor to face a sullen Amariyah where she stood in front of the unused fireplace set with pinecones and dried flowers. Violet’s hand at work.</p> <p>The vampire spoke before Nimra could say a word, her tone defiant. “My father had nothing to do with it.”</p><p>“Your loyalty to Fen does you credit,” Nimra said, making sure her voice betrayed nothing, “but this is one act I can’t forgive, not even for him.” She had no intention of being cruel, but neither could she be merciful. Because a vampire like Amariyah would see in that mercy a weakness, one that would incite her to ever more depraved acts. “You took a life, Amariyah. A small life, a tiny light, but a life nonetheless.”</p><p>Amariyah’s hands fisted in the sides of her diaphanous gown, pulling it tight across her thighs. “Then you can explain my death to him.” A bitter laugh. “I’m sure he’ll forgive you as he’s forgiven the fact that you’re the reason for his own death.”</p><p>Nimra’s chest grew stiff with anguish, but she kept those emotions off her face, having had centuries of experience at concealing her true self when necessary. “You won’t die,” she said in a tone so cold, it came from the dark, powerful heart of her. “Or you shouldn’t, unless you’ve been doing things beyond that which anyone knows.”</p><p>True fear flickered into Amariyah’s eyes for the first time, sweat breaking out along her brow. “What’re you going to do to me?” In that question was the sudden knowledge that there was a reason Nimra was feared by even the most brutal.</p><p>Crossing the distance between them, Nimra touched her fingers to the vampire’s hand with a gentleness that hid a weapon of such viciousness, the merest glimpse of it had left her enemies a trembling wreck. “This.”</p><p>Though Noel saw nothing, felt nothing, Amariyah began to shudder, then convulse, her body falling to the floor in a wild cacophony of limbs and clashing teeth. When she quietened at last, her eyes remained locked tight, whimpers escaping her mouth as her bones shook, as if from the greatest cold.</p><p>“Each time I do this,” Nimra said, her gaze haunted as she looked at the fallen woman, “it takes something from me.”</p> <p>Scooping up a violently shivering Amariyah, Noel placed her on the sofa, pulling a cashmere throw off the back to cover her. “She’s bleeding a little where she seems to have cut her lip”—he used a tissue from a nearby box to wipe it away—“but otherwise appears fine on a physical level.” He felt a glimmer of understanding about the reason behind Nimra’s reputation, but it whispered away before he could grasp it.</p><p>Nimra said nothing, walking to stand in front of the large windows that looked out over the gardens, those jewel- dusted wings trailing along the gleaming varnish of the wooden floors. Unable, unwilling, to leave her so alone and distant, he walked to join her. But when he put his hand on the side of her neck, urging her to lean on him, she resisted. “This is why Nazarach fears me,” she murmured, but said nothing further.</p><p>He could’ve pushed, but he made the choice to stand by her side instead, knowing she would not break, would not soften until this was done. Paying her own penance, he thought, though Amariyah was the one who’d caused irreparable harm.</p><p>CHAPTER 7</p><p>It took two days for Amariyah to wake. Out of respect for Fen, Nimra had decreed that no word of this would ever reach him, with both Violet and Christian sworn to secrecy. Noel had no fear that either would break their word. Violet was beyond loyal, and Christian, in spite of his jealousy, was honorable to the core. Fen himself had been told that Amariyah had been sent out of state on an errand for Nimra, and would likely be tired when she returned.</p><p>Noel was with the vampire when she finally woke, her eyes hollow, her bones cutting against skin gone dull and lifeless. “Any other person who dared such an act,” he told her, “would be on the street right now, but because your father doesn’t know of what you did, you’ll be permitted to remain here.</p><p>“But,” he added, “step one foot out of line, and I will personally ensure true death.” It was a harsh statement, but his own loyalty was to Nimra, and more, he understood the predator that lived beneath the skin of every vampire, had glimpsed a twisted darkness in Amariyah that enjoyed causing pain to those who were helpless to fight back.</p><p>Whatever the other vampire heard in his voice— or perhaps it was the echo of her punishment— had fear creeping across her face. “My father is the only reason I’m still here,” she whispered, her voice raw. “I’ll be gone from the house of this monster the second he leaves me.”</p><p>Nimra stood at the window of her private sitting room, watching Amariyah’s unsteady progress through the dusk to the cottage. Christian had arranged for Fen to be out, so Amariyah would have time to clean herself up. “Fen is very intelligent,” she said to the man who’d entered the room without knocking. “I’m not sure he’ll accept the story about a business trip once he sees her gaunt appearance.” Blood and sleep would revive Amariyah, but it would take hours.</p><p>“Christian just sent me a message to say he engineered a delay from the city— they’ll spend the night.”</p><p>“Good.” She kept her back to him, knowing he had questions to which he deserved answers. Not because he was her wolf, but because he was becoming more, becoming something she’d never expected.</p><p>Now he said, “I brought you some food.”</p><p>Turning as Amariyah disappeared from sight, she met that gaze so startlingly bright in the shadowy light of day fading into night. “Do you think you’ll simply wear me down to your way of doing things?”</p><p>“Of course.” An unexpected smile that burned through the cold that had lingered in her veins ever since the punishment, as her body remembered that she was not only a being of terrible power, but a feminine creature. “I am a man, after all.”</p><p>Knowing she was being charmed, but unable to resist, she walked with him to the informal dining area—where he’d placed a tray full of fruit, sandwiches, and cookies. “This is no meal fit for an angel,” she said when he pulled out a chair.</p><p>“I see your smile, my lady Nimra.” A kiss pressed to her nape, a hot intimacy she had not given him permission to take.</p><p>“You walk a dangerous road, Noel.”</p><p>He rubbed his thumbs along the tendons that ran down the back of her neck, his touch firm and sure. “I never was one for taking the easy path.” His lips against her ear, his body big and solid around her own as he slid his hands down to brace them on the arms of her chair. “But first you must eat.”</p><p>When he moved to sit beside her, lifting a succulent slice of peach to her lips, she should’ve reminded him that she was no child. An angel could go without food for long periods and not suffer any ill effects. But the past few days had cut jagged wounds inside her, and Noel, with his rough tenderness, spoke to a part of her that had not seen the light since centuries before Eitriel.</p><p>Inexplicable that it should be this vampire, damaged on such a deep level, who should have so profound an impact on her... or perhaps not. Because beyond the shadows in the blue, she glimpsed the wary hope of a brutalized wolf.</p><p>So she allowed him to feed her the peach, then slices of pear, bites of sandwich, followed by a rich chocolate cookie. Somewhere along the way, she ended up sitting with her knees pressed up to his chair, his legs on either side of her own. Her hands spread on his thighs, the rock- solid strength of him flexing taut and beautiful under her touch.</p><p>Other parts of him were taut, too.</p><p>But though his eyes lingered on her lips, his thumb brushing off crumbs that weren’t there, he didn’t seek to come to her bed, this wolf who was starting to entangle himself in her life in a way no man had ever dared to attempt.</p><p>Noel didn’t sleep again that night, his mind full of the echoes of evil, the laughter of those who had debased him until he was less than an animal.</p><p>“It is done,” Raphael had said to him after it was all over, his face merciless in judgment, his wings glowing with power. “They have been executed.”</p><p>At the time, Noel had said, “Good,” with vicious pleasure, but now he knew vengeance alone would never be enough. His attackers had marked him in ways that might never be erased. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Noel.”</p><p>Jerking up his head at that familiar feminine voice, he found Nimra had stepped out into the corridor where he paced in a vain attempt to outrun the laughter. “I woke you.” It was well past midnight.</p><p>“Sleep is an indulgence for me, not a necessity.” Eyes of brilliant topaz glimmering with streaks of amber, vivid against the cream of a fluid gown cinched at both shoulders, she said, “I would walk in the gardens.”</p> <p>He fell into step with her. She said nothing until they reached the beautifully eerie shadows of the woods where the stream originated. “An immortal has many memories.” Her voice was an intimate caress in the night, her words poignant with ancient knowledge. “Even the most painful of them fade in time.”</p><p>“Some memories,” he said, “are embedded.” As the glass had been embedded in his flesh. As... other things had been embedded in his body. His hand fisted.</p><p>Nimra’s wing brushed against his arm. “But is it a memory you wish to shine like a jewel, keep always at the forefront?”</p><p>“I can’t control it,” he admitted through a jaw clenched so tight, he could hear his bones grinding against one another, drowning out the whispering secrets of the warm Louisiana night.</p><p>An angel’s perceptive gaze met his under the silver caress of the moon. “You will learn.” There was utmost confidence in her voice.</p> <p>His laugh was harsh. “Yeah? What makes you so sure?”</p><p>“Because that is who you are, Noel.” Stepping forward, she raised her hand to touch his cheek, her wings arcing at her back.</p><p>When he flinched at the contact, she didn’t pull back. “What was done to you,” she said, “would’ve broken other men. It did not break you.”</p><p>“I’m not who I once was.”</p><p>“Neither am I.” She dropped her hand, and he found he didn’t like the kiss of the night against his skin now that he’d felt the softness of her. “Life changes us. To wish otherwise is pointless.”</p><p>The pragmatic truth of her words affected him more than any gentle reassurances. “Nimra.”</p> <p>She looked at him with those inhuman eyes. “My wolf.”</p><p>So breathtaking, he thought, so dangerous. “There are other ways to blunt the impact of memory.” It was a sudden, primal decision. Too long—he’d been hiding in the dark too long.</p><p>Nimra knew what Noel was asking, knew, too, that if she acquiesced, he would be no easy lover— either in the act or in his temperament afterward. “I have not taken a lover,” she murmured, her gaze on the rough angles of his face, “for many years.”</p><p>Noel said nothing.</p><p>“Very well.”</p><p>“So romantic.”</p><p>There was a black edge to the words, but Nimra didn’t take it personally. Like the wolf she called him, he might yet show her his teeth. Trust was a precious commodity, one that took time to develop. Patience was something Nimra had learned long ago. “Romance,” she said, turning to head back to the house, “is a matter of interpretation.”</p><p>Nothing from the man at her side, not until they were behind the closed doors of her suite. “No matter what the interpretation,” he warned, his body held with a rigid control that told her he was on the finest of edges, “it’s not what I’m going to give you tonight.”</p> <p>Touching her fingers to his jaw, she allowed the desire, so heavy and drugging in her veins, to show on her face. “And it’s not what I need.” What she’d done to Amariyah had been just, but it had marked her as it always did. Tonight she needed to feel like a woman, not the inhuman monster Amariyah had named her.</p><p>A strong hand gripped her wrist. “Sex for sex’s sake?”</p><p>Noel’s anger, his pain, was a raw blade, cutting and tearing, but Nimra was made of sterner stuff. “If I wanted that, I would’ve accepted Christian into my bed long ago.”</p><p>Ice blue turned to midnight as his hand tightened. All at once, her pulse was in her mouth, on her skin. “You hunger,” she whispered as her blood sang to the haunting kiss of this vampire’s touch.</p><p>His gaze went to the pulse that thudded in her neck, his thumb rubbing over the beat in her wrist. “I haven’t fed from the vein in months.” It was a harsh admission. “I would rip out your throat.”</p><p>“I’m immortal,” she reminded him when he released his grip on her wrist to curve his fingers around that throat. “You can’t hurt me.”</p><p>A laugh that sounded like broken glass. “There are ways to hurt a woman that have nothing to do with anything so simple as pain.”</p><p>And she knew. Understood what she had to do. Pulling away to walk into her dressing room, she returned with a long silk scarf. “Then I,” she said, handing him the strip of peacock blue, “will have to trust you.” In saying the words, she found her humanity— it was the woman who offered him this, not a being with a terrible gift.</p><p>Noel’s hand clenched around the soft fabric. It was a symbol, nothing more, Nimra’s power more than enough to permit escape should she wish it. But that she’d given it to him meant she’d seen the broken pieces he didn’t want anyone to see... and still she looked at him with a woman’s lingering appreciation. “No bonds,” he said, letting the scarf float to the floor in a grace of blue. “Never any bonds.”</p><p>“As you say, Noel.” Holding his gaze with the promise of her own, she reached up to the clasps on her shoulders, flicked them open. Her gown shimmered over her body to pool at her feet, knocking all the air out of him.</p><p>She may have been petite, but she was lush curves and feminine invitation, the smooth brown of her skin interrupted only by a triangle of lace at the juncture of her thighs. Her breasts were full and heavy against her slender frame, her nipples dark and, at this moment, furled into tight buds. Spreading her wings in invitation, she waited.</p><p>The choice was his.</p><p>As you say, Noel.</p><p>Such a simple statement. Such a powerful gift.</p><p>Reaching out, he cupped the erotic weight of one breast, had the satisfaction of feeling a tremor race across her skin. It awakened the part of him that had gone into numb slumber when his abusers had turned him into a piece of meat, crushed and broken. Tonight, that part, the one that had made him an adventurer who’d conquered mountains, caused women to sigh in pleasure, roared to the surface.</p><p>It was instinct to thrust his hand into her hair, to slant his mouth over her own, to demand entrance. She opened to him, dark and hot and sweet, her power a lick against his senses as lusciously female as the body under his touch. Tucking her closer, he slid his hand up from her breast to grip her jaw, holding her in place as he explored every inch of that mouth he’d dreamed of tasting for longer than she knew.</p><p>He wanted to move slow, to map every curve and every pleasure point, but her pulse, it beat a seductive tattoo against his senses, inviting him to take that which he hadn’t taken for months. Circling his hand around to her neck, he rubbed his thumb over the beating invitation of her. Her hands clenched on his waist, but she made no demur when he began to kiss his way down to the spot that was a siren song to the vampirism that was as much a part of him as his desire for her.</p><p>Lips against his ear. “Sip from me, Noel. It is a gift given freely.”</p><p>He’d never been a man who fed indiscriminately. When he hadn’t had a lover, he’d turned to friends, for the feeding didn’t need to be a sexual thing. Since the attack, he hadn’t been able to stand being that intimate with another being. Even now, with this woman who made him hunger in every way, and though his erection was a hard ridge in his pants, he said, “I can’t make it pleasurable.” Not because he’d lost the ability, but because he wasn’t ready for the connection forged by the sexual ecstasy his kiss could bestow... the vulnerability that came with allowing another being any kind of inroad into him.</p><p>She arched her neck in silent response.</p><p>His blood pounding in time to her own, he slid his arms around her, his fingers brushing her wings as he sucked a kiss over the spot before piercing the delicate skin with his fangs. Her blood was an erotic rush against his senses, the punch of power staggering. The hunger in him, the darkness that had turned into a furious rage during the events at the Refuge, rose to the surface, glorying in the taste of her. She saturated his senses, drowned him in sensation, and in spite of his earlier words, he was male enough to want her to feel the same.</p><p>Acting on naked instinct, he pumped pleasure into her system as he took blood from hers, felt her body arch, shudder— he hadn’t held anything back, hadn’t stopped with simple arousal. She came apart in his arms, her blood earthy with the flavor of her desire. Drugged to raw pleasure, he found he’d thrust his thigh between her own, splayed his hands on her back, his fingers touching the sensitive inner edges of her wings, her breasts crushed against his chest.</p><p>But as he halted in his gluttony to lick the small wounds closed, he discovered he didn’t flinch at having let her so near— and not only on the physical level. Perhaps it was because she’d ceded him the control he needed... or perhaps it was simply because she was Nimra.</p><p>Nimra lay boneless in Noel’s arms, conscious of him licking at the skin of her neck to heal the marks caused by his fangs. She didn’t tell him not to worry— the puncture site would’ve healed on its own in minutes— because it was an unexpected pleasure to know he wanted to care for her, this man who had left her body quivering in ecstasy unlike any she had ever before felt, even as his own flesh strained hard and unsatiated against her abdomen.</p><p>When he nuzzled at her before raising his head, the affection was another act she hadn’t expected, a sign of the man hidden beyond the shadows of nightmare. As she luxuriated in the feeling, he stroked one hand down the center of her back, just touching the sensitive edges where her wings grew out of her back. “Does that feel good?” he murmured, a difference to him that made her skin tighten over her flesh, her thighs clench on the rough intrusion of his own. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes.” No angel allowed anyone but a trusted lover to caress her in such a fashion. “Are you not afraid?” she asked, echoes of her own past sliding oily and dark through the aftershocks of pleasure. “You saw what I did to Amariyah.”</p><p>Noel continued with the exquisite delicacy of his caresses. “You did what you did with thought and care. You aren’t a capricious woman.”</p><p>She’d given him her blood, her body, but his words, they were as precious. “I’m pleased you see me in such a way.” It was strange to be standing here unclothed, in the arms of a man who continued to wear his armor of cotton and denim— and yet she was, if not content, then oddly at peace.</p> <p>Then Noel spoke, and his words carried within them the promise of splintering the peace to nothingness. “Will you tell me about your power?”</p><p>CHAPTER 8</p><p>“What would you say if I told you it was a secret for me to keep?”</p><p>No change in his expression. “I’m patient.”</p><p>Laughing at the arrogance even as something very old in her grew still, quiet, she went to touch her fingers to his face, dropped her hand midway. “I would show you, Noel, but no.” It would be a violation for this man who’d had all choice stripped from him by the monsters who had stained the Refuge with their crimes, regardless of the fact that he’d feel no pain, only the same bone- melting pleasure he’d lavished on her. “I give back,” she whispered. “I give back what was given unto others.”</p> <p>“Pleasure for pleasure,” Noel said, understanding at once. “Pain for pain.”</p><p>A solemn nod. “It is not the act itself, but the intent behind it that determines what someone will feel when I use my power.”</p><p>It made him change his hold, shift her into the protection of his body. Yes, she was a powerful angel, but whatever it was her gift demanded from her, it haunted her. “That’s why Nazarach leaves you alone.” The other angel was renowned for his viciousness.</p><p>Nimra’s voice when it came was hard. “We had a meeting when I first took over this territory. He thought to control me. He has never returned to my lands.”</p><p>Noel felt his lips curve in a feral smile. “Good.”</p><p>Noel’s body continued to hum with the taste of Nimra the next day. Her blood held such power that he knew he wouldn’t need to feed again for a week... though there were different kinds of need, he thought, as he began to go through the file Nimra had sent him that morning. It was a list of people she knew had had access to Midnight and who might wish her harm.</p> <p>However, from what Noel understood of the people on the list— and what he was able to learn from Dmitri when he called the leader of Raphael’s Seven— none of them would have left anything to chance, especially given how difficult Midnight was to source. The fact that Nimra’s cat had died, betraying the game, spoke of an amateur. Of course, there was also the old adage that poison was a woman’s weapon.</p><p>Amariyah had convinced him with her confusion, and Asirani— no matter her unrequited feelings for Christian— seemed loyal. But Noel wasn’t about to write her off without further investigation. Knowing the vampire had a habit of coming in early to the small office she had on the lower floor, he decided to see if he could track her down. He was in the corridor leading to her office when he heard whispering, low and furious. It was instinct to soften his footsteps.</p><p>“... just listen.” Soft, feminine. Asirani.</p><p>“It will change nothing.” Christian’s stiff tones. “I don’t wish to hurt you, but I have no such feelings for you.”</p><p>“She’s never going to look at you the way you want.” Not bitter, almost... sad.</p><p>“That is none of your concern.”</p><p>“Of course it is. She might be our lady, but she’s also my friend.” An exhale that telegraphed frustration. “She plays with Noel, but it’s because he’s a vampire. There’s no chance of a serious relationship.”</p><p>“I will be here when she is ready for that relationship.”</p> <p>Noel stepped forward until he could see the pair reflected in the antique mirror on the other side of the corridor. Asirani, striking in a sheath of emerald green, her hair swept up off her neck, was shaking her head, her expression solemn, while black- garbed Christian did his impression of a Roman statue. When the female vampire turned, as if to enter her office, Noel retraced his steps away from the couple.</p><p>Asirani’s view of his relationship with Nimra was hardly news. Many angels took vampiric lovers, but long- term relationships were far rarer. The fact that vampires and angels couldn’t have children together was one of the most powerful reasons why. But regardless of what Asirani believed, Nimra didn’t play games. For now, she was Noel’s. As for the future— his first priority was to ensure her safety.</p><p>That thought had him circling back to Asirani.</p><p>There had been unhidden care in her tone when she’d spoken of Nimra, a distinct vein of empathy. Disappointment, too, along with a touch of anger— both directed at Christian, but not even an undertone of the kind of resentment she’d need to feel to want Nimra dead. All of which left him with no viable suspects.</p><p>Christian could be a prick but he’d swallowed his antagonism and cooperated with Noel when it came to Nimra’s interests. Exeter had spent centuries by her side, Fen decades. He couldn’t see either man developing such a deep hatred for her without her being aware of the change. As for the two older servants, quite aside from all else, they had proven quietly devoted.</p><p>Frowning, he headed out into the breaking day in search of Nimra— because there was one thing they hadn’t considered, and it was the very thing that might hold the answer. He half expected to find her beside Mimosa’s grave, but midway to the wild gardens where her pet was buried, something made him look up... and what he saw stole his breath.</p><p>She was stunning against the slate gray sky streaked with the golds, oranges, and pinks of dawn, her wings backlit with soft fire, her body shown to lithe perfection in the layered gown of fine bronze silk that the wind kissed to her skin. Leaning against the smooth trunk of a young magnolia, he indulged in the beauty of her. Seeing her wings spread to their greatest width, her hair whipping off her face as she glided on the air currents, reminded him of the Refuge, the remote city that had been his home for so long.</p><p>He’d been placed in the angelic stronghold after completing his hundred- year Contract, when he’d chosen to remain in service to Raphael. There, he’d been part of the guard that helped maintain the archangel’s holdings in the Refuge, as well as watching over the vulnerable who were the reason for the existence of the hidden mountain city. However, he’d soon been drafted into a roaming squad that took care of tasks all over the world.</p><p>New York, where Raphael had his Tower, had been a wonder to a lad who’d come out of the untamed emptiness of the moors. With its soaring buildings and streets buzzing with humanity, he’d been at once overwhelmed and exhilarated. Kinshasa had stirred the explorer’s soul that lived within him, the part that had led him to dare the challenge of vampirism in the first place. Paris, Beirut, Liechtenstein, Belize, each place had spoken to him in a different way... but none had sung the soft, sultry song that Nimra’s territory whispered to his soul.</p><p>A caress of jewel- dusted wings against the painted sky, cutting across the air with breathless ease. His heart squeezed, and he wondered if she knew he watched her, if she flew for him. A fraction of an instant later, he caught a glimpse of another set of wings and his mood turned black.</p><p>Christian flew to cut under and around Nimra, as if in invitation to dance. His wingspan was larger than hers, his style of flight less graceful, more aggressive. Nimra didn’t respond to the invitation, but neither did she land. Instead, as Noel watched, the two angels flew in the same wide sky, cutting across each other’s paths on occasion, and sometimes seeming to time their turns and dives to a hairbreadth so as to just miss each other.</p><p>Anger simmered through his veins.</p><p>It wasn’t cold and tight and hard as it had been for so long, but hot, spiked with a raw masculine jealousy. He had no wings, would never be able to follow Nimra onto that playing field. Gritting his teeth, he folded his arms and continued to keep watch. Maybe he couldn’t follow, but if Christian thought that gave him the advantage, he didn’t know Noel.</p><p>Troubled to a depth she hadn’t been for decades, since the day she learned of Eitriel’s betrayal, Nimra had come to seek solace in the skies. She’d found no answers in the endless sweep of dawn, and now discovered she was being watched by the very same eyes that had caused her disquiet. It was a compulsion to fly for him, to show him her power, her strength.</p><p>Noel had taken only her blood, not her body, in the dark heat of the night’s intimacy, and yet he’d touched her too deep all the same. She’d been ready to offer surcease, find some peace for herself. But somehow, he’d wrapped a wolf- strong tendril around her very heart. Nimra wasn’t certain she appreciated the vulnerability. It had nothing to do with the scars left by Eitriel, and everything to do with the strength of the draw she felt toward the vampire coming ever closer as she flew in to land.</p><p>“Good morning, Noel,” she said, folding back her wings as her feet touched the earth.</p><p>In answer, he strode across the ground, his strides eating up the distance. And then he kissed her. Hot and hard and all consuming, his lips a burn against her own, his jaw rough against her skin. “You are mine,” he said when he finally allowed her to breathe, his thumbs rubbing over her cheekbones. “I don’t share.” A possessive statement from the core of the man he was, the veneer of civilization stripped away.</p><p>The primal intensity of him was a blaze against her senses, but she coated her voice in ice. “Do you think I would betray you?”</p><p>“No, Nimra. But if that popinjay doesn’t stop flirting with you, blood will be spilled.”</p><p>Pushing off his hands, she took a step back. “As the ruler of this territory I must deal with many men.” If Noel believed he had the right to put limits on her, then he was not the man she’d thought him to be. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Most of those men don’t want to sleep with you,” he said in blunt rebuttal. “I reserve the right to introduce my fist to the faces of the ones who do.”</p><p>Her lips threatened to tug upward. Raw and open and real, this indication of possession was something she could accept. It spoke not of a grab for power, but a territorial display. And Nimra was old enough not to expect a vampire of Noel’s age to act in a more modern fashion. “No bloodshed,” she said, leaning forward to cup his cheek, claim his mouth with a soft kiss. “Christian is a useful member of my court.”</p><p>Twenty minutes later, Noel leaned back against the wall beside Nimra’s writing desk and watched her walk to the armoire where she kept the Midnight. Her wings were an exotic temptation, reaching out to touch them an impulse he resisted only because neither of them was in the mood for play.</p> <p>Less than half a minute later, she turned, the vial of Midnight delicate even in her fine- boned hands. Walking to the window, she held it up to the light. Darkness crawled a stealthy shadow across her face. “Yes,” she murmured at last, “you are right. There is not as much Midnight as there should be.”</p><p>He hadn’t wanted to be right. “You’re certain?”</p><p>A nod that sent liquid sunlight gleaming over the blue- black tumble of her hair. “The vial is ringed with circles of gold.” She ran her fingers over and along those thin lines. “It is no more than an aesthetic design, but I remember looking at the bottle when it was first given to me and thinking of what some would do for this infinitesimal quantity of Midnight— it just reached over the third line of gold.”</p><p>Noel crouched down by the window as she held the vial level on the sill. It took a bare few moments for the viscous fluid to settle. When it did, it became apparent that it now hovered between the second and third line. He blew out a breath.</p><p>“I would that you were wrong, Noel.” Leaving the Midnight in his hands, Nimra walked across the room, her wings trailing on the amber- swirled blue of the carpet. “The fact that the assassin came into my chambers and took this means two things.”</p> <p>“The first,” Noel said, placing the vial inside the safe and locking it shut, “is that he or she knew it was here.”</p><p>“Yes— I can count those who have that knowledge on the fingers of one hand, and not use up my fingers.” A desolate sadness in every word. “The second is that it means no other powerful angel was involved in this. The hatred is theirs alone.”</p><p>Noel didn’t attempt to comfort her, knowing there could be no comfort— not until the truth was unearthed, the would–be murderer’s motives exposed to the light of day. “We need to get an evidence tech in here to see if there are any prints on the vial or the safe that shouldn’t be there.”</p><p>Nimra looked at him as if he were speaking a foreign language. “An evidence tech?”</p><p>“It is the twenty- first century,” he said in a gentle tease, his chest aching at the hurt she would soon have to hide, becoming once more the angel who ruled this territory, ruthless and inhuman. “Such things are possible.”</p><p>Her eyes narrowed. “Laugh at me at your peril.” But she didn’t resist when he tugged her into his arms.</p> <p>He ran his hand down her back, over the heavy warmth of her wings. “I can get hold of someone we can trust.”</p><p>“To have such a person come into my home— it’s not something I welcome.” She raised her head, those amazing eyes steely with determination. “But it must be done and soon. Christian has begun to question your presence here beyond that which can be explained by jealousy, and Asirani watches you too closely.”</p><p>Prick or not, Noel had never discounted Christian’s intelligence. The only surprise was that it had taken the male angel this long to wise up— no doubt his feelings for Nimra had clouded his judgment. As for Nimra’s social secretary—“Asirani watches me to make sure I don’t hurt you.”</p><p>Nimra pushed off his chest, her tone remote as she said, “And are you not afraid that I will hurt you?”</p><p>Yes. Compelling and dangerous, she’d forced him awake from the numb state he’d been in since the torture. His emotions were raw, new, acutely vulnerable. “I’m your shield,” he said, rather than exposing the depth of his susceptibility to her. “If that means taking a hit to protect you, I’ll do it without the slightest hesitation.” Because Nimra was what angels of her age and power so often weren’t— strong, with a heart that still beat, a conscience that still functioned.</p><p>She cupped his face, such intensity in her gaze that it was a caress. “I will tell you a secret truth, Noel. No lover has stood for me in all my centuries of existence.”</p><p>It was a punch to the heart. “What about Eitriel?”</p><p>Dropping her hands, she turned her head toward the window. “He is no one.” Her words were final, a silent order from an angel used to obedience.</p> <p>Noel had no intention of allowing her to dictate the bounds of their relationship. “This no one,” he said, thrusting his hands into the rich silk of her hair and forcing her to meet his gaze, “walks between us.”</p><p>Nimra made as if to pull away. He held on. Expression dark with annoyance, she said, “You know I could break your hold.”</p><p>“Yet here we are.”</p><p>CHAPTER 9</p><p>He was impossible, Nimra thought. Such a man would not be any kind of a manageable companion— no, he would demand and push and take liberties beyond what he should. He would most certainly not treat her with the awe due to her rank and age.</p><p>Somewhat to the surprise of the part of her that held centuries of arrogance, the idea enticed rather than repelled. To be challenged, to pit her will against that of this vampire who had been honed in a crucible that would’ve savaged other men beyond redemption, to dance the most ancient of dances... Yes.</p><p>“Eitriel,” she said, “was what a human might call my husband.” Angels did not marry as mortals did, did not bind one another with such ties. “We knew one another close to three hundred and forty years.”</p><p>Noel’s scowl was black thunder. “That hardly makes him ‘no one.’”</p><p>“I was two hundred when we met—”</p><p>“A baby,” Noel interrupted, hands tightening in her curls. “Angels aren’t even allowed to leave the Refuge until reaching a hundred years of age.”</p><p>She raised an eyebrow. “Do release my hair, Noel.”</p><p>He unflexed his hands at once. “I’m sorry.” Gentle fingers stroking over her scalp. “Bloody uncivilized of me.”</p><p>Unexpected, that he made her want to smile, when she was about to expose the most horrific period of her life. “We are both aware you will never be Christian.”</p><p>His eyes gleamed. “Now who’s walking a dangerous road?”</p><p>Lips curving, she said, “Not a baby, no, but a very young woman.” Because of their long life spans, angels matured slower than mortals. However, by two hundred, she’d had the form and face of a woman, had begun to spread her wings, gain a better understanding of who she would one day become.</p><p>“Eitriel was my mentor at the start. I studied under him as he taught me what it was to be an angel who might one day rule, though I didn’t realize that at the time.” It was only later that she’d understood Raphael had seen her burgeoning strength, taken steps to make sure she had the correct training.</p><p>Noel’s hand curved over her nape, hot and rough. “You fell in love with your teacher.”</p><p>The memories threatened to roll over her in a crushing wave, but it wasn’t the echo of her former lover that caused her chest to fill with such pain as no woman, mortal or immortal, should ever have to experience. “Yes, but not until later, when such a relationship was permissible. I was four hundred and ninety years old.</p><p>“For a time, we were happy.” But theirs had always been the relationship of teacher to pupil. “Three decades into our relationship, I began to grow exponentially in power and was assigned the territory of Louisiana. It took ten more years for my strength to settle, but when it did, I had long outstripped Eitriel. He was... unhappy.”</p><p>Continuing to caress her nape, Noel snorted. “One of my mortal friends is a psychologist. He would say this Eitriel had inadequacy issues— I’ll wager my fangs he had a tiny cock.”</p><p>Her laugh was shocked out of her. But it faded too soon. “His unhappiness poisoned our relationship,” she said, recalling the endless silences that had broken her heart then, but that she’d later recognized as the petulant tantrums of a man who didn’t know how to deal with a woman who no longer looked upon his every act with worshipful adoration. “It came as no surprise when he told me he had found another lover.” Weaker. Younger. “He said I had become a ‘creature’ he could no longer bear to touch.”</p><p>Noel’s expression grew dark. “Bastard.”</p><p>“Yes, he was.” She’d accepted that long ago. “We parted then, and I think I would’ve healed after the hurt had passed. But”—her blood turning to ice—“fate decided to laugh at me. Three days after he left, I discovered I was with child.”</p><p>In Noel’s gaze, she saw the knowledge of the value of that incomparable gift. Angelic births were rare, so rare. Each and every babe was treasured and protected— even by those who would otherwise be enemies. “I would not have kept such a joy from Eitriel, but I needed time to come to terms with it before I told him.</p><p>“It never came to that. My babe,” she whispered, her hand lying flat over her belly, “was not strong. Keir was often with me that first month after I realized I carried a life in my womb.” The healer was the most revered among angelkind. “But he’d been called away the night I began to bleed. Just a little... but I knew.”</p><p>Noel muttered something low and harsh under his breath, spinning away to shove his hands through his hair, before turning in one of those unexpected bursts of movement to tug her into his arms. “Tell me you weren’t alone. Tell me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fen,” she said, heart heavy at the thought of her old friend grown so very frail, the light of his life beginning to flicker in the slightest wind. “Fen was there. He held me through the terrible dark of that night, until Keir was able to come. If I could Make Fen, I would in a heartbeat, but I cannot.” Tears clogged her voice. “He is my dearest friend.”</p><p>Noel went motionless. “He can walk freely into these rooms?”</p><p>“Of course.” She and Fen had never again been lady and liege after that stormy night as her babe bled out of her. “We speak here so we will not be interrupted.”</p> <p>Noel’s hands clenched on her arms. Frowning, she went to press him for his thoughts when the import of his question hit her. “Not Fen.” She wrenched out of his embrace. “He would no more harm me than he would murder Amariyah.”</p><p>“I,” Noel said, “have no idea of how that safe works, much less the combination. I wouldn’t even know where to begin. But Fen... he knows so many things about you. Such as the date you lost your babe, or the day your child would’ve been born.”</p><p>The gentle words were a dagger in her soul. Because he was right. Five decades ago, she’d changed the combination to what would have been her lost babe’s birthing day. It hadn’t been a conscious choice as such— the date was the first that had come into her mind, embedded into her consciousness. “I will not believe it.” Frost in her voice as she fought the anguish that threatened to shatter her. “And I will not allow this evidence technician to come here.”</p><p>“Nimra.”</p><p>She cut him off when he would’ve continued. “I will speak to Fen. Alone.” If her old friend had done this, she had to know why. If he had not— and she couldn’t bring herself to believe him capable of such treachery— then there was no cause for him to be hurt by the ugliness of suspicion. “Unless you think he’ll rise up to stab me while I sit across from him?”</p> <p>Noel made no effort to hide his irritation, but neither did he stop her as she headed for the door. Exeter was waiting to speak to her at the bottom of the staircase, as was Asirani, but she jerked her head in a sharp negative, not trusting herself to speak. Nothing would be right in her world until she’d unearthed the truth, however terrible it might be.</p><p>Fen wasn’t at home, but she knew his favorite places, as he knew hers.</p><p>“Ah,” he said when she tracked him down at the sun- drenched stone bench on the edge of the lily pond, his near- black eyes solemn. “Sadness sits on your shoulders again. I thought the vampire made you happy.”</p><p>Noel had dropped back as soon as Fen came into sight, giving her the privacy she needed. Heartsick, she took a seat beside her old friend, her wings draping on the grass behind them. “I have kept a secret from you, Fen,” she said, eyes on a dragonfly buzzing over the lilies. “Queen died not because her heart failed, but because she drank poison intended for me.”</p><p>Fen didn’t reply for a long moment undisturbed by the wind, the pond smooth glass under the wide green lily pads. “You were so sad,” he said at last. “So very, very sad deep inside, where almost no one could see it. But I knew. Even as you smiled, as you ruled, you mourned. So many years you mourned.”</p><p>Tears burned at the backs of her eyes as his wrinkled hand closed over her own where it lay on the bench between them. “I worried who would watch over you when I was gone.” His voice was whispery with age, his fingers containing a tremor that made her heart clench. “I thought the sadness might drown you, leaving you easy prey for the scavengers.”</p> <p>A single tear streaked down her face.</p><p>“I wanted only to give you peace.” He tried to squeeze her hand, but his strength was not what it had been when he first strode into her court, a man with an endless store of energy. “It broke my heart to see you haunting the gardens as everyone slept, so much pain trapped inside of you. It is arrogant of me to make such a claim, ridiculous, too, but... you are my daughter as much as Mariyah.”</p><p>She turned up her hand, curling her fingers around his own. “Do you think me so fragile, Fen?”</p><p>He sighed. “I fear I learned the wrong lessons from my other daughter. She is not strong. We both know it.”</p><p>“There would’ve been no one left to protect her after I was gone.”</p><p>“No. Yet still I could not bear your sadness.” Shaking his head, he turned to face her. “I knew I’d made a terrible mistake the very next day, when you faced the world with strength and courage once more, but by then, Queen was dead.” Regret put a heavy weight on every word. “I am sorry, my lady. I will take whatever punishment you deem fit.”</p><p>She squeezed his hand, emotion choking up her throat. “How can I punish you for loving me, Fen?” The idea of hurting him was anathema to her. He was no assassin, simply old and afraid for the daughters he’d leave behind. “I will not let Amariyah drown,” she promised. “As long as I draw breath, I will watch over her.”</p><p>“Your heart has always been too generous for a woman who wields so much power.” Making a clucking sound with his tongue, he waggled an arthritic finger. “It is good your vampire is hewn of harder wood.”</p> <p>This time it was Nimra who shook her head. “Such mortal thoughts,” she said, her soul aching with the knowledge of a loss that came ever nearer with each heartbeat. “I do not need a man.”</p><p>“No, but perhaps you should.” A smile so familiar, it would savage her when she could no longer see it. “You can’t have failed to notice that those angels who retain their... humanity through the ages are the ones who have mates or lovers who stand by them.”</p><p>It was an astute statement. “Do not die, Fen,” she whispered, unable to contain her sorrow. “You were meant to live forever.” She’d had his blood tested three years after he’d first come into her court, already aware that this was a man she could trust not to betray her through the ages. But the results had come back negative— Fen’s body would reject the process that turned mortal to vampire, reject it with such violence that he’d either die or go incurably insane.</p><p>Fen laughed, his skin papery under her own. “I’m rather looking forward to death,” he said with a chuckle that made his eyes twinkle. “Finally, I’ll know something you never have and maybe never will.”</p><p>It made her own lips curve. And as the sun moved across the lazy blue of the sky, as the sweet scent of jasmine lingered in the air, she sat with the man who would’ve been her murderer, and she mourned the day when he would no longer sit with her beside the lily pond as the dragonflies buzzed.</p><p>That day came far sooner than she could’ve ever expected. Fen simply didn’t awaken the next morning, passing into death with a peaceful smile on his face. She had him buried with the highest honors, in a grave beside that of his beloved wife. Even Amariyah put aside their enmity for that day, behaving with utmost grace though her face was ravaged by grief.</p><p>“Good- bye,” she said to Nimra after Christian, his voice pure and beautiful, had sung a heartfelt farewell to a mortal who had been a friend to angels.</p><p>Nimra met the vampire’s eyes, so akin to her father’s and so very dissimilar. “If you ever need anything, you know you have but to call.”</p><p>Amariyah gave her a tight smile. “There’s no need to pretend. He was the only link between us. He’s gone now.” With that, she turned and walked away, and Nimra knew this was the last time she’d see Fen’s daughter. It didn’t matter. She had put things in place— Amariyah wouldn’t ever be friendless or helpless if in need. This, Nimra would do for Fen... for the friend who would never again counsel her with a wisdom no mortal was supposed to possess.</p><p>A big hand sliding into hers, his skin rougher than her own. “Come,” Noel said. “It’s time to go.”</p><p>It was only when he wiped his thumb across her cheek that she realized she was crying, the tears having come after everyone else had left the graveside. “I will miss him, Noel.”</p><p>“I know.” Sliding his hand up her arm, he placed it around her shoulders and held her close, his body providing a safe haven for the sorrow that poured out of her in an anguished torrent.</p><p>In the days after Fen’s death, Noel began to discover exactly how much the old man had done for Nimra. From watching over her interests when it came to Louisiana’s vampiric residents to ensuring the court remained in balance, Fen had been the center even as he positioned himself on the edges. With his loss came a time of some confusion, as everyone tried to figure out their place in the scheme of things.</p><p>Christian, of course, tried to take over, but it was clear from the start that he had too much arrogance to play the subtle political games Fen had managed with such ease... and that Noel quietly began to handle. Politician he wasn’t, but he had no trouble putting any idea of rank aside to get things done. As for his right to be in the court at all, he hadn’t asked Nimra’s permission to remain, hadn’t asked anyone’s permission.</p><p>He’d simply called Dmitri and said, “I’m staying.”</p><p>The vampire, who held more power than any other vamp Noel knew, hadn’t been pleased. “You’re slated to be stationed in the Tower.”</p><p>“Unslate me.”</p><p>Silence, then a dark amusement. “If Nimra ever decides you’re too much trouble, I’ll have a place waiting for you.”</p><p>“Thanks, but it won’t be needed.” Even if Nimra did attempt to throw him out, Noel was having none of it. She was painfully vulnerable right now, and without Fen here to guard her secrets from those who would use her grief to cause her harm, someone had to watch her back. Mind set, he began to do precisely that, using the members of the court, senior and junior, to Nimra’s advantage.</p><p>Sharp, loyal Asirani was the first to catch on. “I always knew we hadn’t seen the real Noel,” she said, a glint in her eye, then passed him a small file. “You need to handle this.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It turned out to be a report about a group of young vampires in New Orleans who were acting out, having caught wind of Nimra’s grieving distraction. Noel was in the city by nightfall. All under a hundred, the vampires were no match for him— even together. He wasn’t only older; he was incredibly strong for his age. As with the angels, some vampires gained power with age, while others reached a static point and remained there.</p><p>Noel had grown ever stronger since he was Made, part of the reason he’d been pulled into the guard directly below Raphael’s Seven. When the vampires proved stupid enough to think they could take him on, he expended his pent–up energy, his protective fury at being unable to shield Nimra from the pain of Fen’s loss, on the idiots.</p><p>After they lay bleeding and defeated in front of him in a crumbling alleyway barely lit by the faint wash of yellow from a nearby streetlight, he folded his arms and raised an eyebrow. “Did you think no one was watching?”</p> <p>The leader of the little pack groaned, his eye turning a beautiful purple. “Fuck, nobody said anything about a fucking enforcer.”</p><p>“Watch your mouth.” Noel had the satisfaction of seeing the man pale. “This was a warning. Next time, I won’t hold back. Understood?”</p><p>A sea of nods.</p><p>Returning to his own room in the early-morning hours, while the world was still dark, Noel showered, hitched a towel around his hips, and headed into his bedroom with the intention of grabbing some clothes. What he really wanted to do was go to Nimra. She hadn’t slept since Fen’s death, would be in the gardens, but the fading bruise on his cheek where one of the vamps had managed to whack him with an elbow might alert her as to what he’d been up to. He wanted a little more time to settle into this new role before—“Nimra.”</p><p>Seated on the edge of his bed, her wings spread behind her and her body clad in a long, flowing gown of deepest blue, she looked more like the angel who ruled a territory than she had in days. “Where have you been, Noel?”</p> <p>CHAPTER 10</p><p>“New Orleans.” He would not lie to her.</p><p>A wrinkling of her brow. “I see.”</p><p>“Do you want the details?”</p><p>“No, not tonight.” Her gaze lingered on the damp lines of his body before she rose from the bed, her wings sweeping across the sheets. “Bonne nuit.”</p><p>He hadn’t touched her intimately since the night he’d fed from her, so hot and sweet, but now he crossed the room to stop her with his hands on the silken heat of her upper arms, his chest pressed to her back... to her wings. “Nimra.” When she stilled, he swept aside the curling ebony of her hair to press his lips to her pulse.</p> <p>Reaching back, she touched her fingers to his face. “Do you hunger?”</p><p>A simple question that staggered him with its generosity, but no longer surprised. Not now that he understood the truth of the woman in his arms. “Stay.” Kiss after kiss along the slender line of her neck, a delicate pleasure that made his skin go tight, his own pulse accelerate. “Let me hold you tonight.”</p><p>A moment’s pause and he knew she was weighing up whether or not to trust him with the depth of her vulnerability. When she shifted to face him, when she allowed him to take her into his arms, to take her to his bed, it turned a key in a dark, hidden corner of his soul, a part that had not seen the light of day since the events that had almost broken him. But they hadn’t. And now he was awake.</p><p>Nimra’s need for Noel was a deep, unrelenting ache, but she fought the urge to take, to demand, from this captivating male with wounds that would take a long time to truly heal. Then his eyes met her own as he braced himself above her, his fingers stroking the sensitive arch of her wing, and there was an intensity to them she’d never before seen. “Put your hands on me, Nimra.” A command.</p><p>One she was happy to accept. Running her foot over the back of his calf, her gown sliding down her leg, she began to explore the ridges and valleys of his body, so hard, so very masculine. He shuddered under her touch, his breath hot against her jaw as he grazed her with his teeth, his cock pressing in blatant demand against her abdomen.</p><p>No civilized lover, this.</p><p>“You are a beautiful man,” she whispered as she closed her fingers over the rigid evidence of his need.</p><p>Color darkened his cheekbones. “Uh, whatever you say.”</p> <p>“Such compliance, Noel?” She squeezed him, luxuriating in the velvet- soft skin covering such powerful steel. “I am not sure I believe you.”</p><p>A groan. “You have your hand on my cock. If you called me an ugly git, I’d agree with you. Just. Don’t. Stop.”</p><p>His unashamed pleasure made her entire body melt. Not only did she continue in her intimate caresses; she began to suck and kiss at his neck until he slammed his mouth down on her own, tender control transforming into untamed sexuality. Demanding and aggressive, he thrust his cock into her grip in time with the thrust of his tongue into her mouth.</p><p>His hand fisted in her gown at the same instant, pulling up the material until it bunched at her waist. His fingers were underneath the lace that protected her an instant later, making her arch, cry out into his kiss. Taking that cry as his due, he tore away the lace to stroke her to quivering readiness even as he pulled her hand off him. “Enough.” A ragged word against her lips, heavy hair- roughened thighs nudging her own apart.</p><p>She wrapped her legs around his hips as he flexed forward and claimed her with a single primal move. Spine bowing, she clung to him, her nails digging into the sweat-slick muscle of his back. When she felt his mouth settle on the pulse in her neck, it made a tremor shake her frame, the spot unbearably sensitive. Yes. She fisted one hand in his hair, held him to her. “Now, Noel.”</p><p>His lips curved against her skin. “Yes, my lady Nimra.”</p><p>A piercing pleasure radiated out from the point where he drank from her, while his body, his hands, shoved her ever closer to the precipice. Then the two streams of pleasure collided and Nimra flew apart... to come to in the arms of a man who looked at her with a furious tenderness that threatened to make her believe in an eternity that did not have to be drenched in loneliness.</p><p>Three days later, she found herself frowning at Asirani. “And there have been no other problems?” While she could believe her fellow angels wouldn’t have paid heed to the passing of a mortal, the vampires in the region had long dealt with Fen, understood the role he’d played. It defied belief that they hadn’t attempted anything while she’d been wracked by grief.</p><p>Asirani avoided her eyes. “You couldn’t quite say that.”</p><p>Nimra waited.</p><p>And waited.</p><p>“Asirani.”</p><p>A put- upon sigh. “You’re talking to the wrong vampire.”</p><p>Rather than chasing down the right one, Nimra decided to do her own probing. What she discovered was that “someone” had negotiated Fen’s passing with such skill that any ripples had been few and handled in a matter of hours. As far as the outside world was concerned, Fen’s decades of service had been forgotten as soon as he was gone, his death a mere inconvenience rather than a splintering pain that had ripped apart her chest, filled her eyes.</p><p>Later that day, she discovered that her reputation as an angel not to be crossed had in fact grown in the time she’d spent mourning her friend. “Why do I have a letter of apology from the leader of the vampires in New Orleans?” she asked Christian. “He seems to believe I’m an inch away from executing his entire kiss in a very nasty way.”</p><p>“His vampires misbehaved,” was the response. “It was taken care of.” His face, acetic and closed, told her that was all she’d get.</p><p>Intrigued at both the defiance and the realization that Noel and Christian appeared to have reached some kind of an understanding, she finally cornered the man responsible for a political game that had, from all indications, been played with none of Fen’s subtlety— and yet garnered excellent results. “How,” she said to Noel when she discovered him in the wild southern gardens, “did you acquire the title of my enforcer?”</p><p>He jumped up from his kneeling position with a distinctly guilty— and young— look on his face. “It sounded good.”</p><p>When she tried to look around him, and to whatever it was that he was hiding under the shade of a bush laden with tiny blossoms of pink and white, he shifted to block her view. Scowling, she tapped the letter of apology against her legs. “What did you do in New Orleans?”</p><p>“The vampires didn’t learn their lesson the first time.” Cool eyes. “I had to get creative.”</p><p>“Explain.”</p><p>“Heard of the word ‘delegation’?” An unflinching stare.</p><p>Her lips curved, the ruler in her recognizing strength of a kind that was rare... and that any woman would want by her side. “How are my stocks doing?”</p><p>“Ask Christian. He has a computer for a brain— and I had to give him something to do.”</p><p>Unexpected, that he’d shared power after taking it with such speed and without bloodshed. “Is there anything I need to know?”</p><p>“Nazarach’s hounds were nosing around about a week ago, but seems like they had to return home.” A shrug as if he’d had nothing to do with it.</p><p>“I see.” And what she saw was a wonder. This strong male, who was very much a leader, had put himself in her service. Unlike Fen, Noel had intimate access to her, and yet even when she’d been at her most vulnerable, there had been no sly whispers in the sinuous dark, only a luxuriant pleasure that muted the jagged edge of loss.</p><p>Before she could form words from the fierce cascade of emotion in her heart, she heard a distinct and inquisitive “meow.” Heart tumbling, she tried to see around those big shoulders once more, but he turned to block her view as he crouched down. “You were supposed to stay quiet,” he murmured as he rose back up and turned to face her.</p><p>The two tiny balls of fur in his arms— comically colored in a patchwork of black and white— butted their heads against his chest, obviously aware this wolf was all bark when it came to the innocent. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh!” She reached out to scratch one tiny head and found the kittens being poured into her arms. Squirming and twisting, they made themselves comfortable against her. “Noel, they’re gorgeous.”</p><p>He snorted. “They’re mutts from the local shelter.” But his voice held tender amusement. “I figured you wouldn’t mind two more strays.”</p><p>She rubbed her cheek against one kitten, laughed at the jealous grizzling of the second. Such tiny, fragile lives that could give so much joy. “Are they mine?”</p> <p>“Do I look like a cat man?” Pure masculine affront, arms folded across his chest. “I’m getting a dog— a really big dog. With sharp teeth.”</p><p>Laughing, she blew him a kiss, feeling younger than she had in centuries. “Thank you.”</p><p>His scowl faded. “Even Mr. Popinjay cracked a grin when one of them tried to claw off his shoe.”</p><p>“Oh, they didn’t.” Christian was so vain about those gleaming boots. “Terrible creatures.” They butted up against her chin, wanting to play. “It’ll be good to have pets around again,” she said, thinking of Mimosa when she’d been young, of Queen. The memories were bittersweet, but they were precious.</p><p>Noel walked closer, reaching out to rub the back of the kitten with one black ear and one white. The other, she saw, had two white ones tipped with black. “I’m afraid there’s a condition attached to this gift.”</p> <p>Hearing the somber note in his voice, she put the kittens on the ground, knowing they wouldn’t wander too far from the cardboard box where they’d evidently been napping. “Tell me,” she whispered, looking into that harsh masculine face.</p><p>“I’m afraid,” he said, opening his fist to reveal a sun- gold ring with a heart of amber, “the archaic human part of me requires this one bond after all.”</p><p>Amber was often worn by those mortals and vampires who were entangled in a relationship. Nimra had never worn amber for any man. But now she raised her hand, let him slide the ring onto her finger. It was a slight weight, and it was everything. “I do hope you bought a matching set,” she murmured, for it seemed she, too, was not quite civilized enough to require no bonds at all.</p><p>Not when it came to Noel.</p><p>His smile was a little crooked as he reached into his pocket to pull out a thicker, more masculine ring set with a rough chunk of amber where hers was a delicate filigree with a polished stone. “Perfect.”</p><p>“We won’t be able to have children.” He spoke the solemn words as she slid the ring onto his finger with a happiness that went soul deep. “I’m sorry.”</p> <p>A poignant emotion touched her senses, but there was no sorrow. Not with an eternity colored by wild translucent blue. “There will always be those like Violet who need a home,” she said, rubbing her thumb over his ring. “Blood of my blood they might not be, but heart of my heart they will be.”</p><p>Eliminating the small distance between their bodies, Noel stroked his fingers down her left wing, a slow glide that whispered of possession. As did the arms she slid up his chest to curve over his shoulders. There were no words, but none were needed, the metal of his ring warm against her cheek when he cupped her face.</p><p>Her wolf. Her Noel. </p> </body></html>"]