["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It's a Wonderful Tangled Christmas Carol (Tangled, #4.5)</p><p>Emma Chase</p><p>For those who cherish memories with family and still believe in the magic of the holidays.</p><p>chapter 1</p> <p>Deck the halls with boughs of holly,</p><p>Fa la la la la, la la la la.</p><p>’Tis the season to be jolly,</p><p>Fa la la la la, la la la la.</p><p>Urban legends. We’ve all heard of them—eating pop rocks and soda will make your stomach explode; the tourist who gets his kidney stolen in a faraway land; alligators living in the sewers. By the time you reach adulthood, you realize they’re all crocks of shit. Stories that get passed on from generation to generation to scare the hell out of us and keep us on the straight and narrow.</p> <p>Well . . . except for the alligator one—I’ve lived in New York City my whole life and that’s completely possible.</p><p>But the others, yeah, all lies.</p><p>In the latter part of the last century, new urban legends sprung up that society’s all too willing to fall for: action stars who die on movie sets doing stunts; rain-forest plants that cure obesity; and Justin Bieber actually having a set of balls.</p><p>Sometime in the late 1970s, after the city’s crime rate began to drop and New York became more tourist friendly, another urban legend was started—one that annually throws a fucking wrench into the otherwise smoothly operating machine that is my life.</p><p>That would be the myth that New York City is a prime place to go Christmas shopping.</p><p>I don’t know what moron started the rumor, but I will gladly stick my foot up his ass if I ever find out. Because now, scores of people from Pennsylvania, New Jersey, Connecticut, and upstate clog our bridges, tunnels, and streets from Black Friday to Christmas Eve, scurrying to make their holiday purchases like rats going after a gourmet piece of cheese. To get little Timmy a train set from FAO Schwarz and grandma a brooch from Tiffany.</p> <p>Sure, they’ve heard of the Internet. Of course they know it’d be easier—and less expensive—to order online and have packages delivered right to their front door.</p><p>But for them, it’s not about what’s easier. Christmas shopping in the city is now—say it with me—tradition.</p><p>They want to see the big tree, the lights. They want to stand in an endless line to skate in Rockefeller Center and take a picture with Santa at Macy’s in Herald Square. They want to watch the fucking Rockettes and eat a family dinner at a restaurant whose menu has been price-gouged to the gills.</p><p>You can forget about getting a cab—they’re all taken. And even walking down the sidewalk is an exercise in frustration, because every few feet a stroller-pushing, shopping-bag-carrying tourist will come to a complete frigging stop right in front of you to take a picture of the red-and-green-lit Empire State Building.</p><p>You think I sound pissed off? How very perceptive of you. The Christmas spirit and me? We’re not friends. Ebenezer Scrooge had the right idea: bah fucking humbug.</p><p>The reason for my current antiholiday rant is because I’m in line—the same line I’ve been in for forty-five minutes—trying to buy a last-minute gift for my perfect wife.</p><p>Please, take my money and just let me fucking leave.</p><p>When it comes to gifts, I’m usually way ahead; eleventh-hour purchases aren’t my style. But walking past Saks Fifth Avenue, I saw a pair of Valentino crystal and silk heels that would look amazing on Kate. She’ll enjoy wearing them, and I will definitely enjoy watching her wear them—especially naked—so it’s a win-win.</p> <p>Except for the line.</p><p>I’m not used to waiting in lines. I’m used to personal shoppers and commission-seeking salespeople vying for my attention with phrases like, “Can I hold that for you, Mr. Evans?” “We have that in four other colors, Mr. Evans.” “Would you like that wrapped, Mr. Evans?”</p><p>But this is Christmas Eve. Which means stores don’t give a crap about the quality of the shopping experience. It’s all about quantity—getting as many shoppers through their doors as possible before closing time. Which brings me to my next point:</p><p>Most people in the world today are fucking idiots.</p><p>Don’t laugh—you may be one of the walking stupid and just not know it. But it’s true. Say what you want about income inequality or the inferior public school system—the harsh truth is, the majority of the population is simply not intelligent. And even more suck at their job. They don’t give a rat’s ass about doing it well or longevity; they’re only interested in performing the minimum required to get a check.</p><p>And there’s no better example of that than the temporary holiday employee. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Companies don’t hire them because of their skill or what they may contribute to the work force. They’re hired because they have a pulse. Spare bodies, decked out in holiday ensembles, whose main purpose is to corral consumers the same way a fence encages cattle. And they’re equally as helpful.</p><p>The twentysomething blonde behind the register is one such employee. You can tell by the slow, cautious way she pecks at the keys and her confused expression if someone—God forbid—asks her where an item can be found. She’s the reason for the sick amount of time I’ve wasted waiting to buy these shoes.</p><p>The good news is, I’m about to cross the finish line. I step up, with only one more customer left in front of me—a tall, regal-looking older lady in a pricey red coat and genuine pearl earrings. I take out my wallet so I can pay as quickly as possible and get the hell out of here.</p><p>See the blazing yule before us,</p> <p>Fa la la la la la, la la la la.</p><p>Strike the harp and join the chorus,</p><p>Fa la la la la, la la la la</p><p>But my hope of an imminent escape is crushed when the blond temp rings up the purple Burberry of London tie and tells the old lady, “That will be one hundred and ninety-five dollars and thirty cents.”</p><p>Pearl Earrings looks offended. “That can’t be correct. This tie is on sale for one hundred and fifty dollars—not one eighty.”</p> <p>A panicked expression swamps the blonde’s face. She taps a few buttons on the register and swipes the tie’s bar code with the red laser beam. “It’s ringing up at one hundred and eighty. Plus tax.”</p><p>I push a hand through my dark hair and listen for the predictable old woman response.</p><p>“That’s false advertising! I refuse to pay a penny over one fifty.”</p><p>The hopeless temp looks around for assistance, but there’s none to be found. So, like the knight in shining armor I am, I come to her rescue.</p><p>“Why don’t you do a manual override?”</p><p>Her eyes gaze at me without a clue. “A what?”</p> <p>I gesture to the register. “It’s a computer—it has to do what you tell it to. Override the price and put it in as one fifty.”</p><p>She gulps. “I . . . I don’t know how to do that.”</p><p>Of course she doesn’t.</p><p>“I’m going to have to find my manager.”</p><p>No. No way I’m gonna stand here twiddling my thumbs for another twenty frigging minutes. And I refuse to walk out, either—too much of my precious time is already invested in these shoes.</p><p>Despite the frustration churning in my gut, I shift my attention to the pearl-wearing red coat and turn on the charm that—even with a ring on my finger—women of all ages are still helpless to resist. “Last-minute Christmas shopping?”</p><p>She nods. “That’s right, for my husband.”</p><p>“You have excellent taste. I’m a connoisseur of ties myself, and that one is superb.”</p> <p>It’s working—she smiles. “Thank you, young man.”</p><p>“Tell you what, how about we save some time and I’ll front the extra thirty dollars so you can purchase this tie for your lucky husband, at not a penny over one hundred and fifty dollars?”</p><p>Her brow wrinkles. It was already wrinkled with age—but now it wrinkles more.</p><p>“It’s not about the cost, it’s the principle of the matter. They should stand by the price advertised.”</p><p>“I couldn’t agree more. Principles are important—which is exactly why I’m making my offer. Here it is, Christmas Eve, and I’ve been too busy to show any goodwill toward my fellow man—or woman. This gesture will make me really feel the Christmas spirit. You’d be doing me a favor, miss.”</p><p>The “miss” was just the right touch. Because her eyes sparkle, and she grins warmly. “Well, when you put it that way, how can I say no?”</p><p>I wink. “I guess you can’t.”</p><p>I smack thirty dollars on the counter and the old lady hands over her black card. While the very relieved temp places the boxed tie in a shopping bag with a ridiculous amount of useless tissue paper, Pearl Earrings glances at my left hand. Then she pulls a business card out of her purse, slides it toward me, and whispers low, “My husband and I host parties every month. Parties for . . . adventurous . . . couples.”</p><p>Oh boy.</p><p>“You’d certainly be doing me a favor if you attend.” She winks. “I would thoroughly enjoy having you. Think about it.”</p><p>I wait until she walks away before I chuckle. Just goes to show you—don’t judge a freak by their cover. The wild ones come in all shapes, sizes . . . and ages.</p><p>The holiday-hire hands me my prized shoes, and I’m finally able to head home to my wife and our terribly wonderful son.</p><p>Follow me in merry measure,</p><p>Fa la la, la la la, la la la.</p><p>While I tell of Yuletide treasure,</p><p>Fa la la la la, la la la la</p><p>I shut the door to our apartment and toss the mail down on the front hall table—mostly last-minute Christmas cards. Nothing says “you were an afterthought” like getting a Christmas card on Christmas Eve. I hang up my black wool coat and slide the shopping bag with Kate’s new shoes under the table, to be wrapped later. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Unlike me, Kate is good about waiting. She likes to be surprised, so I don’t have to put in the extra effort of hiding her gifts to keep her from sneaking a peek.</p><p>I walk into the living room—and stop dead in my tracks. I was planning on going home only for a few minutes, to let Kate know I’d be at the office the rest of the evening. But those plans get tossed out the window.</p><p>Because reclining in the chaise longue is a gift that beats the hell out of anything I’ve ever seen sitting under a tree.</p><p>My wife, Kate Brooks-Evans.</p> <p>Kate Brooks-Evans in lingerie.</p><p>Kate Brooks-Evans in see-through, Christmas-themed lingerie.</p><p>Her smooth legs are crossed at the ankle, bare except for the spiky heeled, shiny black boots that end below her knees. A sheer red nightie, trimmed in fluffy white fur, covers tiny red panties—held together by two silk bows tied at her hips. A shiny black belt cinches her flat stomach, and more white fur embellishes the strapless neckline, bringing my attention to her perfect breasts and pink nipples pressing against the gauzy fabric. Kate’s luscious dark hair falls over her shoulders, curled at the ends, and a fleecy red-and-white Santa hat sits on top of her head.</p><p>She smiles mischievously. “Welcome home, Santa.”</p><p>“Mrs. Claus,” I smirk, “you’ve changed.”</p> <p>“It was time for a makeover.”</p><p>I start unbuttoning my shirt. “Want to sit on my lap . . . or my face . . . and tell me if you’ve been a nice girl this year?”</p><p>Kate chuckles. Then she tucks her legs under her, rises onto all fours, and crawls down the chaise toward me.</p><p>It’s so damn sexy my cock stiffens so hard that you could hang an ornament from it.</p><p>“Well, I’ve tried to be nice, but every time I look at you, the naughty just takes over.”</p><p>Kate bites her lip—’cause she knows it drives me crazy—and watches my every move as I toss my shirt on the floor. Her eyes caress my arms, chest, and abs, then focus on my fingers as I slowly unbutton my jeans and lower the zipper.</p> <p>I shrug. “I’ve always thought ‘nice’ was way fucking overrated.”</p><p>With my typical lack of shyness, I push my pants down and step out of them. My dick juts out proudly, eye level with Kate, straining for her attention. But before she touches me, I remember James—our five-year-old.</p><p>“Where’s the evil elf, by the way?”</p><p>“I dropped him off at your sister’s. He’s decorating gingerbread cookies with Mackenzie and Thomas.”</p><p>“And biting their heads off?”</p><p>“Of course.”</p><p>Here’s an interesting fact: how you eat a gingerbread man says a lot about your personality. Head-first eaters are ambitious, independent, and magnetic. Feet-first are the more artistic, creative types, and those who start with the hands are kind and nurturing. Same rules apply for chocolate Easter bunnies.</p><p>Maybe you’re wondering how I came to know this information?</p> <p>I looked it up. Because James is a head-first eater.</p><p>And Kate and I were . . . unsettled . . . by all the headless chocolate bunnies lying around last Easter.</p><p>But—good news—he’s not a serial killer in the making, he just has the same driven, bound-to-be-a-success temperament as his parents.</p><p>During my research, I also discovered that sociopaths and CEOs share a lot of character traits—but we’ll talk about that another time.</p><p>There are other, more crucial matters at hand.</p><p>“So, we have the whole apartment to ourselves?” I ask.</p><p>Kate licks her lips happily. “Yep.”</p><p>My dick gets even harder, thinking of the possibilities. “That means we can fuck in the living room? The hallway? The kitchen?”</p><p>A center island is the perfect height to comfortably eat a woman out while she’s perched on the counter.</p><p>Coincidence?</p><p>I think not.</p><p>Kind of makes you rethink the meaning of “eat-in kitchen,” doesn’t it?</p><p>Kate replies, “Yes. Yes. And definitely yes. I’ve missed kitchen sex.”</p><p>I’ve missed bending her over the arm of the sofa and pounding her from behind.</p><p>Oh—and sleeping naked. I haven’t slept naked for a year and a half. Not since my son crawled into our bed in the middle of the night and asked why I wasn’t wearing pajamas. Telling him the truth—that it’s liberating and makes it more convenient to screw his mother—was out of the question. So I just said I forgot.</p><p>He thought that was funny. And I’ve slept in boxers almost every night since.</p><p>When people tell you having kids changes things—they’re not screwing around. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But all thoughts of our child fly out of my head as Kate envelops my dick in her warm, wet mouth. My head lolls back, relishing the sensation of her stroking tongue. But after a few seconds, I have to look and take in the sensual sight of Kate’s head bobbing up and down, doing what she does so very well.</p><p>My hand skims her spine. I lift the sheer red fabric, exposing her firm ass, scarcely covered by the red silk panties. My stomach contracts in hot pleasure as she sucks me harder. I pull on the red ribbons tied at her hips and the panties fall away. Then I knead the soft flesh of her ass before sliding my fingers between her open legs—into her warm *. She’s already slick for me; her muscles tighten around my fingers as I pump them slowly.</p><p>I pull my hips back and I slide out of Kate’s awesome mouth. I cradle her face with my hands and bring her up to meet my lips. We kiss playfully, my teeth scraping along her jaw to her neck, licking and sucking—both of us moaning. I wrap an arm around her waist and lift her to her feet, dragging us to the couch.</p><p>Without a word, Kate assumes my favorite position—bent at the waist, her stomach draped over the arm, feet apart, her delectable ass high and waiting. Her hands brace against the cushions and my hand rests on her shoulder. My other hand grasps my dick and makes two teasing passes across the opening of her sweet cunt. She wriggles back against me, reaches out her hand, and pushes behind my thigh—trying to maneuver me where she needs me to be.</p><p>Always so eager.</p><p>Although our sex life is fantastically frequent, we can’t be as . . . vocal . . . as we once were. Not with a kid in the house. So I plan on taking advantage of this opportunity to hear Kate’s voice in all its hedonistically desperate beauty.</p><p>I cover her—my chest flush with her back—nudge her silken hair with my nose, and bring my lips to her ear. “Do you want me to fuck you, baby?”</p><p>“Mmm,” she groans. “Yessss.”</p><p>I nip her earlobe. “Tell me.”</p><p>“Fuck me,” she whispers.</p><p>Yeah. She’s gonna have to do better than that.</p><p>I straighten up, smiling, and tease her again with the head of my dick. “I’m sorry, I didn’t quite get that.”</p><p>Her hips squirm with frustration, and she yells, “I want you to fuck me, Drew!”</p><p>Almost.</p><p>“God, now . . . do it . . . please. Fuck . . .”</p><p>Beautiful.</p><p>I push inside her with a moan and her back arches. I rest my hand on her hip, holding her in place as I rear back. Then thrust in long and slow and deep.</p><p>“Yes,” she keens loudly. “Just like that.”</p><p>I look down where I move in and out of her—disappearing into her gorgeous, welcoming body. It’s a view that never gets old.</p><p>“Christ, you feel good, Kate. Always so goddamn good.”</p><p>It’s true. And it’s got nothing to do with the fact that Kate’s is the only * I’ve ever been inside without a rubber.</p><p>It’s her. The life we’ve made together—the way she matches me in every way—her desire, her humor, her mind.</p><p>Her soul.</p> <p>I used to think that stuff about soul mates was bullshit. The idea that out of the billions of people on Earth, there was only one that you’re supposed to be with. That you belong to. Sounded like a fairy tale, a stupid chick flick, or a terrible romance novel that my sister would read.</p><p>But now . . .</p><p>Now I believe there’s something to it. Maybe not for everyone—but definitely for us. Because I just can’t fathom having this profound, intense love that borders on obsession—the good kind—with anyone except her.</p><p>It’s crazy. Like . . . a miracle.</p><p>The rhythm of my hips speeds up, ’cause it feels too fucking amazing not to. And Kate drives back against me, meeting me thrust for thrust and moan for moan.</p><p>But then I find the strength to grasp her waist with both hands.</p><p>And still our movements.</p><p>I pull out and Kate groans, “Don’t stop.”</p><p>I spin her around, cup her ass, and press her against me with a squeeze. She stands on her toes to trail hot kisses across my throat.</p><p>“I want you on top,” I explain with a grin. “I want you to ride me.”</p><p>Kate wiggles her eyebrows. “So you can watch my ‘bells’ jingle.”</p><p>I laugh. “Exactly.”</p><p>She pushes my shoulders, backing me up to the couch. I sit down heavily and she wastes no time climbing aboard. I surge up into her—deeper from this angle—and once again thank God for the wonderfully tight grip of Kate’s snatch.</p><p>She closes her eyes and rocks against me. I yank the strapless nightie down, freeing her breasts, and they jiggle as she rotates her hips in tantalizing circles. I palm them in my hand, so soft and full. Kate gasps as I pinch her already puckered nipples. And she groans when I replace my fingers with my lips. Suckling greedily, I rub my tongue against the pointy peak, savoring the exquisite taste of her skin. Kate rises and falls on me quicker—bucking harder.</p><p>When I grasp her nipple between my teeth, she holds the back of my head—pressing me against her—pulling my hair. I moan around her flesh and lave at her breast. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And then Kate stiffens, and the sound of her screaming my name echoes around the room as her inner walls clamp down. My fingers dig into her hips as I thrust up once, twice more, then I’m pulsing inside her, grunting and cursing against her chest.</p><p>For a few moments we stay right there—catching our breath. Until Kate leans back and gently brushes my black hair from my forehead. “Were you surprised?”</p><p>“Very pleasantly, yes.”</p><p>Her smile is joyful. “Good. It’s nice to finally give you a present that you didn’t already know was coming.”</p> <p>I kiss her soft lips. Then glance down the hall toward the kitchen. “Speaking of coming . . .”</p><p>Later, after some quality countertop time, Kate and I lay bare ass on the chaise longue, under a downy red throw blanket—recuperating.</p><p>I check my watch. Shit. I have to go, though a big part of me—the large lower part—wants nothing more than to stay right in this spot with my wife. But I kiss Kate’s forehead and force myself to stand. I grab my discarded shirt from the floor, slipping my arms into it.</p><p>Kate rests back on her elbows. “What are you doing?”</p><p>I can’t find my underwear, so I slide on my jeans without them—being ever so careful with the zipper. “I’m going to head into the office for a few hours.”</p> <p>“But . . .” Kate stutters. “. . . but it’s Christmas Eve.”</p><p>“I know. But Media Solutions is finally ready to have a sit-down with Hawaii. We’re going to video conference at nine our time. That only gives me three hours to prep.”</p><p>Media Solutions is a conglomerate I’ve been courting for weeks, and I’ve finally got them right where I want them on a deal that’ll revolutionize social media. Think Twitter, reality TV, and YouTube combined—posting broadcasts from and on your television, the star of your own channel.</p><p>Narcissistic techies will bow down like it’s the second coming of Steve Jobs.</p><p>I give Kate a wink. “But your holiday seduction was definitely worth the lost work time. That Mrs. Claus outfit is going straight to the top of the spank-bank pile.”</p><p>She blinks and sits up straight. The blanket falls down, exposing one creamy breast . . . and suddenly three hours seems like a whole lot of extra time.</p> <p>I can make do with two.</p><p>“I’m not worried about your lost work time, Drew. Why are you working at all?” Her enunciation sharpens—the way you’d talk to an old person who’s hard of hearing. “It’s Christmas Eve.”</p><p>Kate Brooks-Evans is many things—a loving wife, an amazing mother, a brilliant businesswoman. It’s that last one that has me expecting her to understand my rationale.</p><p>“If I don’t do this tonight, I lose the deal.”</p><p>“Then you should have told them it’s their loss, not yours.”</p><p>“And you think that’s what you would’ve done if you were in my position?”</p><p>“Absolutely.”</p><p>I button my shirt. And call bullshit. “Easy to say when the deal isn’t actually on your desk, Kate.”</p> <p>She doesn’t confirm or deny my observation, which means I’m on right on the money. She stands and wraps the blanket snugly around her body. Kate hiding her assets from my appreciative gaze is never a good sign. “We’re supposed to be at your sister’s in an hour for dinner. They’re expecting us.”</p><p>Her mouth is pursed, her cheeks are flushed, and there’s a fire in her eyes that . . . well . . . that gives me a renewed boner. Always has, always will.</p><p>My dick likes to argue. Sue him.</p><p>“Go without me. You can represent. Drink eggnog with my mother, pretend to listen to my old man talk about holidays past.”</p><p>Her voice rises. “I don’t want to represent! I want to spend the evening with my husband! There’s a time for work and a time for family, and tonight is supposed to be about family.”</p><p>“It is about family!” I counter, my voice doing a little raising of its own. “In the next several hours I’m going to make a shitload of money for our family.”</p><p>She shakes her head. “Oh, please. This has nothing to do with the money, Drew. Not for you.” Then a new thought occurs to her. “And what about James’s gifts? For weeks we’ve been pushing off putting his big presents together—the bike, the trampoline . . .”</p><p>Damn it. I forgot about those.</p><p>“I’ll see if Matthew can come over later and help you out. Until he does, after James is asleep, start to do it on your own.”</p><p>“If I’d known I was going to be alone, I would’ve gone home to see my mother.”</p><p>I step closer. “First of all, this is your home. Second, we talked about this—I’m not dragging James out to Bumfuck, Ohio, for Christmas. We’d be in line at airport security longer than we’d actually be at your mother’s!”</p><p>“We spent last Christmas with your side—”</p><p>“And if your side wanted to see us that badly, she could’ve hauled her ass to New York. She’s one person—our three beats her one. Majority rules, sweetheart.”</p><p>“Screw your ‘sweetheart’—I am so angry at you right now!”</p><p>I roll my eyes. “And we both know you’ll get over it.”</p><p>Kate’s mouth widens in a gasp. And a black boot comes hurtling at my head. She has the aim of a major-league closer, but in the last few years I’ve become a master ducker. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Smash.</p><p>Another lamp bites the dust.</p><p>“You’re an asshole!”</p><p>“A fact you were well aware of before you married me.” I shrug. “No take-backs.”</p> <p>Kate growls.</p><p>So hot.</p><p>Then she stomps down the hall into our bedroom and slams the door behind her, rattling the picture frames on the walls.</p><p>And they say men are the violent ones.</p><p>I sigh. I just don’t have time to deal with this right now. Don’t look at me like that—I’m not trying to be a prick. I love Kate; I hate that she’s mad. But give me a break—it’s one day. Why does she—why do women everywhere—have to make such a big fucking deal over one day?</p> <p>I put my shoes on, then walk down the hall and brace my hands on the frame of the bedroom door. And talk through it.</p><p>“Okay . . . so, I’m gonna head out.”</p><p>I wait. I listen.</p><p>Nothing.</p><p>“So that’s how you’re gonna play this? Not speaking to me? Real nice, Kate—very mature.”</p><p>Still nothing.</p> <p>I admit—her cold shoulder bothers me. Not enough to change my plans, but enough for me to try to talk her out of the silent sulk one last time.</p><p>“You’re not even gonna kiss me good-bye? What if I get pushed in front of a subway train by a deranged homeless person? It could happen. And if it does, you’re going to feel awful.”</p><p>That does the trick. The bedroom door is yanked open.</p><p>Kate stands there, with one hand on her hip and a sugary sweet smile on her face. “And we both know I’ll get over it.”</p><p>Then she slams the door in my face.</p><p>chapter 2</p><p>Although I don’t believe I have any actual firsthand knowledge, it’s colder than a witch’s tit outside. Wind cuts through the city streets and the sky is a gloomy gray, hinting at a coming snowstorm.</p><p>On the corner, a block from my building, a scraggily faced man in layered, shabby clothes shouts about the apocalypse—the end of days—and how we all need to turn our lives around before time runs out. It’s not an uncommon occurrence; guys like him litter the city. But today it seems weirdly . . . foreboding.</p> <p>I open the door to the building and am greeted by Sam, a security guard in his early twenties who typically helms the night shift.</p><p>“Merry Christmas, Mr. Evans.”</p><p>“Same to you, Sam.” He swipes my ID badge and I ask, “They put you on Christmas Eve?”</p><p>He shrugs. “I volunteered. Hard to argue with time and a half. Plus it gives the fellas with families time to spend at home.”</p><p>Guilt pokes at me like the spring of worn-out couch. But I ignore it. “You don’t have any family?”</p><p>“Not yet. My girlfriend and I are going to my mother’s for dinner tomorrow. She’s out in Yonkers.”</p><p>I slide my badge into my pocket and pull a fifty out of it. “I’ll be here pretty late tonight. In case I don’t catch you on the way out, have a happy holiday.” We shake hands and I slip him the fifty. Because I subscribe to my father’s line of thought: an employee who feels appreciated—and well compensated—is a productive employee. And if I want anyone to be productive, it’s the guy responsible for keeping the building safe.</p><p>He smiles gratefully. “Thanks a lot, Mr. Evans.”</p><p>I nod and head up the elevator to the fortieth floor.</p><p>The offices are dark, the only light coming from the full-size Christmas tree in the corner and the illuminated electric menorah on the table beside it. The whole floor is quiet and still.</p><p>Not a creature is stirring, not even a mouse.</p><p>I flick the lights on in my office and sit down at my desk to get to work. While my laptop boots up, I look at the phone.</p><p>And consider calling Kate.</p><p>I don’t like it when she’s pissed at me. It feels . . . wrong. Off-kilter. And it’s distracting. Tonight I need to be focused—on top of my game.</p><p>I don’t pick up the phone.</p><p>Because calling her to say I’m sorry, but I’m staying at the frigging office anyway, won’t go over well. Besides, she’s never been able to stay mad at me for long. By the time I get home, I bet she’ll be over it, just like I said.</p><p>An hour later, I’m staring at my computer screen, reviewing the proposal I’m gonna pitch to Media Solutions. I yawn deeply and my vision blurs. The scorching rechristening of our living room and kitchen must’ve worn me out more than I thought. I stretch my arms and crack my neck, trying to wake myself up.</p><p>But after five minutes, as I read paragraph seventeen, my eyelids become heavy. Until they droop and drag to a close.</p><p>I bolt awake at my desk—disoriented and slightly panicked. The way my grandfather used to snore away in his recliner, before jerking up and claiming he was just “resting my eyes.”</p><p>Glancing at my watch, I’m relieved to see it’s only been a few minutes since I dozed off. “Wake the fuck up, Evans. No time for a nap.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I head over to the conference room and make myself a quick cup of coffee. I sip the hot beverage of the gods and step back into my office.</p><p>And there, sitting on my suede couch—the same suede couch that played such a prominent role in my early Kate Brooks fantasies—is a woman.</p><p>Do you see her, too?</p><p>She’s strikingly beautiful. A pert nose, full lips, bright green eyes, and aristocratic cheekbones. Her hair is honey blond and long with a slight curl. She’s wearing a conservative white dress, blazer, and heels—something Kate would wear to the office. A string of pearls adorns her long neck and matching earrings decorate her lobes.</p> <p>“Hello,” she greets me in a warm voice.</p><p>My eyes dart from her to the door. Security always calls before letting a client up.</p><p>“Hi,” I return. “Can I . . . help you?”</p><p>“Actually, I’m here to help you, Drew.”</p><p>Huh. She knows my name.</p> <p>Has she crawled from the sea of my former one-night stands? It wouldn’t be the first time one tracked me down at my place of business. But with me riding the monogamy bandwagon these last eight years, it hasn’t happened for a long time.</p><p>“Have we met somewhere before?” I ask—but I really mean Have we fucked somewhere before?</p><p>She laughs, though I don’t know why. It’s a pleasant, alluring sound. “Always so clever. I’ve been watching you for a long time, Drew. You never fail to entertain.”</p><p>I set my coffee on the desk and face her head-on. “You’ve been watching me for a long time? Yeah, ’cause there’s nothing weird about that.”</p><p>“Well, it’s my job to watch you. I’m your guardian angel, after all.”</p><p>There’s a lot of crazy walking around New York City. And I don’t just mean the obvious vagrants mumbling around Penn Station or the naked cowgirl in Times Square. Professional dog walkers, bicyclists, and most employees of the sanitation department have several fucking screws loose, too.</p> <p>You have to be careful with insane people. Getting them worked up isn’t a good idea. So I just nod and try to keep her calm.</p><p>“Interesting. You don’t look like an angel.”</p><p>“How do you imagine I should look?”</p><p>“Wings, halo, blinding heavenly light.”</p><p>She winks. “I only bring the halo out for formal events. As for my wings . . . I’m still working on earning them.”</p><p>I snap my fingers. “That sounds familiar. To earn your wings, you have to, like, stop me from offing myself, right?”</p><p>Her jade eyes round with surprise. “Oh, nothing as drastic as that. If things became that desperate I wouldn’t be doing a very good job. I’m here because you’re starting down the wrong path, Drew. We need to nip your behavior in the bud; get you back to where you should be.”</p><p>With a chuckle, I sit down in my chair and roll closer to the phone.</p> <p>Her head tilts to the side, regarding me. “You don’t believe anything I’m telling you, do you?”</p><p>“I’m sorry, but no, I don’t.”</p><p>She’s unperturbed. “That’s all right. No one believes at first.”</p><p>You’re probably wondering why I’m not getting the hell out of here. I’m a fantastic judge of character, and in this case, I’m just not feeling the psycho vibe. In fact, despite the words that are coming out of her mouth, she seems completely harmless. So I play along.</p><p>“For argument’s sake, let’s suspend reality for a second and say that you are my guardian angel. I think I should fire you. You’ve done a shitty job. Where were you when I thought Kate was cheating on me, and I pulled that stupid stunt with the stripper? That would’ve been a good time to show up, kick me in the shin, and say, ‘Hey asshole, it’s not what you think.’?”</p><p>She nods sympathetically. “It was difficult to watch you go through that. But I couldn’t intervene. It was a lesson you could only learn by living through it. Kate, as well.”</p><p>“But you’re here now?”</p><p>“That’s right.”</p><p>“Because I’m about to commit some grievous sin?”</p><p>“Because you already have.”</p><p>I brace my elbows on the chair, clasp my hands, and rest my fingers against my lips. “You’ve got your wings crossed, honey. I haven’t done anything. I work hard every single day to be a good father and a devoted, thoughtful husband.”</p><p>She raises a doubtful eyebrow, reminding me of Kate.</p><p>“Thoughtful? Really? Were you being thoughtful when you came to work on Christmas Eve, even though Kate asked you not to?”</p><p>I roll my eyes. “This is a onetime thing. It’s not a big deal.”</p><p>“It’s never a big deal, Drew. Until it is. Do you think the Grand Canyon was created in a day? No. It happened in increments—one small grain of soil at a time. Tonight is how it starts. Then you’re missing birthdays, basketball games, anniversaries, simple but crucial quiet moments. You mean to make it up to them later, but later never comes.”</p><p>I put up my hand. “Hold up—that’s . . . that’s not gonna happen. I would never do that.”</p><p>“Just like you would never leave Kate to put together your son’s gifts all alone on Christmas Eve?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Bull’s-eye.</p><p>She has a point. A completely impossible, unrealistic point—that makes me feel like dog shit all the same.</p><p>“The first step downhill is the hardest, Drew. After that . . . sliding is easy. Taking our loved ones for granted works the same way.”</p><p>I stare at her for a moment. And she looks so sincere, I almost believe it . . .</p> <p>Until I come to my fucking senses.</p><p>I laugh. “Did Kate put you up to this? Are you a friend of Dee-Dee’s? An actress?”</p><p>She sighs. “Tonight, you will be visited by three spirits.”</p><p>“Wow, a foursome. Will they all look like you?”</p><p>That makes her chuckle. “No.”</p> <p>I pick up the phone from my desk. “While this has been memorable—and totally bizarre—I have work to get done.”</p><p>“They will come to you one by one—the spirits of Christmas past, present, and future—to show you what you will never again forget.”</p><p>“Since it’s Christmas Eve and all, it seems only fair to warn you—I’m calling security.”</p><p>“Good luck, Drew. It was a pleasure meeting you, at last.”</p><p>I look down at the phone and punch in the extension for the security desk, then glance back at the couch. But—you guessed it—she’s gone.</p><p>What. The. Fuck?</p> <p>I stand up and look out the door. No trace.</p><p>“Can I help you, Mr. Evans?” Sam asks through the receiver.</p><p>“Did you see . . .” I clear my throat. “Have you let anyone up to our floor tonight? A woman?”</p><p>“No, sir. It’s been quiet down here.”</p><p>I knew he was going to say that.</p><p>“Well, if anyone comes by, make sure you call before letting them up. Okay, Sam?”</p><p>“Sure thing, Mr. Evans.”</p><p>I put the phone in its cradle and stand there, brow furrowed. What the hell was that?</p> <p>My cell phone chimes with an incoming email. It’s Media Solutions’ lead attorney, confirming our conference in . . . damn it, in two hours.</p><p>I brush off the uncomfortable, eerie feelings left from the crazy woman’s little visit, and sit down at my desk to focus on what’s really important. What I came here to do—pissed off my wife to do.</p><p>Close this major fucking deal.</p><p>chapter 3</p><p>Here’s where shit gets weird.</p><p>Weirder.</p><p>Ten minutes later, while I’m detailing the projected profit margin in my proposal, I hear a giggle from the hallway.</p><p>A feminine, familiar giggle.</p><p>And a second later, my niece Mackenzie comes breezing through my office door.</p><p>She’s twelve years old now, with her mother’s build—tall and lithe. Her blond hair is pulled back in a long ponytail, and she’s wearing a red coatdress with pearl buttons, black leggings, and flat black boots.</p><p>I have no frigging idea how she got here or why, but you can bet your ass I’m going to find out.</p><p>She talks into a glitter-covered cell phone. “Tell them if we don’t have those numbers by tomorrow, their balls are going to be sitting in a glass case on my desk, goddamn it.”</p><p>It’s safe to say the whole bad-word jar thing didn’t work out like my sister had hoped.</p><p>“Mackenzie?”</p><p>She ends her call and flops down into the chair across from my desk. “Hi, Uncle Drew.”</p><p>“Did you come here by yourself? Do your parents know where you are? What are you doing here?”</p><p>“Oh, come on—you know why I’m here.” Mischief dances in her big green eyes.</p><p>Which is frigging strange, because Mackenzie’s eyes are blue.</p><p>I don’t have time to comment, because in a flurry of red fabric, she’s on her feet holding her hand out to me. “Let’s get going. Places to go, people to see. Time is money.”</p><p>I take her hand and we walk out of my office, down the hall to my father’s closed office door. Mackenzie opens the door and we step over the threshold.</p><p>And I feel the color drain from my face.</p><p>Because this isn’t my father’s office. Not even close.</p><p>I stumble backward, making contact with the yellow living room wall.</p><p>“What the fuck . . .” I whisper. Confused. A little horrified.</p><p>“You don’t look so good, Uncle Drew,” Mackenzie comments.</p><p>Losing your mind will do that to you.</p><p>I turn in a circle, taking in beige couches and an oak entertainment center housing a television that is definitely not a flat screen. Miracle on 34th Street is on, and the air smells like fresh baked cookies. A modest Christmas tree sits decorated in the corner and dark red poinsettias are scattered between multiple framed family photos on the shelves. Family photos of my parents, my sister, and me—until I’m about five years old.</p><p>And then I finally fucking realize what’s going on. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This is a dream,” I say, in a voice that can’t decide if it’s a question or a declaration. “I fell asleep at my desk and I’m dreaming right now.”</p><p>Funny. Usually my dreams are the more X-rated variety. Involving me and Kate in multiple porn-toned scenarios. Sometimes I’m a Roman emperor and she’s my toga-less slave girl who feeds me grapes and happily caters to my every whim. Sometimes I’m Han Solo and she’s Princess Leia, screwing our way across the galaxy. Other times she’s the powerful, ambitious businesswoman who lands a major client with me, then we fuck on the conference table until neither of us can walk.</p><p>Oh, wait—that last one actually happened.</p><p>The point is—out of all the dreams I remember having, my sweet niece sure as shit hasn’t featured in any of them. And not a single one took place in this place—an apartment I barely remember living in.</p> <p>Mackenzie shrugs. “If it keeps you from wussing out on me, we’ll call it a dream. Do you know where we are?”</p><p>“This is the apartment we lived in when I was a kid, before we moved uptown.”</p><p>“That’s right. Do you know why we’re here?”</p><p>I try really hard. “Um . . . the sushi I ate for lunch was bad and the toxins have spread to my brain, causing some strange-ass hallucinations?”</p><p>Giggling, Mackenzie drags me forward. “Come on.”</p> <p>We enter the kitchen. Sitting at a small round table is the preteen version of my sister, Alexandra. Around this time, she hadn’t yet grown into her nickname, “The Bitch,” but the early signs were there. She’s chewing gum and flipping through a Tiger Beat magazine with the New Kids on the Block on the cover. And her hair—Jesus Christ, she must’ve used a whole can of hair spray, because her bangs form a poof on top of her head, stiff and unnaturally high.</p><p>Sitting beside her, looking dapper in a long-sleeved Back to the Future T-shirt, is me. Five-year-old me. I’m kind of small for my age; the growth spurt won’t hit for another few years. But with my thick black hair brushed to the side, my deep blue eyes shining with youthful exuberance, I’m nothing short of fucking adorable.</p><p>There’s a plate of cookies in the middle of the table, with still-warm gooey chocolate chips. My mom’s homemade cookies. They’re indescribably awesome. But when young Drew reaches for one, Alexandra smacks his hand. “No more cookies, Drew. You’re going to give yourself a stomachache.”</p><p>“But they’re so good,” I whine. And I give her the puppy dog eyes. “Just one more? Please?”</p><p>At first Lexi’s expression is stern. But under the power of young Drew’s cuteness, she melts. “Okay. One more.”</p><p>Are you feeling the foreshadowing here?</p> <p>He smiles his thanks and talks with a mouthful of cookie. “You’re the best sister ever, Lexi.”</p><p>She ruffles his hair.</p><p>I chuckle and tell Mackenzie, “How irresistible am I? Didn’t even have to work at it.”</p><p>Mackenzie laughs. “You were really cute. Watch—this part is important.”</p><p>My mother breezes into the kitchen, smooth skinned, blond, and beautiful—despite the atrocious Christmas tree sweater she’s sporting. In her hand she holds a cordless telephone.</p><p>A heavy, square cordless phone. With an antenna.</p><p>“Drew, guess who’s on the phone?” she asks.</p><p>“Is it Daddy?” he asks hopefully.</p> <p>“No, darling—it’s Santa Claus! He took time out of his busy day-before-Christmas-Eve schedule just to talk to you.” She taps five-year-old Drew on the nose.</p><p>He flies off the chair, knocking it over behind him. Lexi, who by this time was old enough to know the truth, smiles at his excitement.</p><p>Young Drew brings the phone to his ear. “Hello?”</p><p>“Ho, ho, ho! Merry Christmas!”</p><p>And it all comes back to me. Like a door opening to a dark room, finally letting the light in, I remember this.</p><p>“How do I know this is the real Santa?” My five-year-old self asks skeptically. Because even as a kid, I was damn sharp.</p><p>My father answers in a deep, bellowing, disguised voice, “Well, I’ve got the Christmas list you mailed to me here in my hand.”</p><p>Young Drew braces the phone on his shoulder and walks out to the living room. Mackenzie and I follow. “Okay, let’s hear it.”</p><p>Santa clears his throat. “A BMX bicycle, the new Sega system, GI Joe action figures, a Walkman.”</p><p>That’s right, a Walkman. Because this is the eighties, kiddies.</p><p>“Holy crap, it really is you!” five-year-old Drew yells.</p><p>“It really is. Now tell me, young man, have you been a good boy this year?”</p><p>His face scrunches up as he attempts to be honest. “I try. It’s hard to be good.”</p><p>Santa chuckles. “Do you do what your mother tells you?”</p><p>He nods. “Yes, sir.”</p><p>“And do you listen to your sister?”</p><p>He frowns. “Lexi’s bossy.”</p><p>“Yes, she is bossy. But she’s your big sister, Drew—she wants what’s best for you. You should always listen to her.”</p><p>Reluctantly, he nods. “Yes, sir.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well, young man,” my father exclaims. “I’m getting my sleigh all ready for the big night! I should be at your house tomorrow, on Christmas Eve, with lots of presents for you.”</p><p>Five-year-old Drew looks behind him—making sure the coast is clear. Then he speaks hesitantly into the phone. “Hey, Santa, can I ask you something?”</p><p>“You can ask me anything, Drew.”</p><p>“Would it be okay to add something to my list?”</p> <p>I hear worry in the old man’s voice when he responds, “Add something? I’m not certain we could—”</p><p>“Or, I could trade. You can keep my other presents—I think I really only want one thing.”</p><p>“What do you want, Drew?”</p><p>“I want you to bring my daddy home for Christmas.”</p><p>There’s silence on the other end of the phone.</p> <p>My younger self explains, “He had to go away for work, and Mom says she doesn’t think he’ll be home on Christmas Eve. And . . . she’s sad about it. We all are. It’s not as fun. I miss him.” He sighs. “So, if you can make sure he’s home tomorrow—you can keep the other stuff.”</p><p>I grin. Because I know what’s coming next.</p><p>Wait for it.</p><p>“Well . . . maybe not all the other stuff,” he amends. “You could still drop off the Sega. But you can keep all Lexi’s gifts—she won’t mind.”</p><p>Santa’s voice turns rough with emotion and conviction as he promises, “Your daddy will be home for Christmas Eve, Drew. I promise.”</p><p>Young Drew smiles with so much enthusiasm. Delight. Innocence.</p> <p>It makes me think of my son. The sound of his laughter. The warmth of his embrace. The way he bounces on the bed—even when Kate tells him not to—and he jumps into my arms, with total abandon. Complete faith and trust. Because he knows I’ll catch him. That I’d never let him fall.</p><p>That I’d never let him down.</p><p>“Thanks, Santa,” my younger self whispers earnestly.</p><p>Mackenzie looks up into my eyes. “Did Pop make it home in time?”</p><p>My voice takes on a faraway tone, because I remember what happened the next day—and I remember exactly how it felt.</p><p>“We went to the Fishers’ for Christmas Eve dinner. We were all there—me, Matthew, Steven. At seven years old, your dad was already following your mom around, wanting to hang out with her. I kept watching the door. Waiting for my dad to walk through it. Hoping.”</p><p>A smile comes to my lips. “And then he did. Laughing and loud and bigger than life. I ran to him and—even before he hugged my mother—he scooped me up and spun me around. Carried me on his shoulder like Tiny fucking Tim. And it felt . . . magical. Like real Christmas magic. And I was so . . . proud of myself. Because I thought my wish brought him home.”</p><p>I blink, snapping out of my reverie. And I gaze down at Mackenzie. “Out of all the Christmases I enjoyed as a kid . . . that one . . . that one was the best.”</p> <p>“But you forgot about it?”</p><p>That’s how it happens, right? You grow up, and the wonder of the holidays fades. It becomes more of a burden—places to go, traffic, gifts that have to be found and bought. And you forget the little things, the simple moments that are supposed to make a regular day—more.</p><p>“Yeah. I guess I did.”</p><p>It’s only when I glance up from Mackenzie’s face that I realize we’re not in that small apartment anymore. We’re back in my office. My head swims a little—like vertigo. I sit down on the suede couch until it passes. I glance at my watch, and it’s the same time as before Mackenzie walked through my door. Still two hours to go before my conference.</p><p>“Do you know why I showed you this particular memory tonight?” Mackenzie asks me.</p><p>I snort. “To demonstrate I’m obviously more like my father than I ever realized?”</p><p>She shakes her head. “No. I showed you this because moments matter. You may not have remembered it, but it still played a part in who you grew up to be. And how you felt about Christmas, your dad, and in some ways, yourself. It’s the little things, all added together, that make us who we are. So now that you remember, what are you going to do, Uncle Drew?”</p><p>I rub the back of my neck. “I’ll . . . I’ll find a way to make it up to James after Christmas. Maybe take him to a basketball game for some quality time. Just the two of us.”</p><p>Mackenzie sighs. And she seems disappointed. It’s similar to how Kate looks at me when she comes home from the salon and I’m not excited by the fact that she trimmed off a whole quarter of an inch.</p><p>Like . . . I’m missing something.</p><p>“Well,” she laments, “it’s time for me to go.”</p><p>Even though I’m still sure this is a dream—I’m not taking any chances. “Hold on, sweetheart. I can’t leave yet. Hang out here with me and I’ll get you home when I’m done.”</p><p>She sits down on the couch. “Okay, Uncle Drew. Whatever you say.”</p><p>I head back around my desk, sit, and refocus all my attention on my presentation.</p><p>chapter 4 </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mackenzie plays quietly on her phone while I work. She’s mature and considerate like that. After a half hour I glance at the couch to thank her—and see that she’s fucking gone.</p><p>I shoot to my feet. “Mackenzie?” When there’s no answer, I rush for the door. Flinging it open I call, “Mack—”</p><p>I actually said her full name, but you couldn’t hear it.</p><p>Because the blaring of “Angels We Have Heard on High” drowned out my voice. And if that wasn’t loud enough, there’s the echo of bells jingling in the background, the hum of a dozen audio-animatronic elves, reindeer and headless gingerbread men scattered around—and let’s not forget the crunch and whistle of falling snow.</p> <p>Yes, actual snow—inside my goddamn office building.</p><p>The main floor outside the offices has been transformed into a winter wonderland.</p><p>I just stand there. Stunned.</p><p>But I have to say, this beats the shit out of anything the mall has ever come up with.</p><p>Then my sister, Alexandra, comes walking around the corner. She’s decked out in elegant holiday finery—a red, strapless satin dress, black heels, her hair piled high on her head, with a pearl tiara nestled in the blond curls.</p> <p>She surveys the room. “God, I’m good.”</p><p>I cross my arms and lean back against a snow-covered desk. “A little overdone, don’t you think?”</p><p>Alexandra raises her shoulder. “If you can’t overdo Christmas, what can you overdo?” Then she regards me with bright green eyes.</p><p>And I deduce, “You’re not here to pick up your daughter, are you?”</p><p>“No, my daughter is safe and sound. Why do you think I’m here, little brother?”</p><p>“I’m starting to think it’s because every member of my family has been body snatched by green-eyed aliens hell-bent on keeping me from getting any fucking work done.”</p> <p>She shakes her head. “Even your alien invasion theories are egomaniacal.”</p><p>I push off from the desk. “All right, let’s go. The sooner we do this, the sooner I can get back to my desk.” And I can’t keep the sarcasm out of my voice. “Show me your vision, Christmas ghost. Teach me the error of my ways.”</p><p>Alexandra scowls. And checks out her manicure. “Now I’m not in the mood.”</p><p>I grit my teeth. “Alexandra . . .”</p><p>“I don’t like to be rushed, Drew. You have to invest the time—smell the holly bush, get the full experience. I’m not some wham-bam-thank-you-ma’am.”</p><p>My face contorts. “I certainly hope not. That’s fucking gross.”</p><p>“The heavens have chosen to intercede on your behalf!” She stomps her foot. “To help you. A little gratitude would be nice.”</p><p>I pinch my nose, breathe deep, and compose myself. Because the spirit bitch is obviously in a tormenting mood, like a cat toying with a mouse before it’s devoured. Trying to wriggle out from under her paw will only prolong it. My best option is to just give in. Play dead.</p> <p>Submit.</p><p>“I apologize for being flippant, Alexandra. Thank you for taking the time tonight to educate me. I’m truly fortunate to have a sister and heavenly angel who care so much for my emotional well-being.”</p><p>Her head bobs side to side, weighing my sincerity. “And do you like the decorations?” she asks petulantly.</p><p>I smile. “The decorations are lovely.”</p><p>Alexandra’s expression slides toward appeasement. “And the music?”</p><p>“One of my favorite songs—a classic.”</p><p>She grins teasingly. “I worked really hard on the snow.”</p><p>Submission isn’t my forte.</p><p>“Goddamn it, Lex!”</p><p>She holds her hands up. “Okay, okay.” She straightens and clasps my hand. “Come with me.”</p><p>Together we walk to Steven’s office. Instinctively, I close my eyes as we step through the doorway. Then I open them.</p><p>“This is . . . this is your apartment,” I state.</p><p>My sister’s condo has the typical regal appointments of an exclusive and ultraexpensive New York City living space. Panoramic views, high ceilings, detailed dark wood moldings, shiny, pristine marble floors. But there’s a warmth to it—earth-toned walls, comfy couches, colorful throw pillows, children’s framed artwork—that makes it a family friendly home.</p><p>“Brilliant observation, as always,” she returns.</p><p>“When is this?” I ask. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alexandra’s eyes turn sympathetic. “This is tonight. At this very moment. These are the memories you won’t be a part of.”</p><p>We go into the family room, where all the familiar faces are congregated. There’s my father, in a black suit and red tie, with a ridiculous Santa hat on his head, talking to Frank Fisher—my father’s lifelong friend and business partner—at the wet bar. He pours apple cider into a shot glass for Mackenzie, who’s perched on a stool between the two men. A small smile comes to my lips as I gaze at my mom, who looks a couple of decades older than her earlier incarnation, but every bit as beautiful—this time in a simple red dress and black pumps. She’s chatting with my sister on the couch. On the far side of the room is my brother-in-law, Steven, his blue eyes sparkling with pride behind his dark-rimmed glasses as he bends his head to hear what his son, Thomas, tells him. They stand in front of the Ping-Pong table—our latest family get-together pastime. They’re getting ready to play my best friend, Matthew Fisher, and his five-year-old son, Michael, as they stand on the other side of the table, looking a little like twins with their short light brown hair and similar button-down green shirts.</p><p>Adjacent to the table is a love seat, where Matthew’s wife and Kate’s best friend, Delores “Dee-Dee” Warren, is seated, surprisingly wearing one of her lower-key outfits—a short red leather skirt, a snug white striped sweater, and glowing, dangly Santa Claus earrings.</p><p>Next to Dee is Kate, and I can’t take my eyes off of her.</p> <p>An elegant long-sleeved black velvet dress hugs her in all the right places, her dark, shiny hair falls over her shoulder in waves, and open-toe green heels encase her feet. Three-carat diamond earrings—earrings I gave her for our second wedding anniversary—glitter on her ears. She’s flawless. And so gorgeous I actually feel my chest tighten with a mixture of pride and ever-present desire.</p><p>It’s the perfect family gathering. Evergreens and bows add a holiday flair to the decor, Christmas music plays cheerfully in the background, and dozens of delicious-smelling dishes rest on a buffet table, waiting to be uncovered. It’s a modernized version of an idyllic Norman Rockwell image—the entire room is alive with laughter and joyful chatter. Everyone’s happy to be there, everyone’s having a good time.</p><p>Everyone except my son, James.</p><p>He’s unusually quiet, sitting on the recliner next to the love seat. His dark brown eyes alternate between watching the Ping-Pong match and glancing down the hall toward the front door.</p><p>Steven, who’s always been attuned to how others are feeling, nudges James with his elbow. “What do you say, buddy? You want to be on Thomas’s and my team? We could use another man.”</p> <p>My five-year-old son smiles genuinely and glances down at the two Ping-Pong paddles in his hands. “That’s okay, Uncle Steven—I’m gonna wait for my daddy. I’ll be on his team.”</p><p>And doesn’t that just make me feel like two cents’ worth of shit. Because he’s completely unaware that I have no intention of showing up.</p><p>James’s words immediately grab Kate’s attention, and she crouches down in front of him. “Honey, remember I told you Daddy had to work tonight? He didn’t want to, but he had to. I don’t think he’s going to be here to play Ping-Pong.”</p><p>James smiles at her reassuringly. “Yeah, I remember, but he’ll come after he’s done working. I know he will. He’ll make it in time.”</p><p>Kate’s eyes cloud with worry, because she doesn’t want our little boy disappointed. Not on Christmas Eve. And sure as hell not because of his father.</p><p>“Can I play with you?” she offers. “I play a mean game of Ping-Pong.”</p> <p>James giggles. “Thanks, Mommy, but I want to wait for Daddy.”</p><p>Kate tries again. “But what if he can’t come, honey?”</p><p>James gazes back at her calmly, confidently, because he believes every word he’s saying. “Daddy told me that ‘can’t’ isn’t a real word. That anything someone wants to do badly enough—they’ll do. He said ‘can’t just means they won’t,’ or that they don’t want to. So that’s how I know he’s coming. Because it’s Christmas Eve, and there’s nowhere Daddy wants to be more than here with us. So he’ll be here.”</p><p>Guilty pain lances my heart, and I cover it with my hand. I think I might actually fucking cry.</p><p>“Ouch,” my spirit sister says beside me. “That’s gotta hurt. And you thought the mother guilt was bad.”</p><p>I shake my head. “I’m such a dick. How can I be such a giant asshole and not know it?”</p><p>Christmas Alexandra takes pity on me. She pats my shoulder. “You’re not really that bad. You’re just a little self-absorbed sometimes. You don’t see things from others’ perspectives—how your actions may affect them.”</p><p>Back in the apartment, Kate brushes back the locks of James’s hair that have fallen over his forehead. “You are the smartest, sweetest little boy ever, you know that?”</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He grins. “Yeah, you’re pretty lucky.”</p><p>My wife laughs. Then she kisses his forehead and moves back to the love seat, next to her best friend. She glances worriedly down the hall toward the front door, and there’s sharp anger in her tone when she whispers to Delores, “If James gets hurt tonight because of Drew, he and I are going to have a major problem.”</p><p>Delores nods. But then—maybe Christmas really is magic, because she defends me. Kind of. “Don’t give up hope, Katie. Dipshit may actually pull his head out of his ass long enough to realize where he should be. He’s come through before when I didn’t think he would. So . . . keep the faith. You never know.”</p><p>Kate sips her wine, looking distinctly uncomforted.</p> <p>Then the Ping-Pong participants shout loudly as Michael gets the ball past his uncle—scoring the winning point. His father gives him a high five and a hug.</p><p>“Well played, sir,” Steven congratulates.</p><p>“Nice shot,” my son calls sincerely.</p><p>Then he sighs. And goes back to watching the door.</p><p>Though I know he can’t hear me, I start to move toward him so I can explain how crucial tonight’s conference call is. So he’ll understand. But even in my head, the justifications sound pretty fucking hollow.</p> <p>And I don’t get the chance to, anyway. My sister’s hand on my shoulder stops me. “Come along—we still have another stop to make.”</p><p>“So I can feel even worse than I do right now?” I give a sarcastic two-thumbs-up. “Yay.”</p><p>She takes my hand and I reluctantly follow her out the front door.</p><p>And we step seamlessly into my apartment.</p><p>There’s a fire burning in the living room fireplace but the lights are turned down low. And it’s quiet—the only sound to be heard is Kate’s singing voice floating softly down the hall from James’s bedroom. She does that sometimes—sings him to sleep. At the moment, she’s doing a fucktastic rendition of “Have Yourself a Merry Little Christmas.” I imagine her running her fingers through his soft hair as his eyes grow heavy. Then, when he’s finally out—she’ll kiss his forehead and smell the still-child-sweet scent of his skin.</p><p>“This is later tonight,” my sister informs me. “While you’re at the office on your video business meeting.”</p> <p>A few seconds later, the song ends and Kate comes walking down the hall. Her hair is pulled up and she’s wearing a dark green silk nightshirt that accentuates the green flecks in her eyes. With white socks, because hardwood floors are freaking freezing in the winter.</p><p>In her hands, Kate holds a bottle of wine and a single glass. She uncorks it on the coffee table and pours a double serving into the glass. Then she opens the hall closet and sticks her head inside. As she rummages around, pulling out baseball bats and ski jackets that I astutely used to camouflage the presents inside, the back of her nightgown starts to ride up, and the “Ho, ho, ho” written across the ass of her red panties peeks out.</p><p>I tilt my head for a better angle of the luscious sight.</p><p>Addiction is an illness. But there are times—like this one—that it’s an enjoyable one. I can’t help myself, and if I’m being honest, I don’t really want to.</p><p>Alexandra frowns at me. “Focus, please.”</p><p>I clear my throat and nod.</p><p>Eventually, Kate succeeds in dragging out two boxes that are longer than she is.</p><p>She opens them, lays out all the pieces neatly, and settles herself among them on the floor. She takes a sip of her wine, opens the instruction manual, and gives herself a pep talk.</p> <p>“If Drew wants to work, he can work. I got this covered. How hard could it be?”</p><p>We should pause here briefly and think about that statement. How hard can putting a child’s toy together really be?</p><p>Past experience tells me—pretty fucking hard. If you have kids, you know exactly what I’m talking about.</p><p>I don’t get it. Clear illustrations, simple direct steps—is that really too goddamn much to ask for? And don’t get me started on the packaging. I realize that shoplifting is a drain on stores, but is it necessary to wrap every single fucking component in plastic, wire, and industrial-strength tape? The only people that deters are the parents trying to put it together.</p><p>I’ve wondered who makes that call at the toy companies. Who decides which pieces get tied down and at what potency. Whoever it is—I bet he was bullied in high school. Or maybe he was poor and didn’t get to play with any toys when he was a kid. So now—every day—he takes his sick, twisted revenge by making it as difficult as humanly possible for anyone to put together a toy that should be a piece of fucking cake.</p><p>I feel better now that I got that off my chest. Thanks.</p><p>So, back to Kate: fifteen minutes after getting started, she’s got all of three pieces put together on James’s bicycle. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She picks up the instructions and turns them sideways. Then she holds them upright and tries turning her head sideways.</p><p>“Are you kidding me?” she yells at the paper, flinging it to the ground. Then she speaks threateningly to the bike parts as she tries to force them to connect. “Just. Go. In. You. Bastard!”</p><p>When that doesn’t work, she takes a breath and a sip of wine. She brushes the wisps of hair that’ve escaped her bun away from her face. Then she picks up a blue metal rod. “You are component A. You need to be inserted into component B’s hole. Work with me, here.”</p><p>And now she’s back to shoving.</p> <p>I squat down next to her. “It looks like rod A is too well endowed for B’s hole. Maybe they need some lube.”</p><p>If she could hear me, Kate would chuckle. And she’d look at me like I was the cleverest man in the world.</p><p>But she can’t. So she just continues to grit her teeth and struggle with the metal bars.</p><p>Until her hand slips.</p><p>And her finger gets pinched between two pieces of steel.</p> <p>With a curse, Kate drops the bike pieces and flaps her hand, trying to shake the pain away. Then she puts her finger in her mouth.</p><p>It’s something I would’ve done if I were here. Sucked her finger until it was all better. Then I would’ve gotten her a Band-Aid or ice.</p><p>Once her finger is probably just a dull throb, Kate rubs her forehead. She looks tired.</p><p>And sad.</p><p>And for the first time tonight, I wish I’d chosen differently. It’s not only because I feel guilty—though I do. But if I could go back, I’d be here with her right now. And it would be a shitload more enjoyable for both of us.</p><p>Kate picks up her glass of wine, eyes the red liquid, then holds it up unhappily. “Merry Christmas, Kate.”</p> <p>And I’m done.</p><p>I don’t want to watch this anymore. I don’t want to know that my actions have hurt the feelings of the two people who mean the most to me.</p><p>Because I’m a guy. And to the great annoyance of women everywhere—guys are doers. We don’t just listen to you babble about your problems; we tell you how to fix them.</p><p>And we never understand why you get pissed off about that. Why you just want us to be a “sounding board” or a “good listener.” What the fuck is the point of sounding off if you’re not going to do anything about it?</p><p>So I’m going back to my office, and then I’m going to haul ass home to help Kate assemble James’s presents. And I’m going to wake up my son and tell him I’m sorry. That I’ll play Ping-Pong with him every damn day if it makes him happy.</p><p>I stand up and look into the eyes of my big sister. Almost like she can read my mind, she says, “Okay. Let’s go, then.”</p><p>Alexandra holds my hand and we walk to the elevators outside my apartment door. We step inside and they close behind us. When they reopen, we’re on the fortieth floor of my office building. And all the decorations—the music, the snow—are gone now.</p><p>Outside my closed office door, I turn toward my sister.</p> <p>“Thank you, Alexandra. Really, this time.”</p><p>She smiles. “Do you know what life is, Drew?”</p><p>“A cosmic joke?”</p><p>She snorts. “No. Life is a memory. Sure, we enjoy the moments as they come, but for many, time goes by too fast to truly appreciate those moments as they happen. It’s only later, when we remember them, that they become precious to us. A life well lived is one where the good memories outweigh the bad.”</p><p>I rub the back of my neck. “That’s kind of depressing.”</p><p>“It doesn’t have to be.” She shakes her head softly. “Never pass up the opportunity to make a beautiful memory, Drew.”</p><p>Then she kisses my cheek and disappears.</p><p>chapter 5</p><p>After Alexandra is gone, I wait.</p><p>My guardian angel said there’d be three spirits visiting me, and I have a feeling I’m not going to wake up from this dream until bachelorette number three gets her turn.</p><p>When nothing happens, I try to help things along. “Hello? Anybody here? You win—I feel really fucking guilty. I’m going to cancel my conference and go home now. Happy?”</p><p>The only answer I receive is silence.</p><p>I take one last glance around, then open my office door and step inside.</p><p>And I’m blinded by flashing green and red lights. A pounding electric guitar version of “Jingle Bells” pierces my eardrums? while a white foggy mist clouds my vision of the room. Out from behind my desk steps a tall creature whose face is obscured by a flowing red satin hooded robe.</p><p>Suddenly, the flashing lights disappear and the music cuts off.</p><p>I wouldn’t say I’m scared . . . but intimidated fits nicely. “Are you . . . are you the spirit of Christmas future?”</p><p>I don’t expect an answer. In the movie, the last, most frightening spirit never talks. If it pulls the hood back, I suppose it’ll have a black hole where its face should be—maybe a skeleton head. I brace myself as hands with long red nails reach for the hood and reveal the countenance beneath it.</p><p>Did I think this was a dream? Nope. It’s a nightmare. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Because standing before me, grinning evilly, is none other than Delores Warren, the ever-present pain in my ass.</p><p>“That’s me,” she proclaims. “The biggest, baddest Christmas spirit there ever was.”</p><p>I hold out my hand to shield my view. “Can you put the hood back up?”</p><p>She glares. “Ha-ha, asswipe. I wouldn’t be making jokes if I were you, seeing as how you’ve screwed up. Again.”</p> <p>I cross my arms. “I guess that means you’re taking me to the future. Show me my grave, and how no one gives a shit that I’m dead because of my selfish ways?”</p><p>She scrunches her nose and shakes her head. “That’s Ebenezer’s gig—he’s always been an emo-bastard.” Delores fingers the pearl brooch at the neck of her robe as she asks, “Have you ever wondered how your life would’ve turned out if you and Kate had never met?”</p><p>“Not really.”</p><p>I was never big on philosophy. Waste of time, as far as I’m concerned. Besides, Kate and I did meet, so the would’ve, could’ve, should’ve doesn’t apply.</p><p>“Well, I have,” she says. “I always suspected Katie would’ve been better off without you. So we’re not going to the future. I’m going to show you this night as it would be if Kate had never come to New York, and never fell victim to your man-whore charms.”</p> <p>Is that something you want to see?</p><p>Because I’m not interested. Because . . . if Delores is right, and Kate really is better off without me? That knowledge would break my fucking heart like nothing else ever could.</p><p>I shake my head. “No, thanks. I’ll sit this one out.”</p><p>Her green eyes gleam. Almost menacingly. “Lucky for me, you don’t have a choice in the matter.”</p><p>With that, she spins toward me, the red cloak billowing around us. I feel her hand on my arm and the whole world shifts—falls—then comes to a jerking stop, like the end of a roller-coaster ride.</p><p>I look around. We’ve landed back in the outer hallway of my sister’s condo. The door is open and a version of me stands in the doorway, saying good-bye to his family inside. He seems a little more worn around the edges—but still one hell of a good-looking guy.</p> <p>“So this me made it to Christmas Eve dinner?” I ask.</p><p>“Without a wife and kid taking up your time, you were able to get the conference with Hawaii done earlier.” Then Delores points at the other me. “Notice the crow’s-feet. Since he didn’t settle down with Kate, there’s a few more years of hard partying under his belt—and his eyes. But, sorry to say, no one’s kicking you out of her bed yet.”</p><p>I wave my hand, quieting her annoying commentary so I can hear the conversation going on at the door.</p><p>“You’re sure you don’t want to stay the night?” Alexandra asks. “You could wake up with us, open presents—nothing makes Christmas feel more like Christmas than kids getting up at the crack of dawn.”</p><p>Kateless Drew hugs Mackenzie and Thomas, then kisses Alexandra on the cheek. “Sounds tempting, but I’m good.”</p><p>His mother clicks her tongue disapprovingly. “I hate the idea of you being all alone.”</p><p>He smirks. “Then you have nothing to worry about, Mom. I hardly ever spend the entire night alone.”</p><p>Steven chuckles and taps Drew’s fist.</p> <p>His mom rolls her eyes. “It’s Christmas Eve, don’t be vulgar.”</p><p>Drew shakes his father’s hand. “See you guys tomorrow.”</p><p>With that, he leaves. But he doesn’t go home.</p><p>He walks a few blocks until he comes to the most dependable pickup spot in any city. The place responsible for more sexual encounters than a highway rest stop bathroom.</p><p>A hotel bar.</p><p>While he stands at the entry, scanning for prospects, I do the same. It’s been awhile for me, but spotting the easy pickings is like riding a bike—a skill you never really forget.</p><p>Our eyes settle on a forty-something redhead in phenomenal shape, sitting alone at a corner table. Drew orders two drinks from the bartender—a Jack and Coke for himself, and whatever the lady is having.</p><p>Then he makes his move.</p><p>“Mind if I join you?” he asks her with a smile.</p><p>After her eyes shamelessly undress him, she nods. “Please.” He sets her drink in front of her and she thanks him.</p><p>He assumes she’s at the hotel because she doesn’t actually live in New York. So he asks, “Are you visiting the city for business or pleasure?”</p><p>She sips her drink and licks her lip provocatively. “Originally, business—I’m in real estate. But now it seems I’ll be multitasking.”</p><p>Drew winks. “I’m an excellent multitasker. I’m able to give my attention to many different areas at once. I’d love to demonstrate that talent for you sometime.”</p><p>Redhead smiles wider. Then she says, “Mistletoe.”</p><p>“Pardon?”</p><p>She points above them. “My hotel room has mistletoe printed on the sheets, in honor of the holiday season. How would you feel about kissing me under it?”</p><p>Drew chuckles. “I believe that’s a holiday tradition that should always be observed.” They finish their drinks, then stand. Ever the gentleman, Drew motions with his hand. “After you.”</p><p>And together they head upstairs. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The redhead’s room is actually a suite. Delores and I sit on the couch in the common area while the other version of myself and the redhead get busy in the bedroom.</p><p>From what I can hear—which is a lot—Redhead is quite flexible.</p><p>“Uh . . . fuck.”</p><p>“Oh . . . oh . . . oh.”</p> <p>“Shit . . . yes!”</p><p>“Oh . . . yeah.”</p><p>“That’s it . . . yes . . . more . . . make me your bitch.”</p><p>“Jesus . . .”</p><p>And on it goes.</p> <p>For an hour.</p><p>Then two.</p><p>From the couch, I stare at the ceiling. And think about repainting the home office.</p><p>Delores glares at me. “You’re enjoying this, aren’t you?”</p><p>I squint as I consider her question. “Not as much as I thought I would. I mean, it’s not really me, so I have nothing to feel guilty about. But still . . .”</p><p>Hearing any version of myself banging the hell out of a woman who isn’t Kate is just . . . bizarre. In a disturbing kind of way. Not a turn-on.</p> <p>After a high-pitched scream and a roaring grunt, the noise from the bedroom quiets down. Until . . .</p><p>“Mmm . . .”</p><p>“Oh . . .”</p><p>“Uh . . . uh . . . uh . . .”</p><p>Delores throws up her hands. “Now this is just fucking ridiculous.”</p><p>I shrug unapologetically. “Picasso had his clay, Rembrandt had his brushes—I have my cock. Every true artist has a favorite tool. And you can’t rush fine art.”</p><p>“Yes, yes, yes . . .”</p><p>“Oh fuck . . .”</p> <p>She rolls her eyes. “I’m fast-forwarding.”</p><p>“Thank Christ. Why didn’t you think of that sooner?”</p><p>I follow her out of the hotel room door. And we step into the living room of my apartment. My old apartment, before Kate and I lived together. The ultimate bachelor pad—black, stainless steel, and big-boy toys, remember?</p><p>We stand in the living room as Kateless Drew comes strolling through the door—his shirt half buttoned, whistling a merry tune. He takes a quick shower, then, clad only in boxers, pours himself a bowl of cereal. He sits back on the couch, puts his feet on the coffee table, and flicks on the television.</p><p>With a mouthful of cereal, he smiles. “A Christmas Story. Cool.” And he settles in to watch.</p><p>“I don’t understand,” I say.</p><p>“?’Cause you’re a moron,” Delores answers flatly.</p><p>“Instead of insulting me, can you explain what the hell I’m supposed to be getting from this? I thought the point of showing me my life without Kate was to demonstrate how miserable I’d be without her.” I gesture to my other self on the couch. “He’s fine. He loves his life. What’s the lesson here?”</p><p>With restrained impatience, Dee explains. “Of course he loves his life—being a raging man-slut was one of your favorite things. You always enjoyed your work, your life before Kate. But if you can’t see the lesson, then you’re not looking hard enough, Drew.”</p><p>I push a frustrated hand through my hair and look again. The other me chuckles at the TV and puts his empty bowl on the table. Then I gaze around the apartment. The pristine neatness, the monotone furniture, the valuable abstract art on the walls.</p><p>And for the very first time, it feels . . . cold. Flat.</p><p>Empty.</p><p>I think of my apartment with Kate and James—our home. It’s light and vibrant and messy in the best frigging way. There’s pencil marks on the wall showing how James has grown and a few scratches on the hardwood floors. There are mementos from vacations and pictures all over of our wedding and every significant moment in James’s life. There are toys and work papers, coats and shoes. It’s not messy, but—lived in. Busy.</p><p>Full.</p><p>“He’s happy,” I realize. “Because he has no idea what he’s missing.”</p><p>Delores nods. “That’s right. He doesn’t know what he’s missing.”</p><p>A cold shiver runs through me. Because this easily could’ve been me. It could’ve turned out so differently, and I never would’ve known.</p><p>“I want to go back,” I tell her firmly. “Right now. I want to see Kate and James. Take me back, Dee.”</p><p>She looks at me with an unfamiliar sympathetic expression. “Almost, Drew. One more stop to make.”</p><p>She laces her arm in mine and we’re off.</p><p>We stand inside a corner office on an impressively high floor of a city high-rise. Beige granite and polished glass accent the desk, while unwelcoming white couches face off with a glass table between them. Before I can ask Delores where we are, the door opens and in strides Katherine Brooks.</p><p>Her hair is pulled back in a low bun; she’s wearing just a touch of makeup, an immaculate white-and-black skirt with a coordinating jacket, and high heels. She’s stunning, perfectly professional and cock-stiffening sexy all in one petite package.</p><p>In long confident steps, she makes her way behind the desk while talking into a headset microphone. “I’m sorry, that’s not a stipulation we’re willing to budge on. Take it or leave it.”</p><p>I glance at Delores. “Is this . . . is it still Christmas Eve?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her lips purse with curiosity. “Yes it is.”</p><p>I point my finger. “Ha! I was right—I knew Kate would work on Christmas Eve if the shoe was on the other foot.”</p><p>I can’t wait to tell her I was right.</p><p>Again, Dee’s eyes roll. “That’s the first thing you want clarification on?”</p> <p>I shrug. “I was right. It’s a big deal.”</p><p>“We’re in Chicago.”</p><p>“Why Chicago?”</p><p>“Because in this reality, this is where Kate and Billy moved after she got her MBA.” She pauses. “And after they got married.”</p><p>My head snaps to her. “What? She actually fucking married Douche Bag? Are you shitting me?”</p> <p>For those who need a little backstory, here you go: Billy “Douche Bag” Warren is Delores’s cousin and Kate’s high school sweetheart. He was her fiancé when we first met. Not too long after, he became her ex-fiancé, clearing the way for her and me to enjoy a stupendous fuck-fest of a weekend. It still ranks as one of the best weekends of my life. And it was during that very weekend that I came to the shocking realization that I was utterly and *-whippedly in love with Kate Brooks.</p><p>Because Kate and Billy had grown up together, had so much history together, they stayed close friends—much to my dismay—after their breakup, after she and I got together, and after we were married.</p><p>Which all explains why I’m feeling frustration, disgust, jealousy, anger. Pick a negative emotion, and I’m feeling it at this moment.</p><p>“Why would she do that?” I demand.</p><p>Dee lifts a shoulder casually. “Because they were engaged. Because they thought they loved each other . . . enough. Because they settled. And also because she never met you—so she never realized what genuine passion and love are supposed to feel like.”</p><p>“I can’t believe she married him.” Again, my hand covers my heart.</p> <p>Because it aches.</p><p>“If it makes you feel any better, they got divorced.”</p><p>I perk right up. “You should have started with that. It makes me feel hugely fucking better, by the way.”</p><p>Under her breath, she hisses, “Ass.” Then she explains. “Billy and Katie stuck it out for three years, then called it quits. He went out to LA and she threw herself into her work like never before. They don’t speak at all. When a marriage goes sour, it always leaves a bitter taste.”</p><p>My attention turns back to Kate as she speaks into the headset again. “Stop busting my balls, Saul. You and I both know the glory days of your technology division are behind you.”</p><p>I take a seat on the stiff couch and watch her. I could look at Kate all day and never get bored, but watching her work? Seeing her in her element?</p><p>It’s fascinating. A thing of true beauty.</p><p>She braces her hands on the desk, tapping her toe on the floor. “You’re quickly becoming a small fish in a very large ocean. Before long, a big bad shark is going to come along and chomp you into little pieces. But if you do the smart thing, sign with me and let me make this deal for you—I’ll be your own personal harpoon. And we’ll feast on shark fin soup together. What’s it gonna be, Mr. Anderson?”</p> <p>Fucking Christ almighty.</p><p>Saul Anderson.</p><p>There’s a blast from the past.</p><p>The first client Kate and I tried to close. The one who basically sexually harassed her, and who I told to go screw a pooch. And now Kate has him on the ropes.</p><p>Even though this is some weird, fucked-up alternate reality, I’m so damn proud of her.</p><p>I don’t hear Anderson’s answer, but I don’t have to. The adorable hand-flapping, hip-shaking dance of joy she does around her desk says it all.</p><p>Though she’s smiling wide enough to pull a cheek muscle, she composes her voice. “That sounds perfect. I’ll have the papers overnighted to you. Excellent. Yes, to you as well—I think this will be a very happy New Year.”</p><p>She ends the call, and her dancing turns to jumping. Laughing.</p><p>And I laugh with her.</p><p>She picks up the phone and dials a new number. “Hi, Christopher. Oh . . . yes, Merry Christmas to you, too. It sounds like you’re having quite the party there.”</p><p>She pauses as Christopher responds.</p><p>I ask Dee sharply, “Who’s Christopher?”</p><p>“Relax, Hulk—he’s her boss. Nothing more. In fact, she has a less-than-zero social life.”</p><p>I consider that for a moment. “She doesn’t date? No boyfriend? No random hookups, no no-strings-attached fuck-buddy waiting in the wings?”</p><p>Delores shakes her head. “Kate was never a one-night-stand kind of girl. After Billy, she gave up on relationships altogether. Too much effort, very little payoff.”</p><p>I smile.</p><p>And Dee inquires, “That makes you happy, doesn’t it?”</p><p>I cannot tell a lie. “Yeah, it really does.”</p><p>She throws a pillow at my head. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kate’s voice brings my eyes back to her. “I wanted to let you know that I just signed Saul Anderson. That’s right! Merry Christmas indeedy.”</p><p>Christopher responds, and a look of pure pride and joy washes over her face. “I’m thrilled to accept the vice president position. Yes. Absolutely—you can count on me, Chris. Okay, I will. Have a pleasant evening, as well.”</p><p>She hangs up and more dancing commences. Her boobs bounce in time with her hips, and the only thing that would make this show better is popcorn.</p><p>Well . . . and if her clothes spontaneously fell off.</p> <p>Kate picks up the phone and tells her mother all about the big promotion. They only talk for a few minutes—Kate promises to come home soon to visit. Then she hangs up.</p><p>She takes a bottle of champagne out of her minifridge and pours a single glass. Then she kicks off her shoes and walks to the window, gazing out over the lights of the city.</p><p>I stand up so my view is unobstructed.</p><p>As Kate stands there, her joyous expression slowly falters. Turns . . . sad . . . awash with yearning. Lonely.</p><p>I think about all the different faces of Kate that I’ve seen. Passionate, hot and horny, sweet and tender, silly and smart-assy . . . nurturing, loving . . . motherly.</p> <p>She’s a perfect wife. And she’s the most amazing mother.</p><p>But here, now, she didn’t get to be any of those things.</p><p>And that’s so fucking wrong.</p><p>Kate glances at her glass of champagne and whispers, “Merry Christmas, Kate.” Then she takes a sip.</p><p>“Hey, Dee?”</p><p>“Yeah?”</p> <p>“Remember when I said I was happy that Kate wasn’t involved with anyone?”</p><p>“Yes.”</p><p>“I’m not happy about it anymore.”</p><p>Delores walks to me and takes my arm. “Then it’s time to go.”</p><p>We’re back in my office—my real office. The family portrait of me, Kate, and James sitting on my desk proves that this is my time, my reality—where Kate and I met, fell in love, spawned, and married.</p><p>And I sigh with blessed fucking relief.</p><p>I’m at my desk while Delores sits cross-legged in one of the chairs across from me.</p><p>“You were thinking about soul mates before. Remember? The truth is, soul mates are real: halves of the same coin. They can live without each other, go on to have successful, content existences. But they’ll never be as perfectly happy as they would’ve been, and could be, if they find their other half. That’s what you and Kate are like.”</p> <p>I smile. “That sounds just about right to me.” I rub a hand down my face. “I want to go home, Dee. I want to hug my kid and kiss my wife and just . . . be with them. I want to look back and remember having this awesome night—with them.”</p><p>Delores grins and she almost looks proud of me. “First you have to wake up, Drew.”</p><p>And she snaps her fingers.</p><p>chapter 6</p><p>I jolt violently awake at my desk, nailing my shin on the drawer in the process. “Goddamn it!”</p><p>I rub my leg and check the time. Seven thirty. Though it feels like a lot longer, only an hour and a half has passed since I arrived at the office.</p><p>I still have time.</p><p>I rattle off a quick email, canceling my conference with Media Solutions and attaching a PDF of my proposal. I tell them, in a professional sounding way, that they can take it or leave it, and if they leave it—it’s their loss.</p><p>Then I grab my stuff and sprint through the city.</p><p>I walk through my sister’s apartment door twenty minutes later, brushing snowflakes off my shoulders from the storm that just started. I head right for the family room—and see everyone there, just like I knew they would be.</p><p>A dark-haired little blur runs toward me. “Daddy!”</p><p>Laughing, I scoop him up and hug James until he squeaks. He leans back and gifts me with a faultless smile. “I knew you’d come.”</p><p>A lump clogs my throat.</p><p>I push past it to tell him, “And I’m so happy that you knew that. I love you, buddy. More than anything else in the whole world.”</p><p>He giggles. “I know.”</p><p>I keep him in my arms as Alexandra comes to greet me. “It’s about time.”</p><p>“Sorry I’m late.” And I hug her just a little longer than usual. “I don’t think I’ve told you lately, but you’re the best sister ever, Lexi.”</p><p>She ruffles my hair. “How sweet are you?”</p><p>From across the room, Mackenzie raises her shot glass of apple cider. “Glad you could make it, Uncle Drew.”</p><p>“Glad to be here, sweetheart! You and I need to talk—I owe you. I’ll explain later.”</p><p>My sister insists, “No ponies, or farm animals of any kind!”</p><p>And the whole room laughs.</p><p>I pass Delores and shock the shit out of her by kissing her on the cheek. “Merry Christmas, Dee.”</p><p>She looks at me like I’ve lost my mind. “Are you drunk?”</p><p>I chuckle. “Kind of feels like it.”</p><p>Then I spot Kate. And every fiber of my being hums with devotion and relief.</p><p>She eyes me warily. Stiffly. Still annoyed.</p><p>I set James on his feet. “You want to kick Uncle Matthew’s and Uncle Steven’s asses in Ping-Pong?”</p><p>“Definitely!” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I jerk my head to the table. “Go set it up. I’m going to talk to your mom a sec.”</p><p>I walk up to Kate and guide her to a corner of the room, out of the others’ earshot.</p><p>“Did your meeting finish up early?” she asks in a steely voice.</p><p>Can’t really blame her.</p> <p>“I canceled the meeting.”</p><p>Her big, gorgeous brown eyes look surprised. And hopeful. “Why?”</p><p>“Because being here with you is more important than any deal. I never should’ve scheduled work on Christmas Eve. I never should’ve left the apartment when you were upset about it. I won’t do it again. I’m sorry.”</p><p>Kate gazes into my eyes, reading my sincerity. Then she smiles. With so much love, it makes my knees tremble.</p><p>“I forgive you.”</p> <p>I pull her to me and kiss her deeply. Tenderly. Stroking her cheek with my thumb.</p><p>Then Kate looks up into my face. “Are you okay? You seem different.”</p><p>“I had this really screwed-up dream. I’ll tell you about it later.” Then I think of something else. “Hey—what do you think of going to Bumfuck, Ohio, for New Year’s Eve?”</p><p>She smiles even brighter. “I would love that.”</p><p>I wink. “Then so will I.”</p><p>Later, after we tuck James into bed and he’s out cold, Kate and I spend two hours putting together a shiny blue bicycle and an eight-foot-wide kid’s trampoline with enclosure that will take up residence in the formal dining room.</p> <p>At least that room will finally have a frigging purpose.</p><p>When we’re finished, just after midnight, we sit back on the couch and gaze at the fruits of our labor. The twinkling lights of the tree reflect magically off the big red bows and the green reindeer wrapping paper. Behind the tree, outside the large picture window, delicate snowflakes cascade down from the dark sky—it’s a picture straight out of a goddamn Hallmark holiday special.</p><p>Kate’s eyes settle on me. Adoringly. “We make a pretty good team.”</p><p>I rub her shoulder. “We really do.”</p><p>It’s something I’ll never forget again.</p><p>I get up and head to the kitchen. When I come back, there’s two wineglasses and a bottle of Chateau Petrus 2002 in my hands. I uncork the bottle, letting it breathe for less time than I should, and pour a generous glass for each of us.</p><p>Kate takes the wine with a smile, and I raise my glass.</p><p>“Merry Christmas, Kate.”</p> <p>She taps my glass with a clink. “Merry Christmas, Drew.”</p><p>We sip, then I lean in for a wine-flavored kiss.</p><p>Delicious.</p><p>Next, I stand up and mess with the stereo. The sound of Michael Bublé singing “Have Yourself a Merry Little Christmas” fills the room, low enough not to wake James. I take her glass and set it on the table.</p><p>Then I hold out my hand to my amazing wife. “May I have this dance, Mrs. Evans?”</p><p>Her warm hand slides into mine. “There’s nothing I’d rather do, Mr. Evans.” Then—because Kate is the perfect woman—she adds, “Well, maybe there’s one thing—but I’m sure we’ll get to that later.”</p><p>I chuckle deeply. My arms wrap around her, holding her against me, her head resting against my chest. And in the light of the Christmas tree, we sway in time to the music.</p><p>Was it all just a dream?</p><p>Honestly? I don’t fucking know. But I’m grateful it happened. Because even someone as brilliant as me needs a refresher once in a while about what’s really important. The moments that matter. And the people we can’t and don’t want to imagine living without.</p><p>As I dance with the love of my life on Christmas Eve, I swear I hear the soft ring of a bell. And if you believe what that legend says, then somewhere, an angel has gotten her wings.</p><p>author’s note</p><p>The following scene was originally written and emailed as a thank-you to those readers who had preordered Tied. Since it shows a special moment in Drew and Kate’s relationship, I’m excited to be able to release it now for all fans of the Tangled series to enjoy.</p><p>It takes place after the events in Twisted (Tangled series, Book 2) but before Tied (Tangled series, Book 4).</p><p>indecent proposal</p><p>It’s a perfect fall day. The leaves are just starting to change, and the sky is a cerulean-blue backdrop for cotton-white clouds. The air is still comfortably warm, but the breeze has that subtle bite to it—a reminder that winter is around the corner.</p><p>Our son, James, is six months old now—a good age. No longer just a screaming head, he’s interactive, expressive, and fun, but not mobile enough to be any real trouble. After dropping him off at my parents’ condo, Kate and I take the Lincoln Tunnel out of the city, to destinations unknown.</p><p>Well . . . unknown to her.</p><p>From the passenger seat, she looks sideways at me, and makes a terrible attempt at tripping me up. “Where did you say we were going again?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My hand rests on her knee, left bare by the casual gray sweater dress that covers the gorgeous contours of her fuck-hot curves. I squeeze the muscle just above her knee—making her jump. “I said it was a surprise. Stop fishing for hints, you’re not good at it.”</p><p>Kate’s brilliant and strong-minded, but her expressive eyes, tendency to blush, and complete inability to lie convincingly undermine any hope of a successful interrogation. Unless a striptease were being exchanged for information. If that were the case, the prisoners at GTMO would happily spill their guts.</p><p>“You seem kind of nervous.” She peers at me. “I’m wondering why.”</p><p>Me? Nervous?</p> <p>We’ve been over this, but it bears repeating: I don’t get nervous. Anxiety is for incapable chumps. When the world’s at your fingertips, there’s no room—no reason—for worry. Just because I’m about to ask Kate the most important question of our lives, just because I’m going to practically put my balls in her hands—giving her the power to crush them with a single word . . . Christ, that hurts to even think about.</p><p>Just because I’ve planned this day down to the finest detail, waited for it, frigging prayed about it, doesn’t mean I’m nervous.</p><p>The ring feels like a lead weight in my back pocket. I’ve wanted to give it to her a dozen times—but I’ve held out. Because this will be the grandest of all gestures, the kind of romantic fantasy that plays out in those terrible mommy porn books my sister reads, but that you rarely see in real life. After this, there’s no way Kate will say no.</p><p>Except . . . she still fucking could.</p><p>And that’s the rub. The risk.</p> <p>It’s infinitesimally small, but it’s there. She might not be ready. She may think I’m not ready. She might think things between us are fantastic—and she’d be right—so why change anything? She might say, “If it’s not broke, don’t screw with it.”</p><p>My stomach twists and turns at all the thoughts. I swallow hard and grip the steering wheel tighter, with suddenly slick palms.</p><p>Okay, I’m nervous. There, I fucking said it. Happy now?</p><p>But I do a good job of covering it as I answer her. “Work has me tense. If you’d like to relieve my tension,” I glance at my crotch meaningfully, “I’m more than willing to pull over. Or—even more fun—keep driving while you do what you do so well.”</p><p>She chuckles. “No, don’t want any possible delays—or you crashing into a tree. I want to see my surprise.”</p><p>The second the car comes to a stop, Kate climbs out, stands between the open door and the car, hand on the roof, transfixed by the scene in the grassy valley below. Five huge hot-air balloons—each more colorful than the next. It’s an impressive sight. Vibrant, like a bowl full of candy from Willy Wonka’s chocolate factory.</p> <p>“No way!” Kate squeals. “This is the surprise? I’ve never been on a hot-air balloon ride!”</p><p>“I know.”</p><p>Giving Kate new, memorable experiences has kind of become a fetish for me. The joy in her voice, the sparkle in her eyes, the astoundingly physical way she expresses her gratitude—it’s a rush. Like an adrenaline junkie searching for the next cliff to dive off of—I’m always looking for another fix.</p><p>My smile mirrors Kate’s expression and her exuberance withers the nervous tentacles that wind their way into my brain. I take her hand and together we walk down the lush hill to the boarding platform, toward Mark Jonas.</p><p>Mark is the owner of Tri-State Ballooning, a company that offers hot-air balloon rides and courses in ballooning certification. After my fifty-five hours of training, Mark and I are well acquainted.</p><p>Kate stares up at the massive air-filled bulbs while I shake Mark’s hand. “How ya doing, Drew?” he says.</p><p>“Good to see you, Mark.” I gesture to my dark-haired temptress. “This is Kate.”</p><p>Kate tears her eyes away from the balloons and shakes Mark’s offered hand. “Nice to meet you.”</p> <p>“Good to meet you, Kate. Drew’s talked so much about you, I feel like I know you already.”</p><p>Kate’s eyes narrow with confusion, until I gesture toward one of the baskets and ask Mark, “She all set to go?”</p><p>He nods. “She is. And the other arrangements are ready, too.” With a wink he wishes me good luck.</p><p>I smack Mark’s shoulder and slip him a fifty-dollar tip. I open the wicker-basket door and step aboard. Then I hold out my hand to Kate.</p><p>Her mouth is slightly ajar. “You’re going to fly this?”</p><p>With a smirk I explain. “You know how much I adore your body—and my own, for that matter. Do you honestly think I’d trust anyone else to make sure we don’t splatter all over the Hudson Valley?”</p><p>Mark passes Kate a folded jacket with his company logo. “In case it gets chilly up there.”</p><p>She accepts the jacket with a chuckle and steps into the basket with me. “Okay, then. Is there anything you can’t do, Drew?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No.” I tell her in all seriousness. “There isn’t.”</p><p>I peck her lips and do a safety check of the controls. Five minutes later, I give Mark the thumbs-up. He and a few of his employees untie the weighted ropes that keep the balloon anchored. The burner comes to life with a noisy whoosh as I open the propane valve, and a bright orange-blue flame surges into the envelope.</p><p>Then, gracefully, we float up into the sky.</p><p>Biting her lip, Kate looks over the edge, watching our growing distance from the earth.</p> <p>“We’re flying, Drew! We’re actually flying!” Her dark eyes glitter, like a kid getting her first glimpse of Disneyland.</p><p>“Yeah, we are, baby.” Pride swells in my chest as I soak up every expression that dances across her face: exhilaration, excitement, awe. But there’s no fear—no hesitation or doubt.</p><p>Kate knows I’m capable of a lot of things—putting her in any kind of danger would never be one of them.</p><p>The sun is low, casting the autumn-hued trees and hills with a magical, golden glow, and it’s surprisingly peaceful at ten thousand feet.</p><p>“It’s breathtaking, Drew,” Kate sighs. “The most beautiful thing I’ve ever seen.”</p> <p>Smiling, my eyes don’t leave her face. “I couldn’t agree more.”</p><p>Like she can read my mind—and by this point in our relationship, that’s frighteningly possible—she turns to me, beaming. As I adjust the propane controls, Kate wraps her arms around my waist and rests her head against my back. Her breasts push against me in the most delicious fucking way. Supple and sexy.</p><p>“Are you cold?” I ask.</p><p>“Nope.” I feel her press a kiss between my shoulder blades. “Thank you. This is . . . beyond amazing—even for you.”</p><p>I want to turn around and kiss her for all I’m worth. Strike that, I want to hoist her legs up around my hips, lift her very convenient dress and fuck her into oblivion.</p><p>Cuddling midair would be awesome. Screwing midair would be so much more awesome.</p> <p>But . . . making sure we don’t crash and die takes precedence.</p><p>Unfortunately.</p><p>Kate is wrapped around me, oohing and ahhing at the stunning spectacle. An hour later, we arrive at our destination—a lavish field of green. After a few bumps, we set down gently, and I turn off the balloon’s burner. Mark’s employees grasp the basket and tie it down.</p><p>“Thanks, fellas,” I call, as I help Kate step onto solid earth.</p><p>“Wow.” Kate shakes her head as we walk up the hill. “How are you ever going to top that?”</p><p>I chuckle huskily. “I can think of a few ways.” I pull her by the hand onto a dirt path that leads into the forest. “The day’s not over yet.”</p><p>Her voice is high-pitched when she asks, “There’s more?”</p><p>“Shit, yeah.”</p> <p>I’ve arranged for a limo to pick us up in a few hours, not too far from our next stop. Then we’ll spend the night at a “quaint” bed-and-breakfast. At least, my sister said it’s quaint—though I don’t understand the B and B attraction. It’s weird—staying in a stranger’s house, sharing a bathroom with people I don’t know from a frigging hole in the wall. But . . . I figured Kate would enjoy it, and this night is all about her.</p><p>After walking through the woods for five minutes, she presses, “Where are we going? Is this like a Little Red Riding Hood, Well-Hung Big Bad Wolf kind of thing?”</p><p>Kate and I have been experimenting with role-play lately. You have got to try it.</p><p>I put my arm around her, grinning. “No, but we’ll add that to the list. You in a slutty Red Riding Hood costume would be fucking hot.”</p><p>The last leg of the trail is all uphill. Kate’s breathing is heavy as we step out of the woods into a clearing that overlooks a swath of vibrant swells and valleys. It’s a kaleidoscope of greens, browns, oranges and reds—almost as stunning as the views from the balloon basket.</p><p>“We’re here,” I announce.</p><p>She stops in her tracks and gasps. Laid out just a few feet away is a thick cashmere blanket, illuminated by flickering LED candelabras at the four corners. A bottle of champagne chills in a silver ice bucket; there are two place settings with delicate china, crystal flutes and gleaming silverware; and gourmet sandwiches and chocolate-covered strawberries are hidden in a large antique picnic basket. Surrounding the display are stone planters, which overflow with fragrant white gardenias.</p><p>“Oh my . . .” Kate is literally speechless.</p><p>I mentally pat my own fucking back.</p><p>We stand hand in hand next to the blanket. The candlelight glows in Kate’s eyes as she looks over the spread. “I’m so lucky,” she whispers, in a voice heavy with gratitude.</p><p>I turn her toward me. “I won’t argue with that, but which good fortune are you thinking about specifically?”</p><p>Her hands slide up over my shoulders, encircling my neck. Her head tilts delicately as she regards me, total devotion on her face. “Do you remember The Notebook?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With a chuckle, I nod.</p><p>“If that were to happen to me—if for some reason I forgot everything else . . . I would still remember you. How it feels to be loved by you. I’m the luckiest woman in the world, because I’m the only one who gets to say ‘Drew Evans is in love with me.’”</p><p>I cup her jaw, holding her precious face in both hands. “You’re the only one who ever will.”</p><p>Before I can utter another word, Kate rises on her toes and kisses me. Unhurriedly, she worships my mouth with her own, conveying her veneration with every deliberate brush of her tongue.</p><p>And . . . and I just can’t fucking wait anymore. With my lips against hers, the words bubble up from my chest. A rough, eager plea.</p><p>“Marry me, Kate.”</p><p>For a second, she doesn’t move. I feel her breath against my chin as she digests the words. Slowly, she leans back to look into my eyes, her face blank—staring—as if she’s not sure she heard what she thinks she just heard.</p><p>“What?” she asks softly.</p><p>“I . . . I had this whole speech, all the reasons we should get married. But the only reason that matters is—I love you. You’re the only woman I’ve ever loved—the only one I want to—for the rest of our lives.”</p><p>Holding her gaze, I sink down on one bended knee and take the ring box from my pocket. “We already have a life together, but I want to make it official. I want to grow old next to you, I want to know you’ll be there to smack my hand when I’m a dirty old man and try to cop a feel.”</p><p>The corners of her mouth arch up into a smile.</p><p>“If you’re the luckiest woman in the world because I love you,” I continue, “then I’d be the most blessed son of a bitch in the universe if I get to be your husband.”</p><p>I open the box, revealing the impeccable two-carat princess-cut diamond, encased in an elegant platinum band. I was tempted to go bigger—flashier—but this is Kate. It had to be something she’d love—a ring she’d gaze at adoringly on her hand. Beautiful, simple, flawless—like her.</p><p>Kate’s eyes dance between the ring and my face. She doesn’t cry, and I’m relieved. I want her laughter, her moans, her gasps—not her tears. Instead, she smiles, and it’s like the sunrise, when those first soft shades of light peek out from the horizon—new and stunning and full of possibilities.</p><p>“I thought you’d never ask.” Her breath hitches. And she whispers, “Yes.”</p><p>The effect of those three tiny letters is immediate and extraordinary. Warmth rushes through my veins. I exhale a lungful of air I didn’t realize I was holding.</p><p>Fucking yes.</p><p>I mean, of course she said yes. Never doubted it.</p><p>I take the ring from the box, and slip it on her slender finger. Perfect fit. Bending her head, Kate seeks out my lips and I’m more than happy to give them to her. Our tongues stroke each other, gentle but sincere, like a vow. Kate falls to her knees, and my fingers caress the soft wisps of hair at the base of her neck. I angle my mouth and encase her bottom lip in my own, sucking gently. She moans and pulls me against her.</p><p>I skim my fingers up the smooth skin of her outer thighs, where her dress ends. Grasping the material, I lift it up over her head in one sure move. Leaving her only in a red lace bra and matching panties—a thong.</p><p>Nice.</p><p>I grasp her hips, dragging her closer. A groan of satisfaction rumbles from my throat when I cup the supple flesh of her perfect ass in both palms. That gorgeous ass—my favorite part. I hold her steady as I grind against her, making my already needy cock harder.</p><p>While we’re still lip-locked, Kate’s deft fingers unbutton my shirt, impatiently yanking it down my arms. I shrug out of the offending garment, and make quick work of the clasps on her bra. I sigh when those pale globes tumble from the confines of their red lace. Cupping the heavy flesh with both hands, I duck my head to take one already peaked, tight nipple into my mouth. Kate’s hands burrow through my hair, tugging and clasping. I suck at the tasty little nub, squeezing it between my tongue and the roof of my mouth with barely restrained pressure.</p> <p>We fall back on the blanket, a tangle of moans and writhing limbs. Kate’s nails scour the muscles of my bare back, and I know she’s feeling just as wild as I am.</p><p>With my heartbeat drumming in my ears, I rear back and jerk the scrap of pantie fabric down her hips—tossing the thong over my shoulder. Luscious, rapid pants escape Kate’s lips as my tongue travels up her inner thigh. I hook her knee over my shoulder, spreading her open, savoring the view of her hot, pink flesh in the light of the setting sun.</p><p>I hover over her, just close enough to caress her with my breath. “Fuck, Kate, the things I want to do to you . . .”</p><p>Her round, dark eyes drift over my face—filled with love and need. Docile and demanding. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m yours, Drew,” she tells me in a low voice. “You can do anything . . . everything.”</p><p>Does she even know what she’s offering? How badly I want to own her—fucking claim her—out here in the open? How desperately I want to hear her voice, soaked with pleasure, screaming my name until it echoes off the hills?</p><p>Anything?</p><p>Oh the possibilities.</p><p>Feeling Kate’s eyes on mine—watching her watch me—I slide down till I’m face level with that sweet juncture between her thighs. A groan of gratification rumbles from my chest when my open mouth envelops her delectable *. I spear her slick folds with my tongue and revel in her taste—the feel of her against my tongue. Kate arches her back and swivels her hips, urging me on—seeking wet, firm friction. I love her roughly with my mouth, sucking, nipping, and laving—scratching the tender skin of her thighs with the stubble of my chin.</p><p>When her legs are trembling and her words become a jumbled chant of need, I rise, grasp her hips, and flip her over. She goes oh so willingly, bracing herself on hands and knees. Gripping her shoulder, I plunge inside, grunting and grinding, skimming my other hand down her back, over the swell of her ass, across her stomach, then back up again. My pelvis crashes against her ass, jerking her forward. Until she pushes back against me, welcoming every hard thrust.</p><p>It’s unbridled fucking. Passion at its most raw.</p><p>I’m all senses, pure sensation—the wet, gripping muscles of her *, her smooth skin under my palm, her silky hair wrapped around my fingers, her keening whimpers, the scent of sweat and sex, the feel of her hand on my thigh, pushing for more. Faster. Deeper.</p><p>I pull her up harshly, her back against my chest, still fully buried inside. My teeth scrape her ear, her neck. Kate moans low and loud. My hand slides down between her legs, rubbing her clit until she quivers.</p><p>I’m possessed with the animalistic need to mark her. My lips latch on to the fragile skin where her shoulder and neck meet. I suck until she screams—on the razor-edge of pleasure and pain. Then I move my mouth upward and do it again. Leaving a trail of brands.</p><p>Because she’s mine.</p><p>The thought makes me harder and I surge forward again, needing to feel her come around me, all my focus centered on where I’m enveloped. But it’s the brush of Kate’s lips against my hand that pulls me back, that slows the shallow plunge of my cock. She kisses each fingertip tenderly, then begs, “I want to see you, Drew.”</p><p>I untangle my hand from her hair, and Kate turns on her knees, facing me. Without a word, I sit back on my ass and she straddles my waist, her small hands resting on my shoulders. She looks down, gyrates until we’re lined up, and I grind my jaw with pleasure as she slowly sinks down on my dick.</p><p>Our hard breaths mingle, face-to-face, and I’m caught in her eyes. Drowning in the depths of those dark pools—with no thought of looking anywhere else. My hands grasp her slender hips, helping her rise and fall. And it’s even more powerful, more fucking intense than our desperate vigorous movements just minutes before.</p><p>I gather Kate closer, her breasts brush my chest, her forehead rests against mine, and with a strangled cry she comes. The feel of her contracting, tight and hot, sends me straight over the edge with her. My hips surge upward one final time, and our bodies go stiff, racked with helpless, pulsating ecstasy.</p><p>Breathlessly, Kate rubs her nose against mine and I kiss her with languid ease. I lay back on the blanket and she squirms on top of me until her head rests comfortably on my chest, her legs surrounding mine. For a few minutes, neither of us speaks. We just enjoy the satiated looseness of our limbs and the slight breeze on our heated skin.</p><p>Then Kate lifts her head and rests her hand on my jaw. “Remember that night, when you asked me to move in with you? You made me dinner at your apartment and we danced?”</p><p>Jesus, as if I could forget. The desperation, the resolve to convince Kate her heart was safe with me, the amazing sensation of holding her again after what felt like fucking forever, and the perfect elation when she agreed to give us a shot.</p><p>“I remember.”</p><p>Kate squeezes my hand. “And you told me you wanted to make all my dreams come true?”</p><p>I run my finger across her cheek. “Yeah.”</p><p>She stares at the glittering ring on her finger with a contented smile. “You just did.”</p><p>Keep reading for a sneak peek at Brent’s story in</p> <p>APPEALED</p><p>The third book in New York Times bestselling author Emma Chase’s sexy Legal Briefs series</p><p>Coming Fall 2015 from Gallery Books!</p><p>I look across the yard at the crowd of chattering, monochromatic people. All of them so eager to clone each other, to not be labeled as too flashy or ostentatious. It’s a sea of beige—tan slacks, taupe summer dresses, and one pair of light brown Ray-Ban sunglasses after another.</p><p>Until a burst of red steps out from under the white party tent. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Maybe this afternoon won’t be a total loss, after all.</p><p>The dress is tastefully alluring—knee-length, sleeveless, a corded neckline that loops around the collarbone and ties in the back. But the body within it is the real highlight. She’s tiny but unmistakably womanly—warm peach-hued skin, an elegant neck, delicate arms, a slight swell of cleavage, a tight waist, and toned legs with the sweetest hint of muscle. Her hair is thick, a multifaceted blond—pale, almost white strands grace her dainty jaw—but there’s shades of honey-gold and caramel leading back to a low bun.</p><p>She’s fucking stunning. I have no idea who she is—but finding out just became my number-one priority.</p><p>She spots me as I approach. Bright turquoise eyes, sharp and appraising, rake me over from head to toe. Enjoy the view, baby. I’ll be happy to give her the extended tour later on.</p> <p>“Hi,” I say, smiling when I reach her.</p><p>She raises her chin, straightening her shoulders. “Hello.”</p><p>There’s something familiar about her. It tickles the back of my brain and stirs my cock. I wonder if she’s a friend of my cousins’—possibly a bridesmaid I hooked up with at one of their weddings?</p><p>“Enjoying the party?”</p><p>Her gaze turns toward the crowd as she sips from the crystal flute in her hand. “Yes. I’m sure the birthday girl is ecstatic. Caviar and champagne—what every one-year-old wants.”</p> <p>Sarcasm. I like sarcasm. It suggests intelligence. Confidence.</p><p>I like her ass even more—which I’ve discreetly checked out.</p><p>“Word around the country club is you’ve gone into business on your own,” she comments casually. “Got yourself a law firm with your name on it.”</p><p>Her tits are pretty phenomenal too. A little on the small side, no more than a B cup—but I just bet they’re firm and perky and magically delicious. The kind that can forego a bra, so her nipples poke against her shirt when she’s turned on. I love that look on a woman.</p><p>“Yes, almost two years now. We’ve built quite a name for ourselves.”</p><p>“You must be so proud.”</p> <p>“I am.”</p><p>She lifts one shoulder. “I think it’s pretentious as hell.”</p><p>My eyes snap to her face. “I beg your pardon?”</p><p>“It’s a farce. The brave young defense attorney, giving up the big-paycheck firm to serve the little people.” Her voice turns derisive. “It’s easy to be brave when you have Great-Grandpa’s money behind you.”</p><p>My brow furrows. “That’s pretty presumptuous of you.”</p><p>“No, what’s presumptuous is thinking you can walk over here, ogle my tits and ass, and assume I won’t call you on it.”</p><p>Guess I wasn’t as discreet as I thought.</p><p>“Is ogleable a word? Cause if it is—you’re it. A lot of women would take it as a compliment.”</p> <p>She faces me head-on. “A lot of women are idiots. And not as knowledgeable as I am about what a selfish, immature little prick you can be.”</p><p>Little? I resent that—particularly in such close proximity to the word prick.</p><p>“Who the hell are you?”</p><p>She stares at me for two beats. Then she throws her head back and laughs.</p><p>“My God. Of all the ways I pictured this going, I never considered you’d totally forget me. But I guess I shouldn’t be surprised—I was pretty forgettable back in the day.”</p><p>“What does that even—”</p><p>A woman’s voice calls “Kennedy!” cutting me off—and knocking me on my proverbial ass.</p><p>Mitzy Randolph, one of my mother’s oldest friends and our next-door neighbor, walks up and plants two air kisses on the blond beauty at my side.</p><p>“I’ve been waiting for you to arrive,” she tells her.</p><p>“I’ve been here for twenty minutes, Mother.”</p><p>Holy fuck.</p><p>Mrs. Randolph turns to me, her arm around her daughter’s back. “Isn’t it wonderful that our Kennedy has come home, Brent?”</p><p>And all I can do is parrot like an idiot. “Yeah . . . wonderful.”</p><p>Mitzy steps back, takes her daughter’s hands, and holds them up at her sides—looking her over, judging and evaluating—just like the good old days. “I’m so happy to have you out of Nevada. All those nasty casinos and dust and desert.” She caresses her cheek. “That dry air has wreaked havoc on your skin. I’ll make you an appointment with my esthetician this week—she’s a miracle worker.”</p><p>Kennedy gives a resigned sigh. “Thank you, Mother.”</p><p>“Now I’ll let you two get reacquainted. I see the Vander-blasts are here and if I don’t spend at least ten minutes with Ellora she’ll work herself into a snit.”</p><p>When we’re alone again, I can’t stop staring. Once upon a time she was my best friend. For a hot minute she was more. After that, she hated me. And then she was just . . . gone.</p><p>I haven’t seen her for fourteen years, and the last time I did, she sure as shit didn’t look like this.</p><p>“Kennedy . . . ?” I whisper, still not entirely convinced it’s her.</p><p>She regards me with a tilted head, a cocked hip, and a disdainful smile. “Hello, Dickhead.”</p><p>Okay. Now I’m convinced. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It takes a few seconds to recover from the shock, but when I do, I hit the ground smirking. Because if there’s one thing I know how to do, it’s give as good as I get.</p><p>“Kennedy Randy Randolph.”</p><p>Her smile drops like a barrel over Niagara Falls.</p><p>“My middle name is Suzanne.”</p> <p>“I know, but I never did come up with a nickname for you. Though we already considered Randy, didn’t we? It wasn’t a good fit—I’ll keep working on it.”</p><p>I shake my head, checking her out all over again. Because now that I know who she is, we’re talking a whole other level of depraved interest.</p><p>“Goddamn. You look—”</p><p>“Yes, I know.” She sighs, then gazes at her manicure in that bitchy way women do. “Thank you.” There’s not a shred of sincerity in her tone—like she’s heard a million compliments before. Which, with her level of hotness, is possible. Except for one thing.</p><p>“What’d you do to your eyes?” I lean in, frowning.</p> <p>“They’re called contact lenses.”</p><p>“Well, take them out. I don’t like them. Your real eyes are incredible.”</p><p>Breathtaking, actually—deep, warm brown with flecks of gold. I’d know Kennedy’s eyes anywhere.</p><p>“What’d you do to your face?” she asks, folding her arms.</p><p>I touch my chin. “I grew a beard.”</p><p>“Well ungrow it. It looks like a vagina from a 1970s porn film.”</p> <p>My lips twitch—because, fuck, the things that come out of her mouth.</p><p>That always did.</p><p>“I’m starting to get the impression you don’t like me anymore, sweetness.”</p><p>Challenge rises in her eyes. “You’re assuming I actually liked you to begin with. You know what they say about people who assume, ass.”</p><p>I square off against Kennedy. Game on.</p><p>“You definitely liked me. Remember that summer you flashed me your boobs? That has to count for something.”</p><p>“I did not flash you my boobs.” She scowls.</p><p>“You totally did. They were the first I’d ever seen—made an indelible impression.”</p> <p>She grinds her teeth. “I jumped in the pool and my bathing suit rode up.”</p><p>“I think it was a Freudian Nip Slip. Subconsciously, you meant to do it, because you liked me.”</p><p>“I think you’re a pompous bastard. Possibly a sociopath.”</p><p>I grin. “Doesn’t mean you didn’t like me.”</p><p>Over Kennedy’s shoulder, I catch my mother’s eager gaze on us. She’d be less obvious if she had a spotlight and binoculars aimed our way.</p><p>“My mother’s watching us.”</p><p>Kennedy places her empty glass on the tray of a passing waiter and picks up a full one. “Of course she’s watching us. For years, her greatest wish was that I’d grow up to bear your spawn.”</p><p>I snort. “That’s ridiculous.” Then I glance sideways at Kennedy, gauging her reaction. “Isn’t it?”</p><p>“Completely.” She looks me straight in the face. “I could never be with someone like you—you have the maturity of a twelve-year-old boy.”</p><p>I raise my glass. “And you have the chest of one.”</p><p>I expect her to come back with a clever, biting retort, but she just gestures to me with an open palm. “I rest my case.”</p><p>Ironically, my first instinct is to stick my tongue out at her. But I won’t give her the satisfaction.</p><p>“Besides,” she adds with a haughty smile. “I’m seeing someone. Maybe you’ve heard of him? David Prince.”</p><p>David Prince is a junior senator from Illinois with his eye on the White House. He’s a rock star, the second coming of John F. Kennedy. I bet the entire Democratic Party and a good percentage of Republicans have his picture hanging on their office wall—the same way that poster of a feather-haired Jon Bon Jovi hung on the bedroom walls of all sixteen of my girl cousins’. And two of the boys.</p><p>“You’re dating a politician?” I say it like it’s a dirty word, because in my experience politicians are rarely clean.</p><p>She raises a perfectly manicured eyebrow. “You were almost a politician.”</p><p>“Only in my father’s wet dreams,” I volley back. “Although, you always said you were going to marry a prince. Sounds like you’re on your way.”</p><p>“My mother said that—not me.”</p><p>I smirk. “Then she must be ecstatic. You’re finally everything she always wanted you to be.”</p><p>Game. Set. Match.</p><p>Something shifts in Kennedy’s eyes, and I suddenly get the feeling we’re not playing anymore. “Not everything. Mother wanted me to be a ballerina.”</p><p>Years ago, I’d heard she was doing undergrad at Brown University. But other than that tiny detail there’s been nothing. Her father is a talker, her mother a bragger, but when Kennedy dropped off the grid after boarding school, information on her locked up like Fort Knox.</p><p>“Is that what you were doing in Las Vegas—dancing? Kind of short for a showgirl, aren’t you?”</p><p>Though I’d be sitting front and center for that show if I could.</p><p>She nods slowly, smiling way too smugly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yes, too short for a showgirl . . . but just the right height for a federal prosecutor.”</p><p>That stops me cold. And I suddenly feel a strong kinship to Ned Stark’s bastard son because: You know nothing, Jon Snow!</p><p>And apparently neither do I.</p><p>“You’re a . . . ?”</p> <p>“The Moriotti case, the mafia capo? That was me. I transferred to the DC office last week—and I can’t wait to start playing on your home field.”</p><p>Over the last fourteen years I’ve thought a lot about what it’d be like to see Kennedy Randolph again—but I never thought it’d be on the opposite side of a courtroom.</p><p>“You realize this makes us mortal enemies? You’re now the Lex Luthor to my Superman, the Magneto to my Professor Xavier.”</p><p>“With your comic book obsession obviously still in full effect, I’d say I’m more the Wendy to your Peter Pan complex.”</p><p>I ignore the dig because I’m too busy connecting the dots. “Wait a second—your middle name is Suzanne.”</p> <p>“Thought we covered that, already.”</p><p>“You’re K. S. Randolph?”</p><p>Her smile goes wide—two rows of pearly white evil. “Yep. That’s my professional moniker.”</p><p>“You’re the prosecutor on my Longhorn case?”</p><p>She golf claps. “Right again.”</p><p>“I’ve been trying to get a meeting with your office—so we can talk.”</p> <p>Her features crumple with mock confusion. “What would I want to talk to you about?”</p><p>“Uh, pleading the charges down?”</p><p>Ninety-seven percent of federal criminal cases end in plea bargains. If you want a real feel for jurisprudence today, forget Judge Judy—watch Let’s Make a Deal instead.</p><p>She chuckles in a distinctly not-nice way. “Brent, Brent, Brent—I don’t make plea deals. Ever. It’s kind of what I’m known for. Oh, and I’ve never lost a case. I’m known for that too.”</p><p>I was wrong—this match isn’t anywhere near over. It’s just getting started. </p> </body></html>"]