["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>The alarm chimed, sending tiny shivers through Deirdre’s fingers, coated in liquid interface. Five minutes to the opening speech. “All right, all right.” She shrugged the lead-grey metal off her hand and caught her reflection in the mirror. The hair. She had forgotten about her hair.</p><p>Her gown looked fantastic. She loved this dress; the cut and color suited her: a shimmering grey-black that caught her breasts, wound about her waist and fell down in clean lines to brush the floor. Unfortunately, the gown alone wouldn’t do it. Her hair set atop her head in an ugly pile, and it was too late to do anything about it. It’s your fault, Robert, she thought, pulling out the pins one by one. She dragged the brush through her hair and inspected the result.</p><p>Hideous.</p> <p>That’s fine, she decided. Nobody can be expected to be ran ragged for nine straight hours and then attend a banquet looking perfect.</p><p>A knock jarred her from her thoughts. “Open!”</p><p>The door slid open, revealing Fatima Lee in her navy blue power-dress. Robert’s aide-de-camp looked perfect, her hair a glossy black wave, her face fresh as if she had taken a long refreshing nap instead of the grueling administrative marathon.</p><p>“Three minutes to opening speech. If we’re late, Robert will suffer a deep space fit.”</p><p>They headed out the door and down the winding hallway at the speed of a brisk march. Unbound by gravity, the makers of the Orbital Embassy had constructed an impossibly tall banquet hall, and the hallway circling it matched it in height. Today the huge walls and ceiling lost in darkness brought a sense of foreboding. Like going through some ancient Temple to be sacrificed.</p> <p>Fatima’s communicator buzzed with voice of Michel Rashvili. “Where are you? Robert’s losing it.”</p><p>“We’ll be there in thirty seconds, tell his Excellency to keep his panties on.” Fatima snorted. “I don’t get it. The man can negotiate with terrorists with a needle rifle pressed to his temple, but banquets drive him up the wall.”</p><p>“That’s because he can’t control a banquet,” Deirdre murmured. “And the stakes are high.” 30 million lives hanging in the balance would give anyone a pause.</p><p>They rounded the curve. The huge doors of the banquet chamber waited wide open just ahead, under the banner depicting the Duke of Rodkill, Robert’s mentor and veritable legend in the annals of the Diplomatic Corps. Fatima zeroed in on the doors.</p><p>Several men dressed in black entered the hallway from a side passage, also aiming for the door. Deirdre caught Fatima’s arm. “The Reigh.”</p><p>The aide-de-camp halted. The Reigh moved in silence, like black ghosts, each carrying a vered, a short ceremonial branch, in left hand signifying their peaceful intentions. Tradition dictated they stayed silent when in sight of the enemy until given permission to speak by the Lord. For them, everyone is an enemy, Deirdre thought.</p> <p>They had to be desperate for the money to even enter the Orbital. Unfortunately, taking money for their military services was the very thing that the Reigh doctrine categorically forbade.</p><p>A tousled man shot out of the doors at a near run. Michel Rashvili mumbling into his communicator. As if in slow motion Deirdre saw him crash into the nearest Reigh. The black-gloved hand let go and the sign of peace clattered to the floor. Oh great Lao Tzu.</p><p>Michel stumbled, caught himself. His face went slack with shock. A short-range plasma firearm leaped into Fatima’s hand almost on its own.</p><p>“Michel, kneel!” Deirdre approached and dropped to her knees.</p><p>Michel hit the floor next to her. Wide-eyed, he looked at the veled. “I’m so sorry. Should I?” His voice shook.</p><p>“No. Keep your head down, don’t look them in the eye.” Very slowly Deirdre reached and picked up the branch off the floor. Holding it on her open palms, she raised it above her head, like an offering. Their eyes fixed on the floor, they waited. Moments dripped by, long and viscous. Finally the Reigh closest to her stepped forward. Leather brushed her palm, and the Reigh moved on, still silent, into the banquet hall. Deirdre remembered to breathe.</p><p>“Sweet Jesus.” Michel straightened. “I can’t believe I knocked that out of his hand.”</p><p>“You didn’t.” Fatima’s firearm had vanished. There was no way it could be hidden in that tiny dress. “He dropped it.”</p> <p>“You’re kidding me.”</p><p>“He dropped it,” Deirdre confirmed, looking after the Reigh making their way through the banquet hall. “When was the last time you fought in hand to hand combat, Michel?”</p><p>The adjutant ran a shaking hand through his hair. “I don’t remember.”</p><p>“They do it every day. Trust me, if that man didn’t want to run into you, you wouldn’t have touched him in a million years. Go hide somewhere.”</p><p>“What?”</p><p>“Go hide, dimwit.” Fatima snorted. “When Robert finds out, he’ll blow his core. You want to give him a few hours to cool off.”</p><p>The words finally made an impact and the adjutant took off down the hallway.</p><p>Deirdre frowned. “We have been tested, and I’m not sure we’ve passed. Why do I have a feeling this isn’t going to end well?”</p><p>“Because it won’t.” Fatima’s face was grim. “Let’s go.”</p><p>For better or worse they entered the banquet hall.</p><p>Chapter 2</p><p>The red-furred Vunta officer at Deirdre’s left smiled at her, exposing fifty two sharp teeth, arranged in twin rows in his cavernous mouth. The effect was enough to give a hardened Navy veteran a lifetime of nightmares.</p><p>“You wook wowery,” he offered, sounding very much like a Terran Scottsman with a mouthful of tissue stuffed into his cheeks. He hit her with a direct, unblinking stare.</p><p>Trying to dominate. He should know better. “Thank you.” She showed him her teeth and glared back.</p><p>For a moment they stared eye-to-eye, neither willing to back down. Deirdre ground her teeth. The sound died in the hum of the banquet hall but not before the Vunta heard it. A noise reserved for the alpha of the Vunta society, the grinding had the same effect on the Vunta as the scarping of the nails on a glass had on human ear. The officer wrinkled his muzzle and looked away.</p><p>Deirdre glanced across the hall at the Vunta, seated here and there at the tables. Too many flickering ears, too many flashes of teeth, too much animation in the gestures of furry paw-hands. Like sharks smelling blood in the water. What is going on? What do they know that we don’t?</p><p>She looked to Robert, seated at the head table between the Vunta Ambassador and the elderly lemon-skinned Monrovian with mournful iconic eyes. Sir Robert Sergei Sarvini, Ambassador of the Second Intergalactic Empire to the Branches of Reigh, looked perfect: hair slicked back into a horse tail, handsome face shaven, trim figure sharp in Diplomatic Corps formal midnight blue. Urbane, debonair, eloquent, every inch worthy of the long list of titles attached to his name.</p><p>Robert’s food lay untouched on his plate. Officially the banquet was thrown in honor of the successful treaty negotiations between the Monrovians and the Vunta Caliphate, for which the Empire, in the form of Robert, had provided a neutral meeting ground. Unofficially, Robert wanted to woo the Reigh. Unfortunately, he was stuck at the head table, sandwiched between the two treaty partners.</p><p>Their stares connected and in his eyes she read a confirmation. Yes, something’s up. No, we don’t know what. We can do nothing about it. Just sit tight and wait.</p><p>Deirdre sighed. There were four parties to this dance: the Vunta Caliphate, the Monrovian Republic, the Empire, and the Reigh. Each wanted something and would claw all others bloody to get it. All she wanted to do was to prevent a massacare.</p><p>She looked to the guest of honor table where the Lord Nagrad of the Reigh sat with Nina on one side and a white-furred Vunta dignitary on the other. The rest of the Reigh formed a line behind the table. None but the Lord had chosen to sit down. None ate or drank. A line from the Reigh Codex popped into her head: I will consume no food in the house of my enemy.</p><p>Nagrad’s scarred face was grim. Had he been from an inner Imperial world, she would’ve guessed him at eighty or ninety. Her painstaking research put him at closer to sixty. The only Reigh lord in the history of his people to entertain the idea of cooperation. His wife was dead. His entire family consisted of his son. And the Vunta Raiders were very afraid of him.</p><p>The Vunta dignitary shot Nagrad a toothy smile and said something. Nina cut in, smooth, breathtaking like a golden angel against the backdrop of black. Deirdre felt a stab of jealousy right in the stomach. Nina’s perfect six foot and one inch tall figure was wrapped in a strapless gown of champagne-colored lace, accented with complex swirls of golden thread. The dress hugged her like a glove. The color perfectly complemented her light blonde hair and light bronze complexion.</p><p>“Why couldn’t we have her job?” Fatima murmured at her right.</p><p>“Because we don’t score 8:13 on the proportion scale,” Deirdre said. “And because we haven’t been trained as escorts and we don’t have a perfect recall.”</p><p>“Bullshit,” Fatima said. “You know you could do what she does with your eyes closed. You’re a freaking cultural attache. You know more about Reigh than all of us combined. You should be picking the Reigh Lord’s brains, not she.”</p><p>“She knows what she’s doing. My job is to compile and analyze the information. Her job is to keep the object of her attention enraptured.” And it would be an incredibly difficult task, considering the strictness of the Reigh rules of conduct. Nothing off-color. Not a hint, not a joke, not even an idea of impropriety. No reference to sex, religion, or politics. Deirdre smiled. “I’m perfectly happy to advise her from the sidelines.”</p><p>Fatima sneered. “You have no ambition. In the next life, you’ll be reborn as a tea kettle.”</p><p>Nina reached for a small appetizer and artfully offered it to the Reigh Lord. He accepted the tiny twisted dough puff and bit into it. Nina continued talking. She had a way to totally engage a person in conversation, until speaking to her appeared to be a reward in itself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The Reigh Lord finished the puff. A nervous tick jerked his face once, twice. A grimaced twisted his features, baring his teeth. He arched his back, biting at the empty air. His hands flailed, knocking over the goblets and plates. A spasm gripped his body. He shuddered, froze, and fell back against his seat, foam sliding from his lips down his chin.</p><p>For a moment absolute silence claimed the hall. And then chaos broke.</p><p>Chapter 3</p> <p>The situation made absolutely no sense.</p><p>Deirdre dipped her fingers into the interface. The liquid metal coated her hand, climbing from her fingertips all the way to her wrist. It slid between her fingers, slightly cold, dry but slippery with silky smoothness, the way very fine sand might feel if individual sand granules were perfectly round. As the synaptic implants under her skin made connections with free floating nanoclusters, she felt her hand–skin, muscle, ligament, and bone–stretch impossibly far. She thought of the archive. The four petals of the unit ignited with pale green, and the huge collection of files, the sum total of her research and archival documents, flared into existence, projected into space above the petals</p><p>Ten feet away Robert slumped in the chair. In the corner Nina rubbed her face with her hands. The room was dim, the huge communication screens on the wall silent and dark, all except the one on the right side, showing the map of the sector. In the center of the map hung the Colchida Cluster, three stars, eleven habitable worlds total, four warp points, thirty million colonists. It used to belong to the Monrovian Republic. Situated too far from Monrovian industrial centers, it was all but worthless to the Republic. But to the Empire, the Cluster was a diamond in rough. Had the Empire been given a chance to develop the Cluster, it would’ve become the biggest industrial and commercial base of the sector.</p><p>Unfortunately the Vunta Caliphate very much enjoyed raiding the Cluster while it was in the Monrovian possession. The numerous stars of the Caliphate, tinted with pale blue to show the territory boundaries, hung in the corner of the map like a storm cloud. It would take the Empire at least two decades to build up the defenses of the Cluster to a survivable level. Until then, the only guard against the Vunta were the Reigh, a thin ribbon of worlds tinted with green.</p><p>The Vunta wanted to make the last run at the Cluster, stripping it of all valuables. Hundreds of lives would be lost. The Empire would threaten war and the Caliphate would back off with apologies, but the budding economy of the Cluster would be wrecked. It would take decades and billions to recover.</p> <p>The Empire needed to protect the Cluster. The Reigh needed the money. But the Reigh doctrine forbade trading payment for military service. And so the staff of the Embassy had to figure out how to skirt the Reigh doctrine. To find an underhanded way to exchange money for protection with the people, who were forbidden to become mercenaries. Now it would never happen.</p><p>They were responsible for the safety of 30 million colonists and they blew it. The thought made her stomach lurch.</p><p>Deirdre sank deeper into the interface, both arms up to the elbow, speed-reading through the flurry of documents and her notes. She couldn’t quite put her finger on it, but she was sure if she just figured out what it was her subconscious was trying to tell her, the situation would become logical.</p><p>Fatima moved on quiet feet to stand at Robert’s side. “Would you like some tea?”</p><p>“What I would like is to travel back in time twenty four hours and strangle the sushi chef. How could we not know Nagrad was allergic to redfish caviar?”</p><p>Deirdre heard the question. It sank in slowly, fighting its way through her focus.</p> <p>“Numerous reasons,” she said, still reading. “Nagrad could have not known he was allergic. He could have deliberately hidden the allergy so it wouldn’t be used against him. He could’ve been distracted by Nina and not realized what he was eating. The Vunta could’ve poisoned him. Your theory is as good as mine–all of them are total rubbish. ”</p><p>Robert startled. “Why?”</p><p>The tone of her voice snapped her out of her search. “Because the Reigh are suspicious paranoiacs, who also happen to be very poor actors.”</p><p>She tossed the recording of the banquet to one of the side screens, fast-forwarding to the right frame. “Look at him. Yes, he’s taking pains to listen to Nina, but he’s hardly absorbed. He can’t even pretend to be interested enough to fool a casual observer. He’s definitely not distracted enough to ignore poisonous food. Look at the line of faces behind him. They are about as relaxed as stone idols on New Barbar and they are watching him so hard, they don’t even blink. Do you really think they would let him put something bad in his mouth? Not really. Nor would they let the Vunta mysteriously sprinkle something on his food. This whole thing makes no sense at all.”</p><p>The main screen ignited and the face of Timur Gonzales came into the view. The Chief of Security looked slightly baffled, hooded dark eyes melancholy, long phlegmatic face relaxed, as if he just woke up from a long nap in sunshine. It made total sense that the Reigh would demand communication through him the Branch Nagrad and the Empire were now technically in the state of war. Unfortunately he had about as much diplomatic ability as Deirdre herself.</p><p>Timur dragged his fingers across his chin, stroking an imaginary beard. “We have contact.”</p><p>Robert looked up. “Patch them through.”</p><p>“They won’t talk to you,” Deirdre said, almost at the same time as Timur. “Why not?”</p> <p>“Because you’re technically responsible for Nagrad’s death. They would be honor-bound to kill you on sight,” Deirdre said.</p><p>“What she said,” Timur added.</p><p>Robert growled. “Fine, patch them through on the side screen as a closed feed.”</p><p>“They’ve already delivered the terms.”</p><p>The veins in Robert’s temples bulged. “For Zeus’s sake, would you stop wasting my time then and give me the bloody recording?”</p><p>A harsh-faced Reigh filled the screen. “You’ve robbed our Branch of a great man. You must atone. The bloodtree must be replenished. You will provide a woman for Lord Nagrad so an heir can be born. And you will pay a dowry. A very large dowry for the insult was grave. Thirty billion units.”</p><p>Deirdre blinked. Brilliant. Lao Tzu, that was simply brilliant.</p><p>Robert exhaled. “Out of the question! The entire Reigh Branch can survive for a decade on that money. Tell him.”</p><p>Deirdre cut in. “Robert, a marriage would make you related. He would be honor-bound to protect your possessions.”</p><p>She watched the thought sink in. Robert’s face took on an intense look of a hound closing in for a kill. “Ask him if the marriage would mean Branch Nagrad would protect the Cluster in the event of a raid or invasion.”</p><p>Timur intoned the words. Deirdre tuned him out, going back to her notes. She already knew the answer.</p><p>“Yes,” Timur relayed.</p><p>Robert leaned back. “So here it is. Nagrad Junior doesn’t waste time, does he? Thirty billion is a bit steep, but it’s doable.”</p><p>“I’ll do it. It’s my responsibility.” Nina rose with dignity, her voice hoarse. “You may tell Lord Nagrad that I accept his proposal.”</p><p>“He doesn’t want you,” Timur said.</p><p>“Well, who does he want?” Robert asked.</p><p>Deirdre finally hit on the correct recording, thirty-two years ago, one of the first contact missions to the Reigh. The ceremonial trading of the swords, and sharing of the food. She zoomed the picture, focusing on the platter before the Survey Captain and a young-looking Reigh warrior.</p><p>Robert’s face penetrated the projection. She looked up at him.</p><p>“Deirdre,” he said, his voice quiet and earnest. “Do you remember your oath to the Diplomatic Corps? The part where you promised to dedicate your body and mind.”</p><p>“To serve to the most of my ability and to sacrifice my life should my duty demand it. Of course I remember.”</p><p>Robert tried to pick up her hands but they were covered in the liquid interface. He settled on holding her shoulders instead. “How do you feel about sacrifice in a form of a marriage?”</p><p>“Lord Nagrad desires a meeting with his bride,” the Reigh said. “He wants to determine that she is of sound body and free of mental retardation. She must be ready in one hour.”</p><p>Robert wheeled about. “Our shuttle. Tell him our people are coming with her and we want her safely delivered back or the deal is off.”</p><p>After a momentary pause, the Reigh inclined his dark head. “Agreed.”</p><p>Chapter 4</p><p>The hallways of the Nagrad Keep looked unlike anything Deirdre had imagined. She had pictured bleak dark walls; instead she found wall-long windows and a palette ranging from rust to fresh mint green. As she walked down the corridor between Timur and Johanna Bray, the red rays of the rising sun danced on the wall and slid on her gray dress, adding color to the fabric.</p><p>It didn’t make her feel any better.</p><p>She recalled Robert’s briefing: You’re going there to haggle. Get him down to twenty billion. Take the initiative and don’t let him control the conversation. I’m sorry I can’t be there with you, but I promise you, I won’t send you to him without backup again. This is just the first step, Deirdre. We have a long way to go before we’ll agree on the amount.</p><p>The fact that she was being appraised like a cow at market apparently didn’t bother him at all.</p><p>Their escort, a Reigh woman in black leather, led them to a wooden door and stepped inside, closing it behind her.</p><p>“Why me?” Deirdre murmured.</p><p>“Because you’re hot,” Timur said. “Because he hates blondes. Because a bug bit him this morning when he got out of bed.”</p><p>“He had it on the first one,” Johanna said. “You’re pretty hot. Don’t worry, we’ll get you back up to the Orbital in one piece.”</p><p>The door opened and their escort invited them into the room with a sweep of her hand.</p><p>Deirdre stepped through. Despite the large window, gloom pooled in the corners and snuck across soft rug. A single table stood in the middle of the room, lit by soft yellow light of a cluster lamp. Two chairs flanked the table. In a far chair sat a Reigh. Lean. Dressed in black like all of them. Black hair, cut short. He sat just outside the circle of light, and shadows masked his face. What a cheap trick. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The escort moved forward, silent like a shadow, and held the second chair out for her. Here we go. Her knees trembled. This is so stupid. Why am I scared?</p><p>She forced herself to walk across the carpet. Timur followed. The Reigh gave him a flat stare and the chief of security halted a few feet away. Deirdre sat.</p><p>“Lord Nagrad, I presume.” Her voice sounded almost normal.</p> <p>The Reigh inclined his head. She could see him now. He had a hard face, not handsome but not unpleasant. Square jaw, strong nose. The same sharp intelligence she saw in his father’s eyes showed full force in his. How old is he? Thirty?</p><p>“I am.”</p><p>“Deirdre Lebed. I know.”</p><p>The sound of his voice almost made her jump. She looked past him, trying to collect herself, and saw four shadows in the depth of the room. Bodyguards.</p><p>Take away the initiative. Right. “Would you mind if I asked you a question?”</p> <p>“Please, feel free.”</p><p>“Why choose a foreign wife? One who is unfamiliar with the traditions and culture? Why not just take the monetary restitution?”</p><p>He braided the fingers of his hands into a single fist. “To accept a bribe for the loss of life is forbidden by the doctrine. Besides, a woman from outside the Reigh has several advantages. The man is the trunk of a family, but the woman is its root. In our society, men own the children and the means of war. Everything else is owned by the woman. And too often a woman’s first loyalty is to her mother instead of her husband. It tends to make matters complicated. A woman of the foreign blood has no one to turn to. She would exist solely at the mercy of her husband.”</p><p>Fantastic. This conversation was going a long way to allay her concerns about becoming a bride.</p><p>“And,” the Reigh Lord permitted himself a small smile. “Our traditions are rather binding. There are certain things a man could ask of foreign woman that would be considered unclean by the women of the Reigh.”</p><p>“What kind of things?”</p> <p>“Things of sexual nature. Do you consider yourself open-minded in those matters, Lady Deirdre? Would you do all those things at my request?”</p><p>If he was willing to walk down the road, it was perfectly fine with her. With Reigh being as rigid as they were, it was likely he’d bail first. Deirdre arched her eyebrows. “Very few women within the Empire do all things, Lord Nagrad. I cannot confirm what I may or may not do without knowing what you have in mind. Would you be more specific?”</p><p>She smiled and waited for him to back off.</p><p>“Would you suck my cock?” he asked.</p><p>She stared at him for a long moment, trying to make sure she didn’t mishear. Behind her someone made a strangled noise.</p><p>The Reigh Lord waited for her answer. His face was perfectly solemn.</p><p>“Well.” She cleared her throat, desperately hoping she didn’t blush. “I suppose that could be hrhm arranged under certain circumstances. Is there any other requests you would like to make?”</p><p>He raised his hand. One of the shadows detached itself from the gloom and brought a platter with a thin pseudo-paper magazine. She hadn’t seen pseudo-paper since her days at Altair museums during her graduate on the Colonial Journalism.</p> <p>Nagrad took the magazine off the platter and put it on the table. The digital photograph on the cover left no doubt as to what kind of a publication it was. He flipped the pages and pushed the magazine toward her. “Would you do this?”</p><p>“Yes.”</p><p>He flipped another page. “This one?”</p><p>“Possibly.”</p><p>“This one?”</p><p>She felt the blush creeping onto her cheeks. “Yes.”</p><p>“What about this one?”</p><p>She squinted, trying to make sense of the naked shapes. “Is that even possible? Wouldn’t you have to have low G for this?”</p><p>“Or a very strong woman.”</p><p>“I’m not sure I’m that strong.”</p><p>“I suppose we could arrange a shuttle trip than,” he offered.</p><p>“No, thank you. Thirty billion is an outrageously large sum.”</p><p>“You think so? Considering the scale of the injury, I believe it’s just right.” He flipped the page. “How about this one?”</p><p>Chapter 5</p><p>Robert’s face was incredulous. “You didn’t drop him at all? Not even by half a bil? Oh Hermes, a child could’ve done better.”</p><p>Deirdre threw the recorder onto the table. Nagrad’s face, frozen on the screen, mocked her with grey eyes. “What do you want from me, Robert? Every time I tried to bring up the money, he would show me more porn. The man asked me if I would suck his cock! How do you counter that?”</p><p>A soft voice interrupted, “By saying, ‘That would depend on the size of your instrument, my lord. Would you care to take off your pants so I can determine if it would be a good fit?’”</p><p>Robert bent in a half, “My lord.”</p><p>She turned to see an older man in soft green tunic. He gave her a light smile, as if he was too polite to laugh at his own off-color joke.</p><p>“Holy crap, the Duke of Rodkil.” Fatima’s heels clicked together.</p><p>Deirdre bowed. The living legend placed his hand onto her shoulder. Imposing on the portraits, in person he appeared rather slight, short with narrow, bird-boned frame. “No need to bend your back, my dear. I understand Robert called me as soon as he knew, but despite all of our progress, there are times when the interstellar travel isn’t quite fast enough.” He nodded at Nagrad on the screen. “A very shrewd man. Let’s see if we can cut him down a bit, shall we? I’ll need all of the background you have.”</p><p>Chapter 6</p><p>Deirdre shrugged the interface off her hands and leaned back against the seat. Her head throbbed. The ancient diplomat was still speed-reading, submerged in the interface up to his elbow.</p><p>“What’s the significance of kneeling? Submission?”</p><p>She rubbed her temples. “Not exactly, Your Grace.”</p><p>“Jason,” he corrected.</p><p>“Jason,” she repeated, trying to ignore the absurdity of referring to a recipient of the Diamond Sword by his first name. “The Reigh don’t submit. Not even in battle–when they surrender, they raise their hands to the sides, daring a thrust to the stomach. The kneeling It’s more a gesture of ultimate respect. A Reigh kneels only before his Lord and only once, at the acceptance into service. A Reigh Lord kneels before no one.”</p><p>“A quaint culture. So many references to the vegetative symbolism.”</p><p>“Yes.”</p><p>The Duke Jason glanced at her. “You should sleep, my dear. You look exhausted. He’s likely to call for another meeting tomorrow.”</p><p>She sighed. “Why? I couldn’t haggle him down. He’d be smart to avoid us so he can hold on to the original sum.”</p><p>“But he knows you don’t control the proverbial purse strings. He’s perfectly aware the real fight is ahead and he doesn’t want to give us enough time to regroup.”</p><p>She sighed. “He caught me off-guard. I expected coldness, some sort of brutal physical test, perhaps a ritual where I’d have to untangle tree branches without breaking the leaves or untie an impossible knot. I didn’t expect dirty pictures. It goes against everything I know about them. It makes me question my assumptions.”</p><p>Jason shook his head. “What I’ve seen so far is both thorough and well documented. Your conclusions are logical and, I wager, quite accurate. Robert is very lucky to have you, and he knows it, otherwise he wouldn’t have called me.” The Duke chuckled. “Quite a hit to his pride, to have to call your former mentor out of retirement. But back to the Reigh, don’t doubt the entire body of your research on the basis of Lord Nagrad. In diplomacy, like in great many other things, the rules of engagement survive only until one remarkable person decides to break them. It’s just our luck we stumbled across such a person.”</p><p>“That, and the fact that I’m a lousy diplomat.”</p><p>“To each his own. You’re an excellent analyst. Not everyone is born with the gift of snappy comeback. But you should rest. And don’t worry, we may yet get you out of this mess.”</p><p>Chapter 7</p><p>This time the meeting fell onto afternoon, and the sunlight filled the room. Nagrad waited in precisely the same position Deirdre had seen him the first time.</p><p>“Greetings, Lady Deirdre. And Your Grace.”</p><p>Jason smiled. “I wasn’t aware I’m well know to the Reigh.”</p><p>“You are,” Nagrad assured him.</p><p>“Very well, Lord Nagrad.” Jason rubbed his hands together. “In that case shall we dispense with preliminary niceties? Let’s talk money.”</p><p>“Indeed.”</p><p>They launched into the foray like two warriors, amidst clashing blades and thudding shields. By the second hour Deirdre lost the thread of the argument. By the fourth she caught herself dousing off.</p><p>Nagrad’s voice snapped her from her reverie. “I do believe the lady is tired. Let us take a break.” He offered her his hand. “Would my lady care for some fresh air?”</p><p>To say no would’ve been an insult. She put her hand in his and let him lead her out to the balcony. Big enough for a decent size party, the semicircular balcony extended out good twenty five meters. Nagrad maneuvered all the way to its farthest point and stopped at an ornate amber and white rail. The keep protruded from the side of the mountain and as she looked down below to where the forest shimmered awash with green leaves, a curious feeling of peace filled Deirdre. Bright blue and red birds flittered from branch to branch. Somewhere a distant relative of the Vunta howled once. She inhaled the air. It tasted sweet.</p><p>“Beautiful,” she murmured. “I forgot how lovely the planetside can be.”</p><p>“It’s home,” he said simply, putting the world into a single word.</p><p>Deirdre leaned on the rail. “Why me?”</p><p>“Because you’re attractive,” he said. “And I greatly admire your body.”</p><p>She blushed.</p><p>“Of work,” he added and offered her his reader. A list of recent publications lit the screen. The top one. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This hasn’t been publicized. It’s classified information.” She took the reader and tapped the top title with the stylus. Here it was, the entire contents of her Reigh research. “How did you get this?”</p><p>“It was brought to my attention by a party concerned that we may have a loose mouth in our midst.”</p><p>“You tapped the Embassy’s network.” She stared at him stunned. Lao-Tzu, what else he could have access to?</p> <p>“It wasn’t that difficult actually.” He shrugged. “I can’t afford informants in my branch, no more than you can tolerate the blame for my father’s death.”</p><p>“I had no informants.” She handed the reader back to him.</p><p>“I realized that once I’ve read through your analysis. To have deduced that much from external indicators is remarkable.”</p><p>The extent of his arrogance was even more remarkable. Deirdre looked at him. “Then perhaps you would enjoy another deduction.” She slid the square of a reader card from her data bracelet and snapped it into the reader. The recording of a peace meeting from three decades ago filled the screen. “This is the Survey Captain Sean Kozlov. And this, I believe, is your father. They are performing a peace ritual–they have fished together and now they are sharing their catch.” She tapped the screen, forcing it to zoom. “They are eating redfish. And redfish caviar.”</p><p>Nagrad watched the screen. The impassive mask slipped and in his face she saw profound sadness.</p> <p>“Your father wasn’t allergic to caviar,” she said.</p><p>“My father was born without immunity to black moss.” Nagrad kept his gaze on the reader. “A genetic failure, a mutation that for some reason wasn’t detected. He had survived for sixty four years without contracting the infection. We didn’t realize he was sick until he began coughing black dust. Very rare in these times, unfortunately, it still happens.”</p><p>The black moss was incurable. Two month incubation period and then a soft death, as the victim fell asleep to never awaken. Instead of passing on in his bed, the Reigh Lord died in agony amidst strangers. “He took his own life.”</p><p>Nagrad leaned back. “He felt his death must serve the Branch. The only difficulty lay in finding the poison that would imitate an allergic reaction to redfish. The death didn’t happen as quickly as we had hoped.”</p><p>The realization struck her. “You were there,” she said. “Were you the one who took the veled off my hand?”</p><p>He closed his eyes for a briefest of moments. “Yes.”</p> <p>“You stood there and you watched your father die.”</p><p>“He was my Lord. I honored his wishes.”</p><p>“He died to give you an excuse to take a bribe from the Empire.”</p><p>Nagrad’s face gained a dangerous edge. “Yes. And the Branch desperately needs the money. And you may be assured, my Lady, that I will do everything in my power to squeeze every last unit I can from your realm. To do any less would be to dishonor his death.”</p><p>He took the card from the reader and offered it to her, but she closed his fist about it. “It belongs to you.”</p><p>Before he could say anything else, she shook her head. “I understand, Lord Nagrad. I truly do.”</p><p>“I suppose you despise me.”</p><p>“No. I admire you.” She walked away so he wouldn’t see her face.</p> <p>Chapter 8</p><p>The evening brought a cup of fragrant tea and a knock on Deirdre’s door. “Come in,” she yelled, wishing with all her being the visitor would go away. Nina Carrest entered the room. Dressed into a soft robe that looked like it had been slept in, her hair pulled back from her face in a hastily made pony tail, Nina looked radiantly beautiful.</p><p>It was simply not fair that a woman should do absolutely nothing and look this good.</p><p>“I’m not sure why I’m here.” Nina shifted uncomfortably.</p><p>“Please come in.”</p><p>They sat on the soft circular couch and drank tea together. “I feel responsible.” Nina rubbed her left temple. “I don’t want you to think that I came here because I feel guilty and I want you to tell me it will be fine and it’s not my fault. I just it should’ve been me.”</p><p>“It would’ve been me anyway.” Deirdre sat her teacup back onto the table. “The Reigh had hacked the Orbital’s database. I’m apparently the only one who didn’t know this. Robert fed them my research on purpose. Lord Nagrad very much wanted to meet me. He would’ve found an occasion to do so, one way or the other.”</p><p>“Still, I fed his father that appetizer.”</p><p>Deirdre offered her a smile. “I wouldn’t worry about that. The old Lord Nagrad didn’t die from an allergic attack. He was terminally ill and had taken poison so his son would have pretext to ask the Empire for the monetary compensation. His son was right there among the guards. He watched him die.”</p><p>Nina paled. “That’s monstrously cold bloodied.”</p><p>Deirdre sighed. Some things were harder to explain than others. She pulled her portable to her. A small part of her rebelled against interfacing this late. She had wanted the evening to last, to drink her tea, and enjoy the few minutes of comfort, to work on herself by being still. But the need to explain nagged her into dipping her hand into the liquid metal. She watched it creep up to mid-palm no need for more and waited until the sensation of stretching subsided enough to speak.</p><p>“The first colonists to have settled on some of the Reigh worlds pre-Second Empire were the Sureks. The word ‘lahiko’, the Reigh’s substitution for “clan”, is thought to have been a corruption of Surek Luh-iko, meaning literally ‘branch.’ However, if you ask a Reigh to pronounce it, he will say, ‘Lehgio.’ An almost perfectly preserved, true Latin pronunciation of legion.”</p><p>Deirdre played with the interface and it projected a small map of the Reigh territory. “During the Melasyan conflict, a large part of Melasyus’s army broke off, upset by his failure to secure peace. At this point they had been unpaid for over five standard years. They hadn’t seen their families. Most of them didn’t have families since the Planars had wiped planet after planet with their toxins. They’d had enough and they took their ships and left. Seven legions.”</p><p>She highlighted the home worlds of the seven branches of the Reigh one by one. “They were hardened veterans, disciplined, supreme warriors, whom Melasyus strove to make into ‘New Romans’. All they wanted was peace.”</p><p>Nina’s gaze was fixed on the map. She refilled their cups without looking.</p><p>“They came here?”</p><p>“I think so. There are more factors in play here than just a single word. For example, these branches on Nagrad’s standard. If we take off the leaves” she called up a standard and swiped the abundance of stylized leaves from the branches.” and we have the Roman numeral XXVI. The twenty-fourth legion. And so on. My theory is that the legionnaires put as much distance as they could between themselves and Melasyus’ ambitions and settled here, mixing with native Surek population. Thirty years ago they were found. Only eight generations since they had left. They are paranoid, extremely martially proficient, and ruled by a doctrine of personal discipline and distrust of outsiders.”</p><p>“I see.”</p><p>“The legionnaires had stripped several worlds before they perpetrated their escape. Their descendants stretched those supplies for a long time,” Deirdre continued. “But they lacked the expertise to really build an industrial base. I’ve pulled the logs of their known purchases and ran a projection analysis. They are adept at keeping the fleet and armaments going, but they are rapidly depleting their supplies. Chances are they don’t have access to tech developed in the last two hundred years. Also the fact that Lord Nagrad hadn’t undergone a genetic screening leads me to believe they’re running out of medical equipment. They need vaccines. They need production facilities. They need new tech, but they don’t have an overabundance of natural resources nor do they have access to some unique goods. They can’t make their money in trade. In fact, the only resource they can export is themselves they are superior warriors. Unfortunately their doctrine forbids them to do exactly that. They must fight for a cause. If this continues...”</p><p>“They will be overrun by the Vunta,” Nina said.</p><p>Deirdre nodded and shrugged the interface from her hand. “They must find a way to obtain financial resources without breaking the foundation of their society. Or they must give up being who they are. Lord Nagrad came up with a short-term fix. I believe his solution cost his son a great deal of pain.”</p><p>Nina looked at her. “Tell me about him.”</p><p>Deirdre thought about it. “Very smart. He has very light eyes, grey with a little bit of green. He’s tall. He bends slightly toward you when he speaks. He has large hands and almost never gesticulates. When you speak to him, you get a sense that if he hates you, he’d kill you in a second, but if he likes you, he would do all he could to keep you from harm. It’s a curious feeling.”</p><p>Nina was smiling.</p><p>“Did I say something funny?”</p><p>“Not at all. Will you really marry him?”</p><p>That was a question she had successfully avoided asking herself for two days now. “I don’t see how I have any choice in the matter. If I didn’t have to marry him, I would’ve requested an extension anyway. The research material I had compiled here is my best work. I want to know more about them. Looks like I’ll get to, just not in a way I had planned.”</p><p>The comscreen behind her erupted in a series of beeps and almost immediately somebody hammered on her door. She ordered it open, and Robert burst into the room.</p><p>“Get dressed! The Vunta overbid us!’ “What?”</p><p>“The Vunta just offered Nagrad the thirty billion he wanted in a Brotherhood Pact. He gets exclusive rights to raiding on the fourth world of the Colchida Cluster. We must bid higher, but I have to get approval before I can commit. It will take the com launch at least twenty eight standard hours to reach us with the answer. We must stall until the Treasury approves the expense. We have eight hours until the sun rises to come up with a plan.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Deirdre crossed her arms on her chest. “What do you mean stall?”</p><p>“He’ll want this matter concluded now, before the Vunta back off, but he can’t just back out of the marriage, so he’ll demand a higher amount and when we fail to deliver, he will claim to be gravely insulted.”</p><p>“She could pretend to be sick,” Nina said.</p> <p>“No, then he’ll claim we’re insulting him by withholding her. It has to be something else, something he can’t weasel out of.”</p><p>An idea snapped together. So simple and so ironic. Deirdre smiled. “Robert?”</p><p>“What?”</p><p>“How much smut do we have in our databanks?”</p><p>Chapter 9</p> <p>“I feel dirty.” Fatima laid her head back. “I don’t think I can take anymore.”</p><p>“Found another one,” Michel Rashvili announced. “The man on the back, legs bent, the woman holds his hands on the sides and squats onto his...”</p><p>“The amazon,” Deirdre and Nina said at the same time.</p><p>“Did that one,” Robert said.</p><p>“I thought the amazon was the one in a chair.” Michel yawned.</p><p>“No, that’s side-saddle.” Nina yawned too.</p> <p>“Has anyone actually done the amazon? I mean like in real life?” Michel wondered.</p><p>“I have.” Duke of Rodkil yawned. “It’s overrated.”</p><p>Deirdre blinked her eyes, trying to stay awake. Whatever embarrassment she had possessed had fled hours ago.</p><p>Robert surveyed the room strewn in pornography sheets and sex toys. “It looks like we had an orgy.” He stifled a yawn, gave up and yawned. “Now look what you’re started, Rashvili. Don’t you know yawning is contagious? We all need a nap.”</p><p>Nina put her head down and snored.</p><p>“Highly appropriate post-orgy, I would say,” His Grace murmured.</p><p>The comscreen flared and the face of the chief of security came into the view. Nina jerked awake.</p><p>“We have contact with the Reigh. They want the bride and they want her now.” Timur squinted. “What exactly have you all been doing?”</p> <p>Chapter 10</p><p>The booster shot coursed through Deirdre’s veins, spreading a slightly cool sensation all the way from her toes to her scalp. She felt light as a feather. Twelve hour from now she would pay the price by passing out, but for now she felt fantastic.</p><p>The elation evaporated when she entered the meeting room. The Reigh guard had been doubled. Nagrad’s face promised a storm.</p><p>“Are you prepared to accept my terms?”</p><p>The question wasn’t aimed at her, but the harsh tone lanced her anyway.</p><p>“Of course, Lord Nagrad,” Jason smoothly said.</p><p>“Thirty billion?” The disbelief was plain on Nagrad’s face.</p><p>“Indeed. However, before the moneys and the lady can exchange hands, there is a small matter that requires your attention. A mere formality.”</p><p>“What matter?”</p><p>The Duke smiled. “In accordance with the formal union contract, the bride requests a full accounting of her duties.”</p><p>“I’ve delivered the full accounting during our first meeting.”</p><p>Not even a single glance in her direction. I am just an animal to be sold and bought.</p><p>“Yes, but the accounting states, and I quote, ‘...and to not shun the husband’s request in the bedroom, lest she sabotage the begetting of an heir.’ This fails to specify the exact nature of your attentions.”</p><p>“This was also covered in our first meeting.”</p><p>“But my lord,” she said, keeping her voice as sweet as she could. “That was but a very small part. The subject must be explored fully before I commit to you. I have a right to know what is required of me.”</p><p>“We’ve taken the liberty of preparing a short list of all ‘duties’ known to the bride.” With elegance of a dancer, Jason slid the reader card onto the table. “All that remains is for us to examine each entry and to determine whether or not it will enter into accounting. Should you require anything beyond what is detailed here, we will do our best to incorporate it into our list.”</p><p>Nagrad slid the card into his reader. It took him a good minute to scroll to the end of the list. His eyes blazed. “How many entries are here?”</p><p>“Five hundred and forty five.” The Duke’s voice couldn’t have been sweeter.</p><p>“I request all of them,” Nagrad said.</p><p>“In accordance to entry two hundred and three, will you then submit to having a cast of your anal canal so the dildo employed to penetrate your anus can be made to perfect proportions?”</p><p>The Reigh bodyguards froze.</p><p>Nagrad read the entry. “I won’t be requesting that one.”</p><p>Deirdre leaned forward. “With all due respect, my lord, I insist you review each one to avoid such misunderstandings.”</p><p>He finally turned to her. “I refuse to submit to this idiocy. The list could take days to review.”</p><p>“It’s my right under the law. You must review the list with the witnesses present. You have made an offer of a formal commitment. It cannot be withdrawn lightly.”</p><p>She could almost hear him grinding his teeth. “You are not a Reigh. You have no rights.”</p><p>“Yes, I do. You gave them to me when you delivered the statement of full accounting of my duties and requested a dowry. You have followed the law up to this point as if I was a Reigh bride. Does the doctrine exist only until it suits you, my Lord?”</p><p>For a moment she thought he’d reach across the table and strangle her. Instead he sat back. His face relaxed it must’ve taken a monumental effort of will on his part and the Reigh lord picked up the reader. “Very well. The first section is titled ‘Terms and Devices’. I believe we can skip that one.”</p><p>“Would my lord care to define the term anal plug?” Deirdre asked. “How about the difference between the soft and a hard one?”</p><p>If his eyes could shoot lightning, she would’ve been fried on the spot.</p><p>“Very well then.” His Grace announced with a placating smile. “Term number one: penis. Also known as dick, cock, Johnson, lance, sword, thruster, little soldier.”</p><p>Deirdre leaned toward. “You may want to call for some refreshments, my lord. It will be a very long day.”</p><p>Four hours later Nagrad tossed his reader onto the table. “I need some fresh air.”</p><p>He strode onto the balcony. Deirdre rose, stretching, and went outside also.</p><p>The second she stepped out of the room, Nagrad took her by the elbow. “Come with me, my Lady.”</p><p>His touch on her arm was very light, yet she knew with absolute certainty she couldn’t get away. He led her to the farthest point of the balcony out of the ear shot of the bodyguards within the room. “It’s you,” he said. “I know it’s you. You came up with this farce.”</p><p>“What gives you that idea?”</p><p>“You were gloating in every second of it. Why are you doing this?”</p><p>“I simply want to know what’s required of me.”</p><p>He turned away from her, plainly trying to keep control of himself. “This matter could be settled later. It’s of no consequence.”</p><p>“It’s of a great consequence to me. You opened the door, all I had to do was walk through it.”</p><p>“I opened the door?” he snarled.</p><p>“Temper, temper, my Lord. I’m sure your guards would rush to my rescue if you were to choke me. Patience is a virtue.”</p><p>He stared at her. “God preserve the man who makes an enemy of you.” He turned on his heel and stalked off.</p><p>Deirdre sighed and went back to the room. As she slumped into her chair, His Grace leaned to her. “How did it go?”</p><p>“My future husband hates me with a passion of a thousand stars,” she said.</p><p>The Duke gently patted her hand. “We’ll get through this.”</p><p>“That’s what I’m afraid of.”</p><p>Chapter 11</p><p>“Entry number three hundred and twelve: Multiple partners.” The Duke droned on.</p><p>Deirdre put her head onto her hands. Post-booster cooldown required at least twelve hours of sleep. She barely got eight before the Reigh demanded her presence. Her head hurt. Her ears were filled with something soft and mushy. Across the table Nagrad looked exhausted. The two Reigh witnesses, picked by him from the bodyguard, didn’t look much better.</p><p>“Subsection A. Two male partners and one female partner.”</p><p>“Pass,” Nagrad called. There were deep bags under his eyes.</p><p>“Let it be known that Lord Nagrad abandons all claim to the act described in entry number three hundred and twelve, subsection A and all the subsequent positions described or listed under subsection A.”</p><p>“So noted,” the witnesses intoned.</p><p>Everyone made the appropriate notations in their copy of the list.</p><p>“Subsection B: Two female partners and one male partner.” The Duke waited for a moment, but Nagrad appeared absorbed in his reader.</p><p>“Position one: the male partner assumes horizontal position with his back to the surface. The first female partner kneels.”</p><p>Deirdre rolled her eyes. Just pass now, you know you can’t take it in front of the witnesses. Nagrad listened to the description with the look of somber concentration. “Pass,” he said finally.</p><p>“Let it be known that Lord Nagrad abandons all claim to the act described in entry number three hundred and twelve, subsection A, position one.”</p><p>Deirdre stuck her tongue out at him.</p><p>Nagrad mouthed, “After we’re married.”</p><p>“So noted,” the witnesses mumbled.</p><p>“Position number two: the first female partner clasps the male partner’s.”</p><p>The Duke’s comlink beeped. “Excuse me. It appears I have an urgent call.” He strode away onto the balcony.</p><p>Deirdre put her head onto the table with a soft bump. Marry me off, I don’t care. I just want some sleep.</p><p>She heard the Duke’s footsteps. They stopped next to her. “Thirty five billion,” he said softly. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She raised her head. Nagrad sat very still.</p><p>“That’s an extraordinary offer.” A slow kind smile softened the Duke’s face. “You won’t get a better one.”</p><p>“Done,” Nagrad breathed.</p> <p>There. The odd look on his face, relief mixed with surprise, brought out her own smile. We did it, she thought. We saved the cluster and we saved you and your people. She watched the beginning of a smile curl his lips. In this moment of joy, he seemed almost vulnerable.</p><p>“Thirty six billion, if you abandon your claim to Deirdre,” the Duke said.</p><p>Cold washed over her. That’s it. It’s over. I will never see him again.</p><p>“No,” Nagrad said.</p><p>“We both know it was never about the girl. Let her go.”</p> <p>Nagrad’s face snapped back into an impenetrable mask. “She stays or the deal is off.”</p><p>The Duke drew himself to his full height, suddenly regal and terrifying. “Ask yourself, would you truly force yourself on this woman?”</p><p>Nagrad looked at her. “Do you want out?”</p><p>“She has a brilliant career ahead of her,” the Duke said. “Don’t stand in her way.”</p><p>Nagrad took her hand and swept her off the chair. “A minute of your time, my Lady.” He pushed past the Duke and drew her outside.</p><p>I’m so sick of running onto this balcony, a thought flashed through her head.</p> <p>Nagrad ran his hand through his hair. “I’m past my undergrowth years.”</p><p>“I’m sorry?”</p><p>“I’m not an adolescent anymore. What I mean to say is, women no longer unsettle me.” He held up his hands, seemingly lost or words. “This is harder than I thought.”</p><p>He looked so lost that she laughed softly. “Did I unsettle you?”</p><p>“Yes,” he said, relieved. “I... miss you when you’re away. I think of you. I don’t want you to leave.”</p><p>“You were ready to trade me in for the Vunta billions.”</p><p>“Yes,” he admitted. “I would’ve done whatever was best for the Branch. What would you have done in my place?”</p><p>Deirdre looked at the forest beyond the balcony. “In your place I would’ve auctioned myself off if I thought I’d get more than one bid.”</p> <p>The Duke and the bodyguards were watching them.</p><p>“I wish I knew what to say,” Nagrad said. “But if you give me a chance, I think I would come to love you very much. Marry me and I promise you I’ll be as loyal to you as my father was to me. I’ll do everything I can to make you happy.”</p><p>The way he looked at her made Deirdre’s heart flutter.</p><p>He took a deep breath and glanced at the audience waiting in the room. “They will only see it once.”</p><p>Slowly, deliberately he knelt before her. “Stay,” he said. “Please.”</p><p>“Well that won’t do,” she murmured. “The Reigh Lord doesn’t kneel before anyone.” She knelt next to him. “That’s better.”</p><p>“Is that a yes?”</p><p>She brushed his lips with hers and he kissed her, her mouth eager and warm. “It’s a yes,” she murmured when they came up for air. “On one condition. You have to tell me your name, because I am not moaning ‘lord Nagrad’ on our wedding night.”</p><p>END </p> </body></html>"]