["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>April Billingsworth blinked up at the ceiling, deliberating the best way to slip out of bed. And his embrace. She tried sliding out from under his arm, but he tightened his grip, mumbling something in his sleep as he threw a heavy thigh over her legs.</p><p>She sighed. So much for that idea.</p><p>Rubbing her feet together, she glanced down and edged a foot out from under the covers. One hot pink high heel shone in the morning sun.</p> <p>“Leave on the shoes, babe,” he had ordered.</p><p>Her dress slipped to the floor, but the shoes stayed on. “Don’t call me ‘babe’,” she snapped, then went willingly into his arms.</p><p>“It’s a glorious morning,” Finn said, his hand coasting down her side to cup one of her butt cheeks. “Damn fine morning.” He gave a little squeeze. “Of course you’re frowning.”</p><p>Turning her attention to the sexy Irishman who’d slept fully nude beside her, she allowed a smile to curve the corners of her mouth. She was really happy, ecstatic even, because he was in such a good mood. Although, it seemed Finn was always in a good mood.</p><p>In any case she had really big, scary news and wasn’t sure how to tell him, but starting the day with him smiling was a good thing.</p> <p>“Now that’s something you don’t see every day,” he said, kissing her nose. “I’ll have to spring for a hotel room more often.”</p><p>“I’ll take you as my date to one of my sorority sister’s wedding in June. It’s going to be on Jekyll Island, down in Georgia, so overnight accommodations are a must,” she said and his smile disappeared. Oh, crap. She wanted to die for being so careless with her words. Still she maintained her smile. No matter what, her flipping smile would stay. It always had. One didn’t have a father in politics and not learn something.</p><p>He rose above her, all lickable broad shoulders and tight abs while his sexy blue eyes studied her face. “That’s sounds quite serious, Miss Billingsworth. You sure about that?”</p><p>A couple of minutes ago, heck even a day ago, she would have said yes, she was totally serious about him. But now, with his serious expression and lack of smile, she had to say, “What’s there to be sure about? I thought that since I’d most likely be bored, you could ride along and keep me...amused.”</p><p>Brows rising, he tilted his head to one side. “Did you now?” Before she could answer, his phone rang and he groaned. “Mind if I take this, babe?”</p><p>A sarcastic reply almost broke free of her lips, but she tampered it down. Don’t screw this up, she reminded herself. “Go ahead, but stop with the ‘babe’, I hate it.” Actually she loved it, but most of her girlfriends would think it was demeaning and sexist.</p> <p>She didn’t give a damn, but Finn didn’t need to know that.</p><p>“You’re a corker, April. A real corker,” he said, kissing her softly on the lips. Grabbing the phone and sliding out of bed, he walked away, speaking softly, and her stomach did a little flip at the sight of his fine butt and hard thighs.</p><p>“I’ll be waiting,” she called out in a sing-songy voice. Something the old April would have never done, but she was tired of being her.</p><p>Finn paused and turned, his eyes widening a little. That sexy mouth of his kicked up at the corners and he winked. Then he slipped inside the bathroom and shut the door behind him.</p><p>She sat up in bed, pulling the covers up and over her breasts, then tucked the sheets under her arms. Sunlight poured into their room now and she grinned like a Cheshire cat. After years of falling for the wrong guy, then falling for what on paper should have been the right one, she was in love with the “one”. Totally, completely in love.</p><p>Finn had been the rebound guy, but not anymore. He had become more than one night stand turned twice a week date and had morphed into serious boyfriend. Unlike the relationship with her ex-fiancé, she and Finn weren’t toxic for each other. She didn’t feel a need to make Finn jealous or lie to him just so she’d know that she was number one.</p><p>With Finn, she was number one and he didn’t keep things from her. He was a good guy, a cop or bounty hunter or something like that. She never could keep it straight, because he didn’t like to talk about work. He wanted to know about her: What she liked and what she didn’t.</p><p>Not that her ex hadn’t been a good guy, he had been and still was one. When she’d broken up with him, it had truly been an ‘it’s not you, it’s me’ moment. She had been scared to death of getting married, of settling down and becoming another family pimped out to voters for her daddy’s campaigns.</p> <p>Worse, she had been scared to death of turning out like her mother. Oh who was she kidding—she still was terrified.</p><p>Taking a deep breath, she closed her eyes and began to rehearse what she’d say in her head. Finn, I know we’ve only been together for four months, but—</p><p>The door to the bathroom banged open. “Get dressed.” He picked up her clothes and threw them at her, then began to tug on his own. His movements were angry and hurried while she sat there frozen. “Dammit, woman. Get. Up.”</p><p>April blinked at him. She’d never seen Finn like this. “But...I—”</p><p>“Look, there’s something I’ve been meaning to tell you, babe—”</p><p>“You’re married,” she shrieked, her heart plummeting to her toes.</p><p>“God, no.” He made a face. “I’m completely single.”</p><p>Okay, so not married, but did he have to sound so opposed to it? “You’re not really twenty-nine?”</p><p>“Have you been drinking this morning?”</p><p>“No.” Then it hit her and she wanted to cry at the injustice. “You’re gay, but you’ve been told it’s wrong and that if you just sleep with a woman like a “real” man then you’d be cured. Don’t listen to those people. Be yourself!”</p><p>“Seriously?”</p><p>“There wouldn’t be any shame in it if you were.” But she would be heartbroken. Oh, good grief, gay men didn’t sleep with women.</p><p>He rolled his eyes. “My brother’s gay.”</p><p>“You never told me that.” She narrowed her eyes. “Is it because you’re ashamed of him?”</p><p>His head fell back and he pinched the bridge of his nose. “I was his best man, at his wedding. And I’m a godparent to his daughter. He adopted her, with his partner, who’s a man, in case you’re still assuming things about me.”</p><p>She winced. “Sorry.”</p><p>“You’re a strange woman sometimes, with strange ideas, but you’re forgiven. Now back to the subject at hand.” He placed a knee on the bed, looking around the room before fixing his blue eyes on her. “I should have told you sooner. And I want you to know that what we have means something to me. It’s real. Me and you are real. Together. We’re good together and—”</p><p>She felt herself go all soft at his nonsensical speech. This was too perfect. He could admit his feelings and then she could tell him. “Are you trying to say that you’re in love with me?”</p><p>“No!”</p><p>She jerked back as if he’d slapped her. “Oh.”</p><p>He held up his hand. “What I mean is that I’m not sure. I could be. Maybe? I know I like you and the sex...” He let out a whistle and gave her a wicked grin.</p><p>“I’m exceptional at sex,” she said with a confident smile. “And flexible. Oh, and willing to try things.”</p><p>His mouth flattened. “I would agree, only I feel so bloody jealous that—”</p><p>Someone pounded on the door to their hotel room.</p><p>“Who in the world would be—”</p><p>“Open up,” a man called out, sounding vaguely familiar to April.</p><p>Finn muttered a curse, then raised his voice and said, “You remember what I told you, yeah?” Without waiting for an answer, he strode to the door and yanked it open.</p><p>The governor’s security team walked in, followed by their boss, her father, the current governor of North Carolina. She stifled a scream and schooled her face. “Can I help you?” This was more than a little humiliating.</p><p>“Sweetheart,” Chad Billingsworth began, his blue eyes, so like hers, sad. “I’m afraid you’ve been misled into believing—”</p><p>“That I’m an adult, and don’t need my daddy and his men to check up on me?” she asked sweetly and flicked her eyes to Finn. She wanted to mouth an ‘I’m sorry’, but that would show weakness to her father, and a Billingsworth never showed any weakness.</p><p>Finn stood to the side, pants on and shirt off. “Sir, I’m sorry you had to find out like this.”</p><p>Her father’s gaze snapped to Finn. “I’ll deal with you later.</p><p>“You two know each other?”</p><p>Chad didn’t take his eyes off of Finn. “He works for me. Or rather he did work for me.”</p><p>“It’s not what you think, sir,” Finn said, pulling on his shirt and strapping on his gun holster. Something that had never failed to give her a little thrill. “Your daughter and I—”</p><p>“That’s right. My daughter. Someone you were paid to protect and keep tabs on, not screw in some seedy motel,” her dad snapped.</p><p>“The Rise is three hundred a night,” Finn shot back, but she noticed he didn’t deny or correct anything else Chad had said.</p><p>Her vision suddenly got fuzzy, black spots and white lights dancing in front of her eyes. “You work for him?” Her voice sounded strange, whispery light. Nausea rose, the first of its kind since she’d discovered her little predicament.</p><p>“You look a little pale.” Finn crossed the room, sitting beside her on the bed, where she was nude and still only had on one shoe. A less confident woman would have collapsed in tears.</p><p>She would not cry. She never cried. “Get. Away. From. Me.”</p><p>Blowing out a breath, Finn stood and took a step back. “Don’t do this, April.”</p><p>She stared straight ahead, her shoulder rigid and a little haughty look on her face. How she could manage to look so in control while wearing nothing but the bed sheets was one of the things he admired about her. Mostly because when she allowed him to take control, she surrendered so completely that it humbled him.</p><p>“Don’t do what, Mr. Burke?” she asked, in her drop-dead-asshole voice.</p><p>Dammit. He wanted to slam his head against the nearest wall. Repeatedly. He’d screwed up, plain and simple. He should have told April before they’d fallen into bed together. Although, he conceded, she had had her way with him on the rug in front of her fireplace, not a bed.</p><p>Still... “Remember what we talked about earlier?” he asked, clenching his jaw. He did not need an audience for this. “That what we have is real and...” Raking a hand through his hair, he let his words trail away and adjusted his stance. If only he could have had five more minutes alone with her. Sure, she would have been mad as hell, but at least he would have been the one doing the telling. “April, please.”</p><p>Finally, finally she looked at him. He would have preferred she hadn’t. Her eyes were beautifully blue and blank. Completely and utterly blank. Emotionless. “Your services are no longer needed, Mr. Burke.”</p><p>Chad raised his brows. “I’ll be sending your employer a detailed report of this incident today.”</p><p>Finn shook his head. The son of bitch still didn’t know. “I’m sure you will.”</p><p>“Time to go, buddy.” One of the men on the governor’s security team grabbed his arm.</p><p>With a simple sidestep and twist, he freed himself. “Not your buddy.” He gave April one last, lingering look, but she’d turned her attention to the window. He’d been dismissed. His gut clenched. “I know the way out.”</p><p>The governor and his security team watched as he gathered his things and pulled on his boots. A bright pink shoe lay haphazardly in the floor near the dresser. The urge to take that shoe, just so she had to come to him and get it, rode him hard. But the problem with dating a woman like April, rich and independent, was that she wouldn’t bother. She’d just buy another pair. Or three hundred.</p><p>Finn sliced his gaze to April, wishing like hell he could take her in his arms. Instead he walked out the door.</p><p>Chapter Two</p><p>Finn sat in his favorite pub, in his favorite spot, drinking his favorite pint, but it tasted like shite to him.</p><p>A month had passed, with it Christmas and New Year’s, since he’d last seen April. He’d gone to her house on Kingston, but no one answered. He’d gone to her usual hangouts: clubs where the trendy and wealthy merged together into one writhing mass of hot bodies. He’d gone to her not-so-well-known hangouts, like the assisted-living community center on Oak and the food pantry at Grace Church on Aspen.</p><p>Maybe he’d gone on the wrong days, or maybe she’d changed her schedule so that he was running around in circles. He toasted his reflection. “Deserve every bit.”</p><p>“Jesus H., dude, are those tears?” Hunter asked as he sat down on the barstool beside Finn. He motioned for the bartender to bring him his usual.</p><p>Finn took a deep drink of his ale and slammed it down on the bar. “Shove off, mate.”</p><p>“Nah, think I’ll stay right here,” Hunter said with a smirk. “Some perps gave me shit today, so you’re the winner of who’s-gonna-listen-to-me-bitch.”</p><p>“Lucky me,” Finn mumbled, then grabbed a handful of peanuts. “Why don’t you come work for Kennedy Investigations?”</p><p>Hunter shook his head. “Hell, no. Word on the street is that the owner is a real pu—”</p><p>Finn made a face at his friend. “Shut it.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“This girl’s got you all tied up, and not in a Fifty Shades kinda way either.” Hunter popped a handful of peanuts in his mouth. “I say it’s time to move on.”</p><p>“While I say it’s time for you to read How to Hold On to Your Mancards.”</p><p>“Please, Tiffany is all about some romance and I’m the beneficiary of it.” Hunter grinned, his white teeth flashing against his dark skin. “In fact, I bought her an e-reader for Christmas so she didn’t have to wait—”</p> <p>“Oh, Jesus.” Finn scrubbed his face with his hand. “You don’t actually read those with her, do you?”</p><p>“Real men read romance, Finn.”</p><p>Finn chuckled. “You’re whipped.”</p><p>“Better than being alone.” Hunter pulled out his phone. “Text from my woman. Gotta go. She’s cooking chicken and dumplings tonight, with some sweet potato casserole on the side.”</p><p>Finn ticked up his chin. “See you online later?” He was in the mood to virtually blow up everything and then some.</p> <p>“W.oW or Call of Duty?” Hunter asked as he paid his tab.</p><p>“Call of Duty.”</p><p>Hunter punched him on the shoulder as he strode away. “Get your shit worked out with her.”</p><p>“If only it were so easy,” Finn muttered at his empty glass.</p><p>He could use Kennedy Investigations’’ contacts to find her. Although, that would be rather underhanded. Then again, he didn’t give a shit. He wasn’t stalking the woman, just making sure she was okay. And if making sure she was okay led to him “accidentally” running into her, well, that wasn’t his fault.</p><p>Besides, was he supposed to just give up four months of amazing sex, because she said so? Jesus, he sounded like an asshole. It wasn’t the amazing sex, okay so the amazing sex was just that, but he was in love with April. He was completely in love with a bossy, pain in the ass woman who never missed an opportunity to tell him what she thought.</p> <p>God, he missed her.</p><p>His vision blurred suddenly. Perhaps he shouldn’t have drunk that last pint. It was number eight or nine. He paid the tab and staggered to his feet. The walk home should be interesting. He stumbled across the bar and out the door. Cold January air hit him and he stood straighter.</p><p>Another blast of arctic wind hit him. “Holy shit.” That was it. He was texting his driver. Pulling out his phone, he made the arrangement. Ten minutes until arrival. He could wait out here that long. Real men didn’t read romance, but they sure as hell waited out in the freeze-your-nuts-off cold.</p><p>He could only imagine what April would be saying right now. “Go back inside, you idiot, before you freeze to death.” Such a considerate woman. His mouth kicked up at the corners.</p><p>Are you home? Shit, he just drunk-texted April.</p><p>Error Message: STOP TEXTING ME.</p><p>Whi&amp;ch actu$#ally means text me kjpd. Dammit. Stupid drunk thumbs. More</p><p>By the time his driver arrived, there was still no response from April. He nearly fell into the backseat, the driver shutting the door behind him. He blinked at his phone, then closed one eye in order to get the screen to come into focus. One last text and if she didn’t respond, then he was done.</p> <p>Then he read what he’d sent to her. “Damn you, autocorrect!”</p><p>Now she’d never text him back. Hell, she might file a restraining order against him. He shoved his phone into his coat pocket, leaned against the leather seat and closed his eyes. Tomorrow, he’d try again, tomorrow.</p><p>April made a face at the screen on her cell. Finn missed her hot tits? He had to be drunk.</p><p>“Put down the damn phone,” Chad said, pounding a fist on his desk. A desk that was rumored to have been owned by General Robert E. Lee. “I’ve given you long enough to get over whatever snit you’re in. I have a major fundraising dinner in February that you’ll need to attend with me, and...”</p><p>She listened with half an ear as her dad droned on and on about family duty, constituents and campaigning coupled with her inability to not keep her head on straight when it came to outward appearances.</p><p>Same lecture, different day.</p><p>It didn’t matter if she were perfect or not, she’d never measure up to her dad’s standards. No one could. Maybe that was why her mother had run off and married the gardener. Last she heard, they were living it up in Acapulco.</p><p>She glanced around her dad’s office. Same dark woods, same wall of books and same smell of old leather and bullcrap. Lots of deal-making and hand shaking went on in this room.</p><p>And she was so tired of it. She wanted a normal life, without politics. Without the scrutiny and campaigns.</p><p>“Well, what do you have to say for yourself?” Her dad downed his glass of rum and coke.</p><p>Looking Chad straight in the eye, she took a deep breath and said, “I’m almost four months pregnant.”</p><p>The nearly empty glass fell to the desk with a thud, ice and mixed drink going everywhere. “Tell me you’re joking.”</p><p>“I can’t.”</p><p>“Who’s the father?” he asked and April blinked at him. “Do you even know?”</p><p>“Excuse me?”</p><p>“You heard me.” He came from around his desk, advancing on her with a dark look on his face, and for the first time in her life, she was afraid of her dad. But she refused to cower.</p><p>“Why does it matter?” Besides, if he wanted to think she slept around...fine.</p><p>His jaw worked. “Why does it matter?” he repeated. “God Almighty, April.” He glanced around the room, then back at her. “Get rid of it.”</p><p>Get rid of it? Like it was an inconvenience to him? Like he had to the right to dictate to her? He’d lost his damn mind. “No.”</p><p>“Then tell me who the father is.”</p><p>“No.” She stood, lifting her chin and gripping her phone tightly in her hand. “I’m keeping the baby and you’re going to have to deal with it. I’m sure your campaign manager will know how to spin it. Think of all the conservative women votes you have yet to capture.”</p><p>“It’s not going to reach Margo’s ears,” he said and she could see the gears turning in his head. One thing that every opponent could count on from her dad was his ability to think on his feet. He was a master at debate and could turn any rebuttal into a gaff. “If only you were still with that Ambrose boy. We could work with him. Nice kid but dumb as hell when it comes to politics.”</p><p>That had been what drew her to him. He couldn’t have cared less who her daddy was. “We were toxic together. I didn’t like the person I was with him.” Normally, she wouldn’t have admitted this to him, but the pregnancy made her vulnerable. It made her wish for a father that was concerned for her and would tell her things like: I support and love you, no matter what.</p><p>“Sugar, you can’t help it,” he said, almost absentmindedly. “Too much of your mother in you.”</p><p>Hurt slashed through her. She bit down on the inside of her cheek for so hard and so long that blood flooded her mouth. Bile rose in her throat and she had to close her eyes.</p><p>Breathe, she told herself, just breathe. Then she opened her eyes.</p><p>“Still, I wonder...” Suddenly, her dad smiled. Oh God. She knew that smile. “You’re still friendly with Leah Ambrose, aren’t you?”</p><p>“Carter’s mother...yes.”</p><p>“Go visit with her. Enlist her help in getting Carter back.”</p><p>“I don’t want him back.” She wanted Finn back, with all her heart. Stupid heart.</p><p>Chad wasn’t listening. “And to sweeten the pot.” He strode to his desk and opened the middle drawer. His checkbook. Did her dad really think he could buy Carter off? Wouldn’t happen in a million years. “Make it happen, April.”</p><p>Or else hung in the air, daring her to ask, “What if I don’t?”</p><p>“Then I’m cutting you off.” He held out the check. “Think about it, sugar. You don’t have a job, unless I say you do, which means no insurance, no salary, no pretty clothes and shoes. I’ll sell the car, sell the house—”</p><p>It galled her to think that her own father had narrowed down her focus in life to material things. Though in the past that might have been true. “I already sold the house and bought another one. In my name only this time.” She gave him a saccharine smile. “Didn’t your secretary tell you? Maybe you should start reading things before you sign them.” But she needed her job, if only for the medical insurance. No one would insure a pregnant woman after the fact.</p><p>God, she hated the corner she’d painted herself into. This was exactly why one never went into business with family.</p><p>“Fine. Keep the car. Good luck paying for maintenance, gas or insurance.”</p><p>She crossed her arms over her chest. “Thanks.”</p><p>The check crumpled in his hand at her mutinous expression. “Dammit, April. At least think of the baby.” He said the word as if it were a curse. “You’ll need transportation, food, a roof over your head and baby stuff. All of that costs a lot of money that you’ll no longer have. And do you really think all of your so-called friends will be there for you? Sure, they might come over and play with the baby, but honey, think about it...You’d be all alone, with a child that you can’t afford to raise.”</p><p>Biting down on the inside of her cheek again, she looked away. Tears threatened to fall. Slowly uncrossing her arms, she held out a hand. “I’ll do it.”</p><p>He set the check in her palm, closing her fingers around it. “You did the right thing, baby girl.” Pressing a kiss to her forehead, he gripped her chin and forced her to face him. “Do what needs to be done and if you can convince the son of a bitch it’s his, do it.”</p><p>Then he released her, striding out of his office and slamming the door behind him.</p><p>April sank into the chair, check in one hand and phone in the other. She let the check fall to the floor. Tears flowed down her cheeks, but she refused to acknowledge them. She pressed that empty hand to her stomach. “For you...I’ll do anything for you.” Unlike her parents, she would put her family first.</p><p>Chapter Three</p><p>April was not used to losing and she hated coming in second to anything or anyone. Yet here she was, driving back to Charlotte in defeat, with a smile on her face. She hadn’t been able to convince Carter that they needed to get back together, and like she had predicted, the check from the governor hadn’t helped things.</p><p>However, she had taken it upon herself to purposefully sabotage the entire thing, though to be honest, as soon as she and Carter were in the same room together that familiar pattern of their toxic relationship reared its ugly head. Instead of whoring herself out, she lied to her ex by saying that she’d cheated on him while they were together, and became the biggest witch this side of the Mississippi to him and everyone else she came in contact with, except his mother.</p><p>However, that wasn’t too much of a stretch, especially now that she was becoming sick at the most odd times of day. No morning sickness for her. It was more like all day sickness.</p><p>Not that Carter would have cared. He wouldn’t have cared if she’d screwed every man in Holland Springs and uploaded videos of her sexcapades on YouTube. Nope, his attention was firmly fixed on his sister’s best friend. Too bad the dumbtail didn’t know he was in love with the girl. But April hadn’t been inclined to help either of them. Instead she managed get herself practically thrown out of the Ambrose’s house.</p><p>Something that her father couldn’t possibly blame on her, because he didn’t know the details while she knew that the Ambroses wouldn’t breathe a word about it. She’d always thought something had been a little off about that family. Maybe it was all those brothers and sisters, with two parents that not only loved their kids, but actually liked them.</p><p>Maybe she should have tried harder to be—she grimaced—nice after all, because she was back to square one: twenty-six years old, all alone, unmarried, pregnant by a no good lying asshole of a man and without a job.</p><p>Awesome.</p><p>Making a left on North Davidson Street, NoDa’s familiar landscape greeted her. All funky shops and eclectic eateries. Some even called the historic mill village SoHo’s little sister. She preferred to call it home.</p><p>Almost there, she thought with a little smile.</p><p>Her little bungalow, located on Thirty-Seventh Street, was the only place that had ever felt like home to her. It was cozy and comfortable, with a pretty little front yard and a great backyard, complete with a patio and a swing-set.</p><p>Placing a hand on her belly, she said, “I’ll play with you. Don’t worry.” No way would she raise her child like she’d been raised. On at all times, never able to show emotions about anything, not even when her mother had left her.</p><p>Blue and red lights flashed in her rear view mirror.</p><p>Glancing down, she checked her speed. Thirty-six in a thirty-five zone. “Oh, come on,” she muttered, pressing on the brakes and hitting the hazard lights. She pulled over to the right side of the street, put her car in park and rolled her window down. This was the last thing she needed. Jerking her purse out of the passenger side seat, she dug through it and found her wallet.</p><p>By the time the officer got to her window, she had her license out and was tapping it against the steering wheel. Only the officer wasn’t dressed like a cop. He wore black cargo pants, a black long-sleeved t-shirt and a black Kevlar vest.</p><p>“License, please,” a familiar voice said and her heart stopped. Finn Burke.</p><p>A flutter of anticipation slid through her, but she turned to him with the haughtiest look she could muster, letting him take the square piece of plastic. “Shouldn’t you be out arresting mobsters? Or at least sleeping with their daughters?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There’s a big Mafia problem in NoDa?” he asked, with that brogue of his. She would never admit it to him, but that combination of Irish accent with a touch of the Bronx drove her wild. Made her wet and hot.</p><p>And she hated it now. Him, really. Hated how out of control he could make her feel by saying such mundane things as butter, hotter and basically any word ending with an ‘r’. But that wasn’t the worst of his crimes,not by a long shot. He had made her fall in love with him, or who she thought he was.</p><p>“Are we through here?” Snatching her license out of his hand, she flung it away, not caring where it landed. The smell of Salvador Deli, normally taste bud heaven, made her stomach roil and she gasped. A cold sweat broke out on her forehead and she felt the blood drain from her face.</p> <p>He opened the car door so quickly that she couldn’t stop him. “What’s wrong, babe?”</p><p>Breathing through her nose, she slanted him a look. “Don’t call me babe, you damn Yankee.” Another roil of her stomach and she had to lean back in her seat, eyes closing. She would not puke in front of him. On him though, was an entirely different matter.</p><p>“I’m Irish, April. Lived in Ireland most of my life,” he reminded her.</p><p>“But you lived in the Bronx for five years,” she insisted, then moaned a little as the next wave of nausea hit her. “Makes you a Yankee.”</p><p>He grunted. “Get out of the car.”</p> <p>“You can’t make me,” she said weakly, but didn’t protest when he unfastened her seatbelt and lifted her out. His bullet proof vest was hard and as unforgiving as she felt on the inside. Wrapping her arms around his neck was something she had to do, because she had no desire to fall.</p><p>Too bad she’d never stopped falling for him.</p><p>Damn stubborn woman. Finn kicked the car door shut, then pressed the lock button on her key fob before readjusting her in his arms. She snuggled up against him, and he glanced down. The color had returned to her face, but she still looked a bit peaked.</p><p>“You aren’t contagious, are you?” he asked, striding to his SUV.</p><p>Her head lulled to one side, one eye cracking open to narrow at him. “Will you leave me alone if I say yes?” Which was April-speak for she wasn’t contagious and wanted him to stay with her.</p><p>A smile kicked up the corners of his mouth. He managed to get his keys out, unlock the door and place her inside. “Sit there, and if you have to hurl, kindly roll down the bloody window first.” Then he slammed the door shut and jogged to the driver’s side and got in. “I’ll get one of my buddies to drive your car home.”</p> <p>After he started up his Range Rover and merged onto Davidson, she cleared her throat. “I don’t live on Kingston anymore.”</p><p>Grunting, he glanced at her, then back at the road. “Finally moved up to Myers Park, yeah?”</p><p>“No.”</p><p>“Eastover, then.” It was pure luck that he’d been doing a ride-along with Hunter and was on his way back to his SUV. When he’d seen that silver little BMW whip out onto Davidson, it had been all he could do not to tell Hunter to punch it. Instead he’d suggested that his buddy tail the roadster, just for shits and giggles.</p><p>So, when her speed had gone a mile over, Finn couldn’t have hit the lights fast enough. Pride made him sit in the car so she could sweat it out.</p><p>“Pretty nice ride, for a cop,” she said as he braked for a red light. “Or Uptown’s businesses are doling out major kickbacks.”</p><p>“Security business pays well, remember?”</p><p>“Should I know every mundane fact about your life?”</p> <p>Which meant, yes, she did remember. Too amused to be angry with her, he smiled and shook his head. “Do you believe every Hollywood film you see?”</p><p>“Then you explain it.”</p><p>“If I told you, then I’d have to kill you,” he said with a quick glance in her direction.</p><p>She smirked at him, then closed her eyes. “Nice.”</p><p>His stomach rumbled. A quick stop at the deli and he could get his dinner to go. “Are you hungry?”</p><p>She didn’t answer. Glancing her way again, he found April asleep, her mouth slightly parted. Damn, whatever bad dose she’d gotten had made her all knackered.</p><p>He parked his truck again, ran to the window, ordered and was back on the road in under ten minutes. April slept the entire time, until he turned into her driveway. Then she woke up, looked at him and her face went white, then green.</p><p>“Oh, no, no, no,” he chanted, pressing the unlock button while she worked at the door handle.</p><p>“It’s not working.”</p><p>Jumping out, he ran like a man on fire to her side. “Let go,” he shouted, but every time he pulled, so did she and the door refused to budge. Finally, she gave up and stuck her head out of the window, puking down the side of his Range Rover.</p><p>He made a face, running a hand over his eyes, nose and mouth. “Did you have to get it all over the door?”</p><p>“Sandwich,” she moaned.</p><p>She wanted eat. After all that? “Sorry?”</p><p>“Get. Your. Sandwich,” she said through gritted teeth.</p><p>He stood there, stupidly, until his sandwich came flying through the window, hitting him squarely in the chest. Catching it on the way down, he watched April get out on his side and wobble on high heels to her front door. She jiggled the knob a couple of times, then sank to the floor and did...nothing.</p><p>A gentleman would go help his lady up. But he was no gentleman and his “lady” hated him, hadn’t spoken to him in over a month and had puked all over his new SUV’s paint job. He stomped to the side of her house, threw the sandwich away in her trashcan, then searched for a garden hose. After finding it, he turned on the water and pulled the hose along side of him.</p><p>Taking his time, he rinsed off the passenger side door, then rummaged through the back for some soap, a bucket and a sponge. After finding all three, he set to washing the thing, humming a tune as he got the job done.</p><p>When the SUV looked as good as new, he put everything back in its place and headed to April’s porch. He stopped cold when he found her still sitting there, unmoving with her head against the door frame.</p><p>“Why didn’t you go inside?”</p><p>She made a little noise. “You have my keys.”</p><p>“But the spare—”</p><p>“Is in the back, hidden under the deck,” she finished. Holding out her hand, she wiggled her fingers at him. “Keys.”</p><p>Damn his temper and damn her stubbornness. She could have asked for his help. He snorted. Fat chance of that happening. Ever.</p><p>“Please,” she whispered, then her arm went limp.</p><p>And didn’t he feel like a big man for reducing her to this. April Billingsworth never said please. Oh hell, no. She demanded and he gave, until they were in bed together, then her demands turned into pleas.</p><p>“Now, Frank,” she growled.</p><p>He smiled. There was that flash of temper he’d missed. Thought she could make him mad by calling him by the wrong name? Not a chance. His smile widened. “There’s my girl.”</p><p>His girl chucked her phone at his head.</p><p>Chapter Four</p><p>April eyed Finn as he held a bag of frozen peas on his cheek. A very, very tiny part of her felt bad for hurting him, while a very, very large part of her thought it served him right.</p><p>Wrapping her robe tighter around her, she sailed past him and into the kitchen. Damp strands of hair slapped her in the face. The shower she’d taken had made her feel a million times better. So had the saltine crackers and ginger ale she’d sneaked into the bathroom while he wasn’t looking.</p><p>“I’ll take a steak-medium; a potato-baked; and a glass of your finest in lieu of your apology,” Finn called out from her living room. “And a twenty for the gas I spent getting you home safely.”</p><p>“Dream on,” she snapped, then stopped short, spun around and stomped to the living room. “How did you know where I lived?”</p><p>His oh so very handsome face paled a little under his tan. “You told me, right before you passed out.”</p><p>Crossing her arms, she lifted her chin. “I don’t think so.”</p><p>“You talk in your sleep, don’t you know,” he said with a wink. “Although, this time there were considerably less ‘more, Finn, more’ coming from that sweet mouth.”</p><p>Of all the nerve. She tossed her head and lifted her chin. “I’m glad the sex was memorable for one of us. Sorry, Fred, but I’ve moved on to bigger things. Huge.” Her gaze flicked down to his crotch and back up again, a smirk fixed on her sweet mouth. Just leave me be, she thought, until another voice in her head spoke up, Don’t let him go. “Maybe you should try to do the same.”</p><p>His face turned dark. “Dammit, April. You can’t keep running away from me.”</p><p>Uncrossing her arms, she shoved a finger into his chest. “Maybe I could, if your buddy hadn’t pulled me over for a false traffic violation.”</p><p>“False? You were speeding,” he yelled, his hands swiping through the air. Automatically, she flinched and used her hands to shield her face. “What the hell? I would never hit a woman.”</p><p>Humiliation washed over her, turning her body hot, then cold and then back to hot. Slowly lowering her arms, she narrowed her eyes. “How would I know that?”</p><p>Slowly, he took a step towards her, then another, his blue eyes serious. “I would never hurt you. Ever.”</p><p>Not physically, that she believed. However, her poor heart was still trying to recover from the bruises he’d left on it, with his lies and false promises.</p><p>“I’m sorry you’ve gone to all this trouble to help me home, but I think it’s best if you go.” She side-stepped him, heading to the door and opening it.</p><p>He moved to the door and her heart plummeted. Stay, please stay. Pausing he looked her straight in the eye and shut the door. “I’m staying.”</p><p>Yay, her heart cheered. She frowned. “Don’t you have cop stuff to do, like eat donuts?” Although if he ate donuts, then he must do a thousand sit-ups afterwards, because the man was more than cut.</p><p>As if reading her thoughts, he slid his hand up his black t-shirt, exposing those washboard abs and her weakness for them. She whimpered and he grinned. “These aren’t the abs of a desk jockey.”</p><p>Of their own accord, her fingers stretched toward him and she licked her lips.</p><p>“Go on. Touch them,” he said, voice all low and husky. He met her halfway, encircling her wrist with his large hand and placing her palm right on his stomach. The muscles contracted beneath it.</p><p>“Oh God,” she whimpered again. What was wrong with her? Finn was just a man, with red hair for goodness’ sake. Okay, so it was a dark auburn and his blue eyes were sexy as anything. He was sexy as anything.</p><p>“Knew you’d love it.” He smiled, wicked and full of promised.</p><p>And so smug that she snatched her hand away. “Better keep working out, Felix. There was a little pudge.”</p><p>His brows shot up to his hairline and his smile fell off his face. “My what?” Then that smile returned. “I’ve got you all figured out, Miss Billingsworth.”</p><p>She backed away from that smile. “The only thing you’ve figured out about me is that I happen to like men with nice physiques.” Stopping a couple feet of away from him, she pretended to consider her next words. “Like my ex-fiance, for instance, has abs that make grandmothers sigh.”</p><p>“Is that where you’ve been?” he asked.</p><p>Was Finn jealous? “I missed Carter.”</p><p>“If he’s so great, then why aren’t you with the arse. Oh, sorry, Mr. Wonderful?”</p><p>Because she didn’t want Carter. She wanted Finn, the man who had lied to her, who’d made her laugh and feel so loved that it physically hurt to be without him. And he was the father of her unborn child. Eventually, she would have to tell him about the pregnancy, but the other...probably never.</p><p>So she resorted to what she did best, annoy the hell out of Finn. “Who says he’s not on his way here right now?”</p><p>Finn could barely contain the eye roll over her bald-faced lie. “As sick as you were, I’d sure as hell wouldn’t be letting you out of my sight.” He strode to the kitchen and opened her fridge. There was barely anything on the shelves worth eating or drinking, unless one liked crackers and soda water. “Where’s your beer?”</p><p>“Right where you left your manners,” April said from the doorway between the kitchen and the living room.</p><p>He straightened, taking in her tiny tank top and stripped pajama bottoms that her open robe had revealed. Her breasts looked huge and there was a softness to her curves that hadn’t been there before. “Did you get your tits done?”</p><p>“Why?” She crossed her arms over her chest, making them stand out even more. “Did you miss my hot tits?”</p><p>He would never live that text down. “I’m a man, aren’t I?”</p><p>“Do you really want me to answer that?”</p><p>Damn, but he loved teasing her. “Gain some weight, then?”</p><p>Jaw working, she whirled around and stomped down the hall. He followed, “C’mon, April. I was only joking.”</p><p>“Go away.” She stopped at a door, her head bowed. Hair the color of caramel fell forward, exposing the soft nape of her neck.</p><p>“I’m sorry, sweetheart. You look gorgeous.” He moved closer, placing his hands on her hips and dipped his head. “I’m an arse.”</p><p>“Finn,” she said, her hands joining his, then bringing one around front. His palm coasting over the firm swell of her stomach. “I’m pregnant.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter Five</p><p>“I see,” Finn said, although he could barely see anything at all, much less breathe. He blinked at the back of her head, saw double, then blinked again.</p><p>She sighed. “It’s yours. The first time we had sex...we didn’t use protection, remember?”</p> <p>But he had pulled out at the last minute. Guess he mucked that up. “I see,” he said again. Damn, but he was utterly brilliant at this moment. He was going to be a father. Responsible for someone else’s life. Responsible for screwing them up in a way that only parents could. “Jesus.”</p><p>“If you’d like to have visitation with the baby after it’s born, I’m sure my lawyer can work something out with yours,” she said, in voice calm, like she was discussing her plans for the weekend. “If you can’t afford one, then—”</p><p>“I can bloody well afford my own lawyer,” he growled, applying pressure to the one hip still in his hand. She turned, her chin tipping up. Pretty blue eyes met his, head on and tear free. “But I won’t need one.”</p><p>This time she was the one to say, “I see.”</p><p>“You and I will work things out before the baby is born,” he said and her eyes fractionally widened. “As it happens, I’m in need of a flatmate and –”</p> <p>She crossed her arms. “I’m not moving in with you in some pest-infested apartment.”</p><p>His “pest-infested” apartment was located in Charlotte’s swankiest Uptown address. “Wasn’t asking you to.” He cupped her cheek and her eyes closed, lashes falling. “Besides, your place has a yard and sidewalks. Good schools.”</p><p>“So you’ll be moving nearby?” A shuddering breath left her as she leaned into his touch. “That’ll be nice.”</p><p>“For the baby,” she added quickly, her pink lips oh so close to his.</p><p>“Glad you think so,” he murmured.</p><p>“Me, too.” Rising on the balls of her feet, she kissed him. A quick meeting of lips that had him pressing her against him as he went in for more.</p> <p>He kissed her again, nipping at her bottom lip. “Not done.”</p><p>She slid her hands up his chest, to his arms, gripping his biceps. “We should stop,” she said between kisses.</p><p>“We should,” he agreed.</p><p>“I’m still mad at you, Finn.”</p><p>“As you should be, but lay into me tomorrow,” he said, then sealed his mouth over hers. Damn, he’d missed kissing her. He’d missed the way she would surrender to herself and let him explore her mouth with his tongue. Like he was doing now. He growled low in his throat when her tongue touched his.</p><p>Sweeping her off of her feet, he bumped open the door with his hip and walked inside. Without breaking their kiss, he kept one eye open and made his way to her bed, carefully placing her in the center.</p><p>She looked up at him, breathless and all shiny-mouthed. He pulled his shirt over his head, then his holster and placed it on the dresser. When he came back to bed, she lay there nude but for her panties.</p><p>Placing a knee on the mattress, he unfastened the top button of his black pants. “Take those off.”</p> <p>“You do it...please.”</p><p>After shucking off his pants, boxers, socks and shoes, he climbed on the bed and dipped his head to her hip. Using only his teeth, he tugged off her silk panties, then gently pushed her thighs apart. A thin strip of blonde curls and pink flesh greeted him.</p><p>“Now that’s a sight,” he said with a wiggle of his brows.</p><p>She giggled, then slapped a hand over her mouth, like she’d just revealed her most shocking secret to him.</p><p>“Don’t hide from me,” he ordered, pulling her hand away from her face. “And don’t be afraid to be you with me.”</p><p>“I’m not like other women—you know, nice and sweet,” she said. The vulnerability on her face was nearly his undoing.</p><p>“Not much of a sweet tooth.” He lowered himself between her thighs and parted her delicate sex, giving her a lick. “I prefer tart.” Another lick and her hips rolled. “A little tangy.” This time he found her clit and sucked, until she beat at his shoulders and called out his name. “Full of vim and vinegar.”</p><p>Pushing her hair out of her eyes, she blinked at him. “I taste like vinegar down there?”</p><p>“No,” he said with a low laugh, then crawled up her body, mindful of what lay between them. “Care to taste for yourself?”</p><p>She turned her head and he kissed her ear instead. “Maybe another time.”</p><p>He worried a lobe, pleased when her nipples hardened. Working his way down the long column of her throat, he traced a path to her breasts and palmed one. He placed an open mouth over the top of one hard nipple, then peered at her from beneath his lashes. She watched him intently, her cheeks pink as she panted. He felt her fingers curl around his dick, tightening. He groaned, then began to suck on her.</p><p>“In me, Finn. I need you in me,” she said on a wail. “Please...put your cock inside of me.”</p><p>His dick grew as hard as the Kevlar in his vest. He let her nipple pop out of his mouth. “I’ll fuck you, love.” Brushing her hand out of the way, he guided his cock to where she was wet, slick and hot, and gave a hard pump of his hips. She jolted beneath him, her inner muscles clamping down on him.</p><p>“Yes,” she hissed.</p><p>His eyes rolled at the pleasure of it, then he rolled her on top of him.”Don’t want to hurt you,” he said softly.</p><p>She placed her hands on his chest and worked herself up and down his cock, until finally he slid all the way inside of her. This time, they both groaned.</p><p>“Oh God,” she said, her head falling back and her luscious breast bouncing as she rode him. Leaning forward, he bit a nipple and she spasmed around him.</p><p>“Son of a bitch,” he said and her head snapped up.</p><p>“What?”</p><p>“Protection.”</p><p>Tilting her head to one side, she made a face. “Little late for that, don’t you think?”</p><p>“Worse things than a baby.”</p><p>She frowned. “Don’t have those, remember?”</p><p>He grinned, memories of a similar conversation taking place the first time he stripped her out of her dress.“Neither do I, remember?”</p><p>“Don’t be ridiculous,” she snapped, then a hard thrust made her moan.</p><p>Cupping each hip, he helped her ride him, urging her faster and harder until she let him take completely over. “That’s right. Forget that you hate me, that you always need to be in control.”</p><p>“I don’t need to be in control.” But he noticed she didn’t say a word about hating him, which could only mean that she didn’t hate him and couldn’t bring herself to admit it.</p><p>He sucked a hard neglected nipple into his mouth, then let it pop out. Something he knew she loved for him to do, because she had told him in explicit details how she liked to be touched and stroked.</p><p>Most perfect woman ever created, he thought.</p><p>“Let me take care of you.” He brushed his thumb across the outer edge of her clit again and again, until she shoved his hand away and began to rub herself.</p><p>“More, Finn, more,” she gasped.</p><p>Her arm came down across the front of her body, cupping a breast and playing with a hard nipple. “You’re killing me, woman,” he said, then sat up. He held her close, pumping into her hard and sucking at a spot on her neck.</p><p>She shuddered around him, calling out his name.</p><p>His head fell back as his own orgasm claimed him, pouring out of his body into hers. Deeper and deeper he thrust, his arms tightening around her curvaceous body.</p><p>Finally, he rolled his head to one side then the other. “Almost forgot what a hot piece you are.”</p><p>Big blue eyes, slumberous with satisfaction and some other emotion regarded him. She yawned and stretched, her legs uncurling from around his waist. “I’m sleepy.”</p><p>“I’ve been told in the past that I’m hard to keep up with,” he said with a smug smile.</p><p>She yawned again. “Stop believing the lies.” Then she lay her head on his shoulder, relaxing in slow degrees until her breath evened out.</p><p>Easing down on the mattress, he lay there with her, long after he’d gone soft and slipped out of her warmth. He ran his hands up and down her back, until she shivered and goosebumps appeared. Then he somehow managed to draw the covers up and over them both.</p><p>“’Night, babe,” he said, as the sun set.</p><p>She mumbled something in her sleep, then snuggled up to him.</p><p>Wonder what she would think when she woke up next to him tomorrow morning? If her reaction to what had just happened between them was any indication, she’d be putty in his hands. He grinned.</p><p>Chapter Six</p><p>“I didn’t trick you into having sex, April.” Finn rubbed the back of his neck and groaned. “Why won’t you listen to reason?” They had been arguing for twenty minutes now and he was no closer to changing her opinion of him. Hell, he hadn’t even had a chance to try to change her mind.</p><p>She picked up a decorative pillow from the floor and placed it on the bed. “You used my raging pregnancy hormones against me, with your tight shirt and abs...and other things.” She tied the sash on her robe tighter and flicked her eyes over him.</p><p>He stood there, straight from her shower, wearing nothing but a towel. Grinning, he said, “Those raging pregnancy hormones bothering you, babe? I could help you out again.”</p><p>“You need serious psychological help.” She stomped to her closet.</p><p>He followed her, then leaned against the doorway with his arms folded across his chest. “In all seriousness, we need to talk. I’ll go first.” Her jaw turned mutinous and he uncrossed one arm to hold up a finger. “Wouldn’t you rather us be on good terms, for the sake of our baby.”</p><p>That mutinous jaw softened and she nodded. “Go on.”</p><p>“I was hired by your father, to watch over and keep tabs on you. However, it wasn’t my plan to sleep with you.”</p><p>“So, it was my fault, then?”</p><p>He straightened and took a step closer. “No. It was mine. I never get involved with clients or with anyone in their family.”</p><p>Raising a hand in the air, she waved a finger around. “Yay for being special.”</p><p>“Look, I wanted to tell you, but I was confident that you’d leave if I did...and I couldn’t risk that, at the time anyway.”</p><p>“Because it would have been extra hard to keep tabs on me once I got your tail fired? Bless your heart, Finn.”</p><p>Closing his eyes, he counted to fifty and prayed for patience. He deserved this. He had screwed up and had lied to her. She was the victim, no matter how tart her tongue.</p><p>“Are you done talking now, because I have things to do that don’t involve you.”</p><p>“Time for your weekly mani/pedi, babe?” he asked, eyes opening. That’s what she usually did on Tuesdays. He knew her entire schedule, down to the hour. He wondered if she had any idea that she was so habitual. If someone ever did plot to kidnap her, they’d have no problem at all.</p><p>“No.” Her gaze skittered away. “Car stuff.”</p><p>“But it’s not Friday.” He frowned. “You always get your car detailed on Fridays.”</p><p>“Would you stop reminding me of how my dad paid you to stalk me?”</p><p>“Protect you,” he corrected.</p><p>“You’re splitting hairs.” She hung up her robe and got dressed, slipping into a pair of brown trousers and a pale pink fluffy sweater. Next were animal print flats. “Now get dressed and leave.”</p><p>“That’s it. You’re not willing to give me another chance?”</p><p>“I’m willing to let you have visitation with our child. That should be enough.”</p><p>“You’re not getting it, me...this.” He shifted his weigh from one leg to the other. “I want you and the baby. It’s a package deal now.”</p><p>“How romantic. Is that how you charm all the girls out of their panties, big talk of your package?”</p><p>“My big package seemed to impress you all right.”</p><p>“God, you’re so crass.” She brushed past him. “I expect you to be gone before I get back.”</p><p>There was no way he could leave her, no matter what she said or how she tried to insult him. Four months of dating her had seen to that. He was immune to her barbs and he’d cracked the code to April-speak. “Sorry, babe, I’m in it for the long haul.”</p><p>The last thing April expected to be in her driveway was a moving van, but there it was, blocking her. The house beside hers had been for sale, until yesterday when a sold sign suddenly appeared, so maybe the moving company had made a mistake.</p><p>She gently tapped on the horn of her new minivan. “Minivan,” she whimpered. She had always loathed minivans, stuffed full with kids, toys and DVDs. And now she owned one.</p><p>But she couldn’t feel sorry for herself. It was paid for, with enough money left over from selling her pretty little BMW to the dealership, to pay for insurance and gas for a long, long time. Besides, NoDa was entirely walkable. She should be proud for making such a sacrifice. Still her BMW had been so sleek and fast and cute and...not a minivan!</p><p>Finn walked around to the back, bag of chips in his hand. His eyes widened in disbelief.</p><p>Great. Now she wanted to slump down in her seat and hide. Instead she rolled down the window and asked, “What are you doing here?”</p><p>“Moving,” he said, popping a chip in his mouth.</p><p>“Into my house?” She shook her head, hair flying everywhere. “No, uh-uh, no way. Not happening.”</p><p>“Settle down, preggo, I’m moving next door. Figured you wouldn’t mind your new neighbor borrowing your driveway for a couple of hours.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She impersonated a fish gasping for air for several long seconds while he calmly ate chip after chip, then her brain kicked into gear. Finn had moved here, beside her. To be with her and the baby.</p><p>A ribbon of warmth wove around her and she wanted to cry in happiness. Stupid hormones. “How long?”</p><p>“Thirty minutes, give or take a few. Why don’t you leave this here and I’ll move it when the guys are done,” he offered.</p> <p>Well, she was tired. Actually, she was exhausted and wanted to do nothing more than to crawl into bed and sleep for the next hundred years. “Fine. Don’t scratch the paint job when you do.”</p><p>Grinning as he opened the door for her, she turned up her nose at his hand and quickly made her way to her house. “I’m digging the new ride, babe. You make anything look good.”</p><p>“Whatever,” she tossed over her shoulder. Secretly, she was pleased with his compliments and the look of admiration in his eyes. Call her shallow, but after years of second guessing every decision she made, it was nice to have immediate support.</p><p>Once inside, she threw her purse on the couch, her shoes in the closet, peeled off her clothes and tumbled into bed. In what seemed like seconds later, she was waking up to Finn calling her name.</p><p>“I’m sleeping,” she grumbled, burying herself more deeply in the covers. His heavy footsteps sounded and she frowned. That damn man forgot to take off his shoes.</p> <p>A large hand stroked her head gently. “It’s almost six in the evening. You need to eat.”</p><p>“I need to sleep,” she argued, then her stomach growled.</p><p>He laughed. “I brought you dinner.”</p><p>That made her perk up and sit up, putting her bare breasts on display. Gasping, she covered them from his very intense stare, then glared at him. “Stop ogling me.”</p><p>“How about I feed you instead?” He turned, bringing a tray with little legs that fit perfectly over her lap. “Some soup, fresh bread and a little dessert—strawberry ice cream—if you’re up to it.”</p><p>The aroma of chicken noodle soup washed over her and suddenly, she was ravenous. She ate the entire bowl of soup, all the bread and half the dessert before she realized that he was still sitting beside her, not speaking or eating. “Want some,” she said around a mouthful of ice cream. A couple of cold drops fell to her chest and she shivered.</p> <p>“Oh, yeah.” His blue eyes flicked to her chest, staring at the tops of her breasts.</p><p>She put down the spoon. “Get this off of me first.”</p><p>He dipped his head and she leaned back, allowing him to lick the ice cream off of her. His tongue was soft against her skin. The covers dropped to her waist and she felt his finger, cold and wet, circle a nipple. Then his hot mouth opened over it and he began to suck, in hard tugs that she could feel between her thighs. The more he sucked, the wetter she got.</p><p>Over and over he painted her nipples with ice cream, until she was shaking with need. Desperate to have him. One of his hands found her thigh, the other moving the tray to the floor. Higher and higher his fingers climbed, until he sank two deep inside of her.</p><p>Then he kissed her, sinking his tongue in her mouth in the same lazy glide as his fingers. “Come on my fingers, sweetheart,” he whispered against her lips.</p><p>She moaned in response and widened her thighs, sending him deeper. He shifted, his head going to her lap. The stroke of his tongue had her crying out. Sweet torture. She watched as his head moved, his dark hair soft against the inner skin of thighs. Another lick and she jerked her hips. His fingers curled at the exact moment he sucked hard on her clit.</p><p>A scream tore from her throat and she dug her fingers into his hair, gripping the strands tightly. When she came back to her earth, Finn was kissing his way up her thigh, her stomach, and nipped at each nipple until his mouth found hers once more.</p><p>“Let me,” –her hands went to the fly of his pants and he stood up, beside the bed—“return the favor.” She quickly unbuttoned them and pulled out his very large cock, then she wrapped her mouth around the head.</p> <p>She licked and sucked, taking him to the back of her throat again and again, until his hand fisted in her hair and he directed the pace. “Love watching you like this. Oh yeah, right there...just like that. Suck it.” His hips moved faster and faster and she kept right up with him. “Stop,” he suddenly growled, slowly but surely extricating himself from her mouth and hand. “I didn’t come—”</p><p>“You would have, if you’d let me finish,” April said, confused.</p><p>He turned around, the sound of his zipper going up loud in her bedroom. Muttering a few curse words, he turned to face her again. “I didn’t come over for sex, of any kind. I wanted to do something nice, not—” He grabbed the tray and left the room. She heard him rummaging around in her kitchen, then the front door slammed.</p><p>April sat there, stunned. What had just happened?</p><p>The next morning, April found Finn in her backyard, repairing the gargantuan swing set/tree house/fort/slide combo.</p><p>“Good morning,” she said softly, coming to stand by him. He worked at the chains on the swings, covering the metal with a protective plastic covering.</p><p>“Speaking to me, are you?”</p><p>She sighed. “I wasn’t the one who left.”</p><p>The sun shone in his eyes and he squinted at her. “But you were the one who wouldn’t answer my texts last night.”</p><p>Her cheeks heated. “My phone’s not working.”</p><p>“Since when?”</p><p>Since the governor had kept his promise of cutting her off. She had forgotten his office paid for the service plan. He’d also cancelled her credit cards and closed her checking account. Well, the one that was in both of their names. However, a few years back, she had gotten a wild hair and had decided to start putting money away in one of the local banks in Charlotte.</p><p>Thank God for wild hairs, she silently mused. “Right after you left.”</p><p>He went back to work on the swings. “Convenient.”</p><p>More like humiliating. “Sorry,” she said and his attention snapped to her.</p><p>“Don’t say that.” He let go of the chain and placed his hands low on his hips, still squinting from the sun. “I’m the one who’s sorry. I messed up. I lied to you and I’m sorry. Jesus, I can’t say it enough to make myself feel better. For what it’s worth, I leased my apartment in Uptown, bought the house beside you and signed up for partner-parenting classes at the community center. My last name is Kennedy, Burke’s my middle name and I own Kennedy Investigations, but I don’t advertise it, since I like to actually take on jobs.” He came to her then, wrapping his arms around her. “I’m sorry, April. And I want to make it up to you. To our baby. I’ll never lie to you again. Ask me anything.”</p><p>She couldn’t move as he held her and not because she was imprisoned by his arms. Oh no. She was imprisoned by his words, by his actions...by the thought of him trying and doing.</p><p>Taking a chance she asked, “Why don’t you come inside and let me fix you some iced tea?”</p><p>Over the weeks that followed, it seemed that all Finn did was try to earn her trust back. He’d check on her, fix things that need it, cooked her dinner and accompanied her to doctor visits. All done in such a way that never made her feel crowded or uncomfortable</p><p>He never insisted, always asked, and the walls surrounding her poor heart got weaker every day. Only she wasn’t sure if he was doing this to be with her, with the baby or a sense of duty to family.</p><p>If only she knew his feelings. If only she was woman enough to ask him.</p><p>Things were growing worse with her dad. She had refused to take any call from him, ignored his emails and his letters. She didn’t care what he threatened. There was no way she would go back to her old life or her old self.</p><p>But that nagging feeling that her dad wouldn’t be put off for much longer remained.</p><p>Chapter Seven</p><p>“For the love of God, woman, please don’t ever ask me to do that again,” Finn groaned.</p><p>They’d just spent an hour in one of the community centers, watching a DVD of women giving birth. Now, thank God, they were now on their way home. Well, not their home. He still lived next to her and she still lived next to him. But they were talking and spending time together, almost like old times if he didn’t think about the lack of sex.</p><p>But he was a man, so he constantly thought about the lack of sex with her. He only wanted sex with her, despite the numerous opportunities he had in the past month.</p><p>April spared him a glance as they walked down North Davidson. The wind gusted, giving truth to the whole March coming in like a lion saying. “Bless your heart, Finn.”</p><p>“That means I’ve stuck my foot in it,” he said. “Guess I’ll be going to as many as you want me to, then.”</p><p>“You don’t have to go to any at all, you know,” she said softly.</p><p>He nodded. “I do.”</p><p>Avoiding a mother pushing a stroller, he moved to the right side of April and their fingers brushed. His gut clenched, his libido jumped up and down like a dog wanting to play catch. He jerked his hand away like she’d set it on fire. He didn’t know how much longer he could take her friendship.</p><p>“Are you okay?” she asked, her big blue eyes taking him in.</p><p>Yep, nothing but friendship there. He was so screwed and not the way he wanted to be. “Trying to maintain, ba—April.” She frowned. At his almost slip of calling her babe or his flip reply, he didn’t know. “So, I was wondering if you were free tomorrow night? Thought we could go to dinner, then back to my place for a movie.”</p><p>She laughed as they made a right onto Thirty-Sixth Street. “It’s amazing how free your social calendar becomes once you stop going to all the places your single friends like to go.”</p><p>“Hey, I’m single and your friend,” he said and she laughed again. “And I’m asking you out.”</p><p>Stopping at his driveway, she gazed up at him and strange look in her eyes. The setting sun highlighted her pretty face. “Are you asking me out as a friend or as a guy?”</p><p>“C’mon, April.” He had to look away from her knowing eyes. “Thought we were besties now. Hell, Hunter is jealous of all the time we’ve been spending together.”</p><p>“Then maybe you should ask him out.” She left him standing there, shoving her hands in her coat as she made her way to her side of their property fence.</p><p>Way to go, dumbass. The luck of the Irish was definitely not with him tonight. “Night, April.”</p><p>She didn’t respond, just walked up her driveway, up the porch stairs and let herself inside. Out of habit, he waited for her to turn on an interior light and lock her door before he went inside.</p><p>Tomorrow, if she would speak to him, he would apologize. Perhaps even bring her some grapefruit covered in hot sauce. Ugh. He had no idea what that dreadful combination made her so happy.</p><p>A pounding on the front door woke him out of a dead sleep. Pulling on a pair of pajama bottoms, he yawned and started for the door. He smacked his toe along the way and began to hop like a deranged Easter Bunny. “Motherfu—”</p><p>The pounding started up again.</p><p>“I’m coming. I’m coming.” He punched in the security code before unlocking his door and opening it. April nearly fell into his arms.</p><p>“I’m sorry,” she said on a hiccup, then began to speak at him, a rush of words that ran together. “Buthehadallmy-myutilitiescuto-off, and I had a noteab-boutmyhouse, myhorribleminivan. And he foundoutaboutmymoney. Oh God, Finn, I’ms-scaredandhaven-no one b-but you.”</p><p>Still not fully awake or comprehending what she was saying, he gently guided her into the house, flipping on the living room lights along the way. After getting her settled on the couch, he sat down beside her. She had a death grip on his hand.</p><p>“Start from the beginning and go slowly,” he said.</p><p>A shudder racked her body. “He kept his promise.”</p><p>“Who’s ‘he’?” he asked, wrapping a blanket around her bare shoulders. She wore nothing but a yellow tank top, green shorts and flip-flops. He wanted to lecture her for going outside in the middle of a freezing March night, but couldn’t bring himself to do it. She had come to him. Him. That had to mean something, right?</p><p>“The Governor.” She stared off in the distance. “I thought I could do this, all by myself. I thought I didn’t need anyone.”</p><p>Not even him? So much for coming to him. So much for the past month of dates, of tentative smiles and talks and baby classes. April still didn’t trust him. His fault though. “Everyone needs a little help now and again.”</p><p>“I need more than a little help, Finn,” she said, her pretty eyes fixing on his face. “I’m broke. I have no insurance. No house, no phone, no lights or water. Not even that stupid minivan is mine anymore. He took it all away, just like he promised, because I couldn’t convince my ex to pretend that the baby was his. I couldn’t do it, Finn. I just couldn’t, especially after offering Carter money to be with me. I felt like a whore.”</p><p>Swallowing down his righteous fury at the thought of his child being passed off as someone else’s, he said, “You are not a whore, April.”</p><p>“No, I’m worse. I’m a liar and a horrible person to be around.”</p><p>“A liar wouldn’t have told me the truth about the baby.”</p><p>Big blue eyes blinked up at him, lashes all spiky and wet. “You’re not mad at me?”</p><p>Oh, he was mad all right, but not at her. Jesus, he hated to see her like this. So defeated and small. He knew her, knew she valued her independence above all things. Chad Billingsworth had to have done a number on April, using his political connections to take everything from her. “No, sweetheart.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She began to cry in earnest. “I don’t deserve you or your friendship.”</p><p>He couldn’t take her crying, not like this. “ What can I do? Tell me what you need and I’ll take care of it.” Both of their prideful natures be damned.</p><p>“Can I move in with you, just for a little while? After I get a job, I’ll pay you, then after the baby’s born...” Her lower lip trembled and she buried her face in her hands. “Oh God, who’s going to hire a pregnant woman?”</p> <p>“Me,” he blurted. Oh hell, he was totally going to regret this. It was hard enough to keep his distance now, but to see her at his office everyday...He was taking the next client’s request, no matter how small.</p><p>“Really?” She lifted her head. “But what would I do?”</p><p>“Ah, remind me what you went to university for.”</p><p>“Interior design,” she said with a little sniff. “I refused to major in political science, like every other Billingsworth who went to Carolina. I refused go to Carolina, too.”</p><p>He ruffled her hair. “Rebel.”</p> <p>“It’s okay. I’m pretty sure an Investigation firm doesn’t need someone to mix patterns or pick out window treatments.” She stood, letting his blanket fall to the couch. “Sorry to have bothered you. I’ll go back to my place now. The Governor has given me thirty-six hours to vacate the property.”</p><p>“Your dad’s a bastard, if you don’t mind me saying.” Finn joined her, taking her small hand in his.</p><p>Their fingers curled around each other. For long moments, they did nothing but stand there, holding on to each other. She seemed no more inclined to let go than he did. So he stayed, rubbing his thumb along her skin and said nothing.</p><p>Time seemed to slow as her gaze met his, beautifully blue and vulnerable as he’d ever seen. Her grip tightened and he took a step closer to her, bringing their joined hands to his mouth. He kissed her knuckles, then simply held hand against his mouth and closed his eyes.</p><p>Right then, it hit him. He had to say it. He opened his eyes and smiled. “I love you.”</p><p>April tried snatching her hand out of his grip, but it was like vise. “No you don’t. You just feel sorry for me and want to make me feel better.”</p> <p>He gave her an incredulous look. “By saying I love you? Of all the reasons a man will say I love you, that isn’t one.”</p><p>Oh God. She was totally screwing this up. The only thing that could make the whole situation worse was if she had said thank you to his confession. “So you mean it?”</p><p>This time he let go of her hand and ran his fingers through his already messy-from-sleep hair. “It’s not a phrase I throw around, willy-nilly. Why do you think I bought this house, changed my entire life, my routine...everything?”</p><p>“For the baby.”</p><p>“And you. Package deal, remember?”</p><p>Yeah, she remembered. Still a shred of doubt remained. “What if you don’t love me after the baby is born?”</p><p>“I’ll love you after every baby is born,” he said, his words so firm and confident that she began to believe him. That she allowed the new walls she’d built around her heart to keep him from getting in again to crumble. “I’ll love you when we have lots of grandchildren and hardly any teeth.”</p><p>A giggle escaped her, then a sob, until she was doing both. She had to tell him, had to get it out there before she destroyed her second chance at happiness, even if it scared her to death. “And I’ll love you when you’re fat and bald and can’t get it up anymore.”</p> <p>Grinning, he pulled her to him, let go of her hand and wrapped his arms around her. “Never fear, my darling. Viagra has made it so I can always get it up for you.”</p><p>“You say the most romantic things, Finn Kennedy,” she said, her arms slipping around his neck. Rising on her tip-toes, she gently pressed her lips against his. He growled low in his throat and deepened the kiss, then swept her off her feet.</p><p>“Stay the night with me,” he said and a thrill of excitement ran through her.</p><p>She kissed all the parts of him she could reach as he moved to his bedroom and placed her in the middle of his bed. “I missed this.”</p><p>“Me, too.” Dipping his head, he placed a kiss on the swell of her belly. “Hello, in there. This is your dad and I’d like to marry your mother, if it’s all right with you.”</p><p>A fresh round of tears welled. “Stop making me cry. I am not a pretty crier.”</p><p>Smiling, he shushed her and turned his head, placing his ear against her baby bump. “Oh, you‘d like that, would you? Mommy, the baby says to say yes.”</p><p>“Bossy baby.”</p><p>“Just like its mother,” he said, then frowned. “A pony? I’m not so sure...okay, you win.” She ran her fingers in Finn’s hair as he continued talking to their baby, her eyes growing heavy. The last thing she remembered Finn saying to her bump was, “You do have the best mommy ever. She’s a real corker.”</p><p>April was in the middle of packing when the Governor walked through her door. Of course he would show up on the last day, when she was almost done and sorting through her odds and ends.</p><p>“Stubborn as ever I see.” His dress shoes were shiny, his suit immaculate and his hair perfect. He reminded her of a snake-oil salesman.</p><p>Carefully wrapping up her great-great grandmother’s candy dish, she placed it in a box. “You know how those Billingsworth’s are.”</p><p>“I bet you’re wondering why I’m here.”</p><p>“You’d lose that bet.” She smiled, then picked up a pair of candlesticks. “Now who did these belong to?”</p><p>“Your great-grandfather on my side. They’re priceless and should be in the Capitol’s history museum, not displayed in some Chippendale knockoff.”</p><p>“Here.” She held them out to him and let them drop from her hands before he could take the brass fixtures. “Whoops, my bad.”</p><p>Her father’s jaw worked. “Childish, April.”</p><p>Placing a hand on her belly, she turned and smirked at the look on his face. Yeah, that’s right, everyone with eyes in their head can see that I’m knocked up. “Pregnancy hormones tend to make me temperamental.”</p><p>“Let’s not do this, sugar. I’ve come here to apologize.”</p><p>Her mouth dropped open. She couldn’t help it. Her dad never apologized, except to his constituents and it was always the I’m sorry if you were offended B.S.. “You’ve got to be joking.”</p><p>“I’m serious. I was wrong about the baby... my future grandchild.” April rolled her eyes. So now it was his grandchild. “And that young man of yours, well, I was wrong about him, too.”</p><p>Something about Chad’s speech didn’t pass her smell test. He was lying or knew something that would be to his benefit. “Then you’ll be thrilled to know we’re getting married. After the baby is born, because I am not walking down the aisle like this.” Not that she minded how she looked right now. Finn sure as heck liked how she looked. The man couldn’t keep his hands off of her.</p><p>Heat rose to her cheeks. That was not something she should be thinking about right now. Finn walked in and she had to look away. His sudden appearance wasn’t helping at all.</p><p>“You okay, babe?” Finn asked, coming to stand beside her. He placed his arm along her shoulder, very casually, but she could feel the tension that radiated off of him.</p><p>“Just the man I wanted to see,” Chad said, one of those all white, big teeth grins that he saved for campaigning appearing.</p><p>Her stomach roiled. “Why would you want to see Finn?”</p><p>Chad gave her a look. “The question is: Why wouldn’t I want to see my soon to be son-in-law Finn Kennedy? President and CEO of Kennedy Investigations. You, young man, are hard to pin down for an appointment.”</p><p>“I’m booked, sir. Won’t be having any openings for a long, long time.”</p><p>She glanced at Finn. “Don’t turn his money down because of me. Business is business.” But in her heart she didn’t mean it. Choose me, she screamed inside her head, Choose me and our baby, then tell my dad to take his money and shove it.</p><p>“I’m not here for his business,” Chad said, shocking April and from the looks of it, Finn as well.</p><p>“Then why are you here?” she asked.</p><p>“Want you two to come on the campaign trail. I’ve decided to start putting feelers out for a possible run for President.”</p><p>“Of America?” she croaked, but no one was listening to her.</p><p>“Now that you’ve made the right decision by getting back together with Finn, like your daddy told you to do from the start—“ Chad winked at Finn and tsked at April.—“our families, the Kennedys and the Billingsworths, can come together, join forces and continue to make this country great.”</p><p>“So unpack those boxes, fill up the fridge and make a table for three. I plan on dining here tonight, with Margo, of course. Can’t discuss strategy without her.”</p><p>“No, no, no,” April chanted, her whole world crashing in on her.</p><p>“Please leave,” Finn said.</p><p>Chad tilted his head to one side. “I thought you were on board. Our last phone call—”</p><p>“Was a mistake. One I won’t be repeating.”</p><p>“You knew about this?” Trust him, April told herself. Trust him and give him a chance to explain. She knew how her dad operated.</p><p>Finn sliced his gaze to her. “Can we talk about this later, in private?”</p><p>Before she could agree, her dad spoke up. “Oh come on, sugar, you’re still not mad at me because your ex wouldn’t take you back and didn’t want anything to do with the baby. It’s been...what, a month now?”</p><p>Great. Now he was attacking them both, trying to pit them against each other. It wouldn’t work, not with her or Finn. She crossed her arms over her chest. Finn’s arm fell away, but a quick glance told her that he had done the same.</p><p>Her confidence in their relationship soared. They were in this together. Not even her slimeball of a dad could ruin it.</p><p>“Please leave,” she said, echoing Finn’s words. “Don’t come back ever again. I don’t want your money, this house, the minivan...nothing. It’s yours, take it.”</p><p>“Easy to say when the man you’re marrying’s loaded. “ Chad shook his head. “Have to hand it to you, sugar. You always did know how to land on your feet, just like your momma.”</p><p>She ignored the dig about her mother and looked at Finn. “You know he’s lying, right?”</p><p>Finn’s jaw clenched. “I’ll be happy to discuss this with you later, in private.” He directed his attention to her dad. “You heard your daughter. She doesn’t want you here and neither do I.”</p><p>“So much like your mother.” Chad laughed and she bit the inside of her cheek. She was nothing like her mother or him. “Guess I’ll be going now. Don’t bothering contacting me, either of you.” He glanced at his watch. “Tick-tock, children. House cleaners will be here in a couple of hours.”</p><p>She watched her dad walk away, from her house, her life, and his grandchild. A sense of relief came over her. She felt lighter, freer and happier than she had in years. Laughter bubbled up, she couldn’t help it.</p><p>“He’s gone, Finn.” She uncrossed her arms and wrapped them around Finn. “And I’m free!” Only he wasn’t hugging her back or laughing. In fact he looked grim and stoic, his arms firmly crossed and in her way.</p><p>“We need to talk.”</p><p>Oh God. He hadn’t believe her. She gulped. “Okay.”</p><p>“Do you love me?” Finn asked, a frown firmly fixed on his face.</p><p>“You know I do.”</p><p>“Then why in the hell would you want to argue with me in front of that dirty bastard? We’re a team. There’s no need to pretend to be solidified in front of him. We are solidified.”</p><p>“What?”</p><p>Finally, finally, he uncrossed his arms, sat on the edge of the dining table and drew her between his legs. “I don’t give a flying fuck what Billingsworth has to say, about anything and especially about you.”</p><p>“You don’t?”</p><p>“Hell, no. I voted for the other guy.”</p><p>April didn’t know whether to laugh or cry. “I voted for the other guy too, but just to spite my dad. He does have some really good policies and I think, when he was younger, he truly thought he could change the world, make it better. But politics changed him.”</p><p>He stroked her cheek. “You’re a good daughter to think so, but power tends to bring out the qualities that are already hidden inside of us, be they good or bad.”</p><p>“Quite the philosopher, Mr. Kennedy.”</p><p>“You mean quite the reader of superhero comic books,” he corrected, then ran a hand through his hair. “That phone call he mentioned...I haven’t spoken to Billingsworth since the day he found us together. I swear I haven’t.”</p><p>“I believe you,” she said. She really did. “So...you and me, we’re still together and in love until our teeth fall out?”</p><p>“Longer than that, babe, longer than that.”</p><p>She kissed him, then leaned back. “You know, I love it when you call me ‘babe’.”</p><p>“That I do, babe.” He dipped his head, claiming her mouth in a kiss that made her forget all about packing and moving and politics and everything else that wasn’t Finn.</p><p>But she couldn’t forget how happy she was in this moment. “I love you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ditto,” he said with a smirk.</p><p>“You’re a Patrick Swayze fan?”</p><p>“Real men watch chick flicks, April.”</p> <p>“Good thing I got me a real man, then.”</p><p>Smirk giving way to a real smile, he hopped down from the table and took her hand. “Let’s go home.”</p><p>They walked out the front door and into the sunshine.</p><p>It occurred to her that she had never bothered to ask Finn about his financial status. She knew he did well for himself, but her dad had made that comment for a reason. “Are you really loaded?”</p><p>“Richer than God himself,” Finn answered cheerfully.</p> <p>“Is this like the time you told me your—”</p><p>“It is that big.”</p><p>“Finn.”</p><p>He lifted a brow. “April.”</p><p>“Is this how it’s always going to be between us?”</p><p>He laced his fingers through her and grinned. “I sure as hell hope so.”</p> <p>Epilogue</p><p>Eight months later</p><p>Finn adjusted his cuff links, then looked over at his brother. “Ready.”</p><p>“You’ll do, I guess.” William smiled, bouncing his nephew in his arms. “The ring bearer’s ready, too.”</p><p>“Where’s Neil?” Finn asked, looking for William’s partner.</p><p>“He’s with Alice. She had a wee bit of a problem sharing flower girl duties.”</p><p>“Girls are drama,” Finn said as they walked out of the makeshift dressing room and into his back yard. “You sure he didn’t mind walking her down the aisle.”</p><p>“Neil was touched and honored.”</p> <p>“Good.” Finn glanced around, making sure that everything was perfect for his bride.</p><p>Chairs lined each side, with a white runner down the middle. A trio of musicians played a banjo, violin and cello. Flowers were everywhere, as were kids and the new friends he and April had made in their neighborhood.</p><p>“Don’t faint on me, Finn. I’ll kick your arse,” William growled.</p><p>Finn rolled his eyes, striding to the pastor. “Don’t get your knickers in bunch. I was admiring the décor.”</p><p>“You’re such a pussy,” William whispered as Hunter joined them.</p><p>Hunter clapped Finn on the back. “Great job on the décor, man.”</p><p>“Jesus and Mary, there’s two of you now?” William placed Aidan in a pram festooned with ribbons and flowers. The baby fussed, then settled back into a deep sleep.</p><p>Hunter grinned. “Real men like weddings, William.”</p><p>Two flowers girls, one wedding attendant and a maid of honor later, the Wedding March started. April appeared with Neil at her side. She was beautiful, taking his breath away.</p><p>She seemed to float toward him, taking a hand that shook like crazy. He said the right words at the right time, barely able to concentrate on anything that wasn’t her.</p><p>After the kiss, they strolled down the aisle hand in hand, only to come face to face with April’s father. He stood in the shadows, watching.</p><p>“I didn’t come here to impose on you. Just wanted to say congratulations.”</p><p>“Thank you,” Finn said, turning as his brother, Neil, and his niece joined them with Aidan.</p><p>Neil handed the baby over to April without a word.</p><p>“We’ll see to the food,” William said and Finn nodded.</p><p>“Is that him?” Chad asked, then grimaced. “Stupid question. Who else’s baby would my daughter be holding? Anyway, I’m happy for you both and wish the three of you the best.” He stated to walk away.</p><p>“Wait,” April said, glancing up at Finn with a pleading look in her eyes. “Would you like to meet your grandson?”</p><p>“We’re a team,” Finn whispered. If she wanted to include her dad, he would go along with it. Real men didn’t say no to their brides on their wedding day.</p><p>“You sure?”</p><p>April nodded, her veil swinging with the motion. “Yes. We named him Aidan, in honor of Finn’s grandfather.” Carefully, she placed Aidan in Chad arms. Finn had the urge to snatch his son away, but he clenched his fists instead.</p><p>“He’s gorgeous, just like his mother.” Chad bounced the baby a few times, at first awkward, then experience took over and the man began to sway, side to side. “I remember when you were this age and got colic. Your mother and I had to take turns walking the floor with you. We were such a good team, like you and Finn.”</p><p>“Where’s your entourage?” April asked.</p><p>“Left them in Raleigh.”</p><p>“So no photo-op with the bride?”</p><p>Chad shook his head. “No.” He handed the baby back to April. “You look beautiful, sugar. I wish the two of you nothing but the best.”</p><p>April kissed the top of Aidan’s head. “Are you heading back now?”</p><p>“Yes.” For a moment hope shone in Chad’s eyes, but then April turned and walked away, without saying good-bye. He glanced at Finn. “Guess I deserved that.”</p><p>Finn wasn’t about to argue with his father-in-law. “You did. Wish I could tell you not to be a stranger, but lying isn’t my strong suit.”</p><p>“Good to know.” Then Chad simply walked away.</p><p>Finn spun around. He found April by one of her oldest friends, Love Leigh Clayborne. Love held Aidan, a pretty smile on her face. Weird name. Nice girl. The two had recently reconnected, and April had been stunned to find that one of her single friends had no problem doing stuff with her and the baby.</p><p>“May I have this dance, Mrs. Kennedy?”</p><p>“Of course, Mr. Kennedy. Love, will you watch Aidan for a couple of minutes?”</p><p>“I sure will.” Love’s smile grew and she buried her nose in the little tuft of hair that stuck up from his son’s head. “God, he smells so good. I can’t wait to have one.”</p><p>Taking his hand, April laughed. “I recommend going about it a different way than I did.”</p><p>“Well, now that Jason broke off our engagement, I might have to do exactly what you did.”</p><p>April’s forehead wrinkled in concern. “Oh, no. We’ll talk later, okay?”</p><p>Love nodded, her attention firmly fixed on the baby. A tall, blond-haired bloke joined her and her face lit up even more.</p><p>“That’s not her ex, is it?” Finn asked, spinning her around as the trio of musicians played.</p><p>“Chase? No, he’s one of my exes...from a long, loooong, time ago.”</p><p>“Good thing I’m a confident man.”</p><p>“You’re the only man I want.” April eyed the couple and laughed. “Would you look at them? They’re friends, or at least she thinks they are. That poor man’s in love with her and she doesn’t have a clue.”</p><p>“Don’t care much about them right now.” He kissed the top of her head.</p><p>April smiled at him, one full of wicked promises that he sure as hell hoped she’d keep. “Thinking about the honeymoon?”</p><p>“Of course.” They would be travelling to Ireland, to introduce Aidan to Finn’s parents and the rest of the Kennedy clan.</p><p>“I have something of a confession to make.”</p><p>“Do you now?” If she was pregnant again, he would faint. Unmanly, maybe, but babies were exhausting.</p><p>“That day I drove from Raleigh to Charlotte, after everything my dad had planned had gone wrong...I thought I was driving home, but I was mistaken.”</p><p>“You were?”</p><p>A confident smile replaced the wicked one. Both were sexy as hell. “Yeah, I wasn’t driving home, to a place. I was driving to you. You’re my home.”</p><p>His throat felt a little tight. “I love you, April Kennedy.”</p><p>“It’s okay.” Hunter leaned in, his wife tugging on his arm and mouthing ‘I’m sorry’. “Real men cry at weddings, Finn.”</p><p>April rolled her eyes. “Real men kiss their brides, Finn.”</p><p>So, Finn did just that. </p> </body></html>"]