["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hot, luscious piece of ass who can suck a golf ball through forty feet of garden hose seeks rippling-ab’d firefighter who has a tongue that thrums like a hummingbird and enjoys painting my toenails and eating Ben &amp; Jerry’s out of the carton while watching Mad Men.”</p><p>Laura Michaels stared at the online dating site’s registration screen and frowned. That’s what she really wanted to write. Here was the truth:</p><p>“Needy, insecure, overweight twenty-six year old Business Analyst with three cats, a corporate job with pension and no debt seeks Mr. Impossible for way more than friendship and lots of ice cream. I’m desperate for some physical affection and oral sex with a guy who doesn’t view it as some sort of favor he’s granting me, and then expects to be praised like he cleaned my toilet. One night stands are better than nothing as long as you brush your teeth. Call me!”</p><p>Her best friend, Josie Mendham, punched her in the bicep. “You can’t say either of those!” Josie was Laura’s opposite. Where Laura was 5‘6”, Josie was barely tall enough to ride roller coasters. Remove the 1 from Laura’s size and you still had to go down to 2 to get Josie’s. Where Laura had long, curly blonde hair and bright green eyes, Josie was chocolate all around. “Mutt and Jeff” her mom had called them, and they’d been besties since eighth grade.</p> <p>Which meant Josie knew Laura too well. “You are going to do this, damn it,” she said, wagging a finger in front of Laura’s face. “No trying to be perfect. Perfect is the enemy of good enough.”</p><p>“I haven’t even found Mr. Good Enough!”</p><p>“That’s because the hundreds of Mr. Good Enoughs have walked past you, Laura, and you’re blind to them.” Josie nudged Laura aside and started typing, her long nails burning up the keyboard. How did she do that? Typing on the pads of her fingers seemed impossible, but Josie did it, keeping her manicure intact, little replicas of the famous grey necktie from Fifty Shades of Grey on each nail.</p><p>The two had been out at a club the night before and Josie spent the night, waking up chipper and springing this online dating thing on Laura before she’d even had her first cup of coffee. As the machine gurgled and burbled, Laura willed it to hurry. Weighing out her entire dating future in a half-zombie state was not good.</p><p>Laura knew she had to lie, but how much was acceptable? Could she shave off a few sizes, or would she need to hack off an imaginary arm and leg to make herself seem “fit” and “athletic”? The drop-down box with its built in descriptors seemed like judgmental torment. No choices were there for “zaftig” or “juicy” or “full figure.”</p> <p>Being a size 18 with size F breasts wasn’t a crime, she knew; in real life she was fashionable and flowing, plump and pleasing, and could arm wrestle most guys into submission, but reducing her accomplishments, personality and, yes, body into a vocabulary designed by some Internet start-up team of nineteen-year-old dropouts from Stanford and Carnegie Mellon made her irrationally angry.</p><p>No – rationally angry.</p><p>Seeing little choice, she pointed to the boxes on the screen and told Josie, “Pick the word ‘fit.’ I can deadlift 105 pounds. Which is,” she eyed Josie, “more than you weigh.”</p><p>Josie pointedly ignored her, biting her lower lip and deep in concentration. “Voila!” she shouted, her hands spread wide in a grandiose gesture. “There’s your ad.”</p><p>She announced:</p><p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I’m a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p> <p>“I can’t write that!” Laura groaned. “It makes me look like I want an orgy!” She squinted at the screen. “And what the hell is ‘YOLO’?”</p><p>“Who doesn’t want an orgy?” Josie wiggled her eyebrows lasciviously and stuck out her tongue, waggling it like she was performing a very bad imitation of oral sex. “And YOLO stands for ‘you only live once.’”</p><p>“Cut it out. You’re turning me on. It’s been that long since I got some ass, and the last guy used his tongue like he was a Roto Rooter man. Like that.” She pointed at Josie’s tongue and bent over, laughing.</p><p>And then Josie, with a flourish, pressed the “Submit” button. “Thank you for joining – your profile is now live!” the screen read.</p><p>“Oh, shit, Josie, did you just do that?” Laura sputtered, spilling creamy coffee all over her sleeve as she grabbed the mouse. “Fuck!”</p><p>“What?” Josie batted her eyelashes. “Live a little. See who replies!” She grabbed her heavy, over-full Vera Bradley purse that they had discovered at a local thrift shop for $3.99 and fingered her car keys. “Gotta go, Laura. And don’t you dare delete that.”</p><p>Laura laughed. “You know me too well.”</p><p>“No shit,” Josie muttered. Her face turned serious. “Really, Laura. You need to get out there. Some guy is being deprived of your awesomeness. And besides, your budget needs the break.”</p> <p>“My budget?”</p><p>“Yeah. What are you spending in batteries for Bob?”</p><p>Confused, Laura shook her head. It was like Josie spoke a foreign language sometimes. “Huh?”</p><p>“Your battery-operated boyfriend. You know – BOB.” And with that she snickered, running for the door as Laura threw a section of a fashion magazine at her. Josie’s evil laughter filled the apartment as she ran down the hallway, the sound fading once she hit the stairwell. “Have a good day at work!” she hollered from the street.</p><p>The coffee machine gave its death-rattle gasp that signaled the pot was done, and Laura went to drink it greedily, needing sustenance to kick her brain into gear. Enough caffeine and she could date anyone. Hmm, maybe she should do a search for baristas on that site. Free lattes would be a nice perk.</p><p>Dylan Stanwyck couldn’t quite believe what he saw when he logged into the online dating site. Four months of weeding through so many crappy profiles had jaded him. Finding the right woman would be like coming across the proverbial needle in a haystack, but in this case he didn’t want to face any pricks.</p><p>And yes, women could be pricks. So far he had been inundated with requests to chat, and he knew exactly why. Being a firefighter who competed in weightlifting competitions for fun, along with the occasional mini triathlon, made his pictures look quite nice. The problem with the women who were responding to him was that they were also the type to be drawn to appearances only. It seemed so shallow of him to think it, but sometimes being built the way he was could be a curse.</p><p>Curse of the Jersey Shore chicks. Because that was the type who seemed to seek him out, like moths to a flame. A trashy, Snooki-like flame of ho-dom. When he would meet up with these women he found himself in some alternate universe, where they licked their lips and offered themselves up in the alley behind the nice tapas restaurant where he liked to take women. A few goat cheese stuffed dates and pitchers of sangria later and he was being humped up against a slimy brick wall next to the trash cans.</p><p>And when he turned them down...he still had scars from one woman’s long, overdone nails raking his neck as she screeched, “You don’t know me!” over and over, requiring police assistance as passersby gawked, took pictures they probably uploaded to Reddit, and mercifully called 911 on his behalf.</p><p>So when this new profile for Laura appeared, he peered at the description and leaned back in his chair, taking a deep breath. Cute. But not too cute. A little sassy. He liked sassy. He ran a hand through his thick, wavy hair. Time to get a haircut, dude. You look like a survivalist. And smell like one, too, he thought as he studied her picture and caught a whiff of himself. His morning run was done, 3.8 miles logged on his online fitness program, and he reeked.</p><p>She looked like a 1940s pin up girl. A little plumper, with soft curves to her shoulders, a fuzzy, lime-green sweater accentuating her breasts. Her jaw line seemed firm and gentle all at once, and what appeared to be naturally-blonde hair was swept up off her face in a pony tail. His mom would call her a “corn-fed farm girl” and those lips – lush and grinning a half smile that seemed to say “Kiss me, Dylan.”</p><p>Smart, too. A business analyst? Sounded suitably bland and yet signaled she was smart enough to carry her own in a conversation about something other than Kim Kardashian or Fifty Shades of Grey (really – why? Why had every date for the past two months mentioned it?). A real woman. What a refreshing change.</p><p>So he continued reading:</p><p>“Luscious, curvy Business Analyst seeks friendship and more. Financially independent and self-assured, I’m a fit woman who wants a man (or, more than one! YOLO!) for stimulating conversation...er, yeah. Conversation. Message me (or massage me!).”</p><p>Something fierce and hot inside him came to life. From that description it sounded like she...seriously? No way.</p><p>“Mike! Hey, Mike! Get in here!” If there were a chance – any chance at all, here, then he had to act fast. Someone this amazing was about to get inundated by messages from needy weirdos.</p><p>And he needed to be the first.</p><p>His roommate wandered in. Where Dylan was all muscle and brawn, Mike Pine was tall and sleek, a marathoner’s body of long, lean tissue. Dylan’s dark, Italian, thick looks made him popular with women, but Mike was the golden boy, with blonde hair and blue eyes, the long distance runner with a soft heart, the guy women turned to and poured their hearts out, Mr. Sensitive to Dylan’s Mr. Conquest.</p><p>Dylan tapped the screen. “Take a look at her.” He smiled smugly as Mike’s eyes raced across the screen. They’d been waiting for a long time. Too long. His roommate’s expression told him everything he needed to know. Score! It might finally be time.</p><p>“Do you really think that’s some sort of code for being up for a threesome?” Mike asked, eyebrows arched. “I don’t know, Dyl...I think it’s just some sort of joke she’s making. You know how nervous and weird people can be when they try to distill their entire life into a few sentences.”</p><p>Dylan chewed on the inside of his cheek. Bad habit. “Good point. Well, even if she isn’t into a nice menage arrangement, she is one fine woman.” A low whistle escaped from his lips. “I have a project on my hands now, don’t I?”</p><p>Mike nodded, peering at the screen, eyes lingering. “You are going to have a lot of competition.”</p><p>Dylan snorted. “Like I give a fuck. May the best man win.”</p><p>Mike went silent, then grinned, his fresh-faced boy-next-door look morphing into a Wall Street trader’s predatory smile that made Dylan suddenly uncomfortable for no reason he could pinpoint. “Yeah. I hope he does.”</p><p>Ding! The little chat box on the online dating site lit up like a Christmas tree. Laura sucked the last mouthful of her coffee and gaped at the screen. You have got to be kidding me, Laura thought. Already? She clicked and read a message from “9inluvr”:</p><p>Hey, babe. I live in the city and so do you, so let’s hook up for some FWB action. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She snorted. Oh, sure. Just like that. Yer a catch, Bud. A real romantic.</p><p>Ding! This one was from some guy named Dylan. Before she read the chat she looked at his profile.</p><p>Well hellooooo there, Mr. Firefighter. A thin line of drool formed at the corner of her mouth, an instant response to the picture before her. It was a professional picture, the guy wearing no shirt, a fireman’s hat perched at a jaunty tilt. Like a stripper’s picture in a firefighter’s role. Oh, God. I can’t date a stripper, she thought. He’d have nicer g-strings than mine.</p><p>But no – he was a real firefighter. The picture, he explained in his profile, came from a charity bachelor auction he was in. Bachelor auction? How much had he gone for? As she studied the picture she figured it had to be a solid four figures. Hell, she was ready to empty her life savings for a night with this guy.</p> <p>On a whim she Googled “Dylan charity bachelor auction firefighter” and her drool increased so much she would soon need a bucket.</p><p>Oh, holy hell. The image search showed the same man, whose name was Dylan Stanwyck, in firefighter’s pants, boots, a fireman’s hat and suspenders, perched on the floor of a fire station right next to the pole. He was leaning on one elbow and had smears of soot on him, with well-oiled muscles and a smug-ass grin. Whoever set up that photograph needed to be recruited for her company’s marketing department because damn – she was ready to use up every available dollar on her credit cards to get a night with him.</p><p>Maybe she could save a bunch of money and just set herself on fire. Or her car. It probably wasn’t worth much, but if she found out his schedule and whether he’d be the one responding...</p><p>And he was pinging her on the dating site? She dropped her coffee and scrambled to write back in the chat room.</p><p>“Hi,” she said, all inspiration and creativity vanishing as the heat forming between her legs apparently melted her brain.</p> <p>Hi. I’m Dylan. Nice to “meet” you. :)</p><p>Think, Laura. Think. Man, where was Josie? Of all the times for that girl to be on time to go to work. She needed help figuring out something witty to say.</p><p>Hi. I’m Laura. Nice to “meet” you, too!</p><p>She wrote back. Then he answered:</p><p>You’re probably on your way to work analyzing businesses, or businessing analysis, or whatever it is you do ;). I was hoping you might be interested in going out? We can do coffee, maybe? Or go to a nice tapas bar?</p><p>Tapas! Her favorite! But wait – Josie always said any guy who likes tapas must be gay. Laura checked the photo again. No way. And even if Dylan was gay, she would still sleep with him. Cute, polite, and loves tapas?</p> <p>Tapas sounds great! When?</p><p>Dammit! Now she sounded too eager. And then he waited. And waited. No reply. Shit! Maybe he was having second thoughts. Or she sounded like a moron. Or he realized he didn’t like tapas after all. Or he really was gay. Or this was his cat impersonating him. She began to pace, willing the chat bar to ping. If she stared hard enough, maybe it would come – now! No, now! Or...now!</p><p>Finally:</p><p>Uh, this might seem too eager, but I don’t care. I am free tonight. I work a 24 tomorrow, so this is my last chance for a few days. I don’t mean to be rude, asking you on short notice, but...please tell me you’re free tonight.</p><p>Yes! Yes, yes, yes, she wanted to write. But she needed to play that stupid game, the dance of meeting someone new. Her turn to wait. She reread his message. What was a 24? She puzzled over that one as she chewed on her nailbed, pulling on it until it bled. Brilliant! Screw up your manicure when you have a hot date tonight, Laura.</p><p>Might have. Might have. Don’t put the cart before the horse.</p><p>I am free. Prince William is now taken and so I have an opening in my busy social schedule.</p><p>She hit “Send” before she could change her mind. Too cheesy?</p> <p>LOL. Sounds great. Meet me at Tempo Bistro after work. At 6?</p><p>Tempo Bistro? The most expensive, chi-chi restaurant in town? Not tapas, either – something she couldn’t quite remember. Asian fusion? How on earth could a firefighter afford that? Not your problem, Laura. And she was making terrible assumptions. She needed to assume they were going dutch. Good thing she was a careful saver.</p><p>‘lo?</p><p>The chat window pinged. Geez, Laura. Get out of your head. She typed furiously:</p><p>Sounds even better. I’ll see you there and you know what I look like.</p><p>And he replied,</p><p>Oh, yes. :P</p><p>What was that supposed to mean? Her eyes swept over the clock – now she had eight minutes to shower. Damn! Laura just shook her head and walked to the bathroom, stripping naked by the time she crossed the threshold and turned on the hot water.</p><p>Sliding under the spray was bliss, the beads of water trailing their way down her body, her hair wet and ropy within seconds, the curl relaxed and the strands stretching long enough to tickle the top of her sacrum. Eh – why not leave the ad up? Who knew. Maybe she’d attract a better breed of guy. Or, at least, a different kind. She eyed the shower head – did she have time? Eight minutes?</p><p>More than enough for the last guy she dated.</p><p>Just enough time for some intimate attention from Mr. Showerhead, though. Josie was wrong. It wasn’t her battery bill that was getting expensive. Her water bill, on the other hand...</p><p>Good thing her vibrator was waterproof. As she soaped up she was cognizant of the time, knowing she had minutes to finish. Pulling up the old standby fantasy always worked. Two men, luscious and thickly-muscled, both in the shower with her. Mmmm...</p><p>The extra tip of her vibrator slid along the soft, sensitive skin of her clit as she perched one foot on the tub, opening up for access to slide in her fantasy lover, who was soaping her body with his sculpted, large hands, hands that smoothed over her curves, cupping her ass to pull him toward her, sliding his enormous cock in her while the other nameless, faceless lover kissed her, hard, his tongue lashing against her and exploring as the spray rolled down in rivulets between them, gathering at her folds and adding to the tease on her clit.</p><p>Her passage tightened as she imagined him bending down, on his knees, his tongue now lapping where the vibrator’s little antennae tweaked her, not her own hands moving the thick shaft in and out but the lovers’, four hands at once on her as one mouth descended on her eager, red nub, the other man thrusting her up against the shower’s wall, her body ready for more.</p><p>She tensed, knowing she was so close, craving all these hands, more than enough for two men who wanted and needed her, the familiar muscled cresting of her climax so innate she barely cried out, the release perfunctory but oh, so welcome.</p><p>And, now, the guilt. Because how could a “normal” woman really want two men at once? As she absent-mindedly rushed through the rest of the shower, quickly washing off her trusty toy, a persistent voice said, You, Laura. You.</p><p>She really did. Some wishes were never meant to be, she sighed inwardly, drying her hair and rushing to get dressed.</p><p>Just a fantasy that got her off.</p><p>It didn’t help that she felt like there was a huge discrepancy between what she saw in herself, and what she saw in the pictures of Dylan, and what she saw when she did a search for him online. This guy was a catch; not just a catch, but a catch. Like, the difference between catching a good size bass in a great lake versus catching a giant, enormous marlin. He was outstanding. There was no other term for it.</p><p>He looked like something that was sculpted by an artist and the more that she thought about it and the more that she mulled over it, the more that she was excited about it – the more it turned her into a quivering, uncharacteristically nervous pile of goo.</p><p>“I don’t think I can do this, Josie,” she said that night as she prepared for the actual date. Dylan had picked out a rather nice restaurant in a part of town that was above her pay grade, and she wondered how on earth he could afford it on a firefighter’s salary. But she wasn’t going to question it because maybe, just maybe, she had finally found somebody who was going to treat her properly. The way she had always dreamed of being treated, and not treated like a booty call or a person you’d settle for when you want something more.</p><p>“You’re more than ready and you know it, Laura. It’s about time you found some guy who...” Josie looked at the screen again. “Oh, dear, I don’t think I remember what I was about to say because I’m about to burst into flames if I look at that guy one more time.”</p><p>“He’s mine,” said Laura, baring her teeth in a fake show of territoriality. It wasn’t that fake, though. Some part of her meant it.</p><p>“I can look. I know I can’t touch, but I know I can look,” Josie joked.</p><p>Laura had picked out clothes, being as meticulous as possible today, trying so hard to cover what she felt were definitely deficits. Big enormous deficits. Calling her a fluffy woman would be a perfectly nice euphemism, if you didn’t prefer the term fat. Not fat in a derogatory way. Just fat as a practical, pragmatic way of describing how she was. It’s not like you get to be a size eighteen by meticulously eating 700 calories a day and never, ever doing anything wrong in terms of what you put in your mouth. She couldn’t stand it when people would claim that they’re fat because of your genes, they’re fat because they have a thyroid problem, they’re fat because because because because.</p><p>She owned it. She was fat because she put too much unhealthy stuff in their mouth and even of the healthy stuff she put in her mouth, she put in too much. And she didn’t really mind it – she liked food. She really, really liked food. Enjoyed it. Savored it. Pleasured it. Found it to be a joy in her life.</p><p>And she paid the price with the extra pounds, the padding – what a lovely euphemism that was, too. She liked her curves; the curves made her feel normal, gentle, open, emotional, bare. You couldn’t hide from a curve; you couldn’t hide from a love handle or from a padded hip or from a booty that made enough men blush and drool. She knew it was an asset (pun intended) to some guys.</p><p>What she hoped – what she deeply hoped – was that with a guy like Dylan, maybe, just maybe, she could beat the odds and find someone like him who really valued someone like her. So far that hadn’t been the case. Online dating had turned out to be a giant nightmare of electrons that didn’t line up exactly the way that anybody had planned. She seemed to photograph well because she got an awful lot of come-ons and she figured, you know, maybe there was something to that.</p><p>She was blonde, she had a healthy glow in her face and a pretty decent smile with two dimples that appeared when she laughed hard enough. Her shoulders carried some of her weight, but it just made her look bosomy and big chested, and if she picked the right form-fitting sweater she could come across a good twenty pounds lighter than she really was. And that may have been part of the problem, because it was always that look that the guys gave her when she walked into the bar, the coffee shop, the plaza, the restaurant – whatever public place that they intended to meet.</p><p>It was that look, that fucking look.</p><p>It was a look of surprise – and not good surprise. It was the look of, oh, you’re not what I was looking for. Oh, you’re not what you look like in your picture. Oh, you’re a fat chick. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Oh.</p><p>Sometimes they had the decency to tell her the truth and to actually say those things. Yeah, really – the decency. Because it was better to hear it up front, to her face, in her face even, than to sit down with that type of guy, to try to read the signals, the tilt of the face, the grin, the look in his eyes, the lack of a look in his eyes if he glanced away. All of the little tells, the way he held his hand, the way he fidgeted, the way he reached for his phone for a text that didn’t really exist. Those sights and sounds and smells and movements that added up to one thing.</p><p>Rejection.</p><p>And so far, she had had a few one night stands, a few guys who were willing to fuck the fat chick. But, you know, she didn’t turn them down because the offers were few and far between. Most recently, like she had told Josie, she was sick of it. Just sick of it. So this last ditch attempt really was the final gasp.</p> <p>Dylan seemed too good to be true. Here she stood in front of Tempo Bistro at 6 p.m. sharp wearing a pencil skirt, really nice high heels, and a mohair sweater, the same one she had worn in the dating site picture, just so she could – in her own head, in her own internal thoughts – not consider herself to have been falsely advertising.</p><p>Her hair was pulled back in the same funny little ponytail and her eyes were sparkling with hope that she dredged up from deep, deep inside, and plunked down in front of him, ready to try once more.</p><p>Getting ready for this first date with Laura had turned out to be a hell of a lot more complicated than it had any right to be. First of all, it turned out he got his dates wrong. His 24-hour shift was actually that night. Tonight. So he had to change shifts with Murphy, and Murphy, who wasn’t known for granting favors easily, not only extracted another 24-hour shift out of him, but also convinced him to give up his beloved Red Sox tickets for the next game. And Dylan reluctantly gave it up, hoping like hell that this date was really going to be worth it, really hating the sly grin on Murphy’s face.</p><p>Hey, he was taking a chance that maybe it really was worth it. Four different clothing changes later, he finally settled on something that he resembled “business casual” in the corporate world. She worked as a business analyst for some large nameless, faceless corporation and that meant that she probably had an expectation about what a guy would look like. Dylan’s general preferred state of dress was some old concert t-shirt from the 90’s, a pair of ripped up jeans and whatever pair of shoes were comfortable enough to pass muster.</p><p>Wearing business casual pants, a buttoned-down shirt, and – tie or no tie? He had finally settled on no tie. He felt like a fraud. If he just added some penny loafers and a loose cotton V-neck that showed the top of his chest he would look like something out of a Macy’s ad, which actually would’ve been possible ten years ago when he dipped his toe in the world of modeling before realizing that most of the people in that business were douche bags and he couldn’t stand it.</p> <p>“Hey, who died? You look like you’re going to a funeral, man,” said Mike, walking into the room looking pretty natty himself in a similar outfit, just without the black pants. Mike was wearing khakis and some kind of boat shoes that Dylan thought had gone out of fashion back in the 80’s, when he was a kid. The guy managed to make Superman look puny. He could have been a stunt man for The Avengers, minus the confidence. For whatever reason, Mike was a man without swagger. He just was, a steady presence that made Dylan feel complete.</p><p>“What about you, man?” he challenged. “Why are you all dressed up? You got a hot date, too?” He narrowed his eyes and peered at his roommate, wondering. Nah, no way. He didn’t. Mike hadn’t gone out in eighteen months, not since Jill died.</p><p>Mike grinned. “I wish. Meeting at the ski resort.”</p><p>“It’s July!”</p><p>“I know, but we start getting ready now, believe it or not. Some people actually plan out processes and don’t always fly by the seat of their pants.” He muttered the last sentence under his breath but clearly meant for Dylan to hear every word.</p><p>Dylan just shook his head and said, “I like being a pantser.” Big grin. “Have fun.”</p> <p>“I’d rather be doing what you’re doing,” Mike replied, then paused, seeming to think over what he’d just said.</p><p>“Me too,” Dylan laughed, grabbing his keys. “Don’t wait up for me.”</p><p>“I’m staying overnight at my cabin, so no worries. You have the place to yourself. I hope things work out with Laura. That,” he paused, brow furrowed, “that could really benefit everybody, huh?” Mike winked and the two hugged, Dylan forced to reach up to the only person in his life taller than him. And broader.</p><p>“Yeah, something like that,” Dylan said, shaking his head.</p><p>“Are you going to tell her about the money?” Mike’s voice was more defiant than usual, as if challenging Dylan to some sort of battle he didn’t even know was on the horizon. Dylan knew, though, that the tone in Mike’s voice was as much about his own demons; neither had ever expected this kind of surprise from Jill’s death. They would both gladly give it all up to have her back. Barring that, though, the money was certainly a welcome, if perplexing, change in their lives.</p><p>It meant nothing and it meant everything. Neither had said a word to anyone. Not a word to their friends or coworkers. Mike had quietly purchased the ski resort where he worked; it had been up for sale for a long time and was on the brink of financial collapse due, largely, to inept management and an owner who viewed it as a losing business. Mike would change that, Dylan knew. Having the money to buy the ski resort and one of the nicest cabins on the mountain had blown some life back into his partner. Too bad they didn’t have the third who would complete them, taking a dull dyad and turning it into a robust triad.</p><p>Maybe Laura would...ah, who knew?</p><p>“No, of course I am not going to tell her about the money.” Dylan turned away from Mike and finished pulling on his sweater. “Can you imagine that scene? ‘Oh, hi, I’m Dylan and I am a billionaire.’” He choked on the word, his face flushing and going cold at once, the syllables so fake. So poseur. Like a little kid dressing up in Dad’s dress shoes, or a teen trying on personalities to find the right fit. Except he had no choice here. Jill had left them this fortune and it was theirs. No trying anything on for size. This was serious money and Dylan and Mike had been catapulted from working class stiffs to billionaire bachelors.</p> <p>“Billionaire.” Mike lifted his chin, as if sniffing something. “It does roll off the tongue nicely.”</p><p>“Mike Pine, billionaire,” Dylan announced grandly, jumping on the bed and bouncing like a mad monkey. His hair flopped in his eyes and he watched Mike plant his hands on his hips, shaking his head, as if faced with a recalcitrant, hyperactive eight year old.</p><p>“You are such a child.”</p><p>“Yes, but I am a wealthy child!” Bounce bounce bounce – boom! Dylan jumped off the bed and bounded onto the floor next to Mike, like a superhero landing. Mike’s eyes went from amused to pained, then his shoulders slumped forward. Dylan rubbed the soft spot between his shoulder blades and they both stared at a spot on the wall that seemed to contain everything they yearned for.</p><p>“She left us all this money, Dyl. We had no idea.” Dylan shifted uncomfortably and said nothing. Mike picked up on his change, though, and turned to him with an accusing look. “You knew?”</p><p>Dylan dropped his hand from Mike’s back and sighed. “No. I didn’t know she was a billionaire! But I figured out pretty early on that she had money. We were in college, Mike. The dot com boom hadn’t happened, and she claimed to make money off ‘websites.’ How do you think she could afford to spot us on all those trips we took?”</p><p>“We camped and kept it cheap, Dylan,” Mike sputtered. “She didn’t live like a crazy-rich person.” Blinking hard, Mike started to say more but turned toward the dresser where Dylan kept a picture of Jill. The three of them on Cape Cod, at First Encounter Beach, the green marsh grasses so thick that hundreds of thousands of minnows lived in the shallow waters there, almost giving the water a viscosity of live, teeming fish. The ocean has been so perfect, the water warm though thrashing for a bay that day, and the three of them peered into the sun, some random stranger stopped and asked to take a pic.</p><p>A pic taken a month before they knew Jill had lymphoma. For the month after that trip she’d been fatigued. Not herself. Quiet. Waving away their concerns, she had trudged on, working on her “websites” and going for long runs that turned into long walks and that, finally, turned into a leisurely stroll during which she’d collapsed. Mike had been with her and carried her three city blocks to the emergency room of a hospital. The next few days were a blur Dylan couldn’t let himself resurrect.</p><p>Not now. Not as he prepared to go out with someone new. Someone vibrant.</p><p>Someone alive.</p><p>“Yeah, Jill kept a lot of secrets from us, Mike.” His partner bristled; the wound was still too fresh.</p><p>“So let’s continue her legacy, then, and keep the money a secret.”</p><p>“For now, sure. When the time’s right, we can talk about it.”</p><p>“Jesus.” Mike ran a shaking hand through his hair and stared out the window at the city below. “What a fucking curse.”</p><p>“And a blessing.”</p><p>Angry eyes met Dylan’s as Mike spun around. “Call it whatever you want.”</p><p>“It’s both,” Dylan conceded.</p><p>“It just is – you’re right. It’s both.”</p><p>“You get to save the resort. You know Jill would have been happy.”</p><p>“So then why didn’t she save it? Why, Dylan, didn’t she tell us she had all this money? I mean, damn! It’s not something you casually forget to mention. ‘Oh! That’s right! I’m part of the richest point-whatever-oh-one percent in the world. While you were complaining about your ski mountain going under, did that slip my mind? Oops!’” The sneer in Mike’s voice was utterly uncharacteristic and made Dylan recoil. Dude was pissed.</p><p>The anger, Dylan knew, was really a form of mourning.</p><p>“Tell it to Jill, Mike.” The words took the winds out of the larger man’s sails, his body literally shrinking before Dylan’s eyes. Jill’s ashes were on that very mountain Mike had just bought – a big reason for his purchase. Now he could have her forever, safe and sound and secure.</p><p>But still dead.</p><p>Mike bit his upper lip and nodded. “Yeah. I will.” Dylan was running late for his date and slipped out the door quietly. He was ready to move forward, to move on, to continue past the past. Someday – soon – he hoped Mike could join him.</p><p>He looked at his smart phone. Shit, he was already running late. No way he was going to blow this by making her think he was standing her up. A quick look in the mirror again, a little bit more cologne. A final check of his smile in the mirror and he walked out of the apartment and into what he hoped would be a part of his future.</p><p>Mike could stew in the past.</p><p>Laura wasn’t quite sure what to make of this as she paced a safe distance from the restaurant, trying to leave herself an out if she needed to save face and just disappear. A sink hole might have been better, but she couldn’t conjure one at will. Running away in shame, though, she was familiar with – so she skulked three storefronts from the entrance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He had said 6:00 and it was 6:07. Seven minutes normally meant nothing in terms of the wheel of life. But right now each second felt like torture and 420 tortures were adding up to one big ball of fear. And it all rested right in her gut where desire should be right now, where happiness should be right now, where joy and, well – not quite love, but at least lust should be residing.</p><p>Not this pit of despair.</p><p>It’s only seven minutes Laura, it’s only seven minutes Laura, she said to herself. The seconds ticked on until her smart phone clicked over and now it was eight minutes. It’s only eight minutes Laura, it’s only eight minutes Laura, it’s only eight minutes. A thin bead of sweat burst under her lip, and on her cheeks, and in that valley between her breasts in a way that only the cold irrational anxiety of dating could bring out in her.</p><p>Oh, fuck this, she said to herself. I don’t think I can do this anymore, even Mr. Hotty Hot Hot Firefighter isn’t worth this. I’m just going to go home and have a date with Ben and Jerry – that’s my comfort zone, right there baby. Maybe the most dependable men on Earth because this, this is bullsh –</p> <p>Zzzz, the phone buzzed suddenly. She had it on vibrate and she startled and it fell out of her hands, clattering to the ground.</p><p>“Shit,” she shouted, reaching down, scrambling after it and hoping that the screen hadn’t broken. Luckily, she had a protective case on it, and grabbed it and slid her finger across the screen to answer the call.</p><p>“Hello? Hello?” she said, trying desperately to keep her eagerness out of her voice.</p><p>“Hello,” a deep man’s baritone greeted her, with a friendliness that he had no right to offer her right now – yet she was so glad he did. “Uh,” he hesitated, “is this Laura?”</p><p>“Yeah. Yeah, it is,” she answered brightly, her voice a little too high-pitched, her anxiety a little too intense right now, but she trudged on.</p> <p>“Oh, yeah, really?” The voice stammered. “Yeah, this is Dylan. I am so sorry,” he said, and she hoped that the sincerity was true. Hoped it was true, needed it to be true with a part of her that knew...that knew that there was no way of knowing.</p><p>“I’m so sorry. I’m running late. I am walking down Twelfth Avenue right now, and, in fact, I can see the entrance to the restaurant and, wait a minute, ooh, I don’t know.” A low wolf whistle. “I don’t know if I’m going to be able to make it.”</p><p>“What? What? What did you say?”</p><p>“Yeah, there is this gorgeous woman just standing out there and, and I don’t know, I mean, I think – let’s see, she’s wearing a fuzzy sweater and a damn fine gray pencil skirt and heels that make her legs go on forever. And, I don’t know, you know, Laura – I may have to date her tonight instead of you.”</p><p>She nearly dropped her phone again. Oh, my God, her brain burned, her internal voice screaming like a rat stuck in a cage with Napalm all over it and lit on fire. And then she got it, calming down instantly. Oh, oh, he was complimenting her. He was joking. He liked her. Who was this guy?</p><p>Now she could see him. Deep breaths, Laura, she told herself. He was joking around. Being playful. Not mean. He was a block and a half away, walking toward her with a swagger, with a confidence she didn’t see in many men. One hand in his pocket, just marching down the street like he had all the time in the world. And boy, were his eyes eating her up. She could feel it from a block and a half, now a block and a quarter away.</p> <p>She was giving it right back.</p><p>Her heart was beating a million times a minute from the fear about his joke, and the anxiety that the joke had triggered. But now – but now it was like the electrons were playing between them. Molecules were flying millions and millions of miles a second between the two of them. She wasn’t sure what she was going to do when they actually stood two feet from each other, because she was ready to take him right there, right then on the street, public indecency be damned.</p><p>Pretty soon, just seconds later, he was down to a block, half a block, and he took his hand out of his pocket, giving her a wave. And she realized that he had been talking to her the entire time and she had no idea what he was saying.</p><p>“Laura? Laura? Hello, hello – are you there? I can see you and you’re just standing there. I am waving at you right now... Laura, have I mistaken you for a human being or are you a really hot store mannequin?” He heard her laugh. Aha. Keep going, Dylan told himself. Recover from the terrible joke.</p><p>“Or part of some performance art thing like that guys like me don’t understand? Were you Andy Warhol’s protege? Or is this some sort of flash mob set-up and nineteen naked members of the Pirate Party are about to appear and don Mickey Mouse masks in some geopolitical protest?” She suddenly folded and bent over laughing. He breathed a sigh of relief. Sweet!</p><p>That was it – she was forcing him to use every remaining brain cell in his body to process basic bodily functions as every red blood cell rushed to his groin. He couldn’t stop raking her body with his eyes. He couldn’t stop eating her with his retinas. She was some kind of Dylan magnet. Her entire appearance was luscious and her eyes – as he got closer he saw the kindness, the sweetness in them. There was a beauty, a full body, full-fledged gorgeousness about her that made him hard instantly.</p><p>“Stupid business casual,” he muttered to himself, mouth tilted away from his phone. He was wearing the kind of pants where his arousal could become very obvious.</p><p>Now that he stood in front of her, no more than a foot and a half separating them, he felt like the biggest idiot on the planet for even joking about not dating her. She was stunning, all curves and woman and he wanted to smell her, bury his face in that sweet neck, feel her in his arms and listen to her breath as he made her happy.</p> <p>What did her cries of ecstasy sound like? Would she turn her face away? Bite the pillow? Rake lines of ownership into his back with those glossy nails?</p><p>Later. Later, he would find out. The same confidence that had always been there for him told him so. Like a second person living in his head, it just knew. She was his, and she didn’t know it yet. But she would, and he had all the time in the world to teach her that.</p><p>With his tongue.</p><p>He just stood there and stared at her and didn’t know what to say; he couldn’t recite what went through his head as his eyes roamed over the perfect topography of her body. She stood there and stared at him and didn’t seem to know what to say, either. This silent dance needed a better beat.</p><p>One he could drive home with his –</p><p>Finally, she said, pointing to the door, “That is a great restaurant you picked.” Her voice as breathless as he felt. Except she was actually talking and he was standing there looking like a fish out of water, his mouth practically opening and closing as he tried desperately to get something like a linear thought going.</p><p>Where the hell was that confidence now? He wasn’t awkward or worried or any of those namby-pamby feelings Mike always described having. It was more that his brain had gone blank at the sight of her and everything but his arousal went into hibernate mode. She smiled and seemed to expect something intelligible to come out of his mouth, but first he had to dig his way out of the enormous, gaping hole of lust he’d just tripped into.</p><p>How in the hell was she still single? Why hadn’t someone snatched her up?</p><p>“It’s this whole Asian fusion thing. My friend told me it would be a good idea to bring a first date here and it might be a place to impress somebody. Not tapas, I know...” And the food is supposed to be amazing, but that’s secondary. She seemed so nervous, those glittering eyes wary, already on guard from his lame attempt at humor on the phone.</p><p>He felt like an ass, could sense he was losing her, and his charm system went into overdrive, not the shallow Dylan so used to getting a woman to step out of her pants within an hour of their first drink in a bar, but the slower burning Dylan who stumbled across Jill in college years ago and who felt sucker punched and euphoric all at once.</p><p>“So impressing me is more important than the food?” Laura laughed and looked at him with an uncertain caution in her eyes, a caution that he actually did not like but that spoke of something he couldn’t put his finger on.</p><p>“Yeah,” he said, a slow grin stretching over his face, the word more a promise than an answer.</p><p>“I don’t think you have to worry about someone like me,” she replied, looking away with a bashful smile, her blond ponytail sliding down the side of her creamy neck as if guarding her, creating a safe barrier and holding her in place.</p><p>He cocked his head, looked her over again and wondered what on earth was she was talking about. Standing outside the restaurant babbling like an idiot wasn’t exactly his idea of a good date, though, so he just motioned her toward the door and said, “Shall we?”</p><p>As she walked past him impulse took over and he put one hand on the small of her back as the maitre d’ held the door open. The feeling was so electrifying, his hand on her body, that he grew even harder. Impossible – she made his body defy the laws of physics. This was already more promising than he had ever expected.</p><p>Even if this dinner was going to cost him half of an entire paycheck, he did not care. He was not really relying on his paycheck anyhow these days, he reminded himself. Finances had changed radically eighteen months ago, a surprise that he and Mike still tried to assimilate. Stop it, Dylan. Stop thinking about Jill, he told himself. None of that should enter into the calculation of the emotional side of this. Tonight is about Laura.</p><p>As they were led to their table in a smoky-grey environment, with a giant twenty-foot golden Buddha lit up in the corner and a small fountain bubbling at its feet, all he could do was stare at her feet, trying to to figure out how not to sound like another one of those guys who was desperate enough to go on an online dating site and find somebody to fuck.</p><p>Neither one of them seemed to know what to say, so he figured, being the guy, he would take the lead. That’s how it would work in bed...and then his mind went blank at the flash of a vision of his face buried between Laura’s soft thighs, and he practically threw the folded napkin in his lap to hide what he thought must be the tallest raging hard on ever.</p><p>He coughed. “Your profile said you’re from Los Angeles, but you moved here to the east coast. Who do you work for?” Just then, the waitress interrupted as if on cue and asked them if they wanted a drink. Laura ordered a sake.</p><p>“Make it two,” he added. If she was going to go for the hard stuff, so would he. Boy, this could end up being a much more interesting date than he ever expected.</p><p>She felt like she had lost her entire vocabulary all in the past three minutes. This guy was incredible. He had taken her to the hottest place in town. Granted, his friend has recommended it, but who cared if that was the main reason why? Already, this date exceeded her experience on every other date.</p><p>Dylan seemed to care, to take the time to make a good first impression, and she loved his sense of humor even if it did nearly lead to her early demise from a heart attack via misunderstanding. She had never been taken anywhere so nice. Of course she could never tell him that. Most of the guys who dated her took her to a restaurant that had 50 inch plasma televisions blasting five different sporting events all at once, and the most gourmet item on the menu was fried mozzarella sticks. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She blanked when the waitress asked her what she wanted to drink, so she blurted out sake, because it was the one drink she had ever had in an Asian restaurant years ago, when her mother had taken her to a Hibachi restaurant for her twenty-first birthday. Well, hey, sake it was. She figured one shot would loosen her up. Then she could show more of herself. With Dylan joining her, she knew she’d ordered appropriately for this type of restaurant and began to let herself unclench a little.</p><p>She glanced at the table and saw that she really was revealing more of herself already. Her sweater had dipped down a little too much to show the black lace of her bra and when she looked up, she found that she did not meet Dylan’s eyes with her own, but that he, in fact, was staring at the same spot she had just been looking at.</p><p>Apparently, he was not enough of a gentleman to pretend that he was not – until he cut his eyes away abruptly, threw his napkin in his lap, looked down at the menu, and said, “I have no idea what any of this stuff is.” Then he turned and craned his head to watch one of the servers take a tray over to a nearby table. “Whatever it is, though, it smells incredible.”</p><p>That loosened her up more, her nervous laughter shifting into something more genuine. This incredibly pretentious, but really sophisticated and startling special few minutes felt like it already altered reality for her. Laura couldn’t quite put her finger on it, but was trying very, very hard not to make more meaning out of these few perfect moments with Dylan.</p> <p>A giddiness, unfamiliar and not fleeting (to her utter shock), filled her skin and her thoughts as she shyly caught his eye and let it settle, not looking away. Their stare deepened into something more primal, more knowing, and her insecurity faded as they communicated without words.</p><p>Interrupted by the waitress, she pulled her eyes away with regret as she brought their drinks. Dylan held his up in a toast and said, “To...business analyzing!”</p><p>She nodded acknowledgment, and answered, “To firefighting,” clinking glasses before they put down the empty shot glasses. She fingered the rim of her glass and then they both leaned forward on the table with great expectation.</p><p>Finally, she realized he expected her to answer the question he had asked what felt like hours ago, and she said, “Oh, oh, I work for Stohlman Industries.”</p><p>“Stohlman?” His expression showed he was impressed. That pleased Laura – it was impressive. Stohlman was known for being very, very competitive for jobs, and it had been hard to break in to the world’s third largest media company.</p> <p>“Yeah, yeah, I’ve been there well, since I graduated college.”</p><p>“Really? What your degree then?”</p><p>“IT – Information Technology.”</p><p>“But you’re a business analyst?”</p><p>“Yeah, I work with the tech side of things.”</p><p>He leaned back in his chair, folded his arms, clearly making himself comfortable, and gave her a mirthful look. “So what do you do?”</p> <p>She laughed, feeling her face relax, feeling her cheeks spread and match his mirth. “Do you really want to know? ‘Cause it’s awfully technical.”</p><p>He leaned forward on his elbows, propped his chin in one hand and said, “Yeah, I do want to know.”</p><p>She studied his eyes. He meant it – he really meant it. Oh, man, was this really the whole package? Did she really get a gorgeous, ripped firefighter who gave a shit about what she did for a living as a business analyst for some nameless, faceless, mega corporation? If so, she didn’t want to pinch herself, ‘cause this might be a dream. Then again, there were parts of her that she certainly wanted him to pinch.</p><p>Clear the mind. Whoa there, Laura.</p><p>“Well, I work in healthcare IT, and what I do right now is work on a large project for one of the state governments, making sure that their old medical records program for children who get health insurance is compliant with new federal guidelines.”</p><p>He nodded. Made an expression with his mouth that indicated that it was interesting and then said, “You lost me at children’s health insurance...” and he grinned.</p><p>She chuckled. “Enough about my job. What do you do? You’re a firefighter, right? So you pretty much save damsels in distress from burning buildings and rescue cats out of trees? I don’t have to really know more than that,” she teased.</p><p>He laughed, bright teeth gleaming, straight and perfect, speaking to orthodontia many, many, decades ago. His eyes twinkled a bit as he fingered his empty sake glass and said “It’s a little more complicated than that, but you got the gist of it.”</p> <p>“Aw, come on. Tell me more. How is it more complicated? Are there, like, different levels of fire fighting?” The words came out of her mouth and she felt a slow, electric feeling creep up her spine as his fingers crossed the table and reached for hers, his fingers clasping hers, the warmth shaking her, going all the way up her neck, through her hips, into her belly.</p><p>Rendering her completely speechless once again.</p><p>“Well,” he said, peering down at her hands and then looking at her with raised eyebrows that asked an obvious question. She grinned back. He softened and clinched her hand just slightly more, and the added pressure was like having her hand turn into one big, giant, throbbing clitoris.</p><p>“I do plenty of shifts where I rescue cats from burning buildings and help damsels in distress out of trees,” he joked, “but mostly, these days, I am in charge of fire management safety protocols for large corporations like yours.”</p><p>“Really?”</p><p>“Pretty much. After 9/11, we had to really tighten up on how you empty out a thirty or forty floor building, especially in the face of a disaster, or in the face of massive, multi-level, widespread fires.”</p><p>She could feel the blood drain out of her face. He has just, without knowing, dredged up her biggest fear. Something in his face said that he knew it. “Oh god, I am so sorry, really. I did not mean to upset you. Did you lose someone in 9/11?”</p><p>She shook her head. “No, no, actually I, it’s just that – ” She took a deep breath. In through the nose, out through the mouth. “It’s just that it’s one of my biggest fears. I’ve always been afraid of a fire in my building, and I work on the thirty-second floor.”</p><p>He took his hand away form hers and clamped it over his mouth, shaking his head now, saying, “I pretty much just picked the worst possible thing I could bring up during a first date, didn’t I?”</p><p>Her heart rate resumed a normal beat. She took a risk now and reached across the table to retrieve his hand and said, “No, it’s OK, really. If nothing else, it’s interesting that you managed to tap into that about me, after having only known me for –” she glanced at her smart phone ” – for fifteen minutes.”</p><p>“It’s amazing what Google will help you figure out.”</p><p>If she had had a drink in her mouth, she would have spit it all over him. Oh, my God, did he Google her? It’s only fair – she had Googled him. Did he know that she had Googled him? Oh god, was there some way he could have known?</p><p>“Laura?” He reached out and touched her chin, tipping it up to catch her eyes. “That was a joke.”</p><p>By the time the waitress brought his meal, which was something that he could not only not pronounce properly, but, by the looks of it, couldn’t even guess at about half the ingredients in it, he felt like he was losing her. Idiot, idiot, idiot! How could he have brought up the burning building scenario on a first date? Within fifteen minutes, no less? God, the look on her face! It was like something collapsed. There was more to it than she was telling; he could see that and it left him with too many questions, inquiries he couldn’t make right now because he was being too stupid for words.</p><p>Yet here he was, babbling on about it like it was no big deal, and that’s what he did for a living, and ha ha ha, and here she was, you know, in charge of saving little kids’ health insurance policies.</p><p>She began to eat her food. He dug into his. Even though he didn’t like it, he welcomed the silence, perplexed by the contradiction but lately his entire life seemed to be one big steaming pile of complexity. He watched her. He took the dinner as an opportunity to just keep an eye on her. To see what she was like. To see if she was...what her body language would give away.</p><p>She kept pulling on the shoulder of her sweater, correcting everything so that the edge of her black silk bra wouldn’t show, and every time she did it, a little part of him tugged. Mostly in the crotch area. But also in his heart. Because, man, was he lovin’ that little piece of black lace right now.</p><p>He forced a mouthful of something that he was afraid might still be half alive in between his teeth. And then, “Mmmm!” he groaned. “This is incredible.”</p><p>“Yeah, mine’s luscious.”</p><p>So are you, he thought, spearing a piece of fish and holding out his fork. “Do you want a bite of mine?”</p><p>He held the fork out for her and she looked at him in a certain way, eyes narrowing a bit while cocking her head, one little curl floating out of her ponytail as she tucked it behind her ear and leaned forward. Her lips enveloped the fork, her mouth tugging at the piece of food as he reluctantly pulled the fork away, those lips, those lips closing over the fork. Right now, he wanted part of him to be that fork. A very big, throbbing part of him that no napkin was covering.</p><p>Chewing, she groaned; it was the sound he wanted to hear later at night in his bed or in hers or on somebody’s couch or hell, in the alley by the parking lot at this point. Dylan’s cock strained against his trousers, more aroused then he ever imagined possible, just from watching her eat that scrumptious piece of God knows what.</p><p>“Isn’t it incredible?” he asked.</p><p>“That’s perfection. Where does it comes from?” she asked.</p><p>He glanced over at the menu and replied, “Malaysia and, apparently, Tibet.”</p><p>“Oh, a Malaysian, Tibetan piece of perfection,” she said, then crinkled her brow with a bemused look. “Fishing in Tibet?”</p><p>He shrugged. “The monks have to do something.” A diner at one table over frowned at them and Dylan just let it roll off.</p><p>Laura speared something else on her plate and lifted the fork to him. He took it, eagerly, greedily, eating something he didn’t even understand, but, watching her, his eyes boring into hers, realizing that this meal was just the appetizer and he was going to have the main course later on.</p><p>Oh, holy cow, she’d never been treated like this before in her entire life. In fact she was a bit concerned that she was leaving a wet spot on the upholstered bench and that she had soaked completely through not only her thong, but also her pencil skirt and pretty much through the outer layer of the bench’s covering, the pad, and into whatever store was beneath this restaurant because this guy was not just hot, he was flaming and how appropriate that he was a firefighter.</p><p>She could see it in his eyes too. Whatever was going on, there was a kismet here that really shouldn’t be happening. After they exchanged their bites, like a cross between “Lady and the Tramp” and a porno movie, she realized that she was going to go home with this guy. Laura was going to sleep with him and she was going to like it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>From the look in his eyes, he was in the same place mentally, too. Hopefully physically. They both seemed to sort of hurry through their meal and the conversation finally resumed after they had finished eating.</p><p>“Do you want another drink?” he asked, reaching for her hand again, now that it was free from eating dinner.</p><p>She wiped her mouth with the napkin using her other hand, set it down, and said “Um, I’m still too full. Maybe we could go for a walk?”</p><p>“Actually,” he said, looking away, “I had planned something else, if you don’t mind.”</p> <p>“Oh, really? What’s that?” Breakfast? She stifled the thought, terrified she had actually blurted that aloud.</p><p>“Turns out there’s a really a nice cruise here in town that I was hoping we could go on.”</p><p>“Oh.” She looked at her watch, trying to hide her churning emotions. Oh, man, it was already late. A cruise. She did some quick mental math. A couple of hours on a cruise meant there was going to be no down time – she had to work, had to get up at 6:00 in the morning, and that meant blowing out the whole night. First date. Calm down Laura, don’t be a slut, don’t be a slut, don’t be a slut, she told herself.</p><p>Don’t sleep with him on the first date, don’t sleep with him on the first date if you want a second date. OK, OK. OK. Josie’s voice entered in her mind. ‘Don’t sleep with him, Laura. Don’t do it, don’t do it, don’t do it. Unless he’s incredibly hot.’</p><p>Oh, yeah he is. Oh, yeah he is.</p> <p>She had this entire conversation in the period of about three seconds with herself, with Dylan looking at her with a very puzzled expression. Angel Josie and Devil Laura argued inside her head until she realized she needed to respond to Dylan’s comment.</p><p>“OK, yeah, sure! A cruise sounds great. Did you already get tickets?”</p><p>He squinted and furrowed his brow, confused. And then his face went neutral. “Oh, no, actually, not yet. I just figured we’d go there, and, you know, climb on.”</p><p>You can climb on me, she thought. Her eyes widened. Hopefully, those words hadn’t actually come out of her mouth, because at this point, she didn’t know the difference between thought and spoken word as she squirmed and straightened her shirt again. The black lace seemed to jumped pop out like an erection. Which, if she could have seen his package from across the table – she suspected that he had his own little version of the black lace pokin’ out somewhere in his pants.</p><p>The waitress brought the check and she had that internal dialogue that all single women have when going out on new dates. Do I offer to pick up the check? Do I offer to go halfsies? Do I...</p><p>He didn’t even give her a chance. He grabbed the check, handed a credit card to the woman, and waved it off. Turning to her, reaching for her hand, he said, “Thank you for a lovely date. Or, thank you for a lovely meal.”</p> <p>“Oh, well, my goodness!” she said, a little taken aback that she didn’t even have an opportunity to fight for the check.”Well, thank you so much! I mean, I, really, I, can I, I’d like to offer to the...”</p><p>He nodded. “You can get the next date.”</p><p>“Oh! Oh!” she said, his words sinking in, finally. “Next date.”</p><p>He couldn’t read her. It was driving him nuts. He just couldn’t read her. Had he gone too far with the next date thing? Was she offended that he was suggesting she pay for the next date? Mike had suggested that there was a great way to handle women who tended to have good solid careers; you didn’t know exactly how to handle the awkwardness of who paid for first dates. He had his own thing about paying.</p><p>When he took women on dates, he had more than enough money these days now that he had come into his trust fund, which he had always viewed as a bit of curse. Now he viewed the money as one hell of a blessing, because if it meant that he could treat a woman like Laura right, then maybe he and Mike could have the future that he had hoped for. Then it wasn’t just a blessing.</p><p>It was everything.</p><p>Discomfort gnawed away at him. How he had come into his trust fund was an issue he had not begun to explore, he and Mike the recipients of an annual income equal to approximately 2.7 percent of the $2.2 billion in the massive trust, split in half. The trust manager had laid it out in such clinical terms that Dylan had nearly vomited on the spot, the words twenty-nine million and change per year for life, minus management fees, pinging around his skull like a racquetball that never stops.</p><p>And that was two months ago. He still drove the same car, still worked his full shifts, but splurged in little ways, the enormity of his new-found – literally! – fortune not quite sinking in.</p> <p>Mike had bought a cabin on the slopes. Cabin wasn’t quite the right word. Haven was more like it, a four bedroom ski palace that he knew would keep Mike happy for the rest of his life. The ski resort, too – which had been almost an after thought. Oh, yeah, I can save the struggling ski mountain I love, because I have more money than God now. Well, almost.</p><p>As Dylan caught Laura stealing shy looks at him, his money problems (twenty nine million of them per year) faded and he started to wonder if she could keep them happy for the rest of their –</p><p>“Dylan? Ready to go?” The waitress had taken the check, cleared the table, and was practically pulling out the vacuum to clean their spot.</p><p>The meal paid for, they stood and he put his arm around her waist. She leaned into him just enough to finally send him a signal that told him, Oh, yeah, and off they went outside. He reached for her hand, intertwining his fingers in hers. As they walked toward the boardwalk, he realized they weren’t going on that cruise.</p><p>God, her scent was intoxicating. He couldn’t believe that her unique mixture of perfume, musk, and soap fused together to produce this. Even better – he knew that there were other scents, other tastes that would be more divine if he could get there tonight.</p><p>Dylan stopped, finally, bursting at the seams with his own internal dialogue, his own body’s cravings, and just looked at her and decided that he needed to be as forthright with her as he had been with most people throughout his life, because these games weren’t cutting it anymore.</p><p>Time to make his move.</p><p>He leaned down, caressed her jawline with his right hand, and brought his lips to hers. She responded, pressing her body against his until everything, from breast to hip, was his, pushed into him, and anything he felt for her was extremely obvious right now.</p><p>They definitely were not going on that cruise.</p><p>Cruise? What cruise? She had no intentions of going on a cruise. As his kiss deepened, lips parted, as their tongues danced, she found herself roiling in ecstasy inside, going so far as to be twisted into a cliche, one leg lifting up as she stood on her tiptoes, even in high heels needing to stand on tiptoes to match him in his kiss.</p><p>His hands roamed her back. She returned the motion, her fingers splayed across the broad, muscular expanse of his shoulders, his hands cupping her jaw now, pushing, needing, needing....</p><p>“Ah,” he said, his voice gravely and thick with desire, “Can we take a pass on that cruise?”</p><p>She dipped her head down and laughed softly. “Good thing you didn’t buy those tickets after all.”</p><p>Cocking his head, he looked at her with smoky eyes and asked, “Do you have a car parked nearby?” She knew what he was asking, his words code for Can I take you home and fuck you without worrying about your car getting ticketed or towed?</p><p>How sweet. Most guys didn’t care.</p><p>“No car. I took the train today.”</p><p>Nodding, his smile widened. “I drove, so let’s take my car to my place? For drinks?”</p><p>Whoo – eee. Laura swallowed hard, knowing that this was really it. He wanted to sleep with her, was inviting her back to his place for it, and she ran through her mental inventory. Clean lingerie? Yes. Shaved legs? Yes – she’d been optimistic. No car? Yes.</p><p>Birth control?</p><p>Oh, shit. She was on the pill, but had forgotten to take it a few days ago. Missing one day shouldn’t hurt, right?</p><p>Hopefully he had a condom.</p><p>His puzzled look told her she was taking too long to think. “I would love a drink.” And then he leaned in for another kiss, the move more certain now, his hands on her more demanding and visceral, claiming her and marking her arms, her neck, her lips and ass with his hands, his touch, his caress.</p><p>She was his tonight, and that had to be enough for her. He was hers for whatever he gave, and as the kiss heated she felt her core warm, clit throbbing and eager for what his tongue was promising right now, exploring her as his hands roamed her back and neck.</p><p>People were staring now; as she opened her eyes the onlookers tittered. She pulled back and wiped her mouth, embarrassed.</p><p>Dylan just grinned, leaned in and said, “Let’s stop giving the jealous bastards a show.” Her laughter rang down the street to the parking lot where his Audi sat.</p><p>When she climbed in it smelled like a campfire.</p><p>Blasting the local 80s station on the radio, they rode back to his place in silence, his hand planted on her knee whenever he wasn’t shifting, the fingers playing a melody of lust and creeping higher up her thigh until they arrived at his apartment complex. It was a skyscraper made of glass and steel and it screamed money.</p><p>How in the hell did a firefighter afford this? As if he heard her thoughts, Dylan muttered, “I have a roommate.”</p><p>“Oh.” Disappointment flooded her. Maybe he really did just want to have drinks? No guy ever, ever invited her to his place to share some vodka and Coke, though. Not even the true assholes who beer goggled their way to fucking a fat chick they despised in the morning.</p><p>Relief took over her disappointment when he smiled a wicked grin and said, “But he’s gone for the night.”</p><p>Getting out of the car, walking up two flights of stairs and wandering down Dylan’s hallway was a blur. Laura vaguely heard his keys rattling and then a fierce, hot mouth was on hers, Dylan’s thick forearms scraping her shoulders as his hands slid up her jawline, behind her ears, fingers nestling in her hair and pulling her blond curls loose.</p><p>His tongue explored her mouth with such precision and his hips pressed into hers with intent. Gasping, she inhaled sharply as he pushed her up against his open door and took her mouth greedily.</p><p>Without a word he maneuvered their entangled bodies, closed the front door, tossed his keys on the floor and had her in his bedroom in seconds. No complaints here, Laura thought, and that was the last rational idea she had as he went straight for her clit.</p><p>No pretense, no artsy coyness.</p><p>“What are you – ?” she gasped. And then, oh wow, he went right for the center of her heat, the briefest of touches so profound she nearly came all over his lips, in an instant. Her thong slid down her legs as if an unseen force stripped it off and then –</p><p>“Ahhhhhh,” she groaned, practiced arms reaching under her hips, establishing his power. Using his forearms, he guided himself to her clit, freeing one hand to touch her there, slipping a finger into her pussy and caressing so that it set off unexpected waves of pleasure.</p><p>It was like a dream come true. She had resigned herself to guys who went down on her like their Novocaine was wearing off. Lips flapping and trying to do one thing but accomplishing nothing more than drooling. Who was this man? This? This was like being made love to by a silk mouth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her body flushed red and hot, the fire focused on her hot nub as he teased it, slowly growing the release within, entering and pulling back with two perfect fingers. Her thighs twitched and shook, and she knew she would come like a freight train soon. She buried her hands in his hair, sinking her hands into him, pushing his face in tandem with her need to strum her to the next level –</p><p>“Oh, Dylan!” she murmured, fucking his tongue, which licked her, hard, dead centered on her nub. His tongue opened up, hot flesh on hers as he gave her focused and expansive flesh play. Two different sensations tipped her completely over as every muscle tensed, her dripping hole clinging to his finger, riding his face like a stallion, his tongue working hard to keep her frenzy going.</p><p>“There! Right there,” she groaned, hands curling into fists of orgasm, body flailing as she murmured over and over, “Oh, God! Oh, God!” She was self-conscious; most guys didn’t just do this. They might flirt a bit with the clit, but they didn’t engage so fully. So, uh, deeply. He clearly enjoyed this. Reveled in it. And as he picked some perfect rhythm for making her come, she realized she was being played by a sex virtuoso.</p><p>Give in to it, Laura. Give in, she told herself, hoping he didn’t care about her fleshy belly, her curvy ass. All worry faded as she orgasmed and realized she had never thought this was possible, had never been in the hands of a master like this. Keeping her pussy on his tongue, he maintained, tongue pushing and withdrawing, getting every last bit, as her muscles unclenched, her gasps subsiding, little sounds of exertion fading into pants of disbelief and awe.</p><p>He looked up and grinned, sliding his hands up her body, following her curves. One hot kiss full of her taste geared her up again, her clit and pussy clenching so hard she climaxed yet again simply from the kiss, her hips pushing into him, her juices in her mouth, his mouth, the scent so arousing that she was actually coming from a kiss.</p><p>The taste of Laura was so much more detectable than anything they had just eaten at dinner. Instinct drove him to kiss her again and just as he was ready to make his next move she surprised him by taking the lead. She reached for him with a familiarity she had no right to, the skin on his aching cock so soft and eager, rising up to meet her and loving her boldness. Laura deftly massaged his thigh with her other hand, cupping his balls, pressing against the base with her thumb, a deep groan growing out of him unbidden. Oh, man, did this woman know how to touch him.</p><p>She licked her lips with intent, boldly staring him in the eye, then looking down and drawing out the wait, making him hold his breath with the agony of anticipation.</p><p>She held the base of his cock with one hand and began licking him slowly, flicking the tip until he groaned again, hoping he could hold out until they were ready to make love, his body so ready to dive into her flesh, to grab those curves and to luxuriate in her lush presence.</p><p>Taking him in inch by inch, she tongued him until he twitched. Licking the front of his cock below the head and then gulping him even deeper into her mouth, flicking her tongue against him, she made him tighten and release his breath, hips shifting as he moaned at the feel of her mouth around his cock.</p><p>Her hand gently masturbated him while sliding her mouth up on his cock, making sure he felt the inside of her cheek, her tongue and her lips, not really sucking but milking him. Milking him. Oh, shit, at this rate he’d come in her mouth, and as seconds passed that idea became increasingly appealing...</p><p>One of his hands touched her head, stroking her hair encouragingly even as he struggled inside, fighting the pleasure she was draining from him, torn between wanting immediate release and craving the feeling of being in her.</p><p>Building up the speed almost excruciatingly slowly, she played him like a damned instrument, and as his fingers tightened in her hair her silky locks felt like another layer of possibility, her hair casual and comforting and just right – like everything else this night. She gently touched his balls and he felt his juices begin to ooze out into her mouth, so that she gasped even with his pole in her mouth, the combination of moist heat and cold, rushing air too much.</p><p>The sound of her voice vibrated his cock in her throat, her lips kissing her own thumb and forefinger, wrapped like a cock ring, was Dylan completely enveloped by her. Nearly screaming, he sat up and grasped her head, grinding his hips in and out as she sucked hard, then let go, in rhythm to get him off. She completely enveloped his root with her lips. He panted, overtaken by this gem, his hands roaming over her gorgeous breasts, her hair falling in waves over her face as she mouth fucked him, and the better part of him stopped her, wanting to give her more.</p><p>But holy hell, she was a master at this.</p><p>Second date, Dylan, he told himself. Second date.</p><p>Am I really giving head on the first date? Laura wondered, her mouth working the magic she knew she possessed. She was good at this. Really good. A fleeting thought, pretty girls don’t need to do that, shot through her mind and she willed it away. Giving a blow job wasn’t about being pretty enough.</p><p>It was about control.</p><p>And until Dylan had stopped her, she had him completely in her spell. And liked it.</p><p>His fingers sought out her arousal, discovering her wetness. “I want you, Laura. I need to be in you,” he murmured, her eyelids fluttering shut and her brain bending into a pretzel, twisted by a sudden lust, a lushness to his words, their presence, this now that made her want to immerse herself in Dylan forever.</p><p>You would think she would be sated from what he had done with that skilled tongue, but a new wave renewed within. She wanted every inch of him, however he was willing to give it. Laura needed to impale herself on him, to ride that shaft, to feel his body on top, to have his hands on her, in her, over her – whatever her – and she wanted to exert control once again, to be controlled, to just –</p><p>Have more.</p><p>Shoving him on the bed, she put her legs on either side of his hips, the rasp of leg hair and flesh like music to her ears, his mere touch connecting her to a confidence she enjoyed. Aiming him carefully, she hovered over him, savoring the seconds, his eyes locked with hers, the skin around them warm and inviting, and she plunged herself directly over his gloriously-thick shaft. He was eager and pulsing, and she groaned when he went all the way in.</p><p>What she wanted to say was something profound, the right words to match what her body was screaming. Instead, she sighed, “Oh, Dylan,” for the feeling was indescribable, a denouement, emotional and psychological, all at once. Like a real hole being filled, finding a being so strong it could fill it.</p> <p>She stretched up to his tip, sliding up his pole a sweet sensation, moving toward a screaming orgasm more amazing than any before. He licked one hand and stroked her nipple; he was spasming her pussy. Moving slightly, changing everything, she slid enough to make him beg, tightened her cunt, then plunged down again.</p><p>“Laura,” he groaned. “You have a magic pussy. You are so, so tight, so warm,” he convulsed. She sighed, the feeling too intense. She didn’t have a mind, just an ass he grabbed and nerve endings and her fullness.</p><p>He took charge, both standing now, bending her over the bed, tummy down. So many guys liked to fuck her this way; was it because she was so big? Did they enjoy the view of her curvy ass? Or – she pushed the negative thoughts away, for his hands roamed over her, owning her, telling her she was most wanted. One hand slid him in as he took her doggie style, his other hand in her hair. She reached for her clit as he dove into her, face buried in the bed.</p><p>She thrust back against his cock, the pleasure so insane, the force of his tip against her cervix making her scream. She clenched the bedsheets, her fists tightening, her finger finding her clit a swollen, hot mess ready to explode.</p><p>“Ah, GOD!” Laura screamed and screamed and rutted, an animal of need as wetness hit her, knew she was spurting, felt him jerk and jizz, filling her with his semen, her pussy one big fuck bucket, as he screamed.</p><p>“Ah, Laura! Fuck me!” He couldn’t speak any longer; she stopped thinking and her body tried so much to come as hard as it could, her flesh determined to work with the magnitude of climax.</p><p>He pounded and pounded, she thrust back, he stroked her belly and created a tiny pain, the pain all blending with the creaming and the cum to split her voice into something fierce and low, until all that was left was a drained feeling, all sex and candy and heaven.</p><p>They came down, little aftershocks from the remainders of their sex, Dylan still in her as he melted into her, trapping her, their wetness all she knew. She stopped thinking; her pussy was done, her body relaxed, all sated.</p><p>“Oh, man...” he mumbled into her back, hot breath ticklish and sweet.</p><p>She turned around and pressed into him. “And that is how it should be,” she replied, a wicked grin plastered across her face as she kissed him.</p><p>How long had they been asleep? Laura wondered as she peered into the grey darkness, Dylan’s arm covering her bare breasts, the sheets tangled between them.</p><p>The post-coital haze lessened and reality sunk in. She realized that they were here in his apartment, and then it was – Oh, no!</p><p>When she checked her smart phone it read 3:22 a.m. What was the right thing to do? Should she stay? She looked down at this tender, precious, hot, naked man who had just devoured her in every way possible, and felt a giant rippling sense of guilt.</p><p>He seemed to be into her in this whole one night-stand thing. She was frankly accustomed to bringing the guy back to her place and then having the guy leave right after everything was over. So, this was new territory for her and she wasn’t sure. Should she stay? Wake up early and make him breakfast?</p><p>As she looked around his bedroom, she started to notice pictures. Pictures of Dylan with a woman on the beach holding surfboards, a woman in a stringed bikini, and then another picture of the same woman in a sport bikini playing beach volleyball. Then another of what looked like the same woman standing at the ski slope along with another man, the guy wearing goggles and a helmet. Yet another picture of the same woman on the snowboard doing some sort of flip in mid air.</p><p>What the fuck? Her heart started to pound. This was all wrong. He was definitely – this was just some one night-stand. Was that his wife? His girlfriend? Who? Every insecurity flooded her, everything poured into her, and here she stood completely naked in the moonlight, staring over this guy who had just given her the best four hours she had had in years.</p><p>It was all a lie. A big, fat lie.</p><p>She scrambled to find her thong, her skirt, her sweater, her bra – where was it? Found it somewhere across the room hanging off of a doorknob of a closet.</p><p>Had they really been that, uh, acrobatic? Apparently. As the feelings all merged into one big bundle of sheer fright, she found herself flooded with shame – shame and despair. And most of all a massive adrenaline rush that just kept screaming, get out, get out, get out, get out, get out now.</p><p>She tiptoed, holding on to the straps of her heels, making sure she had her purse, her scrunchie pulling her hair together quickly so she didn’t look quite as ridiculous as she felt as she handled the walk of shame, clicking the door as quietly as possible.</p><p>The hallway was empty as she tiptoed down the stairs in her stocking feet and then finally found herself outside in the cool night air, the streetlamps illuminating, indeed, her walk of shame back home. Fortunately, there were cabs floating around at 3:30 in the morning hour now and she grabbed one, completely ignoring every comment that the cabbie made, hoping like hell he could read the fact that she had leaned back against the bend of the backseat and closed her eyes, wanting to be left alone. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alone was safer.</p><p>Laura used every spare molecule of energy and focus to still her heart, to calm it back down to where it belonged, in the normal, boring, slow pace she’d experienced before the whirlwind of Dylan. She should have known it was too good to be true. Every damn moment of it. He just wanted a piece of meat on the side. A big piece of meat. A little variety was the spice of life, right? Her body was so different from his girlfriend’s, a sleek, muscled, athletic sculpting she couldn’t imagine.</p><p>Damn, damn, damn, – here came the tears. They weren’t the great big heaving sobs that she felt after dating someone for months and then realizing that it just wasn’t working. This was more of the scalding tears of reproachment, of the fact that she should have known better, and of a bit of giddiness that she’d gotten something more than she’d expected out of the evening.</p><p>Dinner and mind-blowing sex was great, but apparently what she had had with him was all she was going to have, because he was clearly involved with whoever that woman was and that woman had a bod that went on for miles. Damn, if she had ten percent body fat, she’d be amazed. If that was his type, what was Laura? Just some cow he decided he’d grab onto for the hell of it, trolling some dating site. Whatever.</p> <p>The screech of the cab’s brakes told her it was time and then boom – she felt the car jerk to a stop. She handed the cabbie enough of a tip to make herself feel good and to make him grin, and to wish her a good night, a good morning, a good whatever. As she headed up to her apartment her shoes vibrated like a gong, click, click, click, her legs propelling her on on very weak heels, very tired calves, very tired everything. Mind, body and soul.</p><p>She peeled off her outfit, poured herself into her big oversized flannel pajamas, and just crawled into bed to sleep the sleep of the conflicted.</p><p>Dylan was accustomed to waking alone, Jill’s side of the bed a cold place, a sexual Siberia, but he had hoped to find Laura there this morning. Making her breakfast and having her be his breakfast had been on his mind as he’d faded off to sleep, cradling her in his arms.</p><p>Hopefully, she’d left a note. Maybe she needed to rush off to work. He understood. It was hard to juggle shifts and bosses and –</p><p>His eyes stopped as they landed on a picture of Jill. Hawaii. About seven years ago. Her skin glistened in her wet suit and she grinned a relaxed, happy smile as the sun kissed her nose, Mike standing next to her, turned toward her and showing the camera only his profile, face largely hidden. He was a good foot taller than petite Jill. Their hair had lightened so much on that vacation, though Dylan’s dark locks had stayed the same. By the end of the week Jill and Mike were hooked on surfing, while Dylan...</p> <p>His thoughts faded as the enormity of Jill’s death hit him. In some ways, her death was still striking blows. Good ones. $59 million blows a year.</p><p>He, unlike Laura, would never have to worry about getting to work on time again. Man, even letting himself think like that made him queasy. It was a sick, sick way to become rich – losing your soulmate – and he was still so angry at something – God? Cancer? Fate? His own helplessness? – that he just wouldn’t quit the fire station, preferring to act like a working class slob because until two months ago, that’s exactly what, and who, he had been.</p><p>The masquerade of normalcy was important. Necessary. Especially now that he was dating Laura. Until he knew she cared for him as the old Dylan – before trust fund – he needed to play it cool.</p><p>Sitting up, he stretched his arms over his head, willing blood to flow into his biceps, triceps, popping his elbows and slowly stretching out his neck. His hips ached just a little, the good kind of ache from a nice, deep, intense session of lovemaking. He grinned, the smell of her still on his sheets, her soft skin nearly still there, brushing against his chest. Laura was soft and sweet and sighed like it was all some kind of dream, as if his touch were new. He’d been tender with her, but detected a little something extra, a naughty streak. He’d been right and reveled in the discovery.</p><p>If he texted her now would that be seen as too pushy? Too stalkerish?</p><p>Who cares.</p> <p>Grabbing his phone, he dug out her number and texted.</p><p>So you went home and all I got was this morning boner. ;)</p><p>Silence. Give it five minutes, Dylan, he told himself. Standing, he let the sunlight stream in through the window and wash over him, his naked form tight with need. A bottle of lotion and a nice hot shower could kill off his arousal. Even better, though, would be a date tonight.</p><p>Nothing. He knew it seemed way too desperate, but he looked up her number and dialed. No answer. Not even a voice mail message. That was supremely weird, because the only reason you couldn’t leave a voice mail on someone’s phone was if they blocked you.</p><p>Cold rushed through his body, his flesh covered with goosebumps in seconds. Blocked? Why would she block him? He took a really good look around the room and let himself inhale, then exhale, a few times. Centered, he thought carefully through the last twenty-four hours.</p><p>He had found her online. Asked her out. Scheduled a dinner at the hottest restaurant in town. Found her attractive and the feeling mutual. Made a move, invited her over, hand mind-blowing sex (which he wanted more of) and had fallen sleep spooned with her in his bed.</p><p>Waking up, he was alone. He texted her. He called her – and now it appeared she had blocked him.</p><p>Blocked?</p> <p>That had to be a mistake. He called again. It rang twenty-eight times before he hung up. Where was Mike? Oh, that’s right – at his cabin. He had decided to clear out so Dylan could have alone time with Laura. Except now Dylan had tons of alone time – with himself. Not the kind of private time he was hoping for.</p><p>He popped on the computer and opened a chat window at the dating site. She wasn’t in his “Favorites” any more. Huh? He ran a search – now Laura Michaels. It was as if she had vanished.</p><p>Blocked?</p><p>And, in fact, she had.</p><p>Beep-beep-beep! She whammed her hand on the alarm button, but it was elusive; a little too far out of her grasp, but instead she whacked the heel of her hand on the corner of her end table and listened to her own yelp of protests.</p><p>“Damn it.” She opened her eyes, giving the machine a glare meant to melt circuits. 6:00 a.m. – time for work. Really – had she really only gotten two and a half hours of sleep? Shit.</p><p>She stood up, forced herself to stretch and then wondered why she felt so sore, so sticky, so –</p><p>Oh. Dylan’s tongue on her clit, lapping in circles as his finger slid in and out, her legs on his shoulders and – That’s why. She closed her eyes and sighed heavily, letting emotion wash over her and just feeling it, knowing that blocking it out, denying it, or pushing it aside would do her no good.</p><p>Let it be and it would fade. Force it away and she’d carry the pain forever.</p><p>What she had thought might have been just wasn’t meant to be, and she had to accept that. Too good to be true, really – the night was some sort of magical, very authentic encounter with a hot guy way out of her league.</p><p>But that was OK. It was OK. It was a new day and she reached for her smart phone, confirming the time and then seeing that she had about twenty-seven texts from Josie, and she’d have to answer those later. Josie would make her spill everything, tell all, and would congratulate her for refusing to accept second best.</p><p>Right now, though, Laura needed to wallow. And that, like so much else, was OK.</p><p>Her coffeemaker gurgled, the tell-take signs that the pot was just about finished. She had forgotten that before the date she’d set it all up just like she always did, had come home from work and set up the coffee for the next day. She was grateful as she sloshed the coffee into her mug and sat down, booting up her computer to check email, today like any other morning, although, she knew deep inside it really wasn’t.</p><p>Dylan, Dylan, Dylan, Dylan, Dylan.</p><p>Laura popped into her email, ignored a bunch of ads, found nothing of real value in there until suddenly she noticed that the online dating site had sent her a message. “You have a new request to chat.” Yep – boom, boom, boom, boom. A hugely full inbox.</p><p>She had seventeen new requests to chat. Yeah, right – they wouldn’t be chat requests, but rather fuck requests. Thanks, guys, I’m all chatted out and my fuck request meter is broken.</p><p>She knew it was fine, deep down – last night was all that she needed. That’s what she wanted – she wanted more of last night. The magic. The thrill. Being charmed and charming someone back. Falling into that special knowing and feeling warm and safe and excited all at once, the heady passion of the new.</p><p>And then the image of the pictures all over Dylan’s room filled her brain, that woman, his girlfriend, his wife, his whatever. He didn’t wear a ring, but that didn’t mean anything. She had learned that within her second or third date after college. The married men always lied and they tended to be the slickest – and this guy was pretty slick. Laura took a deep breath and – and it almost tasted like he was in her, as if his scent had permeated her lungs, as if it coated her trachea, as if –</p><p>Inhale. Exhale. She breathed in, she breathed out – breathed in sadness, breathed out happiness, breathed in sorrow, breathed out joy. No matter how hard she tried, though, it wasn’t cutting it. Caffeine would have to do what meditation could not, no matter what her yoga teacher said about the evils of coffee. You can pry my caffeine from my cold, dead, outstretched hand.</p><p>She sucked down the cup of coffee, poured herself another and thought what the hell and clicked on one of those chat messages in email. Hmmm. Hey there, Mike, she thought to herself. Some guy named Mike wanted to meet or wanted to chat with her. Mike – let’s see, he’s 32, 6‘5”, 180. Sounded like a runner. Online dating was devolving into ordering from a menu. Would you like fries with that?</p><p>There it was: “likes to run marathons and works at a ski resort.” Oh, dear – her idea of running was waving madly at the bus driver and sprinting when she was late for the morning bus, and skiing? Lodge. Hot toddy. Not snow.</p><p>Deleting his message would have been the easiest thing in the world, and her finger even hovered over the button, but something stopped her. If Josie had been there and asked, Laura couldn’t have explained it. She just...stopped. Clicking to his profile, she read up on him. He looked kind of like the mirror opposite of Dylan. This guy had sandy blonde hair and Nordic features while Dylan was Italian and dark and swarthy. Mike looked long and lean in pictures of him riding a bike, shots of him crossing finish lines, and pictures of him camping.</p><p>Camping. She shuddered. Her idea of camping was no mint on the pillow. She wasn’t sure this was going to work. And then she read his little intro about himself:</p><p>“Hi, my name is Mike Pine, I am 32 years old. I am really new to this online dating thing. I am very active and athletic, work at a ski resort, I teach skiing and also work on the first aid team. In my spare time, I like to run and camp and bike, and I’m looking for friendship or more, whatever and would like to chat with other people who are interested in the same thing – ”</p><p>Beep-blip! A little chat window popped up and Laura splashed coffee on her hand in surprise at the unexpected sound. “Ow!” she shouted, grabbing a kitchen towel and shaking it out. “What the hell!?” She peered at the now lit-up screen, a familiar chat window open in the right lower-hand corner. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Oh, geez,” she sputtered, her words echoing through her empty apartment. Somehow he had figured out she was online, ‘cause this was a chat from Marathon Mike himself.</p><p>“Hi, there. Are you on right now?” he wrote. Oh, God, she still had the smell of Dylan on her and now she had some new guy coming after her? What a slut she was. She thought about that for a second. The word slut didn’t really apply to her, ever. It was more that she was trying on new behaviors.</p><p>Let’s try this one on for size, she thought.</p><p>She typed back, “I’m just drinking my coffee and getting ready for work and I logged in and saw your message, so hi!”</p> <p>“Oh, good morning! Yeah, I’m not really functional without two or three cups of coffee myself,” he wrote back with a little grin icon.</p><p>Hmph...yeah who isn’t, she thought.</p><p>Laura chugged the rest of her mug’s contents and typed, one-handed, “So I see you’re like, Mr. Triathlon and ski dude, and my idea of exercise is walking across the room to get the remote.”</p><p>He wrote back, “lolol, yeah don’t be afraid, we could just go for a hike if you want. Oh, I think I just asked you out. Yeah I did,” and then he ended it with a question mark.</p><p>“Oh, man,” she muttered. She stared at the glowing screen, dumbfounded, her empty coffee mug dangling precariously off her right index finger as she absorbed this. What was this? Did she hit the good-looking guy lottery? Out of the blue, she just – oh, she had just totally ditched Dylan in his bed last night, and now she had some guy who looked an awful lot like the lankier version of the actor who played Thor hitting on her, but deep inside she decided she was trying on this new act, and she would just go for it.</p> <p>Just go for it, Laura. What can it hurt? A swell of physical memory from last night made her warm between her legs, made her skin flush with the recall of Dylan’s hands. She wanted more. And if she couldn’t have more of him, she might as well have some of Mike.</p><p>“A hike yeah, I’d like that. That sounds really cool.” And she breathed in opportunity, and breathed out rejection, breathed in despondence, and exhaled chance.</p><p>Chance favors the prepared. Laura was more than ready.</p><p>At least, that’s what she told herself.</p><p>Continued in part 2, Her Second Billionaire..</p><p>A sample:</p> <p>SHE DREW A LINE WITH A ONE NIGHT STAND</p><p>When Laura Michaels got one hot firefighter pinging her for a date after joining a popular online dating service, she thought she had won the lottery. A night with Dylan Stanwyck, professional (firefighting) hunk and former model, had been too much. Fearful her curves would turn him off like so many other guys, her pleasant surprise turned to white-hot passion as she broke her own rule and slept with him on the first date.</p><p>That turned to regret when she awoke in the wee hours of the morning and found pictures of a hot, buff surfer-type woman with Dylan plastered all over his bedroom. Taking the hint, she made the walk of shame home, deleted him from her contacts and chalked it up to experience.</p><p>To her shock, within hours a new guy – Mike Pine, a ski instructor and marathon runner with a body and face like an actor in a superhero movie – messaged her and asked her out. Lightning struck twice in 24 hours! Laura was incredulous but, emboldened by encouragement from her best friend, Josie, she took the plunge and accepted the date.</p><p>HE WANTS TO BE LOVED ON HIS OWN</p><p>Mike likes simple things. Skiing. Running. Being outside. Uncomplicated love. Good food. For nearly ten years he, Dylan and Jill had a simple love that was achingly easy on the inside, and oh, so complicated from the outside. It worked, though, and made him whole – until Jill’s lymphoma diagnosis and her early death.</p><p>Reeling, he and Dylan just took their lives day by day, and sometimes hour by hour, mourning their great love. Broken, Mike descended into a world of punishing athleticism, clocking 14-hour days on the slopes and 100+ miles of running a week, the pounding of his legs on pavement strong enough – he wished – to pound out his pain. What he and Dylan had never expected was what came more than a year after Jill’s death: an inheritance. From her family’s trust fund. More than $1 billion each, with a perpetual income that made everything go from simple to chaotic.</p><p>What Laura doesn’t know is that Dylan and Mike are roommates. More than roommates. And they are looking for a third in their relationship. More than a third...but Mike has something to prove, first, and snagging this first date with her is just the beginning.</p> <p>Read on to sample Her Second Billionaire:</p><p>Had she really just made a date less than three hours after sneaking out of another guy’s bed? She opened up one of the 17 texts from Josie which, as she scrolled through them, appeared to all be variations of, “Please tell me about the hot guy.”</p><p>So she finally decided to put Josie out of her misery and typed out, “Hey. Awesome night. Will tell you the deets later,” hit “Send” and almost instantly got back a response.</p><p>What do you mean later? Hell, no. I’m coming over.</p><p>She wrote back:</p><p>Can’t. I’m late for work as it is. Let’s just say I need a shower this morning.</p><p>and hit send.</p><p>Squeeeee</p><p>was Josie’s reply. Do you have another date?</p><p>Do I have another date? Oh yeah Josie, I have another date. It’s just not with the same guy. Ugh, how was she going to tell her this? God, she, she needed two showers. One to wash off Dylan and the other one to wash off her own skank.</p><p>This was getting ridiculous. She typed back:</p><p>There’s a lot to this. Will write more later. Come over after work.</p><p>She hit “Send” and just turned her phone over, leaving Josie hanging, and padded into the shower. Indeed, it was time to wash off Dylan and her own... er... her own sense of ambiguity? Indecision? Disappointment?</p><p>Revelation? For she had learned so much these past few days, mostly about herself. In some ways, she was surprised to realize, it didn’t matter that Dylan was with someone else. In the past, that would have crushed her, but now – now she felt a renewed sense of power. Of strength. Stripping down and turning up the temperature on the shower’s spray, she felt her body melt into the hot water, the sting of the jets tearing her away from her looping thoughts, putting the focus back on her body. Rivulets of water streamed over her breasts, down her belly, with its gentle curves and lush skin, pooling at her V and sliding down her thighs, a familiar heat rushing into her womanhood.</p><p>It may have been only a few hours since she’d left his bed, but his mark really was on her. Closing her eyes, she remembered his touch and felt an incongruous sense of guilt. Guilt? He’s the one who had a girlfriend or wife? Yet here she was, scheduling a date with a stranger hours after having Dylan in her. On her. All over her.</p><p>The detachable shower head was about to earn its keep. She knew exactly where to aim it, her hands practiced when it came to masturbating. All her normal fantasies, though, weren’t cutting it – not the dream about Jake Gyllenhaal, or Matt Bomer, or even Zach Braff. Instead, her mind drifted to Dylan. And Mike.</p><p>As she parted her labia and zeroed the jet spray on her clit, she fought the image of Dylan. And Mike! Both? Yet nothing made it go away. Her body responded to the mere idea of it, of both of them at once, of four hands, two mouths, two cocks all focused on her. Laura. On her needs, on her pleasure, on her discovery. Ahhhhh...</p><p>This was crazy! She hadn’t even met Mike yet. Had crawled out of Dylan’s bed just a few hours ago, resolved never to see him again. Why was she letting them dominate her fantasies? She still had Dylan’s juices in her, his saliva dried on her, his kiss and skin and lips all – well, now that the water washed the night away, that wasn’t really true, but her neck tightened as her breasts swelled, her hands holding the shower spray in one hand, centered straight on her clit now, her other hand parting her labia and two fingers slowly entering her, the balance hard to achieve but easier as she propped one foot up on the edge of the tub and leaned back against the shower wall.</p><p>Her fingers encountered slightly sore flesh, her mouth spreading with an unexpected grin as she recognized why it hurt a bit, why the water’s sting was so bittersweet. Ah, Dylan – he had been thick and huge and gentle and rough all at once, knowing exactly how to press her skin, tweak her tight spots, play her body to perfect orgasm over and over with his tongue, his lips, his fingers, his hands, and that gorgeous, veined cock.</p><p>Now she had a face for her menage fantasies – Mike’s. Why not? Live a little, Laura. No one knew what went on in the privacy of her own mind, her own shower, and as she sighed deeply, the pressure of everything vanquished, she felt a familiar heat and bliss rise up in her as the water pulsed its way into her soul, her clit crying out for more, her fingers sliding in and out of her tight pussy not in a heated rush but, instead, slowly, stroking that spot on the top that always made her clench just a tad harder, made her breath hitch, made her imagine it was Mike’s fingers in her, Dylan’s tongue strumming her clit, both men eager and ready to enter her at once.</p><p>“Mmmmm,” Mike moaned in her ear, his thick, wiry runner’s body sliding next to hers in the shower, beads of water darkening that blonde hair, toned arms lifting her up and plunging her down on his ready cock. And then – was that Dylan’s mouth on her ass? Then gently parting her cheeks as Mike lifted her, had her straddle him across the waist as he effortlessly held her in place, strong legs bending slightly so Dylan could...</p><p>She snaked her pinkie finger down so it played with her puckered anus, the mere touch of her fingertip on her perineum enough to tip her over, imagining Dylan filling her, double entry almost too kinky to even let herself dream about.</p><p>“Ah, God, Laura, more,” Dylan groaned behind her, his cock inching slowly inside her ass, Mike’s tip pushing hard against her cervix, her body entombed between them as the water sprayed down. When Dylan’s mouth found her earlobe she –</p><p>Exploded. The shower head, her pinkie finger on her anus, her fingers exploring her g-spot, and her dream all combined to make her bend down and scream as a mad rush of orgasm pounded her instantly, no warning, no teasing, just a wall of everything that left her gaping, her mouth open and her throat hoarse as she let it all unleash, her shoulders twitching and bashing into the wall, her hands moving and milking this for everything she could find, her mind filled with images of Dylan and Mike simulfucking her, their faces strained and cumming, too, all from her. Her body, her presence – her.</p><p>And then – nothing. Like a switch flipped, she pulled her hands out of all her orifices, turned the shower head off, washed up fast and got ready for work. Sated, but not distracted, she shifted from horny, bewildered single on the dating scene to Business Analyst for the megacorporation.</p><p>That wouldn’t last more than a few minutes, for she knew her mind would wander, soon. For now, though, it was a welcome and much-needed break.</p><p>Mike had no idea what he was supposed to say as he stared at the chat window. This was so out of his element and Laura seemed so out of his league, but he knew he needed to do something. He couldn’t let Dylan be the one in charge of yet another woman. They were supposed to share her – that was the entire plan. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So he typed, “lolol, yeah don’t be afraid, we could just go for a hike if you want. Oh, I think I just asked you out. Yeah I did,” and then he ended it with a question mark.</p><p>And when she typed “Yes,” he couldn’t believe it – and panicked. Now he actually had to step forward. Dylan had always gone out and found the women and had been the one to find Jill, and no matter how desperately they both missed Jill, Jill was gone and they had to accept that.</p><p>Laura was pretty much the opposite of Jill, but he could see what Dylan saw in her. That was a sweet smile. She seemed accomplished, and there was something Mike couldn’t put his finger on, a genuineness and authenticity, but he and Dylan were not exactly the most conventional package.</p><p>So he worried that maybe a business analyst at Stohlman Industries wasn’t going to make the cut – or maybe he was more worried that they wouldn’t make the cut with her. The office cubicle type wasn’t exactly eager to go out on the slopes or to even watch him at mile marker 20 during a marathon, in his experience.</p> <p>But Dylan was giving it a good try and Mike had to, too. The problem was that Mike had to do it in secret. He typed in a few more words, they scheduled the hike, and then she disappeared, off to whatever corporate job she had in whatever floor of whatever giant skyscraper downtown. That world was so alien to him; he worked at a ski resort, and in fact he was missing it already.</p><p>You don’t work there anymore, a voice inside him said. You own it...</p><p>The season hadn’t started yet, but he looked forward to it. He always did every year and when he wasn’t skiing he was running. Between the two he kept his sanity somehow, for over the years he had learned that the endorphin kick that came from running and from the massive double diamond trails in the winter were what he needed most. Jill had fit in nicely with his life and with Dylan’s life, spending time running with him. Man, was she an ace on the slopes, too.</p><p>She and Dylan had an affinity for action movies, for cooking and...he let himself get nostalgic, even let his eyes well up with tears. Letting the memories flood him was dangerous, his mind tipping over from nostalgia to deep grief, a mourning he’d only recently been able to emerge from, the slam of Jill’s inheritance making him ache all over again.</p><p>His body was consumed suddenly by grief at her loss. It hadn’t been running, it hadn’t been skiing, it hadn’t been any of Dylan’s crazy antics like sky diving or parasailing that had killed Jill.</p> <p>It had been one cell that mutated and mutated and mutated until finally it had taken over her body, the lymphoma wasting her away and neither of them had gotten over her death from eighteen months ago. In some ways Mike had gotten over Jill even faster than Dylan, though Dylan had been the first to go out and find somebody to sleep with. Mike hadn’t – he just hadn’t. Couldn’t.</p><p>Eighteen months, though. It had been a long dry spell and he was getting frustrated. Now he finally felt emotionally ready to at least give this a try, and he was more than physically ready. Who knew what the hike would bring? All he knew was that he had to try, and he had to try on his own. He couldn’t be the tag along with Dylan. That had complicated their relationship with Jill for far too long. And it wasn’t until it was too late that Mike realized that it actually hadn’t mattered. He had loved Jill. Jill had loved him and they both loved Dylan. And the three of them had made it work, somehow, in their own crazy way.</p><p>Now the question was, could the three of them – this time with Laura – make it work? He was getting ahead of himself. All that mattered was having one hike with the woman. He just needed to see if this could be his future – their future.</p><p>Huff, huff, huff. Laura was more out of shape then she’d ever imagined. Her idea of exercise was lifting her hand from her mouth to the bag of Doritos or lifting the spoon out of the pint of Ben &amp; Jerry’s. No, she chided herself, that wasn’t really true. She took the stairs at work, and that wasn’t a joke, considering the fact that she worked on the 32nd floor. And she and Josie power-walked around her neighborhood (Josie jokingly called it their Mugging Prevention Program), but this kind of sustained prolonged, effort that used muscles that involved the hard work of climbing actual inclines while hiking along the trails and the woods? This she wasn’t used to.</p><p>And that was OK. Really. Mike was a sweetheart who slowed his pace down and who was absolutely, fantastically interesting. Talking about everything from books that Laura hadn’t read since college, but had always loved, to movies – who knew he had a Christopher Guest obsession, too? She couldn’t wait for a second date where they could sit and watch Best in Show, and she could enjoy having that someone finally who appreciated the humor.</p><p>She was getting ahead of herself.</p> <p>And she really liked that.</p><p>“Laura, are you OK?” Mike asked, a look of concern covering his face as she wheezed slightly while rounding a bend and staring at the tall hill leading to the summit.</p><p>“Oh, I’m fine,” she lied. “Just not used to these tall hills. I’m, you know, more accustomed to doing eleven street blocks downtown. I’ll be good.”</p><p>He smiled and stared at her. “You’re a good sport, you know?”</p><p>“I have to be. I don’t think I have the oxygen to run away.”</p><p>They both laughed in unison and Laura felt a warmth spreading through her. She couldn’t quite believe the way that the past two days had gone. First, she’d had an absolutely amazing date with Dylan. She could still feel him on her skin, even though she had slunk out of his apartment doing a walk of shame like she wouldn’t believe. Then again, it wasn’t exactly her fault that he had pictures of his current girlfriend all over the place. And now here was this golden boy, smiling at her and standing there like Thor at the gates of Asgard, taking her on a hike.</p><p>Mike was about as opposite of Dylan as you could possibly get. Tall – if he was shorter than 6‘5” she’d be surprised – blonde, maybe Danish, with piercing blue eyes and the lanky body of a thirty-something guy who walked like he was seventeen and still a little awkward. Just looking at his body told her he was a true athlete, and he had told her himself he was a ski instructor, so obviously he was coordinated. She, on the other hand, felt like a giant cotton ball right now. A sweaty, huffing cotton ball. Who wanted nothing more than to relax in a hammock with a pitcher of sangrias.</p><p>And an oxygen tank.</p> <p>Yet here she was, about a quarter mile from the summit of some crazy-ass hill that he wanted her to climb to the top of. She could expand her horizons. This was something new. He was sweet, quiet, kind of taciturn – but not in a bad way. Nothing was awkward. Nothing was uncomfortable. He was just was a man who didn’t talk too much. He preferred, obviously, to act, to move – to move up that damn hill. Which she now stared at as if she were looking at the top of Mount Everest.</p><p>“So, we’re really going to climb up that?” she asked, trying to keep the skepticism out of her voice.</p><p>“Yep, we really are!” he grinned. “But,” he patted the log next to him where he’d sat down, stretching out his long legs. “We can take a short break.”</p><p>“A short break?”</p><p>“OK, a long break.”</p><p>“Whew,” she said, collapsing on the log next to him, trying to suck in her belly at the same time as her hamstrings cried out in relief.</p><p>Laura suddenly felt like a complete ass. Not exactly experienced with dates like this, she’d overdressed and now, many miles into this hike, she was dripping with sweat, her hair limp and plastered against the edges of her face, her body flushed with the heat and the exertion of this long hike of this crazy tall hill. She felt about as feminine as a wet tissue and yet that kernel of woman in her did have a spark of femininity, because she was responding to Mike in ways that shocked her.</p><p>Her body should have been spent from the night with Dylan. But rather than finding herself halting or tentative, it was as if what she had done with Dylan the night before had opened her up like a flower blossoming, giving permission to show its true colors and to spread itself in full glory and right now, Laura was ready to spread herself again.</p><p>Easy, girl, she told herself as she stole another look at Mike.</p><p>What was it about these two? Dylan was incredible last night and yet she’d already crossed him off her mental list of eligible partners because the guy obviously had a girlfriend or wife. Who keeps the pictures of some gorgeous woman all over the place in their bedroom otherwise? So less than fifteen hours after sneaking out of Dylan’s house and doing the walk of shame, she found herself with yet another incredibly hopeful relationship staring her in the face.</p><p>Literally. She looked up and realized that Mike was watching her, his head cocked to the side, a little half grin making him look boyish and absolutely adorable. “What are you thinking, Laura?” he asked.</p><p>“Uh...” she stammered, completely unwilling to tell him what she was really thinking. “Oh, I was just marveling at how beautiful it is here.”</p><p>“Yeah, it’s amazing isn’t it?”</p><p>“So you work here?”</p><p>“Well, yeah, in the winter, but I just thought I’d bring you up here on a hike right now, because the canyon looks so much better. Different – when it’s not covered with snow and skiers. Actually it’s kind of nice to be here when I’m not on duty and worrying about some teenager who breaks a leg or some eight year old who can’t grab the tow rope properly and gets dragged up the hill.” He chuckled and she joined him. That was the most she had heard out of his mouth in one continuous stretch since she’d met him.</p><p>He just seemed so good-natured, he didn’t talk much, was kind of quiet and she liked that. It was really different from Dylan, who was so gregarious, open and extroverted. There was a quiet depth to Mike that she found refreshing. Most guys she’d met on the dating site were either out for a piece of ass or out to just sit there on a date and talk themselves up. Nobody had ever asked her out on a hiking date and she was starting to realize that this guy was different, this guy was special, and she hoped she was special enough for him.</p><p>“Shh!” he said, grabbing her arm suddenly, the pressure of his fingers more urgent than arousing. “Look!” he hissed, pointing into the woods. She leaned into him, craning her head to see what he was pointing to. She could smell him this close and he smelled like pine and sweat and something more – a sporty musk that seemed to turn on her inner sensors, making her instantly flushed, a lump forming in her throat that told her that there was definitely a spark of chemistry here.</p><p>“What is it?” she asked.</p><p>“There – do you see it?” Two deer stood deep in the woods munching on the bark of a tree. The mother perked her head up, turned to her fawn, and looked back at Laura and Mike with a precision only animals could possess. The doe nudged her baby and the two ran off into the woods.</p><p>“Oh, wow,” Laura said. “That’s really beautiful.”</p><p>The pressure of his fingers lightened, shifting from a grab of urgency to a lingering touch that asked a question his mouth couldn’t – or wouldn’t – ask. Two seconds, Laura, she told herself, two seconds to just start to breathe before turning and looking at him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>When she turned, body perked like the doe’s, heightened by animal instinct, he saw it in his eyes, too, as Mike leaned down and took her lips with his. </p>  </body></html>"]