["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I grew up in a small house in a lower-class neighborhood, just my dad and me. My old man worked a blue-collar job with shit benefits. I can't complain too much though, because I never went hungry and always had a roof over my head.</p><p>No, my dad didn't hug me every night or read bedtime stories by the glow of a nightlight, but he fed me, clothed me, and didn't knock me around. That's more than some of my friends had, so I was grateful. I hadn't known then, growing up, that there was anything more in life to want.</p><p>I was fifteen when my father left just after dinner to buy a pack of cigarettes. He never came home.</p><p>My dad was shot in a convenience store parking lot after he gave the wrong guy the wrong look. He walked down to get some smokes and didn't take his wallet, just five bucks for the cheapest pack he could get. He was shot at point-blank range, no cigarettes or money found on his person.</p> <p>He was listed as a John Doe at the morgue. There was no burial and no identity when he moved from this life to the next.</p><p>I was on my own for a week before anyone realized I was alone. I was smart enough to keep my mouth shut, to get up and go to school every day. I figured I had at least three or four months before a bill collector came knocking, but the nosy bitch across the street hadn't seen the old man in a week and was \"worried.\"</p><p>That's when I began my life in the system. It's not like on TV; when you're an orphan in an after school special, they ship your ass off to a relative and everyone lives happily ever after. In real life, though, if you don't have family that wants you - or family at all, you become a ward of the state. Sure, they have foster homes and pretend families that some kids get to live with, but there are a shit-ton of homeless kids and few foster families available. Many foster parents are in it for the money, so they aren't exactly the best option, either. Typically, you're stuck in a group home with other kids in the same messed up situation as you and a revolving door of caregivers. However, I had a bed to sleep in, clothes on my back, and I was not a victim of abuse. It wasn't all that different from living with my dad.</p><p>At eighteen, Children's Services kicked my ass out. There were lots of kids to take care of and not a lot of money. Luckily, I'd gotten a job at a grocery store as a bag boy at sixteen and began saving. I wasn't stupid or naive enough to think the state was going to take care of me forever. I was fortunate enough to have graduated from high school before I got the boot; some kids had to worry about finishing school in addition to being homeless.</p><p>My father told me many times I couldn't depend on anyone but myself, and I never realized how right he was before the day I was truly on my own.</p> <p>With my savings in hand and a promotion to stock-boy, I got my first place. It was the cheapest place I could find in a neighborhood without bars on the windows. It was small and dirty, but it was mine. There weren't gunshots whizzing by my windows or the sounds of screaming every night, so I wasn't about to look a gift horse in the mouth.</p><p>My life hasn't changed much in the past three years. I get up every morning, walk to the grocery store, clock in, work a ten hour shift, clock out, come home, mind my own business, and do it again the next day.</p><p>I don't have friends because they create lots of complications and drama. I spend my time at work smiling at the customers and doing my job. Co-workers ask me out from time to time, but the truth is I don't have extra money to have a few beers with the guys or take a girl on a date. I'm always careful with my rejection. There's no sense in hurting anyone's feelings when it's not necessary. Plus, it would lead to questions I'm not willing to answer.</p><p>I'm sitting alone at my thrift store kitchen table, staring down at a day-old cookie. It's my twenty-first birthday today. I don't have any plans, and there are no cards in my mailbox. I'm having dessert for breakfast, a treat to myself, and I'm thankful for what little I have.</p><p>It's sad as hell, but I don't have any candles so I light a match and jam it in the middle of the damn cookie. I don't even make a wish before I blow out the tiny flame so it doesn't burn down and ruin my treat.</p><p>No sooner than the flame's gone out, there's a knock at my door. I look at my dollar store wall clock and see it's only nine. I can't imagine who would be at my door this early on a Saturday morning. Most of my neighbors sleep in after a late Friday night.</p> <p>Even though I'm twenty-one, I tend to think of myself as more mature than most people my age, so when I open the door and see a girl, petite and fragile in appearance, I automatically think she's young. She may even be my age, maybe younger, but my experience makes me feel like I'm over thirty, so she seems like a girl to me.</p><p>She's standing there smiling as if she doesn't have a care in the world, obviously not knowing people around here don't smile. I peer at her through the ripped screen of my front door as the heat and humidity of the day filters in.</p><p>\"Hey, what's up? I'm Emily. I just moved in next door.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I'm staring, which is something I don't make a habit of. Eye contact typically invites people into conversations, and I'm not a fan of chit-chat. I stand in the doorway with an awkward pause, like I'm unfamiliar with waving as an appropriate means to say hello. My pause before I answer her is a pace too long, and the situation is somewhat uncomfortable as I stand there waiting for her to offer up more information. More importantly, I want to know why she's knocking on my door, and I hope it's not so we can get to know each other.</p><p>Since several more seconds pass without further exchange, I finally cave in and offer myself up. \"Hey, I'm Ethan,\" I say wanting to keep it simple. I don't want to get sucked into a conversation with her, but I don't want to be rude, either. She can tell I'm a little put out with her presence, so she gets right to the point. The last thing I need is an overly perky neighbor who thinks we're \"pals.\"</p><p>\"Sorry, I was just having trouble getting a window open. It's going to be a hot one, you know, and I don't have the electricity turned on yet. They want some freaking deposit since I don't have a credit history. It's like, 'Hello, I'm living in a crappy house, in a crappy neighborhood. If I had good credit, I wouldn't be living here.' Anyway, I want to get the window open to get air moving through, and I think it's painted shut. I don't want to be all 'damsel in distress,' but I can't pry the darn thing open...\"</p><p>My thoughts trail off and I realize this is the most anyone has said to me in years. Perky girl is still talking, but I'm continuously distracted by her mere presence and the fact that her chest spills over the top of her tank. She's pretty cute, but I try not to dwell on her appearance as lustful thoughts won't lead anywhere good.</p> <p>\"So you think you could come help me?\" I know I missed some information in there, but I'm not going to ask for clarification or for her to repeat it.</p><p>\"Sure, no problem.\"</p><p>I follow behind her, but at a safe distance. I don't want the offer of my help and me being polite to some girl mistaken for flirting. It sounds conceited, but it's happened before. It's better not to give them any sense of false hope. I mind my own business and live my life; today will be no exception. She shows me the window in question, and sure enough, it's painted shut. I roll my eyes at the incredibly inept and lazy maintenance people for doing a half-assed paint job.</p><p>\"Um, I'll be right back. I'll have to get something to cut this open.\" I turn to head out her front door, but she stops me.</p><p>\"Oh, wait. Like a box cutter? I have one of those. I think the maintenance people left it here by mistake.\" She rummages in a kitchen drawer then presents me with a paint covered box knife. As I work the window, she asks me several questions related to the area. My answers are succinct since I'm not really receptive to the Getting-to-Know-You game. The \"Twenty Questions\" moderator doesn't get the hint though, and keeps on with the game. \"So, how long have you lived here?\"</p> <p>\"A few years.\"</p><p>\"Do you know many of the neighbors?\"</p><p>\"I don't talk to the neighbors much, so I don't know anything about them.\" I'm hopeful my continued shortness helps her get the hint that I'm not interested in a conversation.</p><p>\"Wow, you're pretty quiet, huh?\"</p><p>\"Yeah.\"</p><p>\"So, what do you do for fun?\"</p> <p>I'm caught off guard by her question. I can't recall when I've had fun, so I'm not sure how to respond. I stand up straight, rolling my shoulders back and craning my neck in a stretch, attempting to buy a little time for my answer. While I don't particularly care what this girl thinks of me, I don't want to come off like a total loser, either.</p><p>\"Look, I'm sorry,\" she says. \"I didn't mean to pry. I've bothered you enough this morning. You've been so nice, helping me out and all. I'm gonna...\" she trails off and I go back to working the window, popping it open a few seconds later.</p><p>\"I'll see you around,\" I tell her, raising the window to its fully open state. She quickly dismisses me with another small wave, and I leave to go back to my own little corner of the earth. Despite the fact that I've been in her unit for less than five minutes, it doesn't escape my notice that there's no furniture or a TV, just a mattress on the floor of her bedroom. Maybe the moving truck with her stuff hasn't arrived yet, I think to myself. In the back of my mind, I know there isn't more stuff coming. People like us don't have stuff or the need for moving trucks.</p><p>I'm lying in bed, thinking about the stupid question she asked me. \"What do you do for fun?\" How could such a simple question send me into a tailspin?</p><p>That's when I hear a whimper. It's been a while since anyone's lived next door, and the last guy who lived there was never home, so I'm used to quiet. The walls are thin in apartments like this, cheaply built and economically priced rental units. Much expense was spared in their construction. I'm certain we share no more than a few two-by-fours and two slabs of sheetrock as the wall. It doesn't provide any more privacy than that found between bedrooms in the same home instead of two separate residences. I turn my head, thinking it will improve my ability to discern what I think I'm hearing. It doesn't, but then I hear muted sobbing. That can only mean one thing - new neighbor girl is crying. I turn away, wanting the sound to stop; I don't want to be involved.</p><p>The next morning shows no signs of life from my neighbor, but that's no surprise. The noise coming from her side of the duplex kept me up well into the night, so I'm sure she's sleeping in. I, on the other hand, take part in my free exercise routine - running. I do this early in the morning for two reasons: one, I avoid those who may feel the need to hassle me for money. They are not early risers, as hassling is a mid-morning and post-lunch activity. Two, it gets hot as fuck here in the summer, and running in 105 degree temperatures is just stupid.</p><p>I crest the hill on my street, nearly completing my three miles, and see her setting out the trash. New girl is looking around nervously, probably in hopes of going undetected since she's barely dressed in her tiny shorts and tank top. It's not leaving a whole hell of a lot to the imagination, and my mind wanders as I catch a glimpse at her ass. I see her throw a couple of empty boxes to the curb then turn and rush inside. I'm close enough that I can see the blackened bottoms of her feet as she scurries inside, then wonder how often she goes without shoes.</p><p>A few days pass before I see her again as I return from my run. This time she's leaving a few plastic grocery sacks out for the trash. Once again, she's dressed in the same tank and shorts she wore on Sunday. After my cool down stretch, I make my way inside and gather my things to shower. Only then does it occur to me that I haven't heard the water turn on in neighbor girl's unit at any point since she moved in, not even a toilet flush. The only sound I hear from her side of the wall is the crying each night. I recall her statement about not having electricity. I'm guessing she doesn't have the water turned on yet, either.</p> <p>A knot forms in my stomach.</p><p>Don't get involved. Keep things simple. Take care of yourself!</p><p>I can't help it and walk out my door, knocking on hers seconds later. It takes a moment before I realize I'm only wearing my shorts, but it's too late. She opens the door a crack and eyes me.</p><p>\"Ethan,\" she greets, and then opens the door a little wider, looking around cautiously.</p><p>\"Emily, right?\"</p><p>\"Yeah. What's up?\" She's smiling again, just like when we met.</p><p>\"I noticed that you, um...don't have electricity yet, and you don't have water either, huh?\" She bites the inside of her cheek nervously.</p><p>\"No.\" Her reply is so small, just like she is, and I can tell she's embarrassed.</p><p>\"Come on,\" I say, motioning for her to follow me. \"You can shower and wash your clothes at my place. I pay a flat fee for the water, so you using it won't cost me any more money.\"</p><p>Don't get involved. Keep things simple. Take care of yourself!</p><p>It's too late, though. I'm already involved. It's no longer simple, and for the first time ever, I'm offering to care for someone other than myself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I can't tell you how much I appreciate this, Ethan.\" She's wrapped tightly in one of my towels, and I feel a... stirring. I wonder if she understands she's half-naked in front of a stranger. I try not to be obvious in my perusal of her form; her body is small, but her tits are high, round, and a little large for her frame, though no complaints. I briefly wonder what her nipples look like, and lick my lips but catch myself before my ogling turns creepy.</p><p>\"It's no problem,\" I answer hastily, refusing to look further at her.</p><p>I stop short before making my next statement. No matter how much I tell myself to mind my own business, I can't seem to help dispensing advice. \"You know, you can't live without utilities, Emily.\" I wonder where this girl comes from that she thinks living with no water or electricity isn't a problem; my level of concern is now elevated a notch or two.</p><p>\"I know, but - \" she stops herself. \"Yeah, I know.\"</p> <p>I have this feeling that there's something off here, and I can't ignore the fact she seems to be without essentials. \"I typically shower in the morning, so if you want to come over at night and shower until you get the utilities turned on, that's cool.\" I turn away, wanting to give her privacy to dress because she needs to get dressed; I need her to get dressed.</p><p>\"So like, what do you do all day?\" I can hear the snap of the elastic on her panties against her hip as she finishes putting them on. Shit, these duplex units are too small! Or is my hearing that good? I can't help the thoughts that run through my head. Thinking about her body is a complication I do not need or want. However, chiding myself doesn't stop me from picturing the slight curve of her hips, her shapely thighs, or perfectly muscled backside.</p><p>\"I go to work,\" I snap, feeling guilty. Seconds later, her voice is right behind me. \"Oh yeah? Where do you work?\" Her tone is light and her remark impulsive. \"I need to get a job.\"</p><p>I turn so we're face to face and she can see my eyes. Sometimes, emotion seeps out through the eyes. I don't want her to see any vulnerability in mine. Once you're seen as weak, people are quick to take advantage.</p><p>\"I work down at the grocery store.\" She smiles and looks down. She doesn't want me to see her eyes.</p> <p>\"That's really close, so I could walk there. You think they're hiring?\"</p><p>\"Don't know.\" I have to keep it uncomplicated. Expanding on my answers will only lead to divulging more than I intend to offer. We stare at each other for a few more seconds before I break the silence. \"Well, I - \"</p><p>\"Oh gosh, I'm sorry. I've done it again. You must have to get ready for your day. I come barging in here and ruin your routine!\"</p><p>\"It's fine; I just have to take a cold shower before work.\" The words are heavy in the air. They aren't meant as they sound as I'm sure she's used all the hot water in the small hot water tank, but after thinking about her showering and changing in my bathroom, perhaps a cold shower for another reason isn't a bad idea.</p><p>\"Yeah, okay. I'll see you later.\" Great... now, she thinks I'm a pervert.</p><p>I don't see her for two days. . .</p> <p>And for 48 hours, I worry.</p><p>-</p><p>Don't get involved.</p><p>Keep things simple.</p><p>Take care of yourself!</p><p>DAMN IT!</p><p>It's 10 p.m., and I can't stand it anymore. I know something isn't right. No utilities, no furniture, wears the same clothes, and I can hear her. I hear the sobbing every night through the thin-ass sheetrock.</p><p>\"Emily,\" I say in a slightly raised voice. Fucking non-existent walls.</p> <p>\"Yeah?\" she sniffles.</p><p>\"Can I come over?\"</p><p>The pause seems to go on forever before she answers. It's a \"yes\" mingled with sobs.</p><p>Don't get involved.</p><p>Keep things simple.</p><p>Take care of yourself!</p><p>It's too late. . .</p><p>I sit on the edge of her mattress not knowing what to do.</p><p>\"Thanks for coming over. Nights...they're the hardest.\"</p><p>\"Emily? What's going on? Tell me the truth. I'm not going to rat you out or anything.\" I chance a look at her face and the fear is evident. I refuse to focus on her in her thread bare tank and panties.</p><p>\"You're not renting this place, are you?\" I surmise aloud. I think I've known this for some time but just didn't want to admit it. Admitting it makes it real. Making it real means I'm stuck; I can't walk away now, realizing what I know.</p><p>\"Please! Please don't tell anyone!\" She's frantic, on the edge of mania. I scoot closer in hopes of easing her.</p><p>Not too long after I moved into my first group home, the baseball my father gave me when I was seven, got stolen. It was one of the few personal items I owned. A staff from the group home tried to comfort me when I discovered it was missing by hugging me and patting my hair.</p><p>I attempt to mimic the same gestures for Emily, because it's the only comfort I know. She clings to me like a lost swimmer gripping a buoy in an endless sea. Finally, she quiets and the knot in my stomach comes back. I know I have to find out what's really going on. I need to press her for more information since it seems I'm intent on helping her.</p><p>\"Tell me.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We sit in silence for quite some time, and I can tell she's nervous about telling me what's going on. I don't want to force her. When she's ready, she'll let me know. As I wait, I realize it's the first quiet night I've had since she moved in.</p><p>I really don't want to make assumptions because things aren't always what they appear. However, as I sit playing protector to this girl, scenarios run rampant through my mind. She has very few clothes. Irregular bathing does not bother her. She is careful, but trusting - not at all shy. She's young and alone; she has no furniture and no utilities. All evidence points to her being parentless and homeless.</p><p>I can relate.</p><p>Don't get involved.</p> <p>Keep things simple.</p><p>Take care of yourself!</p><p>Don't get involved.</p><p>Keep things simple.</p><p>Take care of yourself!</p> <p>Don't get involved.</p><p>Keep things simple.</p><p>Take care of yourself!</p><p>No matter how many times I recite the mantra in my head, it's useless. This life isn't suited to girls who are alone, no matter how equipped they are to deal with the shit life flings at them. Women are taken advantage of in the blink of an eye when the opportunity is given. I make a mental note to be sure Emily doesn't suffer the same fate, particularly by my hand. I'm sitting on Emily's mattress, my head against our shared wall. She's leaning into my side, quiet, in what I hope is peaceful sleep.</p><p>After thinking this situation over for a while I shake my head, realizing I've already talked myself into this, into helping Emily; I find it nearly impossible not to now. Eventually, I drift off with determination and the realization I've opened a big-assed can of worms... for both of us.</p><p>Hours later, my inner alarm clock wakes me. There is a little drool on my shoulder and it's kind of gross. I lay Homeless Girl down on her bare mattress and make note to bring over an extra set of sheets. Who knows where she even got the mattress? I'm sure it's infested with who-knows-what. I may be poor, but I like clean. There are some things that shouldn't be bought in used condition. Shoes, underwear, and mattresses quickly spring to mind.</p> <p>During my run, I think about the upheaval I'm getting myself into, and the reality of the situation is weighing heavily upon me. As a kid, I was lucky enough to be moved to a safe place where all my basic needs were met. I never had to fend for myself in the physical sense; emotionally, though? That was another story. I run an extra two miles trying to process everything. I decide this is my chance to pay it forward. I ignore my mantra as it only serves to confuse me further at this point. The fact remains I've already gotten involved, and I try to rationalize how much trouble one small girl can really be. Part of me feels like it's none of my business what her personal situations is, but if I'm going to help her, then I want some basic information. She doesn't have to tell me her life story, but I need to know her circumstances.</p><p>After I get home from work and knock on the bedroom wall, I chuckle to myself thinking it may as well be a shower curtain for all the privacy the thin, flimsy wall provides. I yell, telling homeless neighbor girl I've ordered pizza and she should come join me for dinner.</p><p>\"You're the best! I can't believe you got us pizza!\" She won't stop gushing about how nice I am or how \"awesome\" the pizza is. When she came over, she looked a bit skeptical, like she wondered what I wanted from her in return, but I didn't even want to think about what that might mean.</p><p>Food, clothes, shelter. That's all...</p><p>As we eat, I try to think of the best way to bring up her state of affairs. I find that being direct is the best solution. I watch as she inhales her third slice of pizza, I rationalize I need to start referring to Emily by name. Calling her Homeless Girl and Neighbor Girl isn't helpful for either of us. I need to see her as a meaningful person, not a 'problem from next door'. Emily needs to hear her name, if for nothing else, so she knows she exists.</p><p>\"So, I have a couple questions. I've been thinking about this since last night,\" I pause making sure she is receptive to my inquiry. She nods indicating her permission. \"Question number one: Where are your parents?\" She eyes me quickly, and then takes a bite of pizza, chewing slowly.</p><p>She's stalling.</p><p>\"I don't know my dad, and my mom passed away recently,\" she says quietly. I take her answer at face value because I know how difficult the loss of a parent is.</p> <p>\"Where were you living before?\"</p><p>This time she's a little quicker to answer. \"We lived in shelters for a while. Then my mom got sick.\" She takes another bite of her dinner then continues. \"I know how things work. Since I'm almost eighteen, there isn't too much the state will do for me. I would live in a home for a few months then get tossed out on the street. I figured I might as well get a jump on living, you know?\"</p><p>I wonder how she's able to be so light-hearted about this. Emily's smiling which she tends to do on a regular basis. This girl - almost woman - has had some terrible circumstances, yet almost every time I see her, her smile brightens the room. I find her positive outlook on life is rubbing off on me.</p><p>\"My next question was your age, but you've already answered that. When do you turn eighteen?\"</p><p>\"In a month,\" she replies. I take several minutes to think about the information she's just told me while finishing my own slice of pizza. Living in a shelter would explain her lack of inhibition. There is no such thing as privacy when you live with fifty other people. She's used to being watched.</p><p>\"Hey, I went to the grocery store you work at today and filled out an application. I looked for you, but you must have been on break or something.\" I just nod; I don't need this complication spilling over to my work. As soon as I think it, though, I regret the thought. I can't think of Emily as a complication.</p><p>\"They said they weren't hiring right now, but will let me know if something comes up. On my way home I stopped at the convenience store on Jamison. I found out they are hiring, so if the grocery doesn't work out, I could do that instead,\" she finishes, and then takes a fourth slice of pizza. I know my face pales, and she doesn't have a clue why. I have no idea how to tell this girl I don't even really know, occasionally uses my shower, and who I just referred to as a complication, that I don't want her to work in a convenience store because Dad was shot in the parking lot of a 7-Eleven. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We spend a quiet, comfortable evening and I can't help watching Emily for most of it. It's obvious she hasn't seen television in a while because she's mesmerized. We are watching some Cajun cooking show on public access, but to see it through her eyes, it's like we are watching the most fascinating show known to man.</p><p>\"I put a little mo' wine in here, maybe a little mo' wine fo' me,\" the host says in a Creole southern drawl.</p><p>\"Oh my gosh! Ethan, he is so funny! 'I gar-un-tee'!\" she laughs as she mimics the chef, and I can't help the smile that cracks across my face. She could let the world swallow her whole with the weight of her situation, but she doesn't. Instead she carries on, seemingly carefree, laughing at the talkative old cook with the gift of gab.</p><p>\"Emily?\"</p> <p>She glances over at me, still laughing at the TV. It's the moment I know I'm making the right decision. I take a deep breath, ready to lay things on the line.</p><p>\"Hang on! He's going to tell a story about squirrel hunting! This'll be good!\" Emily says with enthusiasm. While I really need to get my thoughts out, I can't deny her this moment. It's so pure, so I decide to indulge her for the final five minutes of the show.</p><p>As the Cookin' Cajun finishes, Emily focuses her attention on me.</p><p>\"You wanted to talk about something?\" The light and sparkle in her eyes is amazing. She looks happy and carefree instead of nervous. She seems to assume the best of every situation. Given the circumstances, you'd think she would be nervous, but instead, she acts as though we're going to talk about whether she'll make oatmeal or chocolate chips cookies next. I suddenly feel something I haven't felt in a very long time: content.</p><p>\"Yeah,\" I begin, though I'm not sure why I'm nervous, other than the fact she may say no. She may refuse my help. She may tell me to mind my own business, that she doesn't need anyone to look after her, but I have to try.</p> <p>\"I want you to stay here.\" Her mouth drops open, but no sound comes out. \"With me,\" I finish. I'm not sure whether her speechlessness is a result of shock or horror. I decide to play it safe with more justification. \"You can't squat next door. It's not safe, it's illegal, and you don't need any hassles from the cops.\"</p><p>She sits for a moment with her eyes trained on her hands while her fingers twist with each other on her lap. Her hair is frizzy from the humidity, and despite having it pulled back, there are tiny tendrils sticking up forming an angelic halo around her face. After a few moments, she finally speaks. \"So, what do you want in return?\"</p><p>What? I'm fully aware she has no money, so why would she think I would want her to pay-</p><p>I'm not even finished with my own thought when I realize she's not talking about monetary payment. Nothing is ever free, and she thinks I want her in return for providing food and shelter. The thought strips me down to the core.</p><p>\"No!\" I shout unnecessarily, but I can't help it. I do not want that! She's hiding her face, but I can see her scrunching her eyes closed. I take a breath to calm down and explain myself.</p><p>\"No,\" I start again, much calmer than before. \"I don't want anything from you, Emily. I want to help you. I know how...\" I stop and take a deep breath. I need her to understand where I'm coming from. \"I know how hard this situation can be.\"</p> <p>She flinches and snaps her head up to look me in the eye. \"You don't want...you know, then?\" She gestures between us to further her point.</p><p>Lie. \"No. The last thing I want is for you to be taken advantage of.\" While the thought of being with her physically is an attractive offer, I would never want it under that set of circumstances. I know how easy it is to become a target when you're young and in need.</p><p>\"But, why? Everyone wants something, Ethan. There has to be something you want from me. I mean, it's okay if you want... you know...\" Her cheeks flame red as she says this.</p><p>God, she's so naive she can't even say the word \"sex.\" It only solidifies my decision that I'm doing the right thing, but she's right. People always want something in return, so I will have to give her a reason why I don't want anything from her. I have to be honest with her and let her know that I'm all too familiar with her situation. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After four months, I continue to be astonished by what Emily can do with a dented, often label-less, can. She says it's all the Julia Child reruns on PBS, but I don't care who's to credit. Dinner is on the table every night with mismatched plates and silverware, and our economy paper towels are always folded into decorative shapes. It hasn't escaped my notice at how much I enjoy seeing our laundry mingled together, either. The bottom line for me is that she makes even this place seem like home.</p><p>After Emily agreed to move in with me - which was no small feat - it took a month until she stopped knocking, then cracking the door and yelling, \"Ethan?\" before she would enter through the front door. It was as if she thought I would get mad if she didn't practice her self- imposed ritual. While her discomfort with calling this her home still lingers, it's just the tip of the iceberg concerning our... issues.</p><p>Initially, she'd been particularly insistent about getting a job and wanting to help financially. I hadn't argued, thinking she was nearly done, if not completely finished, with school. I hadn't bother to ask what her status was, figuring she was old enough to make that decision herself. So, it was with eagerness that I helped her look for a job.</p><p>One roadblock was her lack of identification. Employers want an ID, but of course, Emily didn't have any. We spent an entire day at City Hall getting the required documentation and social security card, so we could then go to the DMV. That was the day I found out she was barely old enough for a driver's permit - let alone a driver's license. Emily insisted she was nearly eighteen when we met, but I found out she wasn't even close. Shock didn't even begin to explain what I felt at the revelation of her real age. She hadn't lied about when her birthday was; it was a month after she moved in, as she'd first said. However, she was turning sixteen, not eighteen. While I was monumentally upset by her deception, I got it. She was living with the fear of being herded into a state system that could feel like you were being fed to the wolves. I couldn't really blame her.</p> <p>After I got over my initial anger about her lie and the additional guilt of some of the inappropriate things I may have fantasized about her, I realized Emily missed the milestone of sweet sixteen. I remembered a co-worker talking about her sister's sixteenth birthday and the excitement that went along with the momentous occasion. Emily insisted she didn't want anything special and maintained that by finding me, she'd already received more than she ever hoped for after her mother's passing. The celebratory sad-assed cookie I had on my twenty-first birthday came to mind. I instantly knew it wasn't good enough for Emily, so I went into work and ordered the most extravagant and girly cake our bakery had - regardless of the fact it was almost forty bucks, my usual weekly food budget. Her reaction to the cake was like a kick to the stomach. When I brought it home, Emily cried, explaining that even her mother had never gotten her a cake since cake wasn't something you buy on a strict budget.</p><p>That was the moment I decided Emily would never go without again. Knowing that cake was so special made it all the more enjoyable when I ate it every meal the week that followed.</p><p>\"Ethan, go wash your hands please. Dinner is ready.\"</p><p>It never fails. The girl can literally watch me walk from the bathroom, knowing I've just scrubbed up, but she will still tell me to wash again, and I will. I know that she's tied to the routine, not really the cleanliness factor. Many who have been in a homeless situation will cling to routines for the comfort and solace they bring.</p><p>We sit and eat in silence for the first few minutes of the meal. It's always balanced, particularly since she's taking a health class this semester and preaches the benefits of healthy eating habits and exercise. Sometimes it makes me laugh because she sounds just like one of those infomercials she occasionally watches in the middle of the night after she's had a bad dream. There are times I think it's more than just nightmares, though, when she wakes at night. She carries a lot of guilt around with her given our situation. Emily feels like she should contribute to the household with money. I feel like she needs to be in school, getting an education. Even though legally she could drop out, I'm constantly reiterating that school is her job, and there will be plenty of time for her to contribute in the future when she's a full-fledged taxpayer.</p> <p>\"Hey, Ethan?\" Emily asks cautiously, while pushing her cube steak around on the plate. I'm a bit nervous since she says it with hesitance. She hardly asks for anything, and when she does, she makes it seem like she's about to ask for a million dollars, but it's usually something small and relatively insignificant. This time, though, the accompanying look on her face indicates this isn't simple. I put my fork down and look up, giving her my full attention.</p><p>\"So, Christmas is coming.\"</p><p>I inwardly groan, not because she's brought it up, but because I participate in as little of the Holiday Cheer as possible. It's been awhile since I've celebrated the birth of Christ, mainly because I don't believe in God. Realistically, I see the holiday as an opportunity to earn extra money as I work all the shifts so everyone else can spend time with their families. I try to dislodge my anxiety about the topic but it doesn't work. The holidays are about commercialism and consumerism. Plus, I can't afford to buy gifts.</p><p>\"Yeah, I usually work Christmas. I get double time.\" My dinner still sits heavy in the pit of my stomach. I know I should give her a special day.</p><p>\"Oh.\"</p><p>Now I feel like a jerk who's robbed her of the magic of Christmas. \"Like all day or just part?\"</p> <p>\"The store is open from seven until two, then closing early.\" I know why she's asking, but it doesn't keep me from playing stupid. \"Why? What's up?\"</p><p>Emily finally stops pushing her battered piece of meat around on the plate and looks up. \"I was thinking...and you don't have to...it's just something that...I mean, you can, but if it makes you uncomfortable...\" I finally stop her rambling by touching her hand. My hope is that she will refocus her thoughts with my unexpected gesture.</p><p>I'm successful. Emily sits up a little straighter, squares her shoulders, and wipes her mouth with her paper towel-slash-napkin.</p><p>\"I want to spend Christmas at the shelter. You know...it's the last place I was with my mom.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For the second time since she came into my life, Emily and I walk away from the Gale Street Shelter. After making the trip with her last year, which was her first Christmas without her mom, I know how important \"giving back\" really is especially where Emily is concerned. I can't help but glance over at her as we make the journey home. This girl - woman - has been part of my life for 487 days, give or take a few hours. As I look back now, I realize I'm keeping track because the day I met Emily was the day I began to live, a rebirth in the form of a brunette angel who's never asked for anything, yet I can't help giving her everything I can.</p><p>The past year has been filled with much patience and restraint on my part. As I realize Emily is still a child in the eyes of the law, I struggle to keep my mind on a virtuous path. Sometimes I swear she's torturing me. This morning she decided to get a drink of orange juice after taking a shower but before getting dressed. She says she likes the taste of orange juice while the mint of the toothpaste lingers. I walked out of the bedroom, and there's Emily... bending over... reaching for juice...in a towel. And because I'm frugal, our towels are cheap and on the small side.</p><p>I think she knows she's torturing me when she stands there, flexing her leg. I leave the house without my lunch or coat in haste to escape. I don't want to continue down this path with my thoughts. I've made a vow to myself that my relationship with Emily will remain chaste, but it doesn't mean I don't have to redirect my thoughts on a consistent basis.</p><p>I'm only human.</p> <p>On my way to work I make a mental note to save some money so I can buy her a robe... with full coverage.</p><p>The temperature has dropped since our arrival at the shelter this morning, so we walk quickly. This is our Christmas tradition now. Emily asked that we visit last year as a way to remember her mother. Now, I see how lucky we truly are with what we have. There are so many who have nothing. Our home may lack many of the modern conveniences and technological advances of most, but we are healthy, bellies full, and we have a roof over our heads. Helping to serve dinner and visit with the shelter patrons is a way for Emily and me to pay it forward.</p><p>We don't exchange expensive gifts. Instead, I always get her a new kitchen gadget from the Dollar Store, and she always bakes me butterscotch cookies. It's not much, but it's meaningful and the only thing that counts to us.</p><p>As my arm swings with the rhythm of my feet, I brush Emily's fingers with my own. It's an innocent accident, though the sudden warmth in my chest is anything but. I'm not sure how much longer I'll be able to keep up this ruse, playing her brotherly protector. While Emily has never spoken about boys in her class or voiced interests of the romantic sort, I know it's inevitable. She has blossomed into a beautiful creature who has no idea of the devastation her beauty wreaks upon me and, surely, the boys around her. Her smile is infectious, and it's only a matter of time before a suitor comes knocking at our door. I kind of feel sorry for the poor boy, as my first time meeting him will most likely be ugly. I'm a fierce guardian where Emily is concerned, not just because it's my duty to protect her but because seeing Emily with another guy will end me.</p><p>I want to reach out and take her hand in mine as we walk, but I don't. I have calculated the difference in our ages. Five years doesn't seem all that much when she is twenty and I'm twenty-five. However, she is seventeen and still a minor, which is the only important difference, no matter how hard my libido begs to differ. I have to prepare for her to have romantic feelings for someone her own age, not a twenty-two year-old guy who has to act like her older brother.</p> <p>Sisters rarely hold hands with their brothers.</p><p>\"Why don't you go out on dates?\" Emily suddenly asks in the middle of New Year's Day dinner. She insists on serving black-eyed peas because they are lucky if you eat them on the first day of the year. They taste like shit, but as usual, I humor her by eating them.</p><p>\"Huh?\" I stall. She's familiar with my deliberate stall tactic and narrows her eyes at me.</p><p>\"I've never seen you with a woman.\" She pauses, like she's unsure how to broach the next part. \"I mean, you're a good looking guy. There have to be opportunities for you to go out...\" She stops and takes a deep breath as if preparing herself for my answer.</p><p>\"Uhhh...\"</p><p>Yep.</p> <p>\"Never mind, Ethan. I can tell it's not a topic you want to talk about.\"</p><p>With that, she leaves the table and her half-eaten plate and heads for the bedroom, one of her only options for privacy . The door closes and I'm left feeling more confused than ever. I'm learning that girls are confusing, especially where Emily is concerned. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Happy anniversary!\" Emily yells at me as I exit the bathroom having just completed my morning ritual. She'd be disgusted if she knew everything it entailed, not to mention the full coverage robe I was supposed to buy, which means Emily still walks around in tiny towels. Of course, I spend extra time in the shower stroking out my morning wood so that I'm able to have some semblance of decency the rest of the day. Walking around with an Emily induced boner would certainly make our situation uncomfortable.</p><p>While the topic of dating and relationships hasn't been broached since January, that doesn't mean it has gone away. Instead, it's been the elephant in the room for eight long months.</p><p>\"Is there an anniversary song?\" Emily asks jokingly. \"There's one for birthdays.\" She starts singing Happy Birthday, replacing \"birthday\" with \"anniversary.\"</p><p>I can't help but smile given the joy the woman before me holds for the simplest of things.</p> <p>\"It's two years today, Ethan; two years ago you came over and opened my window, two years since you recognized I was alone and in need. Two years ago you opened your home and heart to a perfect stranger.\"</p><p>When she says heart quieter than the rest, mine skips a beat.</p><p>Her voice wavers at the end of her speech, indicating tears are about to follow. I reach out to her, pull her into me, and hold her tightly as she surrenders to the sadness. This is the only touch I'm allowed - the only appropriate embrace.</p><p>Looking in the mirror, I see a man whose extraordinarily proud. While I may not be the mama bird watching her baby bird fly from the nest, there is still pride deep in my chest. Emily graduates today from high school. It's an accomplishment, which given the circumstances, is astounding. Today is special, and it's the first time I've ever worn a tie, so I check it one last time. My tie isn't the only surprise I have for Emily today. I purchased my very first car this morning, and I plan to drive Emily to her graduation in a 1998 Toyota Corolla. It belonged to Margie, my boss, but her husband bought her a new one. He sold me the Corolla with 160,000 miles at an unreasonably low price. I'd say he was giving me a bit of charity, but no matter, it's mine.</p><p>Mine and Emily's.</p> <p>\"Get-out!\" Emily shouts moments later as she looks at the champagne colored car parked on the street and then back at me. Her mouth is hanging open, unsure of what to say.</p><p>\"Come on; get in. We have a graduation to get to.\"</p><p>\"Your brother is way hot,\" I hear the blonde say. Emily doesn't respond, but another high-pitched voice does. \"That's not her brother, you clueless bitch.\" Emily told me about this once, where females call each other names as terms of endearment, but I don't get it. If one of the guys at the store called me a bastard or asshole, I'd punch his face, endearment aside.</p><p>\"Gretchen...\" I hear Emily plead. \"Please don't.\"</p><p>\"What? He's not - which, of course begs the question, why aren't you bangin' his brains out, little Emily Evans?\" Truth be told, I want to know Emily's response. It's not like I haven't thought about it a thousand times, but I'm curious to know if she thinks about it too.</p><p>\"I have to - \" then I hear footsteps rapidly retreating. I decide to make myself known and walk out of the hallway where I've been hiding since the conversation seems to be over.</p> <p>\"Hey, Ethan, you just missed Emily.\" The blonde motions down the hall in the direction Emily went.</p><p>I follow.</p><p>The sound hits me immediately as I near a classroom with an open door. Thankfully, it's a sound I haven't heard for a while, but hearing it now cuts me like a hot knife through cold butter.</p><p>\"Emily?\" I call to her as I enter the nearly empty room. The desks and chairs are stacked, waiting patiently for another round of students in the fall. Emily looks up, red-faced and glassy-eyed. She regards me for a moment, then bursts into another round of sobs. For a second, I think about how ugly crying is. I think Emily is beautiful, but the way her face contorts... it's just so unattractive. This crying mess in front of me doesn't look like Emily at all. Then the few remaining scraps of humanity I think I have left kick in, and those superficial and negative thoughts float away. All I'm seeing now is my Emily in pain - and I want to make it stop. I go to her as fast as my legs can carry me and take her in my arms, holding her close. We've only embraced a few times, but for me, it's special every time.</p><p>After several minutes, Emily has calmed and she raises her head to look at me. Her eyes are clear now, and as she gazes into my eyes, I think about how beautiful she is. It's all I can do not to place my lips over hers. We're so close that just a few inches forward would connect us. I want her so much sometimes it's hurts. But that's not meant to be, and my sinful thoughts have to remain hidden.</p><p>\"Ethan, I have to tell you something. Well, ask you something, really. I mean I'm going to tell you something, but then I'm going to - \" I cut her off by placing my hand gently over her mouth. She rambles when she's nervous, plus my hand will keep me from kissing her.</p><p>\"Deep breath,\" I coach her and myself. After a few relaxing sighs, I encourage her to start again.</p><p>\"You can tell me anything, Emily. I'm here for you. You can trust me.\"</p> <p>But never in a million years would I expect what she says next.</p><p>\"Ethan, I love you.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The words are ringing in my ears: \"I love you.\"</p><p>It occurs to me I may have misheard. It's the only possible explanation.</p><p>\"So, you're okay? Don't listen to those girls, Emily.\" I'll just pretend those three little words aren't hanging in the air - regardless of whether they were actually said.</p><p>\"Ethan, did you hear what I just said?\"</p> <p>What do I say? I have no idea how to approach this, so I just stare at her wide-eyed.</p><p>After a few moments, I feel warmth creeping up my thigh and realize its Emily's hand. At first, it's an attempt to get my attention, but as her hand ascends, I realize the intent is not so innocent.</p><p>\"We have to go. It's time to go,\" I say, stilted, like Rain Man talking about his Kmart underwear.</p><p>I grip the steering wheel for dear life because if I don't, the car and my life will go careening into the abyss. I've spent all this time convincing myself that Emily and I could never be anything but friends. Knowing that she may feel the same about me as I feel about her will complicate things, and I suddenly feel trapped.</p><p>It's so quiet as we drive, that I hear a small plinking that would go unnoticed otherwise, but as I near the duplex, the sound the car is making increases. I briefly wonder if it's because the plink is getting worse or the quiet is just so intense. I make a mental note to find the origin of the plinking before putting too many more miles on the car.</p> <p>I should be thinking about the woman sitting next to me and her recent declaration instead of small pings, but I'm not... I can't.</p><p>If I do... no.</p><p>I can't think.</p><p>I'm not even sure how I get here, but I'm sitting in the middle of my bed, having an argument with myself.</p><p>It's no surprise that I'm winning.</p><p>\"She told you she loves you.\"</p> <p>\"She says she loves to cook. She loves lots of things.\"</p><p>\"She's in there and you're in here.\"</p><p>\"You really need to clean the ceiling fan blades.\"</p><p>I can't help but roll my eyes at myself.</p><p>When I finally exit my room, the apartment is dark and quiet. Emily is asleep on the couch with a tight grip on the blankets. Little does she know she's gripping at my heart the same way.</p><p>The notebook on the side table catches my eye, and I can't help but snoop. As I near it, I see there are several wads of paper strewn across the floor - discarded because they weren't perfect. The top piece, still clinging to life in its spiral bindings, is flawless.</p><p>Dear Ethan -</p><p>Sitting down to write this, I've never felt more like a young girl than I do right now. For the past two years, I've looked at you every day in hopes that someday - you'd feel for me, what I feel for you. But now I see that we perceive different things regarding our relationship. Maybe it could be classified on my part as hero worship, but I'd like to think I'm smarter than that. I think I know the difference between infatuation and love.</p> <p>I know there is a difference in our ages, but who cares? My heart has no idea how old your heart is. I just know that if I don't tell you, it will fester inside me, and I'll die a slow painful death. I've only ever loved my mom and never really knew what it was like to care for another person until I met you.</p><p>I didn't fall in love with you that first day, but after many months of learning to appreciate your care and concern, I could see how kind your soul - your whole being is. That's when I knew another kind of love existed. It isn't the type of love between family members, or a crush, but a true love that is unconditional and lasting, a love that I can no longer hide.</p><p>I know you probably don't return these feelings, but I couldn't go another second without you knowing. I understand if it makes you uncomfortable, and I'll find another place to live if you feel like we can no longer be friends.</p><p>Love always,</p><p>Emily</p><p>I tightly clutch the notebook page in my hand.</p><p>How can she do this to me?</p><p>Doesn't she know what she's done?</p><p>No... it's not right.</p><p>Not now, and without any further thoughts, I'm out the door. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body>  <p>When I finally look at the clock, I notice it's been seven hours since I ran out on Emily and my feelings. As I look out in front of me, the gray asphalt blurring with yellow and white lines, I make the decision to keep going. I don't want to be the one to ruin her.</p><p>No matter how far I drive, I come to the same conclusion over and over again. I must have given Emily some sign of my feelings for her. It was never my intention. I'm a stock boy at a grocery store. She needs someone to take care of her...buy her all the things she's never had. She doesn't need an orphaned schmuck with less money than common sense.</p><p>Usually, forty-eight hours doesn't seem like a whole lot. However, it's the longest I've been away from Emily in the time I've known her. It's hard for me to believe I've only known her such a short time because she's my whole life. How can your whole life be consumed by one person you haven't known your entire life?</p><p>Since I don't know the answer to that, I keep driving.</p> <p>It's Friday the 13th. I hadn't actually realized it until I stopped for gas, and the lady in front of me was writing a check. She asked what the date was. The attendant answered her in a gleeful, yet macabre tone. Can one celebrate Friday the 13th? If today is the thirteenth though, that means I've been sleeping in my car for six days.</p><p>Six days without her beautiful eyes.</p><p>Six days without hearing the slight lilt in her voice.</p><p>Six days since she told me she loved me, and I left her - like a thief in the night. Six days of thinking about kissing, touching and holding Emily. It's the only thing I've thought about.</p><p>Suddenly, it hits me: I know exactly what the raccoon from yesterday felt like as the wheels of the truck ahead of me rolled over him crushing him from the outside in.</p>   </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I drive and can't help that my emotions are all over the place. I'm angry because I've been living in exile from the one... The one person who gives a shit whether I live or die... I left her alone to fend for herself.</p><p>I take my rage out on the steering wheel before pulling over; I need a minute to collect myself.</p><p>Two minutes.</p><p>Five...</p> <p>It takes me half an hour before I'm calm enough to continue driving, but I rush because I want to get back to her. I want to touch her, be with her. I realize how fundamentally wrong I've been about my feelings for her. While I thought I was doing what was best for Emily, I never considered that I was really just protecting myself. I hadn't taken her feelings into account. I hadn't thought about what I was doing to her by leaving...and in the same accord, making her declaration of love, trivial.</p><p>The anger fades and misery takes its place.</p><p>I'm sad because I miss her. I need her more than air.</p><p>I need air, and I need Emily.</p><p>Air is so much easier.</p> <p>Before long, fear sets in. What if she isn't there when I get back? Why would she be? I left her by herself for six days after I swore I'd take care of her.</p><p>I think about what I did as I continue down the lonely stretch of highway.</p><p>I worked so hard to separate myself from the drama and emotions of everyday life realizing I haven't been living at all. I think of all the time I've wasted; all the time I could have been with her - been with her...</p><p>Her legs are bare and slender. I imagine what's just beyond the small rectangle of terry cloth. Her hair tickles the tops of her breasts, teasing me with what's just beyond the knot of the towel. One small flick and she'd be naked before me, her body as fantastic as I've always imagined.</p><p>My foot pushes a little harder on the accelerator as my frustration builds.</p><p>I'm tired and feeling the effects of driving ten hours straight. As I consider pulling over, the guilt seeps in again. I've already been away from her for too long. I can't stand to be apart from Emily any longer, but the seconds continue to tick by and I can't seem to get there fast enough. I push on, despite being a danger to others on the road due to my exhaustion. I see a gas station ahead, and force myself off the road and into the brightly lit convenience store. After hours of lonesome interstate travel, the intense glow of the fluorescent lights hurts my eyes, and only serves to remind me of the dim nature of my existence without Emily. I make quick work of refueling the car and myself and then rejoin the blacktop.</p> <p>Finally, finally, I see the mile marker indicating my journey is almost over, an hour to go before I'm back with Emily. Anxiety weighs heavily on me because I think I could have gotten here faster; what if she just left? What if she's been waiting for the last week and that was her limit?</p><p>I shouldn't have left in the first place. I should have told her how I felt so we could be living a happily ever after. Regret won't change things, though. It doesn't serve any purpose now.</p><p>I pass the city limits sign, and a smile spreads across my face. I'm happy and hopeful. A hundred and one scenarios play out in my head as to how Emily will react when she sees me.</p><p>She throws open the screen door and rushes towards me. I catch her in my arms and spin her around. I tell her I love her and want to spend eternity with her. She smiles and says she wants the same thing...</p><p>We barely make it to the bedroom before I fully make her mine...</p><p>I open the door and call her name but no one answers. All her things are gone, and she's nowhere to be found...</p><p>As I make my way up the walk, she stops me and tells me she doesn't ever want to see me again. That I broke her heart and I'm a fuck-up she wants nothing to do with...</p><p>I'm brought out of my thoughts as a car horn blares behind me. Dawn has broken and there is slight traffic moving about. I'm not sure how long I've been sitting at the stop sign on the corner before the car behind me demands attention.</p> <p>It's now or never, and never isn't an option.</p><p>I stand at the door, my door - her door - ready to knock. It occurs to me how odd this is; I'm about to knock on my own door. Suddenly, I'm embarrassed. I look down and my clothes are dirty and unkempt. I smell - it's been two days since I've cleaned up at all. How can I look her in the eye, kiss her lips, hug her body, when I look and smell like a homeless man?</p><p>I am homeless, though. Without her, without her love and care and warm eyes, I'm a man with a heart that has no home.</p><p>So I knock. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I knock, but there's no answer. I let myself in and I'm immediately relieved to see Emily's things still around the house, including her bedding on the couch. Remorse creeps back into my chest as I think about the numerous times I've tried to convince Emily to take my room - my bed - but she never has.</p><p>I kneel down on the floor in front of the sofa to worship the scent lingering in the sheets. She always smells like baby powder, the cheap off brand they sell at the Dollar Tree, but regardless of the price, it smells like heaven to me. I close my eyes and enjoy her essence while also promising myself to buy her name-brand lotion. No more generic.</p><p>The shouting startles me awake.</p><p>\"I don't care! Get the mother-fucking money. I don't pay you to lose my shit!\" Then I hear the unmistakable sound of a fist meeting flesh. My blood runs cold as I wonder if it's Emily next door. The thought hits me like the fist from next door: What has she done to get money for herself?</p> <p>I've had many neighbors while I've lived here. It's to be expected, as the downtrodden are a transient population. That unit was empty when....when I left, so I hadn't thought about a new tenant. I also hadn't figured on undesirables moving in. I'd never worried about my safety, but now I have to think of Emily's safety and protection. This is no place for her.</p><p>I hear a feminine scream amid the sounds of skin being struck and I know it's not my girl. I know what her scream sounds like after a spider infestation and that's not it. It's not Emily.</p><p>\"Get up, Punta!\"</p><p>I hear more ramblings and shouts in Spanish; the female cries in response. All I can think is, Thank God it's not Emily. But it is someone - someone's daughter, sister, or friend. I do the only thing I can. I call the police and let them handle it. While I've read heroic tales of men saving the day, it's not safe or practical in this case. It's very likely that the monster next door has a weapon, and I'm no good to protect Emily if I'm dead. The cops come and go quickly. The woman refuses to press charges, but the man is escorted off the property with a warning not to return. He'll be back, though.</p><p>They always are.</p> <p>My thoughts drift to moving to a better neighborhood, but then I realize I may not have a job because I'm a complete coward who left for a week without calling his boss; it'll be a miracle if I'm not fired. How will I take care of Emily without a job?</p><p>I'm an idiot. God, how did I fuck this up so badly?</p><p>I dial Margie's number and her cheerful greeting relaxes me a bit. \"Hey, Marge, it's Ethan.\"</p><p>\"Well hey, Sugarplum. How was your vacation?\" She knows I wasn't on vacation, and I try to discern if there is sarcasm in her voice, but I can't seem to detect any.</p><p>\"Margie, I wasn't on vacation.\"</p><p>\"Sure you were, kid. It's on the schedule; I approved it myself. There's paperwork and everything. The owners are glad you finally took some time off. You had more than three weeks coming to you. It makes them nervous that you've never taken a day off in five years.\"</p> <p>I'm confused and my silence must confirm this to my manager. \"So, are you coming in tomorrow? I'm down a cashier and could use ya.\"</p><p>Cashier? I'm a \"back of the house\" guy. The \"make sure there's always chips on the display\" guy; low man on the grocery store food chain.</p><p>\"Uhhhh...\" is my incoherent reply.</p><p>\"It's time you take on more responsibility, kiddo. You have that pretty girl to take care of.\"</p><p>She knows. She knows about Emily. How does she know?</p><p>\"I'll see you tomorrow, Ethan.\"</p><p>I'm left holding the phone wondering what the hell is going on. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So far I've cleaned the bathroom, the oven, the refrigerator and vacuumed - twice. It's after nine and Emily still hasn't shown up. I'm starting to think that her things are simply a mirage, or maybe she just didn't want to carry a lot of junk with her.</p><p>Maybe she's staying with one of her school friends, and she didn't need her hygiene stuff. Maybe my earlier thought about what she would need to do for money wasn't that far off the mark. Maybe she's out doing something dangerous, or worse yet, something has already happened to her. There's no one but me to know she's missing. How long do I have to wait before I turn her in as a missing person? I know she has to be missing for at least twenty-four hours, but maybe she's already been gone for a couple days. Oh, God - what if she's hurt and lying somewhere. Maybe she only has minutes left and I can't get to her in time...</p><p>\"Ow!\" I hit my head on the bottom shelf of the linen closet, cleaning the dried and caked shampoo from the floor when the sound of the door closing startles me.</p><p>\"Emily?\" I hope it's her. If it's not, I'm going to call the cops and lie and tell them she's been missing for days. I hear the slapping of tennis shoes against the linoleum, then a thud on the carpet. I turn and look down the hall to see a brown-haired beauty face down on the floor.</p> <p>\"Emily? Are you okay?\" I almost - almost - laugh when she looks up at me with her hair tangled in her face.</p><p>\"Ethan, it's you! It's really you!\" She scrambles the rest of the way to me on her knees, spitting her hair out of her mouth and hugging me tighter than I can ever remember. Her smile is brighter than a sunny day at the equator. We settle on the couch, still holding on to each other. I can't seem to let go. I never want to let go.</p><p>\"Where have you been?\" There doesn't seem to be any anger in her tone. How could she NOT be angry with me?</p><p>I'm ashamed at my answer. \"I drove. I didn't really go anywhere. I was just running away, Emily.\" I hang my head, embarrassed that I don't even have a good reason for leaving her.</p><p>\"I know it won't make any difference now because you probably hate me, but I love you too, Emily. I have since...forever, and I'm sorry I waited so long to tell you. I should have said it to you a week ago instead of running away like the coward I am. But, I can't hold back any longer without you knowing how I feel about you. I've never been in love before, but I'm pretty sure this is what it feels like. I can't think about anything else but you - how you laugh, the way you comb your hair, the way you smell right after the shower... God!\"</p> <p>Something stops my rambling, something soft, warm and moist. Emily's lips are on mine and her arms are wrapped around my neck. She's kissing me, and I don't ever want her to stop.</p><p>Her mouth on mine is awesome! And I think about other things I want her to do with her mouth.</p><p>While there are a hundred synonyms for how kissing Emily feels, the only thing in my head the at the moment is \"woo-hoo\". If I really think about what is actually happening, I'll make her stop. This is wrong - not the kissing part, but the part where she's willing to forgive all my sins and just take me back without a second thought. Now that I'm thinking about it...</p><p>Damn it! Now I'm mad. I pull away while her lips linger. \"Emily,\" I sigh, not really knowing where to start. \"We have to talk about this,\" I motion between us. She nods begrudgingly. It's written all over her face; she thinks I'm going to reject her again.</p><p>\"Look,\" I pull her chin up so her eyes meet mine, \"nothing will change my feelings for you. They haven't changed in the last few years, and they won't change in the next few, either. What I have to know, though, is how you are feeling.\"</p><p>She starts shaking her head, telling me not to worry, but that's precisely the problem. She should be angry with me.</p> <p>\"Emily, you should be upset with me. Yell, scream, hit - anything to let me know how you feel!\" I'm almost shouting near the end of my declaration. I pull back and get myself in check before I completely lose it.</p><p>\"Relieved.\"</p><p>\"What?\" It's a stupid question because I heard perfectly well what she said. It's a stall tactic on my part.</p><p>\"I'm relieved, Ethan.\"</p><p>\"Why aren't you-\"</p><p>\"Do you know how many people there have been in my life who I cared about or who cared about me?\"</p><p>I'm pretty sure I know the answer. I'm hoping it's two, but know for sure it's one - her mother - but I'm always careful not to bring up LouAnne. I just squeeze her hand, which I'm still holding onto like the piece of wood Leonardo DiCaprio was holding onto after his exit from the Titanic.</p><p>\"Two, Ethan. Two.\"</p> <p>Now I'm relieved.</p><p>\"And one of them can't ever come back, but you did. You came back and I don't care where you went or what you did. You are here now, safe.\"</p><p>The tremble in her voice as she says, \"what you did,\" tells me she's a little scared of what - or who - I might have done, so I hope I'm about to put her fears to rest.</p><p>\"I just drove and slept in my car. I ate a few times, but honestly, Emily, the only thing I did was think about you and how much you mean to me. I was an asshole for leaving you. I didn't take your safety or well-being into account and for that, I'm sorry. You should be upset with me.\"</p><p>\"I was scared, Ethan. At first, I thought maybe you were just blowing off some steam, off figuring out a way to tell me to leave, but when you didn't come home that first night or the next morning, I started to get worried. Then Margie came by and said you hadn't shown up for work.\"</p><p>So, this is how Margie knows about Emily.</p><p>\"I wasn't really sure how much she knew, but I could tell she was surprised to find me here. She was so nice though. I told her how highly you speak of her and how much we appreciated the deal she and her husband gave on the car. Then I lost myself for a little bit and told her about you surprising me and taking me to graduation.\" Emily pauses and smiles, then looks down as if she's a little embarrassed.</p><p>\"It was nice to have a woman to talk to again. It reminded me a little of my mom.\"</p><p>Emily continues to tell me about Margie coming to the house. She said she cried for a little bit because she didn't know what to do, that she'd been relying on me for so long. She didn't know what she would do if I didn't come home. She also tells me how Margie asked her about a job and what she liked to do. It seems they went to the public library and Emily applied for a position. She can work there part-time and still go to school. Apparently, she works until closing and that's why she came home so late. Margie also got her a bus pass and rode with her the first time to make sure it was safe.</p><p>There isn't a bouquet of flowers big enough for Margie right now. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Margie's been coming by every night to make sure I have food or whatever. We would talk for a little while.\" Emily stops and looks toward the door. \"I'm guessing she hasn't shown up tonight because she saw the car out front.\"</p><p>I yawn, but not because I'm bored. I could listen to Emily talk forever about the six days I missed out on. I'm exhausted though and the days I went without restful sleep are showing.</p><p>\"You are so tired, Ethan. We can do this tomorrow.\" Her hand slides down my face as a warm smile takes over her features.</p><p>I stand to head toward the bedroom, and she turns to make her bed on the couch.</p> <p>\"Emily?\" I question her. \"I was hoping we could go to bed.\" The, \"well, duh,\" look she gives me, and then returns to making her bed tells me she's not understanding my meaning. \"No, ummm...\"</p><p>Why am I so nervous to say this?</p><p>I roll my eyes at myself.</p><p>\"Like, together,\" I say as I step to the doorway of the bedroom, \"in here.\"</p><p>Her eyes get huge, owl huge, and I realize my mistake.</p> <p>\"No! Not like that. I just....\" I have messed up so much; I want to get something right, so I pause and collect my thoughts.</p><p>\"No more sleeping on the couch, Emily. We're adults who love each other. I don't want to be apart anymore. Come to bed with me and sleep. Nothing else.\" I want her to understand that I'm not pushing. I want her close, but I don't want her to be uncomfortable. This is a monumental step forward for us.</p><p>\"You, me, pajamas, and sleeping...\" I decide that perhaps a little lighthearted humor won't hurt. \"And maybe a little more of the kissing.\"</p><p>I will behave.</p><p>I put on full length pajama pants - over my boxers - and t-shirt.</p><p>I get under the sheet, lie flat on my back and cross my hands over my stomach.</p> <p>I wait. Patiently? No.</p><p>Emily enters the bedroom from the bathroom, and I can tell she's nervous. I'm not sure if her anxiety is because of the prospect of sleeping with me or that she is wearing a tank and panty set I'm pretty sure was intended for a toddler and not a full grown woman.</p><p>I can see her nipples.</p><p>And her...I'm definitely in trouble.</p><p>Do I tell her?</p><p>I have no idea what the protocol is for divulging sexual history to a prospective mate.</p><p>Mate?</p><p>I roll my eyes at myself again as images of Emily and me wrapped in fur coverings shoot through my mind. I'm running around with a spear shouting, \"Me man, you woman.\" It's totally ridiculous that I've reverted to a prehistoric mindset. If I were a caveman, I'd have an easier time with the subject at hand. I'd just grab Emily and shove my penis in her vagina with nothing more than grunts. Being without conversational language skills has its advantages; there's no way to explain everything.</p> <p>My thoughts have veered off course, and I need to focus on the woman crawling up the bed like a cat hunting a mouse.</p><p>Even though I haven't admitted it to myself, this is one of the reasons I'm so afraid of this thing with Emily. Sex and the topic of sex have always been off the table with her. We have never discussed previous experiences. I'd always assumed Emily was a virgin, but maybe it was just wishful thinking on my part since she came to me at a young age. I'm not naive enough to think that teenage girls aren't having sex. I just didn't want Emily to be one of them.</p><p>Being nervous about Emily's sexual experience, or lack thereof, isn't my only reason for pause. I don't know whether or not I should divulge my history. Part of me thinks it plays a huge part in things, while the other part of me says it doesn't matter. I'm torn and don't know which is right. I know honesty is the best policy, but will it do more harm than good in this case?</p><p>\"Ethan?\" I look up and see those expressive eyes. She needs my comfort and acceptance. Even though I made it clear we are only sleeping tonight, it seems like she is still trying to persuade me to do more. How else would you explain the tiny underwear and feline-like movements? If I don't stop this dead in its tracks now, I know I won't. Things will go too far too fast.</p><p>I open my arms in invitation, hoping she gets the message without hurt feelings. \"Just lay down with me.\"</p><p>Why is she giggling?</p><p>The haze from sleep is slowly lifting, and the morning sun shines through the window. I want to recap the events of last night before I open my eyes and look at the most important person in my life.</p><p>\"Ethan?\" Emily whispers.</p><p>\"Hmmm,\" I answer to let her know I'm awake. Her hand is on my stomach, under my shirt, where she strokes the hair just above my belly button.</p><p>\"Can I touch it?\" Emily breathes in a hushed tone.</p><p>My eyebrows furrow with my eyes still closed.</p><p>\"Touch what?\"</p><p>Another giggle.</p><p>Emily's hand slides down a little further, and a finger dips inside the waist of my pajamas.</p><p>Whoa!</p><p>I grab her wrist to still her movement, but she tugs away. \"I want this, Ethan. I want this with you. Please don't make me beg you.\"</p><p>The last thing I want is for Emily to connect negative feelings to sex with me, but I never came to a resolution last night. I am not sure how much to tell her, but I don't think dwelling on it any longer will help me decide. I'm going to have to throw a bone and see her response.</p><p>\"We need to talk, Emily.\"</p><p>\"Later.\" It's a bold statement on her part, but I can't deny her as her hand moves under my waistband. I'm ashamed to say that I've denied her touch for too long, and I don't want to wait for another second. Her lips move to mine, my mouth automatically opening. I want nothing more than to swallow her whole but settle for the caress of her tongue on mine.</p><p>Her fingers play under my pants, flirting with the idea of moving lower. My hands have been flat against the mattress until now, but I can't stop their journey to her arms, then back. Knowing she is touching me intimately gives me the courage to do the same. My hand floats to the crest of her ass, gliding across her flesh. She moans, giving me the courage to extend my caress to her bare flesh beneath her panties. My touch is tentative because I want to get this right.</p><p>\"Yes,\" comes her strangled plea.</p><p>We continue kissing with nips and tugs of lips and teeth; my hand moves to the top of her thigh, then down to the dip where her ass meets her legs. She pushes toward me, her pussy opening to meet my waiting hand. I don't have to search far before encountering slick skin, eager for my attention. Her breath stutters as my fingers begin to move, stroking her.</p><p>Her hand moves to touch me, her thumb rubbing my head, spreading the pre-cum. Her touch feels so good that I move my mouth away from hers, fearful I'll bite her. Instead, my teeth graze her jaw then continue to move lower. My mouth waters at the thought of tasting more of her. I've imagined what her nipples look like - taste like. I want to know that my fantasies don't compare, even a small portion, to the reality. But this is not a fantasy. This is someone I care about, dream about, someone who matters and this has to be right.</p><p>I pull her tank down, exposing her breasts. My mouth immediately latches on, suckling and lapping at the darkened peak. My fingers massage while my tongue caresses, and in only a few seconds, Emily is panting and writhing. Her head falls to my chest as she stiffens in my arms. I've never felt so satisfied, despite not having my own release. But it doesn't matter, because I know that this is only the beginning. This is the first of many gifts I hope to give her.</p><p>After I make her get dressed completely, we sit at the kitchen table for a much needed discussion.</p><p>\"So, you've never....?\" I start.</p><p>\"No.\"</p><p>While I'm deliriously happy Emily is a virgin, I also know the pain associated with the first time for a woman, and I'm not looking forward to inflicting that. I want to give her pleasure, not pain.</p><p>\"What about you?\" Emily asks followed by a big gush of air. \"Never mind; that's a stupid question. Of course you have. I mean, look at you.\" I open my mouth to answer her, but she doesn't let me.</p><p>\"No, tell me. I want to know. How many?\"</p><p>And there lies the crux of my problem. I'm afraid to tell her, because if she knows, will she still trust me with her most precious gift? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I take a deep breath, steadying myself for Emily's backlash at my revelation.</p><p>\"One.\" It's the truth. There's only been one, but that one isn't simple. I am not looking at her as I say this, so I squeeze my eyes shut tightly, hoping she doesn't hate me for what I'm about to tell her next.</p><p>\"There was this girl, in high school, she was known to...\" I trail off, hoping Emily gets the idea, but she just sits and stares at me. She's going to make me spell it out. \"She was known as the go-to girl for sex. I was sixteen, angry and very curious.\" She's still watching me but begins to fidget. \"She would do pretty much whatever, and I took advantage of that. It was emotionless and a means to an end. She let me take my frustrations out on her, Emily. No matter how angry, depressed, or lonely I was, she let me fill the void with her - in her.\" Her face scrunches, and I can see she's getting the idea. \"It wasn't about love, or even lust, really. It was about me taking. There was no giving.\" I want to drive my point home with revealing the true debauchery in which I'd participated for two years, but I don't want Emily thinking I want her to do the depraved and experimental acts I'd once divulged in. That was a different time and a different me, but there was still an insecurity, despite my experience, I couldn't shake. \"It was all about me, okay? I wasn't there to make her come.\"</p><p>\"So, were you like...\" I can see her trying to put all the pieces together. \"You said you were angry. Were you angry...with her?\"</p> <p>I pause because I don't want to lie, but I don't want to tell the truth either. \"Yes.\"</p><p>\"Did you hurt her?\"</p><p>I take a moment so I can say this right. Hurt can mean many things, but I think Emily means physically, so that's the hurt I respond to. \"No. I never hurt her. It really was just sex, nothing else. I never hit her or forced her. She was always willing.\"</p><p>She takes a deep breath and lets it out slowly as she continues to play with the placemat. \"Did you like it?\"</p><p>It's the question I've been waiting for. Emily wants to know if I want it to be like that with her. \"When a boy has urges, there's little that will stop him from getting to the end. It's like how you fold clothes. How the shirt has to hang just right on the hanger, or the pants creased perfectly. You can't stop until everything is just right and you're satisfied.\" I can't believe I'm comparing sex to laundry. \"But as a man, it's not about how the clothes are folded or hung. It's about the clothes being clean and smelling good. It's about the process, not the end result.\" Jesus Christ, this sounds stupid.</p> <p>\"With you, Emily, I want to feel everything. I want it to be about you and me, us. It's not about the physical result at the end.\"</p><p>\"Okay.\"</p><p>\"Okay?\"</p><p>\"Yeah, okay. I trust you, Ethan.\"</p><p>\"No, to the left a little bit?\" Emily can't seem to find a comfortable position.</p><p>\"Better?\"</p> <p>\"Uh, just give me a sec - \" She winces again and I know this is painful. She tries to hide it, but I know.</p><p>Yep, complete disaster. I never should've agreed to this. It's uncomfortable for Emily, and there doesn't seem to be a way to make it better.</p><p>\"Do you want to try on top?\" I'm grasping at straws. I want this to be a good experience for her.</p><p>\"Are you okay?\" I know she fought back tears when I finally did it. She told me to just do it and get it over with. Not my proudest moment. It's not what any guy wants to hear: \"Just get it over with.\"</p><p>\"Yeah.\" Her confirmation is so small.</p><p>\"Emily, I'm so sorry. I - \" She interrupts me with her hand over my mouth.</p><p>\"Please stop, Ethan. It won't always be like this. My mom...\" her pause indicates that bringing up her mother is still hard for her. \"My mom told me about sex. She said it would hurt the first few times, but she also told me that if I was with the right person it would be okay. I'm with the right man. You are right for me, Ethan. No one, and I do mean no one, has ever taken better care of me than you have, and, I know that you wanted this to be perfect, and it was. Please don't take that from me.\" Emily pauses to kiss me before she finishes.</p><p>\"My first time could have gone so many ways, but it didn't. It was with someone that loves me, and who I love.\"</p> <p>I can't help the sheepish smile that spreads across my lips. I decide Emily is so wise and mature and right. It was perfect - because it was us.</p><p>\"I really like the third one we looked at.\"</p><p>\"I do, too, but the second one had a gym, remember?\"</p><p>Emily and I sit at the dinner table looking over brochures. We spent the day looking for an apartment in a better neighborhood with more amenities and a much higher monthly payment.</p><p>I'm a little concerned about finances, but Emily assures me we will be all right. She's getting her schooling paid for on a Pell Grant and working 25-30 hours a week, which is a big contribution. And me...well, I'm the new Assistant Manager for Ball's Grocer. That may not be a big deal for most people, but to me it's everything. I've never had a need to be in charge of anyone or anything. I just wanted to take care of myself, lay low and live one day at a time.</p><p>However, Margie just wouldn't let it go. She promoted me to cashier and kept on me. She was always in my ear talking about providing for my family. At first, I was defensive because I didn't have a family, but the more Margie talked, the more I realized she was right. Emily was my family, and maybe someday we could add to that. When the opportunity came up last week for an assistant manager position, Margie was there telling me to get my ass in gear and apply. She coached me through the interview process and helped me write a resume. I insisted that a cashier didn't need a resume, but she wouldn't let it go, and I'm glad she didn't.</p><p>\"So if we get the one with the gym, are you going to become one of those gym rats? Always workin' out and flexing their muscles for the chicas?\" While Emily wasn't one to get upset about me doing stuff without her, she still had a bit of a jealous streak. She says that girls used to leave me alone because I gave off some vibe, but now that we were together, Emily insists that other women thought they now had a chance.</p><p>If they only knew. My head hadn't turned toward another woman since the day I met Emily and that wouldn't change in the foreseeable future.</p><p>\"Well, I was just thinking - \" Emily looked down, unsure of what she was about to say. I hated it when she did that. I reached for her hand, cupping it in mine to encourage her to go on.</p><p>\"I know that the gym on site is a big plus, but it's only a one-bedroom. The other one is a two-bedroom, and it's close to that elementary school.\" She turned red, blushing furiously.</p><p>\"Yeah, but what would we need a second bedroom for?\" I had to admit, while not necessary, it would be good for Emily to have her own area for studying.</p><p>\"Well, it would be good as an office...and maybe someday, a bedroom...\"</p><p>\"I guess we could use a guest room, but we never have guests, Emily, so I'm not sure what the benefit would really be.\"</p><p>Yeah, I know, I'm an idiot.</p><p>\"That's not what I meant - \" but she didn't need to finish. As I flipped through the brochure, I saw a picture of a couple with a toddler. The tagline was promoting the family friendly atmosphere.</p><p>\"Yeah, I think you're right. The two-bedroom is our best bet.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This has to be perfect. Ethan is the most amazing man, and I don't want to disappoint him. So everything has to be flawless. Margie has been a huge help, though, and I don't think I could have - or would have - done this without her.</p><p>Sometimes I'm so out of my element with this whole love and relationship thing. I know Ethan has more experience, but still... I want him to know how much he means to me. Margie had me over for a girl's night where we watched what she called \"chick licks.\" She insisted that the surest way to be able to pull off the perfect anniversary was to see examples of perfect love on the big screen, or a forty-two inch, anyway.</p><p>We started brainstorming and came up with a plan; a pretty good one if I do say so myself. Now I just have to make sure I don't mess it up. So here I am, standing in the middle of our living room in a new black and pink lace lingerie set and enough lit candles that I may, in fact, set off a smoke alarm.</p><p>Of course, Ethan has seen me in much less that bra and panties, but these seem...dirty somehow. Because of the purpose for which they are intended, the pink and black lace seems obscene. I hadn't wanted to get the \"tonga\" cut, but Margie insisted it was the look needed for the occasion. I'm more of a cotton brief kind of girl. All the panties we looked through were so small... and in bright lacy colors, nor did they seem practical. I really hope Ethan doesn't expect fancy panties all the time because I cannot see the practicality of wearing this style on a daily basis. Particularly if one has to frequently bend or stoop</p> <p>I glance at the clock on the wall, which was purchased at Hobby Lobby, thank you very much, and know that Ethan will walk through the front door at any moment. I shouldn't be this nervous, but we have grown so much together in the last year, both in heart and mind. I know without a doubt I will be with this man forever, and I want to experience every last thing imaginable with him.</p><p>When I hear the key in the door, I close my eyes and take a deep breath. Within seconds of the door opening and closing, I hear a loud gasp followed by, \"Holy shhiiittt.\" Ethan is in front of me, hands exploring my backside after only a few seconds. I wonder if he sprinted, even though the distance from the door is only a few steps. It makes me relax, realizing he appreciates my gift a great deal.</p><p>\"Baby, you smell so good,\" he whispers. His lips-- then teeth skim my neck and shoulder. The contrast in sensation takes my breath away.</p><p>\"Fuck. What did I do to deserve all this? And you?\"</p><p>I'm frozen for a second because I think he's forgotten what today is. He thinks this is just a random tryst. And while we are extraordinarily honest with each other, I can't bring myself to tell him what this is really about. A pang shoots from my heart down into my stomach.</p> <p>\"Whoa, whoa...\" Ethan pulls away and looks at me. I try to smile, but it's wholly unsuccessful. It makes my throat tighten more, and I need an escape to the bathroom to shed unwanted tears. This isn't how it's supposed to go! He's supposed to see me, sweep me off my feet, pledge undying devotion, and make love to me for hours.</p><p>Damn you, Hollywood! You're a liar.</p><p>\"Emily, what's wrong? What did I say?\" He turns away from me at the moment my lips quivers. He's fisting his hair, mumbling to himself. Even though I still have on a bra, panties, and stupid black heels Margie insisted made the look perfect, I've never felt more exposed. I want to sink into the carpet, wishing the last half hour hadn't ever happened.</p><p>Stupid, Emily...why do you always have to do something different or fancy? Why not just make fried chicken for dinner and get him a nice card, I argue with myself.</p><p>\"Shit! Why did I have to say something stupid on our anniversary? I try, Emily. I want to be good for you, I do. I just can't get it right, ya know? God, please say something.\"</p><p>...stupid on our anniversary...</p> <p>\"You know it's our anniversary?\" I could have heard incorrectly.</p><p>\"Well, yeah. How could I forget our anniversary? I can't forget a thing about you, Emily.\" He starts to walk toward the couch and grabs my hand, pulling me behind him. He flops down then pulls me into his lap. His thumb graces the outer edges of my smile. He didn't forget.</p><p>\"I remember that you hate high heels.\" His hand ghosts down my leg and then draws my leg up. He grasps my spiked heel and slips it off my foot. He tosses the shoe to the floor before he begins to rub my toes.</p><p>After a few moments, his hand slides up my arm to my neck, landing on my earlobe. \"I remember that you only wear stud earrings because you're afraid of getting them caught on something.\" His tongue snakes out a lightly traces the tip of my ear.</p><p>\"I also remember that you don't wear necklaces....\" His hand floats to cup my neck and then draws a finger down my breastbone and into my enhanced cleavage.</p><p>Ethan shifts on the sofa and pulls something from his pocket. He hands me a small black box with a red bow.</p><p>\"But I'm hoping to change that.\" Ethan finishes. I open the box and see the most delicate, yet beautiful necklace. A small silver disc holds the date we pledged our love for each other. One year ago, today.</p><p>I find that I can't resist this thoughtful man. Not only has he not forgotten our anniversary, but he has also purchased the perfect gift. I seductively maneuver myself so that I'm facing Ethan. I straddle his lap and then kiss him like my life depends on it. \"It's perfect. You're perfect,\" I mumble in between kisses.</p> <p>I always get this feeling when Ethan and I are about to do it. It's still a million tiny butterflies bouncing in my stomach trying to break free. Honestly, it's the best feeling. The greatest part, though, is that each time is better than the last. I'm not sure if Ethan has been swapping stories in the stock room - although I doubt it, it's not his style - or reading up on the internet, but things have really...exploded for us in the bedroom department. There was a Get-to-know-you period, which was followed by the Awkward-movements period. Then there was the This-works-so-let's-do-it-this-way-all-the-time period. Lately, we'd found the \"Life is like a box of chocolates...\" period. And let me tell you, I may not know what I'm \"gonna get,\" but that shit is good. \"Chocolate\" is never a bad thing.</p><p>\"And I remember,\" Ethan pauses, breathing me in. \"You love it when I kiss you here,\" he finishes and then sucks my nipple into his mouth. The contrast in sensation of his soft, wet mouth and the lace fabric has me beyond aroused.</p><p>\"New rule: all panties must be like this.\" His hands rub across the exposed flesh of my butt, grabbing a handful of cheek to accentuate his point. Ethan's kiss is now languid, his tongue reaching out and teasing my body. As he moves upward, our eyes connecting once again, he beckons my mouth to open and allow him inside. I'm totally lost to this man and would submit to anything he wanted but after a few moments, I remember I have a plan.</p><p>\"Let's move to the bedroom,\" I say in my most seductive voice. \"I have more surprises for you.\" Before I even have a chance to stand, Ethan grabs me and stands, coaxing me to wrap my legs around him. He doesn't carry me like this often, but when he does, there is no safer feeling in this world. He is totally supporting me, exerting his masculinity. I feel small pressed against him - a protector and his charge. \"I love you,\" I whisper and rest my head on his shoulder.</p><p>The journey down the hall to the bedroom is too short. I could stay wrapped up in Ethan this way forever, but I have a massage to render, so I regrettably pull myself from the security of his arms.</p><p>\"Clothes off and lie down,\" I command. Ethan raises a brow at me, showing he's a little shocked by my demand. His smile, however, tells me he likes it. He quickly sheds his clothes and lies face down on the bed.</p><p>\"No peeking,\" I say while removing my bra and panties. I grab the oil from the nightstand and pour a liberal amount in my palm then rub my hands together. I slide my hands over his back and down over his backside, eliciting a moan from Ethan before I move myself into position. I shift and sit on top of his butt, cautious about fully putting my weight on him. \"Is this okay? I'm not too heavy, am I?\"</p><p>His barely intelligible grunt of no helps me relax a little more fully on top of him.</p><p>Per Hollywood protocol, I've trimmed myself so that I'm mostly exposed. I can't help but grind against him, my bare skin seeking friction with his.</p><p>\"Emily, that feels so good, but I can't stand it. I gotta turn over and see you.\"</p><p>I rise up to allow Ethan to turn. His hands immediately glide up my legs, his thumbs moving inward. They brush against the smooth skin that hides my clit.</p><p>\"Say it for me.\"</p><p>I know what he wants, as it has been Ethan's new fascination. I turn red because no matter how many times I say it, I know it will embarrass me.</p><p>\"Come on, say pussy for me. Tell me how you want my tongue on your pussy, then your mouth on my cock.\"</p><p>I respond with a small yet nervous laugh. \"Come on, my sweet baby girl,\" Ethan coaxes.</p><p>Anything for this man...</p><p>\"First, Ethan,\" I begin with a little attitude. I can do this, and possibly without giggling. \"I want my mouth on your cock.\" I make sure to punctuate the word cock. \"Then I want your mouth on my... pussy. And after I've screamed your name...I want your cock in my pussy,\" I say wanting to add a little naughtiness.</p><p>That should do it.</p><p>\"Holy - \" Ethan doesn't finish his thought as his words are replaced with vowel sounds when my mouth takes him in. It took me a few tries to get used to the idea of his...cock...in my mouth, but now there are times I crave it. Ethan says the same thing about going down on me.</p><p>\"Bring that pussy up here. I need you in my mouth. God, Emily, I - \"</p><p>I know what he means, even though he doesn't finish saying it. It's always like this, and I hope it always will be. Sometimes, I think I could just come without him touching me; just thinking about his hands and mouth on me is enough. I feel like this level of obsession can't be healthy, though and I shouldn't want someone so much, so often.</p><p>\"Oh fuck....fuck, fuck. Emily, stop.\" Ethan lifts me off of him and lays me on my stomach. He licks down my spine and softly bites my ass. His hands grab at my flesh, separating my cheeks. \"Push your ass up a little, baby. Let me see that perfect little pussy.\"</p><p>Unnnfff...</p><p>As soon as I comply, his tongue is back on me, tasting me. He's a master at this now. His thumbs rub at my clit while his tongue lavishes attention to my pussy. It only takes a minute before I'm panting and trying to grind my pelvis into the bed. \"Nuh uhh. Keep those hips up,\" Ethan reminds me.</p><p>As much as I enjoy this, I really want the main event.</p><p>\"Ethan,\" I moan. I hope my needy groan tells him I can't wait anymore.</p><p>\"Don't beg. Never beg, sweetheart.\"</p><p>Ethan pushes me forward, and my chest is now pressed into the mattress. He holds his cock and strokes me a few times before drawing back and sliding inside me. The description of fullness seems so trite, but it's the most accurate description. When Ethan enters me, we are connected, one in mind, body, and soul. \"I wish you could see this, Emily; how my cock glides in and out of you...seeing your wetness on my dick.\"</p><p>Ethan stops and runs his hand down through my lips, gathering moisture. \"Turn over.\"</p><p>He grasps his cock and begins to stroke himself. Within seconds, his lips are back on my breast, tugging at my nipple with his teeth. After a few more moments, he leans back, hooks my thighs with his forearms, and pulls me forward. He wastes no time in aligning himself and sliding home again. With my legs pushed back, he can get so much deeper and I feel him in my belly. His thrusts become aggressive and I know that he's close.</p><p>\"Do you want me to take you this way, or do you want to ride me, so I can see your tits bounce?\" Ethan quickly adjusts himself so that he's sitting up. He pulls me into his lap. \"Or maybe like this, so I can see your perfect face and the glisten of sweat that forms on your nose as you come?\"</p><p>All of Ethan's dirty talk is driving me crazy, and quite frankly, I don't care how we get the job done because I'm ready to burst. He lies back, pulling me with him. His hands knead the flesh of my breasts as I moan and writhe on top of him. \"I want to come inside you, baby,\" he pleads.</p><p>I'll never deny him.</p><p>As soon as we are connected again, we grasp hands, me using him for leverage. The first few times we did it this way, I felt self-conscious, but now I love the feeling of control and power I have to bring him to his end, to coax his lust and love from his body as it spills into mine.</p><p>I meet my climax first, but Ethan soon follows. We collapse together, me still on top of him. I hug him like a child hugs her favorite teddy bear, and feel safe, warm, and satisfied.</p><p>We lay together for a while, just caressing and kissing. It is always like this - the tenderness afterward. We'd never... deep breath... fucked. I adored our lovemaking, but also wanted to know what it felt like to be taken in the dressing room of Victoria Secret or the bathroom stall at a nightclub. But we had time, time to experience all of those things. This was the end of one year in a long line of many. Margie says that's love and I just need to go with it. She explained there is a natural progression and I won't always ache for him. She explained that-- eventually, he'll just be a small pain in my ass.</p><p>\"I love you, Ethan.\"</p><p>\"I love you, Emily. Happy anniversary.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The last five years have been unbelievable in more ways than one. It's been a long, difficult road, no doubt about it. There's fighting...and making up, money problems and tears, but we always make it through, and we make it through together. We are, however, about to experience three of the biggest changes in our lives thus far.</p><p>Margie is retiring and a new manager will take her place. I'm pretty sure I know a candidate who is a shoe-in. Ethan has taken his duties as assistant manager very seriously. Margie confided to me that it would be a proud moment to see Ethan take her place. The salary increase was nothing to joke about either, and this promotion was enabling us to finally buy our own home. It wouldn't be fancy or lavish, but it would be ours.</p><p>Margie has been an enormous support system for both Ethan and me. She's stepped in as the mother figure we both needed as we transitioned to new parts of our lives. One could say that I should have been bitter about a \"stand-in\" mother, but I never saw it that way. She has been my savior more than once, but when I first met Margie, I wasn't sure what to think.</p><p>\"Can I help you?\"</p> <p>\"Well, I was looking for Ethan.\" The woman was small, but spoke with assurance. \"Does he still live here?\" I hadn't known what to tell her. It flashed through my mind when I answered the door that perhaps this was the landlord and someone had reported us. Ethan wasn't supposed to have anyone living with him. I shouldn't have cared if he got in trouble after the way he up and left me after I spilled my guts to him, but I just couldn't be angry with him - no matter how hard I tried.</p><p>\"I'm Margie, Ethan's boss.\"</p><p>I stalled in answering her, debating whether I should invite her in.</p><p>\"Dear...?\"</p><p>\"Oh, sorry - I'm uh...\" I didn't know whether to give my real name. My gut told me that this woman was harmless.</p> <p>\"It's Emily.\" My mother taught me to never give more information than necessary.</p><p>\"Well, Emily, it's a pleasure to meet you.\"</p><p>That day, Margie invited herself into the duplex and into my life. She was there to comfort me as I cried my eyes out and told her the events leading up to Ethan leaving. She hugged me and gave soothing words of encouragement; above all else, she assured me Ethan would return and that I just had to be patient.</p><p>She spoke about Ethan that afternoon as if he were her own son. There was never a disapproving word, only compliments and work anecdotes from the years she'd known him.</p><p>She was also there to support me through school. She insisted, along with Ethan, that I take full advantage of the scholarship I was given. She also wanted me to develop my interests and not just major in something so I could get a job. She told me to pursue what I loved; something I was passionate about.</p><p>\"I think I know what I want to major in,\" I told Margie, the excitement of my revelation radiating in my tone.</p> <p>\"That's great, sweetie. Tell me.\"</p><p>\"This lady came in today with a little boy with autism, and it was so fascinating to watch her interact with him. I think I want to learn more about children and disabilities.\" I was nervous about Margie's answer. Maybe she thought I was a little too ambitious or crazy even in regards to my career path. \"What do you think?\"</p><p>\"I think we are lucky to have you, one of God's angels here on earth. You warm an old woman's heart, Emily. I can't think of a better career choice.\"</p><p>I finished school three years later with a degree in Early Childhood Special Education. Margie was there with Ethan on graduation day, and I think she was the loudest cheerleader in the auditorium.</p><p>\"So, you really want to do this?\"</p><p>I used to be the one that was so unsure of everything and looked to Ethan to be the decision maker. Now, it seems, the tables have turned. He's always looking to me for reassurance.</p><p>\"I do. I know there will be a lot of work to be done on it, but I have the summer off. There is a lot I can do during that time.\" I'd yet to tell him he'd be doing all the painting, but I think - all things considered - he'll be just fine with the tradeoff. \"This house is in a better neighborhood and is a bit bigger. There is room for us to have a home office and a couple spare bedrooms.\"</p><p>The realtor was anxious to make a deal. The house had been on the market for several months due to the \"as is\" sale. She's hovering, not wanting this potential sale to slip away. \"Do you have any questions, Mr. and Mrs. Parker?\"</p> <p>Despite hearing Mrs. Parker every day, hearing it still brings a smile to my face. I grabbed Ethan's hand and led him back down the hallway. \"I think we'll take another look around and meet you back out front.\" I answer, desperate to get a few moments alone with my husband and away from the hovering realtor.</p><p>\"Will you marry me?\"</p><p>Those were the first words out of Ethan's mouth. Not, \"Good morning, Emily. How did you sleep?\" Stunned didn't even begin to capture what I was feeling. My brain wasn't fully awake, and I hadn't registered the small diamond on my left hand. Ethan had placed it there in my sleep and had yet to bring it to my attention.</p><p>The two years before Ethan's proposal had been perfect. Our new apartment was a dream come true, and we'd even made friends with our neighbors Garth and Kim. The guys loved to barbecue, and Kim loved to talk about kids and literature, two of my favorite things.</p><p>\"Emily? Come on! You're killing me here!\" His desperation made me giggle a bit, as if I'd ever tell him no.</p><p>\"Yes!\"</p><p>\"Thank God! I was so nervous.\"</p><p>Three weeks later found us at Powell Gardens in the Marjorie Powell Allen Chapel. We had the ceremony on Friday evening, then a picnic in the nearby fountain courtyard. It was small, just Margie and her husband, Garth and Kim, and me and Ethan. We didn't have a honeymoon, but that was okay. Someday, we'd get there.</p><p>\"So what are you thinking we can do with this room?\" Easy, Emily, don't rush it. Make it perfect, I tell myself.</p><p>\"I'm sure you'll want a place to set up shop at home to work on your lesson plans and stuff.\" Ethan walks into the room and steps to the large bow window. \"This window will give you a lot of natural light to work by,\" he finishes.</p><p>\"Yeah, but I think the smaller room down the hall will be good for an office space.\" Deep breath, this is it. \"I think this room would be perfect as a nursery since it's right next to the master and has its own quarter bath.\"</p><p>Wait for it....</p><p>It takes longer than I think it should for it to sink in. I've counted to thirty before he turns around and stares at me blankly.</p><p>I move my hand down to rest on my still flat stomach. His eyes widen and his mouth falls open.</p><p>After a long pause, I give him a nod of confirmation and my eyes flutter closed for a couple seconds.</p><p>\"You're...?\"</p><p>I simply nod again.</p><p>\"Seriously?\"</p><p>\"Seriously.\" I don't even think my reply is completely out of my mouth before he's crossed the room and picks me up. He swings me around, hugging me tight. He's mumbling, \"Oh my God, oh my God!\" over and over into my breasts. I half expect him to sneak a motorboat in there while he's at it. I just grip his head tighter, relishing the moment.</p><p>He finally sets me down and kisses me. This is the happiest I've ever seen this man...the man I love and worship and would do anything for.</p><p>\"Thank you, Emily. Thank you for giving me everything I've always wanted, a family.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's something I want to do, babe.\"</p><p>Emily stands silent, looking at me like I'm a two-headed monster.</p><p>\"Please say something.\" I really can't handle the silence. \"It's crazy, I know. Just say it's a bad idea.\" I feel like a balloon deflating.</p><p>My wife slowly moves to where I pace in front of the couch. \"Ethan, after fifteen years together, you still have the ability to surprise me.\"</p> <p>Her expression has softened. This means she's going to let me down easy. That's just Emily. She never says no, never yells, and never makes me feel guilty... she'll just phrase something so I realize how fundamentally bad the idea is; and trust me, there have been some terrible ideas over the years.</p><p>\"You are the most virile, yet sensitive, man I know...\"</p><p>Here it comes, the compliment followed by the let-down. \"Let's make the appointment.\"</p><p>I know I look like, as Mark would say, \"a total douche\" right now. My son has many great qualities, but his honesty is often overwhelming. Nevertheless, I find that he's rarely wrong.</p><p>\"Um, what?\" I need clarification, because it sounds like she just agreed to this.</p> <p>\"I said, set up the appointment. We have been through so much, and we know what it's like, Ethan. If we can provide someone else with the opportunity to live in a safe environment, to grow, and be part of a family, then let's do it.\"</p><p>Emily wants to do this; with no reasoning, and no explanation, she agrees to this life-changing idea. I know my wife is an extraordinary person, and today she proves there are no exceptions.</p><p>\"Should we talk to Mark first?\" I want this to be a family decision, and this affects our son as well as Emily and me.</p><p>\"Your son takes after you in the compassion department, sweetheart. I don't think we have anything to worry about. As a matter of fact, I think you'll find him to be a little excited about the news.\" As usual, it seems my wife may be privileged to information I am not.</p><p>\"It will be hard, Emily.\"</p><p>She smiles.</p> <p>\"Nothing worth doing is ever easy, Ethan.\"</p><p>\"Welcome to Cornerstones Ministries, Mr. Parker.\"</p><p>\"Thanks, Erin, I'm excited to do this.\"</p><p>\"We are exceptionally pleased that you have returned to us as a mentor. As you know, sometimes our stories don't have happy endings. So, to have one of our own be a success and want to come back and mentor...\" I almost think she'll cry. \"It's special to us to have you here, Ethan.\"</p><p>After Mark was out of the toddler stage, I decided to volunteer for ongoing work with kids placed in \"the system.\" They were there for a variety of reasons, not just those abandoned by their parents or abuse/neglect cases. I was supposed to do tutoring, mentoring, or classroom/school assistance, but honestly, I just wanted to take the kids to a ball game or whatever, just to give them something normal.</p><p>Tanner was my fifth Buddy.</p><p>\"I have something a little different this time, Ethan - if you're up for it.\" My previous Buddies had been kids from group homes where there was no family involvement.</p><p>\"Tanner is seven. He lives at home with his mom.\" Erin's face begins to redden a bit. \"She has a terminal cancer diagnosis; they've given her about six months. There's no family, so Janice has decided to begin working with us for possible foster placement or adoption.\" Erin sets down her pen and looks at her hands. I can tell this one has gotten to her.</p> <p>\"We need someone to fill the void. Jan is so sick, and she can't do much with Tanner. Is this something you think you could handle?\" The way she's looking up at me tells me there's something else. I give her a look that suggests I expect as much.</p><p>\"He...\"</p><p>I take a deep breath, bracing for whatever it is.</p><p>\"He's also autistic.\"</p><p>I went to the library and read every journal article I could get my hands on. If I was going to mentor this kid, I wanted to know what I was in for. Emily was awesome, too. She gave me a lot of strategies for working with him given his limited communication capabilities and responsiveness. Erin also recommended I take a course in dealing with behavior as Tanner had frequent... meltdowns. While a typical child has tantrums, he would have fits lasting hours. No amount of coaxing or pleading would make a difference. Tanner would harm himself and others in the process, but it never detoured our decision to keep him.</p><p>The first month was a little rocky, and by rocky I mean there were huge fucking boulders. However, it never crossed my mind to give up on Tanner. Not only was this kid watching his mother die, he couldn't even express how he was feeling about it in a typical manner. His expression manifested in screaming and biting instead of crying or saying he was sad.</p><p>Outings were always... interesting, to say the least. The last seven months had been better, though. I'd learned what his triggers were by meeting with his behavior therapist so I could keep up with his program and provide some consistency.</p><p>The last couple of months, we'd gone to a restaurant, eaten an entire meal, and left again without a tantrum. There was definite progress.</p><p>Last week, Erin had called with news that Janice was in the hospital and being moved to hospice. They would provide comfort and care in her final days. Erin let me know they were going to set up some panel interviews for prospective foster families and asked if I could join them.</p><p>While none of the families were bad, none of them were good - at least for Tanner. When I asked them how they would deal with his special needs, there was usually a long pause, followed by an unsure smile. That told me they had no clue, and that worried me.</p><p>Emily and I went to Cornerstones the day after I came home with the idea of taking Tanner. She said I was there when she needed me, and now someone else required my attention. Erin was encouraged by my - our - decision to take Tanner. She felt he would continue to make strides with our family, even after Janice passed. There seemed to be a collective sigh of relief that a plan was in place.</p><p>\"So, it's official. The Family Services worker approved your application. You will be Tanner's foster family for the next year. At the end of that year, should you still wish to pursue it, you can petition for adoption. The judge granted and signed a temporary placement order for Tanner to live with you. When Jan has...\" Erin can't finish, but I know what she's getting at, so I finish for her. \"Then, we'll get permanent guardianship.\"</p><p>\"Yes.\"</p><p>The judge signed the order for temporary guardianship at 3:07 this afternoon.</p><p>Janice has been in a drug-induced coma for the last three days, and has no knowledge of Emily's and my intent to foster Tanner.</p><p>\"Do you think we should go see Janice and tell her? I know she's unconscious, but then I'd at least feel like we were somehow asking for her bless - \"</p><p>I don't finish as Emily's phone rings with Erin's special ringtone. \"When I see your face, there's not a thing that I would change, 'cause you're amazing just the way - \" Fucking Bruno Mars.</p><p>\"Hello.\"</p><p>We left the courthouse ten minutes ago - Erin must've forgotten to tell us something.</p><p>I glance to Emily as she listens to Erin on the other end of the line. Her smile softens and then her face turns grim. I suddenly wonder if there is a problem. I look up in the rear-view mirror at Tanner. He's sitting stock still and perfectly straight in the seat, looking out the window. Mark can tell something is wrong, but he stays silent waiting for us to say something.</p><p>\"Oh.\"</p><p>Then, Emily nods as if Erin can see her. Her eyes are turning glassy and I know what that means. I pull over to the side of the road. Tanner begins to rock since the car has stopped and then starts to moan. The longer we sit still, the louder his moans get.</p><p>I reach for Emily's hand, my silent question waiting for verification.</p><p>\"She passed at 3:12 p.m. It's like she knew, Ethan.\" Emily begins to cry while Tanner groans. \"She knew he was okay.\"</p><p>I think Tanner knows, too. People assume he doesn't understand because he can't express it, but I think he does.</p><p>Now, I'm torn. Do I comfort my wife or my new son? \"Let's move to the back seat,\" I whisper.</p><p>We sit on the shoulder of Route 35, in the back seat of our two-year-old Corolla, embracing each other. Emily and I sandwich our boys between us as Tanner continues to rock and hum.</p><p>\"This, too, shall pass,\" my wife whispers as she - we - hold our new family together and continue living. </p> </body></html>"]