["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>~TRYSTAN~</p><p>The words hang in the air before falling to the ground like lead. Trystan offers the woman a crooked smile as he steps away from Brie. “You’re mistaken, although I’ve heard that I’m hotter than Day Jones.” He winks at the reporter before turning toward his locker. Trystan’s mind is reeling a mile a minute. All he could think to do on the fly was to deny the whole thing. There’s no way they can prove he’s Day Jones.</p><p>The reporter is momentarily stunned, but Brie laughs and catches his shoulder. “Trystan! Tell her the truth. Tell her that you’re Day!”</p> <p>“I’m not Day Jones.” Trystan is wearing his most charming smile, trying to hide the knots in his stomach, and then he does what he always does when things get unbearable – he acts his way out. With enough charm and vibrato, no one sees what’s real and what’s not—well, no one but Mari. He scans the hall for her, but she’s not in sight.</p><p>Brie laughs that high pitched giggle that drives him insane as her catlike claws drift up and down his arm. “Oh, come on, Trystan. Everyone knows. There’s no reason to be shy about it anymore. Tell the reporter what you told me.”</p><p>He gives Brie a blank look before responding to the reporter. “I have no idea what you’re talking about. It was nice meeting you, but I need to get to class.” Trystan intends to shoulder past the crowd. People are speaking in hushed whispers, trying to figure out what’s going on. About half the group believes him. Good. Tucker catches his eye from across the hall. The teacher’s arms are folded across his round chest while he watches the situation unfold. Just as Trystan starts to leave, Brie catches his elbow.</p><p>“You’ll have to forgive him for this. When he wrote that Day Jones song, Trystan swore that he’d never tell anyone about it, but it was for me. See, I have it right here.” Brie holds up a piece of paper and waves it around.</p><p>The reporter takes it and looks down at the sheet. “Is this your handwriting, Mr. Scott?” She tilts the paper so he can see it, but Trystan already recognizes it. It’s the song he wrote for Mari.</p> <p>Brie is beaming and still tethered to his arm. She lets go and steps in front of Trystan, taking the paper and turning it over. “Look at the last line. That’s the original version. He wrote it for me.” Brie is all girlish charm and warm smiles.</p><p>Trystan can see the avalanche of crap hurling toward him but nothing will allow him to side-step it. It’s too late. The paper has damned him. He could deny it, and say Brie’s a lying whore, but what good will that do? They already know. The crowd of students and teachers grows louder. They sense it. The reporter is talking, but her words sound like noise in his ears. A teacher steps up and nods, confirming that the song on the paper is Trystan’s handwriting. Someone shoves a guitar at him, as Trystan stands there unblinking. His mind is caught, reliving the worst parts of his life—and realizing that everyone is going to know. It’s a matter of hours before they dig up the police report from the other night. Trystan shoves the guitar away and shoulders his way through the crowd without looking back.</p><p>CHAPTER 2</p><p>~MARI~</p><p>I’ve never crashed so hard, so fast, before. Trystan tenses next to me when he sees the people around his locker. Before we even make it to his locker, Trystan is engulfed in the mass of bodies, all of which are brimming with excitement. I stand there for a moment and feel sick for him. Trystan is going to hate this. I wonder how they found him, how they know.</p><p>At that moment, Brie steps between us. She takes Trystan’s arm and pulls him forward. Just before she does it, she looks over at me with a sharp smile. Acid fills my stomach. I don’t know how she figured it out, but she did. I feel my feet sliding backwards, moving away from the crowd. Suddenly, Katie is beside me.</p> <p>“Holy shit, Trystan is Day Jones?” She’s smacking gum in her mouth and staring. When I don’t answer, Katie stops chewing and looks over at me. Bright blue eye shadow is painted across her eyelids. “What’s with you?”</p><p>The mob seems to get sucked down the hallway. It forms a chasm between me and Trystan—a gaping hole is expanding and swallowing him—and there’s nothing I can do about it. Katie’s eyes are on the side of my face. Her gaze flicks toward Trystan and then back to me. I hate this. It’s as if I can feel his skin crawl even from here. I don’t see Trystan look up for me and there’s no way to get to him. I turn back and duck around the corner with my heart racing like someone is trying to kill me. I’d pull the fire alarm if it would help him, but nothing will help him now. Maybe this was meant to be? Maybe he needs this?</p><p>Katie’s knuckles wrap the top of my skull. “Hello? Earth to Mari.”</p><p>Jerking my head out of the way, I manage to avoid getting my brain knocked again. “Cut it out, Katie,” I snap.</p><p>“So let me get this straight. You were with Trystan this morning before he was ambushed by reporters, doing God-knows-what in the basement.” She ticks off two fingers as she says it, acting like it’s no big deal, even though it is. I know she wants to scream and giggle with me, but we can’t right then because everything is falling apart. So, last night doesn’t matter, not after this. She senses my worry and it makes her mood drop.</p><p>I have my back to the wall and suck in a huge breath. I keep telling myself that this isn’t bad, but it feels horrible. I nod at Katie.</p><p>“So, you’re still stuck on him and now Brie wants him back, right?”</p><p>“What?” I glance up at her and try to shove away the nauseous feeling that’s making me sweaty. I didn’t think of that. Is that what she’s been doing this whole time? How did I miss it? Jaw hanging open, I manage, “You think Brie wants him back?”</p> <p>She smirks at me and gives me a look that clearly says I’m an idiot. “Yes, for starters she’s a whore and secondly, if Trystan is Day Jones, she’s going to let everyone know that they were together. It’s not like Brie to just be pushed aside, not when something this big happens. Trystan was her first and only long term relationship—well, long term for Brie. Add to the fact that she’s a glory-hog and yeah, there’s no doubt she’s after Trystan.”</p><p>Acid is creeping up my throat and no matter what I do, I can’t calm down. No one knows about Trystan and me, nobody realizes we’re together, and right now he’s not with me—he’s with Brie talking to reporters. I want to slam my head into the lockers, but I don’t. My mind drifts to what things will be like without Trystan. I knew it was coming next year, but I couldn’t picture it until this second. My heart flutters nervously as I realize what it means—no more Trystan to run lines with, no more teasing in the basement, no more friendship, no more anything—Trystan Scott won’t be here, but I will. The hollow space inside my chest fills with dread. I’ll spend the next year waiting to graduate, waiting for college, and trying to manage my craptacular parents without him.</p><p>I shove off the wall and dart down the hallway to the office with Katie on my heels. “Where are you going? Class is that way.” Katie points behind us, but continues to follow me to the office.</p><p>I shove through the doors and hear the women chattering about Trystan, wondering if their golden boy is really Day Jones. They’re excited for him, I can hear it in their voices.</p><p>“That kid needed to catch a break,” one woman says. She’s standing next to the humming copy machine, running off worksheets.</p><p>They look up and see me at the counter. The secretary doesn’t get up from her desk. “Can I help you girls?”</p><p>Katie leans her hip against the counter and shrugs as she picks at her black nail polish.</p><p>Nodding, I say, “I’d like an application for early graduation.” The idea has been bouncing around in my head for a while now, but I was too chicken to act on it. It means defying my father, and I didn’t think I had the backbone, but at this moment I do. At this moment the acceptance letter at the bottom of my sock drawer looks like a way to escape and I plan to take it. The only obstacle is the application for early graduation. It was due weeks ago, so I don’t know what the chances are of the school giving me my diploma early, especially since the principal has the final say and the guy is a stickler for the rules. He’ll probably deny me without even looking at my transcript.</p><p>Katie’s jaw drops and she stares at the side of my face. I never told her that this is what I wanted, or that I was even thinking about it. The truth is, leaving her early will suck, but staying here will suck even more. She gapes at me and a wad of gum tumbles out of her mouth. “You can’t graduate early! Why would you want to do that? Senior year is almost here—it’s time for fun—and you’re going to cut out on me? Who am I supposed to hang out with at senior cut day? What about at lunch? We can finally leave campus. What about prom, Mari?” Katie’s shocked posture says it all—how could you leave me?</p><p>Trying to explain is difficult, but my senior year won’t look like hers because of my parents. “Katie, my senior year is going to be all advanced classes. It’s not going to be fun because my parents won’t let me slack off, so what am I waiting around here for? I could go take the classes at college.”</p><p>The secretary digs through the filing cabinet next to her desk, and then walks over and hands me the paper. She taps at certain parts, including the deadline. “It’s already passed, honey, but it can’t hurt to try. I’ll add it to the stack if you get it back to me by the end of the day.” She winks at me as she speaks. “And if it’s accepted, you walk with this year’s graduating class. You’re cap and gown will cost extra because you’ll be paying for a rush, you can’t get a class ring because it’s too late, and unless you already submitted your college applications I’m not sure who’ll take you this late in the year.”</p><p>Taking the paper, I say, “Thank you.” I stand there filling it out with Katie burning holes into my head. After jotting down the reason, I thank the woman, and head out without another word. Katie trails behind me stomping her feet on the floor much louder than normal. She’s mad, I know she is. “I can’t stay. Not after this.”</p><p>“But, why?” She races up to walk next to me just as the bell rings.</p><p>I can’t say it. The words are in my head but I can’t force them out.</p><p>Just as we round the corner, I see the mass of people standing there by Trystan’s locker, but he’s gone. Teachers are telling everyone to get to class. That’s when I see Brie walking toward me. Her books are clutched against her chest and there’s a triumphant smile on her face. As she passes, she says, “I couldn’t have done it without you. Thanks for leaving that song where I could find it, Virgin.”</p><p>I stiffen as she passes. Her words hit me like a steady stream of bricks. That’s why Trystan’s song was on the floor behind the desk. She must have taken a picture of it last night and printed it out. The reason they know Trystan is Day Jones is because of me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 3</p><p>~TRYSTAN~</p><p>He shoves out the front doors of the school thinking that he’s evaded the reporters, but walks straight into a mob of people. Awh, what the hell? How did Brie get his song and why is her name on the back and not Mari’s? He was too dumbstruck to speak before, but now Trystan’s angry. Without a doubt, he knows that this is Brie’s fault, that she’s the one who called the press, and she’s the one who exposed him.</p><p>Trystan stands there for a second before turning back toward the building. Seth comes crashing through the door next to him. “Come on, man. Let’s get out of here.” Seth’s voice is deep and demanding. It’s like he knows that Trystan wants to run.</p> <p>“Tucker will fail me if I cut,” Trystan blurts it out without thinking.</p><p>Seth shakes his head. “No way. Not after this. Show up for the play tonight and you’re golden. Come on, my car’s around the side and I bet all these pussies parked out front.” Seth is walking down the sidewalk and cuts toward the student parking lot. He ducks through a hole in the chain link fence and Trystan follows.</p><p>A few reporters trail after them, but the camera guy can’t follow. The equipment doesn’t fit through the fence, so they have to walk around. By the time that happens, Trystan and Seth will be driving away.</p><p>Trystan settles into the passenger’s seat and presses his hand to his temple, shading his eyes. Seth starts the engine and they peel out of the lot, cutting into the busy road. Seth floors it, bobbing and weaving through traffic to put some distance between them and the reporters.</p><p>For a while Seth doesn’t say anything, but then he explodes and once he starts talking the words don’t stop. “How could you not tell me? I’m watching all these people gathering in the hallway this morning and thinking, there is no way in hell that Scott is this Day Jones guy because I would have known. He would have told me. I’m the guy’s best friend and shit like this wouldn’t be kept a secret, but what the fuck do I know? Because apparently, you’re all about the secrets, Scott. Do I even know you?”</p> <p>“You’re an asshole if you think you don’t.” Trystan doesn’t drop his hand from his brow. A queasy feeling has been surging through him since he saw the mass of people. His mind drifts to Mari. He’ll have to text her and make sure she’s okay as soon as he can patch things up with Seth.</p><p>“That’s the only thing you’ve got to say? Are you shittin’ me? After everything we’ve been through, you’re seriously going to keep lying to me?” Seth cuts someone off and a horn blares behind them. Seth flips off the other driver and gives the car more gas.</p><p>Trystan looks up from under his hand. “What am I lying about?”</p><p>“Okay, Scott. You want to play it this way? Fine. I’ll play. Tell me if you’re Day Jones. Tell me you didn’t write that song for that skank Brie. Tell me who you nailed last night. Or how about you tell me why the hell someone saw you at the police station.” His gaze cuts to Trystan’s, sharp as glass. The tension in his jaw is enough to make it snap. “Pick one, Scott. I know you’ve been making stuff up, and I figure that’s fine—he’ll tell me when the shit hits the fan—but since that happened, and you still haven’t said two words—”</p><p>Trystan drops his hand and looks over at him. “What do you want me to say, Seth? That I’m Day Jones? Fine, I am. I wrote that song for someone else, not Brie. I don’t even know how she got it. And yeah, I was at the police station, and no, I’m not telling you why, because it’s none of your goddamn business.”</p><p>Seth’s grip tightens on the steering wheel, making his knuckles rise up under his skin. “I see. So where were you last night? Tell me who you fucked ‘til morning, because I know you weren’t at home. You used to tell me that kind of thing Scott, you know, back when we were friends. Choke up a name right now or I’ll toss your ass out of my car—”</p> <p>It’s none of Seth’s business, but the guy is in torch everything and ask questions later mode. Trystan’s been keeping things from him, yeah, but he keeps things from everyone. Well, not from everyone. Mari knows. The vein on the side of Seth’s head is about to explode. It’s throbbing under his skin, making Trystan feel guilty. Maybe he is a shitty friend. So he answers, “Mari Jennings.” But as soon as Trystan says her name, he regrets it.</p><p>Seth turns abruptly, and smashes his mouth shut. Taking the wheel hand over hand, making the tires shriek as the car skids into a parking lot. He slams on the brakes and they come to a quick stop. “Get out of my car, you lying sack of shit. You honestly think that I’d believe that? You didn’t even try to—“</p><p>Trystan glares at his friend, resisting the urge to roll his eyes. Seth is so dense with this stuff. “You think I’d lie and make up Mari? Are you seriously telling me that you can’t see it? I’m with her whenever I’m not with you.”</p><p>“You spend the night at Jenning’s house? You slept with her?”</p><p>Trystan nods slowly, even though he knows that Seth thinks they did more than sleep. “Yeah, I ducked out this morning after her dad got home from work.”</p><p>Seth looks disgusted and disappointed. He tenses in his seat and Trystan’s ready for the verbal onslaught that spews from his friend. “I told you to stay away from her. That family has enough money to bury you and don’t think that her dad won’t do it. The guy is—”</p><p>Rubbing the heel of his hands over his face, Trystan yells back, “I know what he is, but she’s worth the risk.”</p><p>Seth sucks in a deep breath, trying to rein in his temper. Trystan slips down in his seat and stares blankly out the windshield. “So,” Seth finally says, “Everything changes now, right? You go and sign with some company and get rich, while I go and serve four years in some hellhole country that I can’t point to on a map.”</p> <p>Trystan glances over at Seth and his stomach sinks. “You enlisted?”</p><p>Seth nods. “I signed on the line. They own me after graduation.”</p><p>Horrified, Trystan sits up straight. “Fuck, Seth. Tell me you didn’t! Why’d you do that?”</p><p>“Because I thought that’s what you were doing! I thought we’d be shipping out together, but there’s no way in hell you’re doing that now, not with this opportunity. You’ll be rich in a week and have a penthouse in Manhattan. You can leave this shithole behind and nail a different chick every night.”</p><p>Guilt is choking him so hard that he can barely speak. Seth enlisted because of him. Damn it. There’s no way to undo this. It’s already been done. “That’s what you would do.”</p><p>“Nah, I’d have a different three-way every night. I pussied it down for your version of the American dream.” Seth settles back into his seat and tilts his head back. “So what happens now?”</p><p>Trystan sighs and pushes his hands up over the top of his head and down the back of his neck, digging his fingers into the muscle. Every part of him wants to scream, but he can’t. “No fucking clue. But I’m guessing that everyone finds out everything I’ve been trying to keep hidden, and my life becomes a living hell.”</p><p>Seth snorts and smiles at him. “Only you would say that pussy and cash are hell.”</p><p>“Only you would focus on that shit after what happened this week. Life is more than getting laid, Seth.”</p><p>Seth laughs once, like he doesn’t agree at all. “Then spill, Scott. What the hell happened?”</p><p>Trystan works his jaw, thinking about whether or not to tell Seth. In the end, Seth will find out—they all will—so he tells him now. Trystan tells him about his father, about Mari showing up and saving his life, and about the songs he wrote for her. “No one was supposed to give a shit about the videos, no one was supposed to find out about my father, and I sure as hell didn’t want Mari caught in the middle.”</p><p>Seth doesn’t react to anything Trystan says. For a moment Trystan thinks that his friend isn’t listening, but there’s not much to say after something like that. Being beat reminds them both that they’re insignificant.</p><p>Seth finally smirks at Trystan. “Do you want me to mow down your old man?”</p><p>Trystan laughs darkly and shakes his head. “No, he’s not worth it, and I have no intention of seeing him again—ever.”</p><p>“Okay, so let me get this straight—you’re homeless, kind-a, sort-a banging an under-age good girl, you’ve got a father who blames you for his life being shit, and a reporter that wants to publically out you. Did I forget anything?”</p><p>Staring straight ahead, Trystan adds, “Yeah, you forgot vengeful ex-girlfriend.”</p><p>“Ah, yeah. The Skank. I need to make her up a tee shirt that says that in glittery letters. Ten buck says she wears it.” Seth laughs at his own joke, but Trystan is lost in thought. He needs to play his next move well, so that it cuts off all the crap and gives him a sure footing, but Brie and Mari create vulnerable spots in his plans. He can’t figure out how to lose Brie or how to keep Mari from being found out. Damn, if the press realizes that she was there the other night...</p><p>“Scott?” Seth sounds irritated, like he’s been trying to talk to Trystan while he’s been lost in his own head. “There’s only one way to play this hand. Live it. Own it. Claim that title and then the next move is yours. Tell the reporter about your shitfaced father, about how you worked your ass off to keep food on the table, and about Sam giving you a job. It’ll make your fans love you even more.”</p><p>Trystan is staring at the people in the parking lot and realizes that this is one of the last times he’ll be able to move freely. Once they know he’s Day Jones, his life will change. Folding his arms over his chest, Trystan mutters, “I don’t want fans.”</p><p>“Tough shit. Deal with it, Scott. This is your ticket out of this hell hole and the train’s only going one-way. Get on or get run over.” Seth puts the car in gear and drives over to a deli in the center of the strip mall. “I’ll get us some breakfast, knowing you, you didn’t eat. But, when you become rich and famous I expect a hooker or two for my troubles.”</p><p>Trystan laughs. “You make your own troubles, Seth. Hookers are not a good thing to factor into the equation.”</p><p>Seth flashes a ghost of a smile and he nods. After getting out of the car, he leans into the open window. “I don’t usually say shit like this, but I got your back, Scott. Whatever you decide, I’m still your man.” Seth lets out an uncomfortable breath and turns away, and walks into the deli.</p><p>CHAPTER 4</p><p>~MARI~</p><p>Katie fires off a slew of profanity at Brie’s back.</p><p>“I can hear you,” Brie snaps, as she sashays away from us.</p><p>“I know! I’m talking loudly!” Katie is seething. She grabs my arm and pulls me toward the side doors. “There is no way in hell that we’re going to learn a damn thing today. Come on. Let’s get out of here.” Katie pushes through the metal doors and we’re in the parking lot. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If my Dad finds out that I cut—”</p><p>“He won’t, Mari. Who’s taking attendance right now? All the teachers are in the hallway buzzing about Trystan. No one is going to file a cut slip on you.” Her venom for Brie drains as soon as we’re outside. Katie tugs my arm. “Come on. Let’s walk to the deli and grab some grub. Katie hungry.” She says the last few words like Cookie Monster.</p><p>I can’t help but wonder what this means for Trystan, but I bet he’s dreading it. For someone that shines so brightly in the spotlight, he really doesn’t like being in it. The main road isn’t too busy right now. A few of the news vans drive past us. Others stayed and are interviewing Trystan’s teachers. By tonight, it will be on every channel—Trystan Scott is Day Jones. They’ll all think Trystan wrote that song for Brie and I’ll get shoved aside.</p><p>Katie glares at me. “You planning on answering anything any time soon?”</p> <p>“Sorry, what’d you ask?”</p><p>Katie makes an overly dramatic noise and stomps her combat boots. She’s wearing a floral print skirt, knee highs with skulls on the side, and a lacy white shirt with a big sparkly belt. Her hair is slicked back into a ponytail and swishing high on her head. I feel frumpy standing next to her in my flannel shirt and jeans.</p><p>“I said what’s up with you and Trystan?” All the color drains from my cheeks. I can’t hide it. I’ve been blindsided too many times to mask my emotions and keep them off my face. “Okay, let’s pretend I didn’t see your reaction. Come on, use your words, Mari. Tell me what happened.” Katie says it like she’s talking to a toddler.</p><p>My gaze is on the ground when I answer. “I love him, okay. He spent the night last night. The reporters couldn’t find him, because he was with me.”</p><p>Katie stops in her tracks, and grabs my arm. When I turn, her eyeballs are still expanding in shock. “What the hell? You tell me you’re over him and then you sleep with him? As in you guys had sex?” She makes a shrieking noise and spins in a circle. It looks like an angry chicken dance. “How could you not tell me that!”</p> <p>“Shhh!” I shove her past the store front. There are people inside looking out at us. “Damn, you’re loud. And no, Miss Dirty Brains, it wasn’t like that. He needed a place to stay. Trystan’s been coming over for a while, but last night was the first night he stayed.”</p><p>“And your parents—Mr. and Mrs. Rodup D’Ass—didn’t have issues with this?”</p><p>I smile sheepishly. “They don’t know. Trystan was in the closet when Dad came home this morning. I thought we were going to get caught.”</p><p>Katie squeals and slaps her hands over her mouth. “Shut up! Mari Jennings turned into a bad girl. We need to stop at the pet store and buy you a big fat dog collar—the kind with the spikes. Your Dad would so shit himself when he saw you wearing it.”</p><p>Katie makes me smile even though I’m a bunch of tangled nerves inside. “I can’t even imagine what would happen then.”</p><p>“You should totally do it. They take you for granted. It’d serve them right if you went all nutso on them for a while.”</p> <p>I tuck my hands under my arms. “Probably not a good plan. My Dad would sue me or something.”</p><p>“God, your father is a douche. I need to tell him that the next time I see him. I’m pretty sure that your dad and my dad went to Douchiversity together, because they’ve both got that bastard thing nailed. Hey, isn’t that Sexbot’s car?” All of Katie’s sentences flow together, but my gaze follows her finger to an old muscle car running in the parking lot when we finally reach the deli.</p><p>I smile to myself. “It is.” I see Trystan sitting in the front seat with his arm over his face. “Go grab us something. I need to talk to Trystan.”</p><p>“Fine, but if me and Seth come back and you guys are all making out, he’s probably going to want to watch. He’s a perv like that.” Katie laughs and disappears inside before I can say anything.</p><p>I walk over to the car and wonder what I’m going to say. He’s got to be coming unglued. Too much has happened to him, too close together. I walk over to his side of the car and tap on the window. “Hey stranger, or should I call you rock star?”</p><p>Trystan smiles when he sees me. He opens the door and pulls me into the car. I fall onto his lap and he holds on like I’m an anchor. “I prefer kiss ninja. I’ll always prefer that.” Trystan’s hands wrap around my waist and he pulls me in for a hug. Being on his lap makes me so excited and nervous at the same time, but his hands feel good so I don’t wriggle away. He kisses my cheek lightly and the sensation shoots a current through my veins and a soft smile spreads across my lips.</p><p>“So, I see that I’ve corrupted you. It’s not even second period yet and you’re already cutting class.” The smirk on Trystan’s face is so cute that I want to lean in and lick it off. That cocky arrogant smile excites the butterflies that are ravaging my stomach.</p><p>“Ha! As if I could be so easily manipulated by you.”</p> <p>“So, it’s Katie that’s the evil force at play here? Hmmm. I’ll have to study her methods.” Trystan beams and I swat at him, needing him to be serious for a moment.</p><p>“Are you all right?” I ask. After everything that’s happened, I doubt it. Trystan tried so hard to hide this, and now it’s exposed.</p><p>“Of course. You’re here, now. Everything will be fine.” His confident smile falters and his voice loses the token Trystan Scott vibrato.</p><p>“Everything will be fine. You’ll see.”</p><p>He smirks at me. “It sounds better when you say it.”</p><p>“Because I believe it. This can be a good thing, Trystan. You’ll never have to hide from anyone or anything ever again. You just have to be brave this one time, and take whatever crap comes your way, but after that you can live your own life. You don’t have to enlist. Your life is yours now.” As I speak, Trystan’s fingers run through my hair.</p><p>“They’ll know you were there. They’ll know what you did. People will talk, they’ll say things about you and me. I don’t want them to.” His eyes are on the dashboard, like he can’t look at me.</p><p>Tilting his chin up so our gazes meet, I say, “They’re only words, Trystan. Let them say whatever they want. I owe you that much—”</p><p>His blue eyes lock onto mine, confused. “What are you talking about?”</p><p>“I’m the reason the reporters where there. They found out you’re Day because of me.”</p><p>Trystan stiffens and his hands fall to the seat. “You told them?”</p><p>“No, but I might as well have. Brie was in my room, she found the song and recognized your handwriting. I’m sorry. I didn’t—”</p><p>He pulls me to his chest and it’s all I can do to keep the tears from falling. I know Trystan didn’t want this and it’s my fault it happened. “Shhh, it wasn’t your fault. You’re not the one who called them. Why the hell were you hanging out with Brie, anyway?”</p><p>“I wasn’t. I was forced to apologize so her dad wouldn’t sue my father. My mother left her in my room for god knows how long. Brie saw the song.”</p><p>Trystan holds me tighter. “Brie’s my fault, I—”</p><p>Seth chooses that moment to materialize next to the open window with Katie in his wake. They say in unison, “Brie’s a bitter skank.” The two of them stop and this awkward thing happens. Seth looks down at the juice in his hands with a weird expression on his face.</p><p>Katie gapes at him like a docked fish. “Stop stealing my thoughts, perv.”</p><p>Seth comes back to himself and snaps, “It’s not like it’s a novel idea, G.I. Hoe.”</p><p>Trystan groans and slams his head backward into the seat. “I’ll jump out of the car right now if you two are going to fight all day.”</p><p>Seth sees me on Trystan’s lap. “She is not staying. You got some, now you can get out.”</p><p>Katie shoves Seth aside and slips into the backseat. “That’s a suckie idea. I’m not walking home and Trystan isn’t going to let you talk crap about Mari, so keep your disgusting comments to yourself.” Katie opens the bag and holds it out to me. “Bagel?”</p><p>“No! You two are not coming with us!” Seth stands with the door open and is pointing, like we’re bad dogs for climbing on his seats.</p><p>“Yeah, I’m not leaving.” Katie bites into her bagel. “Did you guys get bacon? I swear to God, I smell bacon.” She lifts her nose to the air and sniffs.</p><p>Everyone looks at Seth. He shifts all his weight to one foot and surrenders. “Fuck, yeah. I got bacon and if you get grease on the upholstery, I’ll take it out of your ass.” He holds the bag out to Katie.</p><p>She snatches it from his hand. “Yeah, I’m not into that, but thanks for the offer.”</p><p>Trystan tries to hide a surprised smile, as Katie inhales a strip of bacon before handing us the bag. He asks me, “Is she always like this?”</p><p>“Only when she’s wearing those boots. She goes all Combat Katie and thinks she can kick ass.”</p><p>“She’s got a great ass,” Seth smirks and slips into the car.</p><p>Katie glares at him as she glances at her wooden handbag. “I should hit you with my purse.”</p><p>“What? It was a compliment.” Seth’s smiles in the rearview mirror.</p><p>“Then, you suck at compliments. Why can’t you just learn to secretly leer like everyone else? Damn, Seth.” Katie smiles crookedly and munches another piece of bacon.</p><p>“Who said I wasn’t doing that too?” Seth looks at her in the mirror again. I expect more pointed comments from Katie but she just eats her food like she doesn’t care who’s watching.</p><p>Seth grabs his breakfast, unwraps it, and takes a huge bite before looking over at Trystan. “Where are we going, Scott? The next move is your call.”</p><p>CHAPTER 5</p><p>~TRYSTAN~</p><p>Mari tenses in his lap as soon as Seth and Katie get into the car. Trystan knows she wants to slide in the seat next to him, but he isn’t ready to let her go yet. His fingers lace together around her narrow waist as Seth and Katie attempt to verbally castrate each other. The familiarity makes his raging pulse slow to normal—well, almost. Mari is in his lap. If he lets his mind wander, it’ll go back to her bedroom and run through the things he could have done with her last night if he didn’t have a conscience. Telling her no seemed like the right thing at the time, but now Trystan’s worried that she’ll slip through his fingers.</p><p>There’s no way to hold onto Mari, not with the world going up in flames around him. He can’t even bring Mari with him, assuming he signs with one of the deals that he’s been offered. Mari’s a minor and is stuck living with parents who don’t love her for another year, while he does what? While he becomes famous and she forgets all about him. There’s nothing Trystan can offer her, not if he doesn’t step up and change something.</p><p>The idea of publically professing what happened at home makes him sick. Telling everyone about it seems unbearable, but it’s one barbed hurdle and the reward on the other side is worth risking impalement. Trystan isn’t accustomed to telling people his secrets, but he’s guessing that everyone in the car already knows most of them. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Trystan looks over the seat at Katie. “What do you think I should do?”</p><p>Her jaw drops and she blinks repetitively, batting her eyelashes. Katie presses her hand to her heart and drops her bagel. Her voice drips with sarcasm as she speaks. “Are you really asking me? Oh my God! Day Jones is asking me a question!” She sounds like a crazed fan, and then laughs, falling back into the seat, and taking another bite of her bagel. “Seriously, Scott. Get over yourself. What do you think is going to happen if people know?”</p><p>Trystan realizes that he likes Katie more than he thought he did. She spars with Seth so much that he’s hardly gotten two words in when she’s around. He didn’t expect her to react this way, and that’s good. Mari needs friends like that. Hell, I need friends like that, he thinks, and grins at her. “Okay, wiseass, try again. What happens if I confess and sing? What happens when they know without a doubt that I’m the online legend?”</p><p>Mari cuts off Katie. She sees where he’s going with this, and that he needs to think it through. “The agents that tried to sign you show up, the record labels do the same—”</p> <p>Seth adds, “Except they go to your house, because they think your dad isn’t an asshole—”</p><p>Mari nods and continues, “Then, they find out your stuff is gone. Your dad is a wild card—he could claim you or disown you and say you never lived there—and since he threw out all your stuff—”</p><p>Katie cuts her off. “Your dad threw out all your stuff?”</p><p>Trystan doesn’t answer. Seth gives Katie the drive-by version. “Trystan’s dad is a shithead and abused him, on and off, forever. Mari almost killed the old guy with a brick the other night, which is what has Trystan on edge. He thinks the press is going to find out and it’ll ruin Mari’s life.”</p><p>Mari turns and looks at Trystan as Katie’s jaw hits the carpet. “You’re afraid for me?”</p> <p>He nods, avoiding her gaze. “I can’t keep them from finding any of that.”</p><p>“They won’t find it, Trystan. My files are gone, my dad probably had them all burned. You know how he is. He didn’t want to sue because he didn’t want to leave a paper trail that could come back and haunt him.” The words stick to the back of her throat, but she manages to spit them out.</p><p>“What if they know we were together last night?” He takes one of her lose curls and tucks it behind her ear. “If someone saw me come or go, then you’d get in trouble and I don’t want to make your life harder than it already is.”</p><p>“Trystan, don’t worry about me.” Smiling kindly, Mari tilts her pretty face to the side. “The worst thing that I had to worry about was Brie, and if this is the best she can do, then I’m overjoyed. Go meet with the suits and pick one. You’ll be good at this Trystan, but you have to want it. You have to own it the way you do when you’re on stage. They’ll love you—all of them—and you’ll be unstoppable no matter what skeletons from your past are aired out.” By the time she stops speaking, Mari has her head tipped in and pressed against his. “Your next move is to let the world know that you’re Day Jones and that you have more songs that are even more awesome than the first.”</p><p>Trystan’s blue gaze is locked with hers. His hand is on her back with his thumb sweeping in slow circles. “I can’t do it your expense—”</p><p>“It’s not. My path is already set. Trystan, I didn’t mention this before, but I applied to a little college not too far from here. They accepted me. Actually, they offered me a full ride—full tuition, fees, room and board—everything. I didn’t mention it because I didn’t think I could go through with it, but...” her words trail off as a smile creeps across her lips.</p> <p>Katie butts in, “But she’s going through with it. Little Miss Secrets here just submitted an application for early graduation. She’s ditching me.”</p><p>“No shit?” Seth’s breakfast stops half way to his mouth and he stares at Mari.</p><p>She nods and flashes smiles. “Yeah, I did.”</p><p>Trystan asks, “What about your Dad?”</p><p>Katie’s is the one who answers. She’s sucking on a piece of bacon and removes it from her mouth like it’s a lollipop. “Her dad is going to shit bricks—”</p><p>“Katie!” Mari yells at her, but she’s right.</p><p>“What? It’s the truth.” She chomps on the bacon and starts fighting over the remaining pieces with Seth.</p><p>Trystan turns Mari’s face towards his. There are so many emotions flooding through him that he can’t figure out who he feels. “Are you really going to do it?”</p> <p>“I don’t know. Are you going to admit that you’re Day Jones?”</p><p>His eyes flick to Seth as the guy snort-laughs. Trystan says to his friend. “I walked right into that, didn’t I?”</p><p>“Yup. She played you, lover boy.” Katie uses the moment to her advantage. She grabs a fist full of bacon before Seth can stop her and shoves the slices in her mouth. “Ah! You bitch! You ate all the bacon!” The greasy meat hangs out the sides of Katie’s mouth. She grins and waves the tips of her fingers at him, laughing. “Fuck it.” Seth turns around and pulls a piece from between her lips and eats it.</p><p>“You’re disgusting!” The words come out of Katie’s mouth garbled as she blinks at Seth in shock.</p><p>Trystan laughs and squeezes Mari tight. “Yes, he is. And you—Mari Jennings—you’re diabolical.” She laughs as Trystan tickles her. The little movements of his fingers make Mari jerk around on the front seat like a squirrel on a string. She tries to tickle him back, but Trystan has the better angle. There’s no way to get away from him. Katie and Seth are busy telling them how disgustingly cute they are, and someone threatens to douse Trystan and Mari with juice so they stop.</p><p>Trystan is smiling wide, “So, we’re both going to do it?”</p><p>Mari is grinning at him. “Apparently.”</p><p>“Psh,” Katie interrupts, “that was weak, Mari. Own it, woman!”</p><p>Mari clutches her hands and screams, “I’m going to college early! Wahoo!” Trystan laughs and hugs her.</p><p>“Wahoo?” Seth makes a face. “Isn’t that what the fox says when he falls off a cliff?”</p><p>Katie kicks the back of his seat with her big ass boot. “You’re such a moron.”</p><p>They continue to bicker, but Trystan doesn’t care. He can’t keep his eyes off of Mari’s. Seth notices. “You guys are going to get slobber all over the leather. I’m getting rid of her now. Where’s your house, Mari?”</p><p>Before Mari can object, Trystan slides her into the seat next to him and gives the address. When Seth stops in front of her house, Trystan gets out first and holds the door. Mari slips out and before Katie can crawl out of the backseat, he closes the door. Leaning in through the window, Trystan informs them, “I’m hanging out with Mari. See you at the school tonight.”</p><p>“Mari! You can’t leave me with Seth!” Katie has her face in the little gap between the seat belt and the window. She extends her hand. “Save me!”</p><p>Trystan wraps his arms around Mari and presses a kiss to her cheek. Seth revs the engine. “Trust me, Katie, you don’t want to hang out with them right now. They’re going to be all lovey dovey and shit. Let’s go find something else to do.”</p><p>Seth hits the gas before anyone can reply. As the car travels down the street, Katie turns around and smooshes her face against the back window and gives them both the finger. Trystan laughs and waves at her. “She’s going to kill you later.”</p><p>“Me? You’re the one who waved. She remembers stuff like that.”</p><p>Trystan makes a mental note to never piss off Katie again. Then he turns to Mari and takes her hands. “So, we have an entire day to ourselves. What should we do?” Stepping closer, he slips his hands around her waist and closes the space between them.</p><p>“I might have a few ideas.” She looks up shyly and then laughs.</p><p>In that moment, Trystan is so happy that his chest might combust. “Oh? I thought your parents were home during the day?”</p><p>“They usually are, but today there’s a meeting and some other stuff that they told me about. The general gist was that they wouldn’t be at the house today or the school tonight.” She mimics her dad’s voice, “Because acting is a waste of your talents.”</p><p>Trystan leans in close enough to kiss her. “So, that means that we both have until six o’clock tonight with no parental supervision? That’s a really long time.” His eyes shift to her lips. “Got any ideas?”</p><p>Grinning, she pecks him on the lips, and then tugs him toward the front door. “I plan to kick your ass at Guitar Hero for the first hour. Your ego will be so bruised that you won’t be able to look me in the eye after that—” The rest of her verbal jabs are lost in giggles as Trystan presses her against the front door and attacks her with tickles.</p><p>“Bruised ego, my ass.”</p><p>“I like your ass.” Mari spurts, between bouts of laughter. Suddenly, Trystan’s body is pressed to hers. He steps closer, pressing her back against the door, before kissing her until she forgets to breathe.</p><p>CHAPTER 6</p><p>TRYSTAN</p><p>The bed is soft and it feels good to have Mari against his chest. She’s laying on her side, snuggling into him on top of her comforter. They’ve been lying like this since lunch. Trystan doesn’t remember how they got into the position. They’d been talking, sitting side by side, and now she’s laying in his arms. Tightening his hold around her narrow waist, Trystan feels content. No, it’s past that. For the first time in his life, he’s happy. He can see a way out, a path that leads to something good, and he’s glad that it includes Mari.</p><p>“So,” Trystan says, “When were you going to tell me about the early graduation thing?”</p><p>She shrugs. “I don’t know. I guess I was saving it for when you decided to tell everyone that you’re Day. Have you thought about how you’re going to do it?”</p><p>They talk about it a little bit and decide it should be after the play. Otherwise they fear that the cast will have worked so hard for nothing. Trystan doesn’t want to overshadow them, especially Mari. Plus, kissing her on stage is a moment that he doesn’t want to pass up, and there are several hot kisses in the little production. “Not really. What do you think I should do?”</p><p>“Mmm, as much as I hate to say this, I think Seth is right. You have to own it. Spill the whole thing.”</p><p>“How? I know I should, but knowing it and saying it are two different things.” Her long hair is draped over her shoulder. She shifts and looks up at him.</p><p>“What if we helped? Like me, Seth, and Katie. What if we each said something about why you wouldn’t come forward, so that way when you say that you’re Day Jones, it makes more sense? People are going to wonder why you’re saying it now.”</p><p>“Because they found me. If they didn’t know where I was, I wouldn’t say anything.” Trystan rolls onto his side and leans on his elbow. “I wouldn’t have risked this.” He gestures between them. “It’s too important to me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mari smiles in that girlish way, with the shy eyes, before she slips off the bed. She walks over to her dresser and pulls something out. When she comes back, she sits on the edge of the mattress, and takes his hand. Trystan sits up as Mari drops something cold into his palm—a ring. It’s a thick silver band with strange letters etched onto it. Holding it up between his thumb and forefinger, Trystan asks, “What does it say?”</p><p>“It’s ancient Greek. It says...” her cheeks redden and she looks away.</p><p>When she lifts her gaze, Trystan feels the pull to her. It starts in the center of his chest and travels deep into his bones. Those eyes, that hair, and her voice—there isn’t a more wonderful sound. Leaning in slowly, Trystan lingers within a breath of her lips. He can feel the heat from her skin and although he longs to touch her, he doesn’t. “What does it say, Mari?”</p><p>Her eyes lift and she tenses, seeing how close he is. If her heart is pounding like his, they’re in trouble. Trystan leans in and closes the space, pressing his lips to the corner of her mouth. Mari’s dark lashes close and when she lifts her gaze again, those pink lips curve into a beautiful shy smile.</p> <p>“Tell me,” he breathes.</p><p>“It says ‘my soul is your soul.’ It means you’re part of me and that our friendship is eternal.” She presses her lips together hard and adds, “And it means I love you. When you’re famous and miles away, you can look at it and remember me.”</p><p>“As if I could ever forget you,” He pulls her against his chest and says in her ear, “I love it.”</p><p>“Trystan, I know our lives are about to change and I want you to do what you need to do, to become who you need to be. But the thought of waking up every morning and not seeing you—”</p><p>He silences her worries with a kiss, and then pulls away. Both of his hands find her face, and slip back into her hair. “Come with me. Whatever I do, wherever I go—come with me, Mari. You don’t have to stay here.”</p> <p>“I’m seventeen, Trystan. I can’t—”</p><p>“You’ll be able to leave for college.”</p><p>“Yeah, but I can’t leave to live with a guy. Add in the fact that you’re a rock star and my dad will throw your ass in jail for kidnapping me.” Her dark gaze falls between us and when she looks up again, there’s pain in her eyes. “It works better this way. You can come see me and I’ll start college. I can catch up with you when I’m eighteen or stay here and graduate. We’ll have more choices then, Trystan. But right now, we both get to start over. We both get two shiny new lives and they’re going in different directions. That’s why I want you to have the ring. Remember me when things get rough, because they will. I’ll always be there for you, no matter what happens between us.”</p><p>Her words are like a stake through his heart. She’s talking about them like they’re already over, even though they’ve barely started. The idea of losing her, of going through his life without her, is more devastating than anything he’s ever felt. But she’s right and he knows it. Their time together is limited and he wants to treasure the few moments they have.</p><p>They stay like that, embracing each other, on the side of Mari’s bed. He can’t tell if it’s seconds or hours, but the tug inside his chest is demanding. Everything within him is making Trystan want to kiss her senseless and hold her in his arms.</p><p>Suddenly, she pulls back and takes his cheeks in her palms. “Kiss me, Trystan.” Her voice is soft. Mari doesn’t have to ask twice.</p> <p>Trystan lowers his lips and presses them softly to her mouth. Fighting to maintain control, he plans to kiss her slowly and take his time, but then Mari sinks back onto the bed and pulls Trystan down with her, which changes things. The kiss becomes all hot lips, and he can’t get enough. His hands travel down the sides of her body, grasping her tighter, as he presses himself on top of her.</p><p>The moment is perfect, and his head is filled with the sounds Mari makes in the back of her throat and the way her nails scrape the back of his neck. Her scent fills his head and he’s utterly lost, unable to think or focus on anything but her.</p><p>That’s why he doesn’t hear the door or the footsteps until it’s too late. A hand is on the back of his neck and a second later, Trystan is ripped away from Mari. He’s pulled to his feet and then a fist connects with his stomach. Mari’s father manages to keep a hold on his shoulder. The man is screaming incoherently as he tries to throw another punch, but Trystan is ready this time. He moves at the last moment. Mari screams drown out her father’s angry words, as his fist connects with the wall, and goes straight through.</p><p>Trystan steps back, and pulls Mari to her feet, shielding her. When her father pulls his hand free and turns back, his jaw is clenched tight and his fists rise again. Trystan thought the man was yelling at him, but he isn’t. He’s giving Mari a verbal lashing that’s worse than anything his old man ever said.</p><p>Her father is growling, his back curved, his arms ready to strangle her. “I gave you everything and this is how you repay me? You cut school and sit at home, playing house with this piece of shit! You’re a goddamn whore! And no daughter of mine is ever going to—”</p><p>Trystan knows he shouldn’t do it, but his fist is already in motion, making a bee line straight for the doctor’s jaw. On contact, the man staggers, and his back hits the wall. Hard. The picture frames that her mother so neatly displayed in a little row crash to the floor and shatter.</p><p>Broken glass glitters as Trystan steps forward, crunching it under his boot. “No one talks to Mari like that. I don’t care if you’re her father or if you sue me. You daughter loves you, even though you don’t deserve it. You’re vicious words are destroying her and I’m not going to let you do it. So, go back to your ivory tower and complain about how the world doesn’t recognize how smart you are, just like you don’t recognize what you’ve done to your own child, you pathetic waste of life.”</p><p>Trystan holds out a hand for Mari. Sweat drips from his brow as he sucks in air, trying to slow his heart rate back to normal. Every muscle in his body is tense, ready for an attack that never comes. Instead, Mari’s father sits on the floor, glaring. He doesn’t stand when his daughter walks past him with tears glistening on her cheeks. The doctor sits there, rigid, utterly still, like he’s in shock. Trystan and Mari walk out of the house together in silence.</p> <p>CHAPTER 7</p><p>~MARI~</p><p>I can’t stop crying. Trystan’s arm is around me as he guides me to a picnic table and sits me down on top. My mom took me to this park when I was a little girl. It’s a few blocks from my house. Trystan’s hands are on my knees as he tries to look up into my face. “Are you all right?”</p><p>Frantically rubbing tears out of my eyes, I look up at him. “I’m so sorry, Trystan. He wasn’t supposed to be home. Dad never comes home. I—”</p><p>“Shhh,” he pulls me against his chest and holds on tight, and strokes my hair. I can hear the steady beating of his heart and it soothes me.</p><p>When I finally pull away, I feel embarrassed. We weren’t even doing anything, but that’s not what it looked like. “I’m sorry.” I say it again, because I don’t know what else to say.</p><p>“You have nothing to be sorry about, Mari.” I give him a weak smile and glance away, but Trystan doesn’t let me. He takes my chin in his hand and lifts my gaze until our eyes meet. There’s so much affection in those blue eyes, so much love. “No one will hurt you when I’m around, okay?”</p><p>I lean into him again, holding on tight. “No one has ever talked back to him before, and you yelled and punched him.”</p><p>Trystan kisses the top of my head and rests his cheek there. “I’m sorry if I made things worse. I couldn’t stand there and watch him rip you apart.”</p><p>“He didn’t get up, Trystan. I expected him to fight back, but he didn’t. Dad seemed more shocked than anything.” The look on my father’s face when Trystan defended me wasn’t anger, it was something else. It was almost like he was shocked that someone had the nerve to talk back to him. No one ever talks back to my dad. He’s above everyone at work and at home. He’s always right, and a teenage rock star just told him he was wrong, and followed it up with an undercut. “Oh, god. He’s going to kill me later.”</p><p>Trystan pulls away and takes hold of my upper arms. He lowers himself so we’re eye to eye. “Then don’t go home.”</p><p>The thought brings a smile to my face. Stay with Trystan. I would love that, but I can’t. “Trystan, I can’t. They’ll tear the town apart looking for me, and say horrible things about you when they find me.”</p><p>His gaze falls to the ground as his hands slip down to mine. “I can’t let you go back there alone. What if we figured out how to get you a room, so you’re not with me?”</p><p>“A room?” What is he thinking?</p><p>Nodding, Trystan says, “Yeah, a hotel room. I’m kind of homeless and all of my regular go-to spots aren’t going to be possible because of the media. Especially not after tonight.” He takes my hands and pulls me to my feet. “I need to call one of those record labels about a deal. I’ll tell them that they need to give me a place to stay, and I’ll get a room for you, too.”</p><p>I’m not sure I should do it. It feels like he wants me to run away. It’s strange, but if I was a year older, I wouldn’t be a runaway, I’d be a smart woman leaving an abusive home. Trystan knows what’s going through my mind before I even speak.</p><p>The wind catches my hair and blows it across my face, leaving little strands stuck to my drying tears. Trystan reaches for me and yanks me to him by my waistband, before he smoothes away the stray strands. When he’s done, his gaze lifts. The way he looks at me makes my heart race. Every pain, every piece of anguish that I felt a moment ago fades until there is only me and him. A tingling sensation starts in my chest and awakens the butterflies in my stomach as Trystan leans in and presses his lips to mine. I’ll never get tired of his kiss, because I can’t believe he’s kissing me. And it’s not fake, it’s not from rehearsal, and it’s not part of a play.</p><p>For once, I don’t hold back. I trust him completely and it shows. The kiss changes somehow and becomes hotter and more breathless. By the time I pull away, my entire body is searing and I’m gasping for air.</p><p>He tilts his head forward and rests it against mine. Trystan’s breathing as hard as I am. He laughs and smiles at me. “I’ve never had someone kiss me like that.”</p><p>“What do you mean?”</p><p>“I don’t know. It changed. It wasn’t just kissing. It’s like I could feel how much you care about me right here,” his fist lands on the center of his chest. Trystan takes a deep breath and shudders, like it scares him. When he looks up, he adds, “It’s like you’re part of me and always will be. It’s awesome, and utterly terrifying.”</p><p>The way he smiles fills me with joy. There’s vulnerability in his gaze, as if he wants me to reassure him, so I do. “I love you, Trystan. I always will.” I pull him against me and resist the urge to continue kissing him since we have some practical issues that need to be figured out quickly. “I think you’re right about calling someone, but I think it should be Tucker.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tucker?” Trystan looks at me like I’ve lost my mind.</p><p>“Yeah. You can trust him, right? The guy’s been looking out for you, hasn’t he? You should have him talk to the record label.”</p><p>Trystan thinks about it and says, “You mean I should ask him to be my agent? He’s an English teacher, Mari.”</p><p>“I know. Which means he’s underpaid and works his ass off. It also means he can read and parse stuff that makes your head spin. You could get a big name agent—I’m sure they’re all trying to sign you—but it makes sense to ask Tucker, right?” I give him a lopsided smile.</p> <p>He laughs and shakes his head as I hand him my phone. “You know, most people spend their life trying to get away from their teachers.”</p><p>“Yeah, but good people are rare. He’s good people.”</p><p>“Who are you?” Trystan’s smile is huge. He teases me for another second and then dials. “Here goes nothing.”</p><p>CHAPTER 8</p><p>~TRYSTAN~</p> <p>Trystan walks into the coffee house with Mari on his arm. Today has been so weird. He should be in school. Actually, he should be sitting in Tucker’s classroom right now, but here they are in this little café.</p><p>Tucker is already at a little table that’s jammed into the corner. His white shirt is rolled up to his elbows and his collar is unbuttoned. There’s a cup in his hand that gets lifted to his lips. When Tucker sets it down, he sees them, and waves them over. When they stop in front of the table, he asks, “So, it’s true then?” Tucker asks while dabbing his forehead with a napkin. The guy is covered in sweat.</p><p>Trystan pulls out a chair for Mari and then sits next to Tucker. “Yeah, it’s true.”</p><p>Tucker seems amused. There’s a smile on his lips that he’s clearly trying to hide. “Why didn’t you want to tell anyone?”</p><p>“Because of my dad. I know you know,” Trystan adds quickly.</p><p>“Actually, I didn’t know for certain, Trystan. If I did, social services would have pulled you out of there. I’m sorry.” Tucker takes a deep breath and leans back in his chair. “So, what do you need from me?”</p> <p>Trystan glances at Mari. After everything they talked about, he suddenly feels shy asking. It’s Tucker, the same man who he threatened to report, but he’s also the same guy that let him nap in the school basement.</p><p>Mari speaks for him. “Trystan wants to take a deal. Several were offered, but he needs someone to negotiate things for him.”</p><p>“And you want me to do that?” Tucker’s caterpillar eyebrows crawl up his face.</p><p>“Yeah, I do.”</p><p>“Trystan, I’m not an agent. Shouldn’t you—”</p><p>Trystan cuts him off. “Maybe, but I’d like you to help me with this. You’d get the agent’s cut. The thing is, I trust you. I can tell you stuff and it won’t end up in the paper, you know? I don’t know them.”</p><p>“Trystan, there are people that would be much better at this. I can look over your contracts, but I’m not taking your money.”</p><p>Trystan smiles and taps the table between them. “And that’s exactly why I want you to do it.” Trystan tells Tucker the plan for that evening. Mari interjects once in a while, filling in anything he left out. When he finishes, he says, “And since neither of us have any place to sleep tonight—”</p> <p>Tucker glances at Trystan and then Mari. “Why not? I mean, I know what happened with your father Trystan, but what’s happened to you? Why can’t you go home?” He looks at Mari with concern.</p><p>“Well, her parents neglect her most of the time and when they’re actually around, they lash into her. It’s verbal crap for the most part, but when her dad went after her today. I thought he was going to strangle her, so I, uh, kind of punched him.” Trystan realizes how bad that sounds. Now that the moment is over, it seems like an overreaction on his part, but at the time Trystan felt the need to defend Mari.</p><p>For a second he wonders how much his father messed up his perception of things. Maybe all livid parents don’t beat the shit out of their kids. Maybe they yell and that’s it, but things had already taken a turn when he grabbed Trystan. He can’t afford to second guess himself. He did what he had to and he’d do it again.</p><p>Tucker pinches the bridge of his nose and presses his eyes closed. “You punched Dr. Jennings?”</p><p>“Don’t make it sound like I’m the bad guy here—” Trystan bristles, but Tucker slaps his hand down on the table and cuts him off.</p><p>“Trystan, you’re not the bad guy, but you can’t punch people. You’re eighteen—it’s assault. We’ve already been thought this! Did you think of that before you hit him?”</p><p>“He grabbed me and then he went at Mari. I thought he was going to hurt her. I...” His voice trails off as he looks over at Mari.</p><p>She takes his hand. “Mr. Tucker, I didn’t like any of it, but Trystan didn’t start it.”</p><p>Tucker looks up at her and sighs. “What’s done is done, but you two can’t be in situations like this. It’s not safe. Mari’s a minor, for godsakes. If the police show up—”</p><p>“I know,” Trystan says quickly. “They showed up at my house the other night when things got ugly with my father. I know what happens to Mari. They drag her ass back to her father, and we all know how that goes.” Trystan swallows hard and leans back, running his hands through his hair. “I want to make sure she’s safe, Mr. Tucker. That needs to be part of the deal.”</p><p>Tucker looks at each of them and shakes his head. “I can’t do that Trystan. Social Services won’t intervene if she’s not in immediate danger. Verbal abuse is frowned upon, and he never actually touched her. When there are kids getting beat within an inch of death, they just don’t have the capacity to deal with the stuff Mari is living with. Even if I reported neglect, she’s seventeen. She can feed herself. Her parents are wealthy. Do you see where this is going?”</p><p>“I don’t want you to call social services,” Mari squeaks, looking panicked.</p><p>Trystan takes her hand, “We won’t. Besides, that’s not what we need right now.”</p><p>Mr. Tucker looks confused. “Then, what do you want me to do?”</p><p>“Make housing a provision of the contract with the record label. We both need a roof. At the very least, have them put her up somewhere until she can move into the dorm in the fall.”</p><p>Tucker blinks and does a double take. “Come again? She’s going to college in the fall?”</p><p>Mari finally speaks up. She loses the hitch in her voice and confidently tells Tucker her plans. “Yes, I applied to a little college out east. They accepted me and offered a full scholarship, but I can’t move into the dorm until August.”</p><p>Tucker’s brow furrows as he thinks. After a few moments, he points at Mari. “I can fix your problem. We can get you into the dorm now instead of at the end of the summer. I assume your parents don’t approve?”</p><p>“They don’t know.” Mari glances at her hands as she speaks, looking younger than she is. “Daddy wanted me at Harvard, pursuing something in the medical field. I don’t want that life. So I applied. I was planning on disappearing one night and not telling them a thing.”</p><p>Tucker closes his eyes. When he opens them again, he smiles at her. Tipping his head to the side, he says, “You’re a good kid with a good heart and a brilliant mind. I agree that you should move into the dorm as soon as possible, but you need to tell them. Otherwise, they’ll think you were abducted or something horrible. I assume that your application for early graduation was submitted?” She nods. “Good, then I’ll make sure it goes through. As for you,” Tucker glances at Trystan while his index finger traces the rim of his coffee mug, “I’ll talk to the record labels for you and tell them what you want. We can go from there. You have a lot of potential, Scott. I want to see you succeed more than anyone, so promise me that you won’t mess it up.”</p><p>Trystan laughs and folds his arms over his chest. “What makes you think that I want to mess it up?”</p><p>“There’s a lot of pressure with this life, Trystan. People will always be looking at you, waiting for you to fall apart. Have you noticed your peers—the other young actors and singers who flamed out? You get a lot by taking this path, but you’re giving up a lot, too. I know how much you value privacy and that’ll be gone. You’ll belong to the world. There won’t be a quiet moment for weeks on end. Do you think you can handle that life? Because it’s so damn easy to reach for something to take the edge off and before you know it, you’re constantly drunk or high.”</p><p>Trystan’s shoulders tense as he says it. “I don’t drink or do drugs. I’ll never drink anything. Do you seriously think that I’d touch that shit after living with my father? He tried to—“ Words won’t come. They stick in his throat like barbs. “If she hadn’t walked in—” He sucks in air, his eyes too wide, and heart beating too fast.</p><p>Tucker bumps Trystan’s hand and cuts him off. “I don’t think you’ll do it on purpose, Trystan, but yeah—at some point you’re going to need a way to deal with things. You need to know what you’re going to do before it sneaks up on you. Unless a person intentionally changes what they’re doing, children will become their parents. Which means you’ll deal with stress the same way your father did. I know you’re saying you won’t now, but unless you know what you’ll do, it’s inevitable. So do us both a favor and decide how to handle your life before you get to that point.”</p><p>Tucker’s words cut through Trystan and pierce his heart. Lots of guys become their father. Trystan swore up and down that he’d never be like his old man, but there’s nothing stopping it from occurring. Tucker is the first person to even say that it didn’t have to happen, and the way to do that seems so simple. Decide not to drink, decide now what he’ll do when life is too hard, and Trystan can get anything he wants to drown his stress. Trystan hates that his father is a part of him. He hates how much the man influenced his life, but Tucker is right.</p><p>“I will.” The air is thick with things yet to come. There’s a slush pile filled with shit that he has to trek through before getting to the other side. If Tucker wasn’t here, he wouldn’t know what to do.</p><p>Trystan smiles awkwardly at the guy. “Hey, I suck at saying things like this, but it needs to be said. Thank you. Thank you for looking out for me and dealing with my shit. I pretty much blackmailed you this year and you just rolled with it. You left the school in the middle of the day to talk to us, and you always do stuff like that. You’ve done more than I could ever thank you for. I know a good guy when I see one, and I hope I can make you proud. If I can be half the man you are, that’ll be amazing.”</p><p>Mari is smiling at Trystan, and leans in close as he speaks. She knows how hard it is for him to say things like this. It means Trystan’s wrong, that someone did care about him all this time, and that he wasn’t alone. Trystan couldn’t see it before, but it’s crystal clear now. It’s funny how easy it is to see after the fact. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Tucker has a weird smirk on his face. Shaking his head, he laughs. “Trystan, I’m already proud of you. This stupid smile on my face is pride. You’re the kid with the most crap stacked against you and you rose to the top. You finally learned what I was trying to teach you and I couldn’t ask for more.”</p><p>Tucker stands abruptly and smacks Trystan on the back, nearly knocking him out of his seat. “I’ll see you before the play tonight and tell you how it goes. And Mari, make plans to stay at Katie’s in case I can’t pick up your dorm room key until tomorrow.” He drops fifty bucks on the table and adds, “Celebrate, both of you. Grab a piece of cake and something for dinner. I’ll see you guys later.”</p><p>CHAPTER 9</p><p>~MARI~</p> <p>Trystan and I go to the diner for dinner. My parents won’t show up and I doubt my dad is out looking for me. He’ll wait for me to come home and then chew me out. I already called a left a message on the answering machine that I’d be staying with Katie tonight, so I won’t have to deal with that mess until tomorrow, and right now tomorrow feels so far away.</p><p>I’m staring at the menu way too long. Trystan is sitting across from me in the little booth. He glances over the top of his menu and looks around. “Where do you think they went?”</p><p>“Who? The press?”</p><p>“Yeah, I thought they’d be harder to ditch.”</p><p>Seth appears next to me and interrupts, “Well, you can thank me for that. And her, I guess.” He jabs his thumb at Katie, who’s giggling like a maniac and standing next to Seth.</p> <p>Trystan scoots in to give Seth room, and I do the same. Katie sits next to me and is trying really hard not to laugh. “Tell them what you did,” she says to Seth.</p><p>Seth leans back into the booth and spreads his arms across the seatback. “Well, the reporters were hanging around the school, like you’d come back. So me and Katie walk over and ask if they’ve seen you, yet.”</p><p>Katie can’t shut up. She blurts out, “Seth gave an interview and totally made up a bunch of stuff. The reporters are out at Robert Moses beach looking for you right now. Seth told them that you always go out there before opening night, but that you’d be back in time for the show.” Her smile looks so weird, because she’s trying to keep herself from laughing. “Tell them the other part—about Brie.”</p><p>“Oh, yeah. I told them that the Skank is a bit of a psycho and that she’s not your girlfriend.”</p><p>“They believed you?” Trystan asks, looking surprised.</p><p>“Nah, of course not. I said I was your best friend, but everyone is pulling shit and trying to get on camera. So I told them to confirm that I was your bro with Brie, which they did. So, Brie says yes, and then they ask her where you go before every performance and she says you don’t go anywhere.” Seth is smiling like he’s the most awesome guy in the world.</p> <p>Katie jumps in and finishes the story. “So they didn’t believe that she’s going out with you! They told her to step aside so they could talk to Trystan’s real friends.” Katie busts a gut laughing and doubles over. Her face comes dangerously close to hitting the table as her body shakes.</p><p>Seth reaches forward all of a sudden, and shoots his hand out, placing it between Katie’s face and the table just before she smacks into it. “Watch it, bacon girl. You’ll knock the few brains you have left out of that pretty head.”</p><p>Trystan’s eyes widen and we give each other a silent what the heck was that stare.</p><p>Katie stares at Seth’s hand and lifts her eyes slowly, smiling way too hard. “Trying to steal a feel, Sexbot?”</p><p>“Only from you.” Seth and Katie are in their own little world with their eyes locked. Katie practically swoons when he says that last bit.</p><p>“Okay, what the hell is going on?” Trystan elbows Seth in the side, adding, “You’re freaking us out. What’d you guys do all day?”</p><p>Katie sighs and looks at Seth like she’s love struck. “Nothing. Messed with reporters, cut class, toilet papered Brie’s car, and stuck pickles on her antenna.”</p><p>“Pickles?” Trystan and I ask at the same time.</p> <p>“Yeah, cuz she’s a dick,” Katie says.</p><p>Seth laughs. “I had no idea why you picked up pickles.”</p><p>“It’s because the lunch lady gave me the whole jar. I didn’t think of the metaphor until later.” They both start laughing again, and it’s like aliens came down and snatched Katie’s brains while we were gone.</p><p>“So,” Seth says and looks at us, “Did you guys get stuff worked out? Is our boy going to be a rock star? Because I want backstage passes. I’m going to take a marker and cross out the VIP and write PUS-E on mine.”</p><p>Katie kicks him under the table. “You will not!”</p><p>Seth laughs, “Damn woman, those boots hurt. Stop kicking me!”</p><p>“Stop saying dumb-ass stuff!”</p><p>“I only said it to get a rise out of you.”</p><p>“Well, you’ll get a boot up your ass if you say it again.” Katie’s smirk is back. She’s flirting with him.</p><p>“Uh, Trystan...” I say and scoot away from her a little bit. “I think someone stole Katie’s brain. They must have sucked it right out of her head.”</p><p>“Yeah,” Trystan answers with a smirk on his lips, “that dazed look on her face says—ahh! She kicked me!” Trystan’s eyes widen in shock and he looks under the table and then back up at my best friend.</p><p>Katie folds her arms over her chest and leans back in the booth, smugly. “Sorry, the alien made me do it.” She examines the back of her hand, looking closely at her polish before looking up. “What?”</p><p>We all start laughing and things feel like they’re going to be all right.</p><p>When we get to the school, the building is surrounded by reporters. Trystan stops in his tracks and his face turns white. His hand slips out of mine as he stares. This will be his life from now on and I’m sure he’s questioning whether or not he can handle it. Seth and Katie stop when they notice we aren’t following them.</p><p>“This is nothing, Scott. We can elbow past them—”</p><p>“Or?” Trystan asks as he looks at the news vans again. There are more people here than before. This morning it was manageable, but now there are close to twenty different reporters, plus their crew, and cameras are everywhere. Some of the media people are standing in front of the school, blocking the doors, with a microphone in hand, ready to pounce when Trystan arrives. Since Trystan doesn’t want to make the announcement until after the performance, it’s an issue.</p><p>“Or, we can open the basement door. Come on, Katie. I’ll distract them and you sneak through. Knock three times on the door and wait for her to open it. Got it?” Seth doesn’t wait for an answer. Instead he walks away with Katie a few paces behind.</p><p>Trystan looks over at me. “So.”</p><p>“You’re not ready for this, are you?” He takes my hand and shakes his head.</p><p>“I don’t think anyone could ever be ready for this. I like the limelight, Mari, but only when I’m on a stage and everyone else is far away. I’m not used to having them in my face and sorting through my personal life. I don’t like it.” He sighs and pushes his silky hair out of his eyes.</p><p>Squeezing his hand, we round the side of the building and head toward the stairwell that leads to the basement. “I know. I wish I could keep them away from you, but I think you need them. They’re the ones that’ll get you a contract and pay your bills, right? Maybe you could think of it like a show, throw out some personal stuff so they don’t go digging for it. I’m not naïve enough to think that’ll stop them, but it should slow them down, right?”</p><p>“Maybe. The truth is I don’t think I’m cut out for this, Mari. I’m an actor. I never planned on signing—”</p><p>“But that’s exactly why they love you. Trystan, you’re real. You aren’t someone whose clawed his way to the top. You’re the lovesick guy that wrote a girl a song. You’re the guy who wanted to stay out of the spotlight, and that’s why they love you. You’re acting like a normal person, not some larger than life Hollywood type. When they look at you, you give them hope. People like you are rare. Remember who you are and you’ll be happy for once. You won’t have to scrounge for food or worry about where you’re going to sleep.” I lean into his arm as I say these things. Trystan has no idea what people see in him. I can hear it in his voice.</p><p>Trystan stops and slips his arms around my waist, before leaning in and giving me a peck on the forehead. Smiling, he takes a lock of hair in his hand and plays with the curl, wrapping it around his finger. “You have too much faith in me.”</p><p>“You need people that love you for you and believe in you, Trystan. You’ve been denied that basic right. And by the way, this isn’t too much faith at all. I know what you’re capable of, and I expect you shine bright and rock this Day Jones thing better than any play you’ve ever done. You’ve been handed the performance of a lifetime, and you’re going to amaze us all. Wait and see.” It’s hard to say stuff like that to someone when it isn’t true, but with Trystan I have no shortage of words. He’s amazing and the whole world is about to know for certain that Day Jones pales in comparison to Trystan Scott.</p><p>“Mari,” Trystan’s lips are parted like he’s searching for words, but nothing comes out. He shakes his head with laughter on his lips. “I love you so much. You see this,” he points to the ring I gave him, “I’m never taking it off. You’re my everything, Mari.” He wraps his arms around me and holds me tight.</p><p>Katie’s voice echoes up to us. “Stop making out and get your asses down here before someone sees you!”</p><p>Trystan takes my hand and we run down the metal stairs and into the basement. Katie yanks the door shut behind us and looks up, grinning. “You guys are going to get married and have little rock star babies!” I elbow her in the side, but she keeps laughing anyway. “They’re going to have little tiny guitars and chains on their diapers!”</p><p>Horrified, I look over at Trystan wondering how much Katie just spooked him. The look of terror that I was expecting isn’t there when I glance his way. Instead, Trystan is laughing with her and adds, “Don’t forget baby mohawks.” He looks over at me. “What? You never thought about what’s next for us?”</p><p>Shyness pulls my face to the floor like an anchor to the bottom of the ocean. I can’t look up if I try. “A little, but not that far.” Trystan is still laughing when he yanks me toward him.</p><p>“Yeah, I have to go save Seth, otherwise I would love to hear this. Tell him that you want two babies and a little house upstate with a picket fence and a cow that eats your pansies.” Katie runs off before I can kill her.</p><p>Trystan rests his forehead on mine. “Why does she know that stuff and I don’t? And what’s with the cow?”</p><p>I shrug and look up at him. My stomach dips and I can barely find my voice. “Most guys don’t want to hear that stuff.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Since when am I most guys?”</p><p>“You’ve never been like most guys, but that mask you wore threw me off.”</p><p>“Masks are sexy, right?” He teases lightly and tugs at the waist of my jeans. “Mari, I’d love to be the guy who gives you the house, the cow, and oh my God, I would love to make babies with you. I’d try very, very hard—”</p><p>My face is on fire. Someone shoot me! Trystan laughs and lifts my chin when I try to look away, so I smack his chest. “You can’t say it like that!”</p> <p>“What? Making babies is the fun part.”</p><p>“It doesn’t freak you out?”</p><p>“What? That you want a family? No, it doesn’t freak me out at all. In fact, I like it. I want to be so insanely in love with someone that I’d have a family with her.”</p><p>“Really?”</p><p>“Truly.” The way he smiles at me shoots excitement through my veins. I giggle like a crazy person and throw my arms around his neck, while kissing his cheek. “You’re my forever, Mari. Well get through this. I’ll be with you every second I get. And when I’m touring, you can meet up with me during your breaks. Or for a weekend. Or even a day. This will work out.”</p> <p>“How do you know?”</p><p>“Because this is love, and I’m never letting you go.”</p><p>CHAPTER 10</p><p>~TRYSTAN~</p><p>Tucker waits until they’re in costume with their make-up finished before he pulls Trystan and Mari aside. “We can’t head to my office because the hallways are filled with people, so let’s just find a corner and I’ll tell you what I was able to work out.”</p><p>Tucker walks to the far side of the stage, and stops at the back corner. He checks the side door to make sure it’s locked and then huddles them together. Handing Trystan a packet of papers, he says, “As soon as you say the last line of the play tonight, you’ve graduated. I talked to the principal and a few of your other teachers to make sure you had passing grades, and they said you’re good. So, that’s settled. You don’t have to come back here tomorrow.”</p> <p>“What about the play?” he asks, surprised to think that Tucker would let him off the hook like that. Besides, Trystan wanted to do all three performances this weekend.</p><p>Tucker shakes his head. “This is the only night. We sold out, like standing room only, so the department made more money from this one show than we usually make all year. It’s worked out and the school more than recovered the cost of the production. Having you here, and making the announcement this way is a huge help.”</p><p>Tucker is holding a large envelope in his hand, and smacks it against his palm lightly before continuing. “Listen, you need to look at these contracts and pick one. There are three offers in here for seven figures, Trystan. They want your songs and there are plans for tours. I made notations and altered things that needed to be changed, such as your lodging requirements, privacy—”</p><p>“Seven figures?” Mari gasps and touches her fingers to her lips.</p><p>Tucker smiles. “Yes, the smallest offer is seven figures. There’s one in here for eight. You’re a millionaire, kid.” Trystan stands there shocked, unblinking, and unable to speak. Tucker slaps him on the back and laughs. “You didn’t know, did you?”</p><p>Trystan’s shoulders creep up as his jaw drops. His voice is a squeak, “I didn’t know. I thought maybe they’d give me ten thousand bucks for the song.” He goes to rub his hands over his face and stops because he’ll smear his stage make-up. “Holy shit.”</p><p>There have been times when life snuck up and robbed him. It fucking stole everything, and it happened so often that Trystan just expects it. Fate was cruel, but this—he never expected anything like this. Staggering, Trystan takes a step back and hits the wall. Mari’s hand is on his shoulder. She’s speaking, but the only thing that he can think is that he won’t have to buy semi-perished food from Sam ever again.</p><p>His thoughts fall out of his mouth because the shock has disabled the filter between his mouth and brain. “I can buy as much peanut butter as I want.” A smile creeps across his unbelieving face as he looks up at them slowly, and laughs.</p> <p>Tucker and Mari chortle with him. Tucker grabs his shoulder and says, “You can buy anything you want, Trystan.”</p><p>“Oh my God... Do you know?” His thoughts come out in jagged statements and grow louder. He finally slaps his hands over his lips to shut up. He sounds crazy. Is this how people react when they win the lottery? Trystan giggles behind his hand and then reaches for Mari, pulling her against his side with a huge grin on his face.</p><p>“I know it’s a lot, Trystan.” Tucker keeps talking in the low hurried voice he was using before. It takes a lot of effort for Trystan to stand and listen. Part of him wants to run up and down the school hallways, whooping at the top of his lungs.</p><p>Tucker snaps his fat fingers in front of Trystan’s face. “Pay attention. I know you’re excited, but there’s more. If you pick a contract and sign tonight, they’ll have a hotel room for you. You can stay there until you buy a house, all expenses paid. It’s part of the requirement to sign with them, so all of the contracts have that clause.”</p><p>Tucker looks at Mari next. “I have a dorm room for you. It’s all set and the key is in the housing office. Housing expenses and board are paid until school begins in the fall. And, I talked to the principal about your application for early graduation. It was denied.” Tucker tries to keep talking but Mari’s smile falls.</p><p>“What? Why?” She steps toward him with dread in her eyes.</p><p>“Wait. Don’t freak out yet. Listen to what I worked out first.” His voice is gentle, like he can tell that Mari is going to lose it. Her jaw is locked tight and her thin frame is practically shaking as she tries not to show emotion. “You’re short an elective, but it’s taken care of. You’re going to take a summer class that’s offered to high school students at the college. It’s a one week class, all day, every day. Finish that and you’ve satisfied the state requirements. The school will give you a conditional graduation, and you won’t get your diploma until after you finish the class. The college knows and has agreed to wait on your final transcript. Everything is already arranged.”</p><p>“They offered to pay my room and board over the summer, too?” Tucker nods, but his eyes flick away from hers. Mari doesn’t notice it, but Trystan does. She sucks in a deep breath and presses her fingers to her lips. “I’m going to college! Trystan, I’m going to college!” She takes his hands and jumps up and down before he pulls her into his arms and hugs her hard.</p><p>When Mari steps away, she turns to Tucker and throws her arms around him too. “Thank you so much. I can’t even tell you what this means to me. Thank you! Thank you! Thank you!” Her voice is giddy, and he can tell she’s trying not to cry.</p><p>Tucker peels her off and smiles kindly. “It was my pleasure, Mari. Now, go on and have them check your make-up one last time. I think some of your lipstick came off.” Mari races off, skipping backstage and laughing. She’s happier than Trystan remembers seeing her. Like ever.</p><p>When she’s gone, he looks up at Tucker. The man is a better person than he’d originally thought. Tucker hides his kindnesses. Call it a gut feeling, but Trystan knows that Tucker did more than arrange for the college to let Mari into the dorms early.</p><p>Trystan leans his shoulder against the cinderblock wall and slips his hands into his pockets. Tilting his chin up, he says, “You paid for her housing, didn’t you?”</p><p>Tucker gives him a lopsided grin. Surprisingly, he doesn’t deny it. “She earned it, don’t you think?”</p><p>There are people who do good deeds in silence. They come and go like a whisper, and most of the time we think it was luck, but it’s so much more than that. Tucker isn’t a wealthy man—he’s on a teacher’s salary—and he just paid a massive bill for a student. Mari isn’t his daughter. He doesn’t owe her a damn thing, and yet he did this for her. It makes Trystan wonder exactly what Tucker’s done for him, and what kindnesses swept by unnoticed, because now he’s certain that there have been many.</p><p>The words knock around in Trystan’s head for a moment before he asks, “Yeah, but why not tell her you paid for it?” It’s not that he thinks Tucker should draw attention to it, but he wants to know why the teacher did it and doesn’t want credit for his actions. The behavior is so contradictory to everything Trystan experienced growing up that he can’t fathom the situation. What would compel someone, an acquaintance at best, to act so selflessly?</p><p>The large man doesn’t answer at first. Instead, he glances around to make sure they’re still alone before leaning in closer to Trystan’s ear. “Because ownership of the action devalues the kindness in some cases. It’ll make her feel indebted, and that isn’t the reason it was done. Well, not that I would know.” Tucker grins, and admits nothing and everything with his statement.</p><p>Having ideals is one thing, and acting on them is quite another. Trystan knows what kind of man he wants to be and sees a reflection of himself in Tucker. Or maybe it’s the other way around. It’s possible that the young teacher already rubbed off on him over the years.</p><p>Tucker is quiet for a moment and then points to Trystan’s packet. “The contract that I think you’ll be the happiest living with is on top. There’s a pen in the envelope. Congratulations, Mr. Scott.”</p><p>Trystan pulls the contract out and scans it. Just as Tucker starts to walk off, Trystan says, “There’s nothing in here for you.” There’s no notation of a commission percentage for Tucker. No flat fee. Nothing.</p><p>The teacher doesn’t stop, look back, or try to explain. He simply acts as if he didn’t hear and heads off toward the lighting cage to make sure everyone is where they need to be before the curtain goes up. Trystan watches as Tucker disappears around the corner. He looks at the contracts in his hands and knows what he’s going to do.</p><p>CHAPTER 11</p><p>~MARI~</p><p>I’ve never gone on stage before to do a live performance. Up until now, I was the girl who sat in the shadows, the person that no one knew was there. By intermission everyone knows my name. They’ll see me flooded in golden light, standing center stage with Trystan. I’ve always thought he had charisma. The way he says his lines makes the night feel surreal. It’s like we’re star-crossed lovers trapped in another time, in another life.</p><p>There are more people in the audience than I’ve ever seen. I peeked between the curtains from backstage before the play started. Now that things are underway, my heart doesn’t pound so frantically. Periodically, the glint of a camera lens catches my eye from somewhere in back, but I can’t see past the second row. The rest of the audience is swallowed in blackness, which is good, otherwise my nerves would choke me to death and I’d die.</p><p>The lights keep me from looking out into the audience. They’re blinding, and every time I feel the racing of my heart as I start to panic, Trystan seems to sense it. He touches me lightly—on my cheek or my wrist—and pulls me back to where it’s only the two of us. When he does that, I realize that I could go on like this forever. He anchors me, steadies me, and makes me a better person. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We’re at the end of the second act, and that steamy kiss is about to happen. My heart pounds as I say my lines. I never thought about him kissing me like this in front of so many people. Sweat trickles down my back and it feels like nothing I’ve ever experienced before. My head is in the clouds, as my hands tremble. Trystan reaches for me, his eyes locked on mine. Smooth words flow softly from his lips as he leans in, closing the distance between us. His hands tangle in my hair and his mouth brushes against mine. The kiss feels more real, more intense than anything before. I gasp as he pulls away, and my eyes flick to the side—to the audience—as the lights fade to black and the curtain swings shut.</p><p>She’s here.</p><p>I stand utterly still, even after the dim blue stage lights come up so we don’t trip as we walk off stage. We have fifteen minutes before the next act. Trystan is smiling. He loves this so much and I don’t want to ruin it for him, so I try not to react, but he’s already noticed.</p><p>“What is it?”</p> <p>“My mom. She’s out there.” I stare at the floor, at the way the wood takes on blue tones in the light.</p><p>“Is that bad?”</p><p>Glancing up at him, I answer truthfully. “I don’t know. They said they wouldn’t come.”</p><p>“Your dad said they wouldn’t come. Maybe your mom realizes he’s been acting like an ass. Mari, you are exceptional. You’re dazzling everyone out there. She has to see that.”</p><p>I smile up at him, but it’s forced. Seeing her there makes me question myself. Everything I do is lacking in her eyes and it’ll crush me if she thinks my performance is subpar. “She doesn’t see much when she looks at me, Trystan. She sees that I’m not what she wanted, and that’s about it.”</p> <p>The conversation is cut short when we’re shoved off stage, so the crew can change out the set. Trystan walks with me quickly into one the back dressing rooms. “Forget that she’s here. Tonight is a new start for both of us. Try to be happy.” He leans in and kisses my nose, which makes me smile. It’s such a sweet thing, innocent and kind, that I can’t help but grin.</p><p>Sucking in a deep breath, I nod. “You’re right. We both get a new start after this. And honestly, I’m loving every second of it. They love you Trystan. You could hear a pin drop out there, and it’s because of you.”</p><p>Trystan never takes compliments well. He usually boasts or does something silly to deflect or distract people from seeing it, but I know. This time he does neither. His voice is a whisper. His dark lashes lower and he leans into me, holding me in his arms and whispers in my ear. “Thank you, Mari. I couldn’t have done this without you.” As he pulls away, he pecks the side of my face. “I need to take care of something, okay. You should go get a drink and have your make-up touched up before curtain call.”</p><p>“Okay, I’ll see you in a little bit.” I wander around backstage until I find the side door that leads to the water fountain. Pushing through, I head into the only hallway that is blocked off from the public. Still, some people have managed to get backstage, including Brie.</p><p>She’s wearing a tight little skirt and saunters over to me as I guzzle water from the fountain. “I can’t believe they let you on stage. Trystan is totally carrying you. If it wasn’t for him, they’d be throwing rotten vegetables at you.” She laughs and tips her head back. The bruises under her eyes are half hidden by make-up. She must have rubbed her face and some of the concealer came off. Either that or she’s been crying.</p><p>I straighten and look her over once, and raise an eyebrow. “I’d rather get hit with rotten fruit than have a rotten soul. Good luck with that.” My throat is still dry, so I bend my head to the fountain again, but Brie doesn’t leave.</p> <p>“You think you’re better than me? Please!” She cackles and several pairs of eyes turn our way. Some of the actors are lingering backstage with me, waiting for water while others are practicing their lines. They all stop what they’re doing and watch. Brie rants, “You’re just the spoiled daughter of a rich man. You’ll never amount to anything, and as for Trystan, I’ll always be his first love. I’ll always be the woman who slept with him first and nothing you can do will ever change that.” Her words are spoken loudly in a clipped tone, like she’s superior.</p><p>The urge to punch her in the face courses through my arms, and my muscles tense, but I’m not a fool. Besides, Tucker went out of his way for me and I’m not going to get into another fistfight with her, so I straighten, look straight at her, purse my lips together, and spew. A splattering of water comes out and hits her face right before I start choking. By the time she squeals, I’m doubled over and hacking up a lung.</p><p>It looks like she was in the spray zone and the rest of the cast that’s loitering down the hallway come over to make sure I’m all right. No one notices Brie, but I do. There’s murder in her eyes as she wipes away the smeared make-up. It was childish. Maybe. But I’m not letting people like her talk to me that way anymore. Brie stomps off and disappears into the crowd on the other side of the barricade. I hope she goes home, but I doubt it. She’s probably waiting around to see what damage she can do.</p><p>There are several sets of hands on my back when I hear Mom’s voice. “Mari?” I glance up, horrified that she’ll try to talk to me now.</p><p>Her gaze meets mine and we stare at each other. Everything within me says to walk away, that talking to her right now is not a smart move, but I can’t. There’s something about her, about the look on her face, that draws me down the hallway. Soon I’m standing in front of her with only the wooden posts separating us.</p><p>Glancing up at her with a stern tone, I ask, “What are you doing here?”</p><p>There are people around. Many voices are talking at the same time. A camera pushes its way to the front and soon I can see the man wielding it. He shoves it in my face and I think that Mom will back away, but she doesn’t. Rather, she lifts her hand and I can see what she’s been holding. A single red rose with a white ribbon tied around it, forming a little bow.</p><p>Holding it out to me, Mom offers the flower. “You amaze me, Mari. I never knew you could do anything like this and seeing you up there on the stage...” Her fingers cover her mouth quickly as she swallows a sob. The rose remains between us, an offering not accepted. I can’t touch it. I’m frozen in place. Her words hit me like a sheet of water and I’m drowning, dying to hear what she has to say.</p> <p>Mom continues, “I never knew.” She looks down at the rose in her hand. “And I’m afraid I’ve been holding you back. I’m so sorry, honey.”</p><p>I nod slowly, too shocked to speak. When I find my voice, I ask, “Where’s Dad?”</p><p>Mom’s spine straightens and her eyes lock with mine, offering an apology that words cannot express. She doesn’t have to answer because I know he isn’t here. Remorse fills her eyes, like there are more things to say, but not here—not now.</p><p>The rose starts to fall to her side, clutched in her hand, but I reach for it, refusing to make the same mistakes my father’s made time and time again. Forgiveness is something I want, so it’s something I have to offer, and there’s no one that I’d rather give it to than my mother.</p><p>“This is beautiful. Thank you, Mom.” I take the rose and reach over the barricade and hug her quickly before saying, “I need to get back. I’ll talk to you after. I have some really exciting news.” Hiding my face, I hurry down the hall. Tears prick my eyes as hope fills my chest.</p><p>She’s proud of me. My mother is finally proud of me.</p><p>CHAPTER 12</p><p>~TRYSTAN~</p><p>The play is over too quickly. Trystan basks in every moment, willing time to slow, but it doesn’t. Rather, it seems to fly by, the minutes passing like seconds. He saw Mari with her mother and the smile on her face as she hurried back toward the stage during intermission. At least she has one parent now. Going through life alone is hard and Trystan wouldn’t wish it on anyone. For some reason, blood matters. There isn’t a day that goes by that he doesn’t wish his mother would show up and say something like that to him, but the woman is a ghost—gone forever.</p><p>The last line is said and something inside his chest tugs hard. This is the end of one life and the beginning of another. Most people never get a chance like this, and he knows he should feel lucky, but he’s going to miss this place. Trystan will miss his afternoons with Mari, and driving Tucker crazy in class. He’ll miss the hallways and Seth’s crude mouth. If Trystan doesn’t make an effort, he knows the people he holds most dear will vanish from his life.</p><p>The curtain swings closed as he stands there with Mari in his arms. He beams down at her and kisses her hard, not holding back a bit of emotion. Without warning the curtain swings open again and a single spotlight shines across the room, illuminating their private kiss.</p><p>The audience is cheering wildly, standing and clapping so loudly that he can’t hear a thing. Mari and Trystan pull apart. She smiles and covers her lips with her fingers, trying to hide a beautiful, shy, grin. Trystan tugs her forward toward the edge of the stage. The spot light follows the pair until Trystan stops. He holds up their hands and they bow together, which makes everyone cheer louder. The casting call begins and one by one, the entire cast is called out onto the stage.</p><p>At the end, Mr. Tucker is called out and applauded. Up until this moment, everything is normal. Now, Tucker would normally take a mic and thank everyone for their hard work, but not tonight. Tucker taps the mic in his hand and clears his throat. “There are members of the press here tonight with a question for one of our students, and I believe he has an answer for you.”</p><p>Tucker turns to look back at Trystan. This is it. His heart feels like it’s going to leap out of his chest. It’s a combination of dread and excitement. Trystan steps forward and tugs Mari with him before releasing her hand after a couple of steps.</p><p>Trystan taps his mic to make sure it’s still on before his voice rings across the auditorium. “A few months ago I was completely and totally in love with a beautiful woman who didn’t know how I felt, so I wrote her a song.” Trystan reaches for Mari and pulls her to him. “She knows how I feel, now.” Trystan laughs lightly as he looks at Mari, and the audience laughs with him.</p><p>“And before tomorrow morning, everyone will know everything about me, so I might as well tell you a little bit about who I am. When I was a baby, my mother left. It broke my father’s heart and for the longest time, he blamed me. He took it out on me with words and fists. I’m not the guy from the pristine home with the perfect parents. I didn’t have that life.” Trystan’s throat tightens as he speaks, but he pushes through. He lifts his gaze and looks at the reporters and smiles the confident smirk he always wears when things are difficult.</p><p>“I’m the kid that cut class and drove my teachers crazy. I’m the guy who fell in love with his best friend.” He glances at Mari and squeezes her hand. “And I’m the guy who wrote her a love song and uploaded it to the internet. I’m the guy everyone has been calling Day Jones, and my name is Trystan Scott.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Seth steps onto the stage and shoves a guitar into Trystan’s hands. Grinning he says, “Show them,” before backing away into the crowd on stage. They’re separated from Trystan, watching in awe.</p><p>The audience goes nuts when the guitar is brought out. Mari stands to the side as Trystan grabs a stool from Katie. She grins at him as she backs away. The guys in the lighting cage, blink the house lights and then turn them off. As Trystan begins to sing, a single light flips on behind him. There are several gasps and squeals of excitement as people realize that Trystan is really the guy in the video.</p><p>Trystan continues to sing, losing himself in the song like he’s done so many times before. His dark hair covers his eyes as he looks down at the floor. The music fills the room, rendering the buzzing audience silent. The music fills the room, softly resonating and causing that soft vibration that only a live performance can bring.</p><p>When he finishes the song the room goes from complete silence to an explosion of applause. Trystan stands and walks toward Seth who hands him the contracts. Trystan holds up his hand to silence the room. There’s joy in his voice when he announces his decision. “I’ve chosen to sign with one of the record labels and accept their generous offer. Mr. Tucker, will you do the honor?”</p> <p>Tucker gives him a strange look. This isn’t what they planned. Trystan was supposed to announce what he decided. Tucker steps forward and takes the papers. Reading the papers as he speaks, Tucker announces, “Trystan Scott, formerly known as Day Jones, has signed with Harbor House Records with the stipulation that...” his voice fades which makes the audience grow even more excited. Tucker looks up at Trystan and then back down at the paper, and continues reading, “With the stipulation that the school drama department receive a portion of his sales, and that Mr. Tucker will be his representative and receive a standard commission as compensation for his time and expertise.” Trystan wasn’t certain how Tucker would react. Doing it this way kind of forced the guy to say yes, at least that’s what he was hoping for.</p><p>Trystan speaks, filling the silence as Tucker stares at him in shock. “There are two people who made this possible—Marie Jennings for inspiring me to write the song, and Mr. Tucker, who negotiated the contract. This guy has been watching my back for years, even though I didn’t know it.” Trystan’s body pulses with excitement. For some reason this part feels more exciting than anything else. He looks out at the crowd, nodding, gesturing for them to join in. “Come on, Tucker. Say yes. You can still teach. There’s a lot more I can learn, and I promise I won’t cut.”</p><p>Tucker’s jaw is hanging open. Several cameras shift in his direction, waiting for an answer, while the audience cheers for him to do it. A rumble of laugher falls out of his mouth before he speaks. “You amaze me, Trystan. You always have. I’m honored, beyond words...”</p><p>Trystan extends his hand. “So, you’ll do it?”</p><p>“Damn right, I’ll do it!” Tucker grabs Trystan’s hand and almost rips his arm off as he shakes it hard.</p> <p>The moment seems to last forever, with endless applause and cheering. Trystan turns to Mari and takes her hand, pressing a kiss to it, as he waves at the people chanting his name. The sound rushes over him as he smiles back.</p><p>Until today, they called him Day Jones. No one knew who he was or what hell he endured to get to this point. There was this idealized version of the rock star who wrote Mari’s song, but that man doesn’t exist. Life makes us what we are. Cruelty and compassion shape us into what we become, and nothing about that is ideal.</p><p>Today the fictional life of Day Jones shattered, and by tonight the world will know him for who he really is—Trystan Scott. </p> </body></html>"]