["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>On the day he died, Eric Leaventhall had a datethat couldn't be broken, so he went. Dead and all.</p><p>Too bad I was his date.</p><p>Turned out dead dating was the only way he could get what he needed.</p><p>Sustenance.</p> <p>Are you confused yet? I know I was.</p><p>Maybe I should start at the beginning. But I'm not quite sure when that was. Probably when I decided to become a client ofwww.truelove.com.</p><p>Pretentious? Maybe. But I'd hoped that any man who chose a service by that name might be a little more grown up than most - had at least moved beyond a desire to bang supermodels and begun to think about finding a life. Being a literary agent, I should have known that semantics were as dead as most people's belief in a soul mate.</p><p>The date itself started out well enough. We met at a martini bar near my office. A new place, kind ofSex and the City, which should have tipped me off right away. If not to the whole demon issue, then at least to his hopes for the evening. He wasn't after true love.</p><p>I hadn't been completely honest, either. In my bio I'd said I was \"in publishing.\" I'd learned that the quickest way to a stack of manuscripts from the wannabe famous was to tell anyone but immediate family what I really did for a living.</p> <p>Of course some people figured it out as soon as they heard my name. My mother had been one of the top agents in the business before she'd gone and died on me. Was I following in her footsteps trying to regain some of the happiness I'd enjoyed while she was alive?</p><p>You betcha.</p><p>However, that wasn't working out. I liked to read, but I didn't like to sell. Sadly, my degree in ancient civilizations made me fit to do little but teach, and I doubted I'd be very good at that, either. Kids kind of scared me.</p><p>At loose ends - in my job and my personal life - I'd decided to start searching for that soul mate I'd been dreaming of. Just my luck, the first candidate didn't even have a soul.</p><p>I should have caught a clue to Eric's intentions the instant I'd seen his photo on the web. He was drop-deadgorgeous - dead being the operative word, although in truth, he hadn't been dead at the time.</p><p>Still, what on earth would a man like him want with a woman like me?</p> <p>One thing and one thing only. What's that horrible saying about all women being the same in the dark?</p><p>I'm not a hag, but I am short and just a little dumpy, with long, black hair that curls too much and the dark eyes and olive complexion of either my father's Sicilian ancestors or my mother's Hebrew ones.</p><p>Take your pick. With a name like Mara Naomi Elizabeth Morelli, I'd never be mistaken for a Nordic bimbo, even if I'd had a prayer of looking like one.</p><p>Anyway, call me Kit. Everyone does. I was never able to carry off the Mara Naomi Elizabeth thing.</p><p>Now back to the date - if not from hell, at least from a place very near by.</p><p>Manhattan.</p><p>Rich, blond, and handsome, Eric was every plain girl's dream. He wasnot very tall, which I liked, since big men always made me nervous; his teeth were white and straight; his eyes deep blue. He was also a surgeon. Of course he was too good to be true.</p><p>\"I'm so glad you came,\" he said, and his smile warmed the chill of the early spring night.</p> <p>Eric led me to a secluded table, held my chair, let his fingertips drift over my hair. Sure he got a little too close, rubbed his knee against mine a little too soon, laid on the interest in my job, my future, and me a little too thick. But I was lonely, confused, unhappy, and here was this great guy hanging all over me.</p><p>\"What do you say we take this to your place?\" Eric murmured, stroking the back of my hand.</p><p>I hesitated, uncertain how to say no. I'd never been one for sex on a first date; I wasn't one for sex at all. I might be smart-mouthed, just a little sarcastic - blame my mother - but I was also shy with men.</p><p>The thought of baring my body to a stranger - well, it wasn't a thought I entertained very often.</p><p>However, I was suddenly struck by the odd notion that tonight was the night I'd met the man I'd been waiting for all of my life.</p><p>\"Okay,\" I said.</p><p>Had that word come out of my mouth?</p><p>I'd been raised on my mother's tales of love at first sight. She'd taken one glance at my Italian-Catholic, working-class father and defied her wealthy intellectual Jewish family to marry him.</p><p>They'd been happy until the day she died. I'd been in my last semester of college, uncertain of what I should do with my life.</p><p>Then - bam - my mother had died from a brain aneurysm. Life suddenly seemed so short. Her work wasn't done, and I had no pressing place to be. So I slid into her job, and two years later I was still doing it.</p><p>My father never recovered from her death. He'd passed away just this winter. I was so lost without him, I felt hollow inside. Which had no doubt precipitated my sudden search for true love.</p><p>Hand in hand Eric and I left the bar and strolled south toward Chelsea.</p><p>I had an apartment on West Twenty-fourth Street. My mother had been avery good agent. Throughout her married life, she'd made three times the money of my electrician father. They'd deposited the checks and never mentioned it. Sowhen Daddy died, I'd nearly choked at the size of his bank account, which was now mine.</p><p>I'd spent the money on a condo, not too far from my Fifth Avenue office. Trying to live up to my mother's reputation meant I had to work harder and longer than everyone else. Saving commute time had seemed like the best way to invest my inheritance.</p><p>Eric's arm slid around my waist. Sighing, I leaned my head on his shoulder.</p><p>\"This is nice,\" I murmured.</p><p>\"It'll get nicer, I promise.\"</p><p>His palm drifted lower, cupping my bountiful butt, squeezing a little. His thumb slid down the center, and I jumped.</p><p>\"I can't wait to get inside you. You'll die of the pleasure, baby.\"</p><p>Baby?</p><p>Uck. I was going to have to put a stop to that. He sounded like a used car salesman, trying to sell me a vehicle I did not want.</p><p>His thumb teased me again, and I decided later would be time enough to discuss endearments. Who'd have thought a guy's thumb could be so arousing. Of course, I couldn't recall ever being this aroused.</p><p>Eric must have felt the same way because he yanked me in between two buildings and shoved me against the wall, slapping his lips against mine a little too hard. I tasted bloodwhen my teeth cut my lip, shuddered when he licked the blood away.</p><p>I should have been angry, disgusted, a little scared. Instead I felt...wanted. Something I'd never felt before. Sure, in a tiny sane portion of my mind I knew I'd lost it, but right now I couldn't summon the will to care.</p><p>Eric's body shielded mine from the night, his erection pressed against me too high to be of any help. I'd have to climb his body, wrap my legs around his waistif I wanted any relief. I was contemplating doing just that when the snick of a match made me still.</p><p>Someone else was in the alley.</p><p>I yanked my mouth from Eric's. His lips slid across my jaw, then latched onto my neck. My gaze went past his shoulder to the man hovering in the shadows. The glow of his cigarette did nothing to reveal his face. I got a sense of height, breadth, and darkness.</p><p>\"Eric,\" I whispered.</p><p>He continued to rain kisses across my chest, then rooted at the neckline of my brand-new black dress like a nursing child. My nipples tightened in anticipation, even as the glitter of eyes from the shadows caused a tingle of unease to dance across my skin.</p><p>What in hell was wrong with me? I was definitely not an exhibitionist.</p><p>\"There's someone here,\" I said more loudly.</p><p>\"Doesn't matter,\" Eric muttered, fumbling with hispants. \"Gotta do you now or I'll fade away.\"</p><p>Thatgot through to me. I might be attracted, aroused, insane, but I was definitely not so far gone that I'd let a virtual stranger screw me in an alley while another one watched.</p><p>\"No,\" I said.</p><p>He ignored me, sliding my dress up my legs, yanking at my pantyhose. The nylon wentping as his thumb popped through. A run shot down my leg, even as his erection beat a pulse against my stomach.</p><p>I began to struggle, becoming just a little afraid, yet in the midst of all that, I wanted him. And that scared me more than anything else.</p><p>\"You'll die happy, baby,\" he muttered. \"They always do.\"</p><p>A hand slapped onto Eric's shoulder. \"She said no,hibrido. \"</p><p>Though the words were harsh, the tone was mellow, the accent south of the border. A voice that could haunt me for the rest of my life.</p><p>Eric shifted, his shoulders blotting out everything but him. Neither the hand on his shoulder nor the whispered warning even slowed him down.</p><p>The salt, however, did.</p><p>I wouldn't have known what had been thrown inEric's face, except some of it hit me. The grains burned my eyes like hellfire.</p><p>Eric made a sound that was half snarl, half shout, and shoved away from me so hard my shoulder blades scraped the brick wall.</p><p>He swung around and the other man shot him.</p><p>Right in the head. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The shot was muffled - silencer,I thought - yetthe sound still bounced off the walls and echoed down the alleyway. Tensing in expectation of the blood splatter, my eyes slammed closed.</p><p>Nothing happened.</p><p>When I opened them again, I was alone.</p><p>No Eric. No stranger. No blood. What the hell?</p> <p>I stepped onto the street. No one appeared to have heard the gunshot, or if they had, they didn't care, continuing on their way with the typical zombielike trance of lifetime New Yorkers. The tourists were too busy staring upward, either dazzled bythe neon or trying to find their way to their hotels by way of the skyscrapers - a method similar to using the stars in places where stars could actually be seen.</p><p>I was dizzy with the adrenaline, both confused and frightened, so I wandered back into the alley, and I saw him.</p><p>Just a shadow, a slip of darkness against the light as he moved onto the street one block over.</p><p>I didn't think; I ran. If he vanished into the crowd, what would I do? How would I prove anything that had happened tonight? I didn't consider why I thought I needed to prove anything.</p><p>I burst out of the alley, and someone grabbed me around the waist. The force of my forward motion, and the sudden end to it, swung me about so fast, my feet lifted off the ground. A choked sound came from my throat, but I didn't have the air left to scream.</p> <p>Even if I had, it wouldn't have mattered since he slapped his hand over my mouth and dragged me backward. I just couldn't win tonight.</p><p>\"Why are you following me?\" he asked.</p><p>\"Why do you think?\"</p><p>My lips moved, but the words were garbled. His body, rock-hard against mine, tensed.</p><p>\"If I lift my hand, do you promise not to scream?\"</p><p>Since screaming hadn't worked very well for me so far, I nodded, and the hand went away.</p> <p>\"You shot my date in the head!\"</p><p>\"What date?\"</p><p>I blinked. \"The guy in the alley.\"</p><p>\"What guy?\"</p><p>\"Eric Leaventhall. Slim, blond, handsome.\"</p><p>He snorted.</p><p>\"What does that mean?\"</p><p>He didn't bother to answer, continuing to hold me aloft, my feet dangling near his knees. Hewas so much taller, so much broader, so much stronger, I felt helpless. And while that should have unnerved me, instead I got kind of annoyed.</p> <p>\"You mind?\"</p><p>I swung my feet, almost cracking him in the shin, and he set me down but kept his arm around my waist.</p><p>I could neither see him nor run away.</p><p>\"There wasn't any man,\" he said.</p><p>\"Of course there was. He bought me a drink. He - he - \"</p><p>I ran my tongue across my lip, felt the telltale ridge where my teeth had ravaged the skin when Eric kissed me. I wasn't crazy.</p><p>But this guy was.</p><p>\"Let me go,\" I ordered.</p><p>Amazingly, he did, and I scampered out of his reach and spun around.</p><p>My first thought: What a shame. He was too gorgeous to be insane. As if beauty and lunacy were mutually exclusive.</p><p>As dark as Eric had been light, bulky where Eric had been slim, this man was large, hard, his hair shaggy, his face shadowed by at least two days' growth of beard. The clothes had obviously been slept in, a lot, though even before that, they'd been years away from new.</p><p>His blue work shirt had faded nearly to white from repeated washings. With it unbuttoned to his sternum, I saw the hint of a tattoo, though I couldn't tell what the shape was. The jeans were ancient, too, the boots scuffed and dusty, his black leather jacket a relic.</p><p>His eyes were as dark as mine, but he had longer lashes. Isn't that always the way? High cheekbones, a fine blade of a nose. I wasn't certain, but I thought I saw the sparkle of an earring. Nothing fancy or swingy, just a shiny silver stud piercing one lobe.</p><p>He was so different from anyone I'd ever encountered - exotic and wild - I had to remind myself he'd just murdered my date in cold blood. Except... Where was the blood?</p><p>According to him, there hadn't even been a date.</p><p>I was back to the eternal question - was he crazy, or was I?</p><p>\"There was a man with me,\" I said, \"and you killed him.\"</p><p>\"If I had, you shouldn't be troubling your pretty little head.\"</p><p>My eyes narrowed, but he ignored me.</p><p>\"That's the quickest way to getting it shot off,\" he continued.</p><p>\"In other words, Eric troubled his pretty little head? About what?\"</p><p>\"I don't know any Eric. I walked through the alley. You were leaning against the wall. Figured you were high on something.\"</p><p>\"I was - \"</p><p>I broke off as I remembered what I'd been doing. Suddenly I was mortified. Why had I been making out with a stranger? Why had I been bringing him back to my apartment? Both behaviors were completely out of character.</p><p>With Eric no longer attached at the lip, I couldn't figure out why I'd been so enthralled by him.</p><p>\"He was here,\" I repeated, \"and you shot him.\"</p><p>The man cursed under his breath, a long stream of indecipherable Spanish that brought Ricky Ricardo to mind.</p><p>\"Come along,\" he snapped, and stalked back in the direction I'd come.</p><p>On the opposite end of the alley he paused, knelt, peered at the ground. \"No blood, no body.\" He lifted his gaze. \"No shooting and no guy.\"</p><p>Joining him, I stared at the stained, but not with blood, asphalt.</p><p>\"You want me to take you somewhere?\" he asked.</p><p>I didn't answer as I inched closer to the wall. I'd been leaning here. Eric had been standing there. Crazy man with a gun had been there, so... I peered more closely at the brick and found the bullet hole.</p><p>\"Aha!\" I stuck my finger into it and glared at the guy triumphantly.</p><p>\"Aha, what?\"</p><p>\"A bullet hole. You shot him.\" I frowned, remembering the no blood, no body problem. \"Or at leastat him. You missed.\"</p><p>He joined me, then poked his finger into one, two, three other holes. \"So did a lot of people.\"</p><p>I yanked my hand away, more miffed than scared. \"I know what happened.\"</p><p>\"Listen,chica, I didn't see any guy.\"</p><p>\"I am not crazy. And I don't do drugs.\"</p><p>\"Maybe you should.\"</p><p>At my glare, he lifted his hands in surrender. \"I meant prescription ones. You need help.\"</p><p>Maybe I did.DefinitelyI did if I'd not only imagined Eric but also his murder. Did I miss my dad even more than I thought?</p><p>Frustrated, I shoved my hand into the pocket of my dress. My fingers brushed paper and I remembered.</p><p>I'd printed out the last e-mail from Eric.</p><p>Withdrawing the sheet, I thrust it at the man. \"I'm not nuts, and here's the proof.\"</p><p>The guy narrowed his eyes, read the words, scowled. Then he pulled out his gun and pointed it at me.</p><p>Why had I never learned to leave well enough alone?</p><p>\"Let's go.\" He flicked the barrel of the gun toward the street.</p><p>\"Wh-where?\"</p><p>\"Your place.\"</p><p>I shook my head. \"I don't think so.\"</p><p>\"You don't get to think.\"</p><p>\"You're kidnapping me?\"</p><p>\"What was your first clue?\"</p><p>If I wasn't so scared, I might have found him funny.</p><p>He lost patience and grabbed me by the arm. \"Either take me to your place, or I'll take you to mine.\"</p><p>I doubted I'd care for his place. At least in my own I'd be surrounded by the familiar and have a hope in hell of escape.</p><p>\"Mine,\" I murmured. \"On West Twenty-fourth.\"</p><p>His eyebrows lifted. He obviously knew the neighborhood. Swell. Now he'd want money in addition to...whatever else he wanted.</p><p>My kidnapper set his left arm over my shoulders and I tensed, trying to inch away, but he wouldn't let me. Instead, he drew me close, then slid his right hand beneath his jacket and pressed the gun to my ribs.</p><p>I guess there'd be no shouting for help. He'd obviously done this before.</p><p>\"Who are you?\" I asked as we stepped onto the street.</p><p>\"Chavez.\"</p><p>\"Is that your first name or your last?\"</p><p>\"Both.\"</p><p>\"Right.\"</p><p>He shrugged, the movement rubbing his side against mine, making the gun skitter across my skin. I flinched, and he tightened his hold.</p><p>\"Relaje,\" he murmured in that voice that would have been seductive if he hadn't been kidnapping me at gunpoint. \"I don't want to hurt you,chica.\"</p><p>\"Then why are you doing this?\"</p><p>\"You'll be safer with me. I promise.\"</p><p>I snorted my opinion of that, and I could have sworn he laughed. The sound became a cough as I glanced up.</p><p>As the neon lights spilled over us, his face resembled something carved on a western mountainside. Not a hint of emotion - no humor, definitely no compassion. How could I possibly be safer with him? Right now the most frightening thing in my worldwas him.</p><p>\"What's your name?\" he asked.</p><p>I debated ignoring the question, but since he was dragging me home, he'd find out anyway. And did I really want him to continue calling mechica in a voice that reminded me of tequila on a scalding summer night?</p><p>\"Kit,\" I said, though not very nicely.</p><p>\"What kind of name is Kit?\"</p><p>\"Nickname. My whole name is longer than your - \" I paused and he stared down at me from on high.</p><p>\"Arm,\" I finished, and his lips twitched.</p><p>\"What is Kit short for?\"</p><p>\"My father called me - \"</p><p>My voice broke suddenly, embarrassingly. My father's death was too new, too painful, too private to talk about with a kidnapper.</p><p>\"Kitten,\" Chavez blurted.</p><p>I stopped walking. \"How did you know that?\"</p><p>\"Fits.\"</p><p>No one but my father had ever thought I resembled a kitten. Strange, and disturbing, that this stranger saw it, too.</p><p>We continued on silently. Every once in a while I couldn't stop myself from looking at him. He was everything foreign to me; I should be frightened. Instead that foreignness had turned my fear toward fascination.Especially when his hair shifted, a streetlight blared, and his earring sparkled.</p><p>A tiny silver cross. How strange.</p><p>I lowered my gaze, saw where we were, and paused, indicating the building on the other side of the street with a dip of my chin. \"This is it.\"</p><p>He scowled. \"You've got a doorman.\"</p><p>\"So?\"</p><p>\"Don't even think about tipping him off. Say I'm your boyfriend.\"</p><p>\"Right. Out of the blue I come home with a boyfriend like you.\"</p><p>\"What's wrong with me?\"</p><p>\"Besides the gun? The leather? The earring and the - \"</p><p>I stopped short of mentioning his tattoo. I wasn't sure it was there, and I didn't want him thinking I'd been staring at his chest.</p><p>\"The killing,\" I finished.</p><p>\"I didn't kill anyone.\" His eyes narrowed. \"Yet. If we're both lucky, I'll get what I want and be out of your hair in a few days.\"</p><p>\"A few days?\" I shouted, managing to startle several passersby.</p><p>\"Shh!\" He jerked me more tightly against him. \"I won't hurt you as long as you help me out.\"</p><p>\"That's what all the psycho kidnappers say right before they kill someone.\"</p><p>\"You have a lot of experience with psycho kidnappers?\"</p><p>\"I think I'm going to.\"</p><p>His lips tightened. \"I'm not crazy.\"</p><p>\"Which is what all the crazy people say.\"</p><p>He glanced at the sky, as if asking for guidance. For some reason, that calmed me. If he believed in the divine, he couldn't be all bad.</p><p>\"I'll tell you whatever you want to know.\" Chavez lowered his gaze from the heavens to my face.</p><p>\"Inside.\"</p><p>Since Ididn't have much choice, and he had the gun, I let him lead me across the street. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I'd always been able to relax inside my home,protected by two deadbolts and an ace security system, not to mention that I lived on the tenth floor.</p><p>With Chavez taking up too much space in my winter white living room, I doubted I'd calm down anytime soon.</p><p>\"You want a drink?\" I blurted.</p><p>His dark brows lifted, and I wanted to take the question back. This wasn't a social occasion.</p> <p>\"I don't drink,\" he said.</p><p>It was my turn to look surprised. Chavez definitely seemed the drinking type. Of course, appearances were never reliable.</p><p>Eric had seemed like a gentleman, but he'd taken off and left me in an alley with a gun-wielding maniac.</p><p>Guess he hadn't been \"the one\" after all.</p><p>You think?asked my increasingly sarcastic inner critic.</p> <p>My eyes, scratchy from wearing contacts, ached. I only wore the lenses on dates - in other words, once in a blue moon - preferring my glasses for everyday use.</p><p>\"I'm going to the bathroom,\" I announced, pausing when he followed me. \"I haven't needed help since I was two.\"</p><p>\"Tough. I don't plan to let you disappear.\"</p><p>\"There's only one way out.\"</p><p>\"What about these?\" He indicated the French doors that led to my balcony. I had another set in the bedroom.</p><p>\"Ten floors down. Spider Woman, I'm not.\"</p> <p>He almost smiled, caught himself, and scowled. \"I'll be right here.\"</p><p>\"I just bet you will,\" I muttered, and slammed the bathroom door.</p><p>While I was at it, I washed my face, changed into my sweats, then grabbed my glasses. I might as well be comfortable and kidnapped.</p><p>When I stepped into the front room, Chavez contemplated me for several ticks of the clock. I hated being stared at. Probably went back to those days in junior high, when being stared at was never a good thing.</p><p>\"What?\" I snapped.</p><p>\"You wear glasses.\"</p><p>\"I'm a short, dumpy, plain girl who reads books for a living. Of course I wear glasses.\"</p><p>He tilted his head. \"You read books for a living?\"</p> <p>Of all the things he could have focused on in my statement he chose that one? I rolled my eyes. \"Never mind. You said you'd answer my questions.\"</p><p>\"Sure. But first, show me all the e-mails you got from this guy.\"</p><p>\"So you admit he was there? I'm not nuts.\"</p><p>Chavez slid his weapon into a holster tucked under one arm. \"He was there.\"</p><p>I'd known that, but I felt better having him say it. I also felt better now that he'd put away the gun.</p><p>\"It wasn't very nice of you to try and make me think I was crazy.\"</p><p>\"I'm not nice.\" He flicked a finger at the computer in the corner of my dining room. \"The e-mails?\"</p><p>He'd kidnapped me to look at e-mails? Who was this guy? And who was Eric? I started to concoct all kinds of conspiracy theories.</p><p>\"Huh,\" he said when he'd read all of the messages. \"Nothing weird.\"</p><p>\"Should there be?\"</p><p>\"Considering what this guy is, yeah.\"</p><p>\"Is Eric some sort of secret agent?\"</p><p>And if so, what did he want with me? Besides the obvious.</p><p>\"Agent of the devil,\" Chavez murmured, still staring at the computer screen. \"Not much of a secret.\"</p><p>I frowned. \"Is that code for terrorist?\"</p><p>\"Terrorist?\" He glanced at me, amusement in his eyes, though nothing so lighthearted showed on his face. \"You think I'm Homeland Security? FBI? CIA?\"</p><p>\"You're something.\"</p><p>\"Got that right.\"</p><p>Considering his accent, his appearance, his innate foreignness, maybehe was the terrorist. Except we hadn't been at war - even a cold one - with any Hispanic countries for a long, long time. Of course, pretty much everyone hated us lately.</p><p>\"DEA?\" I blurted.</p><p>\"You think the guy was a drug dealer? You've got quite an imagination, but you're way off base.\"</p><p>\"Get me on base then.\"</p><p>\"He's a demon, and for some reason he wants you.\"</p><p>\"He's awhat?\"</p><p>\"Fallen angel. Spawn of Satan. Minion of hell. Soulless, evil, creepy thing.\"</p><p>For the first time tonight, I was speechless.</p><p>I'd started to believe that maybe Chavez wasn't crazy. Maybe he was just a gung-ho member of one of the many law enforcement agencies in a country that had gone a little overboard on security after September eleventh. Who could blame us?</p><p>But demons?</p><p>\"If Eric's a demon,\" I said slowly, \"that makes you a - \"</p><p>\"Rogue demon hunter.\"</p><p>I blinked. \"Lost in the Buffyverse, are we?\"</p><p>\"That show was a real pain in my ass,\" he muttered.</p><p>I wasnot having this conversation. Except I was.</p><p>\"Not sure what kind of demon he is,\" Chavez continued, as if he hadn'tjust said something weirder than weird. \"Salt didn't work. Neither did a silver bullet.\"</p><p>\"Maybe because there's no such thing as demons?\"</p><p>He turned a dark, placid stare in my direction. \"Then what do you call your date?\"</p><p>\"A jerk. But that doesn't mean he's the devil in disguise.\"</p><p>\"You didn't think he was such a jerk when you were letting him stick his tongue down your throat.\"</p><p>I stiffened, even as my face flooded with heat. \"You shouldn't have been watching.\"</p><p>\"If I hadn't, you'd be dead now.\" He tilted his head. \"You don't seem the kind of girl who'd let a guy screw her against the wall of an alley.\"</p><p>\"Gee, thanks. I think.\" I took a deep breath and admitted the truth, though I'm not sure why. \"I don't know what got into me.\"</p><p>\"It was almost Eric.\"</p><p>I ignored that. \"I don't sleep with men on a first date. I just felt - \"</p><p>\"What?\" He leaned forward, face intense.</p><p>I searched for the word to describe my bizarre lapse of character.</p><p>\"Consumed,\" I said. \"I couldn't seem to stop what was happening. I didn't want to.\"</p><p>Chavez jumped to his feet and began to pace. \"He's some kind of incubus.\"</p><p>\"Which is?\"</p><p>He paused, surprised. \"You've never heard of an incubus?\"</p><p>\"Of course. I'm just a little rusty on my demonology. Haven't had to use it in, oh...my entire life.\"</p><p>A slight narrowing of his eyes was the only indication that he didn't find me half as funny as I found myself. \"An incubus uses sex the way the rest of us use hamburger.\"</p><p>I got some bizarre images on that one and made a face.</p><p>\"I meant an incubus feeds on sex,\" Chavez muttered. \"If he goes too long without it, he dies.\"</p><p>\"So actually he'sjust like a regular guy?\"</p><p>\"Ha, ha. An incubus can also compel people to do what they normally wouldn't. Hence your humping him in the alley.\"</p><p>\"I wasn't.\"</p><p>\"You were going to.\"</p><p>Yeah, I was. That Eric had been a demon capable of influencing me to have sex with him explained a lot.</p><p>If I could only get past the demon part.</p><p>But I couldn't.</p><p>\"I don't believe any of this.\"</p><p>\"You'd rather believe you were so overcome with lust for a guy you'd just met that you were not only going to bring him back to your apartment after an hour in his company, but you were perfectly willing to do him in an alley with me watching?\"</p><p>When he put it like that... I still didn't believe Eric was an incubus.</p><p>\"Why didyou ?\" I blurted.</p><p>\"Excuse me?\"</p><p>\"Why did you think Eric was a demon? He seemed normal to me. Does he have a tail I'm not aware of?\"</p><p>\"That's a myth. Tails on demons. Some have them, true. But not all. And not Eric.\"</p><p>\"Then why him?\"</p><p>He turned away. \"Trade secret.\"</p><p>I stared at his back as he studied my collection of books on ancient civilizations. Most guys took one look at them and headed for the door. I hoped he'd do the same, but no such luck.</p><p>\"Trade secret?\" I repeated. \"That's convincing. Shouldn't there be nice men in white coats searching for you somewhere?\"</p><p>He faced me again. \"Are you a librarian?\"</p><p>My back stiffened as if I'd been slapped on the butt. \"What?\"</p><p>I wasn't even sure why I was insulted, except that I'd spent the better part of my afternoon off getting ready for the date from hell.</p><p>Literally, according to Chavez.</p><p>\"You said you read books for a living.\"</p><p>\"I'm an agent. I sell books to publishers.\"</p><p>\"Oh.\"</p><p>Yeah, I kind of felt that way about it, too.</p><p>\"I don't suppose you have any books on demons?\"</p><p>\"What do you need a book for?\"</p><p>\"Unless I know exactly what's necessary to kill a particular type of demon, they won't die.\"</p><p>A convenient excuse to explain why his methods didn't produce results. I recalled reading somewhere that the insane often constructed elaborate delusions with rules that actually made sense to the not so crazy.</p><p>\"You're the demon hunter, why don't you have a book?\"</p><p>\"There are way too many demons to fit in a single book, and I can't exactly carry twenty or thirty books with me everywhere I go, nor memorizeall the types and the methods.\"</p><p>\"What are the chances that the demon you're searching for would be listed in a book I might have?\"</p><p>\"Good point.\"</p><p>\"You kidnapped me because you thought I was a librarian?\"</p><p>\"I kidnapped you because you had info from the demon.\"</p><p>\"Now that you've seen it, you can leave.\"</p><p>\"The book?\" He gestured at the case.</p><p>\"I don't have anything on demons. Never studied them. Wasn't interested.\"</p><p>Disappointment trickled over his face like water down a windowpane. \"You can't help me then.\"</p><p>\"You need a different kind of help than I can give you.\"</p><p>\"You think I'm insane.\"</p><p>\"Big time.\"</p><p>His smile was as sad as his eyes. \"I hope you never have a reason to change your mind.</p><p>He left without any further attempt to convince me that there were demons in the world. He also left without a good-bye, going straight to the front door, then closing it quietly behind him.</p><p>After that, the night got boring.</p><p>I certainly couldn't sleep. So I made myself some tea and settled down to work. I had a stack of manuscripts with my name on them. I always did.</p><p>Reading was how I spent my free time, and that wasn't so bad. I loved books; I just hated selling them.</p><p>I'd been an agent for two years, and I was beginning to get the drift that I wasn't any good at it. Another depressing tidbit to add to a long list of them. What was I going to do if I didn't do this?</p><p>I'd come to believe that selling books was like selling a sunset or a lake or the bluest blue sky. How do you put a price on perfection?</p><p>Whenever I found a really great story, all I wanted to do was share it with the world - at any price.</p><p>Which made me a shitty agent.</p><p>I was no good at my chosen profession. I felt as if I were letting my mother down. The only time I was happy was when I lost myself in another reality, one of adventure and romance, a life I craved but would never have.</p><p>I turned to the stack of manuscripts I'd brought home from work. Unfortunately, the first one was more boring than peeling paint with my fingernails and did nothing to get my mind off Chavez. Interesting that I found myself unable to stop thinking about him instead of Eric.</p><p>\"Tattooed homicidal maniacs are always more fascinating than slim, blond surgeons,\" I muttered.</p><p>And why was that?</p><p>I forced myself back to the book. One good thing, it made me sleepy. Just after midnight I gave up and went to bed.</p><p>All the excitement had revved me up, and now I was crashing hard. Everything went black not more than an instant after my head hit the pillow.</p><p>I had a doozy of a dream.</p><p>The French doors opened. A breeze fluttered the curtains. The quilt waved like wind across water as it slithered off my bed. The sheets soon followed.</p><p>My body was hot, almost feverish. I yanked off my sweat suit and lay naked to the night.</p><p>A shadow slid from the balcony and into my room; like a spreading stain the gray darkness crept across the carpet, up the side of the bed, and spilled over me.</p><p>I was no longer hot, but pleasantly cool, the rapidly chilling sweat causing goose bumps to rise on my skin.</p><p>My sigh was arousal, desperation, need. Writhing, I cried out, and the shadow took the shape of a man.</p><p>No more than a shade really, impossible to see who he was, or evenif he was.</p><p>The wind was a whisper all around me, a language I didn't understand, yet words that encouraged me nonetheless. The air touched me everywhere, a caress that I welcomed.</p><p>I'd been waiting for this all of my life. Did I mention that I was a virgin?</p><p>The feather-light stroke of lips to the pulse at my throat, a tongue trailing over one breast, then the other, teeth grazing my nipple, then my stomach, then my thigh. Heated breath brushed the curls between my legs as a clever tongue did things that made me both limp and tense, tantalized and tortured.</p><p>I came awake, panting and gasping, my dream orgasm still rocketing through my body. I glanced around my room and stifled a scream.</p><p>The balcony doors were open, and a man stood on the other side. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Ifumbled for the phone, knowing it was too latefor 911, but I had to try. Unfortunately, at the first press of a button, the first tinybeep , the man on the balcony walked into my room.</p><p>I dropped the phone.</p><p>\"You!\"</p><p>Chavez bent and picked up the bedspread from the floor, then calmly flipped it around my shoulders and turned away. I hadn't gone to bed naked, but I was now. How much of that dream had been real?</p> <p>\"What are you doing here?\"</p><p>\"I thought - \"</p><p>\"We've been over this. There aren't any demons, Chavez. Go away.\"</p><p>\"I couldn't just let him come back and murder you.\"</p><p>I nearly dropped the bedspread. \"Murder me? Since when does he want to murder me?\"</p> <p>\"What part of incubus didn't you understand?\"</p><p>\"The part where he kills me.\"</p><p>\"He feeds off of sex.\"</p><p>\"Still not hearing death anywhere in that explanation.\"</p><p>\"After he's through with the women he's chosen, they...\" He paused, stuck his fingers into his pockets, and shrugged. \"They're sucked dry.\"</p><p>\"Which means?\"</p> <p>\"He has sex with them until they turn to dust.\"</p><p>Chavez had an answer to everything. I still wasn't buying any of it.</p><p>\"Thanks for the info,\" I said, \"but you don't need to stay. I'll be extra careful. Besides, I've got great locks and an even better security system.\"</p><p>\"I got in.\"</p><p>That stopped me.</p><p>\"How?\"</p><p>\"Breaking and entering. The demon will have an even easier time.\"</p><p>\"Because...?\"</p> <p>\"They can teleport.\"</p><p>\"That's it!\" I pointed to the door. \"I'm sick of your fairy tales.\"</p><p>\"Fairies aren't my department.\"</p><p>\"Out!\" I shouted.</p><p>Chavez was unimpressed with my theatrics. His gaze wandered over the room, over me. I pulled the bedspread tighter across my breasts.</p><p>\"I wanted to watch for a while, just in case he was nearby. Then I saw someone moving around in your apartment.\"</p><p>\"You mean someone like me?\"</p><p>His dark, serious eyes met mine. \"Definitely not you.\"</p><p>Despite my brave words, I glanced toward the bedroom door.</p><p>Chavez laid a hand on my arm. \"I searched the place. No one's here.\"</p><p>His touch, in my bedroom, in the night, with me wearing nothing but a blanket, should have been un nerving. Instead I found it comforting. My reactions to men tonight were nothing short of bizarre.</p><p>\"No one except you,\" I muttered.</p><p>The room was dark, his figure shadowy. I was reminded of the dream, and my skin suddenly felt too small for my body. I shifted, and he stepped back quickly, as if he didn't want to get too close to me, almost as if he were afraid.</p><p>I glanced up, and his eyes glittered in the small amount of light from the half moon that spilled through the open French doors. What time was it? How long had I been asleep?</p><p>I was so confused - going from unconscious to conscious, from fear to safety, from arousal to...arousal all over again. With Chavez looming over me while I was still naked, my bodyhumming from an orgasm that had seemed pretty real, my head spun. I swayed and he grabbed me by the shoulders.</p><p>\"Chica?\"</p><p>That voice trilled along my flesh like warm water in winter. Both familiar and foreign, I could listen to him all night.</p><p>\"Did you touch me while I was sleeping?\"</p><p>I hadn't meant to ask that, but now that I had, I wondered.</p><p>Instead of an answer, he kissed me, and I forgot the question.</p><p>He was so tall my neck crackled as I leaned back, so good at kissing I automatically went onto my tiptoes to get more.</p><p>His mouth was soft, sweet. Now that I was closer I caught the tang of the cigarette he'd no doubt been smoking on my balcony. He must have chewed gum to get rid of the taste.</p><p>I shuddered as his tongue tested my lips. Opening, I let him all the way in. I wound my arms around his neck, and the quilt slid to the floor.</p><p>I'd never been kissed the way Chavez kissed me, as if I were the only woman in the world, the only woman he'd ever wanted. Foolish, I know, but that's how he made me feel, and I began to wonder, in a far corner of my mind, exactly who was the sexual demon.</p><p>Even though my naked body was pressed against him, he did nothing but kiss me. He didn't slide those big, hard hands over my skin, no matter how much I might want him to. In fact, when I ran my fingers across his shoulders, down his arms, I discovered he was clasping those hands behind his back as if to keep them under control.</p><p>I don't know how long the embrace would have continued, how far we would have gone. I was certainly in no hurry to end it. But Chavez stepped back, shook his head when I would have followed, then snatched the blanket again and covered me.</p><p>\"Lo siento,\" he murmured. \"I don't know why I - \"</p><p>He glanced away, and the movement pulled the collar of his shirt in a different direction. Hedid have a tattoo on his breastbone, but I still couldn't see what it was.</p><p>My fingers touched my lips; they felt swollen, sensitive, needy. I craved the taste of his mouth.</p><p>Was not having had sex, ever, turning me into a nymphomaniac? Although I had to say that what I'd felt while kissing Chavez had been far and away better than what I'd felt with Eric. Then I'd been out of control; this time Chavez had been.</p><p>I liked that he had been fighting the lust. I was not the kind of girl who inspired it. When we weren't talking incubus demon anyway.</p><p>\"I shouldn't - \" he continued. \"You're a - \"</p><p>I stiffened. \"A what?\"</p><p>\"A job.\"</p><p>My eyes narrowed, but he still wasn't looking at me.</p><p>\"I'm supposed to take care of you, not take you.\"</p><p>\"So why did you?\"</p><p>His glance snapped back to mine. \"I didn't! I wouldn't.\" He sighed. \"I can't.\"</p><p>\"Can't?\"</p><p>Chavez's lips twisted. \"That's not true, as you can easily see.\"</p><p>My gaze lowered to his jeans. He definitely could.</p><p>\"I mean I can't and still live with myself. You've been influenced by an incubus. They mess with your mind. All you want is sex.\"</p><p>\"That doesn't sound like me.\"</p><p>\"Exactly.\"</p><p>\"The incubus hasn't influenced you.\"</p><p>\"What?\"</p><p>\"Youkissedme . Why?\"</p><p>\"I couldn't help myself. You were so small and lost.\" He shrugged. \"And those glasses...All those books.\"</p><p>\"I - what?\"</p><p>\"I never finished school. I don't read that well. I like women who do.\"</p><p>\"You're attracted to women who read?\"</p><p>\"Yeah.\"</p><p>I shook my head. This was all still insane and so was he.</p><p>\"Maybe you're the one whose mind has been messed with,\" I muttered.</p><p>He gave a short, humorless bark of laughter. \"I haven't had sex in a very long time. I kind of forgot how much I missed it.\"</p><p>\"Forgot?\"</p><p>Even I, who'd never had sex, certainly didn't forget about it.</p><p>\"Until I saw you, on the bed, with him.\"</p><p>I stiffened. \"I wasn't with him.\"</p><p>That had been a dream, hadn't it?</p><p>\"He's in your head now. He'll haunt you. He'll make you so insane with lust you'll have no choice but to - \"</p><p>\"I don't believe this,\" I interrupted.</p><p>\"I do.\" He pulled a cigarette from his coat, which he'd laid on my unused exercise bike in the corner.</p><p>\"I'm going to - \"</p><p>He nodded toward the balcony.</p><p>He seemed so sad, so defeated somehow. Even though I thought he was crazy, I still wanted to soothe him.</p><p>Chavez thought my glasses were sexy, my dumpiness cute, my penchant for reading on a Friday night attractive. No wonder I wanted to keep him around forever.</p><p>Which only made me as nuts as he was. But I was starting to wonder if that wasn't the case.</p><p>\"You want some coffee?\" I blurted.</p><p>\"Yeah.\" He slipped out the doors and into the night.</p><p>Quickly I threw on my sweats, grabbed my glasses, and hurried through the darkened apartment. In the kitchen I reached for the light switch, and someone grabbed my hand.</p><p>I drew a deep breath to shriek, and another hand slapped over my mouth. This was happening to me with far too much regularity lately.</p><p>\"Did you think I'd let you go?\"</p><p>The voice wasn't Eric's. Come to think of it, the guy was too tall to be Eric. His body was pressed to the length of mine and then some.</p><p>Whoever he was, he really, really liked me.</p><p>I tried to speak, but he tightened his hold, pulling my neck backward until I thought he might break it. I went silent; I had no choice.</p><p>\"You're mine now. I need what only you can give.\"</p><p>He kissed my neck, scraped the throbbing vein with his teeth. A weird lethargy came over me. My blood seemed to thicken and slow; my pulse beat in my ears as if I'd been running for miles, or making love for a long time.</p><p>I was suddenly free - to scream, to fight, to escape. I did none of those things. Instead, I turned around and flicked on the lights.</p><p>As I'd suspected, the man in my kitchen wasn't Eric. I'd never seen him before. Taller, broader, his hair was dark blond, his eyes brown.</p><p>He shrugged out of his shirt. The garment slid down his arms and spilled onto the floor.</p><p>His skin was glaring white, like marble, the muscles shifting and bunching as he moved. I was seized with a sudden urge to lick every one of them as he rose above me, came into me, took me over and over, until I - I shook my head, hard, tempted to slam it against the countertop until I found myself again.</p><p>\"Wh-who are you?\" I asked.</p><p>\"You know.\"</p><p>His fingers slid down his chest, caressing himself, lowering to the zipper that bulged over an erection my mouth went dry at the notion of seeing.</p><p>The sound of the zipper being opened made me start so violently my skin tingled.</p><p>\"You'll die willingly in my arms,\" he whispered. \"They always do.\"</p><p>As if from a long way off, I heard his words, puzzled over them, discarded any unease. The sex would beamazing. I'd come screaming. I'd beg him to do me again, and he would. He'd keep at it until I was - Chavez loomed behind him. His presence brought me back to myself, so when he snapped, \"Get down!\" I did, hitting the floor just as a sheet of flame streaked from his hand.</p><p>I cried out as the strange man in my kitchen, the one I'd been willing to screw seven ways from Sunday, became a burning ball of fire.</p><p>My smoke detector went off; the sprinklers rained water on us all. The man, whose name I didn't know, stopped burning. There wasn't a mark on him.</p><p>He stared at Chavez. \"You again.\"</p><p>\"Me always.\"</p><p>The stranger turned to me.</p><p>\"We aren't finished,\" he said.</p><p>And then he disappeared. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"You believe me now?\" Chavez asked as wedripped all over the carpet from the kitchen into the living room.</p><p>He'd turned off the alarm, which had shut down the sprinklers, while I called security and lied. \"I burned some toast.\"</p><p>No one asked why I was making toast at 3A.M. One of the perks of living in a building like this - money not only got you attention, it got you left alone.</p><p>\"The guy disappeared.\" My voice sounded as dazed as I felt. \"Poof.\"</p> <p>Chavez gave me a slight push, and I collapsed onto the couch. Water darkened his hair, ran down his cheekbones, dotted his eyelashes. \"Towels?\"</p><p>\"Hall closet.\"</p><p>He retrieved a stack, divided them, and sat in a chair as he began to dry his hair.</p><p>\"That wasn't Eric,\" I said.</p><p>\"No.\"</p> <p>\"He also wasn't human.\"</p><p>\"No. Shape-shifter most likely.\"</p><p>I tried not to gape, but failed.</p><p>\"Like a werewolf?\"</p><p>\"In a way. Demons shift into different people. Werewolves change from a man, or a woman, into a wolf, then back again.\"</p><p>\"You say that as if they exist.\"</p> <p>He lifted a brow.</p><p>I lifted my hand. \"I don't want to know.\"</p><p>Chavez went silent for a moment, then said slowly, \"Why did he come back?\"</p><p>\"I'm irresistible?\"</p><p>\"Sure, but...\" He trailed off.</p><p>I was still stuck onsure . Was he being a smart-ass? And why did I care? Why did my chest, which had felt like a cow was sitting on it, suddenly feel like butterflies were twirling merrily inside?</p><p>Because of that damn kiss. I couldn't stop thinking about it.</p><p>But I had to. Maybe he wasn't crazy anymore, actually he never had been, but that only meant he was a demon hunter. He wasso not for me.</p> <p>\"He's an incubus,\" Chavez murmured, thinking out loud. I yanked my eyes and my mind from his mouth and listened. \"He needs sex to live. But there are a million plus women in this city. Why not get it somewhere else?\"</p><p>\"Yeah, why not?\"</p><p>His head tilted. \"Whatdid he say to you?\"</p><p>\"That we weren't finished. He needed something only I could give.\"</p><p>\"What?\"</p><p>\"Got me.\"</p><p>I was new at the whole sexual demon gig.</p><p>\"If I can discover why he's obsessed with you, I might be able to figure out exactly what kind of incubus he is.\"</p><p>\"There's more than one kind?\"</p><p>Chavez nodded. \"The headingincubuscovers a wide range of sex-feeding demons. Each one of those has its own particular method of death.\"</p><p>\"Terrific,\" I muttered.</p><p>\"As soon as I know exactly what he is, I can find out how to kill him.\" His dark eyes met mine. \"You'll be safe as soon as I kill him.\"</p><p>Funny, I felt safe now.</p><p>An hour later we'd cleaned up the apartment, cleaned up ourselves. I was dry and dressed.</p><p>Unfortunately, so was Chavez. I'd kind of enjoyed the short period when he'd worn nothing but a towel around his waist and another looped around his neck as his clothes tumbled around the dryer with mine.</p><p>We sat in the living room, lights blaring against the remnants of the night. I'd made the promised coffee, and we both sipped from the largest travel mugs I had in my cupboard. I needed more sleep, but since I wasn't going to get it, I'd have more coffee.</p><p>\"What do we do now?\" I asked.</p><p>He glanced up. \"We?\"</p><p>\"We,\" I said firmly. \"I don't plan to sit around waiting to be demon raped.\"</p><p>His hands jerked, sloshing hot liquid very near the rim. \"He won't rape you; he'll make you want him.\"</p><p>\"Makebeing the operative word. Even if I think I want him, I really don't. Which means he's raping my mind as well as my body.\"</p><p>I set down the cup. My hands had begun to shake at the thought of what was after me, of my complete lack of control whenever it came near.</p><p>\"I want him dead.\" I lifted my chin. \"Preferably last week.\"</p><p>\"Okay,\" Chavez murmured, staring at me with newfound respect. \"I guess it's we.\"</p><p>\"What do we do now?\" I repeated.</p><p>\"You know where Eric lives?\"</p><p>\"No. And he wasn't supposed to know where I lived, either. That's the beauty of Internet dating.\"</p><p>\"Not exactly. If you know what you're doing, an address is pretty easy to find. Can I use the computer?\"</p><p>Moments later, we had Eric Leaventhall's address on the Upper East Side.</p><p>\"Let's pay him a visit.\" Chavez glanced at the window. The sun was just coming up. \"We've got only so many hours of daylight.\"</p><p>\"What difference does daylight make?\"</p><p>\"Dark spirits arise at sunset.\"</p><p>\"Seems like there's too much evil in the world all day to have demons only available at night.\"</p><p>\"Just because the demon is sleeping doesn't mean it isn't still whispering.\"</p><p>Which actually explained quite a lot.</p><p>Not too long afterward, we paused on the sidewalk opposite Eric's building. He had a doorman, too.</p><p>\"Now what?\" I asked, but Chavez was already cutting across the street.</p><p>I hurried after him, catching up as he slippedaround the corner and headed for the service entrance.</p><p>Chavez stopped and handed me a pair of plastic gloves. After donning a pair himself, he withdrew a long, thin strip of wire from his pocket.</p><p>\"Done this before?\" I asked.</p><p>Chavez didn't botherto answer as he jimmied the lock. At Eric's door he used what appeared to be a pocket calculator and a squiggly power cord to disable the security system. My feeling of safety was rapidly disintegrating.</p><p>\"Where did you learn this stuff?\" I asked. \"Rogue demon hunter school?\"</p><p>He shook his head and used the wire again, popping the lock as if it were a toy. \"On the streets like everyone else.\"</p><p>\"Everyone?\"</p><p>Chavez glanced over his shoulder and smiled. His teeth were so white they blinded me. Or maybe I was dazzled by the excitement in his eyes. He was having fun, and at the moment so was I. I couldn't recall the last time I'd felt this alive.</p><p>Was it because I might be dead soon? Or was it because I was with him?</p><p>\"EveryoneI knew,\" Chavez answered. \"In Mexico City there were way too many people, not enough houses or jobs.\"</p><p>Mexico City explained the accent. I doubt Chavez would ever be able to completely explain his occupation. How did one become a rogue demon hunter?</p><p>Chavez pushed open the door, motioned for me to stay in the hall. I was about to argue, but did I really want to be caught breaking and entering? Of course just being here was probably enough to get me arrested. Nevertheless, I stayed behind. For about thirty seconds.</p><p>When Ricky Ricardo - like cursing erupted, I trailed the sound to where Chavez knelt next to Eric's dead body.</p><p>\"Oh-oh,\" I muttered.</p><p>I was suddenlynot having fun.</p><p>Chavez glanced up. \"He was dead when I got here.\"</p><p>\"The cops arenot going to believe that.\"</p><p>\"Which is why we won't tell them.\"</p><p>I blinked. \"But - but - we have to.\"</p><p>Chavez examined Eric, hands still covered in the plastic gloves. \"Where is that written?\"</p><p>\"In the code of common decency.\"</p><p>\"Never read it.\"</p><p>Why wasn't I surprised?</p><p>Chavez went on with the examination. Pushing at Eric's skin, turning him this way and that, ruffling through his hair before leaning back. \"There's no visible means of death.\"</p><p>\"What difference does that make?\"</p><p>\"Could help to reveal what kind of demon this is. For instance, if the demon killed Eric, then inhabited the body, he'd want to kill him so as not to leave a mark.\"</p><p>\"Okay.\"</p><p>\"But if he inhabited him, then killed him when he was finished, no reason not to cause graphic bloody death.\" At my sharp glance he shrugged. \"Demons are evil. They like to make a mess.\"</p><p>\"Wait a second.\" I was suddenly so dizzy, I had to sit and I didn't want to do so next to the body. With no convenient chair nearby, I made do with leaning against the nearest wall. \"Are you saying I had a date with a dead guy? Ikissed a dead guy?\"</p><p>\"Sorry.\"</p><p>\"Not as sorry as I am.\"</p><p>I dragged the back of myhand across my mouth and got a good taste of plastic glove. At least it made me stop tasting Eric.</p><p>\"Look at the bright side,\" Chavez said. \"At least you didn't screw a dead guy.\"</p><p>Hey, there was a silver lining to every cloud.</p><p>\"If Eric was dead on our date, how could he seem so alive?\"</p><p>\"When demons animate a body, the postmortemchanges are frozen. Once the demon exits, the decomposition begins.\"</p><p>He lifted Eric's arm, or tried to. Eric was stiff as a...corpse.</p><p>\"By the state of rigor mortis, the demon has been gone less than eight hours.\"</p><p>\"Why bother to exit at all? He'd found a perfectly good body.\"</p><p>\"Several reasons. One - I'd seen his face, and he knew I'd be searching for it. Two - decomposition can only be stopped for a few days. Demon reanimation or not, dead is dead.\"</p><p>Chavez stood, but continued to stare at Eric, thinking out loud. \"A demon inhabiting the newly dead makes me think night wanderer - a Rakshasas.\"</p><p>\"Hindu,\" I said.</p><p>His gaze flicked to mine. \"How do you know that?\"</p><p>\"I have a degree in ancient civilizations.\"</p><p>\"Why?\"</p><p>A question I'd often asked myself.</p><p>\"I was interested.\"</p><p>\"So am I. What else do you know about Rakshasas?\"</p><p>\"Squat. I remember the name, but Ididn't spend too much time on ancient religions. I was more concerned with the rise and fall. Weapons and wars.\"</p><p>\"I wouldn't think that would be up your alley at all.\"</p><p>I shrugged. \"I do recall that one thing most civilizations have in common is a belief in a greater good, as well as a greater evil.\"</p><p>His gaze sharpened. \"Exactly. Demons by any name are still demons.\"</p><p>\"And God is still God. If you search long enough you can find a similarity even in the most disparate societies.\"</p><p>\"Too bad no one ever takes the time to look.\"</p><p>\"Too bad,\" I echoed. \"Now tell me about the Rakshasas.\"</p><p>\"A Hindu demon that reanimates corpses. Except the Rakshasas isn't interested in sex. Unless it's with the dead. Or maybe they eat the dead.\" His lips tightened. \"I can't remember. Either way, fire is how you kill them, and it didn't work on this one.\"</p><p>\"You didn't use fire on Eric, that was on the other guy.\" I frowned. \"Whoever he was.\"</p><p>\"Has to be the same demon inhabiting different men. Otherwise why did he come back for you? Why did he say, 'We aren't finished'? Why did he know me?\"</p><p>I shrugged since I didn't have a clue. \"Why do demons inhabit people anyway? Why don't they just come to earth and do their thing?\"</p><p>\"Demons in their natural form are so hideous, humans can go mad from the sight. Their voices are so god-awful, eardrums rupture. People can die from the shock before a demon ever gets its jollies. As terrible as possession is, the alternative is worse.\"</p><p>We went silent for several moments just contemplating it.</p><p>\"Any other ideas on what kind of demon we're dealing with?\" I asked.</p><p>\"No. Every one that I know of would turn to dust at the touch of salt, fire, or silver.\"</p><p>\"Which means?\"</p><p>Chavez lifted his gaze to mine. \"We've got a demon I've never heard about.\"</p><p>\"Does that happen a lot?\"</p><p>He lit a cigarette and took a drag.</p><p>\"Never.\"</p><p>\"Never?\" My voice rose so high, he flinched.</p><p>\"Here.\" He held the cigarette to my lips.</p><p>I jerked back. \"I'm not so hysterical that I need to start smoking. But thanks anyway.\"</p><p>\"Smoke keeps the demon from possessing you.\" He glanced at the body. \"I think this one's gone, but it never hurts to be cautious.\"</p><p>He stuffed the unlit end between my lips with a little too much force. The filter smashed against my teeth.</p><p>I shoved him away, then took a drag. I wanted to avoid demon possession as much as the next person.</p><p>\"There.\" I let the smoke trail out through my nose - hey, I'd gone to college. \"I thought this demon only inhabited dead people.\"</p><p>\"Since I don't know for sure what type of demon this is, it could do just about anything.\"</p><p>\"Terrific,\" I muttered.</p><p>\"Mmm.\"</p><p>My curiosity was piqued by something else he'd said. \"Possession really happens? That isn't just in the movies?\"</p><p>His face went still, his eyes hard. \"Demons inhabit anything and anyone they damn well please.\"</p><p>I'd been curious, but suddenly I didn't want to know what he'd seen, what he'd done, what he'd killed.</p><p>His eyes were haunted for a reason.</p><p>Chavez stared at me for several seconds, as if he planned to say something else. Then he took the cigarette, pinched the lit end between his fingers in a macho display that I refused to acknowledge, and placed the butt into one of his pockets.</p><p>Without another word, Chavez trailed around the apartment, picking through the mail, then moving on to the phone messages. Not wanting to be left alone with dead Eric - I had the nasty suspicion he'd open his eyes and try to seduce me again - I tagged along.</p><p>\"We need to find the other guy,\" Chavez murmured.</p><p>\"According to you, he's already dead. What's the rush?\"</p><p>\"Maybe the demon is still inside him. We could save the next poor sap on the dead dating parade.\"</p><p>I hadn't thought of that. Which was why he was the demon hunter and I was the one being hunted by the demon.</p><p>We left the apartment, and Chavez glanced at the security camera on the wall.</p><p>\"We may as well call the police,\" I muttered. \"They'll be calling me soon enough.\"</p><p>\"I checked it when we came in. The light's not on. Whoever was here before us disabled the camera.\"</p><p>\"That was nice of him. I think.\"</p><p>\"I doubtnice had anything to do with it.\" Chavez headed for the service entrance. \"This demon's a lot smarter than most.\"</p><p>\"Are they usually stupid?\"</p><p>\"No. But they're not exactly savvy with the ways of the world. Kind of like a bull in a china shop - flailing around, obsessed with getting whatever it is they came here for. They don't worry about security cameras, police, or demon hunters. They think they're invincible.\"</p><p>\"But they aren't.\"</p><p>\"Not invincible, no, but hard to kill. Only one, maybe two, methods will work, and the trick is to figure out what before the thing kills you.\"</p><p>The trill of excitement returned. Life and death. Good versus evil. The stuff of really great books - and Chavez was living it. Too bad I might be dying from it.</p><p>\"You must be very good at your job,\" I said.</p><p>\"I'm the best.\"</p><p>\"How did I get so lucky?\"</p><p>Chavez checked the alley, then motioned for me to follow him. \"Lucky?\"</p><p>\"How did you find me?\" I paused. \"Actually, I guess you found Eric. Is there a demon hunter hotline?\"</p><p>\"No.\"</p><p>He didn't elaborate, just stalked off so fast I had to move double time on my short legs to catch up. His face, when I reached him, was stonelike, unwelcoming. Wrong question, I guess, so I tried another.</p><p>\"Are there a lot of demon hunters? You have a club or something?\"</p><p>The look he shot my way would have scared me several hours ago. Now it intrigued me. There was a whole world out here I'd never known about. No one did.</p><p>\"Roguemeans I don't play well with others,\" he said. \"I don't like rules.\"</p><p>\"There are rules?\"</p><p>\"I've heard there's a society of monster hunters. Had a few approach me about a demon-hunting unit. I guess they've got government funding.\"</p><p>\"TheU.S. government?\"</p><p>\"Hardto believe, isn't it?\"</p><p>\"After being kissed by a dead man dating, not really.\"</p><p>\"Funny how a little thing like that changes your whole perspective.\"</p><p>\"I wouldn't call it funny. Why didn't you throw in with the monster hunters?\"</p><p>\"Even though getting paid would be nice - \" he began.</p><p>\"You don't get paid?\"</p><p>\"Chica,\" he said with infinite patience, \"who would pay me?\"</p><p>\"How do you live?\"</p><p>\"Very carefully.\" At my frown, he lifted one hand. \"I do odd jobs for cash.\"</p><p>Cash?</p><p>\"Are you an illegal alien?\"</p><p>\"Yes.\"</p><p>\"Oh.\" I couldn't think of anything to say to that. \"Wouldn't it be easier to get paid for what you're already doing for free?\"</p><p>\"The money would be nice,\" he repeated, \"but the government would want to know where I'm from.</p><p>How I got here. What I've been up to for half my life. I don't want to tell them. And I don't like being told what to do. I ask no one's permission. I never will. I eliminate evil from this world no matter the cost.\"</p><p>\"Sounds like a good policy to me.\"</p><p>\"I doubt you'd think so if you were part of that cost.\"</p><p>I stopped and stared at him. \"You'd sacrifice an innocent person to eliminate a demon?\"</p><p>He kept walking, but his answer drifted back on the early morning breeze.</p><p>\"I'd sacrifice anything and anyone.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>So much for any dreams I might have had aboutChavez and me. Not that I'd been having any. I wasn't that stupid. But Ihad felt safe with him. Until he'd admitted he'd toss me over a cliff to rid the world of one more demon.</p><p>Well, he hadn't actually said that but I could read between the lines pretty well. Occupational hazard.</p><p>\"Mind if I use the computer again?\" Chavez asked when we returned to my apartment.</p><p>The place smelled wet. I opened a window, lit a candle, turned up the heat.</p> <p>\"Go ahead.\" I yanked the newspaper out of my mail drop.</p><p>\"I want to find out who that second guy was.\"</p><p>\"I don't think you need to.\"</p><p>I turned the paper in his direction. The face of the man Chavez had lit onfire last night was all over the front page.</p><p>He appeared to be missing. Or at least his body was.</p> <p>\"Malcolm Tanner,\" I read. \"Stockbroker. Hasn't this demon ever heard of street guys? Their deaths and disappearances would be less noticeable.\"</p><p>\"Would you date one?\"</p><p>\"I didn't date Malcolm.\"</p><p>\"True. You didn't even know him. Which might be the point.\"</p><p>\"You lost me.\"</p><p>\"If he picked people you knew, sooner or later the police would be knocking on your door. But random guys? Hard to connect.\"</p> <p>\"Why bother setting up a date in the first place? Malcolm just popped in here, uninvited.\"</p><p>\"Some demons need to be invited in first.\"</p><p>\"Like a vampire?\"</p><p>\"Now you're catching on.\"</p><p>\"But Malcolm - \"</p><p>\" - was the same demon as Eric, just a different body.\"</p><p>\"So since I invited Eric - \"</p><p>\"Malcolm could enter.\"</p> <p>\"How do you know this stuff?\" I asked. \"Is there awww.demonology.com ?\"</p><p>\"No. What I've learned is mostly by trial and error.\" He lifted one shoulder. \"A little half-assed, but all I've got.\"</p><p>\"You've tried salt, fire, silver. What's next?\"</p><p>\"Holy water, the Hail Mary, the Lord's Prayer, sacramental wine, the host.\"</p><p>\"I'm seeing a pattern.\"</p><p>\"Christian symbols.\" He sighed. \"The problem is, there are a lot of demons that aren't Christian in origin and some that predate Christianity.\"</p><p>Since I'd studied plenty of ancient civilizations, I was aware of this. Still, the idea that something could predate time as we marked it had always creeped me out. Probably an American phobia. In countries that had been around for a few gazillion millennia, people didn't get wiggy over a little pre-Christian demon or ten. Did they?</p><p>\"How can you kill something so ancient?\" I wondered aloud.</p><p>\"It ain't easy.\"</p><p>My gaze was drawn to his earring. \"If Christian symbols don't work, then what's with that?\"</p><p>\"I didn't say they don't work. They do. More than most.\" He fingered the cross in his earlobe. \"Every little bit helps.\"</p><p>\"What can I do?\"</p><p>\"Any good at research?\"</p><p>\"Actually, yes.\"</p><p>Research was what had brought me to my major. I loved looking things up, finding answers to questions only I cared about.</p><p>His gaze traveled from the tip of my overly curly hair, past my black-rimmed glasses, to the ample breasts and hips ensconced in an oversized sweatshirt and equally oversized jeans.</p><p>\"I've always had a thing for librarians,\" he murmured. \"They're so...helpful.\"</p><p>Considering his face, that hair, the body, I just bet they were.</p><p>\"I'm not a librarian,\" I said stiffly.</p><p>\"We could pretend.\"</p><p>I stared at him for several seconds. Was he trying to make a joke? It was hard to tell when he never cracked a smile.</p><p>Chavez turned away, and the strange, charged moment was gone. \"I'm going for supplies before it gets dark.\"</p><p>\"What supplies?\"</p><p>\"Holy water, host - \"</p><p>\"Where do you get stuff like that? At the discount holy water and host shop?\"</p><p>\"A church.\"</p><p>\"They give it out because you ask?\"</p><p>\"BecauseI ask, yes.\"</p><p>My skepticism must have shown on my face because he continued. \"Priests believe in evil, Kit. If they didn't they wouldn't have a job. They've seen amazing things - great good and great bad.\"</p><p>\"And you? Do you ever see any good?\"</p><p>His eyes met mine. \"Not until just lately.\"</p><p>\"What'd I do?\"</p><p>\"You chased me out of the alley. You wouldn't stop questioning me. You weren't afraid to stand up to the insane man you believed had shot your date.\"</p><p>\"Youdidshoot my date.\"</p><p>\"ButI didn't kill him.\"</p><p>\"There is that.\" I tilted my head, curious. \"What else?\"</p><p>\"You let me into your home.\"</p><p>\"At gunpoint,\" I muttered.</p><p>\"Not all the time. You went breaking and entering with me. No one's ever done that before.\"</p><p>\"No one?\"</p><p>He shook his head. I got all warm and fuzzy.</p><p>\"So your interpretation of good is...\"</p><p>Pretty damn broad. Basically I hadn't screamed, called the police, or kicked him out of my house. Give me the Nobel Prize.</p><p>\"You're courageous, unselfish, a risk taker,\" Chavez said.</p><p>That didn't sound like me at all. It sounded more like theme I wanted to be.</p><p>\"And then there's that kiss.\"</p><p>I looked up and he smiled.</p><p>\"Good?\" I asked.</p><p>\"More like great.\"</p><p>Hours passed. The sun moved across the sky and began to descend. I began to get nervous.</p><p>Where was Chavez?</p><p>If I were a demon, I'd put my death on hold and go straight for the demon hunter. The thought made me unable to sit still, so I paced from the bedroom to the living room and back again.</p><p>\"I'm sure Chavez has had demons come after him before,\" I told myself.</p><p>Hell, that was probably what he wanted.</p><p>Nevertheless, I was close to frantic. The first man who thought I kissed great - or at least the first who'd told me so - just my luck he'd walk out of my life and never come back.</p><p>I'd just completed my fifty-fifth pass into the bedroom when a soft footfall from the living room caused me to freeze.</p><p>I bit my lip, then glanced at the window. The sun was still up, though not for long. Nevertheless, daylight was daylight, and we still had it.</p><p>\"Chavez?\" I hurried into the front room and stopped dead at the sight of a strange young man with a huge pot of daffodils.</p><p>\"How did you get in?\"</p><p>\"The doorman. He thought you were gone. Should I set this here?\" He indicated the floor.</p><p>\"Sure. Fine. Whatever.\"</p><p>I wanted him gone. I cast a quick look over my shoulder, down the hall, heard the slight thud of the pot hitting the carpet and turned around.</p><p>The kid was right next to me.</p><p>\"Freakishly fast,\" I murmured.</p><p>In a not quite human way.</p><p>\"You're so pretty,\" he whispered.</p><p>His eyes were hypnotic blue, his hair golden curls. Way too young for me, but I didn't care. He was pretty, and he thought I was, too. What more could a girl ask for?</p><p>A soul?</p><p>I took one step back and his arm snaked around my waist. His full, soft lips brushed mine.</p><p>\"Souls are overrated,\" I whispered.</p><p>\"You got that right.\"</p><p>His mouth moved down my neck; his hands moved up my ribs. My knees wobbled. The desire pulsed in my blood with the beat of a thousand ancient drums. I couldn't think straight.</p><p>\"A virgin.\" He lowered his hands to the small of my back and ground us together. \"The best time there is.\"</p><p>His words penetrated the haze. \"How do you know I'm - ?\"</p><p>He pressed his nose to my neck and inhaled. \"You smell all fresh and new. Never touched. You've been waiting for me.\"</p><p>I hadn't been waiting for him. I'dbeen waiting for true love. I knew that.</p><p>Of course I knew I wasn't a slut and look how that was working out.</p><p>\"Virginstaste the best.\"</p><p>He licked my cheek and I didn't mind. Since I was a little Howard Hughes about germs, another reason I was probably still a virgin, that should have disturbed me. I fought against the lustful lethargy and focused on what he was saying instead of what he was doing.</p><p>\"Taste?\"</p><p>\"Sex is food for me, baby.\"</p><p>Baby again. Wish I could find the will to care, or to kick him where it counted.</p><p>\"Only virgins can keep me alive. So, you want it against the wall, on the bed, the table, the counter, the floor? I'm easy.\"</p><p>Actually,I was.</p><p>He fumbled with the zipper of my jeans.</p><p>\"I'll consume you,\" he whispered, \"and no one will ever know.\"</p><p>\"I will.\"</p><p>At the sound of Chavez's voice, the lust I'd been unable to fight, fled. I managed to shove the flower boy away.</p><p>Chavez tossed a vial of burgundy liquid into the young man's face. I flinched, half expecting him to shriek as his skin dissolved. I should have known better.</p><p>\"Sacramental wine?\" Laughing, he shook himself like a dog coming out of a lake. \"You have got to be kidding me.\"</p><p>\"Ave Maria,\"Chavez intoned.\"Gratia plena.\"</p><p>\"Latin.\" The boy shook his head. \"That language is as dead as I am.\"</p><p>\"Our Father, who art in heaven.\"</p><p>\"Way after my time, dude. Nothing will help you. I'm gonna have her. You can watch if you want.\"</p><p>Chavez socked the kid in the mouth. Blood spurted. \"Don't touch her; don't look at her; don't come near her again.\"</p><p>\"She's mine.\" His steadily fattening lip muffled his voice. \"There aren't a lot like her left in this city.\"</p><p>Chavez glanced my way, and the demon took the opportunity to escape.Poof.</p><p>\"Why didn't he disappear as soon as he saw you? Did he want a fat lip?\"</p><p>\"Teleporting is a tricky business. Sometimes they have to recharge before they can do it again.\"</p><p>That made sense, in this weird, new, demony world I was living in.</p><p>\"Why bother with flowers?\" I indicated the pot with a flick of my finger.</p><p>\"You let him in?\"</p><p>\"No. He was just here when I came out of the bedroom. I knew something was weird, but he said the doorman let him in.\"</p><p>\"Probably didn't want you to scream and alert me before he could get into your head.\"</p><p>\"Where have you been?\" My fear made me shout. \"How long does it take to get Christian paraphernalia these days?\"</p><p>\"Not that long. I've been waiting for him to show himself.\"</p><p>\"You used me as bait?\"</p><p>Chavez cast me a quick, wary glance. \"I wouldn't have let him hurt you, Kit. I was right outside.\"</p><p>He didn't deny he was using me. I'd known that, yet it still hurt.</p><p>\"He was just here - like Malcolm. You couldn't have seen him - \"</p><p>\"I did.\"</p><p>Chavez strode to my bookcases and removed a tiny camera from between two books. No wonder he'd been so damn interested in them.</p><p>\"He came out before dark,\" he said, \"which makes him a lot more powerful than I thought.\"</p><p>Silence fell between us, but my mind was full of questions, thoughts, disappointments. When Chavez spoke again, I was glad for the distraction.</p><p>\"He said there weren't very many like you in the city. What did he mean?\"</p><p>I didn't want to tell him, but I had to.</p><p>\"I'm a virgin.\"</p><p>His eyes widened. \"You didn't think that was something you should tell me?\"</p><p>\"That's not something I've ever told anyone.\"</p><p>\"Madre de dios,he'll never stop chasing you.\"</p><p>\"Why?\"</p><p>\"Because these days,chica,there aren't that many virgins to be had.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Spectacular,\" I said. \"Try to save myself formarriage and end up demon bait. The story of my life.\"</p><p>Well, not exactly. My life had never been this exciting.</p><p>Or weird.</p><p>Or terrifying.</p> <p>Lucky me.</p><p>\"You were saving yourself for marriage?\"</p><p>I glanced at Chavez to find him staring at me. I suppose I was an oddity - in this century as well as the last.</p><p>I shrugged. \"Or at least true love.\"</p><p>\"You should have been born in another age,\" he murmured, eerily echoing my thoughts.</p> <p>\"Today I wish I had been.\"</p><p>\"Get your coat,\" he ordered.</p><p>I gaped at the sudden change in subject.</p><p>\"Zip your pants.\"</p><p>I blushed to realize the flower boy had started undressing me, and I had barely noticed. Not only was I scared of the demon; I was starting to be scared of myself.</p><p>I closed my pants with an annoyedsnick.</p> <p>\"Where are we going?\" I asked as we stepped onto the street once more.</p><p>\"To someone who can help us.\"</p><p>\"They couldn't help us before?\"</p><p>\"I only use this source when I have no other choice.\"</p><p>\"Since when don't you have a choice?\"</p><p>\"This demon is more powerful than any I've ever faced. I don't know what to do.\"</p><p>That Chavez, whose life had been devoted to ridding the earth of demons, would admit he had no clue how to kill the one that wanted to kill me frightened me more than anything else ever had.</p><p>I stopped and was nearly run over by the usual suspects - tourists, street people, locals - the throng of Manhattan. Someone cursed and gave me a little shove. There's no place like home.</p> <p>Chavez grabbed my arm and tugged me along. \"I'll take care of you.\"</p><p>\"You keep saying that, yet I'm still not feeling all warm and cozy.\" I ignored the dark, warning glance he slid my way. \"Where are we going?\"</p><p>\"Near the World Trade Center.\"</p><p>I slowed, though I knew better than to stop. \"There is no World Trade Center anymore.\"</p><p>\"That's why my friend is so dangerous.\"</p><p>\"I don't understand.\"</p><p>\"She lost her son there. She's never gotten over it.\"</p><p>Stories like those were far too commonplace. So many people had lost so much.</p><p>\"Has she tried a support group?\" I asked.</p><p>\"She's got her own way of dealing.\"</p><p>\"Which is?\"</p><p>\"She talks to him.\"</p><p>The night shot an icy trickle down my suddenly sweaty shoulders.</p><p>\"Talks to him,\" I repeated dumbly.</p><p>\"Samantha is a psychic.\"</p><p>\"Okay,\" I said.</p><p>Why not?I thought.</p><p>\"The anger and grief changed her.\"</p><p>\"Changed her how?\"</p><p>As we walked in the direction of the water, the Statue of Liberty, Ellis Island, the crowd thinned.</p><p>\"She channeled her pain into power. She wasn't psychic before.\"</p><p>\"Is that why she's dangerous?\"</p><p>\"Sheisn't dangerous, but sometimes what she brings out is.\"</p><p>\"Brings out of where?\"</p><p>\"You'll see.\"</p><p>\"What if I don't want to?\" I muttered.</p><p>Chavez just kept walking.</p><p>I'd only been to the World Trade Center site once - in broad, sunny daylight. The place had been cool, gray, haunted even then.</p><p>At night? I'd rather have a root canal.</p><p>Amazingly, there was no one standing at the fence that encircled the great, big empty. Maybe I wasn't the only one who found that hole in the middle of all the skyscrapers obscene.</p><p>We were searching for a demon? I was of the opinion that several of them had knocked down these buildings one Tuesday morning in September.</p><p>As we approached, I heard a slight whisper. Half believing the dead spoke, I hung back.</p><p>A woman stood at the fence, staring into the crevice and murmuring. Her skirt was long, billowy, and black, her sweater loose and pale gray.</p><p>Had she been there the entire time and I hadn't seen her, or had she just appeared? It didn't matter. She was here now, and I knew without asking that she was the one we'd come to see.</p><p>Her hair flowed to her waist and shone stark white in the faint light of the moon. The air around her seemed to hum.</p><p>Chavez moved forward, leaving me behind. I didn't mind. There was something about her that disturbed me almost as much as that hole.</p><p>\"Samantha,\" he murmured, and the air stilled.</p><p>\"Chavez,\" she said without turning around. \"You have a question for the spirits?\"</p><p>\"Yes.\"</p><p>She faced us, and I couldn't help but stare. Samantha didn't appear a day over forty. She might be well preserved, except for the hair. Premature electric white? Or had a terrible shock caused the change? I'd heard such things could happen but hadn't believed them. Of course I hadn't believed in demons, either, until yesterday.</p><p>\"Who's this?\" she asked.</p><p>\"She's being hunted by a demon.\"</p><p>\"So it's demon hunter to the rescue.\" Samantha's smile was a little bit sad. \"You must be desperate if you've come to me.\"</p><p>\"I don't like to disturb you.\"</p><p>\"The only thing that disturbs me is people who need help but are too afraid to ask for it.\"</p><p>Chavez went silent and her expression softened. \"Never mind. I live only to help, and I've never regretted my sacrifice.\"</p><p>I must have made a small sound, a slight movement, because she tilted herhead and her eerily light blue eyes seemed to look straight at me, then right through me. \"Chavez didn't tell you?\"</p><p>\"What?\"</p><p>\"To see the other side she had to sacrifice her earthly sight,\" he murmured.</p><p>Samantha was blind?</p><p>I lifted a hand and waved. She didn't blink, just continued to stare slightly to the right of my shoulder.</p><p>\"A minor price to pay to see my son again,\" she said.</p><p>\"What else do you see?\" I asked.</p><p>\"Whatever you ask.\"</p><p>I glanced around at the desertedcement slab. \"I can't believe there isn't a line of people waiting to do just that.\"</p><p>\"I see the truth, and the truth is often unpleasant. Some, actually most, would rather not know. After I saw enough horror, word got around, people stopped coming.\"</p><p>\"Maybe if you weren't - \"</p><p>Chavez shot me a glare, and I bit off the comment I had no business making. But that didn't stop Samantha from hearing it, apparently.</p><p>\"Here?\" she asked. \"You think if I spent my days in a park filled with children, a candy store, riding a merry-go-round that then I'd see happiness?\"</p><p>\"You might.\"</p><p>\"Truth is truth, Mara.\"</p><p>I jerked. How did she know my real name?</p><p>Chavez cast me a sideways glance and shrugged. I was starting to see why he only consulted her when he had to. The woman was spooky, and she hadn't even called the spirits yet.</p><p>\"I come to this placebecause of what it is.\" Samantha spread one hand in an all-encompassing gesture.</p><p>\"A graveyard.\"</p><p>The wind - cool and damp - shrieked in off the water. Dirt flew up from below and swirled above our heads.</p><p>\"If you want to call the spirits,\" Samantha continued, \"it's best to go where there are a lot of them.\"</p><p>\"Which must be why all those houses built on Indian burial grounds have so many problems.\"</p><p>\"Exactly. The spirit energy is off the Geiger counters.\" Samantha turned her attention to Chavez. \"What is it you wantto know?\"</p><p>\"I thought the demon that is after Kit was an incubus, but I haven't been able to kill it in any of the usual ways. I discovered the beast is reanimating dead bodies, so I considered Rakshasas, but fire didn't work, either.\"</p><p>\"I see your problem.\" Samantha faced the fence again. \"Ready?\"</p><p>\"Yes.\"</p><p>The wind lifted her hair, fluttered her skirt, but left us untouched. A faint glow began all around her, like a banked flame, though no warmth flowed. When she turned, her eyes were even lighter than before, nearly white.</p><p>\"Are you a godly spirit?\" Chavez asked.</p><p>The voice that slithered from Samantha's mouth was not her own. \"No.\"</p><p>\"That can't be good,\" I murmured.</p><p>Samantha's weird gaze slid in my direction. No longer blind, whatever was inside her saw me and smiled.</p><p>That saying about your blood running cold? It can happen.</p><p>\"No!\" Chavez waved his arms in front of her. \"Deal with me.\"</p><p>\"Chavez.\" The creepy white eyes flickered back to him. \"It's been too long.\"</p><p>The voice brought to mind a snake - somewhat sibilant - but so deep, so sluggish it seemed to be coming from a tape recorder with severely low batteries.</p><p>\"Not long enough,\" Chavez said. \"What have you unleashed this time?\"</p><p>\"Wouldn't you like to know?\"</p><p>\"If I ask, you must tell.\"</p><p>\"The rules. I hate them.\"</p><p>\"What have you done?\" Chavez repeated.</p><p>\"You should be thanking me. If I didn't unleash them, what would you do with your life?\"</p><p>\"Answer,\" Chavez snapped.</p><p>\"I've made something new.\"</p><p>\"New?\" Chavez said. \"Since when can you create new demons?\"</p><p>\"I could always create them. I had to have something to do while I whiled away several thousand millennia. What's changed is that now I can set them free.\"</p><p>\"Why now?\"</p><p>Samantha began to laugh - a deep, wicked sound that would have been comical - like the laughter that spewed from a plastic Halloween skull - if it hadn't been real.</p><p>\"Didn't you get my hint?\" He/she/it swung out Samantha's hands to encompass the gray, silent crater.</p><p>\"The beginning of the end. My time is coming. Mark of the beast. Six-six-six. Four horsemen. Is any of this ringing a bell?\"</p><p>\"End of days,\" I whispered.</p><p>\"Now you're talking,\" Samantha said in a voice that I was starting to believe was Satan's. \"Anyone up for an apocalypse?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm Jewish,\" I said. \"We don't do the apocalypse.\"</p><p>Samantha's body swayed to the side and something very un-Samantha peered back at me.</p><p>\"Armageddon is nondenominational. What falls on one falls on all. Besides, you're not completely Jewish. You don't go to Temple and you eat Gyros.\"</p><p>\"That's lamb.\"</p> <p>\"Damn.\" She smacked herself in the head with the heel of her hand. \"I never could keep those cloven-hoofed animals straight.\"</p><p>\"And you with such nice ones, too.\" I glanced at Chavez. \"Does she always channel the Prince of Darkness?\"</p><p>\"Smart girl,\" said the sonorous voice. \"Too bad she has to die.\"</p><p>\"Enough,\" Chavez snapped. \"I want to know what you've sent and how I kill it.\"</p><p>\"He's Satan, the inventor of lies,\" I said. \"We can't trust him.\"</p> <p>\"When he inhabits Samantha, he has to tell the truth.\"</p><p>\"Fucking Ouija board rules,\" Satan in a Samantha suit muttered.</p><p>I'd never done the Ouija board, being easily freaked out, but I'd heard stories. The spiritswho chose to answer were compelled to tell the truth. However, the truth could be told in many different and confusing ways.</p><p>\"Whatdid you send?\" Chavez ground out from between clenched teeth.</p><p>\"There's no name.\" Samantha's head tilted. \"This demon is very hard to kill. Hard to detect, too. No one cares these days about gratuitous sex. Promiscuous behavior on a first date has become the norm.\"</p><p>She peered at me, and I ordered myself to stare right back. I refused to feel guilty about what I'd done while I'd been under the influence of a demon.</p> <p>\"A few things need to be tweaked,\" Samantha continued. \"I combined an incubus with a Rakshasas, which requires a dead body. But they don't last very long, and all those dead bodies are going to pile up.</p><p>Now, if I could have the demon take the form of a human - \"</p><p>\"Possession drives a human being insane,\" Chavez said.</p><p>\"You should know.\"</p><p>I looked toward Chavez just as he flinched. Then his mouth tightened, as did his fists. I touched his arm.</p><p>Slugging Samantha would do us no good.</p><p>\"But you're right,\" the deep, slithery voice flowed from Samantha's pretty mouth. The longer I saw it, the creepier it became. \"Too many stark, raving crazy people would tip off the white hats, as well. What I need is for the demon to be able to look human, but not actuallybehuman. That would work.\"</p><p>\"Focus.\" Chavez clapped his hands in front of Samantha's face. \"How do I kill the one you already sent?\"</p> <p>Samantha smirked. \"You're going to love this.\"</p><p>\"Somehow I doubt it.\"</p><p>\"The demon feeds on sex with virgins.\"</p><p>\"Been there, know that.\"</p><p>\"In the good old days they sacrificed virgins to appease the beast. Man, I miss those days.\"</p><p>Chavez made a whirling motion with his index finger - Get on with it - but I already knew what was coming.</p><p>\"All right, all right. To save her from a fate worse than death, all you have to do is sacrifice her.\"</p><p>A rumbling began. At first I thought there was a train coming, maybe a tornado, a tour bus. But the sound was coming from Chavez's chest. Pure fury.</p><p>\"Get out,\" he shouted. \"Leave this place.\"</p><p>\"Too late.\" Samantha's eyes rolled back. \"I'm already here.\"</p><p>He caught her as she tumbled, but only a few seconds later she struggled upright. \"I'm okay.\"</p><p>Her voice was her own again. So were her eyes. I was so glad she couldn't see me. I was shaking and no doubt as pale as the pavement. I didn't want to scare her. Then again, she'd been the one speaking with the devil's voice.</p><p>\"What did I do?\" she asked.</p><p>We were both silent and she sighed. \"The devil?\"</p><p>\"Yeah,\" Chavez said.</p><p>\"I hate it when that happens.\" She stuck her tongue out and made a face. \"I can taste the brimstone for days.\"</p><p>\"I'm sorry I had to ask,\" Chavez murmured. \"But I had to.\"</p><p>\"What did I say?\"</p><p>\"Heard any whispers about the end of the world?\"</p><p>\"There are always whispers. Especially since this.\" She jabbed her thumb in the direction of the empty space. \"The spirits have been restless. There's a lot of evil going on, and it seems to be getting worse with every passing day.\"</p><p>Chavez and I exchanged glances. That would follow if there were new and old demons being released at an unknown rate.</p><p>\"He said the apocalypse is coming,\" Chavez murmured.</p><p>\"He's probably right.\"</p><p>Samantha refused to let Chavez and me take her home. \"I have too much to do here. We need to be prepared.\"</p><p>\"You really think the end is near?\" he asked. \"They've been predicting that for centuries.\"</p><p>\"Sooner or later, they've gotta be right.\"</p><p>When she wasn't speaking with Satan's voice, Samantha made a lot of sense.</p><p>\"Could I talk to you privately, Chavez?\" Samantha tilted her head in my direction - though slightly to the left.</p><p>\"Sure,\" I said. \"I'll just be\" - I glanced around the depressing cement walkway - \"over here.\"</p><p>I hadn't gone very far when Samantha began to whisper furiously. Chavez's deep tones answered with equal fervor. I couldn't hear what they were saying, but not for lack of trying.</p><p>\"Hello.\"</p><p>I jumped. Heart thrumming so loudly I could hardly hear, the beat slowed at the sight of the tall, slim, beautiful blond woman near the fence. I must have been too preoccupied with Samantha and Chavez to notice her.</p><p>\"Hi,\" I returned. \"I didn't mean to disturb you.\"</p><p>\"You weren't. It's lonely out here.\"</p><p>\"I'll say.\" This place had given me the willies, even before Satan showed up.</p><p>\"He'll kill you.\"</p><p>I jumped again. \"Wh-what?\"</p><p>She indicated Chavez. \"He's a warrior. He understands that sometimes one must be lost for the good of many.\"</p><p>My eyes narrowed. \"Who are you?\"</p><p>She smiled, and the familiar low, thrumming sexual need began - the need that was brought on by a demon.</p><p>\"I don't do women,\" I said.</p><p>\"You will.\"</p><p>She was probably right. I opened my mouth to shout for Chavez.</p><p>\"He's obsessed. Ever since the unfortunate incident.\"</p><p>My mouth snapped shut. Did I really want to know this?</p><p>Uh-huh.</p><p>\"What incident?\"</p><p>\"Possessed by a demon. Poor baby.\"</p><p>I glanced at Chavez, who was still speaking with Samantha. If he looked my way he'd only see me talking to what appeared to be a harmless woman.</p><p>I remembered what Chavez had said to Satan. \"Possession drives humans insane.\"</p><p>\"Exactly.\"</p><p>\"You're saying he's crazy?\"</p><p>She shrugged. \"Crazy is a relative term.\"</p><p>Not in my book.</p><p>\"What happened?\"</p><p>\"He was possessed. His mother did everything she could think of to drive the demon out.\"</p><p>She licked her lips and gave an \"mmm\" of pleasure. I gritted my teeth against the response that tugged in my belly.</p><p>\"She was quite creative.\"</p><p>My eyes narrowed. \"What the hell does that mean?\"</p><p>\"Have you seen his tattoo? She gave it to him herself when he was fifteen.\"</p><p>I frowned. \"And then?\"</p><p>\"She whipped him, starved him, locked him in the basement. The usual things people do to get rid of the devil.\"</p><p>\"Sounds like the things people do whoare the devil.\"</p><p>\"Ignorance. Fear. They're my master's domain.\"</p><p>\"He had Chavez possessed so his mother would hurt him?\"</p><p>\"That's what he does.\"</p><p>My fingers curled until the nails bit into my palms. The pain eased both the anger and the infuriating sexual arousal. \"How did they get the demon out?\"</p><p>\"Exorcism.\"</p><p>\"Those are still done?\"</p><p>She scowled. \"Every damn day.\"</p><p>I found that hard to believe, but what did I know?</p><p>\"Once Chavez was clean, he became the most feared of all the hunters. He was young, but he was thorough. He'll do anything to defeat one single demon. He hates us.\"</p><p>\"News flash - everyone does.\"</p><p>\"Not you.\"</p><p>\"When you aren't messing with my head I do.\"</p><p>\"Messing with heads is in my job description.\" Her gaze swept over me. \"Among other things. Hewill kill you, you know?\"</p><p>Chavez's face was fierce as he listened to Samantha. He did seem capable of anything. Even murder.</p><p>\"And you won't?\" I asked.</p><p>\"I didn't say that. But you'll die happy. I promise.\"</p><p>I was tempted to run, except where would I go? No matter where I went, if Chavez didn't find me, the demon would. Wouldn't it be better to die easy at the hands of a friend, than horribly at the hands of evil?</p><p>\"Chavez,\" I shouted. \"Bring the salt.\"</p><p>I give him credit; he came running. But she was already gone.</p><p>\"That was a woman,\" he said.</p><p>\"Sex is sex.\"</p><p>\"A comment only made by someone who's never had any.\" He went silent for a second. \"A woman is a succubus.\"</p><p>\"Thanks for the tip.\"</p><p>\"Our demon is supposed to be part incubus.\"</p><p>\"I think this one is a lot of things.\"</p><p>\"True. What did she say?\"</p><p>I hesitated. If Chavez had wanted me to know about his possession, about the abuse at the hands of his mother, about the exorcism, he'd have told me. I wasn't going to bring it up. I also wasn't going to bring up my imminent death. From the look on his face, he was upset enough already.</p><p>\"The usual,\" I lied. \"Sex until I die. Never give up. Yada-yada. The powers of evil need a new tune.\"</p><p>He stared at me for a few seconds, and I managed to stare right back. Amazing what a little Armageddon can do for one's lying skills.</p><p>\"You ready to go?\" he said at last.</p><p>I glanced at the fence, the concrete, the hole. \"Definitely.\"</p><p>Chavez hailed a conveniently trolling cab, then gave the driver my address. Silence fell between us. What did we have to talk about? His method? My funeral? Damnation. Forgiveness. I preferred the quiet.</p><p>The doorman, already accustomed to Chavez's presence, nodded as we got on the elevator.Oh-oh. I didn't want Chavez arrested for my murder. He'd be needed in the coming days to keep the demon horde down to a manageable level, if not thwart the coming Apocalypse.</p><p>I let us into the apartment, moved into the living room as he locked up behind us. Not that locking up had done much good so far.</p><p>\"There's a service entrance,\" I blurted. \"Do you know how to short-circuit the security cameras?\"</p><p>\"What the hell are you talking about?\"</p><p>\"You'll need to get out of the building unseen.\"</p><p>He crossed the room, stopping so close I could feel the heat of him calling out to the sudden chill in me.</p><p>\"You think I'd hurt you?\"</p><p>\"Hurt, no. Kill, yes.\"</p><p>He threw up his hands, then stalked away. \"That damn demon!\"</p><p>\"Redundant, I think.\"</p><p>I surprised a laugh out of him.</p><p>\"I'm not going to kill you, Kit.\"</p><p>\"You have to. I understand. Although...\"</p><p>My voice faded as a thought took hold - an insidious thought, but a very tempting one. I'd changed over the last few days, probably because the whole world had. Or rather the world had always been far different than I realized.</p><p>I'd saved myself for marriage, true love, but I wasn't going to find either one in the next five minutes. Did I really want to die a virgin?</p><p>\"One request,\" I blurted.</p><p>He sighed impatiently. \"Kit, I am not going to - \"</p><p>\"Make love to me.\"</p><p>Chavez stared at me for several seconds, then slowly shook his head. My hopes died.</p><p>He crossed the room and I tensed, knowing this was the end.</p><p>\"Make it quick,\" I said.</p><p>Gently he reached out and slid my glasses from my nose, folding them, before setting them aside.</p><p>\"It will definitely not be quick,querida, \" he murmured.</p><p>Then he kissed me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The single kiss we'd shared had come in thedepths of the night as this did. Then I'd still believed in a world without pure evil. Then I'd believed I had a life ahead of me, that I still had a shot at true love.</p><p>Now I knew better. That knowledge made the kiss no less mind-bending. Maybe the knowledge made it more so. If tonight was my last night, I wanted to spend it like this. With him.</p><p>I opened my mouth, deepened the kiss. He tasted of mint - fresh, cool, new. I licked his teeth and he moaned.</p><p>My fingers managed to pop several buttons of his shirt before fumbling in their haste and becoming unable to finish the job. Instead, I latched on to the lapels and tugged.</p> <p>He stumbled forward, almost knocking me down. \"Lo siento.I - \"</p><p>I kissed him again. \"No talking.\"</p><p>If we talked too much, I might lose my nerve. If we waited too long, he might lose his.</p><p>Grabbing his hand, I practically dragged him to thebedroom. There I yanked my shirt over my head and tossed it into a corner. My bra followed just as fast. His dark gaze wandered over my breasts. I might be short, and I might be dumpy, but my breasts were pretty darn good.</p><p>He kicked the door shut behind us.</p> <p>His shirt hung open, framing his chest. The ripples and curves, all that bronzed skin...I wanted to run my hands everywhere; so I did.</p><p>My thumb skated over the tattoo on his breastbone. Very small; without my glasses I had to get closer to make out the tiny cross inside of a circle. I wondered what it meant, then I wondered if I'd ever have time to ask.</p><p>I leaned forward and ran my tongue over one nipple, then the other. They tightened against my lips so I scored them with my teeth.</p><p>He grabbed my hair and I stilled, ready to fight for the right to taste him. But instead of pulling me away, his palm cupped my head, urging me on.</p><p>I suckled him, the tiny bud of his nipple hard against the roof of my mouth. His free hand smoothed over my back, up my ribs, then settled onto my breast where his thumb teased me into a similar state.</p><p>My knees wobbled, so I let them collapse, sliding my cheek down his stomach, rubbing my mouth against the front of his pants. I'd always wanted to open a guy's zipper with my teeth.</p> <p>It didn't work as well as I'd hoped. My teeth ached; the zipper stuck. Too much pressure from the other side.</p><p>Impatience flared, and he wrenched the thing open, taking himself in his own hand and jerking his palm over the length just once.</p><p>I shoved him out of the way and took him in my mouth. No time to be shy, no time to learn all the nuances. I wanted to experience everything, and I only had one night.</p><p>His palm at my neck, he showed me how it was done, throwing his head back, his hips flexing in an ever-increasing rhythm. When he pulled away, I pulled him back. But he lifted me to my feet and kissed me so roughly our teeth clashed.</p><p>He was hard and hot against my stomach, wet from my mouth. I gave an involuntary shimmy, and the resulting slide made us both groan.</p><p>He tore his lips from mine and pressed our foreheads together. \"Where did you learn this stuff?\"</p><p>\"I'm making it up as I go along.\"</p><p>The soft breath of his laughter brushed my cheek. \"I love a woman with an imagination.\"</p> <p>After inching me backward several steps, he put a hand to the center of my chest and shoved. I tumbled onto the bed. He stared at me with a strange expression - as if he'd never seen me before.</p><p>\"What?\" I asked.</p><p>\"You're so pretty.\"</p><p>I snorted. \"Don't bother, Chavez. I'm a sure thing.\"</p><p>\"Bother?\" His head tilted; his hair swung free of his shoulders and his earring winked in between the dark strands.</p><p>\"I'm not pretty. Never have been. I never will be.Don't care.\"</p><p>Or at least I didn't anymore. What would be the point?</p><p>The realization was freeing. Ididn'tcare about my rounded belly, my wide hips, the stretch marks that resembled a road atlas across my butt. None of that mattered anymore. Only this did.</p><p>Him. Me. Together just once.</p><p>He shucked his pants, then removed mine and joined me on the bed. I lifted my arms. He came into my embrace and brushed his lips across the slope of one breast.</p><p>\"I know where beauty lives,\" he murmured.</p><p>His dark fingers drifted over my skin, gentle and sure as he aroused me. He learned what I liked as I did. His clever mouth wandered; his devilish tongue arrowed in on erogenous zones I'd never heard of, as well as those everyone had.</p><p>His beard had lengthened past the rough stage and become almost soft. The texture both tickled and tormented, another sensation to add to so many. He teased me to oblivion more than once, and then he teased me to the precipice again.</p><p>\"I can't,\" I gasped.</p><p>\"You will.\"</p><p>His body slid up and over me, nearly into me. I opened for him and he stopped.</p><p>\"Ahhh!\" I smacked his back with my fists and he choked on stifled laughter. The sound rumbled all the way to my toes, making me hum everywhere, making me want to laugh, too. To be laughing now was both a wonder and a gift - a downright miracle.</p><p>\"This might hurt a little,\" he said.</p><p>\"What did I tell you about talking?\"</p><p>His smiled deepened, and he kissed me, the way I was starting to crave. Hot, wet, lots of tongue. The man knew what he was doing.</p><p>While I was preoccupied with his talent at tickling my tonsils, he drove forward, burying himself inside.</p><p>It didn't hurt. I felt...full. A tiny bit uncomfortable maybe - I shifted, and something wentping. That hurt a little, but I forgot all about it when the very earth seemed to move. I know that sounds so dumb, but there you go.</p><p>Warm and alive he filled me. His body moved to an ancient rhythm - a rhythm echoed in the beat of my blood. I rocked against him; he rocked against me, and for that moment there were only the two of us.</p><p>His face was fierce, his eyes dark, intense as they stared into mine. I'd always thought sex an act better performed in the dark, but we'd left on all the lights, enjoying every sight, every sound. I couldn't help but reach up and touch his cheek.</p><p>\"Chavez,\" I whispered.</p><p>He slowed, staring down at me with such an intense, searching expression, warmth spread through my chest. Something had changed, but I wasn't sure what.</p><p>\"My name is Zac.\"</p><p>\"Zac,\" I repeated.</p><p>At the sound of his name on my lips, he pulsed inside me, the force of his release inciting my own. The orgasm went on and on - him, me, us - there was nothing and no one else, just the way the world ought to be.</p><p>When it was over, we lay tangled together. He stroked my hip; I played with his hair. I didn't want to let him go, and that was a very dangerous thing to want.</p><p>\"Did the world move?\" I asked.</p><p>\"Oh, yeah.\"</p><p>He lifted his head, kissed the tip of my nose. I got that weird feeling again - the sock in the gut, the warm, gushy swirl. My eyes burned.</p><p>\"What's the matter?\"</p><p>I glanced at the window. Still night, but not for long.</p><p>\"You think we can do it again?\"</p><p>He rolled off me but grabbed my hand as he went, tangling our fingers together, then playing footsie, too.</p><p>\"We can, but not right this second.\"</p><p>I drew one finger over his tattoo. \"What does this mean?\"</p><p>He stiffened. \"You know what a crucifix is.\"</p><p>\"Yes. But the circle?\"</p><p>\"Eternity.\"</p><p>\"Your mother - \"</p><p>I bit off the word, but he already knew.</p><p>\"It told you about my mother?\"</p><p>\"I'm sorry.\"</p><p>\"Don't be. She did her best.\"</p><p>\"Hurting you was her best?\"</p><p>\"She didn't know any better. I was possessed by a demon. What was she supposed to do?\"</p><p>I wasn't sure. What would I do if my son had a bit of Satan inside of him? I hoped I never had to find out.</p><p>He touched the tattoo with his fingernail. \"She gave me the cross. I did the circle myself.\"</p><p>I thought of the pain he must have endured - at his own hands and those of someone he trusted. I wanted to take that pain away, but it was too late, and I didn't know how.</p><p>\"Why did you do it?\" I asked.</p><p>\"So I'd never forget what I'd sworn to do. If it takes eternity, Iwill kill every demon on this earth.\"</p><p>I shivered, knowing that meant he'd kill me, too.</p><p>\"Cold?\" He pulled me closer. \"I'll keep you warm while we sleep.\"</p><p>Oh-oh,said a tiny panicked voice in my head. I was in serious trouble now.</p><p>I'd vowed not to have sex without love, but what was I going to do now that I'd fallen in love because of the sex?</p><p>Not love.No. I was just dazzled by the orgasm. Once he killed me, everything would be different.</p><p>I pulled away. I couldn't sleep in his arms and wake up to a gun, a knife, or whatever he planned to use.</p><p>Getting out of bed, I yanked the sheet along with me and wrapped it around my chest. Chavez didn't even try to cover up, merely stared at me with wary, confused eyes.</p><p>\"When are you going to do it?\" I demanded.</p><p>\"You have to give the equipment a rest, Kit. I'm not seventeen.\"</p><p>\"Not it, it. When are you going to kill me?\"</p><p>His brows drew together; his mouth turned down. He sat up slowly, and I took a step back at the violence in his expression.</p><p>\"What do you think I am? A monster worse than the ones I hunt?\" He climbed off the mattress and began to stalk me around the room. \"You think I'd make love to you, then murder you?\"</p><p>\"You have to, Zac.\"</p><p>\"Don't call me that!\" His voice broke, anguish washed over his face. \"You can't call me by that name and think I'd hurt you.\"</p><p>I let him get too close and he grabbed me, then gave me a good shake. \"I wouldn't kill you. Not for any reason.\"</p><p>\"You won't need to,\" said a strange voice from the door.</p><p>I yelped and spun around. No big shock to find another stranger in my house. This guy was nondescript - not too tall, not too short, average weight, dishwater hair, gray eyes. But there was something strange about him that I couldn't quite put my finger on.</p><p>\"Does a person have to be dead to find some peace around here?\" I muttered.</p><p>Of course being dead didn't seem to mean what it once had. According to Satan, the dead would soon be dating all over the place.</p><p>Chavez shoved me behind him, facing the latest demon wearing nothing but a scowl. \"What do you want?\"</p><p>\"To set the record straight. I guess you didn't tell her.\"</p><p>Chavez's shoulders tensed and I got a bad feeling.</p><p>\"Tell me what?\" I asked quietly.</p><p>Average Joe grinned. \"There's more than one way to sacrifice a virgin.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Iput my hand on Chavez's shoulder and spun himaround. \"You knew that sacrificing the virginity would work as well as sacrificing the virgin.\"</p><p>No wonder he'd been so insistent that he wasn't going to kill me. He'd known he wouldn't have to.</p><p>I'm not sure why the truth hadn't occurred to me before now. Just because I'd been told the sacrifice would be my life didn't make it true, especially since I'd been told that by a demon.</p><p>\"Don't listen to him,\" Chavez said. \"He wants to put a wedge between us. I'm just not sure why.\"</p> <p>I wanted to believe he hadn't known. Really I did. But there was that voice in my head that kept saying, Did you really think he wanted you? Look in the mirror, then look at him.</p><p>But there was another voice that insisted Chavez was different. He knew about the ugliness that lived beneath the beauty. He killed it every day. He'd said he liked women with glasses, women who read. Of course that sounded like a bigger lie than any of the others.</p><p>\"What were you talking to Samantha about all that time?\" I asked.</p><p>Anger flared in his eyes. I couldn't believe Chavez had the balls tobe angry. \"What did you think we were talking about?\"</p><p>\"Where to bury my body?\"</p> <p>\"I told you, I've killed a lot of things, but I don't kill people.\"</p><p>The demon snorted. \"Men. They'll say anything, won't they?\"</p><p>I didn't even glance his way, instead holding Chavez's eyes. \"You should have shot me.\"</p><p>It might have hurt less.</p><p>He winced. \"Just because Samantha suggested that removing the virginity the demon craved might be the answer doesn't mean I don't care about you.\"</p><p>The demon in the doorway began to laugh.</p> <p>\"You shut up!\" Chavez snarled.</p><p>\"Why is he still here?\" I demanded. \"You sacrificed the virgin. Shouldn't he be demon dust?\"</p><p>\"That isn't a demon.\"</p><p>I switched my attention to the now giggling stranger, and I realized what was different. I didn't want to jump him. I only wanted to slug him - and every other guy in the room. The sexual obsession was gone.</p><p>You'd think I'd be happier about it.</p><p>\"What is it?\" I asked.</p><p>\"Beelzebub.\"</p><p>I glanced at Chavez. \"Again?\"</p> <p>\"He seems to like me.\"</p><p>For a minute I sympathized. Imagine spending half your life chasing evil, killing it, and enjoying periodic visits from Satan whenever things got really rough.</p><p>Not much of a life, but that still didn't excuse him.</p><p>Chavez had betrayed me in the worst possible way a man could betray a woman. He'd pretended to want me, but he'd only been using me. Not for sex, but to save my life and the lives of others. I still wasn't going to thank him.</p><p>\"So the earth moved for you, Kit?\" Satan asked.</p><p>I could feel the blood drain from my face. He'd beenwatching ?</p><p>I glanced at Chavez, who appeared as horrified as I was.</p><p>\"I hate to be the one to break it to you, Chavez, but that wasn't a result of your prowess. The demon was dying.\"</p><p>Chavez ignored him, reaching for me. I stumbled back. I didn't want him touching me. Not now or ever again.</p><p>Pain flickered in his eyes, turning quickly to fury when the devil snickered. Chavez spun toward him.</p><p>\"You did this. You sent the demon; you made it so I'd have to hurt her in one way or another.\"</p><p>\"What's your point?\" Satan asked.</p><p>Cursing, Chavez snatched his pants from the floor and withdrew a vial of holy water. The devil rolled his eyes. \"That isn't going to kill me.\"</p><p>Chavez tossed the contents into Satan's face. Steam, the scent of cooking flesh, the hiss of flames, for an instant I saw the monster behind the mask.</p><p>\"I know it won'tkill you,\" Chavez murmured. \"But it sure does sting.\"</p><p>The devil writhed for several seconds. I was hoping he'd begin to cry, \"I'm melting!\" then do so.</p><p>Instead, he straightened and lowered his hands from his face. I tensed, expecting something ugly, but he appeared exactly the same.</p><p>\"Quit being childish,\" he snapped. \"I came to offer you a deal.\"</p><p>\"A deal with the devil? Hmm, let me think.\" Chavez tapped his fingernail against his chin. \"No.\"</p><p>\"Don't be so hasty. The end is here. Demons are pouring out of hell even as we speak. You're the only chance the human race has got.\"</p><p>\"Why me?\" he asked.</p><p>\"As you said - I like you. Always have. When I was inside you for that brief time, I felt at home.\"</p><p>\"Fuck you,\" Chavez snarled. \"I cast you out. And you aren't getting back in.\"</p><p>He yanked a cigarette from his pants and hurriedly lit the end. His hand shook, causing the devil to smirk and me to take a single step closer. I might want to stick a sharp implement repeatedly into Chavez's eye, but I wasn't going to let Satan hurt him.</p><p>\"What is he talking about?\" I asked. \"I thought you were possessed by a demon.\"</p><p>\"He's the father of all demons. In every one lies a little of him.\"</p><p>\"You're more like me than you want to believe,\" Satan whispered. \"That's why you're so good at killing us. You can smell evil a mile away, can't you?\"</p><p>Chavez took a deep drag and blew the smoke in the other man's face. Instead of coughing, the devil inhaled it like ambrosia.</p><p>\"That's what I thought,\" he murmured. \"Here's the deal, if you can kill everything I've released before the end of the world, I'll call off the apocalypse. It'll be like a video game, except real.\"</p><p>\"Since when is he in charge of the apocalypse?\" I asked.</p><p>Neither one of them answered.</p><p>\"When's the end of the world?\" Chavez took another drag.</p><p>\"That's for me to know and you to find out.\"</p><p>Now who was being childish?</p><p>\"What happens if I lose?\"</p><p>\"You know.\"</p><p>The devil began to laugh again, then he disappeared.</p><p>I stared at the place where he'd been for several seconds before I lifted my gaze to Chavez. \"What happens?\"</p><p>\"He gets my soul.\"</p><p>Ask a stupid question... Chavez began to gather his clothes.</p><p>\"You're going?\"</p><p>\"You heard him. I don't have much time.\"</p><p>\"Or maybe you have plenty. No one knows when the end of days actually is. And what if he just decides to finish things when there's only one demon left to down?\"</p><p>\"It doesn't work like that.\"</p><p>\"Howdoes it work?\"</p><p>\"Thereis an end of time, except no one's been able to figure out the exact date. There are a lot of theories.\"</p><p>\"The apocalypse is a Christian belief, and not all Christians believe it.\"</p><p>\"Not believing it doesn't make it any less real.\"</p><p>\"Sixty-seven percent of the world isn't Christian,\" I pointed out.</p><p>\"Where do you get all this information?\" Chavez asked.</p><p>\"I like trivia.\"</p><p>\"I like smart women.\"</p><p>I narrowed my eyes and he went on.</p><p>\"Satan does come out of the Christian legends, but remember...all religions believe in good and evil. Just because he isn't called Satan doesn't make him any less the leader of the underworld. You saw him.</p><p>He's real.\"</p><p>\"Which makes the apocalypse real?\"</p><p>\"Even if he's lying, it won't hurt to kill all the demons. It's win-win.\"</p><p>\"Unless you lose.\"</p><p>\"Someone's got to do it.\"</p><p>Quickly he dressed, then it was time to say good-bye. I didn't want to.</p><p>What I'd felt for Chavez had been genuine even if what he'd pretended had been...pretend.</p><p>\"You must have found my last request\" - I sighed and turned away - \"hysterical.\"</p><p>\"I found it flattering.\" He inched in front of me. \"And arousing.\"</p><p>\"As well as convenient.\"</p><p>\"Kit - \"</p><p>\"You were going to seduce me.\" I shrugged. \"You didn't have to.\"</p><p>He took a breath as if to speak, and I lifted my hand to stop him. I'd had an epiphany. They didn't happen often, but when they did I listened.</p><p>\"It doesn't matter if you knew or you didn't. You saved my life.\"</p><p>My anger had faded. Chavez did what he had to do for the greater good. I didn't like what he'd done to me - That was a lie. I'd liked it a lot.</p><p>I couldn't throw stones. I'd slept with him when I thought he planned to kill me. The ultimate one-night stand. I'd sworn to hold out for true love - then at the first sign of an apocalypse I'd thrown away my vow for a good time.</p><p>That I'd discovered I loved him later did not excuse me in the least.</p><p>I couldn't stay angry with him when he'd only done what I asked - and what was absolutely necessary.</p><p>\"Do your job,\" I said. \"Save the world.\"</p><p>His gaze softened. My stomach flip-flopped. I couldn't believe I was giving him up, but then I didn't have much choice, either.</p><p>\"I knew you were special from the beginning,\" he murmured. \"Can I have a kiss good-bye?\"</p><p>\"You can have two.\"</p><p>The kiss and the one that followed were everything I'd ever dreamed of in a farewell embrace - the heat of lust, the gentleness in caring. My eyes stung, and I fought not to let the tears fall. He had to go, and I had to let him.</p><p>Chavez lifted his head. \"If the world wasn't about to end - \"</p><p>I put my fingers over his lips. \"But it is.\"</p><p>\"Yeah.\" He stepped back; I clung just a little. \"If the worlddoesn't end... \"Give me a call.\"</p><p>He never would. A guy like him, a girl like me - heat of the moment and all that. As soon as I was out of sight, I'd be out of mind. But it sounded good - as if I didn't care, as if I weren't dying inside.</p><p>\"Hasta luego, chica.\"</p><p>The tears were blinding me. I wiped them away, but he was already gone.</p><p>Thesnick of my apartment door closing echoed in the suddenly silent room. I was alone again.</p><p>Just me and my big fat boring life. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>My life didn't get any better. Without Chavez init - there was nothing worth getting up for.</p><p>I'd never liked my job. Now I loathed it. What good was trying to sell books to people who were only promoted for paying far less than what they were worth? What good was any job when the world was about to end?</p><p>I drifted, waiting for something to happen, but I wasn't sure what.</p><p>Three months later, I was still waiting. I fell asleep late one night while reading a manuscript. Just another Saturday and I didn't have anybody.</p> <p>Because I didn't want anybody but him.</p><p>I dreamed of Chavez all the time, and in my dreams he was with me. His touch gentle, his eyes full of love. Definitely a fantasy, but all I had.</p><p>\"Kit. Wake up.\"</p><p>His voice sounded so close. His fingers were so warm as he removed my glasses. I fought against sleep and opened my eyes.</p><p>\"Hey,chica. \"</p> <p>I closed them again, squeezed tight, and tried once more. He was blurry, but he was here.</p><p>I struggled upright, and manuscript pages spilled from my lap, cascading onto the floor. I let them go. \"Is the world saved?\"</p><p>Chavez shook his head. He appeared tired, drained, defeated. Not the man who'd left on a quest only three months ago.</p><p>\"Why did you come?\"</p><p>He hesitated. \"I - I need you.\"</p><p>\"Okay.\" I tangled my fingers with his and started for the bedroom. I'd take whatever I could get.</p> <p>\"No!\" He snatched his hand away. \"That's not what I meant.\"</p><p>\"What did you mean?\"</p><p>\"I - I've seen some terrible things. The world is a mess, Kit.\"</p><p>\"I've noticed.\"</p><p>\"Through everything, I remembered you. You're what kept me going.\"</p><p>I wanted to believe him, but I wanted to be sure, and I wanted him to be, too.</p><p>\"We had one night, Chavez. Manufactured intimacy in exchange for the death of evil - or at least one little piece of it.\"</p><p>\"We had sex.\"</p> <p>\"I know.\"</p><p>\"For me, it was more.\"</p><p>My eyes widened; my breath caught. I couldn't speak. He didn't seem to have that problem.</p><p>\"I was crazy for you from the first moment I saw you, but I couldn't touch you. I had to - \"</p><p>\"Protect me.\" I smiled, and some of his tension eased. \"You did. I'm safe now because of you and I'm grateful.\"</p><p>\"I don't want you to be grateful,\" he growled.</p><p>\"What do you want me to be?\"</p><p>He glanced away and muttered, \"Mine.\"</p><p>\"Huh?\"</p><p>He took a deep breath and looked back. \"I want you to be mine. I want to have someone, somewhere, who's waiting for me. I'm sick of being alone and lonely. The only time I felt as if I belonged anywhere was when I was here with you.\"</p><p>\"What are you saying?\"</p><p>\"I love you. I can't live without you. I hope you feel the same way.\"</p><p>I hesitated and his shoulders sagged. \"I know a girl like you and a guy like me - you probably forgot about me the instant I walked out that door.\"</p><p>I let a small laugh escape. \"You're kind of unforgettable.\"</p><p>Hope lit his eyes. I didn't want that hope to die.</p><p>\"I love you, too, Zac.\"</p><p>He smiled at my use of his name. For him, the gift of his name went deeper than the gift of his body.</p><p>\"My life without you isn't much of a life. I hate it here when being here means I'm not with you. I want to help you save the world.\"</p><p>Chavez shook his head so hard his hair flew and his earring caught the lamplight and flashed bright sparks into my eyes. \"I won't let you risk yourself.\"</p><p>\"But you can risk yourself?\"</p><p>\"I hunt demons. That's what I do. It's all I've ever done.\"</p><p>\"Seems to me that the last demon took both of us to kill. Without me, you'd still be flailing around with your salt and your holy water and your sacramental wine.\"</p><p>His brow lifted. \"Don't forget the silver bullets.\"</p><p>\"How could I when they worked so well?\"</p><p>His smile turned shy. \"I was thinking - love has always been stronger than anything.\"</p><p>\"I agree.\"</p><p>\"Maybe it wasn't so much the sex that killed that demon as the love.\"</p><p>\"You could be right.\"</p><p>\"So the more love we make - \"</p><p>\"You don't need an excuse, Zac.\"</p><p>\"Then...?\"</p><p>\"Together we fight; together we win or we don't.\"</p><p>\"You can't fight,\" Chavez scoffed.</p><p>\"I meant in a 'pen is mightier than the sword' kind of way.\"</p><p>\"Research,\" he said.</p><p>I reached under the coffee table and pulled out a stack of papers that I'd written. \"Without you here, I've had a lot of time on my hands.\"</p><p>I offered them to him and his eyes wandered slowly over all that I'd learned, then lifted to mine. The excitement was back.</p><p>\"This is great, Kit.\"</p><p>\"I told you I was good at trivia.\"</p><p>\"This isn't trivial.\" His hands clenched on the papers. \"This is world-saving.\"</p><p>My face heated at the praise and I ducked my head. He inched in close, put a finger to my chin, and lifted.</p><p>\"It'll be dangerous,\" he said.</p><p>\"You'll protect me.\"</p><p>\"I will.\"</p><p>His words were a promise, one that he kept.</p><p>Did the world end?</p><p>Not yet. </p> </body></html>"]