["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Stopping by the roadside diner to get out of the cold, wet weather had seemed like a good idea at the time. It was only in retrospect that Jax thought it might have been one of the worst decisions of his entire life.</p><p>They were still some forty miles east of New Orleans, dog-tired and almost out of money. Mason trudged along beside him without complaint, but Jax needed to stop soon and let him rest. He needed to maybe get some food in him too.</p><p>After the trucker they’d hitched a ride with in Birmingham the day before left them on the side of the road outside of Bay St. Louis, he’d found a door left open on a bathroom at a closed roadside gas station and spent the night on the floor, with Mason’s head on his lap. All Jax knew for sure, or at least according to the trucker, was that if they kept going on this road, they’d wind up eventually in New Orleans, a little over fifty-five miles away. If they could make it there, Jax was hoping they could do what the trucker told him, find one of the huge service stations that catered to long-distance truckers and hang around long enough to catch a ride farther west.</p> <p>Jax had never been to the western part of the United States. He’d never been much of anywhere outside of Piedmont, Alabama, the small town where he was born and raised. He didn’t know anybody out west either, but he’d decided on it as a kind of general destination that last, desperate night before they left. He and Mason had shaken the dust of the little town off their feet,and Jax hoped he’d never have to see it again. Jax would have left Alabama years ago if it hadn’t been for his little brother.</p><p>Staying in Alabama obviously wasn’t an option, and they had no other close relatives to speak of. Mason said he’d always kind of wanted to see some real cowboys, and it might be nice to see some of the places Jax had only read about or seen on TV, like the Grand Canyon. Maybe he could get a job someplace out there or even a couple of jobs and get Mason back in school. If any of the towns he traveled through looked promising, he could find them a cheap room to rent after a while. Anyway, heading west was a place to go, and he needed some kind of plan to keep from going crazy. It was scary enough to be on his own with no money and an eight-year-old brother who had to be fed and cared for. Throw in no place to hide, and the terror he felt threatened to choke the breath out of him.</p><p>This morning they were both pretty hungry, but Jax wanted to try to wait until suppertime to eat anything and save his money. He needed to find something for Mason, though. The last time he’d checked, he had seventeen dollars left, plus some change in his pocket, not nearly enough to splurge on a bigbreakfast. But when he’d seen the diner on the side of the road, he thought it wouldn’t hurt to go inside, use the rest room and maybe get Mason a butter and jelly biscuit and a glass of milk—maybe a cup of hot coffee for himself. At least it would give them a chance to rest for a while and warm up.</p><p>It was only October, but even in the south, rainy days in the fall could be cold and miserable. Jax found them a booth near a window in the back and waited while a nice older lady took their order. All around them, people were eating biscuits, gravy, eggs and sausage. Mason never said a word, but Jax saw his eyes stray toward a big plate of pancakes the waitress carried by, and for the hundredth time Jax wondered if he was doing the right thing.</p><p>The smells made his own mouth water, but he stuck to his guns and ordered only a biscuit and a glass of milk for Mason and coffee for himself. Coffee really wasn’t his favorite drink, but it was hot, and he loaded it up with cream and sugar. On the table next to the sugar packets was a little basket with crackers. When Jax figured nobody was looking, he ate a couple packs of those and took as many as he dared to stuff down in his pockets, along with the little packs of jelly sitting in their little metal container. He couldn’t help noticing that someone had left the waitress a five-dollar tip and stuck it up under the basket. The whole time he sat there, watching Mason wolf down the biscuit, his eyes kept straying back to the cash.</p> <p>It was when he was on his third cup of coffee, and the waitress was beginning to look at them funny, that he heard the sound of motorcycles pulling into the parking lot outside the small cafe. A few minutes later a group of about fifteen people came in, most of them wearing the same kind of black leather jacket. On the backs of the jackets was a name—Sons of Darkness, and a picture of a vicious, snarling wolf. Jax allowed himself a little smirk at the name.</p><p>The ones with the jackets were big, tough-looking guys, all of them seeming to be somewhere in their twenties or thirties. There were maybe three girls and a couple of young guys too, not wearing the jackets, but who had been riding on the backs of the motorcycles.</p><p>The man who seemed to be their leader came in first and swaggered over to a table in the middle of the dining room to sit down. He was tall and muscular, like the rest, with shaggy black hair partially covered by a blue bandana. When he came in the door, he was pivoting his head like he was looking for someone, and then his eyes lighted on Jax with a surprised expression, almost like he recognized him, though Jax was sure he’d never seen the guy before in his life— he would definitely have remembered someone like him. The thing that made Jax most uneasy was how the surprise on the man’s face quickly turned to distaste, almost anger.</p><p>The guy was joined at his table by two of the others, while the rest spread out wherever they could crowd around a table or a booth, and the man shifted his laser-like gaze away from Jax. None of the bikers were doing anything in particular, not causing any trouble, but the room seemed smaller with all of them in it, and a thick tension hung over the café like a pall of smoke. It wasn’t long before the other patrons felt it too, finished their meals and got up to leave.</p><p>Jax continued to sit there, fiddling with his coffee cup, knowing they needed to leave, but dreading going back out in the rain. Mason had begun to doze in the warm air of the café. Jax wished for the hundredth time he’d grabbed a warmer jacket for himself and Mason the night they’d left. He’d been in such a panic he hadn’t been thinking straight. He thought longingly of the heavier jackets hanging in their closets at home. As it was, both of them had only the clothes on their backs.</p><p>Feeling uneasy, he glanced back up and saw an intense gaze directed at him. The big biker guy was staring a fucking hole in him, and it was making him really nervous. The last thing he needed to do was attract the attention of some kind of motorcycle gang. The guy probably didn’t like the way Jax looked, with his piercings, eyeliner and shaggy hair. When he’d washed his hands in the café bathroom, he noticed the dark smudges his eyeliner had left under his eyes, and had tried to wash it off his face. Had he missed some spots? Jax knew his appearance was probably a red flag to a tough guy like that. Then again, what the hell did he care what some jerk he’d never seen before and would never see again thought about him?</p> <p>Growing up small and different-looking, not to mention gay, in a small southern town full of good old boys hadn’t been any picnic. Jax had stopped growing at five foot six, and his body was whipcord lean, but it wasn’t only his size. He normally wore something similar to what he currently had on, black skinny jeans with boots that laced up almost to his knees, with a tiny, stacked heel. They were his favorite boots, and he’d bought them for himself at Walmart three years before.</p><p>He was wearing a black hoodie with an alternative band logo on the back, one of his favorites, and he even had piercings in his eyebrows and one in his nose. Overall, his style was not exactly the norm for Piedmont, Alabama. He used to try to fit in when he was younger, wearing camo jackets and ballcaps, but it never really worked. The last couple of years, he’d given up the ugly, tacky clothes his peers wore and embraced his differences, wearing the clothes that better suited his personality. He’d decided anybody who didn’t like the way he looked could just go fuck themselves.</p><p>Anyway, he knew from the interested glances he was getting from a few of the bikers that his style had been noticed and no doubt frowned upon. They weren’t giving him dirty looks exactly, but more speculative, interested. Jax hunched over his coffee and tried to ignore their narrow,appraising glances. The last thing he wanted to do right now was attract anybody’s interest. Tucking his floppy blond hair behind his ear, he chewed on his bottom lip nervously. The intense glare the biker dude with the bandana was still giving him made him uneasy and though it was still coming down hard outside, Jax thought maybe he and Mason had better take off. Draining his coffee, he looked longingly at the five-dollar bill.</p><p>Jax wasn’t a thief, but the temptation to take the money was almost overpowering. He had to take care of Mason, and he was almost frantic with worry. He was full of other feelings too, that he’d pushed way down deep where he didn’t have to look at them too hard. He needed to move though, so he buried them a little deeper to take out and look at later on when he wasn’t so tired and scared. Right at this moment he had to do whatever it took to survive. He didn’t mind going hungry himself, but he didn’t want Mason to suffer if he could help it. He bargained with himself, thinking maybe he could borrow the money, and then when he got his job out west he could put five dollars in an envelope and send it back here to the café with a little note apologizing.</p><p>As soon as the waitress had her back turned to him, taking an order at one of the bikers’ tables, he slipped the five-dollar bill out from under the basket and into his pocket. Then he quickly got up, motioned to Mason to follow him and started to make his way to the door. It was as he was passing the big biker guy’s table that it happened. A strong hand stopped his progress by grabbing onto his wrist and holding him there.</p><p>“What the hell? Let me go,” Jax cried o ut, pulling frantically away from the big hand that gripped him. Beside him, Mason grabbed his other arm, his face alarmed. The man held on to Jax seemingly without much effort at all, and glared up at him. The waitress, who had been taking their order, looked nervous and cast a glance over at the cashier in case they needed to call somebody for help.</p><p>“What is it, Jax? What’s the matter?” Mason asked beside him, his little face full of fear. Jax was trembling, but he glared back at the guy, refusing to le t him see he was scared. “I said, let me go, damn you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, I don’t believe I willlet you go,” he said, and tightened his grip. “At least not until you give this nice lady back her tip you took off that table back there.”</p><p>Jax felt his face flaming as the waitress, along with pretty much everybody else in the room looked at him like he was something somebody would need to scrape off the bottom of their shoe. Mason stepped closer to him in solidarity, and pulled again on his other arm.</p><p>“What’s the matter? Cat got your tongue?” the man teased. “Here, let me help you out.” He reached into Jax’s jacket pocket and pulled out not only the five-dollar bill, but the load of crackers and jelly packets he’d stuffed in there as well. “Well, what do we have here? You really are a little squirrel, aren’t you?”</p> <p>Jax tried again to wrench away from the man’s hand, but his grip felt like an iron band around his wrist.</p><p>“What else you got, little man?” he said, and moved his hand down to search Jax’s jeans pocket. It was as he was doing this, leaning toward him, that Jax brought his other fist around and punched the older man on the side of his head as hard as he could. The man fell back with a bark of surprise, and Jax turned, jerked Mason by the hand and sprinted toward the door. In despair, he saw two of the guys nearest the door jump to their feet to head them off, but a sharp command behind them made the men stand aside so he and Mason could scramble outside.</p><p>The miserably cold drizzle had turned into a hard, steady rain, and the puddles in the parking lot were like an obstacle course they had to splash through to reach the relative safety of the road. The little pools of water sucked at Jax’s boots as he ran, clutching at him and trying to hold him back. Mason was keeping up, but barely, clinging tightly to Jax’s hand. Mason stumbled once and went to his knees, but Jax yanked him to his feet, and they kept running, out of the parking lot and onto the highway.</p><p>Stumbling alongside the roadside, Jax kept looking over his shoulder. He ran until his breath was coming in sharp gasps and his legs felt like rubber. He hadn’t eaten anything since the morning before, and it was making him a little weak. Mason was running a few steps ahead of him, and seemed not to be having quite as much trouble as Jax.</p><p>It took Jax another minute to realize the steady rumbling he heard behind him wasn’t coming only from the storm. The roar had started out like a distant thunder but was growing louder and louder. Casting a wild glance behind him, he saw at least four or five of the bikers coming after them, spread out in a V formation like a flock of predatory birds, and panic dropped over him like a smothering shroud. Yelling at Mason, he grabbed for his arm and turned off the road. They clawed their way into the underbrush, jumped over a drainage ditch and headed for the pine trees lining the road on either side. He could hear Mason gasping for breath beside him and knew he was terrified.</p> <p>Jax heard the motorcycles stop on the road behind him, but kept running blindly ahead through the trees, pulling Mason with him. Crashing through the underbrush behind them, the bikers came after them and my God, how could they be so incredibly fast, so relentless? Small pine tree branches hit him in the face as Jax pushed through them, trying to shield Mason from the worst of it, stumbling on the soggy ground. A noise ahead of him made him freeze in place and peer wildly through the trees.</p><p>Somehow two of them had circled around in front of him and Mason. Quick, fierce, and muscular, the mendidn’t try to catch them as they careened to a stop, just kept edging closer, their faces wary, as if he and Mason were wild animals they were trying not to panic. Clutching Mason to his chest, frantically panting for breath, Jax slowly backed away, his head pivoting in either direction, looking for a way out, but thick pines and cedars blocked the escape routes on each side of them, hemming them in. The big men in front of him advanced toward him steadily, their arms out to the sides, like they were herding them, and it was only when he backed into the big, solid body behind him that he realized why. Jax wasn’t able to stop the hoarse scream that tore from his throat as he flailed his arms and tried to fight like a wild thing, terrified and hopeless, knowing he didn’t have a chance against them all.</p><p>“Calm down, damn it, you’ll hurt yourself,” the deep voice said in his ear, as iron-like arms closed around his waist, but he didn’t, couldn’t listen. Pushing Mason to the side, he tried to fight the big biker, struggling in his arms, even trying to throw his slight body to the ground to escape. It was useless, of course, and the man picked him up bodily and held him against his chest, while he kicked out with his legs and slammed his forehead against a steely chest.</p><p>Worn out and hungry as he was, it didn’t take long to exhaust himself, and when he could no longer fight,he sagged hopelessly in the man’s arms. Lowering Jax to the ground, the big man loomed over him, still holding him with an unrelenting grip. Jax twisted his head away and screamed to Mason over and over to run, unable to hear whatever it was the biker kept repeating to him in a slow, steady voice.</p><p>Suddenly, the forest fell away and he was in his old room at home, hot breath at his mouth, a heavy body holding him down, crushing his chest and making it hard to breathe. “No, please, please,stop,” he murmured and a sob caught in his throat. Jax looked straight up into a pair of startled brown eyes and moaned. “Don’t do it again.”</p><p>Jax was breathing so hard and in such a panic that he began to hyperventilate and little sparkly stars started to flash on and off at the backs of his eyes. Jax crumpled with an odd, choked sound as he lost consciousness.</p> <p>Cade D’Alisande stared down at the slight figure on the bed of the motel room and crossed his arms over his chest. The boy was still sound asleep, though his breathing had evened out some. He was small and thin, but Cade noticed the lean musculature of his chest and abs when he’d stripped the soaking wet clothes off him earlier. Still, he could have almost counted the ribs on either side, and he cursed again under his breath. He’d also noticed the healed-over cigarette burns on his hips and thighs, not to mention the long welts on his back and buttocks. They were old scars, but ugly and shocking. The boy had been badly abused over a long period of time.</p><p>Cade had been totally startled by the kid when he first stepped inside the door of the café, and the scent hit him so strongly he thought he might stagger. He’d known his blood match was inside—he’d sensed it deep inside himself. It was the reason he’d doubled back instead of passing the little roadside café and going on into New Orleans. He’d turned around and brought his pack back here instead, his wolf leaping inside him as he pulled into the lot. The second he stepped in the door, he traced the scent to the boys sitting in a booth near the back, their wet hair plastered to their heads. The older boy’s beautiful blue eyes gazed up at him through a fringe of thick lashes. The second Cade got the full blast from those eyes, he knew that was where the scent was coming from—this beautiful child with the eyes of a frightened angel. It damn near terrified him.</p><p>No, he wasn’t a c hild, but surely only a boy, too young for him to have these lustful images tumbling around in his head, too young to be so desirable, so fucking sexy it made his balls ache to look at him. Badly shaken and disgusted with himself for feeling such lust for a young boy, Cade sat down at a table and kept glancing at the kid, trying to calm down, while every instinct he had urged him to go over to the booth where he was sitting, bend him over the table and fuck him into it.</p><p>Goddamn blood match. It made beasts of all of them, and he would resist this. The longer he sat there, though, the more he became convinced this was something more than just the blood match, as if that wasn’t bad enough. He was beginning to be very afraid that this was the soif de sang, or the bloodlust, and if it was, then God help them both.</p><p>Cade saw other members of his pack noticing the beautiful boy, and it filled him with unreasoning anger. How dare they look at what was his? He would have to make it clear to all of them that the boy was off-limits.</p><p>The waitress came over to take their order, and he was distracted for a moment, but when he looked back up, the boy was getting up to leave, slipping a bill of some kind out from under the basket of condiments on the table. He knew it had to be the waitress’ tip, and he was actually glad, because it gave him an excuse to stop him on his way out.</p><p>When he’d first touched the startled boy, the bloodlust, the soif de sang, slammed into him so hard that his vision actually dimmed and his heart started racing out of control. He saw everything though a reddish haze. He’d heard the myths about the effects of the bloodlust all his life, but he didn’t even really believe in its existence. His grandparents claimed to have had it, but Cade had thought it was only the stories of half-crazed old people—they were ancient by the time he met them, and didn’t even speak much most of the time.</p><p>It was only once at a family gathering that he heard his grandfather speak of it, and he and his grandmother passed away only weeks later. At the time, Cade thought it was highly unusual for them both to go at the exact same time, but they were so old and frail. He’d thought that once his grandmother passed, his grandfather’s heart just hadn’t been able to take the strain. He never connected it to the soif de sang until he heard people whispering about it at the joint funeral. He was beginning now to think that none of the stories had even done the bloodlust justice.</p> <p>He could sense the surprise of his beta, Rayce, and his brother, Connor, when he grabbed the boy’s wrist, but had no doubt that they and the rest of his pack would back his play, whatever he decided to do. He knew he was scaring the other child who was with his boy, but he couldn’t make himself stop.</p><p>This close, the first thing Cade noticed about the boy was that he might be a bit older than he’d first thought, with piercings in his eyebrows and a tiny one on the side of his nose, yet still he knew he was heartbreakingly young. He had a scattering of freckles across his nose that Cade found endearing, and he’d loosened his hold on him just a little.</p><p>When the boy showed spunk by hitting him and bounding for the door, dragging the smaller child with him, Cade had been almost relieved. He could breathe again, now the boy was gone, without that damn scent clogging his nose and backing up into his brain. He made sure the men nearest the door didn’t touch the boys as they made their escape, and the second the door closed behind them, Cade was able to think clearly again. His vision slowly went back to normal, and he turned around to face the others at his table. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Connor and Rayce were both looking at him with startled concern. “What are you doing, Cade?” Connor asked. “The waitress was about two seconds away from calling the cops.”</p><p>Cade shrugged and took a big sip of the ice water in front of him. He shook his head and ran a big hand over his face. He tried to speak and realized he was already in a partial shift, his mouth suddenly full of extra teeth, and his voice a guttural growl. “Damn it, it was that boy. Fucking bloodlust.”</p><p>Rayce and Connor both looked astounded and Connor fell back in his chair. Cade concentrated on forcing his beast back down. “A soif de sang?” Connor was saying. “That kid? Are you sure?”</p> <p>“Pretty sure. Ah hell, yeah, I’m positive. I could sense him as we rode past this place. I’ve never heard of anybody being able to do that before with a blood match, no matter how strong it was. That’s why I turned to come back here. God, it’s so strong. His scent hit me when I walked in the door, and when I touched him I thought I wouldn’t be able to control it. It scared the shit out of me.”</p><p>“But Cade, mon frère, if he’s your mate, your bloodlust, why are you letting him get away?” Rayce asked anxiously. “If you lose track of him...”</p><p>Cade blew out short breath and took another sip of water. “Did you seehim? He’s just a fucking young kid. How can I... no, I have to let it go. I have to figure out a way to resist it.”</p><p>Rayceraised his eyebrows. “Resist it? You can’t resist it—it would kill you. You’d know this too, if you were thinking straight.” He shook his head restlessly, and stood up. “No, we have to go after him.”</p><p>“And then what? Kidnap him? Think about it, Rayce, he couldn’t be more than sixteen years old,” Cade said bitterly.</p> <p>Connor stood up too, holding out a hand to Cade. “Come on, we have no choice. You know this. We’ll figure something out, but we have to find him first. He’s getting away.” Cade shook his head and picked up his cup. “He’s on foot—hewon’t get too far.” Rayce tilted his head at him. “Unless he gets a ride.”</p><p>Slamming the glass back down on the table, Cade felt a jolt of sheer panic. “Fuck, I never thought of that.” He jumped to his feet and raced toward the door. He was aware that both Connor and Rayce followed him to the bikes, along with one or two of the gammas nearest the door, while Rayce called to most of the others to stay put until they got back.</p><p>As soon as they got on the road, Cade could see the boys up ahead. They were on them in a matter of only minutes, but still too long to ease the almost crushing anxiety that had lodged in Cade’s chest at the idea he might lose track of his mate. When the boy saw them coming up behind him, heyanked at the smaller boy’s arm and fled off the road, up toward a bank of trees a few yards away. Yelling to his men to be careful and not frighten him any more than they already had, Cade followed him, his speed much greater than the boys’. Though the two were running fast, dodging around trees and underbrush and obviously scared to death, the older men were able to surround them quickly, and Cade pulled the boy into his arms.</p><p>The poor kid was so frightened he fought like a mad thing while Cade concentrated on subduing him while not hurting him, not an easy thing to do. The other child had tried to run, and Cade was vaguely aware of Rayce catching hold of him and speaking to him in a soothing voice. Cade had his boy on the ground, telling him over and over he wouldn’t harm him, while the boy screamed at the other child to run and finally became so overwrought he passed out. Cade was surprised at the flood of protectiveness that washed over him, though in this case, the one person the kid was most scared of was him.</p><p>The rain was slamming down on them, really pounding down hard by this time, so Cade picked the boy up and carried him quickly back to his bike, where Rayce was already pulling out rain gear and wrapping it around the other child. Cade called out and reassured the crying child that the boy he carried was all right, but he felt like a monster for scaring him so badly. He pulled out his rain gear and draped it over the boy in his arms. The members of Cade’s pack weren’t bothered much by the rain, no matter how hard it was, but the humans who traveled with them needed to be protected, so all of the pack carried the gear on their bikes.</p><p>Cade had noticed a little motel next to the café, so they drove toward it, and Rayce went inside to secure some rooms. Cade took both the boys to one of the rooms that was ready, and told the others to head back for their breakfast, while he decided what was to be done. Cade knew Rayce would smooth over any apprehension as well. The little scene with the boys at the café had gone against his strict rule not to bring any undue attention to the pack, but he hadn’t been thinking straight once he’d seen his little mate. Connor insisted on staying with Cade, and was sitting at a table in the room, talking calmly with the younger child. Connor had bought the child a soft drink and turned on some cartoons for him, and other than a few worried glances over at the boy on the bed, the child seemed to be settling down.</p> <p>When Cade got the boy, whose name the younger boy said was Jax, inside the room, he’d stripped off the wet clothing, wrapped him in some blankets, and turned up the heat. The child, who said his name was Mason, was soaked too, so Connor wrapped a thick blanket around him. He took off the child’s shoes, but neither Cade nor Connor felt comfortable asking him to take off his wet clothes. They would wait until Jax woke up.</p><p>The boy on the bed, however, belonged to him, so Cade stripped him down. No doubt he’d be upset and alarmed when he woke up, but he couldn’t risk him getting sick. He was still out like a light, so Cade hung up his clothes to dry on a chair by the low-slung heater, and went through his meager belongings, while Mason watched TV. The boys had no backpack or suitcase of any kind, nothing but the clothes they were wearing. Along with a few dollars and a business card from a probation officer, Jax’s billfold contained an Alabama driver’s license that proclaimed him to be Jackson Cody Monroe, aged nineteen—the age was a huge surprise and relief. He certainly didn’t look nineteen, but the child confirmed it.</p><p>Cade didn’t want to alarm the younger child by questioning him too closely, but when Connor asked him if they lived nearby, the child shook his head and looked evasive. He told them Jax was his brother, but that was about it.</p><p>He knew Rayce would make discreet inquiries at the café, so settled back to wait for Jackson to wake up. In the meantime, he studied his face.</p><p>Jax was beautiful, no other word for him. He had full, lush lips and high cheekbones. His face was almost delicate, but saved from looking feminine by a strong jaw with a hint of dimple in his chin. Cade already knew his eyes were a dark, striking blue that had glittered at him like colored glass when he’d held onto his wrist.</p><p>He was small, even for a human, not much larger than a female, though there was nothing feminine about what he’d seen when he stripped off his wet jeans and underwear. The sight of his pretty, thick cock, coupled with the strong scent radiating off him in the motel room had almost made Cade lose control again. He had to go stand in the open door and breathe in the fresh air for a few minutes to calm himself.</p><p>With a little moan, Jax twisted and turned in bed, coming more awake, and Cade moved to sit near him, in case he tried to bolt outside again. Mason saw it too, and jumped up to go sit beside his brother on the bed and hold tightly to his hand. Even though he was prepared for it, the icy glare Jackson fixed on Cade when he quite suddenly opened his eyes hit him hard. The boy was surprisingly calm after the scene in the woods and didn’t make any move to get up. He just pulled Mason up closer on the bed beside him and stared hard at Cade, pressing his lips together.</p><p>“Don’t be scared, Jax. No one’s going to hurt you. I promise.”</p> <p>The boy’s gaze swept the room before coming to rest on Cade. His voice came out low and hoarse. “W-where are we? What are you going to do to us?”</p><p>“You’re in a motel room,” he jumped up to catch his wrists and push him back down when the boy tried to leap out of bed at those words. Cade held onto Jax as he spoke in a firm voice to him. “Calm down. It was just to get you both out of the rain. You were soaking wet, and you fainted. I told you, no one is going to hurt either of you.”</p><p>Jackson frowned, his face furious. “I didn’t faint. I never faintedin my life,” he said. “You must have knocked me out, you or those gorillas you had with you.” He struggled against Cade’s grip on his wrists. “Let me go, I tell you. I’ll kill you when I get up.”</p><p>“Well, as terrifying as that sounds, you’re not going anywhere, so relax or I’ll have to tie you to the bed.” He squeezed his wrists a little. “Stop it. I mean it, Jackson.”</p><p>“My name is Jax, and I’m not scared of you.”</p><p>“Mmm-hmm. Well, good. I don’t want you to be scared, which is what I believe I just said.”</p><p>Jax settled down, and Cade released him. Immediately, he scooted back up to the headboard, pulling Mason along with him.</p><p>Cade stood over him for a long moment, looking down at him. “Concentrate, please, and answer my questions. Is this ID real? Are you reallynineteen years old?”</p><p>“What? Yes, of course it’s real, and what do you mean am I really nineteen? That’s what it says, doesn’t it? What’s it to you anyway? Just cause I’m not some big overgrown asshole doesn’t mean I can’t take care of myself.”</p><p>“Yeah, you seem to be doing a fine job of it so far, stealing tips and crackers to get something to eat, running out in the rain and fainting from hunger.”</p><p>“I did not faint. I just took those crackers because I...because I was...”</p><p>“Planning on having a really big salad later? Bullshit, boy, don’t lie to me. You had seventeen bucks in your wallet, and you didn’t want to spend it on unnecessary things like, oh, I don’t know, food for example.” Cade could hear himself being snarky and sarcastic, and he honestly didn’t know where it was coming from. Something about this situation was just bringing it out in him. Feeling trapped and like his back was against the wall, he nevertheless took a deep breath and reminded himself how frightened the boy must be. He needed to cool it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jax puffed out his pretty lips in a pout, and it was all Cade could do not to lean over and taste them. The sudden compulsion actually horrified him, and he backed up a couple of steps. Jax still sat against the headboard, holding his brother close to him, but when he realized he was naked under the blankets, his face turned an interesting shade of red, and he glared over at Cade.</p><p>“Where are my clothes?”</p><p>“I took them off you to dry them. Your brother is still wearing wet clothing, so it might be a good idea to tell him to go to the bathroom and take them off. He can wrap himself up in blankets. I’d hate for him to get sick.”</p> <p>“Don’t worry about it—I’ll take care of my little brother. What kind of sick pervert are you that you want to get him out of his clothes?”</p><p>Cade blew out a frustrated breath. “Oh, for God’s sake. We don’t molest children. I was only concerned about his welfare. You’re the one who’s dragging the child around in the pouring rain. You say you can take care of him, so do it.”</p><p>“Yeah, well, that’s none of your business, is it?”</p><p>“Do you really think his clothes would be any protection to him if either of us wanted to hurt him? He’s got to be uncomfortable. He can wrap himself in blankets and I promise you nobody will touch him.”</p><p>Jax seemed to think it over for a few minutes and then finally whispered something in Mason’s ear. Mason got off the bed and took the blanket Connor was holding out to him and went into the bathroom.</p> <p>“I won’t let you fuck me,” Jax said tightly as soon as Mason closed the door behind him, startling Cade.</p><p>“Nobody wants to fuck you,” Cade said, though that was exactly what his wolf wanted to do, so he took another step backward to put more distance between them. “But you need to start telling me the truth or I’ll turn your little ass over my knee and spank you so hard you won’t sit for a week.”</p><p>Jax flushed, and his mouth fell open in complete surprise. A strange look passed over his face, but was gone so quickly Cade couldn’t get a fix on it. Damn it, he’d just promised himself he would take it easy on the kid.</p><p>Jax glared up at him furiously and puffed out his chest. “You touch me and I’ll make you sorry. What is it? What do you want to know?” He narrowed his eyes suddenly. “Are you some kind of cop? She got the five bucksback. That’s all I took, I swear to God.”</p><p>“Are you a runaway?”</p><p>“I’m nineteen years old, asshole. I’m not running away from anything or anyone. I can go wherever I please.”</p> <p>“Okay, good to know. You can go anywhere you like—so long as your probation officer says you can. And what about the kid?” Cade replied softly, jerking his head toward the bathroom. “Are you telling me you have custody of that boy?” He pulled from his pocket the business card he’d found in Jax’s wallet. “Maybe this guy will have some information on you. I can call him and find out.”</p><p>“N-no. Please. Tthat’s an old card. And what gives you the right to go through my things anyway? Damn it, why are you doing this, you asshole? What difference does it make to you who we are?”</p><p>“Stop lying to me.” Cade blew out a long breath took a step toward Jax, who glared back at him defiantly.“And stop cussing at me.”</p><p>“Okay, okay! I’ll tell you. But if you hit me, I’ll hit you back,” he said, drawing back his fist.</p><p>Cade recoiled, and looked at him with surprise. “I have no intention of hitting you. But tell me why you’re on probation and tell me the truth, or I might spank your ass.”</p><p>Jax’s mouth fell open in surprise. He sputtered a few times but must not have liked the look he saw in Cade’s eyes, becausehe held up a hand in a placating gesture. “Okay, okay. I-I beat up one of my relatives, and he pressed charges. Since I was over eighteen, and I didn’t have any money to post bond, they put me in jail for a few days, and I got out on probation. That’s the truth, I swear.”</p><p>“Why did you beat him up?”</p><p>“It was just a family misunderstanding. I have kind of a bad temper.”</p> <p>“No shit. And the boy?”</p><p>“He’s my little brother. I’m like his guardian now.”</p><p>Cade raised one eyebrow. “You’re like his guardian. Seriously? You expect me to believe that?”</p><p>“I don’t give a shit what you believe. None of it’s any of your goddamned business.”</p><p>Cade took another quick step toward him, sat down on the side of the bed and hauled Jax over his lap in one smooth motion. He pulled down the sheet and let his hand fall twice sharply, watching with satisfaction as his hand print made a pink mark on each of the perfect white globes of his boy’s ass.</p><p>“No!” Jax yelled. “Stop—stop, please, I’m sorry.”</p><p>Two more blows fell, not enough to really hurt, but enough to sting. Jax squirmed violently on his lap and to his surprise, Cade felt a very hard rod pressing against his thighs. So his boy liked being spanked. Shit, I’m so fucked.</p><p>Cade’s hand moved over his ass, massaging it gently, working away the sting, wanting badly to put him back down on the bed and bury his cock between those newly pink cheeks. Deciding this was a very bad idea, he put him back on the bed and stood up, turning away from him.</p><p>“Okay, then. Don’t evercuss me again. And I’ll decide what’s my business.”</p><p>“O-okay. I’m sorry. Just...please let us go.”</p><p>Mason came out of the bathroom, looking with alarm over at Jax, who held out a hand to him.</p><p>“Are you okay, Jax? I heard you yelling.”</p><p>Jax ruffled his hair and pulled a pillow over his erection that was tenting out the sheet. “I’m fine, Mace. We’re just talking, that’s all.”</p><p>Connor stepped over to the bed and held out his hand. “Mason, why don’t you come back over and watch cartoons so my brother can talk to your brother, okay?”</p><p>Mason looked at Jax, who nodded, and he walked over to Connor, who steered him back to the table.</p><p>“Let us go,” Jax said in a low tone. “I’ll leave town right away—I promise.”</p><p>“And go where? What are you doing in Mississippi, anyway, if you’re from Alabama?”</p><p>“W-we hitchhiked out this way. We’re going out west, or that’s the plan, anyway.”</p><p>“Where out west? Who do you know there?”</p><p>Jax shrugged. “Nobody really, and we don’t have any firm plans. Just wherever I can find a job. I’m...uh...looking for work.”</p><p>Cade looked skeptically at Jax. He’d been relieved when Jax pulled the pillow over to cover his groin. He’d been keeping his eyes from straying to that bulge by sheer willpower.</p><p>“What are you going to do to us?” Jax asked again, his eyes flashing.</p><p>Before Cade could answer, the door opened to admit Rayce, who was carrying several takeout boxes and balancing a drink carrier on top of them.</p><p>Rayce looked around the room curiously, and Jax shrank back even farther against the headboard, pulling the pillow up to hug it to him. Favoring Jax with a charming, reassuring little smile, Raycebrought the cartons over to the bedside table. “I brought you all a little petit dejeuner,” he said. “Oh, and I managed to get enough rooms for all of us for tonight, so you can figure all this out. They didn’t know anything at the diner except that they’ve never seen either of them around here before.”</p><p>Jax watched them both with wary eyes and glanced longingly at the door.</p><p>“Good,” Cade said, nodding. “Thanks, man.” Then he glanced back over at Jax. “Don’t even think about it. You move one inch off that bed, and I’ll finish what I started with that spanking.”</p><p>Jax gave him a resentful, furious glare, but stayed where he was. Cade nodded approvingly and reached for one of the takeout containers, handing it to Jax. Inside there was scrambled eggs, crispy bacon and creamy grits with a blob of butter swimming on top. A fat, flaky biscuit sat on top of the bacon. The smell wafting up off the food made Jax close his eyes and tremble, but he still looked first toward Mason to see if he got one too. Mason was already eating.</p><p>“Well, go ahead and eat,” Cade said sternly, a little moved by Jax’s reaction to the food and trying not to show it. “Don’t let it get cold.”</p><p>Jax opened his eyes wide and then tore into the food, just cramming it in his mouth and not waiting to open the little pack that held a plastic fork and knife. Cade and Rayce watched in startled fascination until Cade put out a hand to grab Jax’s wrist.</p><p>“Slow down, damn it. Nobody’s going to take it away from you, but you’ll make yourself sick eating like that.” He made Jax look up at him and nod before he took his hand away and watched him make a real effort to slow down.“That’s right. Slower, and damn it, use the fork. You can’t eat those eggs and grits with your fingers, oryou’ll burn yourself.”</p><p>Cade opened the packet for him and cleaned off his fingers with the napkin before putting the fork in his hand. “Slow down, or I’ll feed you myself.”</p><p>That got Jax going slower, and finally, Cade jerked his head at Rayce, and they went over to stand by the door. He spoke to him quietly in French. “His full name is Jackson CodyMonroe.”</p><p>Jax glanced up at the sound of his name, but Cade ignored him.</p><p>“He’s from Piedmont, Alabama, according to his license, and he’s nineteen years old.” At the look of disbelief on Rayce’s face, he shook his head. “I know, I know, he looks too young, but that’s what’s on his driver’s license, and it seems to be authentic. We’ll need to check it out to make sure. He’s running away from something, I think, but since he just got out of jail back home, he has to be over seventeen, or they’d have put him in a Youth Detention Center. Says he beat up a relative who pressed charges, and now he’s on probation.”</p><p>Rayce raised one eyebrow. “Really?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>They both glanced over at the slight figure on the bed and Cade sighed. “Yeah, I can’t see him beating up anybody as little as he is either, but that’s what he said. Assuming he’s telling the truth, I don’t think anybody will be looking for him, except maybe his probation officer. He’s been abused in the past, and still has the scars to prove it, but they’re healed over. Could be what he and his little brother are running from. That bothers me too. Where arethe child’s parents? We need to check it out.”</p><p>Rayce nodded. “What are you going to do?”</p><p>“Fuck if I know. I don’t want this, and I don’t want a boy who looks like he’s fifteen years old. He’s not my type at all, damn it. And he’s too fucking young.”</p><p>Rayce watched him sympathetically, and nodded. “I know, mon ami, but not much you can do about that, is there?I meant, what are you going to do about taking them with us? You’re attracted to the boy, no?And he’s your mate—you can’t leave him behind.”</p> <p>Cade grimaced and glanced back over at Jax. He’d finished his breakfast and was trying to follow their conversation, though Cade was pretty sure he didn’t understand a word. When he saw Cade staring at him, he tossed his hair out of his eyes and picked nervously at the sheet covering his chest.</p><p>“Of course, I’m fucking attracted to him, damn it! I can barely keep my hands off him. I know it’s the soif de sang. But I don’t want to be so attracted. I don’t want to feel like this. I want to just rewind this whole damn thing back to this morning. I wish I’d never passed by that stupid diner.”</p><p>“What should I tell the others?” Rayce asked quietly.</p><p>“Tell them...tell them nothing until I can find out more. Maybe it’s some kind of mistake. Maybe I’ll wake up in the morning and be back to normal.”</p><p>“It doesn’t work that way, Cade,and you know it. You’ll have to mate with him soon or the bloodlust will overpower you. You could shift without warning and hurt him badly.”</p> <p>Cade turned an incredulous face toward Rayce. “I would never hurt him, but he’s scared to death of me. Look at him.”</p><p>Both men gazed at the boy on the bed until he glared belligerently back at them. “What?” Jax said hotly. “Don’t get any ideas, and give me back my damn clothes. They’re bound to be dry enough by now.”</p><p>Ignoring him, Cade turned back to Rayce, shaking his head. “Despite the charming personality, he seems exhausted. I think he’s running on pure adrenaline now. I want him to rest a few hours. We’ll leave for Georgia this afternoon.”</p><p>Rayce nodded and shrugged. “Wherever you say, Cade.” Cade glanced back over at Jax, who was still eavesdropping on them shamelessly, his brow wrinkled as he tried to figure out what they were saying.</p><p>“He’s going to fight me every step of the way. You realize that,don’t you?” Cade said miserably.</p><p>Rayce nodded and smiled. “I’ll stay with Connor and Paul and give you some privacy to deal with him. It’ll do us all good to have a little rest.”</p> <p>“Yeah, and maybe give this rain a chance to clear out. Oh, and send out Paul or somebody for more clothes for both of them. Jeans, shirts, underwear. Two of everything for now and another pair of boots, for God’s sake. ” He gestured contemptuously toward the ones he’d pulled off Jax when he got him to the room. They were made of cheap vinyl and had a little stacked heel. Cade strongly suspected they were girls’ boots. “Heavier jackets too,” he said, gesturing contemptuously at the offending garments hanging on the chairs to dry.</p><p>Cade pulled out a piece ofpaper from his pocket. “I’ve written down Jax’s sizes here. I got them off his old clothes. You should be able to guess pretty close on the kid. He’s about eight or nine years old, I’d say. Do we have any extra helmets?”</p><p>Rayce shook his head. “I’ll add that to the list.”</p><p>“First quality. Nothing cheap, and none of that punk shit Jax was wearing. Tell everyone to eat at the diner for lunch or better yet, order pizzas. We don’t need to attract any more attention than we have already. I think they’ll both sleep now that their stomachs are full. The little one is almost out on his feet already.” He gazed at Jax speculatively. “To be on the safe side, see if Sean’s mate has any of those pills left that the dentist gave her in Atlanta. They’ll make Jax sleep.”</p><p>Rayce glanced back toward the bed with a smile. “I don’t think they’ll be necessary. Looks like your little ones are already asleep.”</p><p>Sure enough, as they’d been talking Mason had drifted back over to the bed with Jax and was curled up next to him. Jax had fallen sound asleep beside him, sitting up, his head lolling back on the headboard, his mouth wide open, with the takeout box still in his lap. Cade blew out an exasperated breath and shook his head, walking to the bed to stand over him. He didn’t want to have this damn tender feeling for the boy. He didn’t want to feel like he needed to take him in his arms and hold him as he slept. He leaned over to take the box away and pull Jax down so he wouldn’t get a crick in his neck. He never awoke once as Cade moved him, just curled up on his side next to Mason with a sigh.</p><p>“What am I going to do with you?” Cade asked softly, staring down at the boy. His wolf leaped inside him, full of suggestions, but he forced it back down. Even though his wolf strongly approved of the boy, Jax wasn’t his choice, would never have been his choice, and Cade felt stunned and angry—and trapped. He knew it wasn’t the boy’s fault, but he couldn’t help the resentment bubbling up inside him.</p><p>Of all the times for the bloodlust to rear its ugly head, this had to be the worst. Cade was moving his small pack to the north Georgia mountains to join his cousin Zack. Zack was one of the alphas of the Dark Hollow Wolf Pack, a huge alliance of packs that included northern Georgia, parts of Tennessee, and all of western North Carolina.</p> <p>Zack’s father, Cade’s uncle, had left Louisiana many years before when he’d lost the challenge for leadership of their pack. When the old alpha died, his two sons, Cade’s father and his uncle, had to fight for leadership of the pack. Since a pack could only have one alpha, the brothers knew they would eventually have to face each other in the ancestral ring or else go out and start a new pack. The wolves loved their pack land, and all the wolves had close emotional attachments to it, so starting up a new pack was not only difficult, but almost unthinkable. They knew even before they fought that no matter what happened, one of them would have to leave. Unable to accept the domination of another alpha, yet lacking a following, young alphas were often left literally homeless until they either left the area to find a new pack or assimilated back into their old pack at a lesser ranking. Wolves were never happy alone—it was almost a foreign concept to them.</p><p>When the time came, the brothers had faced each other in the ring and Cade’s father had won. Humiliated and heartbroken, his brother left the pack, eventually winding up with their distant relatives in North Carolina. In time, he’d built his own lodge in the nearby north Georgia mountains, forming an alliance with the Dark Hollow Wolf Pack. When he was killed by Hunters a few years before, his son, Zack, had assumed leadership of his pack and the alpha role.</p><p>It wasn’t the greatest solution to go to Zack for help—two alphas in the same location was never a good idea—but it was the only one he could come up with on such short notice. They’d left Louisianain a hurry, because he wouldn’t fight his own father for leadership of the pack. The fact that he knew he would win just made it even more imperative that he leave. His father loved leading the pack, and it would have crushed him to be defeated.</p><p>Every time a young alpha reached full maturity, he was required by their law and their ancient traditions to challenge the leader’s authority. Once Cade knew his father would never withstand his challenge, the only course he felt he had open to him was to leave the pack and strike off on his own, just like his uncle had done years before.</p><p>When he’d told the others he was taking off, his brother Connor insisted on coming with him, and when they pulled out, his best friend, Rayce, along with twelve others, some of them mating pairs, joined them. It looked like Cade had formed his own pack, whether he’d intended to or not.</p><p>Cade had plenty of money, almost his entire wages from the years he’d spent in the Army, including the money in the trust fund left by his grandparents, but he had no clear idea of what he should do next. When he called to talk to his cousin, Zack said there was plenty of pack land that he could build on, both in north Georgia and in North Carolina. It already belonged to the packs, and as family, he’d be welcome to it.</p><p>Cade had actually planned to take his time getting to Georgia and maybe see some of the countryside, raise a little hell before he had to settle down and be responsible. It had been a while since he’d been able to be on the road with the bikes, and he was restless. He and Rayce bought their bikes when they were still in their teens, and other young men in the pack had followed their lead until they formed a small group that liked to ride together every chance they got. Rayce had come up with the name Sons of Darkness, along with the logo of the wolf, mostly as a joke.</p><p>Cade was having fun before all this started, working and playing hard and enjoying his life. He’d been nowhere near ready to settle down. Now, saddled not only with a pack to look after, but an unwanted young mate, everything was different. Now he had others to care for, and one person in particular. The boy was not even someone he’d normally be even remotely interested in.</p><p>Although he’d been with men before, his preference really was for girls like the ones he’d been with back home in Louisiana. He liked girls who had a little meat on their bones, with big breasts and full,curvy asses, girls who’d been around, who knew the score and never asked him to give them more than he was capable of giving them. The few men he’d been with had been others in his father’s pack, big, tough, brawny guys who could take a pounding and still come back for more. When he got an urge to be with a man, he wanted a real man, and not some femme kid. If he had to have a bloodlust with a man, then he would have wanted someone more like that. They could have formed an alpha pair that would be damn near invincible against their enemies. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade was an alpha, and certain things came with the territory. He liked to dominate and be in control. In other words, he liked it rough, and he needed a partner who could take whatever he dished out, not some delicate little blond kid who probably weighed a buck twenty-five, and wore girly boots and had facial piercings. A boy whose hair curled around his pretty face like a doll’s, and whose eyes were such a dark, bottomless blue a person could fall into their depths and not be able to find his way out again.</p><p>Cade had never been with anyone who ever made him feel anything deeply. No one who really made his heart beat faster or made him feel he couldn’t breathe without them. He thought maybe he wasn’t cut out to feel love like that, and he believed it too, right up to the moment he walked into that damn café.</p><p>He smoothed the hair off Jax’s face and frowned down at the piercings. Those were coming off soon. They wouldn’t stay anyway after they mated. Once he gave Jax the mating bite, anything like the scars and the holes in his body would heal over immediately, leaving smooth, unblemished skin. His body would become strong and even more beautiful. He gazed down at the boy and the thought sprang again to his mind. Even more beautiful? How in the hell will I be able toresist you then? I’m so fucked.</p> <p>Chapter Two</p><p>Jax woke up slowly, stretching his arms above his head. It took him a moment to come fully awake and realize where he was. Mason was sleeping beside him on the bed, curled up in a little ball. Jax sat up quickly then and looked around. What the hell was happening? Where was the biker dude, and just who the hell were these people anyway? Did they mean them any harm? He had to admit nothing really bad had happened up to this point, other than the fact they’d taken his clothes and the big guy had swatted his ass like he was a little kid or something. He was still frightened, though, because it was all too weird. He wanted only to get away.</p><p>Jax had no idea what some motorcycle gang wanted with them, but he figured it couldn’t be for anything good. The room seemed to be empty at the moment, and their clothes were still spread out over some chairs by the heater. He listened for someone in the bathroom, but everything was quiet. If he was lucky, he could get them both out of there before anyone came back to check on them. He wondered briefly why the biker dude hadn’t left a guard on them, but didn’t stop to question his good fortune. They had to move and move quickly.</p><p>Shaking Mason awake, he held a finger to his lips, cautioning him to be quiet, and eased from the bed. He grabbed his damp clothes from where they were drying, pulling them on quickly as he watched Mason dress too. His boots were still soaked through, but he pulled them on anyway and laced them up. Moving stealthily, Jax eased to the door and looked through the peephole to see if anyone was standing outside.</p><p>The motel was one of the older kinds still seen on the side of the road in the south, just onestory rooms strung out along the highway like beads on a string and connected by a long sidewalk in front. Seeing no one right in front of the door, he took a chance and eased open the door, peeking around the corners. Nothing and no one was evident on either side of him. He motioned for Mason to follow him. The rain had slacked up a lot, and there were some breaks in the clouds. Jax thought it might be late afternoon.</p> <p>A couple of doors down, an older man was putting his suitcase in the trunk and coming around to get in his car. On an impulse, Jax ran over to him, making sure Mason followed.</p><p>“Mister, could you help us, please? We were hitchhiking and this guy picked us up and brought us here, but now we’re really scared, and need to leave. He went to the store, but he’ll be back soon. Please?”</p><p>The man looked startled and looked around him. “Should I call the police? Are you boys all right?’</p><p>“No, no police—he hasn’t hurt us or anything, but we just need to go. Can you give us a ride? Just to the nearest truck stop? Maybe we can get a ride from there.”</p><p>“Well, I-Iguess I could give you a ride into New Orleans, if that will help you out. I’m on my way to a family wedding there, but where are your parents? Are you sure I shouldn’t just call the police?”</p><p>“Oh no, that’s fine. I’m over eighteen, really. I’m taking care of my little brother while our parents are out of town. If you could just give us a ride, that would be awesome,” Jax opened the car door, slipped inside and settled himself on the front seat before the guy could change his mind. Mason scrambled to get in the back seat, and the man got in beside him, started the engine and pulled out, way too slowly for Jax’s peace of mind. Just in case someone came out of one of the rooms unexpectedly and spotted him leaving, he bent over, pretending to fiddle with the laces on his boots until they’d cleared the motel parking lot. Sitting up then, he glanced back over his shoulder, terrified he would see Cade or one of the others coming after them. The road stayed empty behind them though, and soon the traffic picked up around them as they made their way into Memphis. He’d made it—he’d left the big, handsome biker behind. So why did he feel like he’d done something wrong?</p> <p>“How old are you boys, son?” the man asked him, a worried frown creasing his face, and Jax turned around and gave him his most winning smile.</p><p>“Oh, I’m twenty-one, sir, just small for my age. My little brother and I are going out to Texas to visit my sister while our folks are out of town.”</p><p>The man nodded. “Texas is a long way. Are you sure your parents know you’re doing this? You’d be better off on the bus.”</p><p>“We don’t have the money for the bus, but ...we were thinking maybe you could let us off at one of those big truck stops? Maybe we could find a trucker who would give us a ride.”</p><p>“I can do that, I guess. But you still have to be careful. Are you sure you’re over eighteen? You look mighty young for that. You wouldn’t be running away from home now, would you? The two of you?”</p><p>“Oh, no sir. I swear. I’m just going to visit my sister. She’s fixin’ to have a baby, and we’re going to help her out, that’s all.”</p><p>The man gave him a suspicious sidelongglance, but didn’t say anything more about their journey for a long time. Jax chatted inanely about the weather and the scenery and any other damn thing he could think of to keep the man from asking any more questions. They were traveling along old Highway 90, which used to be a beautiful, scenic route to New Orleans from Bay St. Louis, according to their driver. But that was before Hurricane Katrina. Katrina had taken out the bridge in Bay St. Louis, though it had been mostly restored. The highway now ran alongside Interstate 10. The interstate went to Baton Rouge, but U.S. 90 took a more leisurely southern turn, passing through New Iberia, Franklin, Morgan City, and the Houma-Thibodaux area before reaching New Orleans. After almost an hour of driving, Jax spotted a truck stop on the highway ahead, and almost bounced in his seat in excitement. Maybe he could find a trucker there who would take them farther west.</p><p>“Right there, sir. We’ll just get off at that big truck stop over there, if it’s okay.”</p> <p>Pulling off into the parking lot of the station, the older man stopped the car and let them out. Jax thanked him, but before they could get out, the man reached in his pocket and pulled out a twenty. “Here, son. It’s not much, but maybe it will buy you two a meal. I hate to leave you on the side of the road like this—I just don’t feel right about it.”</p><p>Jax took the money gratefully, his eyes actually growing a little misty. He wasn’t used to people giving much of a damn about them, and it always surprised him when people were randomly nice to him.He sometimes forgot that nice people who didn’t want anything from you still existed in the world.</p><p>Except for that biker, of course—he’d seemed to be concerned about them too, and he was actually nice enough—other than that stupid spanking thing. But Jax figured he had something else in mind, though he still couldn’t figure o ut exactly what.</p><p>“Thank you, mister. And we’ll be fine, really. This will help us a lot.” He slipped from the car, held the door open for Mason, and gave the man a little wave before turning back to the station behind them. Jax heard him pull off behind them and was surprised at how alone he felt all of a sudden. Squaring his shoulders, he put an arm around Mason and they turned toward the station.</p><p>The parking lot was busy and huge. The side lot was taken up by diesel pumps with a few big trucks parked in front of them, while the front lot functioned like a regular service station for other vehicles.</p><p>Jax and Mason went inside, finding a big convenience store, as well as a restaurant. This type of station catered to long-distance truckers and tempted them to not only fill up, but stay for a meal or even a chance to clean up in the big bathrooms.</p><p>Still hungry, Jax decided to treat himself and Mason to a small burger and a glass of water each in the restaurant. Steering Mason to an empty booth, they sat down and gave the waitress their order. She gave Mason a few crayons and a placemat to color, so while Mason carefully colored a picture of cartoon characters, Jax sat quietly fiddling with his silverware and tried to figure out their next move.</p><p>That big biker dude had kept his wallet, so not only had he lost his money, but now he had no ID and no social security card, damn it. Jax knew they must have discovered him missing by now, and he smiled to think how pissed off the big guy would be. He was surprised to feel a little pang when he thought about him. Clearly, he was the best-looking man Jax had ever seen, but there was something else about him Jax couldn’t quite put his finger on. Even though he knew he should have been scared to wake up in a motel room alone with a tough biker dude, he hadn’t been afraid of him, notreally. Instinctively, he’d known the man wouldn’t harm them.</p><p>Still, Cade asked too many questions, and it was weird the intense way he looked at Jax. Almost like he wanted him, but it made him mad and pissed off that he did. Crazy the way he made Jax feel safe too, like he was looking after him. It should have been the exact opposite, with him running Jax and Mason down on the side of the road and practically kidnapping them, but it was true. The man made him feel like he would stand between Jax and Mason and the rest of the world, even if it pissed him off to have to do so. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jax shook himself. No, he was better off getting them the hell out of that motel room. He could take care of himself and Mason—other people couldn’t be trusted. The waitress brought his burger and he wolfed it down, eating every bite and licking his fingers. He felt someone’s gaze on him and looked up to see the amused gaze of a man in the next booth. He looked to be in his fifties and had gray, slightly greasy hair. He wore casual, dirty looking clothes, but his smile was friendly, and he nodded at Jax when he caught Jax looking at him.</p><p>“You boys must have been pretty hungry.” He looked around the restaurant and back into the adjoining convenience store. “Maybe your daddy will buy y’all another one. Is he one of the truckers?” he asked, glancing toward a group lining up at the cash register.</p><p>“No,” Jax said. “We’re on our own—I’m plenty old enough that I don’t need anyone else to buy a burger for us.”</p> <p>“Sorry,” the guy said, holding up a hand in mock defense. “Didn’t mean to offend you. You look pretty young, though, to be traveling all alone on the road, just you and your little brother.”</p><p>Irritated by the continued references to his young appearance, Jax started to snap something back at the man, then decided if he were to ever get a ride he’d better stop acting so prickly. “No, actually, we’re hitchhiking to our sister’s house,” he said, deciding to stick with the story. She’s going to have a baby soon, so we’re going to help her out.”</p><p>The man stood up, picked up his plate and drink and came over to Jax’s booth, standing beside it. “You don’t mind, do you? I hate to eat alone.”</p><p>Jax gave him what he hoped was a pleasant smile. Something about this guy gave him the creeps, but if he was headed in the right direction...The man held out a greasy hand to him. “Gus Bellamy’s the name. Glad to meet you boys.”</p><p>“Nice to meet you too.” Jax said, shaking the hand. He slid out to give the man his seat, while he settled next to Mason. “Which way are you headed?”</p> <p>“Arizona, eventually, by way of Texas,” Bellamy replied with a chuckle. “I have stops all along the way. How about you two? Where does this sister live, anyway?”</p><p>“Um, actually she lives in Texas. What a coincidence. Do you think we could get a ride with you? Does your company permit that?”</p><p>“Hmm? Oh, I’m on my own—independent trucker. I make my own rules, and I wouldn’t mind a little company on the way.” He finished his meal and sat back to look Jax over again. “’Specially with nice young boys like you.”</p><p>“Look, Jax,” Mason said, pulling at his sleeve, and Jax turned to see what he was pointing at.</p><p>Outside the restaurant, one lone biker was turning off the motor on his big, low-slung bike and taking off his helmet. He was a big guy, like the others had been, but Jax saw to his relief that he wasn’t wearing a black leather jacket like Cade and the others, and he didn’t look familiar to Jax. Not that he’d paid much attention, really, to all of the men riding with the gang who’d picked them up. The biker was staring rather intently through the glass at Jax and Mason though, and Jax turned quickly away. “Don’t stare at people, Mason. It’s rude,” he whispered, and put his focus back on the man across from him.</p><p>“Well,” Jax said. “If you wouldn’t mind giving us a lift, I’d really be grateful.” Jax sneaked another look at the biker and saw that he was on a cell phone, still staring in at him. Uneasy, Jax looked around the parking lot, but saw no sign of any other bikers and decided he was being paranoid. This was just a biker dude on his phone. No reason for his heart to be pounding in his chest and his breath to start coming so fast. He scrambled to his feet anyway, pulling on Mason’s hand and looked back down at his companion. “So you’ll give us a ride?”</p> <p>“Yeah, sure,” Bellamy replied, looking up at Jax. “I need to finish my sandwich and pay my bill, though, boy. In a big hurry, are you?”</p><p>“Um, no, not really. Actually, I need to pay too,” Jax said. “We’ll go do that while you finish, okay?” He hurried over to the cashier, glancing over his shoulder at the biker, who still seemed to be deep in conversation on his phone. Jax handed over his bill and the twenty, and the girl behind the register rang it up. He pushed the change down in his pocket and couldn’t stop himself from turning around. Though the motorcycle was still there, the biker was gone, and Jax breathed a heartfelt sigh of relief.</p><p>Gus Bellamycame up beside the boys. “I’ll pay, but then I need to see a man about a racehorse, son.” Jax looked at him blankly, confused at first, but then remembered hearing his grandfather say something like that years ago whenever he had to go to the bathroom.</p><p>Nodding, he said, “Uh, sure. Mason, do you need to use the bathroom?” Mason nodded and Jax took him over to the door. “I’ll wait right here.”</p><p>Jittering with nerves, Jax watched him go inside, and saw Bellamy pay his bill and head for the restrooms too. Jax stood by the door and waited, scanning the convenience store for any sign of the biker or anyone who looked familiar. Not seeing him or anybody else he recognized, he noticed a rack full of roadmaps nearby and went over to look at them. Mason came out and joined him and they stood by a rack of maps and magazines to wait. Jax looked over an atlas of Texas to see if he could find a city name in case the trucker asked him where he was going, and then the trucker was standing beside them again.</p><p>“Ready, boys?”</p><p>Filled with relief to see the trucker return, Jax nodded quickly, and they followed him out the door to his truck. They made it across the parking lot to an older model eighteen-wheeler, parked between two others. The trucker led the boys to the passenger door and opened it up, calling inside, “Hey, Randy, come and see what I found.”</p><p>A head popped out of a curtain behind the seat, and a slightly younger guy who badly needed a shave peered out, half rising up off the bed behind the seats. Jax could see he was balding a little on top. “Well, bring ’em on up here. I got an itch that needs scratching...”</p> <p>Jax backed away a few steps, pushing Mason behind him, holding up his hands. “No. I think you have the wrong idea. We just need a ride.”</p><p>Bellamy turned back to him. His friendly grin had turned somehow feral and full of menace. “And that’s just what we’ll give you, boy. Now you little boys climb on up here before I have to make you.”</p><p>Jaxturned, jerking on Mason’s arm and yelling, “Run!” Jax managed to make it only a few steps before he was picked up off his feet and dragged backward, a big hand clamped down over his mouth. His hand smelled like onions and Jax’s stomach turned. Mason stopped, looking back at Jax when he realized his brother had been caught. His face twisted with tears, and he took a halting step back.</p><p>“Jax...”</p><p>“Better come here, boy, if you don’t want your brother to get hurt.” Mason took a hesitant step forward.</p><p>Struggling wildly against the man’s iron grip, Jax was startled to hear a motorcycle roaring up next to them. He opened his eyes in surprise when he did and sagged in relief. It was the biker, Cade, and he was staring at Bellamy with murder in his eyes.</p><p>Cade addressed himself first to Mason. “Come here, boy,” he said firmly. Mason cast one worried glance back at Jax, but did as Cade told him and went over to Cade, who pulled him up on the back of his bike. Cade turned his attention back to the trucker. “Let him go,” he said, his voice almost unrecognizable, a harsh, menacing growl.</p><p>The trucker holding him shoved Jax up against the truck beside them, holding him there with one hand around his throat. “Now, you just need to get your own boy, asshole. This one’s mine.”</p><p>Cade got slowly off the bike and took a step toward them. A feral smile came over his face. “Last chance,” he said in a mocking, sing-song voice. It was seriously the most chilling thing Jax had ever heard. It must have scared the trucker a little too, because he took away his hand and stepped back. Jax broke and ran toward Cade, who pulled him behind him, turning his head long enough to say, “Get over there.”</p><p>Jax caught Mason up in his arms as he jumped off the bike and ran to him. Mason threw his arms around Jax’s neck, trembling. When Jax turned back to look, both truckers were standing outside, advancing on Cade, and the younger one had a tire iron in his hand. Cade stood his ground and then did some little movement with his head. He had his back to Jax, so he couldn’t see, but whatever the two truckers facing him saw alarmed them so badly they both blanched at the same time, screamed hoarsely and fell all over themselves trying to get away from Cade. He stood for another moment, then with another little turn of his head he came back to the bike.</p><p>“Get on the back with Mason,” he told Jax. He swung a leg over the front as Jax and Mason settled behind him, with Mason wrapping his trembling little body around Jax. Revving the motor, Cade glared back at the truckers and took off across the lot, with Jax clinging to his waist with one hand. He stopped at the edge of the lot, swung his leg off the bike and started to pace agitatedly up and down beside the bike.</p><p>“Damn it!” he yelled. Glaring over at Jax, he said, “It would not be a good idea to go back over there and give them what they deserve. Am I right?”</p><p>Jax swallowed hard at the fierce look on his face, happy all that fury wasn’t directed at him. “Yes. I mean, no, probably not.”</p><p>“Those sons of bitches—gonna get in my face. Motherfuckers!”</p><p>“Yes,” Jax said with a nod. “They were, but it’s okay. It’s over.”</p><p>Cade rubbed a hand over his face. “I should go back there and rip them limb from limb.”</p><p>“Uh,no, you really shouldn’t.”</p><p>“Even though they fuckingdeserve it?”</p><p>“Yeah, even though.”</p><p>Cade stopped pacing and took a couple of deep breaths. He glared back at Jax and at Mason who was still clinging to Jax, his face buried in Jax’s chest. Cade frowned. “And you’re not hurt? Mason’s okay?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No, no, we’re both fine. You got there in time.”</p><p>“Which wouldn’t have been necessary in the firstfucking place if you hadn’t run away from me!I left the room for like five minutes!”</p><p>“Yeah, well, it was probably a little more than that, actually.”</p> <p>Jax flinched as Cade turned a furious gaze back to him, and thenfollowed Jax’s gaze to a few people standing outside the service station, looking over at them curiously. Huffing out another furious breath, Cade continued to pace up and down beside the bike, looking back down the road as if he was expecting someone.</p><p>He turned back toward Jax.“Look, I won’t fucking force you to go with us. If you want to leave, I’ll take you somewhere safe. ”</p><p>Jax shook his head. “N-no. I want to go with you.”</p><p>Cade angled a suspicious look at him. “Why the sudden change of heart? You just ran away from me before, at the motel.”</p><p>“I-I don’t know. ’Cause you saved us, I guess.”</p> <p>“Yeah, well, what if it’s a case of out of the frying pan, into the fire?”</p><p>Jax shook his head. “I don’t think you want to hurt us. Do you?”</p><p>“No, Jax. I don’t want to hurt you. That doesn’t mean I won’t.”</p><p>Surprised, Jax stared at him with an open mouth. He really didn’t know what to say to that. Finally, Cade relented. “Okay, no,” he huffed out a long breath. “I won’t hurt you.”</p><p>“Then take us with you. You haven’t hurt us so far, and I’m...I’m tired of being on my own, hungry all the time. No place to sleep at night unless I can find some dirty bathroom floor. Hell, we’ll take our chances with you, if you’ll give us a ride.”</p><p>Cadestepped close enough to touch him, but simply stared into his face. “You’re not on your own anymore, Jax. I can promise you that, but I’m not going to tell you there’s not any danger. I’m not that big a fucking hypocrite. ”</p> <p>Jax nodded, not sure what to make of what he said, but honestly too tired to care much. He’d found someone to take them in, at least temporarily, and if there was danger in this man, he’d soon find out. It wasn’t like he wasn’t used to sleeping with one eye open.</p><p>In another minute or so, two of the others came roaring up on their bikes. Jax remembered one of them as Rayce, the nice one who’d brought them breakfast, and the other one was the man who had watched cartoons with Mason. After only a few words spoken between Rayce and Cade in that other language that Jax thought was French or maybe Cajun, Rayce turned and held a hand out to Mason, who went surprisingly willingly to climb up behind him. Rayce handed him a helmet and helped him fasten it on.</p><p>Pulling on his own helmet then, Cade swung up onto the motorcycle, handed Jax another helmet and made sure Jax was holding on tightly to his waist. In minutes, they sped off down the road, back east, the way Jax and Mason had come that morning. Within a few miles, they rejoined the rest of the group, parked in a fast food parking lot on the side of the road. Cade and the others pulled up beside them and switched off their engines. Right away Jax noticed the big biker from the truck stop—the one who’d been on his cell phone. So that was how Cade managed to arrive in the nick of time. Jax nodded at him, and he waved back cheerfully.</p><p>Jax could hear all of them talking to each other in that other language. Cade must have told them something about their destination, because a few of them pulled out maps from their bikes and studied them carefully.</p><p>Jax sat quietly as all the bikers bustled around, getting on their bikes, preparing to pull out again. They all seemed anxious, even happy to get on the road, even though the rain was still drizzling down. Jax was happy too. At least they were moving somewhere, and he and Mason needed to be on the move. He had to admit something about Cade made him feel safe, against all reason. As they were making their preparations, Cade came to stand next to him. He had a heavy jacket in his hands. “Here—put this on.”</p><p>Gratefully, Jax pulled it over the thin one he had on and fastened it up. He glanced over at Mason and saw he was wearing a similar one. Cade watched Jax broodingly.“One thing I need to know. How did you get away from me so damn easy at the motel?”</p><p>“We just walked outside. You were gone,” he said, trying to keep the accusation out of his voice and failing.</p><p>“I only left you for a few minutes, and when I left you were snoring. How did you get away so fast?”</p> <p>“Got a ride.”</p><p>“A ride. With a passing car, I guess. And then you allowed yourself to be picked up in that truck stop by another complete stranger, who was taking you to his truck to fucking rape you and probably your little brother. Is that about right?”</p><p>Jax was silent, feeling a cold chill up his spine at the man’s increasingly furious tone. Stranger? What the hell did Cade think he was? At least Jax hadn’t been run down on the side of the road and kidnapped by the others. Though these thoughts trembled on his lips, some instinct for self-preservation prevented Jax from giving them voice when he looked up and saw the dangerous gleam in Cade’s eyes, suddenly remembering the cryptic remark he’d made about out of the frying pan and into the fire. He contented himself with a shrug, but even that gesture set Cade off.</p><p>“Of all the lame-brained, stupidass, reckless things to do...” Cade’s voice wasn’t all that loud, but it raised goosebumps on the back of Jax’s neck. “You need a fucking keeper, do you realize that? You stubborn little...I ought to...if I had any sense, I’d...” he broke off, and turned his back, rubbing his hands over his face. “Fuck!” he yelled.</p><p>Rayce, who had sidled over to stand by Jax in the middle of Cade’s tirade, raised one eyebrow at him and puta finger to his lips, warning him not to rouse Cade’s anger any further with a smart remark.</p><p>Finally, Cade seemed to get hold of his emotions and turned back to him, pointing a finger at him. “You want to leave again, you just say so. You hear? I’ll take you someplace safe and drop you off. But you do not take rides from complete strangers, petit con.Are we clear?”</p><p>Jax nodded, wondering what he’d just called him, and staring at a point somewhere beside Cade’s head.</p><p>Cade blew out a frustrated breath and Rayce clapped him on the back. “Do you want to keep the little one with you, Cade,or should he ride with Connor?”</p><p>Cade stiffened, still apparently angry, then shrugged in an offhand manner. “Doesn’t matter to me how the hell he rides.” He glared at Jax again. “He’s a pain in the ass.”</p><p>“Oh really?” Rayce smiled over at Jax. Jax motioned him closer.</p><p>“What the hell is a petit con?”</p><p>Rayce smiled and again and whispered in his ear. “Doesn’t really translate well. But sort of little moron.”</p><p>Jax narrowed his eyes and glared at Cade’s back.</p><p>Rayce held out his hand. “Come with me, and I’ll put you with Connor. You can keep his back nice and warm.”</p><p>Cade growled at his friend loud enough that Jax could hear it. “No! Fuck you, Rayce. Get on your damn bike and butt out of this.”</p><p>Rayce laughed and sauntered over to swing a leg over his motorcycle. “Don’t fight it so hard, mon ami. The soif de sanghas you right where it wants you. By the balls!”</p><p>Cade snorted loudly and got on the bike in front of Jax. “Hold on, damn it,” he said over his shoulder. “It would be just like you to fall off the back of the bike.”</p><p>Jax took a deep breath, stifling the urge to come back with a smartass remark. “W-where are wegoing exactly? I know you’re headed east now, but where to?”</p><p>“We’re going toGeorgia. Does that suit you?”</p><p>Jax nodded. “Uh...Georgia?” He frowned. “I was hoping we’d go west. Maybe a little farther from Alabama, but I guess that’s okay. For now. And you promise you won’t hurt us?”</p><p>For a brief moment Cade turned his head back toward Jax. “Relax and enjoy the ride, Jax.” Jax held on, but he wondered if he’d made a serious miscalculation when he’d thrown his and Mason’s lot in with the bikers. After all, Cade hadn’t made him any promises.</p><p>It was almost eight o’clock when they pulled into the motel outside Atlanta—still fairly early, but since the rain had never really let up, Cade found a place to stay on the outskirts of town for the night. They’d been on the road for over six hours, and the small warm body behind him was slumped against his back. Cade knew Jax was asleep, despite the cold rain that was falling. The boy roused a little when they stopped, but made no move to do anything more than sit quietly behind him as he spoke quickly to Rayce and made arrangements for the rooms. Rayce came back out after a few minutes, and handed him a key card. He pulled out the little map of rooms the clerk had given him and quickly pointed out exactly where each member of the pack would be spending the night. Cade’s room was on a ground floor, so he drove around to it, leaving Rayce to sort out the others.</p><p>He signaled to the boy to hop off first. Jax stumbled a little at first, but soon stood beside him waiting patiently as he secured his bike and handed him one of the leather saddlebags to carry. Cade suspected he was still half asleep. He followed him into the room then, taking off his helmet and slumping down in a chair by the door.</p><p>“Mason?” Jax asked.</p><p>“Rayce will bring him in a few minutes. He can sleep with you.”</p><p>Jax nodded and began to get ready for bed.</p><p>Cade tried his best to ignore him as he took off his boots and jacket, and unpacked what he’d need from his bag. He was actually acutely aware of every move Jax made as he followed Cade’s lead and took off his own boots and jacket. Cade jerked his head toward the bathroom. “Hot shower,” he said tersely, trying to force down his wolf, who was itching to throw the boy face down on the bed and jump on top of him. “I’ll go after you.” He grabbed the television remote, like he was even vaguely interested in watching TV when Jax was about to get naked nearby. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Jax nodded gratefully and headed for the bathroom. In a few minutes, Cade heard the shower start up. He actually got to his feet to walk in there, the idea of slipping in beside his boy in the shower and bending him over almost getting the better of him. He stopped short of the door by sternly reminding himself what a major pig he would be to take advantage of the kid in his exhausted condition and turned to throw himself back down on the bed in frustration.</p><p>Rayce knocked, and when Cade answered the door, he carried in a sleeping Mason. They pulled off his jacket and shoes and covered him up. Rayce assured Cade that he and Connor were right next door if he needed anything.</p><p>Jax walked back out after about ten minutes, self-consciously wrapped up in a couple of towels, and Cade marched stiffly past him to the shower, careful not to touch him. Turning the water on cold, he stood under the spray as long as he could stand it, until his rigid cock finally got the message it wasn’t going to see any action tonight. Then he turned on a little warm water and washed himself quickly. By the time he got back out, the boy was already in his bed beside Mason and had the blankets pulled up almost over his head. Soft snores told Cade that Jax was already asleep.</p> <p>Cade fell down on his back on the bed beside him and reached over to turn off the lamp. He stared at the dim lights that came from the parking lot outside and watched them dance on the ceiling for a while before he convinced himself to shut his eyes.</p><p>He woke up after a few hours of troubled sleep and smelled cigarette smoke coming from outside the room. Suspecting it was Connor and grateful he didn’t have to make himself lie there any longer, he got up and pulled on a pair of jeans, moving quietly to the door. Sure enough, Connor leaned against the building, having a quiet smoke. The door to the room beside him was slightly open. Cade nodded at him and spoke softly, not wanting to wake Jax. “Still puffing on those things? You really need to give them up.”</p><p>Connor shrugged. He’d picked up a lot of bad habits in the last year or so, and their mother would have a fit if she saw him smoking. Cade had picked up the habit himself when he was spending most of his time in bars, but had kicked it a couple years before. Wolf shifters were immune to human diseases, but it smelled bad, especially to Cade’s sensitive nose, and he’d hated the addictive quality cigarettes brought with them. He abhorred the idea that he had to have anything—it fucking pissed him off—one of the problems he was having with a soif de sang.</p><p>“Yeah, I know. I’ll probably quit once we make it to the mountains.” They stood companionably beside each other for a moment before Connor spoke again. “Couldn’t sleep. I kept thinking about how lucky you are to have found your soif de sang, even if you do treat him like shit. I hope I’ll be lucky enough to have one.”</p><p>“What do you mean I treat him like shit?” Cade said tersely. “I haven’t hurt him. I fed him, bought him stuff. Got him away from those truckers. I’m taking care of him. What the hell else do you expect me to do? Rock him to sleep? Fuck, are you kidding me?”</p> <p>“Get pissed off if you want to, bro. But you make it pretty damn obvious he’s a burden, a pain in your ass. I call that treating him like shit.”</p><p>“Watch your damn mouth, bro. I’m your alpha now, and don’t you forget it. And if that doesn’t suit you, join Zack’s pack when we get there. Or hell, go home.”</p><p>Connor stood up and flicked his cigarette out onto the parking lot before turning to face his brother. “I’m not being disrespectful, Cade. And I never said I didn’t want to be in your pack. I’m here, right? I left all my family and friends behind, everything I knew to follow you. But I’ve never seen you act like you do with this kid. You take good care of him physically, I guess, but he’s scared to death of you. I see it—we all see it, though he’s a tough little bastard and tries to act like he doesn’t care.”</p><p>Cade made a scoffing noise and turned his back, but Connor pulled him back around. “Listen to me, Cade. You’ve been given a gift. Something really special. How can you turn your back on it like this? It’s the most intense bond any of us ever could have in this world. It’s even stronger than the blood match, and God knows that’s a life-changer.”</p><p>“You don’t know what you’re talking about, damn it. I never asked for this shit, and I don’t want it. This thing is a double-edged sword. The word means bloodlust, and that says it all, Connor. I lust after that kid in there. What does that make me? Have you seen him? I like women, Connor, or hell, maybe a man occasionally. A man, though, not some damn kid who looks like he’s fucking twelve.”</p><p>“Then send him away.”</p> <p>“Send him away? I can’t, damn it. I want him so damn much it makes my stomach hurt, and I won’t be able to rest until I taste his blood. And once I do, only his blood will sustain me. I’ll make him a blood whore, and I’ll be his.”</p><p>He ran a hand over his face and sagged back against the wall. “Damn it, is he really as damn pretty as I think heis? It’s hard to tell through this haze I get over my eyes whenever I get too close to him.”</p><p>Connor turned to him. “Yeah, he’s beautiful. You’re a lucky man, like I said. I don’t understand why you’re fighting this so hard. I mean, yeah, he looks like he’s twelve, but he’s not. He’s nineteen, right?”</p><p>“Do you even understand what a soif de sangis?”</p><p>“Well, not totally, I guess. It’s like a mate, though, right? I know that they’re like insanely rare, and not everyone gets to find one. He’s your true match, right? Why would you say you’ll both be blood whores?”</p><p>“Because once I taste him, and he tastes me, that’s what we’ll be. It’s like a blood match, only even more intense, and this one goes both ways. With the blood match, the mate has to feed from the wolf every few weeks to keep from going feral. But with the soif de sang, both the wolf and the mate have to share blood. They feed from each other. If they don’t, they don’t go feral, they fucking die, Connor. And the scent—the scent is maddening, like nothingI’ve ever experienced before. When I walked into that diner and saw him, smelled him, it was all I could do not to shift in that big roomful of other humans, pounce on him, and drink his blood. I wanted him so badly my hands were shaking, and it took all my strength not to...to...ravish him.”</p><p>Connor laughed uneasily. “Ravish him? I haven’t heard of anybody using that word since, I don’t know, the turn of the last century?”</p><p>Cade looked back at him, the corners of his lips lifting slightly. “Me neither, but it’s oddly appropriate. When I first touched him, it stunned me. You and Rayce thought I was being stubborn in not going after him right away, but I couldn’t. I literally couldn’t make myself get up out of that chair. I was so afraid he was underage. Do you understand...do you have any idea how frightening that was?”</p> <p>“I’m beginning to.”</p><p>“He’s been through some kind of trauma. I can sense that already, and I’ll only make it worse. Once our bond has been made, we’ll become almost like one person. If he feels pain or unhappiness, I’ll feel it too. We won’t be able to live without each other, and won’t be able to be separated for more than a few days at a time. We’ll have to drink each other’s blood to survive. Just take a moment to imagine that. No matter if we’re fighting or angry, no matter what we feel for each other, we’ll have to make love because that’s when the blood connection is made.”</p><p>Connor was quiet for a moment, staring out at the rain-soaked parking lot.“Since he’ll share my life, he’ll also share the shape-shift, but there’s no help for it. I can try to give him until we reachGeorgia, but then I won’t be able to stop myself from mating with him and giving him the mark. Somehow I have to bond with him before then.”</p><p>Connor put a hand on his shoulder and kept it there. “No matter what you say, Rayce said you were fortunate. You’ll have an unbreakable bond, and you’ll find your true match with him.”</p><p>“Rayce is wrong—there’s nothing fortunate about this. The bloodlust is unspeakable.” Cade was quiet for a long time, staring out at the deserted parking lot until he could sense Connor’s restlessness beside him. “C’mon, you’re cold. Let’s get back to our beds. We’ll have to travel all day tomorrow to get there, soit’ll be a long damn day.”</p><p>Connor nodded and disappeared back into his room. Cade stood for a moment or two longer before turning back to his own room. Immediately, he tensed, his body freezing in place. He sensed that Jax was wide awake. The door to the room had been slightly open so he could hear him if he needed anything. Now it struck Cade that Jax may have been awake for a while. He could have heard every word of what he said to Connor.</p><p>Cade sat down on the side of the bed. Mason was still sound asleep, and Jax had his back turned to him, but Cade saw him trembling. Finally, slowly, Jax turned his face toward him, his eyes wide in his small face.</p><p>“W-what are you?”</p><p>Cade took a deep breath and thought for the briefest of moments about lying to him, or at least giving him some watered-down version of the truth. But when he opened his mouth, the truth came spilling out. “I guess I’m what you would call a werewolf.”</p><p>Jax gasped for breath and jerked upright in the bed. He glanced once at Mason and then at the door as if trying to calculate his chances of grabbing Mason and making a run for it.</p><p>“Don’t try it, Jax,” Cade said quietly. “You know I’ll catch you and bring you back.”</p><p>Jax didn’t reply at first, just sat there breathing hard and gripping his knees with his hands so hard Cade was sure he’d have bruises there in the morning. He let him try to assimilate what he’d said before he spoke quietly again. “I’m not going to harm you—you should realize that by now. None of us want to hurt you.”</p><p>“This-this isn’t real.” Jax shook his head. “It’s not real. I’ve got to be dreaming.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Except you know it is real. You’ve seen how strong we are, how fast. You heard me talking to my brother just now. You didn’t have a word for what we are before, but you knew something was wrong, didn’t you?”</p><p>Jax nodded, his eyes shining in the dim room. He didn’t seem capable of saying anything more, so Cade tried to fill the strained silence. “What do you want to ask me? I know you must have questions.”</p><p>“W-what do you mean you’re a w-werewolf?”</p> <p>“I mean I am.I’m a wolf shapeshifter. Do you know what that means?”</p><p>“A monster.”</p><p>Cade shrugged. “I know it seems that way, but we aren’t vicious and out of control. Our minds remain partially human, at least, and we don’t kill people. It’s not like in the movies.”</p><p>“What do you want with m-me?”</p><p>“How much did you hear of what I said to Connor?”</p> <p>“Everything.”</p><p>Cadewinced. “I didn’t want you to find out that way, Jax. I thought you were sleeping.”</p><p>“I learned to sleep light.” Jax fixed him with a steady, implacable gaze. “I’ve been fighting monsters for a long time now.”</p><p>Cade narrowed his eyes at that, but only nodded. He needed to find out what Jax was hiding in his past, and find out where those scars came from, but he’d wait until later. One crisis at a time.</p><p>“Like I said, we’re not like what you’ve probably seen in movies or on TV. We mostly want to be left alone, and we try to stay away from humans.”</p><p>“From h-humans...” Jax said, his voice shaky. “Oh, shit.”</p> <p>“We don’t randomly attack people. We’ll defend ourselves if we have to, but that’s it. I’m telling you the truth. And we don’t eat people, or any of that crap Hollywood puts out.”</p><p>“You-you told your brother you needed to d-drink my blood. Like a-a vampire.” His voice had risen on each word until he was almost shouting at the end. Mason stirred next to him, but Jax rose up on his knees, his body tensed and ready to run, to fight if he had to.</p><p>Cade held up a hand. “Calm down, please. You misunderstood. Let me explain...”</p><p>“No. You tell me what that meant. How did I misunderstand? You said I’d be a blood whore. Are you going to kill us? Suck us dry of blood?”</p><p>Cade closed his eyes and sighed. Fuck. “No. Please settle down and give me a chance to explain. We’ll work this out. Okay? I promise.”</p><p>“What do you mean, we’ll work it out? I want to take my brother and leave. Right now. If you’re really not a monster, then you let me go!”</p><p>Mason sat up and rubbed his eyes sleepily. “Jax?” he said. Jax reached around and put a hand on him, but never took his eyes off Cade.</p><p>Cade spoke quietly, keeping his tone level. Jax was about to freak out big time, and Cade could feel it building. “I don’t think I can let you go any more, Jax. Earlier today, I told you I would, but I don’t know if I could have gone through with it, even then. Every hour more I spend with you, it gets harder, compels me more. I know you don’t understand, but if you’ll let me explain...”</p> <p>Jax’s nerve finally broke, and he scooped Mason up in his arms and lunged for the door. He blanched in horror to find that Cade made it there before him and stood blocking the exit. Backing violently away, he stumbled over furniture in his way but made it over to the far corner of the room, pulling a chair over in front of them. He screamed in abject terror as Cade walked slowly toward him, his hands held out to the sides.</p><p>AsJax’s fear increased, Cade knew he had to stop walking toward the boys, so he slowly began to back away. Rayce and Connor must have heard the shouting through the thin walls, because they were now outside the room, pounding frantically. He opened the door and saw both of them looking alarmed and panicky.</p><p>“It’s okay,” he said to them. “Rayce, come in and take Mason. This could get out of hand. Jax has discovered our true nature.”</p><p>“Jax,” he said, walking back toward him slowly and holding out his hand. “Let Rayce take Mason. He won’t hurt him.”</p><p>“No! Stay back! Both of you.” Jax yelled, backing away, looking around wildly. He turned to make a break for the bathroom and screamed in horror to find that Cade somehow made it there before him. Cade plucked Mason from his arms and handed the crying, frightened child off to Rayce, catching Jax’s wrists and holding him when he would have attacked Rayce.</p><p>“Cade? Should I...” Connor asked, nervously standing behind where Cade wrestled with Jax.</p><p>“No,” Cade said over his shoulder. “Go back to your room. Help Rayce settle Mason down—he’s scared to death. Jax overheard our conversation and he’s upset, but I’ll calm him down.”</p><p>Jax screamed in outrage. “Calm me down? Calm me down? Are you crazy? Let me go, you monster!”</p><p>Cade picked him up and threw him on the bed. When Jax started to jump back up, he pointed a long finger at him. “No! Sit down. I’ll explain everything, but you have to calm down.”</p><p>Jax subsided but glared furiously up at Cade. Cade turned to go to the door and lock it behind his retreating brother. Before he could turn back around, a glass lamp exploded on the wall next to his head, missing him by inches.</p><p>“Damn it, Jax, I’ll have to pay for that.”</p><p>Jax wasn’t listening, because he had jumped from the bed and was busy trying to pick up the television to hurl it at him too. Cade crossed the room in two strides and jerked it out of Jax’s grip. “Cut it out, damn it.”</p><p>He put the television back and whirled around to catch the chair that was about to land on his head. After wrenching it from Jax’s hands, he set it down carefully and advanced on the boy, who was trying to leap over the beds to get away. He caught him in his arms in mid-leap and sat down with him, his arms tightly wrapped around him as he struggled and screamed for help. Keeping one hand around his arms, he put the other over his mouth, cupping his hand so Jax couldn’t sink his teeth into it.</p><p>“Shut up or you’ll have security in here.”</p><p>Rather than quiet him, that remark only served to intensify his screams and struggles. Cade laid him down on his back and stretched out over him, holding his hands over his head with one hand and keeping a hand over his mouth with the other. Trying his best not to hurt him, he simply held him down as Jax slowly exhausted himself. It took almost twenty minutes with Cade waiting for the police to pound on the door at any moment, before Jax finally sagged into the mattress, breathing hard through his nose.</p><p>“If I move my hand off your mouth, will you behave? Because if you yell, it goes right back and then I’ll have to gag you.”</p><p>Jax glared at him for a long moment and then nodded. Cade eased his hand away, staring warily down at him. “Better?”</p><p>Again, Jax glared, but though his breathing was still really rapid, with his chest heaving up and down, he’d lost the wild-eyed look of sheer panic.“D-don’t kill me,” he whispered.</p><p>Cade sagged down on top of him. “Damn it, I’m not going to kill you.”</p><p>“B-but you said you’d d-drink my blood.”</p><p>“What you heard was...out of context. Sort of. Jax, I promise I won’t touch you until you give me permission, okay?”</p><p>“Permission? To kill me?”</p><p>“No. Damn it, I’d never harm you, Jax. You’re the most important person in the world to me. I won’t touch you until you say it’s okay.”</p><p>“You’re touching me now,” he said accusingly, his eyes flashing with hurt and anger.</p><p>“So I am. I’m going to let you up, okay? Do you promise not to run or throw things at me?”</p><p>Jax hesitated, seeming to think it over, then gave him a quick nod in response, his eyes wary.</p><p>Gingerly, ready to catch him if he made any sudden moves. Cade got off him and sat beside him on the bed. He turned toward him, blowing out a long breath. “Are you ready to listen?”</p><p>Jax gave another quick, sullennod, and Cade nodded back. “Just let me tell it in my own way. Please. I’ve never explained this to anyone before, and I probably won’t be very good at it, but just listen to me.”</p><p>After a long moment, Jax shrugged. “I’ll play along for a minute, but you better get to the truth pretty damn quick.”</p><p>“Nobody really knows how this all started. The shape-shifting thing. We’ve just always been here, co-existing rightalongside humans. You just never knew it. The pack we’re trying to reach—it’s called the Dark Hollow Pack—they think it started with Indian tribes a long, long time ago. But my pack originated in Europe, so who really knows how it began over there? When I was about your age, I got really curious and tried to do research on the whole idea. There’s actually a theory called the Cain connection—you know, like from the Bible? It says that Cain killed his brother Abel and drank his blood. God punished him by banishing him and He also told him that from that moment on Cain would wear a mark to show everyone what he was, and what he’d done. It was the mark of Cain. Now nobody knows for sure what that is. It’s all a mystery. But the mark extended to all of his descendants. Some people think the ability to turn into a wolf—a beast—could be the mark of Cain. There’s an ancient tradition that says some of Cain’s descendants were monsters. In the Viking epic Beowulf, for example, Grendel was descended from Cain.”</p><p>“This is crazy.”</p><p>“Crazier than me being a shape-shifter? In the ancient text of Beowulf, it says ...from Cain came down all kinds of misbegotten – demons, ogres, elves, beasts and evil shades. Once we reach puberty, some of my people can turn into a wolf if we need to, or even if we just want to run with the moon. We can call up our wolf at any time, but we usually do it on our own land, in our own time.”</p><p>“I thought you were a motorcycle gang.”</p><p>Cade raised his eyebrows. “Really?” He grinned. “No, my friends and I just like to ride. We rode together at home, long before we started on this trip.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So the place we’re going—there are more there like you?”</p><p>“Yes. My branch of the family came over from Europe in probably the seventeenth century or so and eventually wound up in Louisiana. Over the centuries, shape-shifters like us have been nomads, travelers, explorers, even mistaken for gypsies. Groups of us stay together, in a pack. Like wolves, we’re comfortable only when we’re together. We adopted the wolf hierarchy because of our appearance when we shift. I’m the alpha of our little group, and we’re on our way to Georgia to meet up with my cousin Zack.We’re all distantly related, of course. Their pack is strong, and he says there’s land for us to build on, sowe can start our own branch. It’s too hard for alphas to live together, so that’s why they built their own lodges and started this kind of alliance. We’re going to settle there too and build our own home. The other packs will help us.”</p><p>“What about me? Why do you need me?”</p> <p>“Since we intermarry within the packs so much—not close relatives, of course, but sometimes, distant cousins—over the years our entire pack has become all extended family. Members of our pack usually meet their mates when we interact with adjoining packs. Occasionally, we take a human mate.”</p><p>“Why just occasionally?”</p><p>“The simple answer is that humans are too much trouble, Jax. They have families who miss them and want to visit. We can’t allow that. The humans don’t always adapt to our way of life. Pack life isn’t for everybody, I guess. And then there’s the no-longer-quite-human thing.”</p><p>“What do you mean?”</p><p>“Once we give our mates the mating bite, they’re not quite human any more. They could live off our blood indefinitely. They live much longer lives, like up to two hundred years, as we do. They’re stronger, better-looking, faster. And they don’t age much past the age of thirty. That usually means they have to break off all their former family ties because we have to ensure the safety and anonymity of the pack. ”</p> <p>“But you say you want me for your mate? So you’re saying that will happen to me?”</p><p>“Yes, but in our case, there’s a difference. Sometimes, with some members of the pack, and it’s really rare—a different kind of mating takes place. Nobody knows much about it. My grandparents had it, so I know a little more than most. My pack calls it soif de sang.That’s French for bloodlust.”</p><p>“Why French?” Jax had become calmer during Cade’s long explanation. He sat on the bed beside Cade, almost lethargic after the huge adrenalinerush he’d experienced.</p><p>“My branch of the family came from France many years ago. There’s some evidence that we could have been Acadians. They were a group, originally from France, who settled in Canada in the seventeenth century. They were moved from Canada against their will, and some were taken to Louisiana, where they became the present day Cajuns. We’re related to them. We still have very close ties in Canada and in France, and my pack speaksFrench as our second language. It’s what we learn growing up.”</p><p>Jax nodded. “And this ‘soft duh song’ thing...”</p><p>Cade corrected his pronunciation. “So-off-duh-sahn,” he pronounced slowly and carefully, leaving off the final g sound. “It means bloodlust, but it doesn’t mean like someone’s going to suck someone else dry like a vampire or anything. A long time ago, and the legend is fuzzy on this part, something happened. You see, we know our true mates when we see them or smell them. Our mates have a certain scent that we recognize,and it’s absolutely irresistible to us. The soif de sang is like the blood match on steroids. These mates share everything with their wolves—and I mean everything. Thoughts, feelings—blood. And their mark.”</p> <p>“I don’t understand.”</p><p>“Look, if one of us finds his soif de sang, if he’s granted one, then he has to be with them all the time—he can’t stand to be away from them for longer than a day. He has to bite them, give them the mark and from that time on, they too have the ability to shape-shift. That part is, I admit, a little like the Hollywood thing. A regularblood match can’t do that. The compulsion to shift is not as strong, and they don’t have to shift, but they can if they want to, or if they ever need to for any reason. Like to defend themselves or their partner. The two partners share everything, even blood. They drink small amounts of blood from each other whenever they make love. They need to do this—they have to do it to survive.”</p><p>“And that’s where I come in, huh? I’m your soif de sangthing? And just what’s in it for me exactly? The chance to turn into a werewolf? Drink your blood? No fucking way.”</p><p>“Not only that. Again, your life would be greatly expanded. You’d live as long as your mate survives, and once you mate, the two of you will die together, after a long, long life.” Cade didn’t say if we mate,and he wondered if Jax had noticed. “I told you about that and about being stronger and faster. Even immune to human diseases. No human could ever stand up to your strength.”</p><p>For the first time, Jax’s eyes lit up. “No one? I’d be like invincible?”</p><p>“No human could withstand it. Other wolves would still be stronger.”</p><p>Ignoring him, Jax continued. “But I would be strong? No one could force me to do something I didn’t want to do? I’d be able to defend myself if someone came after me?”</p><p>Cade stirred uneasily. “Yes, incredibly strong and fast...you’ve seen how quickly we’re able to move. I’m an alpha, which is the highest-ranking wolf in a pack. That means I’m the leader of this pack. As my soif de sang, you would share that status. You’d become my alpha mate.”</p> <p>Jax nodded, his eyes glowing softly. “I like that. And no one would ever be able to hurt me or Mason ever again?”</p><p>“That’s right.”</p><p>“Then hell yeah,” Jax said, his eyes sparkling. “Let’s fucking do this.”</p><p>Chapter Three</p><p>Cade stared at him, his mouth slightly open in surprise. “Y -you wantto mate with me?” “Hell, yes. What do I have to do?”</p><p>“First of all, slow down. Do you...like men, then?</p><p>Jax raised his gazespeculatively, looking over Cade’s body. This was the first time he’d</p><p>seen him even partially naked, and he very much liked what he saw. Cade had a nipple ring in one nipple that was making it hard for Jax to concentrate. He tore his eyes from it and nodded. “Yeah, I like guys—always have, which was part of the reason I’ve been picked on. Not to take anything away from you—I mean, you’re really good-looking, but it’s not so much you as what you can offer me. Growing up small and different and gay inthe Bible Belt south hasn’t been any picnic, let me tell you. Not to mention...” He shook his head and caught himself. No need to air his dirty laundry with this man. He didn’t know him well enough for that. Hell, maybe he never would. His secrets were shameful and humiliating, and he doubted if he’d ever share them with anybody.</p><p>“The chance to be strong, almost invincible— and a leader—hell yeah, I want that,” Jax continued softly. “I’ve spent my life being picked on by assholes who were bigger and stronger than me. I’d like to be able to take care of myself and Mason, and never have to worry about being taken advantage of again.”</p><p>“You understand what this means. You can’t undo it once it’s done, Jax. We hardly know each other, but you’ll be pledged to me for the rest of your very long life. There will never be anyone else for you. Only me.”</p><p>“I get it. That would go both ways, wouldn’t it?”</p><p>A small smile played around Cade’s lips. “Yes, it would go both ways.”</p><p>“And Mason stays with me. He’s part of the deal.”</p><p>“Of course.”</p><p>Jax nodded. “Okay, then how do we do this?” He lay down on the bed and opened his legs, letting his fingers trail down his abs. “Do you want me like this?”</p><p>Cade shot up suddenly and moved across the room so fast Jax could barely follow him with his eyes. Shaking his head, he stared back at Jax’s surprised face. “I-I’m sorry. I don’t want to take you like this. I don’t want to hurt you. But my wolf...he almost got away from me just then.”</p><p>“Your wolf?”</p><p>“It’s inside me, Jax. It’s always with me. It will be born inside you eventually after we share our blood. I’m trying to control him now, but it’s difficult. Like earlier, when those truckers were threatening you, I almost lost control then. I would have ripped them apart.”</p><p>Jax’s eyes grew wide and he nodded. “But you stopped yourself...”</p><p>“Yes, I was able to control it, because I had you safe, but it was a near thing. As much as those assholes deserved it...”</p><p>Jax watched in fascination as his eyes grew dark and wild. His face seemed to almost blur and stretch. Long incisors dropped from his mouth and Jax recoiled in horror. Then, with a hard shake of his head, Cade was back to normal, the incisors retracted and his face was once more the same handsome face Jax was growing very used to.</p><p>“Sorry,” Cade said, his voice low and guttural, unlike his normal voice. “I guess I only thought I had it under control.”</p><p>“That’s what those truckers saw back there when they got so scared.”</p><p>Cade nodded, his eyes solemn.</p><p>“What-what’s it like? Does it hurt?”</p><p>“To shift? No, not exactly. It’s more like...losing myself for a while. Today, when I stood in front of those men, I could smell their blood, their fear. It was like a hunger, a tingle in my nose, a burning in my veins. Their terror when they saw me was sweet to me too, their panic like an elixir.” He shook his head. “Hard to explain, because my wolf doesn’t think in words—just images that flash in my brain.”</p><p>Jax nodded once, his hands gripping the blanket beneath him. The danger in the air around him was almost palpable. “Would you...hurt me?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade shook his head. “No. Not intentionally. I’m only afraid I’d be too rough with you. My wolf could take over when I was with you, and if it happened when we were mating, I wouldn’t be able to be gentle. You’re so little, so delicate.”</p><p>Jax felt his spine stiffen. “Delicate? Fuck that. I’m tougher than I look. I can take you on— just try me.”</p><p>“Jax,” he said, shaking his head. “You don’t understand.”</p><p>“I understand. You think I’m just some kid. Because of my size and my baby face, you think I’m weak. Well, I’m not. I’ve had to be strong for me and Mason both. You asked me if I know about Cain and Abel? I didn’t go to church much, but one summer when I was about Mason’s age, I went to this thing they called Bible school at the Baptist church in our neighborhood. They told us some Bible stories. They told us this one about David and Goliath. You ever heard that story?”</p><p>“Yes, Jax, of course, but...”</p><p>“No, listen to me. That’s how you fight monsters, you know. That’s how you stand up to them. You draw a line in the sand and say, this is it. This far and no farther. Then you wait for them to come to you—just like that David did. You draw them in close and then you smack them down, if you can. If you can... I’m not saying you’re a monster. I’m just saying I know a thing or two about monsters. And I can take care of myself—and Mason too. I’m not scared. Not anymore. There’s worse things than dying, you know.”</p><p>Cade moved toward him slowly, but the steps he took were purposeful, almost predatory. Jax stoodup beside the bed and waited for him. “You can take care of me, can you?”</p><p>“Yeah, I think so. Bring it on. I can handle you.”</p><p>Cade walked right up to him and put his hands on Jax’s waist. He bent low over his neck. Was he smelling him, for God’s sake? Jax trembled slightly, but stood his ground.</p><p>Cade murmured against his neck. “Thou—who art so lovely fair and smell so sweet that the senses ache at thee, would thou hadst ne’er been born.”</p><p>“What?” Jax said, pulling away. “What did you say?”</p><p>Cade shook his head. “Sorry. It’s a line from Shakespeare, from a play called Othello. It seemed to fit just then.”</p><p>“How do you remember that shit?”</p><p>“I played Othello in a high school play once. Some of it stuck.”</p><p>“Did you just say you wished I’d never been born?”</p><p>“I didn’t mean that exactly.” He ran a hand through his hair distractedly. “But I’m not ready for a soif de sang, Jax. No matter how beautiful you are, no matter how much your blood calls to me. I don’t know if I can do this.”</p><p>“How the hell old are you,anyway?”</p><p>“Twenty-eight.”</p><p>“That’s nine years older. Not so much.”</p><p>Cade pressed his lips together and shook his head.</p><p>“Look I heard what you said to your brother earlier, remember? You told him there was nothing good about this soif de sang, and it was—unspeakable.”</p><p>Cade dropped his hands from Jax’s waist and sat down on the bed. He shook his head. “Did I actually say that?” He smiled over at Jax, an ironic little twist to his lips. “A little over the top, wasn’t I? I have to warn you, Jax. I sometimes exaggerate for effect.”</p> <p>“Were you exaggerating then? Is the idea of me being your mate so damn awful?”</p><p>“Of course not, Jax. It’s not you, it’s me.”</p><p>Jax groaned. “Shit, not the old it’s-not-you-but-me bullshit.”</p><p>“Jax, please listen. I need to be honest with you. I’m not ready to settle down, and you— you’re only a kid, and this takes both our choices away. Forever. Once we mate, we’ll have to be together. It’s not so bad if you’re already in love, but we barely know one another. What if you decide you made a terrible mistake somewhere down the road? It won’t matter, you know. You’ll still be stuck with me. You might wind up hating me.”</p><p>“Is that possible?”</p><p>“Absolutely. It happened with my grandparents. I told you this thing runs in families. By the time I was born, they were already pretty old, even for our kind. They’re gone now, and buried in Louisiana, but I remember how much they argued and fought. It was almost legendary. They had been the alpha pair, before my father took over as alpha, and they disagreed on pretty much everything. My mother told me once that my grandmother had been engaged to someone else before my grandfather came along. And though she still loved the other guy, she couldn’t resist the pull of the soif de sang. Her own body betrayed her, forced her to leave the one she loved to be with my grandfather.”</p><p>“So what happened to them?”</p><p>Cade smiled gently. “Nothing big or dramatic. They were drawn to each other not out of love, but out of this compulsion. My grandfather tried, I think, but he finally gave up when he saw she couldn’t or wouldn’t meet him halfway. They co-existed, nothing more.”</p><p>“You make it sound so awful. If you don’t want me, then fine. I don’t want anybody who doesn’t want me. Just take us with you to Georgia, and I’ll find a job. I’ll leave you alone.”</p><p>“No!” Cade yelled the word and reached out to grip Jax’s arms tightly. “You won’t leave me. I can’t lose you now.” He pulled Jax over to him so that Jax stood between his legs. He ran his hands over Jax’s body and pressed him against his chest. His body felt warm and hard, and almost at once, Jax felt his erection growing.</p><p>Jax laughed a shaky little laugh. “I got to tell you, Cade, you’re giving me some real mixed signals here.”</p><p>Cade looked down at his erection almost in surprise, then his gaze traveled back up to Jax’s face. His skin was pale and he looked strained and panicky. “I know. I feel like I’m going crazy. Jax, II don’t think I can wait. I need to...I have to be inside you.”</p><p>“Jesus, you’re a confusing person to talk to.” He shook his head and looked up to see Cade’s eyes sparkling.</p><p>“Yeah, I know,” he said softly. “All part of my charm.”</p><p>“Okay, then,” Jax said, his voice rough with the sudden surge of passion he was feeling. “If you want me so bad, do it. Take me, damn it.”</p><p>He slid his arms around Cade’s shoulders, and bent to taste his lips. The moment he pressed his lips against Cade’s a sensation swept over him, like drowning, like being overcome with something that stole all the oxygen from him and left him gasping. He felt Cade’s tongue slip between his lips and he tasted him, a faint, sweet taste that reminded him somehow of green forests and wild things. He lost track of his senses as Cade’s tongue explored his mouth, and pulled him closer and down into his lap, so that Jax was straddling him, his own hard cock snugged up against Cade’s rock-like bulge. Cade was pressing him against his chest so hard he could feel his heart beating, fast and steady and strong. Jax was losing track of the boundaries between them. The nipple ring was digging into Jax’s chest. Was that Cade’s heart or his own?</p><p>Jax fumbled with Cade’s jeans and got a hand inside. Cade groaned and pushed up hard against his hand. Jax could feel Cade’s cock twitching a little as he held it, and Cade made a sound that was like a moan and a growl all at once, picking Jax up with his hands under his arms and throwing him down on his back on the bed. A part of Jax thrilled at the rough treatment. Jax knew he wouldn’t break, and he wanted Cade to see that. He was a man and would be treated like one, despite the difference in their two sizes.</p><p>Cade came after him with a feral growl. The sound was deep and bestial, and it should have scared Jax, but it only excited him. He felt like growling himself, as a matter of fact. Jax had one small moment of panic, when he saw Cade’s beautiful face hovering over him. He was so big, so muscular. Then Cade leaned over and pulled off Jax’s underwear, just ripped them down and engulfed Jax’s cock in his mouth.</p><p>Never before had so many feelings rushed over Jax all at once. He felt the brush of Cade’s hair on his stomach and the rasp of his beard on his thighs. The velvety softness of his mouth and the wet heat of it combined to make him stop thinking anything coherent altogether. He could literally feel all the blood in his brain rush southward at a high rate of speed.</p><p>“Cade,” he screamed, and Cade murmured something he couldn’t understand. Or it could have been Cade humming—whatever it was, the vibration nearly drove him out of his mind. He wondered briefly if Cade was making the noise at all. It might have been his own blood, thrumming wildly through his veins.</p><p>“I’m going to come,” he said, in a panic, struggling not to embarrass himself. No one had ever done this to him before, and it was wonderful and terrifying and amazing all at once. Jax was carried away with his emotions that he couldn’t even think straight. Cade pulled off his dick with a wet plop and stared down at him.</p><p>“Come then, baby. Come in my mouth so I can taste you.”</p><p>“Oh, fuck.” A shudder ran through Jax so hard that it threatened to shake him off the bed, but Cade held him down with his broad fingers on the inside of his thighs. He bent his head to engulf him again and lick down the entire length of his shaft, then swiped his hot tongue down onto the place where his groin met his thigh and nuzzled there for a moment. He swept down over Jax’s balls and took one in his mouth. It was enough to send Jax over the edge, and he came so hard the world dissolved for a moment and then reformed around Cade. Cade caught some of his cum in his mouth and finished sucking him dry until it actually became unbearable, the stimulation just too much. Jax whimpered frantically and felt Cade pull off, his arms wrapping around him. Cade moved up then to kiss him so he could taste himself on Cade’s lips.</p><p>“Keep me with you,” Jax gasped in Cade’s ear. “Don’t leave me.”</p><p>“Never,” he said, his voice a deep, almost bestial sound. Without warning, Cade flipped Jax onto his stomach. Pulling Jax to his knees, he pried apart the cheeks of Jax’s ass and licked him there with his tongue. Jax arched his back and screamed his pleasure. He’d never even heard of anybody doing this before, and it was equal parts mortifying and thrilling to him. Cade was stroking Jax’s cock, only half hard now, the skin painful to the touch after how hard Jax had just come. Cade’s wicked tongue came back to thrust inside him again and again until Jax was nearly incoherent. He tried to move forward, in some instinctual move of self-preservation, but Cade pulled him back and licked him again, moving from his balls to the top of his cleft. Jax screamed, clutching the sheet in his fists. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade rolled him to his back and spread his legs. He looked down at him with satisfaction. “Mine,” he groaned, then held him up and buried his face between his cheeks again. Jax could feel his tongue thrusting inside until he thought he’d lose his mind. He was reduced to begging until finally, Cade pulled his face away and fingered him.</p><p>“Look at me, baby,” he commanded and Jax looked up at him. He carefully put in one finger, moving it until Jax felt the burn. Next came another finger and Cade carefully watched his face to gauge his reactions. When Jax’s eyelids fluttered, he smiled down at him. “I’m claiming you, Jax. You’re mine now. Forever.” He pushed inside Jax again with his fingers and Jax moaned, his teeth gritted together. Then Cade shifted his angle to slide across his prostate and Jax put his head back and moaned so loudly it must have sounded like Cade was killing him.</p><p>“That’s it, baby. Let me hear you sing.” Cade’s eyes were glowing down at him, his heated stare running over him, making Jax breathe faster, and making his body tingle from that touch alone. Impatiently, Cade surged to his feet. His big hands went to the buttons on his jeans and he stripped them off expertly. Jax’s gaze was fixed on him as he revealed his body, so gorgeous with his smooth muscles and tanned skin. And mine, Jax thought, a little thrill running through him.</p> <p>Jax’s eyes moved down to his groin and his gaze faltered. He looked back up to find Cade’s gaze burning into him. “Cade...what...what is that?” He pointed down to Cade’s cock, long, thick and uncut. Around the base of his cock was a growth of some kind. Circling right around the shaft, it was almost the size of a small baseball.</p><p>“It’s my knot, Jax. It has to go inside you this first time to ensure our bond. It will hold us together for a while, and I won’t be able to release from you. Do you understand? It’ll hurt, baby. I’ll try to stretch you as much as I can, and we’ll take it slow, but it has to go inside you.”</p><p>Jax looked up into Cade’s eyes and then nodded his understanding. He didn’t really understand at all, but he wanted to be whatever Cade needed him to be. He reminded himself that this man wasn’t human—naturally there would be some differences. That was what Cade kept saying, and he had to believe him. He looked up at Cade and tried to nod.</p><p>“I know how this must seem, honey. It’s natural for us, but I know it looks strange to humans. It’s just a part of me, a part of my wolf. I don’t want to hurt you, and it will be just this first time we make love. It will help form our bond.”</p><p>Jax nodded again. He wasn’t a virgin, after all, and he wasn’t afraid. That had all been taken from him a long time ago, and in a much more brutal manner. In the past, he’d even been forced to wear large plugs for hours at a time, so he knew how this might feel. He didn’t want to think about it, but he was desperate to please Cade, and to understand.</p> <p>“I’m so sorry, baby. I never want to hurt you. I’ll be as gentle as I can, okay?”</p><p>Jax nodded and Cade continued. “It’ll be better for both of us if you can relax as much as possible.”</p><p>Cade stood for a moment looking down at Jax, and Jax crawled to the edge of the bed and curled a hand around his thigh, dragging him closer. He stepped forward, his eyes glowing, as Jax leaned closer. Without any more warning, Jax swallowed him down. He couldn’t get his mouth around the knot, but he held it in his hands and massaged it gently.</p><p>Cade gave a startled, harsh cry and his knees buckled a little to the side of the bed. Jax’s tongue caressed the vein on the underside of his huge cock, licking upward to torment the head. He let his teeth graze the tender skin and his hands came down on the back of Jax’s head.</p><p>“God, Jax,” he cried, and Jax slipped his tongue deeply into his slit. With a choked cry, Cade pulled him off, whirled him around, and put him back on his hands and knees, facing away from him. Gentle hands kneaded the muscles of his back and then moved down between his legs.</p><p>“Stay right there—don’t move.” Jax watched Cade over his shoulder as he moved over to his bags and dug inside. He came out with some lube and triumphantly came back over to the bed, grinning. He slicked his shaft with it, paying extra attention to his knot. Then he positioned himself behind Jax and pushed himself in.</p> <p>Jax cried out, “Wait...”</p><p>Breathing hard, Cade looked up at him, his eyes not focused, his pupils almost blown.</p><p>“A c-condom?” Jax saw him slowly register the request, but shake his head.</p><p>“Human diseases—I don’t need condoms.” He seemed to notice Jax’s eyes grow wide at the comment and patted his hip. “Trust me, baby. I’ll always take care of you.”</p><p>Jax nodded, pretty far gone in both ecstasy and pain, but he pushed back hard, opening himself and not stopping until he could feel what must have been Cade’s knot brushing against his ass. It wasn’t cold and hard like the anal plugs he’d had inside him in the past. This was warm, smooth and much softer. Cade stopped moving at that point, running a hand down Jax’s back, the touch making Jax arch up into it.</p><p>“More,” Jax said, panting for breath, and Cade pushed in again, a little more this time, rocking gently back and forth. He was continually rubbing against Jax’s prostate, bringing him to the brink again and again. Each time, Cade would stop moving until he could recover and gently rock against him again. Cade added more lube, and pushed hard one last time and with a soft plop, the knot slipped all the way in. Jax was painfully full and stretched, and it hurt like a bitch, but he was also very aroused.</p><p>Jax twisted and whined, thrusting backward, and then came again, great pulsing streams of white shooting from him as he arched upward. Cade gripped him around the throat and bit down hard into the side of his neck, while at the same time grinding into him. Jax could feel him sucking his blood, his teeth sharp and painful. He held him there against his chest as he drank, riding him obscenely, possessively. Just when Jax thought he might die from the pleasure and the pain, Cade came hard, filling him with his hot cum. His cock stayed hard, and they were still fused together as Jax felt the pressure rise in him again.</p><p>“I-I’m coming again,” he cried. Cade held and soothed him through it, murmuring soft words in his ear as he came apart. Jax could feel the blood trickling down his neck and onto his back. Cade raised his head and licked at the wound, closing it up. He bit down into his own wrist and pushed it up against Jax’s lips. “Drink from me, little one. Drink deeply. It’ll help.”</p> <p>Jax opened his lips and allowed the hot, bitter blood to seep into his mouth.</p><p>Cade shook his head. “No. Drink. Suck my wrist.” It tasted metallic, like iron, but he sucked in as hard as he could, wanting to please Cade. He was only able to take in a couple of mouthfuls before he started to cough and turned his head, but it must have been enough. Cade kissed his shoulder. “Good. Good boy.”</p><p>A feeling of lassitude came over him in waves, soothing the pain and making him feel boneless and totally relaxed. He was flying, higher than before. He soared up into the clouds and they thickened around him. He was incredibly groggy and his pain eased off. Jax wondered in a vague, unfocused way if the blood had anything to do with it—Cade said it would help.</p><p>Cade whispered to him that he was “in heat” from the mating bite, not that his body secreted anything, but he would be overwhelmed with the urge to have sex with Cade. It must have been true, because suddenly he couldn’t get close enough to Cade. He pulled at his own cock and his breath came in big hitches as his body tried to process the chemicals that were flooding into him from Cade’s cum. He strained back against him and put a hand back to grab Cade’s hip and pull him closer, still pulling at himself frantically. Cade pulled his hand away.</p><p>“Be still, Jax. You’ll have multiple orgasms now, without stimulation. You’ll hurt yourself if you’re not careful. You just have to ride the orgasms out, baby, but I’ve got you. I’m here.”</p><p>Jax was too far gone to listen to him, and when Cade stopped him from straining closer, he moaned pitifully. “I’m sorry. I don’t mean to hurt you, but it’s the only way. Try to be still...”</p><p>His prostate bathed in the chemicals released from the gland, Jax arched his back and cried out as an intense orgasm made him scream hoarsely. He reared back against Cade again, seeking help. Cade licked at the wound on his neck and held him down as his body spasmed out of control.</p><p>Jax thought afterward that he passed out for a while, because the next thing he remembered was his muscles clenching on the hardness inside him, and he wasn’t sure any more where he stopped and Cade began. The orgasms were more like little aftershocks now, jolting through him again and again, but almost pleasurable now. Cade moved behind him, and Jax realized he was finally able to pull away. He felt glad it was gone, but at the same time he felt strangely empty.</p><p>Holding Jax up with one arm, Cade pulled back the covers, and they both crawled in the bed. Jax felt exhausted but still dizzy and needy. He immediately scooted over next to Cade and tried to crawl on top of him. Cade laughed softly and turned him over, spooning him, pulling his back tightly against his chest. “Sleep now.”</p><p>Jax settled in his arms, pushing his butt up into Cade’s groin. His thoughts were tumbling around in his head. He belonged to Cade—truly belonged, and it was a strangely heady feeling. He wondered if it would be this way all the time between them. He wondered too if this meant that Cade loved him, and he turned his head back to ask Cade, but he was already breathing hard, like he was sound asleep. Snuggling closer, he felt sleep stealing over him and let out the long breath he hadn’t realized he’d been holding.</p><p>In the morning, he promised himself. In the morning, Cade would tell him. Cade would say the words he wanted to hear. Not just that he belonged to him, but that he loved Jax too. Jax needed Cade to love him. He wasn’t sure why it was so important all of a sudden, because he hadn’t cared much one way or the other before, but things were different now. He knew that instinctively. They hardly knew each other, despite what they’d just done. But still, something was changing inside him and he could feel it. It was as if something deep within yearned to hear those words—as if without them, he’d never feel complete. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Rayce is wrong—there’s nothing fortunate about this. The bloodlust is unspeakable. The words Cade had spoken echoed in his head. What would happen if Cade couldn’t accept him as his mate, despite his assurances? He’d said his grandmother’s body had betrayed her. She and his grandfather co-existed through the long, lonely years. Was that all Jax had to look forward to? Being Cade’s burden, a heavy weight around his neck, dragging him down? Had Jax indeed jumped out of the frying pan and landed squarely in the fire?</p><p>Chapter Four</p><p>“So when is your cousin supposed to get here?” Gabe asked, looking out the window of the Zack’s office and down the driveway.</p> <p>Zack looked up from his desk and smiled at his mate. “Soon, I think. I talked to Connor last evening, and they stopped in Atlanta to spend the night before driving up here. He said they should be here by lunchtime.”</p><p>Gabe smirked. “Leave it to a wolf to measure time by his stomach. How many are there? Should I tell them down in the kitchen?”</p><p>“I already handled it,” Zack said absently, his gaze dropping back down to his paperwork. Gabe had gotten into the habit of coming to his office while he worked in the mornings to drink his coffee and work on his computer. He was taking correspondence courses from the university, and was almost finished with his latest course in Economics. It was in his core curriculum, a required course, and he hated the damn thing. He usually took any opportunity to distract himself.</p><p>“Is he nice-looking?” he asked. Zack glanced back up, frowning.</p><p>“Who? Mycousin?”</p> <p>“No, the Pope. Of course, your cousin—that’s who we were talking about, wasn’t it?”</p><p>“I guess he is. I don’t know—and why are you so interested? You don’t need to worry about what other men look like.”</p><p>Gabe laughed, swinging his chair around to gaze over at his mate flirtatiously. “Are you already jealous? Damn, he must be good-looking.”</p><p>“Yeah, well, don’t get your hopes up. My cousin Cade has a mate already. A soif de sang, at that. Good looks dorun in the family,” he said with a grin, “and he has a brother, but Connor’s still young enough to embarrass easily, so leave him alone. He wouldn’t know how to handle somebody like you.”</p><p>“What did you mean by that soft thing?”</p><p>“Soif de sang. It means bloodlust. It’s like a blood match, only even stronger. Very rare— actually, I thought it was just a myth. Our grandparents were supposed to have had one, but I always thought it was just family lore.”</p> <p>“Stronger than the blood match?” Gabe shivered. “Damn, that would suck.”</p><p>Zack frowned again, sitting back in his chair. “What do you mean?”</p><p>Gabe smiled and moved over to prop his hip on Zack’s desk. “Baby, you know how much trouble I had with it. If it’s even more intense, God help his poor mate.”</p><p>Zack ran a hand down Gabe’s leg. “Yes, you’re so abused.”</p><p>Gabe smiled. “What is this bloodlust thing anyway? You never mentioned it before.”</p><p>“Supposedly it’s a bond that’s absolutely unbreakable, and compels the mated couple to be together. The two feed from each other, and the wolf’s mate actually becomes a shape-shifter.”</p><p>Gabe raised his eyebrows and Zack nodded. “Pretty incredible, but together they become an alpha pair and rule the pack as a unit.”</p><p>“Oh, I’d like that. You mean the wolf can’t boss his mate around,because they’re both alphas? Shit, this I have to see.”</p> <p>“Apparently, Cade has only just met his mate and is still in the process of forming the bond. It will take time for him to become a shifter. But yes, it should be fascinating to watch as it develops. This kind of thing is really rare.”</p><p>“When will you take Cade to look for land?”</p><p>“As soon as possible. I know he’s anxious to start building, and the weather will get too bad in a few more months. If we don’t start soon, they won’t be able to build before spring.” Still rubbing Gabe’s leg absently, he gazed out the window next to his desk. “The leaves are already turning a little.”</p><p>“Do you think they can find a building spot nearby?”</p><p>“I don’t know about around here. Pack lands are more extensive in North Carolina.” He smiled up at Gabe. “How would you fancy a visit with Nicky while Marco and I help Cade find some land?”</p><p>Gabe grinned. Nicky, the North Carolina alpha’s mate, was his best friend and partner in crime. Nicky was yin to his yang, and he wished they lived closer. “I’d love it. I haven’t seen him or Rory since Tucker’s mating ceremony.”</p><p>“Yes, when the two of you got in that fight, and Marco and I had to separate you.”</p><p>“Just a love spat,” he said, chuckling. “Besides, Nicky started it. And I totally won.”</p><p>The sound of motorcycles coming down the long dirt road onto the property had both Gabe and Zack turning toward the window. Gabe jumped up in excitement. “Oh my God, they’re on choppers. How fucking cool is that?”</p><p>Gabe turned and started out of the room to go downstairs, pulling Zack with him. They went down the big central staircase and out onto the front porch, arriving about the same time the big motorcycle in front of the riders pulled up. There were two people on the bike, and the one in front pulled off his helmet to reveal a handsome man who looked to Gabe to be in his late twenties. Gabe immediately noticed a strong family resemblance to his mate, whom Gabe had long thought to be the handsomest man he’d ever seen.</p><p>This man gave them a charming little crooked smile and levered his leg off the bike to step forward and give Zack a big bear hug. They began to speak to each other in rapid French, as Gabe raised one eyebrow. He had no idea Zack spoke French, especially so fluently. The person on the back of the bike hopped off and removed his helmet and Gabe did a double-take. A beautiful young boy stood there, a little travel-stained, with purplish shadows under his blue eyes. His longish blond hair fell over in his face, and he pushed it back impatiently with a slightly feminine gesture. He noticed Gabe’s intent stare and smiled at him, as if not quite sure of his welcome.</p><p>Before Gabe could speak to him, the man who must have been Zack’s cousin, Cade, turned to him and held out a hand. Immediately the young boy took it and stepped up beside him, his eyes shining as he gazed up at Cade.</p><p>“This is my mate—Jax.”</p><p>Both Gabe and Zack looked at them with surprise, but Zack wasthe first to speak. “Your mate?” he asked, his voice sounding a little shocked. “Good Lord, Cade, do his parents know he’s missing?”</p><p>Jax felt the hot blush stain his cheeks as he ducked his head and moved back a step behind Cade. He didn’t know exactly how Cade would react to what Zack said, and so far, his reactions to most things had not been totally predictable. To his relief, Zack only laughed.</p><p>“Jax is nineteen,” he said, but the big man Cade had called Zack looked at him in disbelief. “Bullshit,” he murmured, just barely loud enough for Jax to hear.</p><p>Cade huffed out a laugh. “I know—he looks much younger, but I checked his ID. Don’t worry. The police won’t be showing up at your door.”</p><p>“Thank Christ,” he muttered. Stepping forward, Zack held out a hand to Jax. He didn’t shake Jax’s hand, just held it warmly between his. “It’s very nice to meet you, Jax.” He turned to an exotically handsome young man standing next to him. “This is my mate, Gabe. Close your mouth, darling.”</p><p>Gabe shot his mate a dirty look and came toward him, pulling Jax in for a hug. He smelled as good as he looked, a faint scent of leather and expensive cologne.</p><p>The older boy instantly fascinated Jax. He looked to be in his early twenties, with black hair and blue eyes fringed with impossibly long lashes. Eyeliner rimmed his eyes, and one gold ring adorned his left ear. It matched a heavy gold collar-style necklace around his throat. He wore a green T-shirt with a logo in red letters across the front that read One Man Wolf Pack, with a picture of a cartoon wolf wearing sunglasses. Other than the fact he didn’t have any visible tattoos, he reminded Jax of a British rocker, with his heavy black combat boots and tight, ripped jeans. He was everything Jax aspired to be. Jax totally expected him to have a Brit accent, but when he spoke, his voice instead had a twang that Jax immediately recognized. “It’s nice to meet you, Jax.”</p><p>“You’re from Alabama,” Jax said. He thumped his chest lightly. “Me too. From Piedmont.” The handsome young man widened his eyes in surprise. “No shit. I’m from Centre,” he said, naming a town only about twenty miles north of Jax’s home town.</p><p>They grinned at each other and Gabe shook his head, slinging an arm around the younger boy’s shoulders. “And just mated to a wolf. Honey, you’ve come to the right man to clue you in.”</p><p>Zack pulled on his arm. “Don’t start,” he said in a low voice, and Gabe let go of Jax with a laugh. Right away, Jax felt better about this new place Cade had brought them to. He glanced around to see the others had all gotten off their bikes, and Mason was still standing next to Connor. They’d seemed to become close in the past couple of days. Jax held out a hand to him and he came willingly.</p><p>“This is my little brother, Mason,” Jax said, looking mostly at Gabe, because he was much less intimidating than the big man standing next to him.</p><p>“Cool,” Gabe said. “Nice to meet you, Mason.” He looked around the crowded porch and grinned. “You guys must be hungry. Come on in and have some lunch.”</p><p>Everyone followed the two hosts into the big house, and Jax looked around, impressed with the huge room. It reminded Jax of a hotel lobby, in a way, with sofas and chairs in small seating clusters, and a huge rock fireplace along one wall, the rocks stretching up all the way to the top of the vaulted ceiling. Jax and Gabe led the way to another large room off this one, set up with tables and chairs and a buffet table under the picture windows loaded down with food. Cade steered Jax and Mason to the table Zack indicated. Everyone else filtered in and found a place, and Zack stood up to speak to them. “Everyone please help yourselves. I’m afraid we don’t have accommodations for everyone inside, but we have some sleeping tents set up out back for you, and of course, you’re welcome to use all of the facilities in here.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade nodded. “We’ll try to be out of your hair soon, Zack. Just as soon as we can find some land to build on, we’ll move camp there and get to work. In the meantime, we thank you for your hospitality.”</p><p>Zack smiled and said something in French, and everybody laughed—all except for Gabe, who winked at Jax and shrugged, rolling his eyes. He immediately put Jax at greater ease. Cade was pulling on his arm then, urging him to follow him to the buffet. Zack and Cade went first, filling their plates. Jax pulled back a little. “Let me get Mason,” he said, and Cade shook his head.</p><p>“Alphas eat first,” he said quietly. “You’re the alpha mate now, Jax.” When Jax still hesitated, Cade gave him a stern look. “It’s protocol. Rayce will help Mason.”</p> <p>As he watched, Rayce said something to Mason, who followed him to the buffet. Everyone else filed in behind them.</p><p>Jax moved distractedly along behind Cade, surprised to look down and see him heaping food on Jax’s plate as well as his own. “I can’t eat all that,” he said, but Cade ignored him, continuing to fill both their plates until Jax jerked his away and stalked back to the table. He knew he’d never be able to eat even half the amount Cade had put on his plate, and he hated to waste food. He’d gone hungry too many times in the past.</p><p>Mason sat back down beside him and Cade saw that he had mostly pizza and desserts. He glanced over at Rayce. “That’s what he wanted, cher,” Rayce said with a Gallic shrug. “He can eat healthy at dinner tonight.”</p><p>Jax grinned and looked down at his own plate, overflowing with meats and salad and all kinds of vegetables. He reached over and snagged a piece of Mason’s pizza. “Looks good to me,” he said, and noticed Cade frowning down at him.</p><p>“You need to stop stealing food off your brother’s plate and eat your vegetables. You eat too much junk.”</p> <p>“How do you know what I eat?” he whispered back furiously, but Cade was already ignoring him, deep in a conversation with Zack. They were speaking entirely in French again. He glanced up to meet Gabe’s sympathetic gaze.</p><p>“I don’t know any French personally,” he said with a shrug. He grinned again. “Except voulez-vouscoucher avec moi, c’est soir?”</p><p>Jax laughed.“Me neither,” he admitted. He leaned closer to Gabe and lowered his voice.</p><p>“But this morning, I’ve noticed I almostdo. It’s like it’s right there at the edge of my brain or something.”</p><p>Connor, who sat on Mason’s other side, spoke up right away. “It’s the bloodlust. You two mated last night, didn’t you?” he said, around a forkful of green beans.</p><p>Cade heard that part of the conversation and whipped his head around. “Connor. That’s inappropriate and none of your business.”</p> <p>“Well, God, Cade, it’s not like you two were quiet about it. Shit, half the motel heard you.” “That’s enough,” Cade said firmly, and Connor shrugged.</p><p>“What does he mean, Cade?” Jax said urgently. “Not about...you know. But about the French?”</p><p>“He means that once our bond is established, you’ll know French and everything else that I know. Just as I will know everything that you do. It takes a while to fully kick in, I guess.” Cade looked over at Zack. “I suppose I need to call my father and see what he knows about all this. Our grandparents had the bloodlust, everyone said.”</p><p>Zack nodded thoughtfully.“Maybe. My dad never told me much about it either, but then I didn’t even believe it was real. I thought it was just stories they made up about grand-mère and grand-père. We left Louisiana when I was just a little kid and only went back a few times for funerals and weddings. I never knew them well at all.”</p><p>“None of us did, really. They were so old by the time we were born. And neither of them talked much about it. ”</p><p>“Or anything else for that matter,” Connor said.</p><p>Jax looked up at Gabe. “So you and your mate don’t have this—bloodlust thing?” “No, thank God. We have a blood match,though, and that’s bad enough. If Zack was any more up my ass I wouldn’t be able to walk.”</p><p>Jax had just taken a big swig of the milk Cade had given him and almost spewed it across the table. He heard Cade chuckle beside him and cast a worried glance over at Zack, expecting him to be furious. Instead he was smiling. “Charming visual, Gabe.”</p> <p>Gabe grinned back at him, winked and took a huge bite of his own pizza, toasting his mate mockingly with his iced tea. Jax glanced up at Cade, wondering if he’d ever have such an easy rapport with his own mate.It didn’t seem likely.</p><p>“I might remind you there’s a child at the table,” Zack continued, but still without any heat in his voice.</p><p>Jax glanced down at Mason, who was still shoveling in his food like he thought it might be snatched away. He knew his little brother had certainly heard worse, and the thought made him sad. He turned his attention back to Gabe. “So what exactly is the difference between this blood match and bloodlust?”</p><p>Gabe shook his head. “Beats me. I never even heard of the bloodlust before this morning.” “The difference is what we’re not sure about, Jax,” Cade answered. “All we have to go on is old stories and wild rumors. The blood match compels a wolf to be with a mate, not necessarily of his own choosing. His blood calls to that one person, no matter who it might be. During the mating, the wolf bites his mate, and the bond is formed by a combination of the mating itself and the bite. From that time on, the wolf can read the mind of his mate, in short snatches, if the distance isn’t too great.”</p><p>“It’s mostly images,” Zack continued. “Our wolves don’t think in language, really. For example, right now, I can taste pepperoni and hear Queen in my head. Feeling retro, baby, or channeling Freddie Mercury today?”</p><p>“Shut up,” Gabe said cheerfully, taking another bite of pizza.</p><p>“Well, your outfit today did suggest it,” Zack said conversationally, but smiled at him, even when Gabe raised his middle finger.</p><p>Cade looked back and forth between the two with narrowed eyes, but didn’t comment. He did, however, point at the green beans on Jax’s plate. “Eat,” he told Jax. “You can chat with Gabe later.”</p><p>Gabe snorted. “Alpha pair, huh? Right...”</p><p>Zack gave him a quelling look. “Gabe? You do realize you’re speaking out loud, don’t you?”</p><p>Gabe actually blushed a little as he glanced over at Cade. “Sorry,” he muttered, barely loud enough to be heard.</p><p>Cade nodded. “It’s all right. It’s just that Jax and Mason weren’t eating well when we met them. They both still need to gain back a few pounds, that’s all. I’m just looking out for him.” Gabe nodded. “Oh, it’s none of my business.”</p><p>“No, it certainly isn’t,” Zack said. “Not that it’s ever stopped you before.” Cade tried not to smile at the look on Gabe’s face, continuing his explanation. “So anyway, the bloodlust is the same, only even more intense. I actually have to have Jax’s blood to survive, just as he has to have mine, and the mind connection is a two-way one. That’s all I’m sure about so far. That and the fact that it makes us ill to be separated. Or at least that was the case for our grandparents.”</p><p>“It’s also said that Jax will be able to shift into a wolf and his wolf will be alpha, as you mentioned,” Zack added. “I think Jax and Cade are still waiting for that.” He turned to Cade. “Now, if you feel up to it, I thought we’d travel over to see Marco tomorrow. His place is only a little over an hour’s drive from here. They have more available land than we do here, and he may know of some good building spots.”</p><p>“Sounds good,” Cade replied. “The sooner the better, and I haven’t seen Marco in ages.” “Marco is the North Carolina alpha,” Gabe told Jax. “His mate is Nicky, and he’s great. He’s my best friend.”</p><p>“Yes,” Zack said. “Ah, Nicky. And you thought Gabe is spoiled rotten. Wait until you meet Nicky.”</p><p>Cade’s lips twisted, trying to hide a smile. He shook his head politely. “No, I don’t think that at all.”</p><p>Zack raised one eyebrow. “Please. I lost the upper hand a long time ago with Gabe, and I know it. With Marco, I really don’t think he ever had it, though he keeps trying.” Gabe smirked, and the conversation continued all around Jax, but he stopped paying close attention. He hadn’t gotten much sleep at all the night before because of their mating, and even though Cade made him soak in the tub that morning before they left, he was sore and achy and dead tired. He decided to close his eyes for just a second, and the next thing he knew he heard Zack speaking to Cade in a loud voice. “Better catch him, Cade. Your mate is about to take a nap in his mashed potatoes.”</p><p>Cade looked out the window as they climbed the mountain, heading toward Marco’s lodge. Zack was driving with Gabe sitting next to him in the front seat of the big SUV, while Cade and Jax sat beside each other in the back seat. They’d left Mason behind back at the lodge and Connor said he’d look out for him. He needed the rest.</p><p>Cade glanced over at Jax, pleased to see he looked much more rested this morning and the color was back in his cheeks after a good night’s sleep. He surveyed what he was wearing a little more disapprovingly though.</p><p>Jax was wearing his own version of Gabe’s tight, ripped jeans, and his shirt was too small. As soon as he could go to town, Cade intended to buy Jax some more new clothes, including jeans that didn’t look like a homeless person’s. He’d apparently borrowed some of Gabe’s eyeliner too at some point that morning, and though Cade didn’t find it in the least attractive, Jax had seemed so nervous when he’d reappeared wearing it that Cade hadn’t had the heart to express his disapproval.</p><p>They’d both slept well the night before, and though Jax had cuddled up next to him, he’d managed not to make love to the boy like he badly wanted to, knowing how exhausted, not to mention sore, he must be. He’d settled for spooning him all night, waking up with a rock-hard erection. Jax’s hand resting on his thigh at the moment wasn’t helping any, especially the way he kept sliding it nervously up and down between his knee and his groin. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade looked out the window, struck again at the beauty of the mountains. He was glad he’d made the decision to come here. He couldn’t see how he could ever get tired of looking at mountain vistas like the ones out his window.</p><p>His more distant cousin, Marco, lived on a large estate called Mountainwood. From what Zack told him, his lodge was massive, with additions branching out from the main lodge. The lodge itself lay some ten miles off the main road, back against a mountainside. Cade hadn’t seen Marco since they were in their teens, but he remembered him as a nice guy, popular with all the girls. He wondered if, like him, Marco preferred females. Or he used to, anyway. Not that it mattered much to either of them anymore, he thought ruefully.</p><p>Jax moved his hand higher on Cade’s thigh, and Cade couldn’t resist a quick squeeze of Jax’s decidedly un-female and very bulging groin. Jax gave a little squeak, and Cade lowered his head to whisper in his ear. “Behave. It’s bad enough I won’t be able to be alone with you until tonight.”</p> <p>Jax smiled and put his head on Cade’s arm. Cade’s mind was instantly flooded with images of their lovemaking on the night they mated for the first time. He shifted uncomfortably and whispered to Jax again. “Stop it, or I’ll tell Zack to stop this car, so I can take you out into the woods. You won’t be teasing so much when your backside is itching from poison ivy.”</p><p>“Yes, Cade,” he answered meekly, but a few of the images persisted. He frowned at the back of Gabe’s head. He had a very bad feeling that Gabe, and from what he heard so far, this Nicky were going to be bad influences on his little mate.</p><p>“There’s Marco’s lodge,” Zack said, and Cade sat forward eagerly. Up ahead, he could see the lodge, situated on a little rise. As Zack had told him, the main lodge was made of handscraped logs, stained a dark brown, and it rose some three stories high. It was huge, made even more impressive by the two wings that angled back from either side of it. These were additions, according to Zack, but wellconstructed ones that looked almost as if they’d been built at the same time as the main house. The driveway circled around in front, and as they pulled up, Cade saw Marco standing on the front porch to meet them.</p><p>His cousin was probably six feet five inches tall and impressively muscular, but the one that drew his immediate attention was the young man standing next to him. He was much shorter than Marco, only around five feet ten or so, with a lean, yet muscular build. This must be Nicky, Marco’s mate. His hair was as blond as Jax’s, though much curlier, and his eyes were the same bright blue. They could almost have been brothers, except for the man’s face. As cute and young as Jax was, he still looked masculine. This man’s face was heart-shaped and pretty as a girl’s, with a delicate nose and full, luscious lips. Only a strong jawline kept him from looking totally feminine. His eyelashes were sinfully long and thick, and he exuded sex appeal, though Cade was mostly immune to it now. Still, if he hadn’t met Jax, he knew he would have taken more than a second look.</p><p>They got out of the big SUV and Zack shook hands with Marco, who shook Cade’s hand and then pulled him into a one-armed hug. Beside them, Nicky and Gabe were embracing, their talk lively and loud. Gabe put out a hand and drew Jax over to stand beside him. Cade noticed and looked over at them.</p> <p>“Nicky, this is Jax. He’s not really twelve, though I know he looks it. He’s Cade’s new mate.” Nicky gave him a beautiful smile and pulled Jax in for a hug . That’s when a loud snort sounded behind him and the boys turned to face a cute young man with curly brown hair. He was standing next to one of the wolves. He looked from Gabe to Nicky and back to Jax. “My God— Nicky and Gabe have a love child. How come I never knew that?”</p><p>Cade surveyed the three younger men with a frown. Gabe and Nicky were approximately the same size and almost looked like negative images of each other, with Nicky blond and fair and Gabe tanned and brunet. Nicky was dressed similarly to Jax, with tight jeans and a button-up shirt, while Gabe was dressed as outrageously as ever. His T-shirt this morning was red and had the words Easy Lay written across the front. In between the two stood Jax, his clothes almost as straightarrow as Nicky’s, except for the ripped jeans and the dark eyeliner. Though obviously younger, he really did resemble some kind of cross between Nicky and Gabe.</p><p>Nicky had whirled around to face his tormentor, and fixed him with a look that would peel paint. “Well, thank you, Rory. Coming from you, we’ll take that as a compliment.”</p><p>“Really?” the brown-haired boy replied. “Then I must have said it wrong.”</p><p>Nicky turned back to Jax, mumbling stupid wolf-boy, mostly under his breath. “Jax, this unfortunate individual is a member of Marco’s family. His name is Rory, but you have my permission to ignore him completely. God knows I try to.”</p><p>“Nicky, Rory,” Marco said, a look of irritation on his handsome face. “Not in front of our guests, please.”</p> <p>Jax giggled and put out a hand to the attractive boy. Before taking Jax’s hand, the young man glanced up at the wolf beside him, who nodded permission curtly before Rory stepped forward to take Jax’s hand. “Hi, Jax. Welcome. This is my mate, Casey.”</p><p>As they all moved inside the huge lodge behind Marco, Cade made sure he pulled Jax over to walkbeside him. Jax wasn’t like these other mates, and it was time he started distancing himself a bit.</p><p>Like Zack’s lodge, there were small groupings of sofas and chairs, and Marco led the group over to one of these by the massive fireplace. Cade sat down with Jax on one of the sofas, with Zack and Marco on the one facing them. Gabe perched on the arm of the sofa next to Zack and Nicky flopped down in one of the huge, overstuffed arm chairs. Casey and Rory stood by the fireplace.</p><p>“Zack tells me you’d like to look around for land with the idea of building here,” Marco said.</p><p>“Yes,” Cade said, leaning forward. “I refused to challenge my father for leadership, as Zack probably told you. When I left, some of the pack came with me. As their alpha, I’d like to do what Zack did—start my own branch of your pack, if you’ll have me.”</p><p>Marco smiled at him warmly. “You don’t even have to ask, Cade. We’re family, even if we haven’t seen each other in a while. There’s plenty of land north of here, up around the Nantahala National Forest. That’s all government park land, of course, but some of our own land adjoins the forest. A lot of it is pretty remote—no roads, just mountain trails we’d have to access by all- terrain vehicles. As a matter of fact, the area I have in mind is so remote, you’d have to take the ATVs as far as you could and then you may have to walk in the rest of the way, depending on the trail conditions. But the spot I have in mind has good water and drainage, and a great view. Beautiful country up there. When the rains come heavy, the creeks along the trail get too deep and rapid for the ATVs, though. That’s the only problem I can see with it. Getting building supplies in there would be a challenge, for sure.”</p><p>Casey nodded. “The logs could be cut on-site, but the rest would have to be taken in by the ATVs. It’ll take time, but it can be done, if the weather holds out. We could build a bridge over the deepest of the creeks you’re talking about, and take supplies in that way. It’ll take a little time to bring them all in though. You wouldn’t be able to finish it up before spring.”</p><p>“What I’d suggest,” Marco said, “is finding your spot and clearing it, get your foundation ready. Then work on building that bridge and getting some building materials up there. You can cut some of your logs before the weather gets too bad. My beta, Ian, was in charge of building all that you see around here. He’s excellent with construction, and he’ll be at your disposal. Between us and Zack, we can accommodate your group through the winter months. I’ll be glad to give you some men to help. It shouldn’t take too long.”</p> <p>“That’s more than generous, Marco. I appreciate it,” Cade said.</p><p>Zack nodded. “I’ll send some of my guys too. Once we have the materials, it’ll go up quickly.”</p><p>Marco nodded. “Okay. Now we need to take you up to see this place. See if it’s what you have in mind. We can get an early start in the morning, if you’re up to it.”</p><p>Cade nodded. “Absolutely.” He glanced down at Jax and a slight color came into his cheeks. “Uh, do you know how long we’d be gone?”</p><p>“A couple of days, probably. No more than three.” Marco glanced over at Zack and then back at Cade, raising one eyebrow inquiringly. “Problem?”</p><p>Cade shifted uncomfortably on the sofa. “I-I’ll have to take Jax with us then.”</p><p>Marco looked confused. “I’d like to move fast, and we’ll probably have to hike some of it. I think it might be best if he stays here with Nicky and Gabe.”</p><p>Zack leaned over and murmured in Marco’s ear and his eyes widened. “Oh, I see. Damn. Well, of course, then. We’ll just have to make allowances for him.”</p><p>Nicky, who had draped one leg over the arm of the chair and was staring idly out the window, rolling a curl up on his finger, suddenly perked up. “Why? What is it?” he asked, breaking in on the conversation.</p><p>Marco glanced over at him with a slight frown. “I’ll explain later, Nicky.”</p><p>Nicky regarded Gabe withraised eyebrows. “They’re new mates, Nicky,” Gabe said. “They have a different kind of blood match too. Zack said it was called soif de sang, if I’m pronouncing it right. It means bloodlust, and they have to stay together almost all the time.”</p><p>“What? What is that, Marco? How come I’ve never heard of this before?”</p><p>“We’ll discuss it later, Nicky,” Marco said, but leaned over to touch his arm, as if to soften the words.</p><p>“Gabe,” Zack said, a hint of warning in his voice. “It’s not your place to talk about other people’s relationships.”</p><p>“It’s okay,” Cade said.</p><p>“No,” Marco said. “It’s not. Nicky can be inquisitive. Sometimes too inquisitive. Zack’s right—it’s none of our business.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nicky gave Marco a dark look before turning to Cade and giving him a brilliant smile. “I apologize, Cade, if I appearto be nosy. I really don’t mean to.”</p><p>A snort from Rory caused everyone to look up at him. “All evidence to the contrary,” he said.</p><p>When Marco gave him a sharp look, Rory covered his mouth with his hand and dropped his gaze. Casey poked him in the side with an elbow.</p> <p>Nicky narrowed his gaze, but continued. “I just never heard of this bloodlust before. What is it? What do you mean by a different kind of blood match?”</p><p>“I said we’ll discuss it later, Nicky,” Marco said firmly, and Nicky subsided back into his chair, casting Marco a furious glare. Marco turned back to Cade. “Let me show you to your rooms,then, so you can get settled in for the night. We’ll get an early start in the morning.”</p><p>“I want to go along too,” Gabe said, and Nicky straightened up again.</p><p>“Yeah. Me too. If Jax and Gabe get to go, then why can’t we all just go? I really need a little break, Marco.”</p><p>“From what, Nicky?” Rory said. “Those magazines you read all the time getting to be too heavy to carry up to your room?”</p> <p>“Put a muzzle on your pup, Casey, before I swat him on the nose with a newspaper,” Nicky said, clenching his fists.</p><p>“Quiet, both of you,” Marco said firmly, and glared at the two of them.</p><p>Zack took Gabe’s hand in his. “Since Jax is going along, Marco, I don’t really see the harm in Gabe going too. You make up your own mind about Nicky, of course.” He looked up at Gabe. “As long as you realize we’ll be camping rough. We’ll have some small tents and sleeping bags, but that’s about it.”</p><p>Gabe nodded. “You know I’ve done that before. I’ll be fine.”</p><p>Nicky spoke up beside him. “I have too, and not all that long ago.” He gave Marco a significant look. “I was on my own too, with only a small tent. You may remember that, Marco.”</p><p>Marco looked uncomfortable. “Yes, baby, I remember. If Jax and Gabe are going, you can go too. Just know thatwe’ll be moving fast. Since you and the other mates are coming, we’ll take the ATVs as far as we can, but we’ve had a lot of rain lately. The creeks will be swollen, so we may even have to hike the last leg of the trip.”</p> <p>“I can do that,” Nicky said confidently.</p><p>Marco looked a little dubious, but he nodded and turned back to Cade. “So it’s settled then. We’ll leave early in the morning, right after breakfast. We have plenty of camping gear, so don’t worry about that. ” He stood up. “Rory, could you show our guests to their rooms? And Nicky, you can come with me and help me start planning what we’ll need to take on the ATVs.”</p><p>Everyone stood up and began to drift off in different directions. Cade stopped to talk to Marco on his way out of the room and reached down for Jax’s hand. He was absent-mindedly rubbing his thumb over the back of it, when he felt Nicky’s intense gaze on their joined fingers and glanced over at him. Nicky looked up and smiled back at him brightly enough, but it seemed to Cade that the smile didn’t quite reach those sapphire eyes. Nicky was standing close to Marco, but Cade had a feeling there was some kind of invisible gulf between them that was pretty wide.</p><p>Cade moved toward the stairs, following Rory and put an arm around Jax’s waist, pulling him close to his side. When they got to the top of the landing, he glanced back and saw Nicky still standing below them, gazing up at them with a look almost of longing before he turned and followed Marco from the room.</p><p>Chapter Five</p><p>Jax lay on his back in the middle of the bed, looking up at Cade. Mason had been given an adjoining room and he was sound asleep. It was close to midnight, and they’d stayed up much later than they’d meant to, considering how early they had to get up in the morning. There had been wine with dinner, though Cade would only let him have a sip or two out of his glass. Jax didn’t really mind—he didn’t like the taste anyway, and it made him feel good, like Cade was looking out for him. He wasn’t used to anyone being possessive over him or acting like they cared one way or the other, really, so while it felt different to have Cade boss him around, and he wasn’t sure if he liked it or not, a part of him loved every second of it.</p><p>They’d retired early, leaving the other couples at the table, Cade claiming he was still tired from traveling. Jax thought the real reason was so Cade could be alone with him. Almost as soon as he’d settled Mason and walked back into their room, Cade pushed him against the wall and kissed the shit out of him. He ended up on his back in the bed, looking up at Cade. Jax watched Cade as he splashed lube into his hand and over his rigid cock, his eyes never leaving Jax’s face.</p><p>“Gonna make love to you, Jackson Cody Monroe,” he said, almost purring at him, sliding his hand down Jax’s chest and onto his stomach, just beneath his belly button. He pressed in a little and his hand massaged him gently. “Sweet boy. There’s no one else for you but me. Only me, cher.” His hand trailed possessively lower, along the line of Jax’s hip, and a shiver ran through Jax as Cade brushed his skin.</p> <p>“I love you,” Jax said, and Cade’s eyes changed as he bent to kiss him. Jax noticed Cade didn’t say the words back to him, but his breathcame harder at the first touch of Cade’s lips. This feeling had been growing in him since their time together in the motel in Atlanta, and now it felt like the feelings might burst out of him soon and go flying around and around the room like a deflating balloon if he didn’t say them. He knew it was quick—maybe too quick, but he didn’t care. He wasn’t even sure if he knew what the words meant, not when he said them to someone like Cade. Mason was the only other person he’d ever said the words to, not even his mama— maybe especially not his mama. But Mason was his little brother, and his responsibility. It was easy to love Mason, with his soft doe-eyes and his trusting little hand that stole into his when he was near him. Cade was different. Butthen Cade hadn’t said the words back.</p><p>He knew it shouldn’t bother him. That stuff was for girls, right? Men didn’t talk so much about love. Cade leaned over him and gave him another kiss, a longer, deeper one this time. He rested his weight partially on top of Jax, holding his weight up off him with one hand, while the other slid into Jax’s hair. Jax spread his legs under him and then moved them around Cade’s waist, squeezing his ribs with his knees. Cade hooked his arms under Jax’s knees and pressed himself against him, rubbing his thick cock against Jax’s.</p><p>Jax could actually feel his heart throbbing and wondered if Cade could feel it too, feel this excitement thrumming through him. Cade leaned over and bit into Jax’s neck, the sharp incisors slicing in almost without pain, but he felt it like a throbbing that moved from his heart down to his groin. His cock twitched, and he strained to get closer. He desperately needed Cade to be inside him and he pushed up against him, moaning softly.</p><p>Pleasure curled again in his groin when Cade licked at the wound on his neck to close it up and pulled his head away, his lips stained red with Jax’s blood. He pushed himself inside Jax and Jax grunted with the pain. Then Cade rocked against him, easing himself in, flexing his back and hips to start a rhythm. “I need you, sweet boy, mon cher, mon ange.”</p><p>Jax knew he needed him —he could read it in his mind and in every move he made against him, in the very air they breathed. He pressed his face against the hollow of Cade’s neck and clenched hard at his shoulders. “I love you,” Jax whispered again against the skin of his throat, and he didn’t even care if he sounded like a sap. He didn’t even care if Cade didn’t say it back— it didn’t make it any less true.</p><p>Cade rocked his hips and Jax lost himself to the motion. Cade reached for his cock and wrapped his hand around it, moving up and down in a sensuous, steady rhythm, his hand sliding slick between their bellies.</p><p>The movement of his hand, the weight of his body, the rocking and thrusting of his hips built up around him until he thought he’d go crazy with need. His orgasm came over him with a crash, his entire body seeming to tighten and spasm as he came, crying out Cade’s name. Cade yelled out as the impact of Jax’s emotions hit him hard. His breathing came in harsh, sharp gasps as his own orgasm overtook him. His body seemed to lock up, and he rocked in short thrusts even as he climaxed. Cade sagged over on top of Jax, pushing him into the mattress. An aftershock made him shudder and groan again, as he pressed his lips to Jax’s for a brief moment before collapsing down on him. He pulled his arm up to his mouth and bit down, making sure the blood was flowing well before he pressed his arm to Jax’s lips. Jax sucked it in, looking up with shining eyes at his lover.</p><p>Had anything ever been this perfect in his life before? Jax pulled hard on Cade’s wrist, the honeyed liquid like molten lava on his tongue, burning a path right down his throat, all the way to his heart. He would make Cade love him. He’d be perfect for Cade and show him he hadn’t made a mistake in taking him for his bloodlust mate. He wouldn’t let Cade regret it like his grandparents had done when they had this chance. And even if he didn’t love him, it was okay. He loved enough for both of them, and it would be fine. It had to be.</p><p>The next morning dawned bright and sunny, a welcome change after the rain and clouds from a few days before. The morning air was cool, though, so Jax had a lightweight jacket on, along with a baseball cap, jeans, and tennis shoes.</p><p>Marco and Nicky led the way on a big six-wheeled vehicle, painted in camo colors. It had a bench seat that accommodated two passengers, with a cargo rack on the back that now held their camping equipment. It was designed to even go across shallow ponds and streams, and in the winter, Marco had told Cade, they could add tracks to it for deep snow. It was a real workhorse, and they would use ATVs like this one to transport some of the building materials when the time came. From time to time Nicky would glance back at the others, a big grin on his face as he bounced along on the rough trail. Jax began to use him as a kind of barometer for the roughness of the trail. Whenever he saw Nicky bounce up and grab the handrails he knew to tighten his hold on Cade’s waist. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade and Jax rode on a smaller, four-wheeled vehicle, with Jax perched up behind him, and Zack and Gabe followed in one of the sixwheeled ones much like Marco’s, only painted a bright blue. Gabe was dressed more like Jax and Nicky this morning, forgoing the eyeliner and gloss. He still looked exotic though, with his almost blue-black hair and icy blue eyes. He had an arm tightly wrapped around Zack’s waist, and he’d been quiet all morning. Jax suspected he’d had a bit too much wine to drink the night before at dinner and was paying the price this morning.</p><p>They traveled up a wide mountain trail for several hours, and it got steeper and narrower as they climbed. Thick undergrowth lined the path, rambling over rocks and fallen trees. The trail grew more rutted than before and it was muddy under the deepest shadows of the overhanging trees. Marco hit one of these muddy spots once and spun around a hundred and eighty degrees. Cade put on the brakes to avoid running into them and slid off to the side of the trail. Behind them, Zack was able to slow down and come to a stop as Marco straightened out and got going again.</p><p>Another mile or so up the trail, Marco pulled off into a wide clearing. Cade pulled up beside him.“Y’all go on up to that tree and pull off, and we’ll be right behind you. We’ll stretch our legs a little. Maybe have a little lunch.”</p> <p>Cade nodded and pulled up the trail, angling the four-wheeler over by the tree and turning off the engine. Jax hopped off the back and they waited for the others to join them. Marco arrived and pulled some sandwiches and water out of one of the bags on his ATV, passing them around. The fresh air had given Jax an appetite, and he bit down into his turkey sandwich and moaned with pleasure. Cade bumped his shoulder, leaning over to speak softly in his ear. “Don’t make that sound, or I may have to take you behind one of those trees.” Jax laughed up at him, thinking he’d never been this happy before. He saw Nicky watching them, an odd expression on his face.</p><p>After eating, Nicky stretched out on his back on the grass, and Gabe flopped down beside him. Jax drifted over to them while Cade, Marco and Zack talked in low voices by one of the vehicles.</p><p>Nicky glanced up when Jax sat down beside him. “I like to watch you and Cade together. It’s sweet. Reminds me a little of me and Marco a few years ago. Marco and I used to be in love like that.”</p><p>Jax looked at him in surprise, and Gabe punched him in the arm. “Don’t say that. I know you’re crazy about Marco.”</p><p>Nicky sighed. “Am I? Sure, of course I am. But it’s not the same, is it? They have the bloodlust, and we don’t have anything at all anymore.”</p> <p>Gabe sighed dramatically. “It’s kind of a long story, Jax, but Marco and Nicky lost their blood match and even separated fora while. Marco’s crazy about him, but sometimes Nicky gets like this. Don’t pay him any attention.”</p><p>Nicky smiled and punched Gabe good-naturedly, but then stared off into the distance, looking out through the trees where the tops of the mountain ridges could be seen, rolling out in a blue haze for miles. The other men drifted over to them and sat down beside them, Cade stretching out his long legs next to Jax. Zack sat down behind Gabe and let Gabe use him as a backrest. He started rubbing Gabe’s temples, murmuring in his ear, confirming Jax’s suspicion that Gabe was suffering from a bit too much indulgence in the wine the night before. Marco fell down beside Nicky and whispered in his ear. Nicky nodded at whatever he said, but continued to stare off distractedly at the mountain vista. Jax felt a little uneasy, but he wasn’t sure why. Nicky said he lost the blood match? Was such a thing possible with him and Cade? If it happened to them, would Cade even stay with him?</p><p>Cade pulled Jax down on his chest. “Stop thinking so hard,” he complained softly. “I can’t even rest for all the chatter in that head.”</p><p>Nicky stood up restlessly. “I think I’ll go back down to the stream, Marco. Stretch my legs a little.”</p><p>Gabe stood up beside him. “I’ll go along.” No one objected, so the two young men set off back down the trail some fifty yards to the stream they’d just come through as the others dozed in the shade.</p><p>Some ten minutes had passed when they heard Nicky’s voice calling out in excitement. “Marco, come quick!”</p> <p>His voice had barely stopped echoing around the clearing before Marco leaped to his feet, followed closely by Zack. Jax jumped up too, but Cade grabbed his hand and thrust him behind him to slow him down as Marco and Zack ran back toward the stream.</p><p>“Slow down, bud. If someone’s hurt, we’ll be in the way. If it’s some kind of trouble, I don’t want you in it.”</p><p>“I can take care of myself, Cade.”</p><p>Cade tightened his lips as he looked down at him. “But you don’t have to. That’s my job now.” He let go of Jax’s arm, but signaled to him to go cautiously.</p><p>By the time he and Cade made it to the others, Marco was crouched down at the edge of the stream with Zack standing behind him. Both men wore matching frowns.</p><p>“What is it?” Cade said curiously.</p><p>“Someone passed this way, but not too recently. Maybe a week ago, before the rain. This track is up under the leaves of this bush, so it was preserved. What bothers me isit wasn’t one of my pack. None of them have used the ATVs recently up here. All our land is posted and wellmarked, so there can’t be any mistake over boundaries. Someone is deliberately trespassing. ”</p><p>Marco pointed toward a tire mark at the edge of the stream. It was dried out and the edges were crumbling inward. It was mostly covered by some bushes growing by the stream. Nicky discovered it when he was picking some of the berries on the low-hanging bush. Not only was someone trespassing, but ATVs and all motorized vehicles were illegal on the public trails as well. A track like this was highly unusual since the Hunters had been eliminated. Anyone who was on an ATV up here was up to no good, and it was making the wolves uneasy. Their trails were wider than the public trails, which would have been way too narrow for the vehicles. Their gammas rarely used them to patrol the vast property they owned, however, preferring instead to run the property lines.</p> <p>“Could be bear hunters or moonshiners. Even somebody trying to grow their own little patch of marijuana up here. I’ll send some men up to look around when we get back. In the meantime, keep your eyes open.” Marco turned to Nicky and Gabe. “And you two stick close. No more wandering off on your own.” He reached for Nicky, who went willingly to stand beside him where he knelt on the ground. “I knew I should have left you at home.”</p><p>Nicky frowned, but fidgeted uneasily. “You don’t think it could have anything to do with Jeremy Tate, do you?”</p><p>Marco turned his head sharply, but stood up right away to sling an arm almost too casually around Nicky’s shoulders. “No, I don’t think so. No need to jump to conclusions. There’s been no sign of him for months.”</p><p>Zack stood closeto Cade and Jax to explain. “Tate is a crazy son of a bitch who attacked Nicky and Tucker, the Tennessee alpha’s mate, a few months ago. He was a doctor down at the Brevard hospital and shocked the hell out of all of us. He escaped after the attack, but there have been rumors and trouble over in Tennessee with some rogues who may have teamed up with his group. At least the rumors were that they were headed this way.”</p><p>Marco shook his head. “All speculation. We don’t know that for sure. I’m betting that neither Tate nor those rogues show their faces around here.”</p><p>“Not if they’re smart,” Gabe said softly.</p><p>Marco nodded grimly and squeezed Nicky’s shoulders. “Let’s not indulge in any wild speculations over one stray track. Like I said, it could be anything. Most likely bear hunters, and we can eliminate that threat easily enough with extra patrols.”</p><p>Zack turned away and headed back to the vehicles. “We’re an hour or so behind schedule, boys. Let’s make it to the site and set up our camp. Then two of us can go out scouting around while one of us guards the camp.” He looked over at Cade. “That’ll probably be you, since you have Jax to worry about.”</p><p>Cade nodded, but Jax felt his skin flushing. “I can take care of myself,” he reminded all of them. No one answered him, but he could literally feel the waves of disbelief rolling off the three wolves. He glanced over at Nicky and saw him shrug in sympathy. He stepped up beside Jax.</p><p>“Whether you can or not makes no difference to them. They’re all so alpha there ought to be special words to describe them. Arrogant and overbearing come close, but don’t quite capture the depth,” he said, with a sideways glance at the wolves. “Don’t even argue—it’s a waste of breath.”</p><p>He walked off toward the ATVs and Jax saw Cade frowning after him. Marco was shaking his head as Nicky walked away.</p><p>“Cold tonight,” Nicky said, pulling his jacket more closely around his shoulders. “Is it?” Marco said distractedly, adding a few more sticks to the campfire as Nicky held put</p><p>his fingers toward it. Marco never seemed to suffer from the cold like Nicky did. They’d reached the building site in the afternoon and spend some time setting up the tents. Afterward, Zack and Marco went out ‘for a look around,’ but came back an hour or so later, saying things seemed quiet enough. No more sign of any intruders.</p><p>The others had retired for the night, leaving Nicky and Marco by the fire. Nicky scooted closer to Marco’s big body and leaned against him. He smiled down at Nicky and put a comfortingarm around him. “You’ve been brooding about something all day, baby. Tell me what’s on your mind.”</p><p>“I’m not brooding.”</p><p>“Okay, let me rephrase that. You’ve been a jerk all day.”</p><p>Nicky turned a surprised face to him, and then felt a slow heat travel up to his cheeks. “Sorry. I didn’t mean anything by it. It’s nothing.”</p><p>“Shit, Nicky. Almost every word out of your mouth today has been a dig at the wolves.</p><p>You’re always a smart ass, but you’re moving it to a whole different level.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Thanks,” Nicky said, drawing up his knees and hugging them. Marco was right, of course.</p><p>He’d been an asshole all day, and what was worse he knew it, but couldn’t seem to stop. He just</p><p>hadn’t realized Marco had noticed.</p> <p>“Spill it. We’re not going to bed until you do.”</p><p>Feeling moodyand out of sorts, Nicky looked around the little clearing where they’d</p><p>camped for the night. Everyone was inside their tents except for him and Marco, and the moon</p><p>cast a silver light on the trees around them. He knew Marco was tired, but was sitting up with</p><p>him because Nicky was so restless tonight. All day long Nicky had been watching Cade and the</p> <p>way he looked at Jax, like Jax was some precious jewel that had just landed in his lap, and he</p><p>didn’t quite know what to do with him yet—proudly show him off or jealously hide him away.</p><p>Nicky didn’t think Cade or Jax were even aware of it, but Nicky recognized that look on Cade’s</p><p>face. It was the same one Marco used to give Nicky.</p><p>He knew Marco loved him, but not with the same intensity that he’d once sensed in him.</p><p>Marco said it was his imagination. Maybe it was. Of course, they’d been together going on three</p> <p>years and things were bound to be more familiar and less exciting, but after all they’d been</p><p>through, Nicky wondered if Marco’s loving him hadn’t become a habit. What if deep inside,</p><p>Marco yearned for something more?</p><p>The plain and simple truth was that Nicky was jealous as hell of this soif de sang, as Cade</p><p>called it. He and Marco no longer had even a blood match and now here was this shiny new thing</p><p>that Jax and Cade had together, a thing Nicky had never heard of before the two showed up. It</p><p>seemed almost as if fate were mocking him again, showing him what it could be like between</p><p>him and Marco, if only... Like a brass ring that was just out of reach, the connection he and</p> <p>Marco used to share beckoned him, taunted him with doubts. Not about his love for Marco—that</p><p>was real and solid. No matter how much Nicky teased him, he knew it was mostly just a bid for</p><p>his attention. There was no way he could live without Marco.</p><p>What really plagued him, even kept him awake at night was the idea that Marco might find</p><p>someone else. What if there were someone out there who might be Marco’s true match? Sure, the doctor said wolves only got one blood match, but he’d been wrong about so much. The blood match seemed to be evolving. Everyone had noticed it. Tucker’s father was claiming to have had it twice—once with his wife years ago and just recently, with Tucker’s best friend, Kevin, a thing that Marco had told him was impossible. Yet, Tucker said they were totally in love and were about to have their own commitment ceremony. If such a thing were possible, what if Marco found another blood mate? Nicky would have no chance of holding onto him then. He bit the skin around his thumb nervously, until Marco pulled down his hand. “Nicky? Talk to me. What is it?”</p><p>Nicky leaned toward the fire again, stretching out his hands. No matter how much teasing Rory did about his lack of activity, Nicky knew his body was in good shape and he worked out daily. It wasn’t the cold or a lack of physical strength that had him shivering. “Nothing really,” he said. “Just thinking about, you know—the blood match thing we lost.”</p><p>“What? Why in the world are you still... Oh, because of Jax and Cade? Honey, we’ve been through this a million times. There’s never going to be anyone else for me except you.” “How can you know that?” Nicky was trying to keep his voice low and not disturb the others, sleeping in the pup tents close by. He couldn’t keep the intensity out of his voice, though, no matter how hard he tried. “You’re not exactly the master of your own fate. You said yourself you didn’t even like men all that much before the blood match got to you. What if some good-looking woman comes along, courtesy of this fucking blood match? What will you do then?” “Then she can go back the same way she came. I love you, Nicky. Only you.” Marco pulled him by the arm toward their tent. “Need another reminder?”</p><p>Nicky allowed him to pull him into the tent, and as soon as Marco got him inside, he was pulling at his clothes, his hot breath sending up little clouds of steam in the cool mountain air.</p><p>Nicky allowed Marco to pull him down onto the sleeping bags, turning his face in for the kiss and letting Marco control it as longas he wanted. Marco’s lips lingered over Nicky’s for a long time before he pulled away and pressed his forehead to Nicky’s. “How can you think I’d ever leave you? It took me long enough to find you and get back into your good graces after our breakup.”</p><p>Nicky pulled back and bit his lip, trying not to laugh. “Yeah, you’re not all the way back in yet, so don’t count your chickens.”</p><p>Marco smiled as his fingertips slid underneath Nicky’s shirt, resting against his side. “How about if I count your ribs instead?” he asked, moving his fingers lightly along them. Nicky was ticklish, as Marco well knew, and he tried to jerk away, but Marco hauled him back against him. “Stop,” Nicky said breathlessly, struggling to get away and still stay quiet. Marco twisted and fell on top of him, his hands sliding under him to cup his ass.</p><p>“Say please.”</p><p>Nicky huffed a few times, and tried not to smile. “Please don’t tickle me, Marco,” he said obediently, gazing up from under his eyelashes. “And I promise not to cut your balls off while you sleep tonight.”</p><p>Marco quirked up an eyebrow and squeezed Nicky’s ass hard. “Oh,you’re going to have to do much better than that.”</p><p>“Ow, ow. Okay. Please sir. Pretty please, with sugar on top.”</p><p>“That’s exactly where I plan to be, baby. And you don’t even have to call me sugar.” “Oh God, that was awful,” Nicky said, laughing and trying to muffle it against Marco’s neck, as Marco worked his pants down.</p><p>“It worked though, right? I love that laugh, even if I have to resort to bad jokes. ” Nicky pulled his arm out from between them to slide it around Marco’s neck. “Promise me one thing,” Nicky whispered in his ear, his sudden stillness communicating to Marco that he was serious, his breathy voice catching a little.</p><p>“Anything,” Marco murmured back to him, brushing his nose against Nicky’s. “Just tell me if you ever feel that way—the way Cade feels for Jax—about someone other than me... Promise me if you ever get that feeling you’ll tell me right away and give me a chance to fight for you.”</p><p>“Nicky,” Marco said, gazing into his eyes. “We’ve already proven we have nothing to fear from the blood match. I’ll never feel anything like that for anyone but you. We beat it once, and we can do it again if we ever had to. But baby, what I feel for you is stronger than any fucking blood match, you got that?”</p><p>Nicky nodded, his heart beating wildly in his chest. “I got it,” he said. He bit down gently on Marco’s earlobe. Marco growled and pulled on Nicky’s jeans until he had them below his hips.</p><p>Trailing kisses down his stomach, he surprised Nicky by engulfing his cock in his mouth. Nicky gasped and tried to rise, but Marco pushed him back down.</p><p>His lips set up a steady pressure, as his velvet tongue slid up and down the skin of Nicky’s sensitive shaft, sometimes stopping at the head to nibble or slip down into his slit. Nicky writhed beneath him, quickly becoming almost mindless as he gave in to the pleasure. Marco looked up into Nicky’s eyes, letting him feel the connection. Nicky felt the firm helmet on the head of his cock pop fully down Marco’s throat, and he cried out softly, almost overcome with passion. He wouldn’t be able to hang on much longer, and he touched Marco’s hair, threading his fingers through it. He felt his cock twitching, and he squeezed his fists, praying to hold on, loath to lose this kind of pleasure. His balls tightened, and he felt a tingling at the base of his spine. Nicky was breathing rapidly and trying to hang on, and he just might have made it if Marco hadn’t pulled off a little and licked slowly up his shaft, swirling his tongue over the head. He threw back his head and would have screamed if Marco’s hand hadn’t clapped over his mouth. He pulled off with a little plop and put his other hand around the base of Nicky’s cock, squeezing tightly and stopping his orgasm.</p><p>“Oh no, you don’t,” he whispered. “You’ve been teasing me all day—it’s your turn.” Nicky let his head fall back on the sleeping bags as he groaned.</p><p>“Evil wolf bastard.”</p><p>“You better believe it.” He licked the broad mushroom head again, and whatever Nicky tried to say came out as garbled nonsense. Chuckling at how easily he’d been able to bring Nicky to such mindlessness, he ran his hands down Nicky’s thighs and between his legs, still licking greedily at his cock. His hands moved up to fondle his balls, and Nicky shifted his legs to open them wider and give him access. Marco looked up at him, making sure Nicky was watching and slowly and deliberately wet his finger. He put that finger in Nicky’s hole and Nicky widened his eyes and clenched around the burn.</p><p>“Oh, Jesus,” he murmured, uneasily. “You know I can’t be quiet—I’ll wake everybody up.” “Then you’ll just have to work harder on your self-control,” Marco said softly, and slid the finger up higher as Nicky’s ass clenched around it. Before he could say another word, Marco swallowed his cock again, deep-throating him and humming around his cock until Nicky felt a scream about to burst from his throat. Another finger slid deep inside to join the first and they reached up higher to rub across a spot inside him that made him buck his hips and cry out even through the burn.</p><p>Marcoput his hand over Nicky’s mouth again. “Hush,baby. You’ve been asking for this all day, and you know it. Now take your medicine like a good boy.”</p><p>Chapter Six</p><p>Jax raised up on one elbow, shrugging Cade off as he tried to pull him back down. “No, listen. Do you hear that? What is it?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade never even raised his head, just cocked an ear for a moment to listen to the strange whines and mewling noises coming from nearby. “That would be Nicky. Or possibly Marco, but I really don’t think wolves make noises like that.” He laid his head back down and pulled at Jax again. “Lie down, baby. I’m tired. It’s bad enough I have to listen to those Animal Kingdom noises next door.”</p><p>Jax twisted around to look into Cade’s face. His eyes grew wider. “That’s Nicky?” he said incredulously. “Oh my God. Is he...is he hurting him?”</p><p>Cade chuckled. “No more than he wants him to.” He squirmed around restlessly. “Damn it,” he said, glancing down at his own growing erection. He rubbed his fist against his groin. “Now they’ve got me doing it.” He pulled Jax more firmly under him and rolled on top, settling in. “Thank goodness I have my own little animal right here.” He leered down at Jax playfully. “Though I guess goodness has nothing to do with it.”</p> <p>“Cade,” Jax said, “They can hear us.”</p><p>A shrill squeal sounded in the tent next to them. “Trust me, baby,” Cade said. “They’re not paying much attention to us.”</p><p>He lowered his mouth to Jax’s, sweeping his tongue over his full lips and Jax sucked it in. Jax told himself it didn’t matter if the connection they had wasn’t the same as the one Nicky had with Marco. He didn’t care—not really. And a connection would come in time. He already felt Cade’s possessiveness and that was close to love, in a way. Jaxdidn’t care how one-sided the love was—the sex would be good enough to burn away the loneliness he felt, the irrelevancy and this feeling of being anonymous. He couldn’t shake the feeling that it didn’t matter who was underneath Cade right now.</p><p>He knew all about the blood lust thing Cade kept on about, but that had nothing to do with him, with the person he was inside, the boy who loved peanut butter and sci-fi movies. The boy who liked to play video games and who sometimes wrote poetry that he never showed to anyone. Not the blood thing—that was only a trick, a crazy coincidence. He wished that it mattered who had this blood connection with Cade. He wished he mattered.</p><p>Cade held his face between his hands and kissed him with slow deliberation, as if they had forever in front of them. He reached down and pulled impatiently at Jax’s legs, urging him silently to lift them over his shoulders. When he did, Cade eased into him, the only lubrication his leaking pre cum. Jax’s balls ached with need as Cade rocked into him, pressing him down and taking complete control. He didn’t feel stretched enough for Cade’s cock, but Cade wasn’t rushing. He held the tip of his cock at Jax’s entrance, teasing in and out, still kissing him with long, slow kisses that madeJax’s toes curl. The head of Cade’s cock was poised to enter Jax, not pushing or demanding, and finally, Jax felt his body relax and open to him. He arched his back, wantingto speed it along, wanting Cade to take him hard and fast so he wouldn’t have to think anymore. He didn’t want to think.</p> <p>Cade refused to speed up, though, rocking his hips slowly, controlling the pace. Jax felt the burn and the stretch, but the fullness felt good. He needed to be filled up and fucked hard. He wanted the hard stretch of Cade’s cock to blot out his thinking, his worrying.</p><p>Cade’s cock rubbed against the spot deep inside him that made him go crazy and he arched up again. “Harder, Cade, please.”</p><p>Pleasure arced between them and Jax buried his face against Cade’s neck, breathing him in. Jax felt the cum flying from his dick and landing between them. He strained up toward Cade, trying to muffle the scream trying to claw its way out of him. Cade thrust hard once, twice, and then he was straining too, groaning his own pleasure and filling Jax with his hot cum. He bit down into the back of his neck and sucked the blood for a long time, long enough that Jax grew restless and twitchy. Finally, he pulled away and slumped down on top of Jax, resting his forehead on his as he caught his breath.</p><p>He eased off to lay beside Jax, one leg still slung possessively over him. He reached for his T-shirt and wiped at himself before handing it to Jax. Jax used it and threw it to the side, feeling a little empty and let down now that it was over. Then Cade leaned up and kissed him, sweeping his tongue back into Jax’s mouth, making him breathless again with fresh need. He bit his wrist and held it to Jax’s lips. While he drank, Cade rubbed his hand down Jax’s stomach to his softened cock, not demanding, just petting and soothing, spreading heat. He patted it, murmuring in Jax’s ear. “Night baby. Sleep tight.”</p><p>Jax sighed and nodded, pulling his mouth away for Cade to lick the wound.</p><p>“You too,” he said softly. He let Cade pull him around and settle his ass against him. “I love you,” Jax said softly over his shoulder, but Cade was already breathing slow and steady, already sunk deeply in sleep. “I love you,” Jax whispered again in the dark.</p> <p>Breakfast was almost over the next morning by the time Gabe leaned back against Zack and looked speculatively over at Jax. Jax could tell he was burning with questions and sure enough, he smiled lazily at Jax when he caught his eye. “So what’s your story, Jax? Where did you and Cade meet up anyway?”</p><p>Zack squeezed Gabe’s shoulder. “None of your business. We’ve been through this before.” Gabe pulled away and smiled an apology at Jax. “I didn’t mean to be nosy.” He stopped to give Nicky a sideways glare as he snorted into his coffee. “But as a fellow Alabama boy, I just wondered how you and your little brother got out to Louisiana.”</p><p>“Well,” Jax glanced over at Cade who didn’t seem to even be paying much attention to the conversation among the boys. “I didn’t make it all the way to Louisiana, actually. I met Cade in Mississippi. My little brother and Iwere at a roadside diner getting breakfast. ” He glanced over at Cade who was now staring steadily at him. “Um...Cade...spoke to me, and...”</p><p>“And we just hit it off, right babe?” Cade broke in with a little smile. Jax flushed, glad that Cade had spared him the embarrassment of the little tip-stealing episode.</p><p>“Yes, that’s right,” he said gratefully. “We just hit it off.”</p><p>“But how come you were in Mississippi,anyway?” Gabe said, leaning forward again. “School’s still in session for Mason, isn’t it? Were you traveling for some reason?”</p><p>“Gabe...,” Zack said warningly. He smiled at Cade. “Sorry. He’s nosy as hell.” “I’m offended by that remark,” Gabe said.</p><p>“Doesn’t make it any less true,” Zack said smoothly.</p> <p>“It’s all right,” Jax broke in, seeing Gabe turn toward Zack with a clenched fist. “I was running away, actually,” he said, glancing over at Cade. This was a part of the story he hadn’t told even Cade yet. “My stepfather...he was abusing Mason, and I had to get him away.”</p><p>A silence fell over the group and Jax felt Cade’s hand on his back, quietly soothing him. He could sense the questions tumbling around in Cade’s head because of what he’d said. They still didn’t have a really clear connection, but sometimes now he could get a sense of Cade’s thoughts. It was disturbingly intimate.</p><p>Gabe and Nicky looked at each other, and Cade leaned up to murmur in his ear. “It’s okay. You don’t have to say anymore. We’ll discuss it later.”</p><p>“No, I really don’t mind.” Jax was almost surprised to find that it was true. For so many years, he’d had to hide who he was from everyone around him, along with what was happening in his own home, and it had eaten him upinside. For the first time in his life, he wasn’t ashamed to be in love with another man and to show that love openly, like Nicky and Gabe did, without fear. It was kind of a heady feeling.</p><p>“My-my mom left us when Mason was a baby. I just came home from school one day and she’d left a note.” He looked down into the campfire. “I was in the sixth grade.” He looked back up at Gabe. “I think my stepfather wanted to get rid of us too, but he was a coach at the high school, and he didn’t want people to know how much of a burden he really thought we were, me and Mason.”</p><p>Cade must have been sensing something, because he stirred restlessly beside Jax. “Really, Jax, you don’t have to talk about this.”</p><p>Gabe shook his head. “No, Jax. Zack’s right, much as I hate to admit it. I was only being nosy. I know what it’s like to lose your mom, and you really don’t have to get into it.”</p><p>Jax looked up quickly, his eyes bitter and hard. “My mother was a heartless bitch. She knew what he was and she left us with him anyway. She just left us with that...that monster. ” He broke off as tears sprang to his eyes. A shocked, uneasy silence fell over the men. Jax swiped angrily at the tears in his eyes. “God,” he said, his voice shaky. “I’m sorry. Didn’t mean to do that.”</p><p>Cade put his armaround Jax’s waist and pulled his head into his chest. “It’s fine, baby. I just don’t want you upset. What do you say we look around and pick out where to put the house. Sound good?”</p><p>Marco stood up quickly too and started gathering up the cooking utensils to rinse off in the stream. Cade rose to help him, while Zack also sprang up and rambled through his pack to find his toothbrush. He headed off to the stream with Marco and Cade. Gabe, Nicky and Jax sat quietly as the wolves hustled around them. Nicky shrugged and leaned in toward Jax, speaking softly. “They aren’t always comfortable with all our troublesome little human feelings.”</p><p>“Yeah, except, you know, lust. They’re totally down with that,” Gabe said.</p><p>Nicky smiled. “It’s not that they don’t care, they just hate having a problem they can’t solve by beating something up for you or making love to you.”</p><p>Jax huffed out a little laugh and dashed at his eyes again. “I know. I don’t know why I ever got into it all.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Because you needed to,” Gabe said. “When I was first turned, it was from a violent attack by a rogue wolf. He bit me after he killed my mom and was in the process of raping me when he was interrupted by a trucker and the cop that was following him into the rest stop. I know a little about what it’s like to be forced and violated.” Gabe shook his head, lost in his memories for a second. “But to be abused by your own stepfather. Jesus.”</p><p>Jax nodded. “It started when I was twelve, and he kept after me for almost three more years. Not every night or anything, just...sometimes. I could always tell when he was about to start up again. He’d touch me a lot, and say shit. Rub against me. If I resisted, he’d...hurt me. He spent one evening burning me with a lit cigarette until I started screaming so loud the neighbors called the cops. He always had a story for them though, and they believed him—he had a good name in the community, after all. And I was just this weird kid he was trying to help. That’s what everyone thought, anyway. So this one night when I was fifteen, I’d just had enough. I took a knife from the kitchen, and when he tried to get into my bed...”</p><p>“Oh God, please tell me you cut his dick off,” Nicky said.</p><p>Jax huffed out a little laugh. “No, but I did cut him some. Man, he was so pissed. Scared him a little too, I think. He bled like a pig, but he never bothered me after that. I told him I’d tell the cops, and they’d make him show the scar. After that he left me alone.”</p> <p>“But he started up with Mason?” Gabe asked softly.</p><p>“Not at first. Mason’s his own son, you know, so I thought he might be safe. I stuck around to make sure too, even though all I wanted to do was put distance between us. He wanted me out, but was afraid to ask me to leave. I got a job stocking groceries. It didn’t pay shit, but it meant I could stay with Mason until maybe he got old enough to defend himself. I don’t know—I didn’t really have much of a plan. I just couldn’t leave him alone with that. Anyway, last month I came home early and found my stepfather with Mason sitting on his damn lap while he stroked himself. He had a huge hard-on—for his eight-year-old son. Made me so fucking sick I jumped on him and beat the shit out of him. The neighbors called the cops, and I got put in jail. As soon as I got out I went back there and got Mason.”</p><p>Nicky cleared his throat. “Damn, Jax. He let you take him?”</p><p>“He didn’t let me—no.”</p><p>Gabe stood up. “Okay, I don’t think I want to know any more.” He thumped Jax on the back. “Good for you, dude. Whatever happened, you did what you had to do. Put that shit behind you now, if you can.”</p> <p>Jax and Nicky stood up beside him, and Jax shoved his hands in his pockets. “I didn’t mean I killed him, or anything, though I kinda wanted to.”</p><p>“Are the police looking for you, Jax?” Nicky asked softly. “If they are, tell Cade. He’ll handle it for you. Don’t keep it from him. Believe me, I know from experience the wolves don’t handle secrets well.”</p><p>“Jax!” All three of the young men jumped a little guiltily and turned toward the sound of Cade’s voice. He was still down by the stream and beckoning to Jax. Cade shouted and made the sweeping motion with his arm again. Jax scrambled to his feet and moved down to the bank of the stream where Cade was waiting.</p><p>Cade handed Jax his own toothbrush and toothpaste, frowning down at him. “Are you okay?”</p><p>Jax smiled as he crouched down by the shallow, fastmoving water. “I’m good. We were just talking.”</p><p>Cade gave him a noncommittal little grunt and turned to follow Marco back up the trail to the camp.</p> <p>The land where the house was to be built was on a little rise by their camp, and covered by thick forest. They left the campsite by the side of the trail and headed up into the woods with Marco in the lead. As they walked single-file behind him and Nicky, Jax could see that he was following some kind of footpath through the woods and one that, at closer look, seemed to be fairly well-traveled. The ground rose for only about fifty or sixty feet before leveling out and opening up into a small clearing. Marco turned to Cade to point out the stream that ran along the back of the clearing, and down by their campsite.</p><p>“You’ll have the trail at your front and water back here. Electricity will have to be from generators, but you can supplement that with oil lamps and propane heaters until you can get the power company to run lines in here. That would be pretty damn expensive though, so you may have to learn to live without it for a while. There’s a little cell service up here, so you’re not completely cut off. We’ll have to widen that trail leading up here.” He paused and gazed around, looking out over the treetops to the mountain view. “It does have its compensations, though,” he said with a grin. “It’ll take some time to get it the way you want it, but it can definitely be done with enough time and manpower.”</p><p>Jax turned and looked back down the way they’d come and through the trees he could catch a glimpse of the mountains stretching out in front of him. Way in the distance, he could see a lake. Once the trees were cleared a bit, the view would be impressive. He stepped closer to Cade and slipped his hand in his. Cade glanced down at him and grinned.</p><p>“It’s beautiful, Marco. Even better than I hoped for. It’s remote, but I like it.” “It’s not as remote as it might seem, actually.” Marco pointed toward the east. “Back over that way about five or six miles through the woods is a mountain resort with a good road leading up to it. We might even want to look at building a road to your lodge from that direction. We own the land next to the resort.”</p><p>Cad e nodded eagerly. “I’d like to run the perimeter later, if you’ll take me.” Zack nodded. “I need a good run. Sounds great to me too.”</p><p>“We’ll make sure they have firewood and something to eat,” Marco said, nodding toward the three younger men. “Then we can get started.”</p><p>“I can gather firewood myself, Cade, and I know how to fix myself something to eat if I get hungry,” Jax said. “You guys can go ahead if you want to.”</p><p>Ignoring him as if he hadn’t spoken, Cade spoke directly to Marco. “I’ll get things ready.”</p> <p>He headed off down through the woods, back to the campsite and Jax glanced wonderingly at Nicky. Nicky was leaning against a tree, and he shrugged gracefully with one shoulder. “This is why I don’t even fight it,” he said with a little smile playing at the corners of his mouth. “Three alphas together riff off each other. Just save your breath.”</p><p>Jax shook his head and followed Cade down to the tents, anyway, coming up behind Cade as he rambled around in their gear. “Let me help, Cade.”</p><p>Cade looked around at him in surprise. “Okay, you can gather some firewood if you’d like. I thought maybe you and the others would like to go fishing later. Marco brought a couple of rods.”</p><p>Jax shrugged. “How long will you be gone?”</p><p>“Only a few hours. We’ll be back by lunchtime, probably, but just in case, the food is in this pack.”</p><p>“I know,” Jax said, rolling his eyes a little. “We’ll be fine.”</p><p>Cade straightened up and came to stand next to him, sliding his arms around Jax’s waist.</p><p>“Sorry. I forget you’re becoming an alpha now.” He bent to kiss the side of Jax’s neck. “My own little alpha.”</p><p>Jax pulled away and made a face. “Why do you always have to do that? I keep telling you I’m not a child.”</p><p>Cade smiled and held up his hands in mock surrender. “Okay, sorry. I’ll try to remember. ”</p><p>Marco called to him, and he regarded Jax carefully. “We’ll shift to run the perimeter. You’ve never seen that before, so prepare yourself.”</p><p>Jax swallowed hard but nodded and followed Cade out to the clearing. Marco was handing Nicky a shotgun. “This is just in case you need us for anything. Fire up in the air—we’ll hear it and come running, okay?”</p><p>Nicky nodded, and Marco caught him by the shoulders to make sure he was looking up at him. “Don’t fool around with it, and if something threatens you, get away—don’t stick around and try to fight it.”</p><p>“Oh for God’s sake, Marco,” Gabe said. “What could possibly threaten us up here?” “Snakes, bears, wild cats, trespassers,” Zack said, counting them off on his fingers. “I never had any trouble all the times I camped up in the mountains on my own,” Gabe retorted.</p><p>“And you were lucky. You probably won’t have any trouble at all here, either. We wouldn’t leave you otherwise, but the shotgun is just in case.”</p><p>“Okay,” Nicky said, tucking it back inside his tent. “Duly noted. Now go on your run—we’ll be fine.”</p><p>Cade was looking uneasy, his frown deepening as Zack had enumerated a few of the possible dangers on the mountain. “Maybe this is a bad idea. I don’t have to do this now. Maybe one of us should stay with them.”</p><p>Jax bumped his shoulder. “Would you go already? You stayed behind last time and absolutely nothing happened. Go on.”</p><p>Cade gave him a brief, fierce kiss, and turned to take off his clothes. Jax blinked in surprise and saw the other two alphas stripping as well. Jax had seen plenty of boys naked in the locker room at school before, but those had been kids, not fully grown, gorgeous men like these alphas.</p><p>He was fascinated and embarrassed at the same time, and saw Nicky smirking at him. He dropped his gaze and looked back at his own alpha mate, loving the look of his lean muscles and the impressive package between his legs. Cade sensed his regard and smiled over at him before straightening up to follow Marco and Zack to the edge of the woods.</p><p>Cade gave him one last look before he leaned over at the waist, and a strange popping and cracking sound echoed around the campsite. All of them fell to their knees and their bodies seemed to elongate and shift, bony protuberances morphing their forms into an animal shape. Jax took an involuntary step backward, a loud gasp leaving his throat before he could pull it back. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cade turned his head to gaze back at him—at least he thought it was Cade for a moment before his face seemed to melt before his eyes and his mouth pushed out and reformed into a long wolf’s snout. Thick gray fur sprang up over his body. Within seconds, a huge wolf stood where Cade had been.</p><p>Despite the fact he thought he was prepared for the shift, Jax found he couldn’t catch his breath. Gabe and Nicky came to stand beside him, and Nicky put a comforting hand on his shoulder, murmuring quietly to him. “It’s a shock the first time you see it. But he’s still your mate. Look at his eyes.”</p><p>Jax dragged his gaze back up to the gray wolf’s face, and sure enough, something inside him leaped in excitement. It was Cade staring back at him, and his own newly-formed wolf spirit called out to him. For the first time since their mating, he could feel something wild and not human inside him, yearning toward its mate. It was both primal and powerful, and scared the hell out of him. He took another quick step backward and Nicky looked down at him anxiously. “Are you okay? Jax, they would never hurt you.”</p> <p>Cade’s wolf noticed something wrong too, and began prowling slowly toward them. Jax could feel an invasive presence in his mind, calling to him, flashing images of Cade’s human form in his head. He realized it must be Cade trying to reassure him, and he settled down a bit, realizing the truth of what Nicky was saying. Cade would never harm him. This was his mate.</p><p>Cade came right up to him, his huge head almost even with Jax’s. His wolf must have stood five feet tall at the shoulder. Cade stood his ground, flanked by Nicky and Gabe, peering down into eyes that held a human expression of tenderness. He jerked up his head and turned then, running into the woods after the other two wolves, and Jax might have fallen if not for Nicky’s arm solidly around him.</p><p>“Are you okay?” Nicky asked again, and this time Jax nodded.</p><p>“I think so. That was—intense.”</p><p>“That’s one word for it,” Gabe said. “C’mon. Let’s find some bait for those fishing rods and try to catch some fish for dinner.” The other young men nodded and followed Gabe down to the stream.</p> <p>“I don’t know about you guys, but I’m beginning to get a little worried,” Nicky said. It was late afternoon, almost four o’clock, and the wolves had been gone for almost six hours. Having said they’d be back around lunchtime made all it all the more odd they hadn’t returned. “Marco’s never left me alone in the woods this long on purpose,” Nicky said. “They must have run into some kind of trouble.”</p><p>Jax bit his lip nervously. He’d been having a vague feeling of unease for some time now, but it wasn’t strong enough to cause any true alarm. He’d just put it down to the weird scene he’d witnessed earlier when the men had morphed into wolves right in front of him. But as time wore on, he was becoming more and more uneasy.</p><p>Gabe stood up and looked into the woods the way they’d left that morning. “Maybe we should go looking for them.”</p><p>“Yeah,” Nicky said. “That’ll go over well.” He frowned. “I can’t imagine what’s keeping them, though. Even if one of them was injured, there are three of them, damn it. Three huge, strong alphas. Anything loose in the woods ought to be threatened by them.”</p><p>“There couldn’t be anything loose in the woods any more, though, right? Not since the Hunters were taken down,” Gabe noted.</p><p>“Except for Jeremy Tate. What if he’s back with a new band of Hunters like he threatened? What if those tracks we saw were his?” Nicky’s voice had risen as he spoke. Gabe grabbed his arm and squeezed it hard.</p> <p>“Calm down, man. You’re just scaring yourself.” Gabe glanced over at Jax who was staring at them wideeyed. “Nicky had a really bad experience with the Tate guy. He kidnapped him and another one of the mates, Tucker. He’s kind of, uh, obsessed with Nicky.”</p><p>“Kind of,hell. He drugged the shit out of me. He would have raped me if it hadn’t been for Tucker.” He looked down at his hands clenched into fists in his lap. “He’s a fucking maniac, Gabe. What if he’s come back? He said he would, and he despises Marco.”</p><p>“There’s one way to find out,” Jax said, standing up. “Let’s go looking for them.”</p><p>“Where the hell are we going to look?” Gabe said. “They were running the perimeter—that has to be over twenty miles of trail.”</p><p>Jax pointed east. “They’re in that direction.”</p><p>Gabe and Nicky glanced up at him. “How the hell did you know that?” Gabe asked, surprised.</p><p>“Cade and I have the soif de sang, remember? It’s a two-way connection. I’ve been sensing something wrong for hours now, but I wasn’t sure enough to say anything. Since you started talking, it’s gotten a lot worse. I think Nicky’s right. Something’s wrong, and they need help.”</p><p>Nicky jumped up beside him, his face dark with fury. “If it’s Tate and he’s hurt Marco, I’ll kill him.”</p> <p>Gabe stood too, but put a cautioning hand on Nicky’s arm again. “I’m with you, man, but let’s not run off half-cocked. Jax,” he said, his voice sounding firmer than Jax had ever heard it, “go get a pack together. Put in one of those medical kits, just in case. Nicky, you get that twelvegauge shotgun Marco left us. I saw where he put the extra shells.”</p><p>“How did you know it was a twelve-gauge?” Jax asked, bent over a pack.</p><p>“I used to hunt with my father before he passed away,” Gabe said. “I still have his old shotgun at home, as a matter of fact. I threatened to shoot Zack with it the night we met,” he said, a little smile playing around his lips, though his eyes were gray and troubled. “Long story,” he told Jax.</p><p>“Oh,” Jax said, glancing over at him. “I don’t think I want to know. So you handle the gun then.” He turned back toward the east. “They’re over there somewhere. I think I can get a clearer idea as we get closer.” He stood up, slinging the pack over his shoulder. “Let’s go get our mates.”</p><p>Chapter Seven</p><p>Marco sensed the exact moment Nicky started toward them, and his gut clenched helplessly. Damn him. Nicky knows better. He’s walking right into a trap, the same one that snared me and the other alphas. He glanced over at Zack and Cade and they were tilting their heads as well, as if they were listening to something only they could hear. Cade got an alarmed expression on his face, meeting Marco’s own worried glance. “They’re coming,” he whispered, and the man guarding them looked up sharply.</p><p>“Shut up!” he yelled at them, pulling back his leg and giving Cade a vicious kick in his side. Cade hissed in a breath and flinched as a shotgun was jammed in his ribs. “No talking!” The man who guarded them was a wolf, a gamma, though he wasn’t acting like any gamma Marco had ever seen. He hadn’t shaved in a while, nor had he bathed recently, and his stench filled Marco’s nostrils. From the time they’d awakened, he’d shown them no respect nor obeisance, though he couldn’t meet their eyes. That didn’t make him any less dangerous. One of a small pack of rogue wolves who held them captive, he was the only one close by. Two of the others, equally dirty and smelly, were crouched over a small fire in the middle of a messy campsite. The others, including several females, were in tents closer to the stream. Their camp too, from what Marco could see of it, was disorganized and filthy.</p><p>Typical rogue behavior. Without a strong alpha to keep them disciplined, gammas let themselves go and lived in slovenly, makeshift camps. They fought among themselves and even the mating structure suffered. They truly lived like animals, with no discipline or order.</p><p>A few mud-splattered ATVs were pulled up on the side of the trail nearby and Marco wondered where they stole them from. Another gamma came over to bring their guard a plate of food and Marco saw it was a female wolf. Tall and dark-haired, her muscular figure curvy but clearly defined, she was one Marco recognized as a wolf named Marissa, formerly of the Tennessee alpha’s pack. Gavin, the alpha of the branch near Cherokee, but still just over the Tennessee line, had called to warn him about members of his personal guard who had gone rogue and attacked the alpha’s mate, along with the beta’s new mate.</p><p>One of the rogues had been killed in the attack, but the other two, Benjamin and Marissa, had disappeared. Apparently they’d either recruited other rogues, or joined another band along the way.</p><p>Gavin and his beta, Richard, had uncovered an intricate plot to destroy the human mates of the alphas and forcibly breed the alphas to female wolves, creating a new breed of wolf, one not weakened and sullied by human blood. If Marco remembered the story correctly, they wanted to keep the current Dark Hollows alphas as breeding stock only, disposing of them after they’d managed to impregnate the female wolves. Was this their plan for him and the other two alphas?</p><p>Marissa looked over at each of the alphas in turn. She noticed Marco watching her and smiled at him, licking her full lips. As she walked back to the other camp she put a little more sway in her hips.</p><p>She was obvious, but she seemed harmless enough. It was the fourth gamma who made Marco uneasy. He stayed mostly in the tent, only coming out to speak to various members of his pack. His eyes were wild and his smell was off, but he seemed to be their leader. Not merely dirty and unkempt like the others, he had an unhealthy, sickly odor. This was the one named Benjamin, and he was another of Gavin’s former personal guard. He’d been closest to the young wolf who was killed in the attack on the alpha’s mate. He’d heard they may have been even been blood mates, a highly unusual situation, but one that did occur from time to time. Marco’s own nephew, Rory, was a wolf, and mated to a stronger alpha, their battle commander, Casey.</p><p>Benjamin, inside one of the small tents at the moment, had only shown himself once since Marco had awakened from where he was hit in the leg with the tranquilizer dart. Since then, he’d stayed mostly inside the tent as the wolves struggled back to consciousness. Gavin had told him he was most worried about Benjamin, because of his cleverness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The three alphas had been ambushed and shot with the darts before they knew what hit them. Marco could only think now that the wolves had been upwind—surely they would have noticed their rank smell otherwise long before they got close enough to shoot them with the darts. The gammas had kept their distance for the few minutes it took for the darts to take effect, the paralyzing agent they used in the dart making it difficult for the wolves to breathe as they writhed on the ground. The darts must also have contained some kind of strong tranquilizer as well, though, because they produced a mental torpor in all of them right away. It took only about three minutes for unconsciousness to overtake them completely.</p><p>They had awakened to find their hands securely tied behind their backs, with bungee cords and rope wrapped around their chests, securing them to a couple of big trees growing by the edge of the camp. Along with being tied, the drugs were still having an effect, making Marco see double. His limbs felt weighted down, and he was finding it hard to move at all.</p><p>Marco tried to tune in to Nicky again, wishing he had some way to warn him off. These wolves were highly dangerous to his mate, and it was making him uneasy and restless. He glanced again at Cade, who had a two-way connection to his mate. He had his head down on his chest and could have been concentrating—on the other hand, he could have passed out again. Marco had a vague memory of Cade trying to fight the group when they surrounded him, and hearing the sickening thuds and grunts as they kicked him over and over again in the head until Benjamin called them off.</p> <p>Benjamin had leaned down into his line of sight and given Marco a mocking smile, showing his teeth, just before the darkness overtook him. Marco closed his eyes and allowed himself the briefest of moments to wonder how it would feel to knock those perfect white teeth down his throat, just before he ripped his throat out. He was so focused on imagining it that he failed to respond the first time the man spoke to him again. He hadn’t realized the young wolf had left the tent and was now standing in front of him.</p><p>“Marco, wake up. I’d hate for you to miss out on anything.”</p><p>Marco lifted one eyelid, peering up at Benjamin. “I was wrong.”</p><p>The gamma lifted one eyebrow, looking amused. “Yes, you alphas been wrong about so many things, but I must say I’m surprised you have the self-awareness to know it.” He folded his arms and stared down at Marco. “I’ll bite. What were you wrong about?”</p><p>“Gavin warned me you might be stupid enough to come here, but I told him nobody was that fucking stupid.” Marco lifted one shoulder. “I was wrong.” Benjamin’s self -satisfied smile slipped. He drew back his fist and struck Marco on the side of his face so hard it rocked his head back. Marco shook his head, a trickle of blood sliding down the corner of his mouth. “Is that all you got?”</p> <p>“Marco,” Zack said beside him. “Shut up.” Marco looked sideways at Zack, who was watching him intently. He shifted his gaze back to the gamma and found himself staring down the barrel of a shotgun, lined up right between his eyes. He blinked at it and stayed still and silent. It was unusual for wolves to arm themselves like this, but he knew this group was both desperate and crazy, a bad combination. No matter how tempting it was to bait this wolf in front of him, he needed to be careful.</p><p>“Go on ,Marco, speak up. Get it all out. No?” Benjamin bumped Marco’s forehead with the gun barrel. “Too bad.” He pulled the gun up sharply and smashed the butt of the shotgun into Marco’s jaw.</p><p>Bright, slashing pain exploded in Marco’s face as he cried out, and he would have fallen over if not held tightly upright by the ropes around his chest. He slumped against them as the pain and nausea washed over him. Swallowing back the bile in his throat, he carefully worked his jaw, checking to see if it was broken. It wasn’t sliding back and forth, so he figured it probably wasn’t, but the pain settled over him like a heavy blanket and threatened him with darkness again.</p><p>Benjamin was still standing over him, and Marco braced for another hit, but instead the man squatted down to bring his face close. “Sorry,” he said smoothly. “Couldn’t resist. Now, you were saying?”</p><p>Marco bit down hard on his tongue to keep from replying. He let his head loll down, pretending to be more hurt than he really was. It would be better if Benjamin thought he was out of commission for a while.</p><p>Zack spoke up again beside him. “Leave him alone, damn it. If you’re going to kill us anyway, just do it. What’s the point of this shit?”</p> <p>The gamma straightened up and let his eyes move over to Zack, though he didn’t move away from Marco. “Point? Does there have to be a point?” He smiled and glanced over at Cade, who was staring stonily ahead. “Who’s this one? Another alpha, no doubt. I can tell by the arrogance. How many of you bastards are up here, anyway?” He moved over to stand in front of Cade, who continued to stare straight ahead.</p><p>Benjamin kicked Cade’s knee with the toe of his heavy boot. Cade shifted his angry gaze up to Benjamin’s face, narrowing his eyes.</p><p>“I’m talking to you, asshole,” the young gamma said in a soft voice.</p><p>Cade’s gaze moved over him slowly. “Were you? I didn’t notice.”</p><p>Benjamin laughed and glanced back over at Zack with a raised eyebrow. “Ooh, I like him.” He laughed shortly and dropped the gun down by his side. “Pretty too. Too bad he’s a damn alpha, though I might fuck him later anyway. Now tell me, Zack, what are the three of you doing up here? Did you get word we were camping here?”</p><p>Zack shrugged. “We were just running the perimeters of our land.”</p><p>“Bullshit. You have gammas to do that,” Benjamin snapped. “You don’t even live up here— you’re from Georgia.” He nudged Zack’s knee with his boot. “Try again.”</p><p>“I don’t know what you want me to say. We had no idea you were up here, obviously, or we wouldn’t have been surprised so easily.”</p> <p>Benjamin threw back his head and laughed gaily. “Yes, it was easy, wasn’t it? I have to admit, I thought it would be more difficult. But then again, the alphas in this pack aren’t exactly known for their intellectual prowess, are they?” He glanced back at Marco. “Another example of how the human blood has weakened us all. Where is the pretty Nicky, anyway? Is he at the lodge?”</p><p>“Where else would he be?” Zack said, sounding bored with the questions.</p><p>“Indeed.” Benjamin lifted one eyebrow and looked back at Marco speculatively, but before he could say more, a slight sound behind them in the woods made Benjamin whirl around and peer into the shadows of the trees.</p><p>At the same time, Marco’s head came up sharply, and Zack hissed in a quick breath.</p><p>“Who’s out there?” Benjamin yelled, as the others in camp jumped to their feet and gathered close by. Several of the males had guns. Benjamin leveled the shotgun at his shoulder, pointing into the woods.</p><p>“No!” Marco yelled, and Benjamin glanced sharply over at him.</p><p>He smiled at the desperate look on Marco’s face. “No?” He raised the barrel of the gun and fired into the trees. The report reverberated around the small clearing. “Come out, or next time I’ll aim lower.”</p><p>“No!” Marco and Cade yelled at the same time, as the bushes near them shook. Whether they were yelling at Benjamin or at the person crouched behind the rhododendrons growing next to the clearing became irrelevant as a small blond boy straightened up and stepped out into the clearing of the camp. Jax stood there nervously for a few seconds, glancing once at Cade before looking back at Benjamin.</p><p>Benjamin lowered the barrel a little and smiled. “Well,” he said with satisfaction. “Who do we have here?”</p><p>Jax could barely concentrate on what Benjamin said to him for the jumble of feelings and images in his head. The overwhelming emotion Cade was projecting to him was fear, heavily laced with anger and outrage. He had to concentrate to filter it all out and focus on the wolf in front of him. He had asked him a question.</p><p>“My name is Jax,” he said softly, answering him. “I-I need your help.” He heard Cade suck in a sharp breath and was instantly flooded again with fear and outrage, so much that he took an involuntary step backward.</p><p>Benjamin raised his eyebrows, and moved his gun in a little sweeping motion, urging Jax forward. Jax came to within an arm’s reach of Benjamin, and Cade strained against the ropes that held him. The young gamma sniffed at him. “What are you? Not werekin, but not human either. You smell like an alpha. Do you belong to one of them?” He glanced over at the wolves behind him and focused on Cade, whose face was pale and shocked.</p><p>“I see,” he said. “But what exactly do you need my help with? Are you alone, by the way? Any friends with you?” He peered around behind him, but Jax was shaking his head.</p><p>“No, I got away from them. You have to help me.”</p><p>Benjamin kept his gun slung low across his arm, looking Jax up and down. “To do what, exactly?”</p><p>Jax took a step closer, causing Cade to strain against his bonds. “Jax, what in the hell are you doing? Getout of here!”</p><p>Benjamin glanced over at him, seeming to be amused, but he kept his finger firmly on the trigger of his gun. “Go ahead, boy. This should be interesting.”</p><p>“I-I was kidnapped.” He pointed a shaking finger at Cade. “By that one. He brought me here against my will and rraped me. He says I’m his blood lust.”</p><p>Benjamin tilted his head. “You mean blood match. Yes, the alphas are mating with human males in ever increasing numbers, it seems. We have to put a stop to that. You do seem young. You can’t be more than...what? Sixteen?”</p><p>“I’m almost seventeen,” Jax lied. “But no, it’s not the blood match—the others called it blood lust—the soif de sang. Have you heard of it? They said it was even stronger.”</p><p>“The what?” Benjamin angled a look over at Cade, who was holding his body rigid and once again staring straight ahead. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Please, you have to help me,” Jax said, holding a hand out to Benjamin. “The other ones tell me I should just try to get used to it—just accept what’s happening, but I-I can’t.”</p><p>Benjamin looked down at his hand impassively. “If he fucked you, then it goes without saying he bit you, so you’re not exactly human any more either, boy. But your odor is odd. I don’t know what the hell you are. A freak of nature, maybe. An aberration, like Todd warned us about.” He grabbed Jax’s arm and twisted it behind him. “You need to be put out of your misery.” A low whine came from the back of Cade’s throat, but Benjamin ignored him, shaking Jax so hard his head rocked back on his shoulders. “Tell me what I need to know. These others you said you got away from. Where are they now? Was one of them Marco’s mate, Nicky?”</p><p>Marco strained against the ropes again, but they held fast. He cried out to Jax. “Don’t tell him anything, Jax! Please!”</p> <p>“Shut up!” Benjamin said and reached Marco’s side in two strides, giving him another vicious blow with the butt of the shotgun, this time to the side of his head. Blood flew from the wound and splattered onto Benjamin’s pants. Marco slumped forward, and both Zack and Cade flinched visibly, growling and casting furious glances at Benjamin.</p><p>“You’ll pay for that, you son of a bitch,” Cade said, spitting out the words. Benjamin snarled and came toward him, but before he could reach him another figure stepped out into the clearing.</p><p>“Goddamn it,” Zack said as Gabe stumbled from the bushes and out into the open. “Zack!” Gabe rushed over to Zack, passing up a startled Benjamin and threw himself down on top of Zack, kissing him wildly and running his hands over his body. “Did they hurt you?”</p><p>One of the gammas with Benjamin rushed forward and yanked Gabe away, pushing him roughly back toward Jax.</p><p>Jax steadied him, and they both looked back at Benjamin with twin looks of shock.</p> <p>Benjamin turned around and threw back his head, laughing in delight. “Two of the mates. Well, this is just delicious.” He came up to Gabe and drew him into his arms. Zack growled menacingly as Benjamin smirked at him. He ran a finger down Gabe’s jaw before putting a hand around his throat. “Tell me, sweetheart. Where’s Nicky?”</p><p>Benjamin pulled him closer, grinding his hips into Gabe’s, tightening his grip on his throat as Gabe choked and struggled to get away. The other members of the group had drawn closer and were watching with open mouths. They almost seemed stunned at the violence Benjamin was inflicting on the alphas and now on their pets. The ones with guns still had them cradled in their arms, but when Benjamin drew Gabe into the rough embrace, they seemed to be at a loss. They glanced nervously at each other, but Benjaminignored them, murmuring in Gabe’s ear. “Tell me where Nicky is, and I won’t choke the life out of you. At least not yet.”</p><p>Benjamin jerked his head at the men standing beside him. “Tie the other one up with the wolves for now. I need to uh...interrogate this one.” He began to draw Gabe toward his tent, Gabe’s face by now an alarming shade of purple as he struggled to breathe. Zack strained against his ropes, making noises that were increasingly less human-sounding. As the first man reached Jax and jerked at him roughly, Cade added his own inhuman howls to the mix. The gammas seemed paralyzed by the sounds and looked at the alphas fearfully.</p><p>“Wait a minute,” Jax cried. “I came to you for help.”</p><p>Benjamin glanced over his shoulder at him. “Well, now that was your first mistake, wasn’t it?”</p><p>“No, I don’t think so,” Jax said. “Now, Nicky!” he shouted and all hell broke loose at once. Nicky jumped out from behind a tree on the opposite side of the clearing and fired directly at a tree just over Benjamin’s head, making him duck down and momentarily loosen his grip on Gabe. Gabe gasped and wrenched away, falling to the ground and rolling. He managed to roll himself right into the legs of the closest guards, just as Jax fell straight down to the ground at their feet, making the one holding his arm stumble and try to regain his balance in all the confusion.</p> <p>With a loud roar, Zack suddenly ripped himself away from the tree and charged toward the guards, moving so fast he was almost a blur. Jax could see that he seemed to be in a partial shift, his long fangs hanging from his mouth and his hands formed into claws. In seconds, he’d torn the guns away from them and threw them into the trees, and with another sweep of his hand, he slashed the throat of one of the guards, sending the other two running screaming into the forest. Jax could see the blade Gabe had slipped him gripped in his claws, both dripping with blood.</p><p>Jax rushed toward Cade, pulling another sharp knife he had hidden in his waistband and using it to slice through the bungee cords holding Cade to the tree. He moved around to the back and sawed at the ropes on his hands.</p><p>Cade pulled at them desperately and managed to free himself even before Jax cut through the ropes, springing away to help Zack, now locked on the ground in a struggle with Benjamin and another guard. Jax made it over to where Nicky was crouching beside Marco, trying desperately to bring him around. Gabe was back unsteadily on his feet beside Zack, dodging the blows and trying to help until Zack turned and pushed him roughly down on his backside. “Stay there!” he said in a rough, hoarse voice, and Gabe nodded, blinking rapidly.</p><p>Jax made quick work of the ropes holding Marco, and he helped Nicky lower the unconscious man to the ground. Nicky frantically tried to find a pulse. Marco took one big gasp and then stopped breathing. Nicky looked up at Jax in horror and without hesitation, without even knowing what he was really doing, Jax bit down on his wrist until the blood was flowing freely. He pressed his bloody wrist against Marco’s mouth, rubbing it across his lips. Some of the blood trickled down into Marco’s throat and he reacted convulsively, arching up toward Jax’s wrist and latching on.</p><p>Nicky looked over at him in shock, and Jax grinned and shrugged. “Alpha blood.”</p><p>Marco was sucking so hard at his wrist that it soon became painful, and Jax began to feel lightheaded. After only a few minutes, he was pulled gently away, and Cade was beside him, offering his own wrist to Marco, but never taking his eyes away from Jax.</p><p>Jax grew uneasy under his close scrutiny and glanced over to see Benjamin’s lifeless body stretched out on the ground and Zack bending over Gabe, checking the already-black bruises on his throat. The camp behind them was in a total rout, with the wolves falling over each other to get away into the woods. Anxious to protect their mates, Cade and Zack allowed them to escape, confident they could track the rogues down later, especially now that their leader was dead.</p><p>Jax saggedagainst Cade’s shoulder, feeling weak as the adrenaline drained from his body. He was aware that Marco began to come around, and he could hear Nicky sayingMarco’s name softly, over and over.</p> <p>Cade pulled away from Marco and took Jax in his arms, bending his head to whisper in his ear. “Well done, cher. Of course you realize I’m going to blister your ass because you put yourself in that kind of danger, don’t you?”</p><p>Jax’s mouth fell open in surprise, and he looked up at Cade to find him looking down at him with one raised eyebrow. He sighed and leaned back into his chest. “You’re safe. So it was totally worth it,” he said.</p><p>Chapter Eight</p><p>Jax sat on the bank of the stream watching Mason splash near the shallow edge. Rayce was beside him, pointing out the rapids in the middle of the stream and cautioning the boy about the fast water that led to a small waterfall and the treacherous, slippery rocks. Jax knew Rayce had been assigned babysitting duty for both him and Mason while the others were felling trees nearby. He resented it, but was taking Nicky’s advice not to fight it so hard. Not all the rogues had been rounded up yet, and until they were, Cade was being extra cautious with his safety.</p><p>He looked up in pleased surprise when Cade dropped down next to him.</p><p>“Taking a break?” Jax asked and Cade nodded, wiping his brow.</p><p>“A little one. Ian, Marco’s beta, has everything under control up there. We’re making good progress, and we have a good start on the foundation. Plenty of rock over by the cliffs and Connor’s got a group over there hauling it to the building site. I was beginning to feel superfluous, so I came to check on you.” Cade had kept Jax close by his side over the last two weeks since they’d returned from their adventure with the rogues. They’d stayed at the lodge until they were sure Marco was completely recovered, and then after Zack and Gabe left to go home, they’d sent for the rest of the pack and come back up to the site to get to work. They’d been camping here ever since, and Cade had set up nightly patrols to make sure the area was safe.</p><p>“Have you been in swimming yet?” Cade asked, and Jax shook his head.</p><p>“Too cold for me.”</p><p>“Mason seems to be having fun. He’s settling in well here, though we’ll have to figure out something about his education. One of the mates, Brittany, used to be an elementary school teacher. She said she’d work with him for a while. When we get the road built, we can take him down to Marco’s pack and he can go to their little school.”</p><p>“Sounds good,” Jax said, smiling over at him. “Thanks for worrying about him. It means a lot to me.” Cade nodded, shrugging it off, but Jax knew he had something more on his mind. He waited him out.</p><p>“About his father...”</p><p>“What about him? He sacrificed any rights he had to Mason when he started to sexually abuse him.”</p><p>“I know that, Jax, and I wasn’t suggesting we take him back.”</p><p>“Good, because that ain’t happening.”</p><p>“Jax, be honest with me. Are they looking for you? Am I going to have to fight off federal agents who come looking for you on kidnapping charges? I will, you understand, but I would like to be prepared.” Cade smiled down at him, running a finger along his jawline.</p><p>Jax sighed, shaking his head. “No. I made a deal with the son of a bitch before I left. The two of us wouldn’t go to the police with what he was doing to Mason and had done to me, if he let me take Mason and go. I don’t feel good about that—I’m afraid he’ll molest some of the kids at his school, but he said it would be my word against his. The word of a little queer and a kid against an upstanding member of the community—his exact words, I believe. I didn’t have any real proof, so I agreed to leave quietly if he let me take Mason. I don’t really trust him though. If he knew where to find me, he could change his mind and come for Mason.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He could try,” Cade said quietly. “He’d have to come through me first. I’ve got you both now, Jax, and no one will ever hurt you again. You have my word on that.”</p><p>A shout from the stream made them both glance up at Rayce just as his feet went out from under him, and he crashed back into the rocks. He must have hit his head pretty hard, because he wasn’t moving, and his head began to slip under the water. Mason started to climb over one of the rocks to get to him as Cade and Jax both jumped to their feet and waded into the icy water. Cade reached Rayce first and hauled his head out of the shallow depths, pulling him up on the banks. Jax turned to tell Mason to come with them, and found he’d disappeared. Frantically, Jax looked for him by the rock he’d last seen him clambering on, but there was no trace of him. A choked scream made him jerk up his head.</p><p>Mason must have fallen off the back of the rock he’d been climbing on to get to Rayce, and he’d slipped into a small eddy that had swiftly taken him to the middle of the stream. The rapid current had caught him up and was swirling him away right in front of Jax. Without giving it a second thought, Jax launched himself over the rock and dove into the rapids after his brother. He heard a startled cry behind him, but all his focus was on Mason’s bright red T-shirt as it bobbed along ahead of him and then disappeared over a little rock fall in the middle of the stream. Jax went sailing over it too, and landed in a pool with torrents of water cascading over his head. There was no sign of Mason, and fear gripped him so hard he thought he might be sick. He dived under the water and finally caught a glimpse of color in the churning pool. He swam toward it and found Mason, his white face floating just under the surface, his arms splayed out in front of him and his eyes wide open and panicked.</p> <p>He reached him in only seconds and wrapped an arm around him. Bursting to the top with Mason, he pulled his little body over to the edge of the stream, surprised to find Cade there before him. He splashed out into the water and gathered both boys in his arms, taking them to the bank. Mason was already sputtering and coughing up water, so all Cade and Jax had to do was support him and make sure he got it all up. Soon he was breathing almost normally again, if a little too fast and excited. Jax stood up, weak in the knees now that it was all over, but before he could reach for Mason, Cade picked him up in one arm and hauled Jax up to his side with the other. “Can you walk, or do I need to carry you too?”</p><p>“I can walk,” Jax protested, but stumbled when Cade released him, so Cade slung an arm around his waist and half-carried him back up to where Rayce was still sitting on the bank, sporting a huge bruise on his temple.</p><p>Rayce leaped up when he saw them coming and made a huge fuss over both Mason and Jax, calling them both silly names in French until Cade told him to take Mason back to camp and get him warmed up. When Jax started to follow them, Cade pulled angrily on his arm.</p><p>“You stay here. I’m not through with you yet.”</p><p>Jax widened his eyes and looked up at him, shivering in the cool breeze. The water had been freezing and he was still feeling a little numb. “What did Ido?” he asked resentfully, pulling away from Cade’s tight grip on his arm.</p> <p>“What did you do? You threw yourself into danger again, without any thought to the consequences. ” He took Jax by the shoulders and shook him. “Is it a death wish, Jax? Is that what it is? Do you have any idea what I felt like when I saw you disappear over that falls?”</p><p>“Well, God, Cade, it wasn’t much of a fall—it couldn’t have been more than six feet... and hey, when do we get to the alpha pairpart of this relationship? You promised me we’d both be in charge.”</p><p>“Of the pack, yeah. But not in our relationship. I’m still your alpha.”</p><p>“Nicky is so right about how you wolves just change the rules to suit yourselves.”</p><p>“I’m not changing anything and that’s not the point! Damn it, what if I lost you? Do you have any idea how much I love you? Hell no, you just get in the car with strange men, offer yourself up to rapists and crazy fucking rogues and jump in front of men with guns and now you throw yourself overwaterfalls. Fuck, Jax, how badly do you want to die?”</p><p>“Wait a minute, what did you say?”</p> <p>“What? What part? The part where you take stupid fucking risks or the part where you’re trying to kill yourself?”</p><p>“No.” Jax shook his head firmly. “The part where you said you love me.”</p><p>Cade looked at him in complete confusion. “Of course I love you. What the hell has that got to do with anything?”</p><p>Jax threw his arms around Cade’s waist and buried his face in his chest. “Oh, Cade, I’ve been waiting so long for you to say that.”</p><p>“Is this an attempt to change the damn subject? Because we’re going to have this discussion. And what do you mean so long? We’ve only known each other a few weeks.” Cade set his jaw firmly, his dark eyes flashing.</p><p>“You can fuss at me all you want to, so long as you say it again.”</p><p>Cade narrowed his eyes. “I love you, okay? You already know that.”</p><p>“How in the hell do I know that? You’ve never said it! I tell you every time we make love, which is like every night and every time you catch me with my pants down in the morning, and then once you woke me up in the middle of the night and...”</p> <p>“Okay, okay, I got the point. And of course I’ve said it.”</p><p>“No, you haven’t. Not once.”</p><p>“Well, okay, I love you. Satisfied?”</p><p>“Maybe...do you mean it?”</p><p>Cade rolled his eyes. “I said it, didn’t I?”</p><p>Jax stepped closer to him and wrapped his arms around his waist, tilting back his head. “And it’s not just the blood lust?”</p><p>Cade pushed his arms down and tangled their fingers together as he pulled him down to sit on the bank of the stream. “I can’t separate my feelings from the blood lust, baby. It just can’t be done.”</p><p>Jax pulled away and proppedhis chin on his fist. “Then how do you even know if it’s me you love?”</p><p>“It’s you.”</p><p>“But if it compels you...”</p><p>“Look, I go to sleep at night and dream of those damn freckles of yours, and the first thing I reach for in the morning is that cute little bubble butt. I walk through a roomful of beautiful, dark, voluptuous women, and all I’m looking for is a cute little blond boy. Yeah, Jax, I think I got it pretty bad.”</p><p>A silence fell between them as Jax thought about what Cade said. He angled a look over at him. “So you like my freckles, huh?”</p><p>Cade sighed. “Apparently so.”</p><p>“Well, if you’re really into ’em, I got this one—it’s right here,” he said, pointing to the hollow between his thigh and his groin. I’ll let you look at it if you want to.”</p><p>Cade sat for a moment, fighting to keep the smile from his lips and losing. “I just might take you up on that,” he said, and turned toward Jax, pushing him down on his back and going after him.</p><p>*THE END </p> </body></html>"]