["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>“Hi, Jaded, how’s tricks?” The words popped up on the computer screen, drawing an amused smile to Tally’s lips.</p><p>“Slow, Wicked. Very slow,” she typed back, snorting at the understatement.</p><p>The online life she led was the complete opposite of the real life she escaped each evening. The same men, the same parties, the same crap. She had grown bored with the endless round months ago. Why she had grown bored she had yet to figure out.</p><p>“Your boss still doing his own files?” It was a running joke in the online chat rooms she inhabited. She had told the story the first day it had occurred. Everyone had seemed awed by her accomplishment. She had personally hoped for at least a good argument out of Jesse Wyman at the time. She hadn’t expected him to actually do his own fucking files.</p><p>“Hell if I know,” she finally typed in. “I think he fired me today.”</p><p>Repositioning, firing, it was the same thing. She liked working with Wyman. It wasn’t exactly challenging but it left her plenty of time for shopping.</p><p>“Fired?” The words popped back. “He wouldn’t dare fire you.”</p><p>She laughed to herself. There were days Wyman had wanted to kill her, but he had resisted the urge with more self-control than she had given him credit for. Of course, the wedding Terrie was planning was keeping him pretty tired. That or her afternoon visits to his office.</p><p>“He says it’s repositioning. He sent me to hell, Wicked.” She sighed at the thought.</p><p>The merger between Conover’s and Delacourte’s had been more than a surprise last month. Even bigger was the surprise that she would now be the personal assistant for Lucian Conover.</p><p>“Repositioning?” The short question was so typical of Wicked. She could almost feel his impatience. “In Hell?”</p><p>“In Hell.” She sighed. “My new boss is Lucifer. This is not going to be fun. There goes all my playtime. (pout)” She typed in the expression huffily. Lucian Conover was not her idea of the perfect boss. “Let’s hope he’s at least hiding a sense of humor under that scowl he wears. I bet he doesn’t even know the difference between a ménage and a margarita. Who will I tell all my dirty jokes to?”</p><p>Lucian scowled. Son of a bitch. Lucifer, was he? Didn’t know a ménage from a margarita? He bit off a series of volatile curses as he jumped up from the computer and paced the den furiously. Smart-mouthed, viperous little termagant. He would show her a fucking ménage she’d still remember into her next life if she kept this shit up. She had no sense of decorum and had shown him zero respect each time he showed up at Jesse’s office.</p><p>She stung him with that waspish tongue of hers, smirked every chance she had and showed in a hundred different ways that she expected him to grovel at the perfection of her tiny feet. Son of a bitch. For a taste of that sweet little body he just might do it, too, and that was what really rankled.</p><p>“You still breathing?” Her tart question came over the instant message with a soft ring.</p><p>“Yeah, just wondering what the connection was between the ménage and the margarita,” he typed in, damning himself a thousand different ways. He was insane to have demanded her as his personal assistant. He had lost his ever lovin’ mind.</p><p>“No connection.” He paused at her answer, frowning. Jaded always had a reason for damned near everything she said. Unless she was unhappy. Unless she was lonely. He had learned that over the past year. Had made it his business to learn everything he could about her.</p><p>“You okay, Jaded?” He really shouldn’t care, but he did.</p><p>“Oh yes, I’m fine.” Her words rang hollow, even through the impersonal communication box. “Maybe I’ll go shopping tomorrow. I hear there’s a sale on shoes...”</p><p>“Uh oh. Poor cows, sacrificing their lives to support your addiction.” He shook his head, yet still he worried. She wasn’t acting normal.</p><p>“Cows, alligators, whatever.” Nope, that wasn’t his Jaded.</p><p>“Hey, babe, you can talk to me, you know.” He needed her to.</p> <p>There was a long silence.</p><p>“She’s my friend.” The words finally came through with a sense of sadness. “I can’t believe she has such horrid taste in men.”</p><p>“Yeah?” He didn’t even pretend to understand that one.</p><p>“I love her like a sister.” She had to be talking about Terrie.</p><p>He waited to see what else she said.</p><p>“I can’t believe she actually fucked Lucifer! Was she insane? Has she lost her mind? The man is an outcast. He has no style, no class, and I doubt he has a cock over five inches long. He probably only needs a finger or two to jack off with.”</p><p>He sat back slowly in his chair. His cock, all five inches and several more, pulsed in outrage. His eyes narrowed.</p><p>“The man scowls. He sneers. Stomps around like a bull in a china shop. He is such a bore. Geez. I need a new job.”</p><p>His fists clenched, his teeth ground together as he saw red. The viperous little witch. A bull in a china shop? Five-inch cock? Five-inch cock?? Ohh, he would show her a hell of a lot fucking more than five inches. Damn her. The woman had a bite that would do a rabid dog proud.</p><p>“If you quit, just think of all the shoes that would cry.” It was lame. Real lame, but he’d be damned if he could type his outrage to her over the Internet. She would probably save the fucking message to show all her chat room buddies. He sneered. Oh, was she in for a surprise.</p><p>“Well, this is true. But I’m definitely looking.”</p><p>He stilled. Looking, was she? He’d see about that one.</p><p>“Well, good luck, darlin’. Now I’m off. Hot date tonight.”</p><p>Nothing came back for long moments.</p><p>“All right. Goodnight.”</p><p>“Night, darlin’. Cheer up, maybe you’ll get lucky and he’ll at least have more than five inches.” He growled.</p><p>“As though that can help him.” He could almost hear the haughty vibration of the words. “Where, oh, where have all the alphas gone? Your mothers must have breastfed you overly long.”</p><p>“Or yours fed you venom and spice rather than sweet milk,” he typed back furiously. And he meant it.</p><p>“LOL. Good one, Wicked. Have fun for me while you’re out. Talk to you later.”</p><p>He clicked the box away. He shut down the program, damn near shaking with rage and arousal. He came to his feet, pushing his fingers ruthlessly through his hair as he clenched his teeth against his anger. Damn her. Lucifer, was he? Five inches, was he? He snarled as he stomped through the house, jerking his leather jacket from the staircase post as he headed for the door.</p><p>Miss Jaded Tally was in for one hell of a surprise.</p><p>Dev had warned him she wouldn’t be as easy as he thought she would be. Of course, Dev was often warning him about Tally. He snorted derisively at that. His twin had stayed in the background during this phase, though under protest. From the first moment Lucian had met Tally, he and Devril had both been lost.</p><p>His brother had commented often that only Lucian would have chosen to make them fall in love with such a sharp-tongued little vixen, but Lucian knew his brother would have been just as helpless in the face of her haunted eyes, her unique features and sheer bravado.</p><p>Now, they were both in a hell of a predicament. And neither of them was happy about it. Tally wasn’t coming around as they had expected. She was no closer to admitting to the lust that heated between them than she had been six months before. It was time to fix that. It was time to master Tally Raines.</p><p>Chapter One</p><p>It was just called The Club. It was a large southern plantation house set on the outskirts of town in a small wooded area, perhaps a mile from the main road. Not easily accessible, but neither was it hard to find.</p><p>A stone wall enclosed the four square acres of property; a guard sat in a small booth at the iron gated entrance. The house itself was surrounded by majestic oaks, giving the estate an air of graceful wealth.</p><p>Lucian pulled into the hidden parking lot, surveying the vehicles already parked there. The Club served a large clientele from around the world, but still maintained an atmosphere of personal friendliness. Not just anyone was invited through its doors, only a select few. It took more than money, breeding or influence to receive an invitation from The Club’s members. It took a lifestyle.</p><p>“Good evening, Mr. Conover.” The butler and peacekeeper, Matthew Harding, opened the door and stood aside as he entered. “May I take your jacket, sir?”</p><p>He wasn’t your typical butler. Lucian couldn’t see Matthew attending to any of the influential families he knew. The six-foot plus ex-Special Forces soldier could have had his pick of any security agency he could have worked for. Instead, he had accepted a position as butler and head of security at The Club’s house. The benefits, Matthew often said, were better than the pay, which was damned good.</p><p>“Thanks, Matthew. Looks like a full house tonight.” He could hear the voices raised in laughter from within the main room.</p><p>“We have several out-of-towners in for the week, as well as many of the regulars.” Matthew hung the leather jacket in the wide closet to the side. “The house is definitely full for a while.”</p><p>The Club maintained the plantation for the convenience of its out-of-town members. There was no need for hotel accommodations when doing business near or around the area. The three-story house counted a dozen fully equipped bedrooms, a kitchen staff, and maid service. A trust set up nearly twenty years ago by the founder of the private club took care of most of the day-to-day running of the house. The membership fees, which were not cheap, went into an account to offset general expenses.</p><p>“Has Devril arrived yet?” Lucian asked as they headed to the main room.</p><p>“Mr. Devril should arrive shortly.” Matthew grinned, his pale blue eyes lighting in amusement. “I believe he was picking up Miss Hampstead from the airport before coming here.”</p><p>Alyssa Hampstead was one of the few subs whose membership had been approved. She was a delicate, haughty heiress with cool hazel eyes and a cold exterior. Heating her up was a challenge that many of The Club members embraced enthusiastically.</p><p>Lucian walked into the main room, a cavernous ballroom that had been remodeled to fit The Club’s needs and was outfitted for the enjoyment of the members. A bar stood at one end; the rest of the room was filled with comfortable leather couches, chairs and small nooks for the enjoyment of its patrons. His welcome was a high-pitched female scream of pleasure and pain.</p><p>He paused, his gaze moving to a nearby couple. Sax Brogan had his shaved head thrown back in ecstasy as he held a petite redhead down on the thick cock spearing her ass. The woman’s creamy white skin contrasted sharply with the chocolate tones of the big man’s. Her legs were spread wide as Sax gripped her small waist and lifted her, only to lower her slowly on the rigid shaft parting her buttocks.</p><p>Dazed blue-green eyes stared back at Lucian as he watched her lips part in excitement. Her face was flushed, and below, her full breasts were swollen, the pierced nipples standing hard and proud in excitement.</p><p>Her pussy was shaved smooth, or waxed. Some of the female patrons enjoyed the painful stimulation of the waxing that the house provided. Her cream stood thick and glistening on the small pussy mound. Her clit was engorged, a shining little pearl standing out from its protective hood as her fingers worked over it desperately.</p><p>The woman was younger than most of the female members. Barely twenty-four, she was the daughter of a staid, stuffy Senator who would have a heart seizure if he ever imagined his perfect little girl was a member of an establishment that catered to sexually dominant males.</p><p>“Fuck me, Sax.” She was riding the thick pole with halting movements, weak with lust as her head fell back against Sax’s shoulder. “Fuck me harder. Now. Please, now.”</p><p>Sax groaned behind her. Despite her words, everyone knew that hard and fast wasn’t what she liked. She loved being sexually delayed, being pushed to the boundaries of control and stripped of the natural reserves she had forced on herself for so long. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sax would have her begging before he was finished with her. Her screams would echo through the window-lined room, her pleas becoming desperate before he would allow her any release.</p><p>The sight of it wasn’t doing Lucian’s cock any good, either. Her tender pussy had flowered open, dripping in excitement, flushed and swollen. Unfuckable. It was one of the few restrictions she had stated upon entering the membership. The woman’s pussy had never been breached and for the time being, wouldn’t be.</p><p>A fucking virgin with a dick up her ass. It never ceased to amaze Lucian.</p> <p>Shaking his head at the sight, he turned and headed for the long bar and hopefully a strong drink. Tally had him too angry to even consider fucking the tension out of his system tonight; besides, it wasn’t one of the lovely lustful women there that he was in need of. Tally had created the monster throbbing in his pants and he had just about set his mind that she would be the one to take care of it.</p><p>“Hey, Lucian.” Thom Briner, the bartender, greeted him jovially.</p><p>Thom wasn’t a handsome man in any sense. He was nearly six feet tall, with long dark brown hair pulled back in a ponytail. His tobacco brown eyes were cynical, his scarred face sinister. He was dependable and loyal, though, and for the job, that was what counted.</p><p>“Give me a whisky, Thom.” Lucian sighed as he tried to ignore the little redhead’s gasps from across the room. He wondered if Tally would let go so easily. Then he grunted. There wasn’t a chance in hell anything with Tally would be easy.</p><p>“Sax is going to have a hell of a time pushing her over,” Thom commented as another female cry reached them. “He’s been fucking her nearly half an hour already and she still hasn’t peaked.”</p> <p>There was an edge of sympathy in Thom’s voice. Lucian shook his head wearily. Red was a virgin, tested regularly on the orders of her morally upright father. It was rumored that the day she turned up without her virginity, or the benefit of a marriage license that her father had approved, then the vast estate her mother had left her on her death would revert to her father in full. Privately, Lucian suspected there was much more to it.</p><p>He glanced back at the couple.</p><p>“No. No. Not yet...” she cried out brokenly as Sax thrust hard inside the tight depths of her bottom and began to shudder in release. Thankfully, for her, he kept thrusting, though.</p><p>Lucian downed the whisky and slapped the glass to the bar for another. Every time he glanced at the other woman he saw Tally instead. Her long black hair sweat-dampened, her face flushed, her thighs spread as his cock tunneled up her pussy or the tight confines of her ass. He wanted to hear her screaming brokenly in lust, her voice husky, pleading, begging.</p><p>It was his own fault. Devril had been after him for months to make his move on her. His twin, Devril had slightly less patience than Lucian did. He was extremely put out over the fact that Lucian was taking so much time in testing Tally’s limits. They had, as brothers, set their sights on her when she first went to work for Jesse Wyman. Unfortunately for Tally, it wouldn’t be a matter of sharing a night or two with the brothers simultaneously. It was a matter of sharing her life. The bond Lucian and Devril shared wouldn’t permit otherwise. What Lucian lusted after, Devril naturally knew a hunger for as well.</p><p>What Lucian loved, Devril loved. And they were both becoming much too attached to the smart-assed, viperous Tally Raines.</p> <p>Lucian could feel Devril’s anticipation beating at him. They were each one half of a whole it seemed. What had begun with their separation as children had only solidified as they reached puberty and then adulthood. The natural bond that twins share had been intensified, strengthened somehow, until they could sense each other’s pain, their pleasure, and sometimes their very thoughts.</p><p>They had battled it through their teenage years, denied it as they each fought to develop their individual personalities. But as they reached adulthood, they had learned to accept it.</p><p>“Hey, Lucian.” Devril took a seat beside him, his dark face reflecting his own tension, deep green eyes concerned.</p><p>Lucian turned his head. Night and day, that was what they were. Devril was black-haired and looked like a poster child for lust and sin. His features weren’t classically handsome; rather, they were hard-edged, almost savage. The same features Lucian possessed, except his coloring was almost a pure, vivid blond.</p><p>“She’s pushing too far.” Lucian sighed, aware that Devril would know he was talking about Tally. “I’ll start tomorrow.”</p><p>Devril tensed in expectation. “What do you want me to do?”</p><p>Lucian swallowed the drink, wincing at the burn that tore through his throat. “Just be ready. My control is damned weak right now, bro. I’m ready to paddle her ass, and I don’t mean in a good way.”</p><p>Devril’s dark brows lifted in surprise before his lips tilted upward in a wicked grin. “Long as I get to help,” he chuckled. “Remember, keep her off balance. I’ll provide a distraction. We’ll bring her down yet.”</p> <p>Lucian grunted. “Or she’ll bring us down. Stubbornness should be her middle name. But we’ll see what happens.”</p><p>Behind them, Red screamed out in release. Turning, Lucian saw that Sax had bent her over a convenient table, plowing hard and deep up her ass as his fingers tucked between her thighs, milking her swollen clit as she exploded. There was a grimace of pleasure on his face as he filled her ass with his release again, but this time, he had driven her over as well.</p><p>Turning back, Lucian sighed heavily. If only Tally were as manageable.</p><p>Chapter Two</p><p>Lucian Conover was going to be the death of her. Tally Raines inputted the last of the figures he had requested into the data file and sighed in boredom. The afternoon stretched out ahead of her and there was a sale at Brighton’s, the exclusive shoe store in the city.</p><p>Sneaking out of the office was becoming harder to do daily. She swore Lucian had hidden cameras in the office to record the time she spent away from her desk. She had one hour for lunch and one hour only. That was barely enough time to get to her favorite café and order a cappuccino, let alone eat or check out the sales. Working for Jesse had been much easier. Whatever had made her think she could tolerate working for Conover?</p><p>Of course, she had tried to object to the move, but to no avail. Jesse had been gleefully satisfied at having her out of his office. She snorted. That new battle-axe he had hired probably did his filing for him too. The man was much too spoiled, especially after his marriage to Terrie.</p><p>Thinking of Terrie had a bittersweet sadness running through her. Jesse had ordered no more piercings, no more tattoos, and he seemed determined to tag along on every outing she had with the other woman. No more adventures. There were so few of her friends who could appreciate some of her more daring escapades.</p><p>Not that there had been any in the past weeks. Trolling her favorite spots had dimmed a bit, though she wasn’t certain why. The fact that it had begun the night she walked in on the little ménage with Jesse, Terrie and Lucian had nothing to do with it, she assured herself. But she couldn’t get the vision of it out of her mind.</p><p>Terrie had been sandwiched between the two men, Jesse’s cock spearing up her ass as Lucian fucked her pussy with wild lust. Tally had left quickly, but she couldn’t forget what she had seen. She couldn’t get the arousal it had sparked out of her body and it was driving her insane.</p><p>Not that she really wanted Conover, she assured herself firmly, ignoring the pulsing heat between her thighs. Arrogant, snide, self-important ass that he was, she could definitely do much better. Couldn’t she?</p><p>“Tally, I need the Charter file.” Lucian stepped from his office, a scowl on his face as he stared over at her.</p><p>She lifted a brow with cool inquiry. “The Charter contract was dropped last week.”</p><p>She turned back to the computer and saved the data information before picking up the file she had been working on and placing it on the side of her desk with a dozen others. She could practically hear Lucian grinding his teeth.</p><p>“Did I ask you when it was dropped?” he questioned her softly. “I don’t believe I did.”</p><p>Now that voice... Tally tensed to control the shiver that wanted to work up her spine. It took all her control, but she kept her movements smooth, languid, as she exited the program then sat back in her chair before swiveling around to meet his gaze once again.</p><p>She crossed her legs lazily, ignoring the thrill of excitement as his gaze flickered to the silk-covered flesh and heated up with a flare of lust. And if she wasn’t mistaken, he was definitely aroused.</p><p>Keeping her expression calm in the face of the sudden fire flickering in his green eyes wasn’t easy. His hard features were almost savagely outlined, the full curve of his lower lip tightening as his gaze rose to hers once again.</p><p>She lifted a brow slowly, more than aware that the perfect arch of the wing-tipped brow would make him furious. If he was angry, he was off balance. An out-of-control Lucian she could handle. The calm, determined Lucian had sent trepidation skittering through her system.</p><p>His brows snapped into a frown as his green eyes darkened for long seconds. Then, like the calm before a storm, his expression cleared. This could be interesting. She forced herself to remain relaxed as his face hardened.</p><p>“The Charter file,” he said carefully. “Now.”</p><p>She sighed with exaggerated forbearance. “Very well. Though I don’t understand why you need to go over a contract that was obviously dropped a week ago. Besides, the owner is a maggot. You wouldn’t like him.”</p><p>She rose to her feet and walked slowly over to the file cabinet as she restrained her own anger. Whereas Jesse had most likely understood her reluctance to deal with the tall, imposing metal cabinets, Lucian merely stood negligently against the doorframe and watched her with narrowed eyes.</p><p>He would want a file that was stored in the upper drawer. The cabinet was over five and a half feet tall; Tally was barely five two. Pulling the drawer out, she stood on her tiptoes and began riffling through the files until she found the one he wanted. Lifting it out, she pushed the drawer in and walked sedately over to him.</p><p>His gaze was hot, but not from anger now.</p><p>“Your file, Mr. Conover.” She handed it to him, fighting the flush she could feel gathering on her cheeks as his gaze dropped to her breasts. She couldn’t keep her breasts from tingling, though, or her nipples from heating beneath his gaze. She breathed slow and evenly, but her heart was racing out of control.</p><p>“Your shirt...” He ignored the file, his hand reaching out as his finger slid beneath the parted fabric.</p><p>Tally dropped her gaze, almost flinching as his finger slid beneath the edge of her lacy, low-cut bra. The two buttons had somehow slid free on the white silk shirt, leaving her all but bare to his gaze. The sight of his flesh, dark, yet not as dark as her own, sent vibrant trails of awareness blazing through her body.</p><p>Suddenly, the memory of him naked, his cock working between Terrie’s thighs, sent anger pouring through her system. Unaccountable, uncharacteristic anger. She shouldn’t care who he fucked or how often he did it. It shouldn’t matter.</p><p>She lifted her hand, casting him a look from beneath her lashes as she ran her finger up one side of the parted fabric.</p><p>“Do you want this file?” she asked him, her voice low, seductive at first. A second later she raised her gaze, and allowed the ice beneath the surface free rein. “Or the one I’ll present later for sexual harassment if you don’t move your hand?”</p><p>His gaze rose slowly back to hers and the heat in his eyes nearly seared her. She could feel her pussy swelling, her clit aching in response to that look. She lifted her brow in haughty inquiry.</p><p>“Would you?” he asked her. “I never figured you for a hypocrite, Tally. But if that’s the way you want to play...”</p><p>He pulled his hand back reluctantly as he took the file from her hand. A small smile edged the corner of his sensual lips. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No, she wasn’t a hypocrite, but she would use whatever edge she could get.</p><p>“If that’s all you need then, I’ll be going to lunch.” Without looking she casually re-buttoned her shirt before turning away from him.</p><p>“It’s a half hour before lunch, Tally,” he reminded her smoothly. “I’ll have to dock your pay.”</p><p>Tally shrugged in unconcern. It would be worth it.</p><p>“I’ll survive.” She collected her purse and headed for the door.</p><p>“I didn’t take you for a coward. Maybe I was wrong.” His voice had her stopping, anger seething through her body as she turned back to him.</p><p>“A coward?” She lifted her brow as she assumed an expression of haughty disdain. “And you came to this conclusion how?”</p><p>She crossed her arms beneath her breasts as she stared back at him. Damn him for the arrogant ass he was.</p><p>“Because you want me. You know it and I know it, yet you fight it.” His voice was low, dark and husky. She hated it when he used that voice. Hated the way it made her pussy pulse and tingle, made her yearn for his touch. Unfortunately, she was also well aware of the fact that there wasn’t a chance in hell it could work.</p><p>“My dear Mr. Conover.” She sighed mockingly. “I’m old enough that I understand I can’t have everything I want in this life. Perhaps this is a lesson you should learn as well.”</p><p>It was one she took to heart. Some things, men like Lucian topping the list, just weren’t good for the emotions or the general stability of life. Tally prided herself on her stability. If she had thought for one moment that she could go to bed with him, enjoy a few hours of wild sex and have it done with, then it would be a different matter. Something warned her that this would not be the case, though.</p><p>She stood still, in control, as he paced over to her slowly. He was tall, broad, and if the bulge in those slacks was any indication, he was fully aroused and just as large as he had looked while fucking Terrie.</p><p>He stopped directly in front of her, staring down at her, forcing her to raise her head to stare back at him in unconcern.</p><p>“Funny,” he said with apparent gentleness. She wasn’t fooled in the least. “This suddenly antagonistic attitude didn’t show up until you walked into that office while I was fucking Terrie. Jealous, Tally?”</p><p>Her breath caught in her throat and she knew he caught the tightening of her eyes at his shocking question.</p><p>“Oh yeah, I saw you come in.” He dropped the file on a nearby shelf as she backed away from him.</p><p>He was too close; she felt too overwhelmed, too weak when he towered over her like that. Unfortunately, there was no place to retreat. Her back came against the door as his arms bracketed her, holding her firmly in place.</p><p>“Your nipples are hard, Tally,” he growled. “And that cold little expression can’t hide the fact that you’re fucking hot as hell right now. You want me, and you’re damned scared to take it.”</p><p>“Scared? Of you?” She only barely managed the disdain she was trying for. “Not hardly, Lucian. You’re letting your imagination run away with you. You’re not the first man to make me respond sexually and you won’t be the last. Never doubt that. But I decide who I fuck and who I don’t. And I won’t fuck you.”</p><p>“Because you’re scared.” She watched as his gaze softened, the brilliant green color warming drastically. “You’re small, baby, but you can take me.”</p><p>His outrageous words had flames of anger—or was that violent lust—shooting through her.</p><p>“Oh, get away.” Sarcastic amusement filled her voice; her hands flattened on his chest as she pushed him back forcefully. “You think your dick’s so big I’m afraid of it?” She straightened the shoulders of her silk shirt, smoothed the crease at the top of her skirt before staring back up at him, allowing her lips to curve with seductive knowledge.</p> <p>“Dream on, Conover. It’s not your cock I reject, or even your hedonistic lifestyle, such as it is. Quite frankly, you couldn’t handle me, and I’ll be damned if I’ll deal with the complications of your bruised pride when you realize that. It’s not fear; it’s fact. Now touch me again and I’ll resign. I don’t have to deal with your advances as well as your snappish attitude. I’ll quit first.”</p><p>She gripped the doorknob and jerked the door open as she rushed to leave, only to be stopped abruptly as she ran into the dark, devil’s version of the wicked apparition behind her.</p><p>“Easy, sweetheart.” Devril Conover’s voice was rough sex, whisky at midnight and depraved desires all rolled into one. The same as Lucian’s. She was trapped between the two men now as Devril gripped her hips and eased her backward as he came fully into the room, pushing her flush against Lucian.</p><p>“Everything okay?” Dev asked her when she didn’t speak. She couldn’t speak. Lucian enclosed her from behind as Devril pressed against her breasts. Heat enveloped her. Like bands of invisible steel it held her motionless, curiously shocked by the sudden impression of protectiveness and strength that emanated from the two men. She was surrounded by their warmth. Wrapped in it.</p><p>She stared up at him in surprise. He was the devil’s image of the man behind her, watching her heatedly, reminding her of exactly what she was passing up by walking out that door. It was bad enough to have Lucian tempting her, but to have Dev, the dark-haired vision of the sin twin helping him? That was completely unfair as far as she was concerned. Fate had it in for her, that’s all she could say.</p><p>“Just what I need.” She sighed with mockingly false patience as she stared up at Devril and batted her eyes seductively. “Tweedle Dee to join Tweedle Dum. Do you boys ever do anything solo?”</p><p>“Where would the fun be in that?” Lucian asked her as his lips settled against her ear, his hands on her shoulders as she felt the hard length of his cock against the small of her back, Devril’s against her lower stomach. “Or the challenge? I’ll make you beg me to touch you again, Tally.”</p><p>The sexual tension thickened as she realized the implication behind his words. The breath locked in her chest and lust sizzled through her veins. Both of them? Brothers? The temptation was damned near impossible to deny. She couldn’t have thought of any sexual experience that would have possibly been better. Or one that came closer to her fantasies.</p><p>Except.</p><p>Lucian was her boss. Her position as assistant to the vice president of Delacourte-Conover could become extremely precarious and even if she did quit, resign or walk out, the gossip that would abound could destroy her career. They could destroy her heart.</p><p>“Ohhh, so confident,” she mocked him waspishly, well aware that she had lost her appearance of calm disinterest as she pushed her way past Devril and made it to the door again. “I could make you beg.” She rolled her eyes with forced patience. “Not hardly.”</p><p>She turned back to them. They were like night and day. Devril watched her with blatant lust while Lucian watched her with a mix of predatory interest and a flare of anger.</p><p>“We’ll forget this episode ever happened,” she drawled coolly as they watched her with their ever-present amusement. Fighting back the knowledge that she was walking away from the ultimate sexual fantasy, she bit back her sigh of regret and informed them instead, “I’m going shopping. I’ll be back when I get back.” Her gaze hardened on Lucian. “And if you dock my pay then you better make certain you bring your own coffee to work. Because anything you get here won’t be safe to drink.”</p><p>She turned and walked sedately from the room, though she closed the door a bit harder than she intended. The blood was rushing through her body, heat and lust curling through her womb as her cunt trickled with her juices. Had anything ever been so intensely carnal? Not that she knew of. Which was terrifying. They were a weakness she could ill afford.</p><p>She had turned them down. She drew in a hard breath and gave herself a mental pat on the back even as the darker part of her desires mentally kicked her. Could there be anything more seductive than the thought of being mastered by the two fallen angels of Delacourte-Conover? Not to her mind there wasn’t. But, she reminded herself, was there anything more dangerous?</p><p>Chapter Three</p><p>Okay, so she had choices to make. Tally sat alone in the small gazebo in the center of the park, staring out at the placid blue of the pond, on whose banks it had been built. The wooden bench was hard but not uncomfortable. The slight breeze that flowed through the branches of the trees above her was soothing, even if it did little to cool the fires raging in her body.</p><p>She was out of control. Or at least as out of control as she felt it was possible for her to get. She was nothing if not well aware of the fact that she had run from that office and from Lucian and Dev like a scared little virgin. She was anything but a virgin. And just because they may not be aware of it, she was honest enough with herself to admit the truth.</p><p>She was scared.</p><p>She hadn’t anticipated that when she had first been moved to Conover’s. She knew she lusted after Lucian, knew she wanted a chance to experience his touch, to fuck him until she knew at least some small relief from the desires tormenting her. When Dev had been added to the equation, she had been positively gleeful. Two men at her beck and call, she had thought. Amazingly virile, able to provide her with her every carnal desire. She hadn’t expected the dominance as well. Nor had she expected the growth of her desires. Her needs were almost consuming her now. Needs she had no business seeking.</p><p>She watched a small flock of ducks waddle across the grassy bank and slip into the cool water. Their lazy quacks and playful antics in the water brought a smile to her face. Once, a long time ago, she would have followed them. She would have splashed in the water and dared anyone to deny her the pleasure of it.</p><p>Now, she hid her pleasures, kept them in the dark and allowed them out only under the strictest circumstances. She could tell Lucian and Dev were not going to allow her to decide where and when those desires came out. Or how they would be played.</p><p>“Still pouting?” Dev’s dark voice had her jerking in response, her head swinging around as he stepped into the sheltered gazebo and took a seat across from her. His legs took up most of the space; his big body seemed to fill the small open building to capacity.</p><p>“I never pout,” she informed him with a patient little smile. She wished she felt as patient as she forced herself to appear. “I was merely enjoying the peace.”</p><p>A peace she was certain was gone for good now. Dev Conover looked like your typical bad boy. From his overly long jet-black hair to his intense green eyes and hard body, he was every woman’s ideal of carnal pleasure. He was the dark to Lucian’s light, as different physically from his brother as you could get. But she had a feeling that inside, where it counted, they were too damned much alike.</p><p>He watched her intently, leaning back against the bench, his arms stretched out along the back of it as amusement tilted the corners of his lips.</p><p>“I had you pegged as the Dragon Lady,” he finally mused quietly. “I expected you to come out with claws drawn, not to see you run away as though afraid of the two of us.”</p><p>She lifted her brow mockingly, despite the fact he had described exactly what she had done.</p><p>“Devril, really,” she said, shaking her head. “Some things are worth drawing claws over. Others aren’t really worth the time. Perhaps you and Lucian fall into that latter category.”</p><p>“Perhaps?” That demonically sexy quirk of his lips made her mouth water.</p><p>She breathed in deeply, refraining from rolling her eyes, though resisting the urge was a test of her patience. No matter how sexy he was, he was infuriating as hell.</p><p>“Fishing for compliments, Dev?” She fought to keep her voice calm, modulated. It wouldn’t do to let him sense any weakness. Like Lucian, he would pounce on it immediately. “You’ll need to bring better bait next time.” She lifted her brow in mocking amusement as she glanced at his lap insultingly before looking away. No way in hell would she admit that bulge was more than outstanding. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was silent for long moments. Just long enough for her to grow comfortable with the sounds of summer that filled the hidden spot. Soothing, relaxing, she found comfort here more than any other place she knew of.</p><p>“Have you ever had sex in public?” he finally asked her with devilish amusement.</p><p>She glanced at him mockingly. “Of course I have. I’ve grown out of the urge to tempt a charge of public indecency, though. As you should have.”</p><p>His eyes were assessing and filled with an outright challenge.</p><p>“Hmm. Maybe.” His lips tilted into a sexually knowing grin. “But isn’t that all a part of the fun?” He lowered his arms from the bench and braced his elbows on his knees. Leaning forward as he was now, he was much too close to her; the small gazebo seemed filled with him, the sexual tension heightening unbearably.</p><p>Hard, calloused hands settled on the sides of her knees, his thumbs smoothing over the sensitive, silk-covered flesh. Tally’s gaze fell to those large, competent hands. It was much too easy to imagine them on her skin.</p><p>“I want to fuck you, Tally. So bad it’s like a hunger. You’ve flitted around and teased us for a year, determined to control every step of this little dance we’ve been involved in. Haven’t you learned yet? There’s no control here.”</p><p>Tally narrowed her eyes at the challenge. Drawing in a slow, deep breath, she leaned forward, noticing rather smugly the small flare of surprise in his gaze as her hands ran up his arms, her nails dragging over the hard, muscular flesh of his biceps. She felt him tighten, his knees shifting as he moved forward, enclosing her legs within his as she stared back at him.</p><p>“There’s always control.” She blew a soft breath over his lips as they parted, only slightly. “It all depends on the control you’re seeking.”</p><p>Her hands moved from his shoulders to the buttons of his shirt. She undid the first, then the second, spreading the material enough to allow her hands to lay flush against the heat of his chest.</p><p>The glitter of battle entered his eyes then. “You could be biting off more than you can chew, kitten,” he whispered as her nails flexed against the hard muscle beneath them. “I’m not the least bit afraid of an indecency charge.”</p><p>He wouldn’t be, she thought silently. But as she had told him, it was all in who controlled it and how.</p><p>She leaned closer, her tongue peeking out to lick her lips, but glancing his lower one instead as his gaze sharpened with sexual heat.</p><p>“Would you give up control, Devril?” she asked him as his hands moved to her waist, his fingers gripping her lightly. “Would you allow me to do whatever I wished, whenever I wished?”</p><p>All she needed was the promise. She leaned forward a bit more, her teeth catching the temptation of his lip and nipping at it gently.</p><p>His hands tightened further.</p><p>“How much pleasure can you take, Dev, before your control breaks?”</p><p>Her hands slid down his chest, nails rasping as his eyes suddenly narrowed. There was no warning. There was no teasing, no asking permission. Before she could evade him he had her across his lap, one hand tangled in the long strands of her hair, tilting her head back as his lips claimed hers.</p><p>He devoured her. His tongue pressed past her lips as the sharp flare of heat at her scalp had her gasping in pleasure. It was so decadent, the thrill she received from hard fingers gripping and pulling at her hair as his lips moved expertly, heatedly over hers.</p><p>There were kisses and then there was a conquering. This kiss conquered. His tongue opened her lips, pressed forward and claimed her mouth as though it were created for him alone. And her mouth was in ready agreement.</p><p>A moan tore from her throat as fierce, alternating sensations swept through her body; the dominance of his lips and tongue taking what he wanted, his hands, one tangled in her long hair, the other splayed against her lower back as he held her close in his grip, the heat of his chest, his cock, hard and insistent beneath her ass. She wiggled against the heavy erection, thrilling to the hard male groan that vibrated against her lips.</p><p>Had she thought he had control? Of her, perhaps, but not of his desires. His lips ravaged hers, but they didn’t mind. His tongue tangled with hers in a masterful stroke, but it had no objections. Her arms wrapped around his shoulders, hands holding tight, her nails digging into his back as she fought to maintain her own control, but she could feel her senses scattering beneath his kiss.</p> <p>The hand at her back moved, swept over the curve of her ass, down her thigh to the hem of her skirt.</p><p>“Son, you go much further and we might have a problem here.”</p><p>Tally froze at the amused voice. Her eyes flew open in horror as Dev’s head raised slowly. Lust and heated demand filled his eyes, but the smug curve of his lips spoke for itself.</p><p>“Oh. You...” She jumped from his lap, slapping at his hands as they reached out to steady her when she stumbled.</p><p>Shame coursed through her as she stared at the park official standing several feet from the gazebo. He had that look of indulgence that other men gave each other. A smirk that made her want to rip their faces from their heads and feed their dicks to the dogs. Infuriating.</p><p>“Now, Tally.” The amusement in Devril’s voice was like gas to a fire.</p><p>Narrowing her eyes furiously, she ignored the guard. Leaning forward, her hand fisted in Devril’s hair, her lips lowered to his as though in a surge of lust as her knee came down between his thighs.</p><p>Her lips were a breath from his when she exerted just the right amount of pressure on the tender, sensitive scrotum just below her kneecap. His eyes widened, his face paling ever so slightly as the guard chuckled behind them.</p><p>“Uhh, Tally,” he said hesitantly. “Do you know where your knee is?”</p><p>“Ohh baby,” she drawled with seductively heat. “Of course I know where my knee is. Remember, darling, no pain, no gain. Are you sure you want to continue to tempt me in such a way?” She increased the pressure by the slightest degree, watching him swallow tightly.</p><p>He cleared his throat, his green eyes watching her cautiously. “Think of all the fun you could miss out on later.”</p><p>She watched him wince as she leaned in more, knowing the pinching pressure he would be feeling now.</p><p>“There’s such a fine line between pleasure and pain,” she told him, keeping her smile intentionally innocent. “Shall we see where your line is drawn, Dev?”</p><p>Small beads of sweat stood out on his brow, but his eyes glittered with an amused knowledge of his defeat.</p><p>“I surrender.” He held his hands out from her, his thighs tight, his body drawn in anticipation of the pain to come.</p><p>She leaned down, gave that tempting, full lower lip a quick little bite before moving back from him calmly.</p><p>“You’re so easy.” She sighed regretfully. “Too bad. I had hoped for more of a challenge.”</p><p>Still ignoring the park official, she pulled the tattered remains of her pride around her. She shrugged her shoulders, adjusted her shirt and smoothed the slight creases from the silk covering her hips before she gave both men a disdainful look and marched from the gazebo.</p><p>“Tally, Lucian asked me to find out where the Gallagher file was. He was searching for it when I left.” Dev’s amused voice brought her to a halt.</p><p>She turned carefully, keeping her expression blank as she stared back at him, fighting to control the fury rising inside her.</p><p>“In hell. Where he can go,” she suggested sweetly before turning on her heel and heading back to the office.</p><p>Chapter Four</p><p>“Stay the hell out of my files!” Tally slapped the Gallagher file on Lucian’s desk, right in front of his face.</p><p>He swiveled the chair around to face her, looking up at her broodingly. His thick, almost white, blond hair fell over his brow, lust glittering in his eyes.</p><p>“Don’t you even think about it,” she warned him, unable to still the harsh anger that pulsed in her voice. “If you touch me, I promise you’ll regret it.”</p><p>He leaned back in his chair, watching her with narrowed eyes.</p><p>“This is an office,” she told him with cold disdain. “A place of business. This is not an orgy palace, nor is it your own personal fuck central. I will not be molested here on a daily basis.”</p><p>“I own the damned place,” he snarled back at her. “If I want to fuck in it, then I’ll do it on a daily basis, Tally.”</p><p>“Not with me.” She bared her teeth at him, her fists clenching with the need for the action. “I am not some weak-kneed office bimbo who’s going to spread out on your desk for your pleasure. I am a professional, Lucian, and I expect to be treated as such.”</p><p>He rose slowly to his feet. She should have felt intimidated, instead she felt enraged.</p><p>“I never act in any other manner while conducting business,” he reminded her, his soft voice in no way disguising his anger.</p><p>“While we’re in this office...”</p><p>“Tally.” He never raised his voice, but the sharp edge had her brows lowering in growing anger. “This is my office. You’re my woman. While no longer conducting business, if I want to fuck the hell out of you, then it’s my choice and my prerogative.”</p><p>“Oh, is it now?” She crossed her arms carefully beneath her breasts. “And exactly who decided I was your woman?”</p><p>He smiled slowly. “Our woman,” he said, his voice dark and confident as he leaned closer. “Don’t doubt it, Tally. I know who you just came from. I know how hot you burned in his arms and I know damned good and well you would burn the same in mine. The pain in my balls was well worth the experience. So never doubt you haven’t been claimed.”</p><p>The hard throb of ownership in his voice sent tremors of excitement racing up her spine even as a firestorm of fury raced through her blood veins. But it was his words that shocked her. He had felt that? They could sense what the other felt? That information she would use later; for now, she had Lucian’s attitude to deal with.</p><p>He was taller than her by quite a bit. Her head barely reached his upper chest, so she was forced to tilt her head back as she allowed smug disdain to fill her expression.</p><p>“Do you really think you can control me with sex, Lucian?” she asked him, her voice cold, filled with loathing. “Do I really appear to be such a twit that all you have to do is fuck me to handle me? You have another think coming.” She punctuated her words with a forceful jab of her finger into his hard, muscular chest. “No one handles me. No man controls me. Not now. Not ever.”</p><p>He glanced down at her finger. Slowly. A second later his gaze speared into hers once again.</p><p>“I’ll control you, Tally,” he told her, the tone of his voice whispering of a sexual dominance, an excitement she had only imagined before. “We’ll control you, and I promise you, when we do, you’ll beg for it.”</p><p>Her lip curled as a snarl begged to be free. In her life, she could never remember being so furious, so intent on slapping a man to his knees as she was now. And she would have. She could have. If only she could force the required words past her lips. Her repertoire of cutting phrases refused to come to mind now.</p><p>“And you’ll learn just how quickly your own arrogance will kick your ass,” she informed him coldly before spinning away and stalking to the door. “Stay the hell out of my file cabinet or do the damned filing yourself. Your choice. I won’t warn you again.”</p><p>“Tally.”</p><p>She stopped at the door, turning back to him slowly, fighting the compulsion to go to him, to give him what he needed, what they both wanted.</p><p>“You’re not fighting me, baby, or Dev. You’re fighting yourself. And I think you’re smart enough to see that.”</p><p>“You’re wrong,” she told him softly. “Now, I just left Tweedle Dee in the park with my kneecap imprinted on his balls. Keep fucking with me, and I’ll slam yours up your throat. I’m going back to work now.” She gave the information, pretending she had missed his earlier admission. Revenge was best dealt in surprise, she chuckled to herself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She swept from the room before he could respond, before she could glimpse any knowledge or emotion in his expression. She had a job to do. A job she enjoyed, and she needed to remember that. Even if Lucian and Dev refused to. And she had revenge to plan. An exacting, satisfying revenge before her fury ended in bloodshed.</p><p>Chapter Five</p><p>Planning her revenge took a day or two. Tally knew it wouldn’t be easy to separate them, nor would it be easy to convince the other to go along with her. Especially as furious as they had known she was. But she managed it.</p><p>Two days later, as Lucian was settling down to a meeting with several military liaisons, Tally picked up a file she had held back the day before and walked into Dev’s office, careful to keep her hand behind her back as she turned the small locking mechanism on the door knob that would automatically secure the door.</p><p>“I need you to sign these, Dev,” she told him briskly as she walked over to his desk and moved behind it as though she had no qualms at all in being so near him.</p><p>She laid the file on the desk in front of him, opened it and straightened as she turned to look at him.</p><p>He didn’t appear interested at all in the papers laid out before him. He was more interested in the fact that several buttons had slid free on her royal blue linen shirt.</p><p>“You’ve been in the files again,” he said softly as she glanced down. She knew that was what he would believe. Both brothers, it seemed, immensely enjoyed the fact that the file cabinets managed to strain her blouses until the top buttons slipped their moorings.</p><p>She sighed with false impatience. “Of course. Isn’t that the purpose of making me do your filing now? Perhaps you should be the one to button my blouses when it happens.”</p><p>A grin tugged at his lips. He shouldn’t be so damned sexy and rakish looking when he smiled like that, she thought, deeply perturbed by it.</p><p>“I would be more than willing,” he promised her silkily as he swiveled the chair around to face her and patted his lap. “Sit down here, baby, and let me see what I can do about that pretty blouse.”</p><p>She knew he expected her to kick his teeth in for the offer, but rather she sat down sedately on his thigh, staring into his surprised expression with an innocent smile.</p><p>“Like this?” she whispered seductively, her body turning into his as one arm came around her back.</p><p>“What are you up to?” There was a flicker of suspicion in the jade depths of his gaze as he watched her.</p><p>“Me?” she asked him, her eyes narrowing in false anger as she watched him carefully. “Really, Dev. You offered. But if you would prefer not to.” She shrugged her shoulders as she moved to rise, aware that he would catch a glimpse of seductive sheer lace beneath the edges of her bra.</p><p>“Now, I didn’t say no.” His arm curved around her back, holding her in place. “I was just questioning your motives, baby. You haven’t exactly been eager to play here lately.”</p><p>She would have laughed if she weren’t so determined now.</p><p>“Well really, Dev,” she snapped. “The two of you together can be rather intimidating. It’s enough to make even the most jaded of us wary.”</p><p>She injected just the right amount of irritation and watched with silent glee as his gaze darkened reflectively.</p><p>He sighed, shaking his head slowly. “Why don’t I trust you, Tally?”</p><p>She smiled innocently, blinking up at him with a rare display of charm. She could be charming when she wanted to be. She had done so often in the past.</p><p>“Because your balls still carry the imprint of my knee cap?” she asked wickedly.</p> <p>He chuckled, relaxing marginally. “That could be it.” His hands gripped her waist. “If you’re serious about the blouse, come here where I can get to you.”</p><p>Now how did he manage that? Tally was staring down at him in shock seconds later as she sat on the edge of the desk, her bare buttocks meeting the cool wood as her skirt pooled along the desk around her.</p><p>“Sneaky.” There was a vein of grudging respect in her tone. It had been done so smoothly she was unaware of his hands sliding her skirt up her legs as he lifted her.</p><p>“Thank you. I thought you would appreciate the move.” He chuckled wickedly as he moved closer. “Let’s see about these buttons now.”</p><p>Another came undone.</p><p>Tally frowned down at him darkly, though silently she crowed in triumph.</p><p>“Wrong way, Conover.” She allowed her voice to become breathless, the arousal that was ever-present around them to glitter in her gaze.</p><p>“Really?” Another came undone. “Are you sure?”</p><p>He watched her, gauging her, testing her. She allowed a cool smile of confidence to shape her lips.</p><p>“You wouldn’t dare. Lucian would be very put out,” she warned him softly.</p><p>“Would he?” he asked her. “Is he busy right now?”</p><p>She frowned as though not certain. “He was going over contracts before I came in here. Why?”</p><p>She pretended ignorance. She was good at that when she needed to be. But if what Lucian had said after her little escapade in the park with Dev was true, then he would feel every touch his brother knew. Tally was going to make certain he felt quite a few touches in the next few minutes.</p><p>“Just curious.” He cleared his throat, another button falling victim to his fingers as he pulled the material from the waistband of her skirt. “So, Tally, how much are you wanting to play this afternoon?” he asked her curiously.</p><p>“I don’t know, Devril.” She smiled slowly, seductively. “How much control do you think you have?”</p><p>He lifted one dark eyebrow mockingly. “Do your worst, baby.”</p><p>Ohh, a dare. She smiled slowly, her tongue peeking out to lick her lips as she shrugged her shirt from her shoulders, slid from the desktop and straddled one hard, male thigh.</p><p>“My worst, huh?” she asked him curiously as she leaned close, her knee pressing, but exerting no pressure to the sensitive area she had nearly abused before.</p><p>He cleared his throat. “Pleasure-wise.”</p><p>“Of course.” Her fingers went to his shirt, buttons loosening with each breath he took as she leaned forward and allowed her tongue to rim his lips. “Only pleasure, Devril. For now...”</p><p>Lucian tensed. Son of a bitch. It was all he could do not to curse aloud as he tried to follow the conversation between Jesse and the General regarding the new military contract they were being offered.</p><p>He could feel her. What the hell was Dev doing? He knew better than this. He knew not to allow that little vixen around him alone during business hours. But somehow the conniving little witch had managed to convince him otherwise. And Lucian was stuck. There wasn’t a chance in hell of escaping the meeting, and no way to stop what he knew was coming.</p><p>He felt her kiss, that tempting tongue first rimming the lips then sliding softly, easily, into Dev’s mouth. Heat surged through his body as his cock responded immediately. Hard, demanding, it strained against his slacks as he suffered through the impression of a feast of lips, tongues and breathless moans. Damn them, he was going to kill them both.</p><p>He fought to control his breathing. It wouldn’t do to be panting in front of a General, a Senator, a military contractor and, worst of all, Jesse. But he could feel the perspiration gathering on his forehead, the heat whipping through his system.</p><p>Where was telepathy when a twin needed it? Unfortunately, that wasn’t a bond he and Dev had ever developed.</p><p>Jesse had warned him about Tally. Warned him to never, ever let her suspect the weakness the two men shared. When she had stomped into his office from the park, he had a feeling he had done just that with his hastily spoken words. Now, he was paying for it.</p><p>The sensation of hot lips moved down his neck, his chest. Teasing fingers ran along the length of his cock, then farther down, rasping the tightening scrotum before caressing the sensitive flesh just behind it. He was going crazy.</p><p>Even worse though, he sensed the feel of her soft flesh against his fingertips. Hard nipples surrounded by little gold bands. Slick, fiery heat as two fingers pushed slowly inside her tight pussy. His fist clenched as he fought for control and prayed he could hold out against the exquisite pleasure. Coming in the middle of a business meeting wasn’t acceptable. But he had a feeling Tally was pushing just for that.</p><p>“You okay, Luc?” General Mornay watched him closely for long seconds as Lucian fought to clear the dazed pleasure from his mind.</p><p>“Fine, General.” He cleared his throat, glancing at Jesse for help. Was he supposed to be contributing here?</p><p>Jesse gave him an odd look before turning to the General, thankfully with an explanation to whatever question he had asked.</p><p>Lucian’s thighs tightened; his whole body screamed with the need for release as the impression of a hot, moist mouth surrounded the head of his blazing erection. Sweet Heaven, he prayed, he was not going to survive this. It wasn’t possible.</p><p>He could feel sweat gathering at his temples now, a rivulet running down the side of his face and didn’t dare move to wipe it away. His hands were shaking as his palms heated with the feel of her silky hair gliding over them, his fingers clenching as Dev’s tightened, holding her mouth on his cock, torturing Lucian with the feel of it.</p><p>He stared around the room wildly, his gaze finally connecting once again with Jesse’s and he knew then he would kill Tally. Jesse stared at him for a second, confused, then with slowly dawning awareness of what must be going on. There were few people who knew of the bond Lucian and Devril shared. Jesse was one of them. And if the gleam of evil amusement was anything to go by, Lucian was getting ready to pay for baiting the other man months before while Terrie had obviously been getting right friendly beneath Jesse’s desk.</p><p>“Lucian has been working extensively on this project, gentlemen,” Jesse said matter of fact, though his eyes gleamed with satisfaction. “I’m certain he can answer your questions about development.”</p><p>The man was fucking insane. Lucian shifted in his seat, casting his friend a look of retribution as all eyes turned to him. Tally chose that particular moment to rake her teeth over the head of Dev’s cock, nearly sending Lucian into heart failure. Dear God, the pleasure was streaking through his veins like comets across a night sky, only to explode in his brain. He was supposed to discuss something in this condition?</p><p>He cleared his throat. Okay, it was the first time in a lot of years, but not the first time ever that Dev had placed him in this position. He could get through this. He cleared his throat again.</p><p>Fuck! He tensed as trailing fingers of sensation shot from his dick to his head in a surge of ecstasy unlike anything he could have imagined. What the fuck was she doing? Her mouth was sucking firmly, her tongue rimming the flared head, fingers massaging taut balls with firm strokes, but she was doing something more. Pressing against the base of the cock, nimble little fingers applied pressure as the ball of her thumb rotated. He swallowed tightly, his eyes widening as he felt his release begin to build.</p><p>“Not yet.” Tally eased the pressure of her mouth on Dev’s cock, her fingers tightening on the base to delay the release she could feel surging up the shaft of tight, hard flesh. “Let’s see if we can’t make it better.”</p><p>Dev stared at her with narrowed eyes, his breathing hard, face flushed as she reached for the glass of ice water that was on his desk. Her fingers slid over the rim, drawing a sliver of ice from the cold liquid. She saw the glimmer of amusement in his eyes and wondered if Lucian was similarly awed with her abilities.</p><p>She could barely restrain her chuckle. She could imagine the hell he was going through while sitting through that meeting with those stuffy, straight-laced government types.</p><p>Opening her mouth slowly, aware of Dev watching her every move, she laid the ice on her tongue, allowing the cold to penetrate her warm flesh as it melted quickly.</p><p>“Now we see if you can keep that control,” she whispered on a small laugh as her head lowered once again to the straining flesh. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucian flinched. A strangled groan growled at the back of his throat as the pressure on the base of his cock eased, only to have the head surrounded with an icy blast of sensation a second before the heat began to return as never before. White-hot, growing, shimmering before his eyes as his balls drew up tight and hard, warning him that release was only seconds away.</p><p>“Mr. Conover?” The Major was staring at him in concern. “Are you feeling okay?”</p><p>Lucian’s gaze swung to Jesse, who quickly lost his amusement in the face of whatever he was seeing. The pleasure was too intense, too destructive. Fuck. He was going to kill them.</p><p>His cock throbbed in warning, a small amount of pre-come dampening it beneath the material of his slacks.</p><p>Lucian jumped to his feet and without apology, without an explanation, stalked across the office to the private bathroom off the side. He slammed the door, his fingers shaking as he locked it with one hand and tore at the zipper of his slacks with the other.</p><p>No sooner had he managed to free the tortured flesh from its confinement than he exploded. He barely throttled his strangled groan, his head falling back as he bared his teeth and felt his semen jet violently from the head of his cock.</p><p>Hard spasms wracked his body, drew every muscle tight and locked the breath in his throat as he fought to steady himself, to rein in the harsh male shout that he knew had erupted from Dev’s throat.</p><p>Son of a bitch. He shuddered with the feel of gentle lips milking the last drops of come from a straining cock before they slid away slowly. He fought for breath, his chest heaving, his composure shot now. Never, in his entire life, never had he known anything so fucking good, and all he’d had for his pleasure was the echo of impressions through the bond he shared with Dev.</p><p>His legs trembled; sweat beaded his flesh, dampened his shirt and did little to cool the heat raging just under his skin. With shaking hands he cleaned the sink that had been splattered with the silky jets of seed spewing from his cock moments before, then fixed his clothes slowly.</p><p>His eyes narrowed as his teeth clenched in fury. The little witch. She was going to pay, and by God, he would make sure she paid well.</p><p>He moved from the bathroom back to the office.</p><p>“Jesse, gentlemen, I seem to be afflicted by some odd virus at the moment. If you’ll excuse me...”</p><p>“Lucian.” Jesse stopped him as he headed for the door. “Get well quick. You and Dev have a flight in two hours. You’ll be accompanying the General to Washington to lay the idea out to the committee. I hope you’ll be able to make it.”</p><p>Lucian stared back at them, fighting to keep his expression calm. “I’m certain it’s merely a temporary affliction. I just need a few moments. Excuse me.”</p><p>He nodded stiffly to the three men before he threw open the office door and stalked out to Tally’s desk.</p><p>There she sat, as cool and triumphant as a reigning queen. She smiled slowly, a smug little curve to her lips that warned him of her victorious demeanor. But her gaze was hot, wild. She wasn’t unaffected and she hadn’t found her own release. Damned stubborn woman. He glanced at Dev, who stood furiously at the door to his office, watching her heatedly.</p><p>“Wrong move, sweet thing,” Lucian told her softly, leaning close as he planted his fists on her desk and stared into her satisfied expression. “Bold. Daring. But wrong time, wrong place. You chose to pick a meeting to test your skills during office hours, business time. No quarter given. Do not make the mistake of ever asking for such, either. When I get back from this little trip you’ve just caused with your shenanigans in distracting me during that meeting, you better be waiting, because I intend to fuck you six ways from Sunday. Maybe, just maybe, by the time we’re finished you’ll be too fucking tired to cause trouble.”</p><p>She rolled her eyes. He snapped his teeth together in fury at the mocking expression.</p><p>“Darling,” she drawled. “I would cause trouble if I were dead. You’re once again overreaching your own capabilities.”</p><p>Overreaching? Lucian leaned closer, almost nose to nose, the vindictive little light in her eyes making him crazy to fuck it out of her.</p><p>“Am I, Tally?” he asked her gently. “When I get my hands on you, I’m gonna spank your tight little ass until you scream to come for me. I’m going to make you beg.”</p><p>Her eyes widened. “Oh, Daddy, make it hurt so good.”</p> <p>She was laughing. The little vixen was having the time of her damned life. The impression hit him nearly broadside. Had he ever seen her eyes twinkle like that? Seen such joy on her face? She was torturing him and she was loving it.</p><p>For a moment, just a moment, warmth curled through his heart. Her laughter, her joy, was like an addiction, but he’d be damned if he could live through another episode such as the one he had just experienced.</p><p>“You are insane,” he growled, straightening and staring down at her with a frown.</p><p>Her laughter was low, bright. “Yeah. I am,” she agreed. “Deal with it.”</p><p>Deal with it? He turned and glanced at Dev. Deal with it? They were so screwed.</p><p>Chapter Six</p><p>Tally knew the minute Lucian and Devril walked into the Wyman’s large front room nearly a week later. Several other projects in addition to the military contract had called them out of town, leaving her alone in the office and oddly at loose ends. She hadn’t anticipated how much she would miss them or the excitement that sizzled over her body whenever they were near.</p><p>But they were back now and her body was suddenly alive again. The tiny hairs at the nape of her neck lifted in some sort of primal awareness, drawing her attention away from the handsome Director of Marketing she had been chatting with.</p><p>Her head turned; rather distantly, she noticed the feel of her long, straight black hair swishing above her hips, caressing the silk of her snug bronze dress. The sensual feeling wasn’t welcome. It warned her that the sexual tension between them that afternoon last week had not abated and her body was now primed and eager for their touch. It was no longer just Lucian her body lusted after, but Dev as well.</p><p>Devril had never played a part in any of her sexual fantasies of Lucian, until this past month. As she had fought for release in her lonely bed over the past week, Devril accompanied her fantasy image of Lucian, his hands playing over her body as she imagined Lucian’s cock, his erection filling her mouth as his brother’s filled her pussy. It had been highly erotic. It had been highly unwelcome. She was having a hard enough time keeping herself distant from one brother; she didn’t need the other adding into the equation.</p><p>“Excuse me,” she murmured to the young man she had been talking to, and headed for the bar for another glass of champagne. Liquid courage. She needed something to see her through this evening.</p><p>Tally had to admit she had hoped neither Lucian nor Devril would return in time to attend the small party Jesse and Terrie were throwing to celebrate the six-month anniversary of the friendly and very lucrative, merging of Delacourte and Conover electronics firms. Each company had differing strengths and areas of expertise that, when combined, would eventually make them a leader within the electronic manufacturing world. That and the government contracts that the two companies together could now pull in would push them ahead of the game.</p><p>Sipping on her champagne, Tally moved farther along to keep a careful distance between her and the Conover brothers. Damn, she just hadn’t considered that they would double-team her the way they had. But she should have. It was an oversight that she had been foolish to make. She knew they were part of the much whispered about Trojans. A group of elite dominants that often enjoyed ménage sexual practices with their women.</p><p>Several ex-wives of the group had made the mistake of telling a few good friends about the small group and word had spread like wildfire through the small community of influential citizens. Exactly what the Trojans were, no one really knew. Sexually dominant, they were men whose extreme sexual tastes were outside of what would be considered natural.</p><p>Her best friend, Terrie, had married one of the members and Tally knew for a fact that part of her relationship with her new husband did indeed involve a third partner sometimes. It was something Terrie spoke very little of, but Tally knew the other woman had found that something that had always been missing in her life.</p><p>Not that Jesse wasn’t extremely possessive of his new wife. He was. The love that connected the two was impossible to miss. Jesse never so much as looked at another woman. But he did sometimes share his wife.</p><p>Lucky Terrie.</p><p>Tally sighed as she wandered through the open garden doors and escaped the stifling tension following her in the house. She should have known better than to attend the party. Her emotions were too high, her control too fragile right now. She prided herself on that control and the small slips she was displaying were starting to worry her. Lucian and Dev were becoming a weakness she could ill afford.</p><p>Silently, she made her way along the rock walkway that led deeper into the shadowed expanse of flowering bushes and trees. Terrie’s idea, she knew. Her friend had a green thumb that often went out of control, but the garden was a masterpiece of serenity. Nearly a square acre of lush vegetation and miniature trees.</p><p>Finally, Tally made her way to a secluded waterfall on the western edge of the gardens and the hidden padded bench beneath the shelter of a small, vine-covered iron gazebo.</p><p>The bench was wide, softly cushioned and, most importantly, private. Tally needed time to come to grips with herself before facing Lucian or his twin. It wasn’t that the thought of a ménage with the two men bothered her. Tally was extremely liberal in her opinions of sexuality and completely honest with the darker side of her own sexual desires.</p><p>The fact was, there would be problems attached to any affair she entered into with Lucian, or Lucian and his brother. Her emotions were involved. How it happened, when it had happened, she wasn’t entirely certain. But she knew when she stepped into that office and saw Lucian fucking Terrie she had been furious.</p><p>She had known it would happen eventually. Hell, she could have stopped it. When Jesse asked her if there was anyone who shouldn’t be involved in such a situation with him and Terrie, she could have said something then. Her pride had demanded her silence, though.</p><p>It wasn’t so much that Lucian had been fucking the other woman, contradictory as it sounded; it was that he wasn’t fucking Tally.</p><p>“This is so stupid.” She rolled her eyes at her own thoughts.</p><p>She wasn’t jealous of Terrie—not really. She was just so damned consumed with the thought of Lucian, and now Dev, that she couldn’t make sense of anything else. She had been ever since their first meeting at Delacourte Electronics and their mocking appraisal of her as she led them into Jesse’s office.</p><p>She finished her champagne before leaning her head back against the bench and drawing in the warm night air. The steady sound of falling water, the heady scents of the night and her own weariness were about to get the best of her.</p><p>“Hiding, Tally?” Lucian’s smooth, dark voice had her eyes opening in resignation.</p><p>Had she known he would follow her?</p><p>She stared up at him, seeing the halo of light around the white-blond of his hair and silhouetting the wide breadth of his shoulders.</p><p>“Well, it should be pretty evident I wasn’t looking for company.” She injected what she hoped was just the right amount of cool mockery into her voice. It was hard to do after their last confrontation.</p><p>He chuckled. The sound was low and wickedly amused as she rose to her feet, intent on returning to the house. He had been furious when he left the week before, he and Dev both were literally fuming over what she had done. She expected a return of that anger now.</p><p>“Tally.” His hand on her arm as she moved to pass him stopped her. More from surprise, perhaps, than from anything else.</p><p>She stared up at him in the dim light, wondering at the serious cast of his expression. She had seen him mocking, sarcastic and downright furious. But she had never seen this expression on his face. Intent, his gaze shadowed with a bit of regret. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I missed you,” he whispered, his hand smoothing down her arm until he gripped her hand lightly, lifting it to his face.</p><p>Tally fought the tremor of response that started low in her belly and began to work its way through her body. His touch was gentle as he pressed her hand against his cheek. She could fight their dominance, enjoyed doing so actually. But this gentleness was destructive, weakening.</p><p>“Lucian.” She stopped, attempting to clear the huskiness from her throat. She hadn’t expected this. Didn’t expect this tenderness, this need that stirred a part of her soul she didn’t know could still respond.</p><p>“I thought of you while I was gone.” He turned his head, his lips pressing against her palm. “I dreamed of you. Often.”</p><p>Her hand trembled. His voice was dark and deep, stroking along her senses as the night breeze wafted over her skin. It was incredibly sensual, weakening.</p><p>“Everything ran really well at the office,” she reported desperately, uncertain how to respond, how to react. “Sax had a few problems with one of the contracts...”</p><p>“Tally, I don’t care about the damned office.” He moved closer, his free hand cupping her hip as he pulled her closer to him. “You run that place like a drill sergeant. I have no doubt everything went just as planned.”</p><p>If he had been irritated or if his voice had been snide she could have fought him, could have fought the hunger that curled through every cell of her body. Instead, a tender vein of amusement slid through his desire-rich tone and caused her chest to swell with pride. She was a damned good assistant and she knew it.</p><p>The next second, the office was forgotten completely as he laid her hand against his chest. He gripped her hips and before she could protest he lifted her to him, his lips settling at the corner of hers with heated need.</p><p>“I love how you taste, Tally,” he whispered as her fingers curled against his shoulders. “So sweet and hot. I dreamed of that taste. I woke aching for it. Dev and I barely managed to get through the week without you, we ached so desperately for you.”</p><p>“We?” She could barely still her groan as she felt the heat and hardness of his cock against her stomach, felt the air of tension that surrounded both of them now.</p><p>“Tell me you don’t want it, Tally,” he told her gently, his hand raising once again to push her hair back from her face as he stared down at her somberly. “Tell me you don’t want us both touching you, holding you into the night. That you don’t ache to know that either or both of us are there for you at any time you wish, willing to give you whatever you need.”</p><p>“Really Lucian, you should bottle the charm. You could make millions.” She swallowed tightly; the image of it had taunted her more than she wanted to admit to herself.</p><p>“Do you understand what we’re offering, Tally? Do you think you can play us against each other until you choose which of us you want?” he asked gently. “It wouldn’t matter, if you just had me. Or just had him. It wouldn’t matter where I was on this planet; I would feel him inside you. I would feel the tight clasp of your pussy on his cock, feel the heat of your body beneath his.” Her eyes widened as he continued. “That’s the bond we share, baby. What I love, he will always love. What I need, he hungers for as well. And vice versa. You belong to both of us, Tally. Forever. Imagine that, baby. Two of us to torture and drive insane. Think of the possibilities.”</p><p>Oh, the temptation of it. The utterly delicious carnality of the thought. All her fantasies, her desires, her dreams, rolled into two men at her beck and call. The thought was so tempting, so erotic, she wanted nothing more than to give into it.</p><p>Lucian’s hand cupped the back of her head, holding her steady as his lips smoothed over hers.</p><p>“Feel that?” he whispered. “Your lips beneath mine, the heat growing between us? Dev knows that now. He can feel your lips as well as I do, feel the fullness of them, taste the sweetness of them. Just as I tasted you last week. Just as he knew your touch, you knew I would feel it as well. Open your mouth, Tally, let me truly taste paradise now.”</p><p>She stared into his eyes, helpless now, trapped by the hunger and heat of his gaze.</p><p>“This is a mistake.” Tally fought to keep her voice strong, to remember how fragile emotion could be and how often absent it was in the cold light of day.</p><p>“A mistake?” he asked her gently, catching one hand and pulling it down his chest, over his hard abdomen until her fingers were cupping the rigid flesh contained beneath his silk slacks. “Feel that, Tally. Is it really a mistake?”</p><p>Tally shuddered, not because she ached so desperately for what she cupped in her hand, but because of the second pair of hands and the hard warm body suddenly behind her.</p><p>It was her personal fantasy. How did a woman fight her own fantasy? Especially one that had tormented her for nearly a decade. Two men, tall and strong, dominant, determined. Both men hungry for her.</p> <p>Her head fell back against Dev’s shoulder as he bent to her neck. At the same time, Lucian’s head bent as well, his lips covering hers, his tongue pressing fiercely between her lips to tangle with hers. It was blistering, intense. Sensation exploded beneath her skin as four male hands roamed her body, easing her, sending arcs of white-hot heat sizzling into the depths of her cunt.</p><p>She swore she would die from the pleasure. It wasn’t possible that one woman could endure such a high degree of carnal excitement. It surged through her bloodstream, whipped through her womb, spasmed into the depths of her pussy.</p><p>“Soft,” Dev whispered as Lucian’s kiss destroyed her sensibilities. “Such heat. You’re so hot, Tally, I wonder if we’ll survive it.”</p><p>His hands smoothed down the silk of her dress as Lucian moved one hand just below her breast. She cried out into his kiss, rising to her tiptoes, her hand gripping his neck as he held her close against him.</p><p>“I could eat you alive,” Dev growled as he pushed her hair aside, his lips moving to the sensitive nape of her neck as his hands roamed over the clenching cheeks of her ass.</p><p>Tally shuddered at the touch. She could feel her juices spilling from her pussy, dampening her thong as his hands gripped the material of her dress and began to ease it upward.</p><p>She couldn’t breathe and she didn’t care. Lucian’s tongue was an invader, conquering her mouth, swallowing her muffled screams of pleasure as Dev eased the silk over her rear and ran his fingers along bare flesh.</p><p>Her hands clenched in Lucian’s hair. Pleasure tore through her body, anticipation setting fire to every nerve ending she possessed.</p><p>“Damn, you have the most beautiful ass in the world, Tally.”</p><p>Lucian’s lips were frantic on hers now, his tongue plunging into her mouth as she writhed in his arms. Hot male hands parted her legs as Dev knelt behind her. Tally wondered if she could possibly survive so much as another second of their touch.</p><p>As Dev’s hand played with the curves of her ass, Lucian tore his mouth from hers, burying his lips in her neck as his hands pushed at the slender straps of her dress and eased them down her shoulders until the tops of her breasts were bared. She would have protested, would have worried that someone could come upon them if they hadn’t struck simultaneously.</p><p>Lucian nudged the silk over one hard nipple and enclosed it in his mouth as Dev nipped at a buttock, his hard hands parting the cheeks as his tongue began to paint hot, rapid designs much too close to the puckered entrance to her ass.</p><p>“Oh God! No more.” She arched in Lucian’s arms and, despite her words, held him close to her breast as she felt Dev moving the narrow band of her thong from between her buttocks.</p><p>The suction of his mouth on her flesh, his tongue whipping over her pierced nipple, his teeth alternately tugging at the small gold loop, had her pussy pulsing in frantic need. She was burning, melting, and Dev was suddenly there spreading her thighs wide as his head tilted between them, his tongue a lash of excruciating ecstasy as he lapped at the juices spilling from her cunt while one diabolical finger began to breech the entrance to her ass.</p><p>Lucian gripped her leg, just behind her knee, lifting it, bracing it against his hip as Dev’s lips and tongue began to torture the bare flesh of her cunt. His tongue slid inside her vagina, pumping in hard, tight strokes as she shuddered in Lucian’s arms.</p><p>It was unbearable. If they stopped she would die.</p><p>Dev’s finger screwed slowly, deep inside her anus, using the juices that slid from her cunt to ease his way. As her muscles adjusted to that small penetration, he added another, keeping the fiery tension alive, that small spark of pleasure/pain nearly sufficient to throw her over the edge.</p><p>“You’re so hot, you’ll burn us both alive,” Lucian groaned at her breast as he held her still for Dev’s explorations. “Does it feel good, baby? Do you like his tongue fucking you, his fingers preparing you?”</p><p>Tally shuddered, dazed with pleasure. This was too good. It was more than she had ever dreamed it would be.</p><p>“I could lift you now, Tally, push my cock up your tight pussy while Dev takes your hot little ass. All you have to do is ask me for it. Tell me you want it, Tally.” His voice was strained, hoarse from arousal as he raised his head to stare down at her in the dim light. “Now, Tally.”</p><p>She opened her mouth, the words trembling on her lips.</p><p>“Tally, are you out here?” They froze as Terrie’s voice called out imperatively. “I have an emergency in the house. I need your help.”</p><p>Like a splash of cold water her friend’s voice filled her senses. Dev cursed as he quickly moved back, smoothing the material of her dress over her buttocks as Lucian raised his head and stared down at her with a hunger that speared straight to her soul.</p><p>“Tally. I need you now.” Terrie’s voice brooked no refusal. “I know you’re out here.”</p><p>“Go home with us, Tally,” Lucian whispered, his fingers straightening her dress as she fought for her sanity. “I promise, you won’t regret it.”</p><p>“Tally,” Terrie called again, closer now.</p><p>“Tally?” Lucian’s voice was soft yet filled with demand. A demand that shook her to her core.</p><p>As much as she needed, as much as she knew she would regret it a second later, she also knew the price would be much too high.</p><p>“I can’t.” She stepped back from him quickly, watching his eyes narrow as determination stamped his features.</p><p>“Just a minute, Terrie.” She knew her voice was husky, not quite even, but couldn’t help it. “I’ll be right there.”</p><p>Silence filled the area for long seconds. “I’ll wait here,” Terrie called back, her voice determined now. Tally stared back at Lucian, furious with herself and with him.</p><p>“This can’t happen,” she told them both desperately, but knowing it was too late to ever go back. “It will not happen again. Fantasy time is over, boys. This has to stop.”</p><p>“You know it will happen again,” he warned her, his voice pulsing with arousal as Dev cursed again, his voice irate, husky with his own lust. “The next time there won’t be any interruptions, though. Think about that one, Ms. Jaded Tally.”</p><p>Her eyes widened as his words sank in, knowledge exploding through her head as she stared up at him. There were few people who knew her online persona as Jaded. So few that she could count them on one hand. Lucian should not have been one of them.</p><p>“Didn’t I tell you once that your little side life would rear up and bite you in the ass one day? Consider yourself bitten, baby.”</p><p>Wicked. Fury rushed through her bloodstream, white-hot and intense. He was Wicked, the online womanizing bastard! The cyber man of her dreams with a fetish for every fantasy that had ever entered her depraved imagination.</p><p>“You bastard,” she hissed. “You lied to me. All that time.”</p><p>“Like hell.” He was in her face, nearly nose to nose as he snarled back at her. “You gave yourself away, darlin’, when you started talking about Lucifer and his microchip for a brain. You should keep your online and offline insults separate if you want to hide.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She was trembling from fury. She couldn’t remember ever being so angry. She had shared things with Wicked. He had been her comfort, someone to be at ease with, someone she had thought understood. Pain seared her chest even as she acknowledged the fact that she should have expected it. Had even once suspected it.</p><p>“I’ll resign,” she snapped. “I’ll be damned if I’ll continue to work for you any longer.”</p><p>Lucian shrugged mockingly. “You’ll be too tired to work anyway, once we’re finished with you, so do what you please.”</p> <p>Her teeth snapped together as she fought to hold back her screams of outrage.</p><p>“I will not be your toy,” she informed him coldly. “Yours or Devril’s.”</p><p>His eyes narrowed. “You’ll be much more that that, Tally,” he told her darkly. “Like it or not, the countdown starts now. Enjoy your freedom while you can. I told you, baby, you made a mistake in the office that last day. You gave no quarter, damn you, I better not hear you asking for it.”</p><p>“That sounds like a threat.” She fought for imperious calm but was afraid she came across as viperously snide.</p><p>“I prefer to see it as a promise,” he told her enigmatically. “But you can take it however you like. We will have you, Tally, eventually.”</p> <p>“In your dreams.” She was shaking in fury now. Fury and lust. She didn’t know if she wanted to kill him or fuck him.</p><p>“Tally?” Terrie called out firmly. “Now.”</p><p>Tally’s lip curled insultingly as she stared at Lucian a second longer before she turned and hurried toward Terrie’s voice. She was flushed, furious and just plain tired. Dealing with Terrie now wasn’t something she was looking forward to.</p><p>Chapter Seven</p><p>Terrie had no emergency. Tally was almost amused when she realized her friend had followed Lucian and Dev, determined to protect her from whatever plans they had. The emergency had been no more than a ruse to get her out of their arms and back into the house so Terrie could assure herself that Tally knew what she was getting into.</p><p>She was furious, but a tiny part of her was amazed and in awe that they had managed to fool her so effectively. It had never been done before. This was a first for her. It would be funny if she weren’t so damned mad.</p> <p>“You can sleep here.” Terrie led her into the guest bedroom nearly an hour later after a less than polite argument on the merits of Tally spending the night.</p><p>Tally would have preferred the drive home to staying in a strange bed, but when Terrie got that wounded, hurt look on her face, it was damned near impossible to say no. They had been friends for too long, had been through too much together to let a man destroy that friendship.</p><p>“I’ll get you one of my gowns,” Terrie said softly as Tally sat wearily on the bed. “You know where everything else is.”</p><p>“Terrie, this really isn’t necessary.” Tally sighed. “I would truly prefer to just drive home.”</p><p>“And I would prefer that you stopped hiding from me,” Terrie said in that wounded voice Tally hated so much. “You’ve barely spoken to me in the last few months, Tally.”</p><p>“Jesse keeps you pretty busy.” Tally shrugged. “And we’ve done things. We’ve gone out to dinner and drinks.”</p><p>Tally stared around the bedroom, avoiding Terrie’s gaze. She didn’t want her friend to know exactly how much she missed the late night chats and periodic sprees to the tattoo artist or piercing salon. Terrie was one of the few friends she had that could appreciate such excursions.</p><p>“All very polite and very chilled.” Terrie plopped down on the corner of the bed. “Are you upset over that night with Jesse?”</p> <p>Tally grinned. Now that had been fun. Seeing Jesse Wyman cuffed to the bed, so horny he was about to explode as she and Terrie tormented him, was a pleasant memory. Knowing it only made him more wary of her made it all the more sweeter. Now there was a man who understood that it just wasn’t wise to tempt her fury.</p><p>“No. I’m not upset over that,” she chuckled. “I actually enjoy that deer-in-the-headlights look he gets each time I remind him of it.”</p><p>Terrie’s burst of laughter spurred her own.</p><p>“Yeah, he’s even more scared of you than he was to start with.” Terrie fell back on the bed, giggling at the thought. “He dares me to even mention it.”</p><p>Tally shook her head as she lay back as well, staring up at the ceiling. “That was fun,” she admitted. “It’s even more fun knowing he’s wary now. Perhaps that’s why he refused my request to stop the transfer to Conover’s.” She sighed, admitting she may have shot herself in the foot now.</p><p>Terrie breathed out roughly at that. “That wasn’t why.”</p><p>Turning her head, Tally watched her questioningly. “Then why?”</p><p>Terrie glanced at the door. “You can’t breathe a word that I told you. I don’t think I’m supposed to know.”</p><p>Tally rolled her eyes. “Yeah, yeah, yeah.” She waved her hand expressively. “Pinky promise and all that stuff. Now spill.”</p><p>“Lucian made it a condition of the merger,” she said softly, as though afraid the walls had ears. “I remember hearing them discuss it one evening before the wedding. Jesse was astonished at the request, until Lucian uhh...” She stifled her laughter.</p><p>“What?” Tally could feel her nerves increasing now.</p><p>“Well, Lucian informed him quite frankly that if he and Devril didn’t fuck you soon, their dicks were going to rot off from lack of use.” Terrie was fighting to hold back her laughter. “I thought it was hilarious. Then, Jesse made some weird comment about twins and their bonds and they began discussing the merger again. But I sensed an undercurrent there. Lucian isn’t playing, Tally. He intends on sharing you with Devril.”</p><p>“Hell.” She stared up at the ceiling again, trying to make sense of why Lucian would go to such lengths to get her in his bed.</p><p>“Jesse isn’t telling me much about this,” Terrie told her worriedly. “But I get the impression, Tally, that whatever happens, it won’t be with just one of the brothers. And it won’t be just occasionally, as it is with the others. Jesse makes it sound as though Dev and Lucian will share you permanently.”</p><p>That worried Terrie. Tally could see the concern in her friend’s gaze.</p><p>“Yes, well, let them plot and plan.” She shrugged as she gave her friend a smile filled with false confidence. “I can handle it, Terrie.”</p><p>The thought of both men sharing her, taking her on a daily basis, wasn’t nearly as worrisome as the flare of excitement and mingled possessiveness she was beginning to feel for both of them.</p><p>“Tally, can’t you tell me why you’ve been upset with me?” Terrie asked her, suddenly changing the subject, surprising her with the question. “We’ve been friends for so long. I hate having this between us.”</p><p>Friendships equaled complications, especially when they were as close as she and Terrie were.</p><p>She took a deep breath and turned back to look at her friend. “I’m not upset with you,” she said in resignation. “I’m upset with myself.”</p><p>Rising from the bed, Tally glanced at Terrie’s questioning expression before pacing to the high window beside it.</p><p>“I came into the office the evening you were there with Jesse and Lucian,” Tally finally said, a wry smile tipping her lips. “I was horribly jealous, you know.”</p><p>“Jealous?” Terrie turned back to her at the incredulous question. “Why?”</p><p>“Because you were with Lucian,” she said softly, seeing the moment that Terrie realized exactly what she meant.</p><p>Terrie blinked in surprise. “You wanted Lucian?”</p><p>Tally grimaced lightly at her own admission. “Terribly, I’m afraid,” she said. “But the problem is, Terrie, I know that once I’ve been with him and Devril, I won’t want to let either of them go. I’m a greedy person, I’ve told you this before. They can hurt me,” she said simply.</p><p>“Oh. Dear.” Terrie was staring at her in amazement. “Uhh, Tally, are you in love with Lucian and Devril?”</p><p>Tally moved to the chair beside the window and sat down heavily. “Perhaps.” She shrugged. “So you see, it’s becoming rather complicated.”</p><p>“Pretty surprising to me,” Terrie admitted as she pulled one of the plump pillows from the head of the bed and wrapped her arms around it. “What are you going to do?”</p><p>Tally smoothed the skirt of her dress slowly, watching as her fingers adjusted the hemline as though being certain she did it right. When she finally raised her gaze to Terrie she had managed to get a handle on her emotions.</p><p>“I have several applications in at a firm in New York,” Tally finally admitted. “If things work out, I’ll be leaving soon.”</p><p>“You’re running?” Terrie asked incredulously. “Tally, you never run.”</p><p>Tally leaned back in her chair, assuming a careless pose of negligent indulgence. “Well, it appears I do after all,” she finally said with a self-deprecating smile. “A very odd feeling, I must admit. But, I’ve found no other answer.”</p><p>Terrie shook her head in protest. “Why fight them? If you want it, why not go for it? Holding back doesn’t sound like something you do, Tally.”</p><p>Normally, it wouldn’t be, Tally admitted silently. She had never conceded defeat in her life. It rankled that she would now.</p><p>“In this case, holding back is the only answer,” Tally said softly. “Trust me, Terrie, it would never work, and I don’t want the heartache when it doesn’t. It’s best that I leave as soon as possible.” Better for her heart definitely. As well as Lucian’s safety, if he ever decided he was tired of her. She feared she might kill him if he took another woman after her.</p><p>Terrie watched her closely for long minutes as the silence deepened around them.</p><p>“I love how you lie to yourself, Tally,” she finally said gently, rising from the bed as Tally watched her in surprise.</p><p>“I never lie to myself,” she snapped in defense.</p><p>Terrie shook her head slowly. “I love you like I love my own sisters.” She sighed. “So I can tell you, you are lying to yourself. It’s losing all that hard won control that you’re terrified of, not any heartache you might suffer. Lucian threatens that. You can’t push him away, you can’t intimidate him, so instead you’re going to run.” She grimaced mockingly. “Lucian won by default because you’re not brave enough to see which of you is the strongest. You’re afraid you’ll lose, so you’re giving up.”</p><p>“I don’t think so,” Tally snapped, uncomfortably aware of the fact that often her friend saw too much. “Lucian has nothing to do with my control.”</p><p>“Of course he does.” Terrie laughed gaily. “He shakes it every time he looks at you. And don’t even try to tell me he didn’t almost have you out in the garden. I heard those moans. You’re losing your edge, Tally, and you can’t handle it.”</p><p>Tally came to her feet slowly, her eyes narrowing on the other woman. “Not in this lifetime.” She managed cool humor but she could feel the anger whipping in her mind.</p><p>“Really?” Terrie crossed her arms over her breasts, her expression mocking. “Prove it.”</p><p>“Prove it?” Tally felt like snarling. “And how do you expect me to do that? There’s nothing to prove.”</p><p>“Isn’t there, Tally?” Terrie was serious now. That was always a bad sign. “What about proving to yourself that you’re worthy of love? But beyond that, there’s proving that you aren’t a coward. We both know how much you hate cowards.”</p><p>Tally snarled. “That’s playing dirty, Terrie.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah.” Terrie grinned widely. “I do things like that when I see my friends tucking their tails between their legs and scampering off like puppies. Especially when they refused to let me do the same. Trust me, you’ll thank me.”</p><p>“I’ll kill you,” Tally snapped. “Right after I kill Lucian and Devril.”</p><p>Terrie shrugged. “Whatever works for you, darlin’. Now I’ll say good night so you can plot and plan. You’re so good at managing the rest of us, Tally, let’s see if you can manage Lucian as easily.”</p> <p>Chapter Eight</p><p>Terrie had outmaneuvered her. Somehow, somewhere, she had managed to blindside her and at the same time, ensure her downfall. It wasn’t so much the challenge, though Tally thrived on a good, honest challenge; it was more the object of the challenge. Could she bring Lucian and Devril to their knees?</p><p>She had been so concerned with protecting her heart, her emotions, that she hadn’t truly considered attempting to win theirs. Could it be done? They were strong, dominating men, alphas in the truest sense of the word, so it wouldn’t be easy. But, perhaps it could be done. The very thought of success was enough to get her blood pumping, her excitement level rising.</p><p>They were men, she told herself as she entered her office two days later. How hard could it be?</p><p>“Tally, it’s about time you showed up.” Lucian slammed the upper file cabinet drawer closed, frowning as she strode calmly to her desk and stored her purse. “You’re late.”</p> <p>“Not hardly,” she informed him with cool disdain as she checked the clock above the file cabinet. “I’m a minute early, actually. Why are you in my file cabinet?”</p><p>It was one of the reasons she hated dealing with files. She could keep them in perfect order, then Lucian, just as Jesse did, could mess them up with seemingly no effort at all.</p><p>“Looking for a file, obviously,” he grunted. “Where were you all weekend? I called.”</p><p>And he had, several times a day.</p><p>“It’s none of your business where I was this weekend. Which file were you looking for?” She arched her brows in inquiry.</p><p>“Anderhaul’s.” He was watching her intently now. “And I’m making it my business. You weren’t at home or online. I checked.”</p> <p>“You wouldn’t know if I was online, Lucian,” she told him calmly as she opened the drawer and attempted to hide the struggle to peer into the top file as she began to search through the files. It took her only seconds to locate it. “Here you go.” She handed him the file efficiently before closing the drawer and going back to her desk.</p><p>“Why wouldn’t I know if you were online?” He was definitely irate.</p><p>“Because I now have you blocked.” She shrugged. “I don’t like liars and I refuse to talk to them.” She kept her voice even, carefully modulated; she knew it was guaranteed to set his nerves on edge.</p><p>“I did not lie to you, Tally,” he practically snarled. “I could have continued the charade but I didn’t want that between us.”</p><p>“How very decent of you.” She bared her teeth when she smiled. The very thought of the things she had shared with him made her furious.</p><p>“I could give you the things you need, Tally,” he told her softly. “All those dark little fantasies you try so hard to keep locked away; they could be yours.”</p><p>Tally took her seat at her desk, smoothed her skirt over her legs and adjusted the cuffs of her royal blue silk blouse before raising her gaze to meet his coolly.</p><p>“You have a nine-thirty appointment with the head of security to discuss the security measures being installed in the new labs, and right after that a meeting with Jesse to discuss the homing software the design engineers are developing. I laid the files out Friday before I left.” She ignored his offer, though she couldn’t deny the thrill of danger that exploded through her system.</p> <p>Lucian’s eyes narrowed on her. “Make certain coffee and danish are available. I’ll need you at the meeting with Jesse since you were aware of the early stages of the contract to design the software. We’ll be working through lunch, so you might want to order in.”</p><p>Great. Working through lunch. She had hoped to escape him for at least a little while.</p><p>“I’ll contact Breilla’s.” She made a note to call one of the better establishments in the city. “Anything else, Master?” she asked sarcastically.</p><p>“Let me see those nipple rings.” The request was made as easily as one for a file would be.</p><p>Tally leaned back in her chair and regarded him curiously. She didn’t dare, not with the door unlocked, but how she would love to bring him down a notch or two. She lifted one hand teasingly, her fingers running over the small pearl buttons as she smiled back at him tauntingly.</p><p>It was just too much fun, teasing him and Dev in this manner. It was almost addictive.</p><p>“What will you give me?” she asked flirtatiously, her gaze dipping down to the bulge straining against his pants as she lifted her eyebrow suggestively.</p><p>Amusement flared in his brilliant green eyes and quirked the edges of his lips.</p><p>“I’ll keep your teasing in mind until the minute I have you stretched across my lap, ready for the spanking I’m certain you’ll deserve, and oh so enjoy,” he murmured as he moved closer to her desk, staring down at her with a sudden dark hunger that had her pulse leaping in response.</p><p>She sighed expressively, lowering her eyes demurely before peeking back up at him through her eyelashes. “Promise? Until then, be a good little boss and go make yourself useful so I can finish my own chores. I’ll let you know when your first meeting arrives.” She dismissed him coolly, turning to power the computer up and begin the day.</p><p>Tally gave the appearance of restraining a mocking smile, though her pussy was weeping, clenching in arousal.</p><p>She was aware of him watching her for long moments and the reflective expression that came over his face as she continued to ignore him. She had no doubt that he was planning her punishment with great relish. But he had been doing that for months now.</p><p>“There are days, Tally,” he finally sighed, “that it’s a damned good thing I’ve become so fond of you. Otherwise, I think I’d find a deep, deep hole to bury you in.”</p><p>From the corner of her eye she watched as he turned and walked to the open doorway of his own office. When the door closed behind him, she stared down at the slight tremble in her fingers. Fond of her? It was little enough, but it struck a chord deep inside her. It wasn’t the words, but his tone. Deep, intense, making her want to believe it was conveying so much more than words spoken.</p><p>Wishful thinking. She drew in a deep breath, fought to regain her composure and turned back to the computer. She didn’t have time for wishful thinking.</p><p>Lucian managed, just barely, to put aside the hunger building in his cock and attend to business that morning as needed. It was the afternoon he was awaiting. His calendar was clear for the rest of the day and he intended to begin the seduction of Tally then. He knew he was courting a sexual harassment suit; hell, if he were Tally he would have likely already slapped one in his face. The only thing saving him, he knew, was that she wanted him just as badly as he wanted her.</p><p>He knew she did. He could see it in her eyes, the knowledge that he held the key to her darkest desires. He knew her as very few people did. She had given him the key to her downfall and it made her madder than hell to know it.</p><p>The meetings progressed quickly. Thankfully, there seemed to be no glitches in the present projects and everything was running smoothly. Lunch was eaten during the final meeting with Anderhaul amid discussion of the finalized contract. The meeting moved quickly and just before two, the office had cleared out of everyone except Lucian, Devril and Tally.</p><p>Not that Tally hadn’t tried to escape, more than once. Thankfully, the work involved in keeping notes on the meeting as well as helping to clear the office later had kept her there.</p><p>“Tally, make a note to contact Jesse regarding the new chips we’ll need for the Anderhaul project. That one should go quickly and make us a tidy little profit to boot.”</p><p>“Noted.” She made the addition to her notebook, tucking back a stray strand of long black silk that had fallen over her shoulder.</p><p>Lucian paused, watching her. She was small, small enough that he wondered if she could possibly handle both he and Devril taking her at once. They were both tall, broad men. Tally was delicate, exquisitely curved with full breasts and luscious hips, but tiny all the same. It never ceased to amaze him the hunger he felt for her. She wasn’t the type of woman he had thought his heart would eventually settle on. She was smart–mouthed, coolly mocking, and possessed a razor-edged wit that had often left him gritting his teeth and fuming in anger. On the other hand, she made him so damned horny he could barely breathe comfortably, and he knew she did the same to Devril.</p><p>There was the crux of the matter. Unlike the other members of The Club, sharing his woman wouldn’t be an occasional thing. He had learned early in life that the bond he shared with his twin would never allow for anything so conventional. The moment they set eyes on Tally, both men had known instantly what they wanted from her. She wouldn’t have one lover, but two, nightly, daily, because she owned both their hearts.</p><p>Lucian glanced at his brother, sensing his building arousal, just as he knew Devril would sense his own. It was a connection they had grown used to over the years and Lucian knew he wouldn’t wish it any other way. Just as he knew that eventually it might cost them the woman they loved.</p><p>His gaze returned to her, watching as she began to straighten the files scattered across the low coffee table of the meeting area. Her skirt was conservative, the black silk ending an inch below her knees. Black pumps fit over her small feet, low heeled, sedate. She exuded class and breeding, old money and genteel sensibilities. Unless you glimpsed the parts she kept carefully hidden.</p><p>Jaded. It was her Internet identity, but there were times Lucian suspected it also described her outlook on relationships and men. She was, at heart, a sexual little wildcat who had given up on the fulfillment of her own fantasies. Fantasies Lucian and Devril were determined to bring to life.</p><p>Lucian turned the lock on the office door decisively. The snick of the small mechanism had Tally tensing, her head rising slowly as she gazed back at him. Her nipples hardened instantly. He was watching for that, needed to see it.</p><p>Devril lounged back on the wide couch watching her as well, though leaving the first move up to Lucian.</p><p>“Unbutton your blouse,” Lucian ordered softly as he began to advance on her. “Slowly.”</p><p>“Do I look like your personal stripper?” she asked archly, amusement glittering in her gaze.</p><p>She had been expecting this. He could see it in her eyes, in the excitement that pulsed at the vein in her neck.</p><p>“If that’s what I want,” he said carefully. “We’re about to lay some ground rules here, Tally.” He watched the heat ignite in her eyes, the way her breasts seemed to swell beneath the silk of her shirt.</p><p>“Oh, we are?” she questioned him softly. “Your rules, I’ll presume?”</p><p>He shook his head slowly. “Our rules, Tally. Never just mine or Dev’s. All of us. We’re alone now. No business, no witnesses. No more games. Come on, baby, don’t you at least want to see how good it could be?” He kept his voice soft, gentle.</p><p>Tally was an expert with the comebacks. She could hold her own in any confrontation. He didn’t want their relationship to be a confrontation. He wanted her sweet and wild in his arms, his name a cry on her lips.</p><p>She blinked before licking her lips in the first sign of nervousness he believed he had ever seen out of her as she considered his words.</p><p>“We can’t go on like this, baby,” he told her gently, watching her, letting her see the need now. “It’s your choice. If you walk out of here now, then that’s it. No more. We’ve never forced ourselves on a woman in our lives. We won’t start now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She drew in a deep, hard breath.</p><p>“And if I choose to stay?” she asked him.</p><p>“Then you get both of us. Separately, together, however we wish it, any given time when work doesn’t interfere. This won’t work like Jesse and Terrie’s relationship, or James and Ella’s. Devril and I share, Tally, consistently, regularly.”</p><p>She looked around the office then. “Do you guys ever do anything sexual outside the office?” she asked.</p><p>“If the opportunity presented itself,” Devril said. “Unfortunately, you were hiding this past weekend. It limited the choices.”</p><p>Her gaze flickered to Devril a bit nervously.</p><p>“Come on, baby, unbutton the blouse,” Dev asked her then, rather than ordering her. “We’ll begin here.”</p><p>Chapter Nine</p><p>Tally barely controlled the trembling of her fingers as she pulled her blouse free of her skirt. She kept each movement seductive, sedate. Excitement raced through her body, but that was no reason not to enjoy the experience. She had no idea what they intended and the jittery excitement that caused was making her uncomfortably aware of her entire body. Especially the area between her thighs. She was wetter than she could ever remember being during a sexual situation and it was close to frightening.</p><p>As the hem of her blouse cleared her skirt, she cast them a teasing look from beneath her lowered lashes. They were hot, horny. Their faces were flushed with arousal, their eyes brimming with it. She loved it. It was her greatest challenge, controlling these two men.</p><p>She began loosening the buttons slowly, watching as their eyes followed each movement, their hands clenching into fists as they fought for control of their own desires. Electrified excitement raced through her veins. Anticipation built in waves of sensual awareness as she performed the daring, taunting little striptease.</p><p>She had worn only a demi-bra beneath her blouse; the sheer navy lace did little to hide the gold hoops that pierced her distended nipples. With her shirt unbuttoned, very little would be hidden from their gazes.</p><p>They stood side-by-side now, only a few feet between them and her as the last button slid free and the edges of her shirt parted. She watched them closely, aware of the sexual tension, the blistering aura of energy that seemed to leap from them and surround her.</p><p>She had been with two brothers before, she had no fear of the experience to come, but there was something different about Lucian and Devril. Some intangible something that caressed her flesh with ghostly fingers and denied her the ability to refuse them.</p><p>She was experienced but she wasn’t promiscuous. She was nearly thirty years old and well aware of her power as a woman, until it came to these two men. With them, she felt as nervous, as shaky, as a virgin facing her first lover.</p><p>“You are incredibly beautiful,” Devril said as they approached her.</p><p>Tally held herself carefully still as the two men came along each side of her. They towered over her, her head barely clearing their chests, making her vulnerable, making her aware of her femininity, the weaknesses of her smaller body. It was a feeling she wasn’t accustomed to.</p><p>“Come here, baby.” Lucian pressed her head against his chest, holding her there as his other hand followed Devril’s and pulled the side of her blouse from the swollen flesh of her breast.</p><p>Both men groaned heavily as they revealed the prize they had sought.</p><p>“How beautiful.” Lucian sighed as the backs of his fingers smoothed over the curve of her breast while Devril cupped the other in his worker’s hands.</p><p>The heat of Devril’s palm seared through the lace of her navy demi-bra while Lucian’s calloused fingers caressed the engorged nipple of the other. As the hardened little nub became more sensitive, the weight of the gold ring became more pronounced, tormenting her with the light weight of it.</p><p>She fought to keep from panting but she could feel the light film of perspiration gathering on her forehead. The tremors of arousal were becoming harder to still with each passing minute. She could feel her control threatening to crumble and fought it with every breath she took.</p> <p>“So cool and controlled,” Devril murmured, a shade of amusement coloring his voice as his lips lowered to her shoulder. “How long can you keep that control, Tally?”</p><p>She closed her eyes, awash in sensation, in pleasure, as Lucian adjusted his stance, his hand still cupping the back of her head, his own head lowering.</p><p>She whimpered when his mouth covered her nipple. She couldn’t hold back the sound, or her own pleasure. His tongue played mercilessly with the weight of gold, his mouth drawing on her flesh deeply as Devril followed suit with the other mound. She was caught between them, a feast of sensuality to their lustful appetites.</p><p>Tally clenched her thighs tightly together as the twin mouths worked at her flesh, consuming her, feeding from hard, erect nipples, licking and sucking as she arched into their touch, her body flaming with arousal. Intense pleasure bombarded her senses with the need to be taken. Her pussy was flaming, burning with hunger, demanding fulfillment.</p><p>She shifted between the two men, searching for relief as she fought back the pleas, the deep moans of surrender. She needed to be touched, taken.</p><p>“Damn, Tally, you’re killing me,” Lucian groaned at her breast as Devril suddenly took the responsibility of holding her upright.</p><p>Lucian’s mouth left her breast, his tongue giving it a final lick before Dev pulled her against his chest and lowered them both to the chair behind him. His hands covered her breasts, his fingers rasping her nipples, pulling on the gold rings as Lucian knelt before them.</p><p>Tally watched him through dazed eyes. Behind her, Devril was breathing harshly; his head lowered to her neck, his lips and tongue caressing her flesh with devastating results.</p><p>She fought to breathe as Lucian began to push her skirt over her thighs. Devril aided him by lifting her, adjusting her on his knees until she was spread out before Lucian like some sensual offering to his lust. His hands caressed her legs, her thighs, as he pushed the skirt to her hips, revealing the navy lace thong that covered the bare, plump lips of her pussy.</p><p>She drew in a hard breath as Devril spread her thighs with his knees, opening her for Lucian’s pleasure as she stared back at him in dazed fascination. She fought to steel herself, to prepare herself for his touch, but when it came it was like a blow of hard pleasure straight to her womb.</p><p>His fingers did no more than smooth over the damp triangle of fabric as his lips parted, his tongue licking over them slowly.</p><p>“You’re wet, Tally,” Lucian whispered roughly.</p><p>“It would seem so,” she quipped, fighting back the guttural moan rising in her chest.</p><p>He grinned, his eyes flaring with amusement at her catty tone.</p><p>“You are such a bad girl,” he whispered as his thumb located the small ring that pierced the hood of her clit.</p><p>“Really?” Her breathing was jerky, her voice hoarse. “So what are you going to do about it?”</p><p>Lucian chuckled, his hot breath caressing her moist flesh with the sound.</p><p>Tally jerked in response, her eyelids fluttering closed as pleasure overwhelmed her.</p><p>“Are you going to tease me all day or do something?” She was not panting, she assured herself. Controlling her breathing was becoming more difficult by the second, though. She was growing weak, dazed. The sensual teasing of Devril’s hands on her breasts, his fingers tugging at the rings as his lips caressed her neck, was bad enough. But Lucian, kneeling between her thighs, his fingers slowly removing the damp thong, was almost enough to send her over the edge.</p><p>“I’m going to do something,” Lucian whispered. “I’m going to make you scream, Tally.”</p><p>If anyone could, it would be Lucian, but Tally was just as determined that she would hold on to that last bit of her defenses. She had never screamed. She wasn’t about to start now.</p><p>Helplessly trapped against Devril’s hard body, she watched as Lucian’s head lowered. His thumbs spread the plump lips of her cunt apart, revealing her swollen clit and the ring of gold that graced it.</p><p>He seemed fascinated with the piercing. His tongue played over the ring, tugging at it sensually, moving it around, up and down, until Tally was lifting to his mouth, flames leaping from her pussy to sear the rest of her body with the driving need for orgasm.</p><p>It was intense. Too intense. She could feel her mind dissolving beneath the sensual rush of pleasure, her nerve endings catching fire as the knot of sensation began to tighten in her womb.</p><p>She needed to be fucked. She needed it now. Enough of the torture, of the slow games... Her moan echoed around her as Lucian eased his finger inside the burning depths of her pussy. His tongue played sadistic games of lust against her clit as his finger fucked her with short, shallow strokes.</p><p>“Lucian, fuck me.” She was panting now. Panting was okay. Damn, it felt so good, so blistering hot and exciting she could barely stand it.</p><p>“Not yet,” he whispered against her soaked flesh. “Soon, baby, but not yet.”</p><p>“No.” She shook her head against Devril’s chest as his teeth nipped at her neck. “Now. Fuck me now.” She arched into his thrusting finger, gritting her teeth in an agony of need as her hands tangled in his hair, struggling to attain her release.</p><p>Devril’s fingers tightened on her straining nipples, sending a hard burst of pleasure/pain streaking through her breasts at the same time Lucian added another finger to the first and thrust them hard inside her straining pussy.</p><p>So close. She whimpered, her breath catching at the intensity of the pleasure as she fought to reach that final threshold. Why were they tormenting her? She could feel Devril’s cock like a wedge of steel beneath his jeans at her back, and she knew Lucian’s was like a length of iron beneath his slacks. Why weren’t they fucking her? Especially when she needed it so damned bad.</p><p>“Come for me, Tally,” Lucian whispered against her clit, his fingers fucking her with exciting roughness as the muscles of her vagina clenched around them.</p><p>She needed more. She was reaching desperately for the pinnacle but it wasn’t there.</p><p>“Fuck me.” She gripped his hair tighter, trying to pull him closer, desperate now to find the release tormenting her body.</p><p>“No yet.” He was breathing hard, rough. “Come for me, Tally. Now.”</p><p>His lips clamped over her clit, suckling it into his mouth as his tongue flickered over it with velvet roughness. Tally couldn’t halt the sob that escaped her chest. It wasn’t enough. She knew it wouldn’t be enough. She bit her lip, holding back the fury and the screams of disappointment as she strained against him, fighting to climax, to escape the searing knowledge that her body needed more.</p><p>It was like a splash of icy water, that knowledge that she wouldn’t find her release, that Lucian and Devril would suspect the secret she fought to keep so carefully hidden. Agonized, her chest exploding with fear, she took the only option left to her. She faked it. She tightened in Devril’s arms, feigning her release, working the muscles of her pussy in a spasmodic clench as she released a muttered moan of satisfaction. In this, her secret would be safe.</p><p>Chapter Ten</p><p>Lucian hid his surprise, his shock. It wasn’t easy and he was well aware that Devril was doing the same. She had actually attempted to fake her orgasm. He couldn’t believe it. He slid his fingers slowly from the fisted grip of her pussy, feeling the ripples of regret in the soft tissue as he retreated and fought to tamp down his anger.</p><p>He couldn’t believe she had dared anything so reckless, so completely unneeded, as what she had just done. Rather than giving in to her own desires, her body’s demand that she release the control she prized so highly, she had instead staged an orgasm so blatantly false that he wanted to paddle her ass for even attempting it.</p><p>Lucian raised his eyes, keeping his gaze hooded as he looked up at her. She was staring at the ceiling, her expression tense, her body taut with both unfulfilled desire and nerves.</p><p>She had a right to be nervous. His eyes met Devril’s; in them he saw the same anger he could feel growing inside himself. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Let me go now.” Cool, calm, as though she hadn’t just begged them to fuck her, hadn’t been trembling in their arms as she fought for her release.</p><p>He nodded slowly to his brother, watching as the large hands slid away from the dusky, passion-flushed breasts they had covered. Her nipples were hard, reddened, her arousal in no way abated. She had cheated not just him and Devril, but herself as well, in such a manner that he wondered how often she had done it before. It was a practiced, well-versed move. One that a man of lesser experience might not have caught. But Lucian had caught it, and though now wasn’t the time to force her past the control she was fighting so hard to maintain, he vowed that soon he would push her past that and more.</p><p>Lucian moved back from her slowly, coming to his feet as she stumbled away from Devril. Jerking her blouse from the back of the chair, she quickly pulled it over her arms. Her hands were trembling; her long hair was tangled and mussed, her cheeks flushed with both anger and need. She kept her head lowered, but from her profile he could see the emotions chasing across her face, the fear and vulnerability, the fight for control. Her and her fucking control. He’d had enough of it.</p> <p>“Do you think I’m that big of a fool, Tally?” he asked her softly.</p><p>She paused in her attempts to button her shirt, freezing before him, searching desperately for explanations, he could tell.</p><p>“Don’t bother lying to me, Tally.” He lifted her chin with his hand, staring into those incredible brown eyes and for the first time, seeing a vulnerability he hadn’t suspected her of. “Tell me why.”</p><p>She swallowed tightly before jerking away from him and quickly securing the remaining buttons of her shirt as she pushed her feet into her shoes.</p><p>“I’m leaving.” Her voice was husky, remnants of desire and shades of fear shadowing it. “I won’t be back.”</p> <p>He crossed his arms over his chest as Devril moved to her.</p><p>“Do you really think running is going to help, Tally?” Dev asked her gently. Lucian could sense his brother’s need for action, to ease her, to take away the pain and fear they could both see in her face.</p><p>Her head rose, fury engulfing her expression for one shattering moment before cool mockery overcame it.</p><p>“Such arrogance,” she said imperiously. “I’m not running, I’m merely disinterested now. You tried, you failed. Too bad, so sad.” She shrugged negligently. “No harm done.”</p><p>Then she raised her head proudly and though Lucian could sense her need to make a graceful exit, she was practically running for the door.</p><p>“Tally, do you really think this is over?” He followed her, pausing in the doorway and watching as she jerked her purse from the desk.</p> <p>As she turned back to speak to him the outer door opened and Jesse and Terrie walked in before stopping and staring at Tally in amazement. Dev watched fleeting horror cross her face before she rushed past them and out of the office.</p><p>“Dammit.” Devril cursed furiously as he started through the door.</p><p>“Wait,” Lucian cautioned him. “Let her go for now.”</p><p>“What the hell has happened here?” Terrie turned from the door, anger filling her face. “What did you do to her?”</p><p>“Not nearly enough, I would suspect.” Lucian pushed his fingers wearily through his hair as he turned back to Devril. “Make sure she gets home okay. I’ll be there later.”</p><p>“You shouldn’t have let her leave,” Devril snapped, his green eyes coldly furious. “Dammit, Lucian, she was in no shape to be walking out of here.”</p><p>“She was in no condition to fight.” Lucian sighed. “Follow her home. We’ll decide what to do later.”</p><p>Devril stalked from the offices and Lucian turned back to face Jesse and Terrie’s concern.</p> <p>“You and I need to talk,” he told Terrie. “There are obviously a few details about your friend Tally that you neglected to mention in the past few months. I think it would be a good idea if you mentioned them now.”</p><p>She had made such a fool of herself. Tally accelerated out of the company parking lot, barely missing an incoming employee as she rounded the curve and headed for the freeway.</p><p>She breathed in deeply, fighting the excess emotion straining to be free. She needed to scream or rage or something. It had never been like that. Never before had an orgasm completely eluded her in such a way. They were often not satisfying, barely taking the edge off the hunger that strained inside her, but rarely had she failed to achieve any relief at all, and with such horrifying results. They had known. Her fingers clenched on the steering wheel as fear and humiliation swept over her. They were aware that she had faked the release; that she had been unable to achieve her orgasm despite the fierce, exacting pleasure sweeping through her body.</p><p>God, it had felt so good. Their hands, their mouths, Lucian’s lips at her clit, his tongue raking the little gold ring that pierced it. The pleasure had been unlike anything she had known in her life, sweeping through her, sensitizing every nerve and cell in her body until the need for release had consumed her. Yet the harder she had reached for it, the farther away it seemed.</p><p>She was burning now. Her skirt was hopelessly stained with her own juices, she knew, and horribly wrinkled. Wrinkles were a sign of sloppiness, both of mind and of appearance; the sisters of the Catholic school she had once attended had lectured that point to her constantly. Her blouse wasn’t even buttoned straight. She clenched her teeth against the overwhelming urge to scream out her mortification.</p><p>Years—years of careful control, of watching every move she made, controlling every hidden impulse and presenting an appearance of unshakable calm had been destroyed at the hands of the two men who now knew her most shameful secret.</p><p>She needed the pain.</p><p>A low growl of fury passed her lips before she throttled it back and once again forcibly controlled her inborn fury. They were dominants, for pity’s sake. Trojans. Part of the much whispered about Club. They liked their sex wild and rough, their women submissive and screaming, not whimpering from the gentleness of their touch. Of all the men she had thought could bring her to mind-blowing orgasm, she had thought Lucian and Devril surely could.</p><p>The drive to the upscale apartment complex where she lived was made in record time. She refused to admit she was speeding. She never broke the law. It was a point of pride for her. Just as an unwrinkled skirt, smooth hair and unblemished skin were points of pride. One’s inner person was reflected in the way she carried herself, how she handled hardships. She grimaced at the thought. Why were those old, harshly worded lectures tormenting her now? The good sisters of the St. Augustine’s Academy were a part of her past, or so she had tried to convince herself.</p><p>Tally, only whores wear skirts above their knees. You must rise above such hedonistic impulses. Your parents deserve so much more than such a disrespectful child...</p><p>What shame you bring to your parents, Tally. Such disgrace...</p><p>If your mind must become the Devil’s playground, the least you could do is give an outward appearance of decency. Even the prostitutes that stroll the streets show more decorum...</p><p>She shook her head, parking the car and heading quickly for the cool silence of her apartment. She needed a shower. A cold shower. She needed to forget that she was different, that her needs were so depraved that even a Trojan couldn’t fulfill them.</p><p>Cool silence greeted her as she entered her apartment. It was dim, perfectly neat and spotless, and so cold. Tally stared at the desert tones of the living room. Despite the warm colors, the room was cold, sterile and unwelcoming, just like her life.</p><p>Her fists clenched as she fought back the need to move something, anything. To scatter the potpourri filling the jade vase across the floor. To shatter the crystal against the wall. She wanted to destroy the very essence of what her life had become. Sterile. Unlived and unloved.</p><p>“Stop it.” She breathed in roughly, pushing herself away from the door and striding quickly through the room. The dining room was no different. The heavy oak table had never known a spot of food spilled on it. She couldn’t remember the last time she had used the stove in the kitchen.</p><p>The dark hardwood floor didn’t have so much as a stain on it and her carpets, even after five years, appeared in flawless condition. Her bedroom... She stepped into the room and stared around it silently. There was no life here. No memories. Not even sullied ones. She had never brought a lover to her home, had never fouled her bedroom with the unnatural desires that twisted through her mind.</p><p>She had never realized how perfectly the good sisters had conditioned her. She had never known how empty her life had become until now. Until she had been forced to walk—no she hadn’t walked, she had run—from something she hadn’t realized she needed. Lucian and Devril.</p><p>She walked over to the bed, her hand smoothing stiffly over the white bedspread, fighting to ignore the compulsion to clench her fingers into the fabric and rip it to the floor.</p><p>Enough. She straightened her shoulders and turned, forcing herself to walk sedately into the bathroom. She undressed, stuffed the skirt and blouse into the wastebasket before dropping the demi-bra in after it.</p><p>She twisted on the cold water to the shower, watching the pounding spray run into the glass cubicle before stepping beneath it. Her breath caught as ice seemed to envelop her skin, pouring through her hair, over her face, stealing her breath. Washing away the proof of the hot tears that finally fell.</p><p>Chapter Eleven</p><p>Self-control, that much sought after, often sadly lamented virtue, should not have the destructive, unforgiving undertones that Dev had glimpsed in Tally’s wounded brown eyes. It shouldn’t cause a passionate, vibrant woman to deny the very heart of her sexuality, nor leave her sobbing beneath the force of a shower whose chill could be felt outside the glass cubicle she stood within. But that was exactly what it had done.</p><p>Dev and Lucian had known for quite some time that Tally Raines was unique, a challenge unlike any woman they had known in their lives. The fact that they had slowly, over the past year, fallen in love with her, wasn’t the point. They had seen in her a strength of will that often mirrored their own, and a loneliness that echoed in their chests.</p><p>He and Lucian had, despite all appearances, lived a quiet, often lonely life. The bond they shared was more intense than most other twins, stemming, he thought, from the fact that they were fraternal rather than identical twins. The first years of their lives they had been largely separated by their divorced parents, seeing each other only occasionally and even then the visits had been brief. Only with the death of their mother after their tenth birthday had they finally been given the chance to know one another. From that moment on they had been inseparable.</p><p>Dev was the quiet one. The one everyone rarely paid much heed to. He preferred to watch the foibles of men and quietly learn from other’s mistakes. Lucian was the more social brother. He thrived amid the high paced, often stressful career he had chosen and gloried in the challenges they presented. Dev was more content to work behind the scenes, to coordinate and see the projects through rather than forging into the fray and doing battle with competitors who would have taken the more lucrative contracts.</p><p>It was for this reason that Dev had stood aside and allowed Lucian to begin the first wave of sensual assaults against Tally. She was attracted to both of them, they had both known that from the beginning, though he doubted at that time that she was aware of the carefully plotted seduction and downfall they had arranged for her.</p><p>How easily their plans had blown up in their faces. Dev stood outside the shower, leaning against the wall, head lowered, listening to the faint sounds of her sobs. They had made her cry.</p><p>He shook his head at that thought. No, they hadn’t made her cry; she had allowed her demands for self-control to cheat her out of the orgasm that had been building within her body. Those same demands had sent her running from them, sent her scrambling to pull the tattered shreds of her pride around her and retreat as quickly as possible from the two men who had seen her downfall. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He moved carefully, slowly, from the bathroom. He didn’t want to alert her of his presence, that in her turmoil she had forgotten to lock her front door and had given easy access to one of the men, he knew, she considered the enemy.</p><p>He paced to the bedroom and began preparing it for her. Lucian would arrive later, but for now, Dev was in control and Tally might have figured out how to handle his brother, but she had no idea how to handle him.</p><p>He smiled at the thought as he attached restraints to the four corner posts of her bed. The soft nylon wrist and ankle cables would allow just enough freedom of movement to ensure her pleasure while holding her in place so he could assure her freedom from the strict demands of her self-control.</p> <p>He put several other articles on the bedside table. A tube of lubrication gel, an inflatable butt plug and a thick vibrating gel dildo were laid to one side. Next came a set of vibrating nipple clamps and a small ball gag.</p><p>He glanced toward the door as the sounds of falling water ceased. She would be entering the room within minutes, unaware of his presence, her control shaky at best, off balance. He had a feeling that if he gave her the chance to renew that control then they would all lose. Tally wouldn’t allow herself a chance to fail a second time. She would pull that cool mockery and cold demeanor around her like a cloak of protection and forever keep him and Lucian at arm’s length. He couldn’t allow that. He wouldn’t allow that.</p><p>Taking his seat in a comfortable chair across the room, he sat back and waited. His cock was throbbing; so damned hard and engorged he was amazed he could walk. If he had ever had an erection so demanding with another woman, he couldn’t remember it.</p><p>The shower door opened, closed. Minutes later the sound of a hair dryer could be heard and Dev sat back to wait. Tally’s hair was long and thick, a sensuous silken skein of midnight-black that fell to her hips and made his hands itch to touch it. It had to be hell to dry, though. He would have loved to stand behind her, wielding the dryer, watching the cool strands slowly dry beneath the heat of the device. Instead, he sat and waited. The fireworks to come would be hot enough; he didn’t have to tempt an early explosion.</p><p>Long minutes later the hair dryer flipped off. Dev sat up straighter in the chair, his eyes narrowing as he watched the doorway. Tally walked through it slowly, her characteristic, sensual glide a little less relaxed than it usually was. Her long hair fell down her back, caressing her hips, but the rest of her body was bare. Bare and perfect. Gold glittered at her nipples and winked at him between her perfect thighs as she came to an abrupt halt in the middle of the floor.</p> <p>“What the hell are you doing here?” Her eyes nearly glowed in furious heat, her dusky cheeks flushing with anger.</p><p>Dev’s brows rose in surprise. Her voice was gritty with emotion, her body fairly trembling with it. This was not the cool, self-possessed siren that had haunted his dreams for so long. This was better. More than he could have expected.</p><p>He propped his ankle on his knee, leaning back in the chair as she jerked a long, cream-colored silk robe from the smaller chair by her bed table and pulled it on with quick, angry movements. She still had yet to notice the restraints or the sexual devices on the table.</p><p>“Leave,” she snapped as she belted the robe around her slender waist. “Now.”</p><p>Dev sighed heartily. “I’m not Lucian, Tally. Your anger doesn’t bother me as it does him.”</p><p>Lucian, despite his often sarcastic attitude in the face of her normally cold temper, had that basic male trepidation when it came to prodding at an unpredictable female. Unlike his brother, it was an art Dev had perfected in his youth and had steadily applied over the years.</p> <p>“Does jail bother you?” She crossed her arms under her breasts as she stared back at him heatedly. “Breaking and entering is illegal.”</p><p>“The door was unlocked,” he informed her, watching in satisfaction as her eyes widened in shock.</p><p>He could read her emotions as clearly as a book now. The cold mockery had been stripped away, leaving bare the woman beneath as she stared back at him with haunting, shadowed emotion.</p><p>“I don’t care if it was standing wide open.” She showed her teeth in a snarl that made his dick jerk in arousal. “Pick your ass up and get out.”</p><p>Oh, now there was the Tally he knew existed beneath the carefully polished exterior. Vibrant, explosive, her temper was more than a match for the dominance that pulsed thick and hot through his and Lucian’s blood.</p><p>He came slowly to his feet, watching her carefully.</p><p>“You honestly believe that little performance earlier isn’t going to be addressed, Tally?” he asked her, keeping his voice soft, though he did nothing to hide the annoyance that throbbed beneath it. “You should have expected one of us to show up ready to do battle, if not both.”</p><p>Her gaze flickered. Dev controlled the pleased smile that crossed his lips. She had expected Lucian and had been confident she could turn him away. She had obviously seen his patience as weakness instead, and thought him easier to control than Dev was.</p> <p>“Poor Tally.” He sighed. “You’ve misjudged Lucian, but you’ll learn that soon enough. Even worse, you underestimated me. I won’t let you run so easily. The game stops here and now.”</p><p>“What is with you two?” she snapped, her voice thick with anger, her face flushed, eyes shining with emotion. Damn, he had thought her beautiful before, but now she took his breath away. “Can’t you accept defeat? Can’t you accept that there’s a woman alive that doesn’t respond to you? You tried, you failed, now leave it alone.”</p><p>Her voice broke on the last word, hitching as emotion seemed to crackle like electricity within it.</p><p>“I don’t think so.” He stepped closer. “I was unaware that you had taken Lucian and myself for fools. That we would calmly stand aside and allow you to hide because you’re too frightened to reach out for what you want. You can’t keep that indomitable self-control and find the satisfaction you need, Tally. It won’t work.”</p><p>He didn’t touch her. Not yet. He stalked around her, watching her carefully, seeing the naked nervousness in her gaze as she watched him warily. She knew Lucian much better than she did him. He had deliberately held himself away from her, stayed on the outside of her circle of friends, rarely giving her the chance to dissect him with those perceptive eyes of hers.</p><p>She did that. Watched people, waiting on them to reveal to her their every dark secret so she could use it to hold them at bay, to insure she had every weapon available to keep them from getting close to her.</p><p>“You don’t know what you’re talking about.” She was breathing roughly, though he could tell she was fighting valiantly to control it. “I hate to prick that ego of yours, Dev, but you and Lucian may not be the walking female orgasms you think you are.”</p><p>May not be. He noticed she didn’t state it as a definite. His lips kicked up in a grin.</p><p>He stopped behind her, not touching her, not daring to. Her shoulders stiffened, her breathing becoming rougher still as he towered over her.</p><p>“Had you waited, you would have had what you needed, Tally.” Her arms uncrossed, her hands falling to her sides and clenching at the material of her robe. He could see the hard rise and fall of her breasts, almost feel her fight for control.</p><p>“How like a man,” she sneered. “Perhaps I’m frigid. Isn’t that the standard male excuse?”</p><p>“Or perhaps you’re too stubborn, too intent on being in control, on being the Mistress, to ever admit there could be a Master,” he suggested softly. “I know what you need, Tally. I know, and I’m going to make certain you have it.”</p><p>She seemed to freeze, stiffening in response, not just to the words, but also the underlying promise that came with them. When she started to run, he was ready for her. He was determined Tally was not going to run anymore.</p><p>Chapter Twelve</p><p>Tally was in shock. This was not the gentle giant she had always thought of Dev as being. This was a man in his prime, far stronger than she, and determined to have his way. He caught her as she moved to run from the bedroom, a chuckle sounding in her ear as his arms went around her, holding her close. A second later she felt her robe loosen as she struggled against him, fighting to tear herself from his muscular arms as he stripped the robe from her body.</p><p>“You bastard!” she raged as he picked her up and tossed her to the bed.</p><p>Her fingers curled into claws as fury overwhelmed her. Hot, blinding rage burned in her stomach like acid as she snarled and flailed out at him.</p><p>She gained little more than a dark laugh as he straddled her body and within seconds, to her complete horror, had her arms spread and her wrists shackled with soft, padded nylon restraints.</p><p>“Let me go.” She jerked at the restraints, staring up at her wrists in disbelief as the slender chains running from the nylon refused to give way.</p><p>Instantly his weight was removed, but it wasn’t to release her. She shrieked in disbelief, attempting to jerk her foot from his grip as he began to shackle her ankles. She was now spread eagle, held naked to the bed as he watched her in amusement.</p><p>“You son of a bitch!” she screamed, outraged, terrified. No matter how desperately she fought she couldn’t release herself, nor could she stem the rising anger building inside her. “I’ll kill you for this. I’ll carve your dick from your body if you don’t let me go.”</p><p>“Such naughty language, Tally,” he chided her in amusement as he sat down on the bed and removed his boots. “Just settle down, baby, and save your breath. You’ll need the energy to scream from pleasure later.”</p><p>“Oh, now haven’t I just heard that one before,” she sneered, jerking at the restraints that held her wrists again. “A little overconfident, aren’t you, Dev?”</p><p>“Overconfident?” he mused as he stood and unbuttoned the snowy white shirt he wore. “Merely confident, I think.”</p><p>Snarling, cursing, Tally fought the restraints, desperately trying to ignore the fact that Dev was undressing beside her bed. His muscular chest shouldn’t have looked so inviting and when he shed his jeans and the snug boxer briefs, the hard, thick length of his cock shouldn’t have caused her to catch her breath in hunger.</p><p>“Damn you, Dev, you can’t do this,” she denied hoarsely, knowing any chance she may have had at rebuilding her defenses was being shot to hell. “Let me go!”</p><p>He stood at the side of the bed watching her quietly, his eyes going over her body, pausing at her breasts, taking in the hard, fiery points of her pierced nipples. His gaze went lower and Tally closed her eyes in shame, well aware of the thick, glistening juices that coated the plump lips of her shaved pussy.</p><p>“Say ‘shoes’,” he said, smiling, his eyes coming back to her. “In every dominant/submissive relationship there’s a safe word. One word that halts any further action and calls a stop to whatever’s taking place. But I’m warning you, Tally, if you say it, then it’s over. It doesn’t matter how much Lucian and I care for you. It doesn’t matter how much we need you, it’s over. Say ‘shoes’ and I release you and walk away now. If you don’t say it, then you can fight until hell freezes over and as long as your body responds, as long as you find pleasure, there will be no stopping.”</p><p>The throttled growl of rage that escaped her throat surprised her, and Dev as well, if the flaring of his eyes was any indication.</p><p>“Go to hell,” she cursed him furiously. “I’m not begging you for anything, you hulking Neanderthal. Kiss my ass.”</p><p>“I’ll spank it instead.” His words had her stiffening in shock a second before she began to fight again.</p><p>He released the restraints on her ankles, quickly flipped her over and secured them once again. There was just enough length to the chains at her wrists to allow them to cross and adjust to the new position. She was panting in surprise and fury, not to mention the excitement beginning to snake through her body. But it didn’t stop her from fighting as he adjusted the restraints, once again spreading her out. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Do you have any idea how I’ve fantasized about spanking that curved little ass?” he whispered at her ear, his hand smoothing down her back, then over her buttock. “Watching it blush and burn, then spreading those soft little cheeks and fucking my cock up that tight little hole it hides.”</p><p>Her head snapped around, her eyes widening in shock and surprise. It wasn’t that she had never had anal sex. Or even a ménage. It was the tone of his voice. Rough, carnal, sinful. His expression matched the tone of his voice. He looked like a fallen angel, his black hair falling over his forehead, his brilliant green eyes glowing with lust.</p><p>“It’s going to be so good, Tally.” He smoothed the hair that had fallen to her cheek back from her face. “I can’t wait to get my cock inside you, no holds barred, fucking you with everything I’ve dreamed of giving you for so damned long.”</p> <p>His hand landed on the curve of her ass as he finished. It wasn’t a small blow, it wasn’t a timid tap; it stung. It pierced into her womb, flamed through her pussy and had her gasping out in pleasure. And still he watched her, his eyes holding hers, his face close to her as he delivered a similar blow to the other side.</p><p>Tally jerked against her bonds again, whimpering as she fought to hold onto the restraint she had always prided herself on. But this was good. Too good. The utter depravity of it was enough to send her spinning into an arousal that defied reason. Lust bloomed like a conflagration, leaving her aching, hurting for release.</p><p>“Stop this,” she snapped, driven as far as she could stand. Months of titillation, of teasing. She needed relief and waiting for it was not an option. “Dammit, Dev, just fuck me and get it over with.”</p><p>The size of his cock would burn, it would stretch her, fill her, give enough of the heady painful intensity that she could at least have some measure of release. If he continued this course, there was no way she could bear it.</p><p>“All or nothing, Tally,” he reminded her. “You’ll take it all or I walk away. Lucian walks away. Are you really such a coward that your control means more than reaching out for all the pleasure you’ve always dreamed could be yours?”</p> <p>Was she? She was. She buried her face in the comforter, breathing harshly, fighting the overwhelming need to scream out the safe word and gain her release.</p><p>“Think about it, Tally,” he whispered. “Your ass is going to burn. I’m going to make you pay for even daring to consider faking an orgasm. But first, I’m going to make certain you know what you’re passing up if you’re thinking of whispering the word that will stop it.”</p><p>He moved away from her then. Tally raised her head, turning and watching in shock as he picked up a slender butt plug and a tube of lubrication gel.</p><p>“This,” he turned the device in his hand, “is an inflatable plug, Tally. Have you had one before?”</p><p>She hadn’t. She could feel her heart racing now as she saw the slender pipe leading to the pressure bulb below. It was slender, but it would become larger.</p><p>“That’s not necessary,” she informed him, trying for haughtiness but knowing she was achieving only desperation. “I’m not a virgin there, Dev. Or anywhere else.”</p> <p>He smiled slowly. “Darlin’, its not just for preparing your luscious little ass.”</p><p>He didn’t give her time to respond. Before she could draw in the breath to curse him for his arrogance, he was between her spread thighs, surprising her when he lifted her hips and pressing two of the pillows beneath her.</p><p>“Dev, you’ll pay for this.” She fought his hold, jerking against him as he chuckled with wicked emphasis and adjusted the pillows beneath her raised ass. “Don’t do it like this.”</p><p>“Sorry, baby, you lost the option to choose with that little stunt you pulled back at the office.” He smacked her ass again, causing her to jerk with the sting, the pleasure derived by his calloused, broad palm. “Now you can accept what you get. Exactly the way I always wanted to give it to you.”</p><p>He had exceptional timing. Her mouth opened to scream a string of expletives that would have cut him to the ground. And she would have, if he hadn’t chosen that moment to run his fingers slowly through the wet slit of her pussy. Her teeth snapped together to bite off a moan. She couldn’t remember a time in her life that those tender folds had been so sensitive.</p><p>“You’re wet,” he murmured, pleased. “Very wet, Tally. I think you like this more than you’re letting on.”</p><p>He swirled his finger around the tightly clenched pucker of her anus as she tried to breathe through the incredible pleasure. She was restrained, she should be screaming, fighting, cursing. She knew exactly what he intended. He wanted to strip her of control, make her beg. How disappointed would he be when it didn’t work? She couldn’t lose control. She would freeze up. She would lock down inside until no sensation could ignite the spark that would send her careening into orgasm.</p><p>Her hands clenched the comforter as her breath hitched in fear. She didn’t want this. She didn’t want the humiliation as she saw the searing knowledge in Dev or Lucian’s eyes.</p> <p>“Dev...” The safe word was ready on her lips when his finger pressed against the tight pucker of her anus and eased inside.</p><p>Her breath caught. How long had it been since she had felt that tiny pinch of fire, the exciting knowledge of the hot, streaking pleasure to come? She bit her lip, her breath hitching as fear and need began to war within her.</p><p>“You don’t have to control yourself, Tally,” he whispered seductively. “You don’t have to do anything or pretend to be something or someone you’re not. Just be yourself. A creature of pleasure, an exquisite form of energy and sexuality, that’s all you have to be. No demands, no expectations. And no reprisals. None, baby.”</p><p>His finger slid deeper, spreading the cool essence of the lubrication he used while parting the delicate, sensitive muscles of her anus.</p><p>“I can’t.” She kept her face hidden, her shame covered. “You don’t understand. I’ll freeze up. I can’t let it go.”</p><p>He smacked her ass. A burning slash of pleasure ripped through her body, arching her back as a strangled moan tore from her chest.</p><p>“You freeze up and I’ll make your ass burn so bright you won’t sit for a week,” he snapped, his voice determined, firm, as his finger slid quickly up the tight passage.</p><p>She writhed against the pillows. The heat of that abrupt thrust struck the depths of her pussy like a well-aimed bolt of lightning. A second later she bit her lip, whimpering in regret when the thick presence eased free of her tiny entrance and the tip of the lubricating applicator slipped inside. The gel eased inside her, filling the passage with cool relief for but a second. When he removed it, she felt the head of the butt plug pressing against the entrance instead.</p><p>Okay, she knew how to do this. She’d had anal sex before. It was easy. She relaxed her muscles, biting back a moan as the slender device was worked inside her. It was only five inches long, not really thick but pliable. When it was fully lodged inside her she breathed out slowly. She doubted the inflation would be much; it didn’t look large enough to actually inflate to a size that could test her control.</p><p>“So calm.” Lucian’s voice at her side had her gasping in shock.</p><p>Her head turned as he sat down beside her, his hand smoothing her hair back from her face as he stared down at her.</p><p>“This won’t work,” she whispered regretfully. “You’re only going to hurt all of us by letting him continue.”</p><p>“You know the safe word?” Lucian asked her gently.</p><p>“Yes, but...” She stopped, her eyes widening at the sudden pressure in her anus.</p><p>Slow, insidious, the plug began to lengthen, thicken, filling her in ways she had never expected. Her breath caught in her chest as her muscles began to stretch, the nerves protesting, burning, as Dev continued to inflate the device.</p><p>“She was a very bad girl today, Dev.” Lucian never broke eye contact with her as he spoke. “I think she needs to be spanked while that plug fills her little bottom. What do you think?”</p><p>Dev’s answer was a light blow to one of the soft curves, then another. And another. Tally trembled as the fire beneath her skin began to build, the pleasure and pain combining in a conflagration that began to spread through the rest of her body. Her clit was swelling, the small ring encircling it barely containing the torturous little nub of flesh as the butt plug continued to swell within her, even as Dev’s hand brought a fiery blush to her ass.</p><p>“Lucian,” she whimpered. She had never known anything so incredibly arousing, so destructive to her senses. “Help me, Lucian. Please. Please don’t let me freeze...”</p><p>Chapter Thirteen</p><p>The plug was fully inflated, filling her ass, creating a pressure that held her on the edge of a sharp, painful pleasure. The cheeks of her ass were so sensitive that the slightest caress had her gasping; laying on them was an exquisite torment when Lucian and Dev adjusted her restraints once again and spread her out on her back.</p><p>Her pussy was incredibly wet. She could feel the thick layer of syrupy juices that lay along the swollen lips and coated her tortured clit. The arousal was so incredibly blinding she wondered if she would survive it. But Dev and Lucian gave her no mercy.</p><p>Lying on each side of her, the two men slowly began to torment her already over-sensitized body. Lucian’s kiss was drugging. His tongue filled her mouth, playing slowly with her own, never giving in to the wild need that had her reaching desperately for a hotter, harder kiss.</p><p>His lips sipped at hers, his tongue moving with languid ease along the curves before slipping back into her mouth as she moaned harshly into the kiss. Dev was making up for his gentleness at her breast, though. His teeth were rasping the hard, brutally receptive point with devastating results. His suckling mouth ate at her nipple; his tongue tugged at the little gold ring piercing it.</p><p>She writhed beneath them, her hands curled into fists, her feet flat on the bed as her hips plunged upward in fruitless need.</p><p>She was sweating. She never sweated, but she was now. Her flesh was soaked with it, her hair damp as she strained between them, agonized mewls of pleasure echoing from her throat as Lucian’s lips moved to her ear.</p><p>“Are you ready, baby?”</p><p>“I’m going to make you pay for this,” she snarled. The excess emotion and demanding responses in her body had her senses careening.</p><p>“I can’t wait,” he murmured in satisfaction. “Until you’re free and able, though, I have something else for you to enjoy.”</p><p>Dev’s lips began to move down her body, his tongue painting lascivious trails of near ecstasy across her abdomen as he moved between her thighs. Lucian moved from her side, pressed a pillow beneath her head and leaned forward. His cock, engorged and heavily veined, neared her lips. The flared head was nearly purple in color, the size of a plum and throbbing with lust.</p><p>“Suck me, Tally. Make it good, baby, and we’ll see if Dev can’t make that pretty pussy feel just as nice.”</p><p>She opened her mouth eagerly. She needed relief. She was at the point that she didn’t care if it was only minor relief, as long as the excruciating need eased. His cock slipped into her mouth, thick and hot, as her lips closed on it, his groan echoing around her as Dev’s tongue began to play demonic games with the ring piercing her clit.</p><p>“Yes, sweetheart,” Luc hissed hoarsely. “Take me deep, baby, straight to your throat.”</p><p>Dev’s hand held her hips still, refusing to allow her to thrust her tormented flesh firmer against his lips, though Lucian moved closer to her mouth, groaning heavily as her tongue stroked down the shaft, the engorged head sinking deep.</p><p>She suckled his flesh like a woman starved and, clearly, she was. Uppermost in her mind was the desperation to achieve the orgasm that lay just out of reach, tempting her, taunting her. Dev’s mouth was a sucking, licking demon of pleasure as he lapped at the juices spilling from her vagina, suckled her engorged clit or used his teeth to pull at the little ring and cause desperate mewls of need to echo around Lucian’s cock. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ah, sweetheart,” Lucian groaned, a grimace of sublime pleasure twisting his face. “Perfect. Fucking perfect.”</p><p>She took the rigid flesh to her throat, swallowing, caressing the throbbing head while her tongue worked against the ridged shaft as she strained closer to him. The plug in her ass was a heavy pressure that only tormented her further, reminding her of the sensations that could arise should one of her lovers thrust the thick length of his cock inside her instead.</p><p>The thought of such brilliant arcs of sensation had her working her mouth hungrily over Lucian’s erection, moaning at the lash of Dev’s mouth on her tormented cunt as she suckled the hard flesh.</p><p>She was shaking, her body wracked by shudders of arousal as she strained toward Dev’s mouth. She wasn’t going to make it. She could feel her body rebelling, her mind rejecting the demands of her flesh.</p><p>Tally tried to scream around Lucian’s cock, fought the final humiliation as tears filled her eyes and she felt the building pressure in her womb begin to dim.</p><p>“Suck it.” Lucian’s hands gripped her hair as his voice hardened, his cock suddenly fucking rougher between her lips as the sharp tingles of fire raced across her scalp. “I’m going to come, Tally. Right down your sweet throat, baby.”</p><p>A hard convulsive shudder wracked her abdomen as her womb clenched in a sudden burst of renewed heat. Dev’s teeth raked her clit with an exciting roughness a second before they clenched the ring and tugged and two fingers plunged inside the gripping, ultra tight depths of her raging pussy.</p><p>A strangled scream echoed around Lucian’s cock as her eyes widened, her vision darkened. The inflation of the plug had done more than create a heavy pressure up her anus, it had made the already snug depths of her pussy that much tighter.</p><p>“There,” Lucian groaned as his hips increased the strokes of his cock between her lips. “Suck it, Tally. Deeper, baby, I’m going to come.”</p><p>She took his cock to her throat, swallowed, her tongue flexing against the sensitive underside of his erection as it spasmed and exploded. His hands tightened in her hair, holding her still as hard, hot jets of semen shot down her throat. Swallowing convulsively, aware of the caress it would be to the sensitive head of his cock, she accepted each powerful stream of thick fluid.</p><p>Seconds later he pulled back from her lips, his cock still hard, heavy with arousal as she felt Dev’s fingers pulling free of her as he rose between her thighs. She was sweating, shaking, her pussy pulsing with the frantic rush of blood thundering through her system. Then Dev’s hand landed hard and heavy on the pad of her pussy.</p><p>Tally screamed, thrashing against the bed as violent sensations of pleasure tore through her body. No one had ever dared to strike her pussy. Another blow landed, directly over her clit and her back arched, her head grinding into the mattress as the breath locked in her throat. Explosive arcs of pleasure/pain tore through her pussy, her womb, spreading along her body as her mind shut down. There was no control.</p><p>The next blow destroyed her. Her eyes flew open as an orgasm, her first true, decadent, explosive orgasm, shattered her senses. A thin, high wail escaped her throat as she tried to fight off the nearly violent tremors sweeping through her body, but once he had pushed her over the edge, Dev wasn’t content to let her attempt any sort of control again.</p><p>His cock, fiery hot, thick and steel-hard, pushed inside the spasming entrance of her pussy. Her muscles gripped him, locking tight as she fought to come down from the shattering release.</p><p>“Take me, Tally. Now. All of me.” Dev’s voice was hard, dangerously male, as he began to work the shaft inside her with strong determined thrusts.</p><p>Inch by inch her flesh gave, inch by inch the coil of heat that had exploded through her pussy began to build again. The plug, still inflated in her rear, left little room for the thick width of his erection, and Dev made little concession to the extremely tight grip of her cunt.</p><p>“Oh yes, baby...so fucking tight...so fucking good around my dick...” He gasped, his erection pistoning forcefully inside her saturated pussy.</p><p>She was going to come again. Oh God, it would kill her. She couldn’t bear another explosion so violent, so destructively powerful. But she knew it was going to happen. His cock sent bolts of excessive pleasure/pain slashing through already sensitized nerve endings as he stretched the unbearably snug channel of her cunt to accommodate his strokes.</p><p>“No. No more!” she screamed wildly as his cock pistoned hard and deep, shattering her nerve endings. “No more...”</p><p>“Come for me, Tally,” Dev groaned. “One more time, baby. One more time. Let me feel you come on my cock, baby. Look, Tally, look how sweet and wet you are. Just one more time.”</p><p>Her eyes flew to the point where their bodies connected. His hands held her hips away from the bed, his erection plunging in and out of her, wet and hard, gleaming with her juices as he pulled back, his flesh slapping wetly against her as he thrust forward.</p><p>It was too much. Too much pleasure, too much sensitivity. He fucked her hard and deep, separating the soft tissue, the clenching muscles, as she threw her head back, her neck arching, her body tensing until she felt she would shatter. And then she did. She couldn’t scream, she could do nothing but allow a lifetime of recessed needs, lust and emotions to pour from her soul, spilling with the hard wash of climactic juices that rushed from her pussy, mixing with the powerful jets of Dev’s semen.</p> <p>Tally was only distantly aware, long minutes later, of Lucian and Dev releasing the restraints on her wrists and ankles. She floated, languid, relaxed, on a cloud of satisfaction unlike any she had known before.</p><p>She moaned in low protest as she felt the deflating of the anal plug from her rear, but as it slid free of her body a shudder of pleasure coursed over her. Exquisite. She wanted more, but she couldn’t seem to rouse herself to do more than try to breathe.</p><p>“Come here, baby.” It was Lucian who pulled her in his arms as he lay down beside her. Behind her, she was aware of Dev as he settled into the bed as well. Warmth surrounded her. Lucian’s arms as he held her close, Dev’s chest at her back.</p><p>“Can I keep you?” She was only barely aware of the thought that drifted through her mind, unaware that she had spoken the words.</p><p>“Forever, Tally. Keep us forever,” Lucian whispered as he kissed her brow, Dev kissed her shoulder and darkness enclosed her.</p><p>Chapter Fourteen</p><p>For the first time in more years than she cared to remember, Tally made no effort to make certain she was presentable before she slipped from her apartment. Escape was the only thing on her mind.</p><p>Dressed in one of her few pairs of jeans and a bronze silk blouse, she pushed her feet into leather sandals and practically ran out the door to her car. Lucian and Devril were still sleeping when she left them in the bed after awakening. Getting from between them wasn’t easy and had only been accomplished with a promise to return within a few minutes.</p><p>Thankfully, the spare bedroom held older clothes that she rarely wore and possessed a small bathroom. After a fast shower she had dressed, leaving her hair damp, and ran. Like the coward she was, she all but raced from the apartment.</p><p>So where the hell was she going to go now? It was barely daylight on a workday, her hair was wet, she wasn’t wearing makeup and she was trembling like a leaf as she headed the car to the outskirts of town.</p><p>This was all Terrie’s fault, she decided in panicked desperation. If she hadn’t let Jesse choose Lucian as the third in their little ménage, and if she hadn’t had it right there at the office, then Tally would have never walked in on them. She would have never seen him, or been overcome by lust. She wouldn’t have seen his cock, thick and hard, fucking someone other than her. Her possessive instincts would not have been aroused, and therefore, her control wouldn’t have been lost. Her calm wouldn’t have been shattered. She wouldn’t be driving down a nearly deserted country road with wet hair soaking one of her best silk blouses.</p><p>She felt lost. In her heart and in her mind, she had lost something that had kept her centered over the years, something that went further than control. If this was what love did to you, then she wasn’t certain it was worth it. She was drowning now in her own fears and her own demons.</p><p>“Damn you, Terrie.” She swiped at the tears that trembled on her lashes as she cursed her friend. Perverted, depraved wench that Terrie was, she had to allow Jesse to share her with one of the men Tally had staked out for herself.</p><p>It was Jesse’s fault. Every bit of it. She snarled silently at the thought. He knew she didn’t want him to invite Lucian into that little threesome. He had at least suspected it, otherwise he would have never asked her that day in the office if there was someone he shouldn’t consider. He should have chosen someone else.</p><p>Her eyes narrowed as she took the turn to the Wyman property. It was all their fault so they could share in the misery.</p><p>She pulled into the curved driveway of the Wyman home and threw the neat little Lexus into park before moving quickly from the car and heading to the front door. She pressed the doorbell hard. Once. Twice. She took her fist and pounded demandingly on the wood panel.</p><p>“Dammit, Terrie, I don’t care how good a fuck he is. Open the damned door.” The longer she thought about it, the longer she stood there, the madder she got.</p><p>“Tally?” The door flew open, but it wasn’t Terrie greeting her, it was a nearly bare-chested, obviously ill-tempered Jesse Wyman.</p><p>“You and your friends are a threat to society.” She poked him in that bare chest, between the edges of his unbuttoned shirt, hard, feeling no end to her satisfaction as his eyes widened marginally and he jumped back from the sharp nail of her finger.</p><p>“Uhh, any friends in particular?” He gave her clear berth as she stomped into the entryway.</p><p>Her eyes narrowed on him. He was staring at her a bit too amazed, a bit too smugly.</p><p>“Any friends in particular,” she mimicked him. “Try the son of a bitch who helped you screw your wife. Him and his perverted brother, you, James...the whole damned lot of you are a menace. A danger to every sane woman who ever walked this planet. All of you should be locked away.”</p><p>She was yelling at him. She ignored the slowly dawning knowledge in his eyes, the way his gaze went over her in near shock as well as the compassion that suddenly filled his face.</p><p>“Tally, Terrie will be down in a minute.” His voice softened as she stood before him, her fists clenched, her breathing rough and heavy. “She was in the shower.”</p><p>“Don’t you dare pity me.” Her hands fisted at her sides, fury enveloping her as she faced him, knowing by his expression that she would never regain the respect he had once watched her with.</p><p>“Tally?” He was saved from answering by Terrie’s incredulous voice as she came down the stairs. “Tally, your hair is still wet and you’re wearing jeans?”</p><p>Tally turned to her, seeing the concern, the worry in her friend’s face and fought back the tears that suddenly clogged her throat. She was shaking. God, she hated the feel of the nervous tremors shuddering through her body.</p><p>“Tally.” Terrie’s eyes were wide as she glanced at her husband, then back at her friend as she stepped to the landing. “Hon, what happened to you?”</p><p>Tally swallowed tightly. “I really need a drink. Something strong.”</p><p>She turned and moved quickly for the bar in the large living room. The forest green and cream toned room was unlit, the faint glow of the rising sun outside the only illumination she used to light her way.</p><p>“A drink?” Terrie exclaimed as she rushed in behind her. “Tally, its barely six-thirty in the morning. You never drink before evening.”</p><p>She pulled the whisky decanter from the back of the bar, grabbed a shot glass and was preparing to pour when Jesse caught her hand. She stilled, swallowing tightly, fighting the overwhelming urge to attack. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tally, this won’t help,” he said gently, setting the decanter back on the bar as he pried the glass from her other hand. “Whatever happened can’t be that bad.”</p><p>She stilled the snarl that trembled on her lips, though her teeth snapped together in fury. Rounding on him, she clenched her fists in the edges of his shirt as she jerked at it hard, watching his eyes round in surprise as he bent to her involuntarily.</p><p>“I can still hurt you, Jesse,” she snarled into his narrow-eyed expression. “I am to be feared. In all ways. At all times. Is this understood? You are not safe from me. Never think you are.”</p> <p>Jesse had suffered through tar thick coffee, stale doughnuts, mouse traps in his desk drawer, thumb tacks in his chair and any number of nasty little surprises for attempting to put her in her place in the past. His arrogance had been a complete pain in the ass. Training him had not been easy and she would be damned if she would lose ground with him now.</p><p>“Of course, Tally.” She saw that worried little glimmer in his eyes even though his attempt at sarcasm was sufficient to fool his wife.</p><p>Nodding sharply, she released him but didn’t return to the liquor. She needed a clear head to get through this.</p><p>Breathing in deeply, she fought to still the tremors in her stomach, the nerves that caused her hands to shake and made her heart beat a frantic rhythm within her chest. Terrorizing Jesse always seemed to help restore her balance. If she could master him, surely she could master Dev and Lucian. Couldn’t she?</p><p>“Tally, are you forgetting that’s my husband?” Terrie asked her, though laughter lurked in her voice as she watched the byplay in interest.</p> <p>Tally breathed in deeply. “Yeah, well, he was my problem first,” she reminded her. “I have years of his torture to make up for. He could have scarred me, you know, working for his depraved ass.”</p><p>“Scar you?” Jesse snarled from behind her. “My depraved ass? At least my brother has his own wife.”</p><p>“And you brought in Lucian when you knew I disapproved.” She turned to him sedately, her voice cool, sarcastic. Now here, she was on even ground. “You, my friend, deserve pain. But I’ll be nice since Terrie is a friend of mine.”</p><p>Yes, that returned her sense of generosity. See? She told herself soothingly, all hope was not lost.</p><p>Jesse snarled silently, glancing at his wife as she fought her laughter. “Deal with this crazy woman,” he snapped, pointing his finger at Tally as she arched a brow imperiously. “I’m going to shower. I want her gone when I get back.”</p><p>He stomped from the room and up the stairs, his muttered curses drawing a small smile to Tally’s face.</p> <p>“I love it when they fear me.” Tally sighed in satisfaction. “It just seems to make my day better.”</p><p>“I take it Lucian and Dev weren’t too frightened of you?” Terrie asked as she headed for the kitchen, motioning to Tally to follow her.</p><p>Tally frowned at her friend’s back. That parting shot had to be in return for reminding her husband of his place in the scheme of Tally’s Perfect Order. There was no other explanation.</p><p>“I need coffee if I can’t have whisky,” Tally said, following her. “Then I have to leave. I just know those two think they can handle me now,” she sneered, thinking of the satisfaction that filled them as she had screamed beneath Dev’s thrusting cock the night before. “I’m certain Jesse called them as soon as he escaped. I knew he couldn’t be trusted.”</p><p>Chapter Fifteen</p><p>Lucian disconnected his cell phone slowly after the brief discussion with Jesse. At least he knew where Tally was, knew she was safe. His jaw tightened in irritation at Jesse’s furious refusal to discuss her, though.</p><p>“If you want to discuss that viperous little witch then call my wife,” he had snarled. “Maybe she can talk about her reasonably.” Which meant Tally was there, at least. And evidently, she had once again struck the fear of Tally into Jesse’s heart. She was one of the few capable of it.</p><p>Across the room, Dev stared out into the steadily growing morning, silent, pensive.</p> <p>“The woman is a pain in the ass,” Dev finally snorted. “You would make us fall in love with a control freak with commitment issues.”</p><p>Lucian winced, but grinned. He wasn’t pleased with Tally right now, to say the least, but he wasn’t exactly worried either.</p><p>“And she thinks we’re depraved perverts with sharing issues,” Lucian reminded his brother with a laugh. “At least she’s rational and safe. We can deal with the rest.”</p><p>He controlled his laughter as Dev turned back to him with a frown. “That woman is never rational,” he grunted. “Snide, mocking, psychotic maybe, but never rational.”</p><p>“And we are?” Lucian was having a hard time containing his amusement. “Maybe it takes someone just slightly off center to appreciate the relationship she’s stepping into here, Dev. Give her time, she’ll be her normal self soon.”</p><p>“Yeah, that’s what worries me.” Dev tucked his hands into his jeans and shook his head in exasperation. “Hell, she almost scares me.”</p><p>Lucian laughed at that. Tally terrified damned near every man she knew. She could cut them off at the knees with a look, or unman them with a few carefully chosen words. She would challenge them, amuse them, infuriate them to no end and he found himself looking forward to it, as he did nothing else.</p><p>“Let her get her bearings.” Lucian finally shrugged. “A day or two and she should begin to see that the loss of control isn’t as big an issue as she thought it was. She’ll want more then. Tally’s adventurous, Dev, and she’s had a taste of satisfaction now. She’ll be back.”</p><p>Dev hesitated as he moved from the window, heading to the doorway. He looked over at Lucian with brooding reflection as a grimace crossed his face.</p><p>“Yeah, but which one of us will she hurt when she does?” he grunted. “She likes Jesse, admits she does, and she has him terrified of her. That’s not a good sign, Lucian.”</p><p>Lucian laughed at this as he slapped his brother on the shoulder and they headed out the door. “No, simple pain would be too easy for her. Castration would be more Tally’s style. Maybe we should hide the knives for a while.”</p><p>“Or keep her restrained,” Dev growled. “I liked her much better tied down and at our mercy. Being at Tally’s mercy would be scary.”</p><p>Lucian restrained a shudder . “Don’t even think like that.” He couldn’t imagine the horror of it. “Hell, I’m going to work. Let her pout it out and come looking for us. I’ll be damned if I’ll chase after her any further.”</p><p>Dev grunted. “Yeah, with a knife. Watch my back, brother, and I’ll watch yours; otherwise, we could both end up sacrificed to sweet Tally’s fury.”</p><p>“Or her lust,” Lucian murmured, and that was part of what he was fighting for. They had her love, he knew that to the bottom of his soul. All they had to do now was ensure the surrender she had made the night before.</p><p>Going to their respective cars, they pulled out of the parking lot and headed back to the large house they owned outside of town, but in the opposite direction of the Wyman home. There was plenty to do while they waited on Tally to accustom herself to the events of the night before. Jesse suggested going after her, giving her no time to regain her balance or her strength. But Jesse was uncharacteristically wary of Tally. He swore she would make an excellent serial killer. There were times Lucian almost agreed with him.</p><p>“So, are you going to let them get away with it?” Terrie’s voice was amused yet filled with all the loving concern of a true friend.</p><p>There were few people Tally allowed close enough that she called them true friends. Terrie was one of those people, unfortunately. True friends knew your past, your secrets, your foibles and faults. Most of which had been revealed through more than one night of drunken revelry after the death of Terrie’s first husband.</p><p>Tally propped her chin on the palm of her hand and regarded the other woman seriously. “Sister Redempta said vengeance is a sin,” she reminded her lightly.</p><p>The good sister had a face like a prune with squinting, hard hazel eyes that sent shivers of dread chasing down the spines of all the good little girls at St. Augustine’s Academy.</p><p>Terrie snorted. “I remember your reply to that one, my friend.”</p><p>Tally cleared her throat and affected an innocent look. The sister had been rather offended when Tally informed her that since she was Satan’s spawn, Vengeance could be her middle name and she would practice the art on the nuns of the academy the minute she came into her full power.</p><p>Not that Tally had gone unpunished. That damned wooden ruler with its metal sides had lashed her bare butt for what seemed like hours. She had then been locked in her room for a total of two weeks, during which time the nuns who brought her food and took her to the showers were forbidden to speak to her.</p><p>“She broke me.” Tally sighed. “I didn’t think she had, but she did.”</p><p>She ignored Terrie’s surprised look.</p><p>“Tally, you’re the strongest person I know.” She shook her head in confusion. “How could you ever imagine you didn’t win over that old bat?”</p><p>Tally sighed somberly. She lifted the cup, playing for time as she sipped from the warm brew and gathered her courage to face things she had only just realized herself.</p><p>“I never truly orgasmed until last night, Terrie,” she finally said, lowering her head to avoid her friend’s gaze. “I would freeze up, lose the intensity, but it always ended the same. I could get off, but I couldn’t orgasm.” She knew her friend could understand the difference between the two.</p><p>“Until Lucian and Dev?” Terrie asked. “It’s different when you’re with someone you love, Tally.”</p><p>Tally swallowed before licking her lips nervously. Yes, it was different when you loved, when you felt loved. For all their dominance and rough play the night before Tally had felt the difference in Lucian and Dev.</p><p>“Everyone I’ve ever loved has been horrified by me.” She tried to smile as though unconcerned, but she felt the warning tremble of her lips. “The sisters told my parents about catching me with what’s-his-name.” She frowned, trying to remember the boy’s name and couldn’t. It didn’t matter, she remembered the event well enough. “They still remind me of their shame at being called into Sister Redempta’s office and being informed that I was caught allowing some nasty little boy,” she affected the sister’s tone, “to put his mouth in my private places and daring to beg him to do other disgusting things to me.”</p><p>The truth was, she had been begging him to push his finger deeper up her ass as his tongue whipped at her clit. Damn, she had been close when that evil old bat had thrown the door open to the gardener’s shed and interrupted them.</p><p>“You parents are prudes, Tally. You’ve always admitted that,” Terrie said softly. “How did that break you?”</p><p>“Because, they allowed the sisters at the academy to punish me as they pleased.”</p><p>She shook her head. The whippings had been the worst, the lectures, the silence from the other girls because they were forbidden to talk to her. She had endured nearly a year of it before she was able to leave.</p><p>Looking back now, Tally realized that her defeat had begun long before that day. Slowly, insidiously, the academy had wreaked havoc on her growing sensibilities; turning her into the mocking, cold-hearted bitch others accused her of being.</p><p>It wouldn’t have been such a terrible thing if she hadn’t already been uncertain of her emerging sexuality. The need for stronger sensations, that edge of pain and extreme sex that had been growing within her, was frightening in itself. Sister Redempta’s harsh, derogatory lectures had only made it worse. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Tally.” Terrie sighed deeply. “You always feel so strongly about things, and fight so hard to hide it, to appear uncaring, cool and aloof. It was bound to catch up with you someday. You’ve denied the very heart of who you are because you were afraid those you loved would look down on you for it, shame you for it. Hon, haven’t you realized yet? You’ve gravitated to a group of friends who are marrying the Trojans, for pity’s sake. That should tell you something.”</p><p>“It should,” Tally drawled in amusement. “But I won’t be participating in a single ménage or even a few with Luc and Dev,” she said, her voice growing softer. “I want them both, Terrie. Forever. And that terrifies me. No one has ever wanted me forever. Besides, after I get back at them for what they did last night, they might not want me anymore, period.” She sighed regretfully.</p><p>Terrie shook her head in confusion. “But I thought you enjoyed it.”</p> <p>Tally leaned back in her chair, her eyes narrowing. “I did. But it gives them the upper hand. You know I can’t allow that.”</p><p>A hint of worry entered her friend’s expression. “You’re plotting. Oh hell. Tally, Lucian and Dev are not men you can just mess with at will. They’re more dominant than even Jesse is.”</p><p>Tally frowned over at her friend. “Marriage is making you soft,” she accused her archly.</p><p>An incredulous laugh burst from Terrie. “Tally, I rather enjoy keeping Jesse comfortably happy. The benefits are incredible. I’m not getting mixed up in one of your schemes.”</p><p>Tally smiled over at her confidently. Terrie so loved to play hard-to-get when it came to getting in trouble. “He might spank you harder next time.”</p> <p>Terrie’s eyes sparked with reluctant interest.</p><p>“I bet he’s let up on the punishment side of the benefits.” Tally sighed regretfully. “Men do get so confident after a few months of marital bliss. Why, I bet he thinks you’re so well trained now that he doesn’t have to do more than give you a sweet little love tap here and there, instead of a nice spanking, to remind you of the pleasure.”</p><p>Terrie’s eyes narrowed dangerously. “That’s not nice.”</p><p>Tally shrugged. “But true. Yes?”</p><p>Terrie leaned back in her chair. “You’ve never been married,” she stated. “How do you know?”</p><p>Tally arched her brow mockingly. “I’m not exactly a virgin, sweetie. Just because I have an orgasm issue doesn’t mean I don’t know how men work.”</p> <p>“Orgasm issue, huh?” Terrie said drolly as she played with her coffee cup. She stared down at it for a second and Tally knew she had her.</p><p>“So.” Terrie raised her head, anticipation lighting her eyes. “What did you have in mind?”</p><p>Tally smiled slowly, confidently. “It’s really a very simple plan,” she assured her. “All I need you to do is help me sneak into The Club tonight.” She ignored the incredulous horror that filled her friend’s eyes. “I’ll take care of the rest.”</p><p>“Oh man, Tally.” Terrie shook her head as amusement suddenly overcame her. “We’re going to go to hell, aren’t we?”</p><p>A satisfied grin shaped Tally’s lips in reply. “Well, if we do, we’ll definitely be roommates. Wonder how hard it would be to sneak in the ventilation system?”</p><p>Their laughter echoed through the kitchen, a reminder of the nights spent laughing and crying, philosophizing and generally creating mayhem before Terrie’s marriage. Mayhem is in the eye of the beholder, though, Tally thought in satisfaction. Tonight, she would remind Lucian and Devril Conover of just that fact.</p><p>Chapter Sixteen</p><p>“Are you sure you want to do this, Tally?” Terrie paused at the closet, her hand reaching inside as she looked over her shoulder and met Tally’s gaze.</p> <p>Tally refused to fidget or to chicken out. This was the rest of her life. It wasn’t a scheme, it wasn’t a game, it wasn’t a titillating little adventure. It was the final break with a past that should have never affected her the way it had.</p><p>“I’m sure.” She nodded firmly. She was. Certain.</p><p>Until Terrie pulled the clothes from the closet.</p><p>Clear plastic protected the garments and hid nothing from the eyes. They were innocent. A simple red plaid skirt that would have ended at Tally’s knees when she was much younger but would rise to mid thigh now. A short sleeved white cotton shirt. A very proper Catholic girl’s school uniform. It struck a chord of fear in her chest so strong that she nearly trembled in the face of it.</p><p>It was just clothes, she told herself realistically, but she knew her subconscious saw it as so much more.</p><p>Terrie laid the outfit out on the bed. It was over ten years old and should fit in the manner that Tally required. She needed to exorcize the ghosts the good sisters of the academy had placed within her, and what better way to do it than to take this first step into a new life, dressed as the person she had been so long ago?</p><p>“It will be shorter,” Terrie warned. “And snugger. But it should fit you okay.”</p><p>Tally swallowed tightly. “It will work perfectly.”</p><p>She stared at the clothing laid out as though it were a snake, coiled and ready to strike. In many ways it was.</p><p>“Tally, you don’t have to do this,” Terrie said. “You know Lucian and Dev love you...”</p><p>“This isn’t about Lucian and Dev.” She shook her head slowly, still staring at the innocent articles of clothing. “This is about me. I need white stockings. The ones that go just over the knee,” she told her friend faintly. “Do you have shoes that will work? I don’t dare return to the apartment yet.”</p><p>“I have everything you need.” Terrie nodded as she smoothed her hand over the plastic. “I wish we had schooled together, Tally. Perhaps I could have made things easier.”</p><p>Tally shook her head shortly. Nothing could have made it easier; nothing could change the parents who never knew how to love the wild little girl they had given birth to.</p><p>“It’s really shouldn’t be that big a deal,” Tally said softly. “I’m a grown woman, Terrie. Not a child. I should have faced this a long time ago. I don’t know why I’ve fought as I have.”</p><p>“Perhaps because nothing was worth the risk until now,” Terrie suggested gently. “You’ve changed since going to Lucian’s office, Tally. You’re like this bright flame; where before you once glowed, now you sparkle. Love changes you. I told you that before. Perhaps, Lucian and Dev merely gave you the strength you needed to face it.”</p><p>Tally smiled rather mockingly. Was that true? At this moment, she had no idea. All she knew was that suddenly nothing mattered more than changing the course her life had taken.</p><p>The empty, cold apartment. The loveless life. The chill she felt when darkness fell and she realized how empty her bed was. When she realized she could only envision two men within that bed with her. Lucian and Dev.</p><p>“They’ll be there tonight?” she asked Terrie quickly rather than replying to her previous statement.</p><p>Terrie nodded, a smile of conspiracy crossing her lips.</p><p>“I just talked to Jesse a few minutes ago. He’s meeting them for drinks this evening after work. He’s been doing that a lot lately.” She frowned. “What the hell do they do there anyway?”</p><p>“Fuck each other’s wives?” Tally asked her with an amused grin. “As I understand it, the married Trojans can only fuck their own women there, never anyone else’s. House rules.” She rolled her eyes at the thought.</p><p>Not that she wanted Lucian and Dev to ever touch another woman. She would have to commit murder if that ever occurred, but the rule seemed designed to keep the married members in a constant state of lust while within the hallowed halls of their cherished Club.</p><p>Terrie snorted at that thought. “Jesse better never suggest such a thing. I don’t think he could stand it himself.”</p><p>“He doesn’t share you any longer?” Tally knew she was desperately delaying the moment she would have to uncover that damned uniform.</p><p>Terrie frowned. “Not in a while. He threatens to.” She shrugged. “He seems to enjoy it. But he’s been busy I guess...” Her voice trailed off.</p><p>“Men get complacent, I told you,” Tally warned her distantly.</p><p>“Hmm. We’ll see about that,” Terrie said thoughtfully, though her eyes were glittering with the light of battle.</p><p>Score another for Tally against Jesse, she snickered silently. So far, she was still ahead and Jesse was far, far behind her.</p><p>“Tally?” Terrie’s quiet voice drew her gaze from the uniform and back to her friend.</p><p>Terrie watched her with an edge of compassion, of concern. Tally could see the worry in her eyes now, the knowledge that Tally had to gather her courage to even touch the clothes, let alone put them on.</p><p>“I must really love them,” Tally mused with a self-deprecating little smile. “Because only love could get me in those clothes.” She looked up at Terrie, arching her brow mockingly. “What do we do if the clothes get ripped off me?”</p><p>Terrie shrugged in unconcern. “I would consider it a worthy sacrifice then,” she laughed. “The uniform has no meaning to me, Tally. Burn it when you’re done if you need to. Consider it a wedding present.”</p><p>Wedding present. Tally swallowed tightly. “One step at a time here,” she breathed in deep and hard. “One slow step at a time here.”</p><p>Chapter Seventeen</p><p>“You’re so fucked!” Jesse took a seat at the small table on the far end of The Club’s main room and stared at Lucian and Dev in sublime amusement. “You know, I would feel sorry for you if I didn’t think you had brought it all on yourselves. Didn’t I warn you about her?”</p><p>Lucian finished the drink he had ordered earlier and shot his friend a brooding look. Beside him, Dev grunted in obvious ill temper. Tally hadn’t shown up at work and hadn’t answered the message they left on her machine or the one they left with the cell phone’s messaging service later that day. Neither man was in the mood for Jesse’s mocking laughter.</p><p>“Don’t you have better things to do than harass us?” Dev asked him. “I thought you had a wife to keep fucked. Go home and do your job.”</p><p>Jesse laughed softly at that. “I’ve had mine today, have you had yours?”</p><p>Lucian gave him a look filled with the promise of retribution.</p><p>“What the hell are you doing here anyway?” Dev growled. “Marriage suddenly staling on you?”</p><p>Jesse laughed again as he shook his head. “You two are like bears with a sore paw. I have it on the highest authority she’s going to be home later tonight. You should go back and teach her a lesson. The right lesson this time. She won’t be so eager to make trouble then.”</p><p>He was clearly delighting in tormenting them, Lucian thought. Jesse was no more a hard ass than any of them were. Though, sexually, they were all well aware of his hold on Terrie, and hers on him.</p><p>Lucian stared morosely around the room. Was it their sexuality that had caused Tally to run? It wouldn’t be an occasional ménage; it was a lifetime commitment to two dominant males. Two men who were, defined by society, sexually depraved. Their every sexual desire hinged on their woman’s ultimate fulfillment, whatever that may be. They encouraged their women to relax all their inhibitions, to give in to even the most exacting pleasures.</p><p>“Jesse, you’re getting on my nerves tonight,” Lucian finally said with the barest hint of a smile. “Your marital bliss offends me.”</p><p>“Well, having your woman threaten my life this morning didn’t do a whole hell of a lot for me,” Jesse informed him with a disgruntled frown. “And I was trying to be nice to her, too.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That will teach you,” Lucian grunted, still uncertain exactly where they had gone wrong with Tally.</p><p>Jesse was clearly enjoying his smug amusement at the brothers’ expense. Lucian made a mental note to return the favor at the first available opportunity.</p><p>“Have you two thought that maybe you pushed her too far?” Jesse asked, his voice sobering.</p><p>Lucian sighed as he shook his head and leaned back in his chair. It was a question he and Dev had been asking themselves all evening.</p><p>“Hell, Jess,” Lucian finally sighed wearily. “The woman takes control to a whole new level. I’ll be damned if I haven’t given up on understanding how the hell her minds works.”</p><p>“I could have warned you of that,” Jesse grunted. “Why do you two think I let her believe she has me under control?” he asked them seriously now. “Tally functions at peak efficiency when she’s in control. You can’t conquer that woman. You have to gentle her. That’s a whole ‘nother ballgame from the one you’ve been playing.”</p><p>“Jesse, go away.” Lucian sighed. “I distinctly remember you forgoing advice with Terrie; now we’ll do the same thing.”</p><p>Jesse smiled at that. “Well, she surprised me too. Having her bring Tally in the bedroom scared the hell out of me. You don’t want to be restrained with Tally in the room.”</p><p>A frown snapped over Lucian’s brow as Devril seemed to growl beside him.</p><p>“Forget that night ever occurred, Wyman,” Dev snapped. “Amnesia could be a good thing.”</p><p>Jesse chuckled at the ire in Dev’s voice as he leaned back in his chair and regarded the two men with a striking absence of compassion.</p><p>“Have you two ever considered that breaking all that control at once could unleash a monster?” he asked them curiously. “In all honesty, I think I’d be scared if I were the two of you. Hell, I didn’t have anything to do with it and now I’m scared of her.”</p><p>Lucian narrowed his eyes on his friend. Jesse was offering little in the way of solutions and much in aggravation. He glanced over at Dev and shook his head as wry amusement tilted his brother’s lips. They weren’t frightened of her. They were more frightened of losing her.</p><p>Lucian finally sighed roughly as he dragged his fingers through his hair in irritation. Hell, he was horny, half drunk and less than pleased with the world in general today. He didn’t need Jesse’s amusement adding to the mix.</p><p>“It may have been a miscalculation,” he finally admitted. “Not unfixable, but a miscalculation all the same.”</p><p>Jesse snorted. He would have said something more but a commotion in the outside hall had all their eyes widening at the sound of the precise, furious female voice that echoed from there.</p><p>“You put your grubby little paws on me again, you little twit, and you’ll be carrying stubs.”</p><p>“Terrie!” Outraged alarm filled Jesse’s voice as they all jumped from the table and rushed to the entrance hall.</p><p>There she was. Lucian blinked at the vision, not certain he was actually seeing Terrie Wyman exactly as she was dressed.</p><p>Skintight, soft cotton black shorts accentuated the long line of her legs. The matching sports bra-type top barely concealed the full curves of her luscious breasts. Her flat stomach with its gold belly ring looked like the finest silk tanned a soft, golden brown.</p><p>Her hair was held securely back from her face in a tight French braid and she wore black sneakers on delicate feet.</p><p>“Cat burglars are dressing fine this year,” Lucian murmured behind Jesse as he held back his snicker.</p> <p>Jessie took a brief moment to cast him a fulminating look before facing his wife once again.</p><p>“What the bloody damned hell were you thinking?” he snapped as her eyes widened then narrowed at the incredulity in his tone.</p><p>“That I was looking for my husband?” she replied with mocking sweetness. “You spend so much damned time here I was starting to wonder exactly what was going on. And the goon at the gate wouldn’t let me in.”</p><p>“Did he know who you were, darling?” Jesse’s voice was dark, but smooth as silk, a clear indication that his patience and his temper were being tested.</p><p>A slender graceful shoulder shrugged as Terrie’s lips tilted in a sultry smile.</p><p>“Well, I didn’t mention any names,” she drawled sweetly. “Where would be the fun in that?”</p><p>Silence reigned for a full minute before Jesse turned to Lucian. His gaze was filled with amusement, though, rather than anger.</p><p>“I’ll warn you, Lucian,” he said mildly. “Only one person could have talked Terrie into such a stunt.”</p><p>Lucian’s eyes narrowed as Dev cursed behind him. Tally. It was a well-known fact that only Tally Raines could convince Terrie Wyman to get into any type of trouble.</p><p>“Come on, wife.” Jesse’s voice hardened when he turned back to his wife and her less than innocent smile. “I think it’s been too long since your last spanking.”</p><p>Lucian would have commented on just that lack of threat if someone behind him hadn’t let out a low whistle and a muttered prayer for strength.</p><p>“Have mercy!” one of the members muttered from the doorway to the main gathering room. “I’ve been a good little boy after all, because here’s a glimpse of paradise.”</p><p>Lucian turned slowly and moved to the doorway. And there she was. The definition of carnal, insatiable lust. This wasn’t sin. This was an angel of pleasure. Every good little boy’s wet dream come to life.</p><p>Terrie had warned them that Tally’s years at the girl’s academy hadn’t been pleasant. It was obvious Tally was out to exorcise some ghosts.</p><p>She was dressed in a mouthwatering, skintight, make-your-cock-stand-up-and-take-notice Catholic girl’s uniform.</p><p>The red plaid skirt showed off her gorgeous thighs and legs. The short-sleeved white blouse was open just below her breasts, giving a peek at a black lace bra as tempting as sin itself.</p><p>Delicate feet were shod in demure black leather shoes, while deliciously shaped legs were crossed at the ankle, covered by over the knee white stockings. He knew how perfect the flesh above the elastic lace of the stockings would taste and it made his mouth water.</p><p>Her long black hair was pulled to each side, braided and fell over her breasts. She was the perfect picture of decadence. She was the Tally he dreamed of day and night.</p><p>She was leaning against the bar, a drink in one hand, as the bartender stared at her with a bemused expression. Thom was clearly entranced.</p><p>“Good evening, gentlemen,” she greeted them in a low, sex-filled voice that had every cock in the room jumping to instant attention. “Nice place you have here.”</p><p>Lucian could hear the panting from behind him. He could sense Dev’s possessiveness rising to the fore as well. All those damned men, their dicks and their eyes trained on that luscious flesh was just too much for their already testosterone-overloaded bodies.</p><p>“Back off, asshole,” Dev turned and snarled as one of the men tried to push forward.</p><p>Tally wasn’t helping the situation. A perfect, brilliant red fingernail rimmed her glass as she watched the crowd gathered at the door. Matching lips quirked into a smile as dark eyes lowered drowsily to gaze back at the two men ready to battle every man in the room over her.</p><p>“I’ve heard quite a bit about your little Club,” she continued in that throaty voice, causing their cocks to jerk, the blood to beat hard and heavy through their veins. “Wasn’t it Stanton’s wife who related the complete orgy she had here for a honeymoon?” Her gaze sought out Drew Stanton as she tsked lightly. “Such bad little boys you are. You should all be spanked.”</p><p>A collective sigh of ecstasy sounded behind them.</p><p>“Somebody should be spanked,” Drew muttered from the back of the crowd.</p><p>“Tally, my love.” Lucian shook his head as he felt the heat of over a dozen men behind him lusting after her. “I wouldn’t tempt fate if I were you.”</p><p>She arched a perfect black brow mockingly. “Are you going to share me with them?”</p><p>“Not fucking likely,” Dev answered her, his voice grating, rough with lust and male possessiveness.</p><p>“Shit, Dev, give us a break,” Sax groaned. “What the hell sort of club do you think you’re a member of?”</p><p>“Wanna die, Sax?” Lucian snarled, not even bothering to look behind him as he advanced into the room.</p><p>Tally’s head lifted, her gaze seductive, her expression erotically knowing.</p><p>He could sense Dev’s wariness now; they were both aware that this was one game Tally had to play out. No pressure, no dominance. Not yet. She had to assert her authority, reaffirm her sense of strength, or she would never trust them enough to give her control back to them.</p><p>“Tell me something, do all you fine gentlemen bring your wives or lovers here for the communal orgy?” She lifted the glass to her lips and sipped lazily as her husky voice wrapped around each man in the room. “Or is there a criteria to being part of your little club?”</p><p>“There’s definitely a criteria, sweetheart.” Lucian crossed his arms over his chest as he watched her with simmering lust and a large amount of incredulity. “How the hell did you sneak in here anyway?”</p><p>A mysterious little smile played at her lips as she cast him a sultry glance. Come hither, sweaty sex and wickedly knowing. Her look was a temptation that had his cock aching for relief.</p><p>“So. What’s the criteria?” She ignored the last question in favor of the first as she glanced around her, her gaze stopping on the shackles that fell from the wall at the other side of the room. “Have you ever tested your play pretties out on yourselves?”</p><p>“Fuck!” Dev growled behind him as a dozen other men shifted uncomfortably.</p><p>Lucian drew in a hard, deep breath. Surely to hell she wouldn’t ask that?</p><p>“No need to,” he drawled softly. “We’ve made a lifestyle out of control, sweetheart. We don’t need the added help. What about you? Which of us do you truly think would give in first?”</p><p>She glanced up at him through the veil of her lashes, and he wondered if she was aware of how delicate and sweet her hard, pierced nipples looked beneath the thin material of her shirt and bra, if she was aware that her breasts were swollen, their up thrust curves making his and Dev’s hands itch with the need to touch them.</p><p>She arched a black, wing-tipped brow with curious mockery. “Which of us will be restrained?”</p><p>“No restraints,” Dev growled. “Don’t worry, baby, we’ll let you lose fair and square.”</p><p>Soft, amused laughter whispered from her graceful throat as she set her drink on the bar, her dark eyes watching them with lust and emotion. The emotion drew them both. They could feel the soul clenching fear that glistened for a second in the depths of the tobacco-brown orbs.</p><p>“Or you’ll lose. But here I am, you can spank me now. I’ve been a very bad girl,” she warned them with sultry heat as she straightened from the bar, one hip thrown forward as she spread her hands out to her sides, showing that luscious body in a pose so mouth wateringly sexual that Lucian was afraid he was about to drool from the effect of it.</p><p>“Oh hell. This is going to be one of those look-but-don’t-touch deals,” one of the men behind them moaned. “Hell’s fire. I knew I was going to pay for my sins somehow. But this is too cruel for words.”</p><p>“Touch and die,” Dev grunted as he and Lucian began to advance on the siren slowly.</p><p>Her breathing increased; her breasts rose and fell with excitement, her nipples becoming harder, the little rings surrounding them becoming fainter as the stiff little points grew more erect.</p><p>“Be sure, Tally,” Dev warned her as he moved behind her, not touching, allowing her to feel only the heat of his body as he leaned close to her, his hands moving to her braids, loosening the thick ropes of silk. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lucian stopped in front of her, staring down at her broodingly, lust eating him alive.</p><p>“Here or upstairs?” Lucian gave her the choice, though he had the feeling she had already made her choice.</p><p>She cocked her head, regarding him with an amused, aroused gaze.</p><p>“Do you need privacy?” she asked him, her expression reflective, her gaze lighting with excitement at the thought of an audience. She didn’t want to just bring them down, break their control; she wanted everyone in The Club to know who owned them. Just as they had made it known who owned her.</p><p>“Privacy isn’t needed, baby,” Lucian said as his blood began to boil in his veins and his cock seemed to engorge further than it ever had before. The hard-on from hell, and it was demanding relief. Where he would find the control to hold off for more than five minutes before fucking her blind, he had no idea.</p><p>“You can stop this at any time, baby,” Dev whispered to her as he leaned closer to her, his breath feathering the hair over her ear.</p><p>Lucian watched her eyelids flicker in pleasure. Her gaze clashed with Lucian’s, held, the steady build-up of excitement shadowed only by her fear. “Do your worst, Wicked.”</p><p>Lucian grinned, a slow, amused curve of his lips as he thought of all the wicked things he and Dev could do to her, for her.</p><p>His arm lifted, his fingers glancing over her cheek as Dev’s hands settled on her waist. She shivered at their touch; he forced back a shiver himself at the feel of her skin, so soft, so warm.</p><p>“You’re safe with us, Tally,” he whispered then, for her ears only, feeling her shudder against him as the heat between them began to rise. “Always. But tonight, you will beg...”</p><p>“Or you will.”</p><p>Chapter Eighteen</p><p>Tally’s head turned, her teeth locking onto Lucian’s thumb, her tongue swiping over it, hot and teasing as her head fell back against Dev’s shoulder, her body arching to Lucian as Dev’s tongue traced her ear.</p><p>Tally could feel the other men watching, taking their seats within the room, all eyes riveted on them. It wasn’t the first time they had driven a woman crazy in front of the other Club members, she knew. Terrie had given her what information she had, though that had been sketchy at best. She knew what happened tonight would be her choice. Knew that in taking this step, she was making herself a part of Lucian and Dev’s life in a way she could never take back.</p><p>“Do you have any idea how arousing this can become, Tally?” Lucian asked her softly. “All eyes are on you, watching you, waiting to see that one moment when you can no longer stand the pleasure and everything inside you explodes. That’s what The Club is all about, baby. That’s who we are. What we are. What we long to be. The trigger that transforms a woman’s climax into an explosion unlike anything she’s ever known. Her darkest desires, her deepest needs. We long for nothing more than to be the fulfillment of them.”</p><p>She wanted to cry out at the declaration, wanted to alternately rage at them for being so accepting of her, and whimper in submission. That need to whimper shocked her back to reality. She would take control here. Not them. They would learn that she could be just as dominant, just as aggressive, as any Trojan ever born.</p><p>She leaned away from Dev, licking her tongue slowly over her crimson lips as her hands slid up Lucian’s arms. His eyes narrowed on her. Oh yes, she liked that. He wasn’t certain what to expect, what she would do. She allowed her fingers to smooth over his chest, curl around the parted edges of his shirt.</p><p>A quick jerk and buttons scattered. Behind her, Dev groaned, his hands clenching on her hips as her lips moved to the wide expanse of muscular flesh. Her tongue circled a flat, hard male nipple as her other hand moved lower, her fingers curling around the rigid length of Lucian’s cock swelling demandingly beneath his slacks.</p><p>“Fuck!” His hips bucked against the sudden caress as his hands gripped her head, his lips lowering to hers.</p><p>She met him with her teeth. A hard nip at the hungry curve had him drawing back, staring down at her, his face flushing in arousal.</p><p>“Bad boy,” she snapped, then moaned, a low drawn out sigh of pleasure as she felt Dev’s teeth at her neck. Scraping, warning.</p><p>Lucian smiled dangerously. “Two of us, one of you,” he reminded her darkly.</p> <p>“True.” Her fingers moved to his belt, loosening it with deliberate flicks of her fingers. “Next time, maybe I will use the restraints on you.”</p><p>A second later Lucian’s cock was free. Tally didn’t give him time to retaliate. She bent at the waist, her buttocks pressing into Dev’s thighs as her mouth covered the wide head of the flesh straining from Lucian’s body. He filled her mouth, stretching her lips, burning her tongue with the heat of his cock.</p><p>“Tally,” Lucian growled as her tongue rimmed the mushroom shaped flesh, flickering as her mouth suckled him deep, moving over the tip of his erection with steady strokes as she felt Dev’s hands slip under the hem of her dress, drawing it upward.</p><p>They were all panting now. The air in the room was growing warmer, a dozen male bodies heating up as they watched the show being played out before them. As her mouth sucked at him, she allowed her fingers to stroke, beguile. Her nails scraped delicately along the shaft that wasn’t covered by her mouth, trailing to his heavy scrotum, caressing, scratching lightly, causing him to jerk in response.</p><p>Tally was fighting shudders, though. Dev was diabolical, his hands easing her thong from her hips, then her thighs, his lips moving over the curves of her buttocks with precise movements as his tongue dampened her flesh. Kissing, licking, making her pussy heat with the nearness of his mouth.</p><p>Lucian’s hands tightened in her hair as her lips slid from his cock and she began to lick down the hard shaft. She alternated the movements of her tongue with light, gentle nips and suckling pressure; she used the fingers of her other hand to torment the throbbing head.</p><p>“Take those damned clothes off, Tally,” Lucian said as one hand moved to the lace of her bra, struggling to get beneath it to the swollen curves of her breast. At the same time her mouth slid back up his cock, her tongue finding the ultra sensitive flesh beneath the flared tip of his erection as her mouth began to suckle at it lightly.</p><p>He tensed, the hand in her hair tightening as she felt the warning pulse just beneath the stretched flesh.</p><p>“Like hell,” he groaned.</p><p>He attempted to draw her head back. Tally’s nails tightened warningly, her lips moving to cover his cock again, draw it into her mouth and catch the hot, liquid drops of fluid that pulsed from it.</p><p>Behind her, Dev spread her thighs further, his breathing harsh and rough against her as his lips came steadily closer to the soaked flesh of her pussy. She tensed in expectation, trying to steel herself against the caress coming. If she could steal Lucian’s control then she would be satisfied. Just one of them. The odds were against her, but surely one of them would give before her.</p><p>As she suckled at Lucian’s cock her hand lowered, fingers spearing between her thighs into the thick length of Dev’s hair as she pulled him closer, rubbing her cunt over his suddenly licking tongue as he insinuated himself between her spread thighs.</p><p>She rose then, releasing Lucian’s cock as she jerked at the buttons of her shirt, parting the material further, revealing the swollen globes of her breasts, the hard dark nipples rising from them.</p><p>“Oh hell, spank her or something,” one of the men watching groaned in despair. “Spank that bad girl, Lucian.”</p><p>Lucian groaned as he gazed down at her hungrily. His head lowered, her lips met his and she cried out from the pleasure. How would she endure it? How would she survive both of them pushing her steadily closer to the final limits of her control?</p><p>She forgot about their audience, forgot about anything but each touch, each sigh, the feel of their lips taking her, tongues fucking into her. Lucian at her lips as Dev did the same at her cunt. Her body was a meal and they were greedy in their hunger. But no greedier than she.</p><p>The battle was one she knew she was ultimately doomed to lose. But she wouldn’t beg. She wouldn’t give in first. Even as her body screamed out in release, her pussy riding Dev’s thrusting tongue as her mouth accepted every hard thrust of Lucian’s, she swore she wouldn’t.</p><p>“Give in,” Lucian growled as his lips trailed to her neck. Desperate kisses, hard little nips testing the border between pleasure and pain, had her gasping at the sensations.</p><p>His hands covered her now bare breasts, his fingers tugging at the rings piercing them, sending shocking waves of pleasure searing through her, adding to the sensations piercing her womb as Dev ate from her pussy.</p><p>“You give in.” Her fingers stroked his cock from base to tip, milking the thick flesh as her lips went to his shoulder, her teeth scraping over it as he did the same to her neck.</p><p>Dev was groaning heavily between her thighs, his tongue licking from her clit to the entrance of her vagina, then sliding in deep and hard and thrusting in a series of shattering waves of pleasure.</p><p>Tally could feel her knees weakening, feel the currents of energy building in her womb, tightening, begging for release.</p><p>Lucian eased a bra strap over her shoulder, as his lips lowered to her breasts. Her fingers slid to the base of his erection, where the rock-hard shaft met the tightening flesh of his scrotum. Her thumb moved slowly, in sensuous circles until it pressed into the small indention there. She felt him tighten, heard a groan tear from his chest as his lips covered her nipple, his body jerking in response as she felt for, then found, the sensitive spot she had been searching for.</p><p>Her teeth nipped at his ear, her other hand twining through the strands of hair at the back of his neck as she felt Dev’s fingers exploring the area around her anus while Lucian’s teeth scraped her nipple.</p><p>The voracity of their passions began to heat the air around them. Sweat stood out on Lucian’s flesh; Dev’s hand tightened on her hip as a finger found the entrance to her anus. The digit, slickened by her own juices, pierced the tiny opening as Tally’s hand stroked upward, her thumb finding and caressing the sensitive spot just beneath the flared head of Lucian’s cock.</p><p>Twin male groans echoed around her as her own thin cry pierced the atmosphere. The caress of a dozen gazes wasn’t helping the rapidly building tension.</p><p>“Give in,” Lucian growled as Dev’s finger stroked in and out of the snug entrance of her ass. “Now, Tally.”</p><p>“You give in,” she panted, her legs shaking, perspiration coating her skin as she forced him away from her breast, leaned forward and nipped at his nipple.</p><p>Lucian’s hands clasped her head as her lips ran down his rock-hard abdomen, her tongue seeking and finding the damp head of his cock.</p><p>“Damn you, suck it,” he ordered heatedly as her tongue rimmed the thick knob. “Now.”</p><p>She moaned against the grip he had on her hair, pleasure and pain streaking through her scalp. She refused the harsh demand, though. Her tongue continued to lick firmly, arousingly, relishing the beads of semen that formed on the head of his cock as her hips writhed against Dev’s demanding tongue.</p><p>Pleasure seared every cell in her body as she fought to maintain control, to push Lucian past the brink of his own boundaries until they gave her what she desperately needed. Not just the loss of control, but the heady, ultimate knowledge of her strength as a woman. She wanted to be taken, no holds barred, no attempt at tenderness, not caring of who controlled what. She needed to be taken hard, fast, to a point where the pleasure and pain combined and she knew that the men she loved were as deeply enmeshed in the pleasure as she was herself. No restraints. Neither physical nor mental.</p><p>Her tongue flickered at the head of Lucian’s cock; her mouth sucked firmly, once, twice, then halted so she could lick at him again. His thighs were corded with the strain of holding back, his breathing harsh, broken.</p><p>“Now.” His snarl surprised her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Primal excitement shuddered through her body as he gripped her hips, lifted her. Dev quickly rose, parting her thighs; the hard, thick column of Lucian’s cock surged hard and fast inside the snug depths of her pussy.</p><p>Tally’s scream echoed around them. Nothing could have surprised her more.</p><p>“You fucking win,” Lucian growled as she arched in his arms, pleasure streaking like lightning through every cell of her body as he stumbled to a barstool, bracing himself in the seat as his hips surged, driving his cock inside her with hard, deep strokes.</p><p>“Oh God! Lucian,” she screamed as her own control shattered.</p><p>Behind her, she felt Dev moving in closer, lubricating the sensitive channel of her anus as Lucian drove her insane from the hard thrusts in her pussy. He stretched her, filling her to capacity as she shuddered in his grip.</p><p>All question of control—who owned it, who gave it—was gone. There was only the pleasure now. Pleasure unlike anything she could have known, could have imagined.</p><p>As she fought the building tension in her womb, the curling heat and static energy, Lucian stilled, holding her tightly to his chest, his breathing rough as he tilted her head to him, his lips taking her in a kiss that stole her need to breathe. At the same time, Dev moved against her, his cock pressing at the entrance to her ass, spreading the tightening muscles there, working the slick head of his erection inside the narrow channel, sending bolts of lava-hot sensation streaking through her nerve endings.</p><p>Her cries were smothered by Lucian’s lips, but there was no hesitation in her acceptance of the pleasure/pain that destroyed her mind. She was a creature of sensation, of sensuality. A figure of electrical impulses, gasping cries and liquid heat as the silken, steel-hard length of Dev’s cock surged into the tight recesses of her ass.</p><p>There was no fight to make it last now. Hunger, gripping and primordial, filled them, connected them, bonded their bodies in a way Tally knew she would never be free of. Hard, driving strokes filled her over and over again. The border between pleasure and pain widened as each sensation built upon itself until she tore her mouth from Lucian’s, her head falling back against Dev’s chest as her scream of release ripped from her soul.</p><p>Her orgasm ruptured inside her womb, raced through her body, tightening every straining muscle to the breaking point as they fucked into the clenching recesses of her body, their groans and hoarse male cries joining her scream as they found their own release.</p><p>Hot, rich semen jetted into her clenching pussy, her hot ass, filling her, marking her in a way she knew would change her forever.</p><p>Long minutes later she collapsed against Lucian’s heaving chest, trusting in the hard arms that wrapped around her, the lips that caressed her cheek, her shoulders. Whispered, fragmented words blended around her as they claimed her, their rough voices demanding, firm, despite the weariness that now dragged at all their bodies.</p><p>“Mine...” They said the words together, and she accepted them as one.</p><p>Chapter Nineteen</p><p>Tally awoke early the next morning, despite the fact that as soon as Lucian and Dev arrived at their secluded home they had taken her straight to the bedroom and punished her exquisitely. She had to pay, they had laughed, for daring to slip into The Club and break their control in such a manner.</p><p>Hussy, Dev had called her as he restrained her to the bed. Wanton, Lucian had laughed as he smacked her ass, watching as she drove her hips upward, seeking more of the erotic stimulation. They had kept her on the edge forever as she begged, pleaded, demanded they fuck her into oblivion. Which they had done, quite well, she had to admit.</p><p>Stiff, aching in places she had never known could ache, she dragged herself over Dev’s prone body, ignoring his irritable grunt as she slapped his well-defined ass.</p><p>“You’re late for work,” she informed him as she pulled Lucian’s shirt on over her bare body. “And I still have to go home and get dressed.” She picked her shirt up and frowned at the jagged holes where buttons had once been. “You ruined my clothes.”</p><p>“They were illegal,” Dev grunted.</p><p>“I agree. Ripping my clothing should be a killable offense.” She cast him a mocking look. “I’ll punish you tonight maybe.”</p><p>He opened one eye, staring at her balefully. “Go back to sleep.”</p><p>Back to sleep? She had never felt so energized. She pushed at his shoulder, chuckling as he groaned but still rolled over. His cock was erect, tenting the sheet, a thick invitation to pleasure as she straddled his hard abdomen and stared down at him warningly.</p> <p>“I hope you were serious last night,” she said softly, aware that Lucian had rolled closer as she felt his lips at her knee, his hand running down her calf. “Try to get away from me and I promise you, I’ll become your worst nightmare.”</p><p>She had read about stalkers. She was fairly confident she could do a wonderful imitation.</p><p>Dev reached up to tuck trailing strands of her hair behind her shoulder. His smile, normally wicked and provoking, was soft and gentle with emotion.</p><p>“Every word,” he told her softly. “Both of us, Tally. Forever.”</p><p>Tally swallowed tightly. She was giving so much of herself to these two men. She looked over at Lucian. “What if one of you wants someone else later?”</p><p>He looked at her in surprise. “Tally, you’re our heart. You don’t seem to understand, baby, we’re two sides of the same coin. You can’t have one without the other. And we’ve waited too long for this—for you—to even want or need anyone else.”</p><p>How could she not believe them? They watched her, their brilliant eyes filled with their love, their promises.</p><p>“What about children?” she finally whispered. “If we have children?”</p><p>Lucian shook his head in confusion. “Well, it would be nice.” He smiled slowly. “But what about them?”</p><p>She cleared her throat delicately. “You won’t be certain, you know.” She waved her hand expressively. “Who the father is for sure.”</p><p>A quick frown on both their faces was leveled at her. But it was male displeasure rather than the regret she thought she would see.</p><p>“Any child you have, Tally, is our child. It will never matter which of us fathers it, we’ll both know that possessiveness, that love for a child that is ours. That’s part of our bond, baby, and part of our gift to you.” Dev’s voice was low, deep, filled with emotion as Lucian’s hand caressed her flat abdomen almost reverently.</p><p>They took her breath, stole her fears, and for once in her life she believed. Believed that she was loved and that the needs that haunted her, tormented her, would be accepted. She loved them both. Slowly, overwhelmingly, both men had moved into her heart and filled it to overflowing.</p><p>“Good.” She glanced down at Lucian, swallowing past the lump of emotion in her throat. Grinning back at her wickedly, he pushed at the bottom edge of her shirt.</p><p>“Stop that.” She slapped at his hand and before either of them could stop her, she was off the bed and padding to the bathroom. “I have to get ready and go home before I can go to the office. I’m going to need coffee if neither of you minds. I hope you have a cappuccino machine.” She closed the bathroom door behind her, a pleased smile crossing her face. Life was definitely beginning to look up.</p><p>Dev glanced at Lucian as he rolled from the bed, staring at the closed door with a less than pleased glare.</p><p>“We’re fucked,” Lucian said simply. Dev knew he wasn’t referring to the act, but rather the state of dominance they could see would evolve during the less sexual moments of their lives with Tally.</p><p>“Hell, let her have fun.” Dev scratched his chest lazily. “She gets too far out of hand and we’ll tie her to the bed again.”</p><p>Lucian glanced at his brother mockingly. “Oh, you have no idea the monster we’re going to create.” He shook his head warily. “We’re fucked, brother. Plain and simple.”</p><p>He didn’t sound displeased.</p><p>“I’m waiting,” she called out from the bathroom. “Who had back washing duty this morning?”</p><p>Lucian looked at Dev as his brother met his gaze. They glanced at the door, each other, and the race was on. They could share during the best of times, but that damned shower didn’t have a chance of holding all three of them. Unfortunately, they both reached the door at the same time.</p><p>They sighed together. “Bigger shower for sure,” Lucian said with a grimace as Dev managed to push him back and, smiling smugly, reached the shower first.</p><p>Lucian leaned against the doorframe, smiling as Tally’s laughter echoed from the stall. The shadows of his brother and their lover twisted, turned, hands touched, lips met. Arousing and starkly possessive, Dev pressed her to the wall and proceeded to show her who was boss—at least, in the shower.</p><p>Life would definitely change for them all, but they had her now, their jaded little consort, ripe for loving and willing to accept the pleasures they could give, the adoration they had saved just for her.</p><p>Like the Trojans before them who had found that perfect woman, they would hold her, hide her when they could, watch her in pride when they couldn’t, and protect her as long as they drew breath. Their wicked intentions had paid off when they set their sights on her. And now their hearts, their very souls, would forever bask in the glow of Tally’s smile.</p><p>Epilogue</p><p>“Easy, Red. Fuck yes, baby, there we go, take it all.” Red, or Kimberly Madison as she was known to the political elite in Washington D.C., lay back on the walnut table, her hands tied to the straps attached to the sides of it, her legs elevated by Sax as he slowly fed his cock up her tight, well lubricated ass.</p><p>Her head thrashed on the hard surface; beads of perspiration dotted her face, her full luscious breasts and peaked nipples. It ran in rivulets down her waist, a small amount pooled in the tiny indention of her belly button and her thighs glistened with it and the added mixture of thick juice that accumulated from her bare, flushed pussy.</p><p>Sax had her thighs spread wide, bracing them with his muscular arms as he slowly fucked the petite little redhead while she screamed and bucked against him, begging for release. It was a sight Jared Raddington was certain would be burned in his mind forever.</p><p>Long, fiery red curls fell over the side of the table, strands of thick silk that would have caressed her hips but brushed the floor instead. Hair that dared a man to touch, stroke.</p><p>“Please, Sax,” she screamed as she fought the bonds. “Let me go. I can’t come like this. Please.”</p><p>Dark male flesh glistened with sweat as the hard thrusts increased, the bronzed length of his cock powered up the snug little channel in driving strokes, parting the exquisite curves of her ass and filling her with every inch of his dark, steel-hard erection.</p><p>Jared rose from his chair in the secluded corner he had chosen hours ago when he entered The Club. His first night there he wanted to get a feel for the place and the members, but he hadn’t expected the shocking scene that had unfolded.</p><p>Kimberly had walked in as pretty as you please, ordered a drink and stepped over to the tall dark engineer for Delacourte Electronics. For the first time in the year Jared had known her, she was without makeup, her expression displaying honest, bare emotion, even if it was lust, and the thin veneer of cold haughtiness she presented to the world was gone.</p><p>“Harder. Please, Sax, please.” She was nearly in tears now, begging for release. She strained against the bonds that held her, her hips writhing against the hard penetration of a thick dick tunneling up her ass in increasing strokes.</p><p>Her clit was swollen, peeking desperately above the folds of flesh that protected it, the little knot of nerves red and glistening in hunger.</p><p>“What’s with her?” Jared finally questioned one of the other members sitting close to him.</p><p>“Red?” Lucian Conover’s voice softened as he glanced at the scene. “Too much stress usually. She shows up about every three months, usually after the forced physical to prove she’s still a virgin, and lets off some steam. She’s a good kid.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Kid? She was twenty-four years old and screaming now for release, begging another man to fuck her ass harder, deeper. If it went much deeper she’d be giving the bastard a head job as it came up her throat. She was tiny, barely five four, delicate and as fragile as a fairytale princess. Or so he had thought. No fragile princess could take a cock up her ass like that and beg for more.</p><p>“Forced exam?” he finally found his tongue long enough to ask.</p><p>Conover grimaced. “That’s Senator Madison’s daughter. Her mother’s will stipulated the she had to be a virgin on her wedding night to collect whatever the hell her inheritance was. Evidently Daddy dearest wants it,” he sneered. “He had a judge order the quarterly exams to prove she was still eligible to inherit upon her wedding, whenever that may be. Should she fail the test, the good ole Senator collects it all.”</p><p>Jared clenched his teeth at the information. He knew Madison was a bastard, but even this was more than he had expected from the man.</p><p>“Damn you, Sax,” she screamed. “I can’t stand this.”</p><p>“She needs clitoral stimulation,” Lucian sighed. “Sax will have to delay it until he gets her to the point that he can get her off easily. The only members here today, besides him, are married.” There was a thread of amusement in his voice. “Except you.”</p><p>Jared stared back at her. She was bucking, begging, as Sax fought his own release.</p><p>“What does she need?” he asked then, knowing he was damning himself.</p><p>“Not much.” Lucian shrugged. “Smack her pussy a little and she’ll come like the fourth of July. After that, she’ll have a drink, play a few hands of cards and take a room for the night to sleep.”</p><p>Jared rose slowly to his feet. He would slap that pretty little pussy, for now. But his cock was raging for more. Soon he would fuck it just as hard.</p><p>As he crossed the room, Sax looked up; the strain of holding back was clearly reflected on his dark face.</p><p>“Help her,” he panted. “Fuck, I’m not going to last.”</p><p>“No. No. Don’t stop yet. Please...” Her voice trailed off as Jared rounded the table.</p><p>Her eyes widened, her face paled then hard, violent shudders began to wrack her body as she suddenly exploded, Jared’s name a keening cry on her lips as Sax suddenly thrust inside her hard and heavy, before pausing, his expression twisting with his own release.</p><p>Jared leaned close, one large hand framing her face as she gasped for breath.</p><p>“Next dick up your ass will be mine,” he swore forcefully. “No more, Kimber, not without me. Never again...” </p> </body></html>"]