["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>CHAPTER 1</p><p>The metallic click of a fingernail against the doorknob sends me out of my mind. Whoever is there knows damn well that I’m in here. I force my muscles to move, to stretch, as I stand and get out of the tub. Taking the only thing that I can use as a weapon, I grab a can of hairspray, intending to spray and smack the intruder with the can, if I get that lucky.</p><p>The shadow shifts and the floorboards creak. The nails jiggle the knob once more and then are dragged down the door in one slow sweeping motion. My heart climbs into my throat as my pulse goes into heart failure territory. Every inch of my body is shivering, but it has nothing to do with being cold. I want to grab the towel and wrap it around my body, but I’m too afraid to turn away from the door. I stand there after I step out of the tub, letting the water roll off me and onto the floor. Puddles form under my feet. My fingers clutch the can of hairspray tighter. I shake it and pull the cap off, putting it down softly on the counter. My nerves are shot to hell. I know someone is on the other side of the door and for whatever reason, they haven’t opened it yet.</p><p>I reach my hand slowly toward the knob, ignoring how my fingers shake, as I lift the can of hairspray in my other hand. My breath catches in my throat. My fingers touch the cold metal knob. Every last breath of air is crushed out of me. I stare, unblinking, ready to fight whatever assailant lies on the other side.</p> <p>Without warning, I yank the door open. I scream and spray, practically dancing in fear, trying to see who was waiting on the other side. After a second, I get enough of my brains back to realize that no one is at eye level. My gaze falls to the floor and I scream. A raccoon the size of a dog is hissing at me, and looks like it’s ready to attack.</p><p>“Awh, what the hell, what the hell, what the hell!” I scream—almost sing—as I act without thinking and jump over it. When I leap over the thing’s head, it twists to look at me. It must think I’m attacking, because it fights back. It rears up on its hind legs when I’m airborne over its body. My foot connects with the side of its head and the raccoon goes flying backwards into the bath, as I fall on the floor. It splashes in the tub, while making the most ear-piercing sounds I’ve ever heard. The animal clings to the side of the tub, trying to climb out, soaked. And completely pissed. I gawk at it for a second and then scramble my naked butt across the hall and go running into the living room. The insane animal runs like I’m the one attacking. It darts past me, soaking wet, and climbs our bookcases. The entire time, I’m screaming like someone is killing me.</p><p>When the knock at the door comes, I throw it open to see the eighteen-year-old high school kid that lives next door. His gaze is downcast at first and he starts to ask, “I heard yelling and wanted to make sure...” His voice cuts off as he stares at me wide-eyed.</p><p>The blast of fresh air and James’ unblinking brown eyes remind me that I’m naked. I turn and snatch at a sweater that’s hanging by the door and wrap it around me as quickly as possible. I slam the door shut behind James. Responding to him, I say, “No! That thing attacked me!” I’m breathing hard and can’t catch my breath. My pulse won’t slow and James looks like his brain melted. I blink at him as I tug the sweater tighter around my shoulders. The bottom of my ass is hanging out. I pull the sweater down, but then my boobs are hanging out. Hysterical sobs start to bubble up my throat and James seems to remember that I’m a real person.</p><p>I’m pointing at the raccoon. It’s perched on top of the bookcase with its hackles raised, hissing at us. “That thing broke in. I thought....I thought,” I blubber, motioning at it, “it was a—”</p> <p>James finally snaps out of it. He says calmly, “It’s fine, Miss Lamore. He’s just spooked.” James looks around and asks, “How’d he get in here?”</p><p>“I have no clue,” I say, my voice shaking, my entire body billowing like a reed in a breeze. I shiver and I can’t stop.</p><p>James’ eyes flick between me and the massive rodent snarling on my top shelf. Its little black muzzle looks like it’ll rip my face off if I step closer. James seems to decide something and steps towards it. I grab his shoulder, and scold him like he’s five, “Stay away from that thing! It’s crazy.”</p><p>James smiles and shakes his head. “He’s just spooked.” Ignoring me, James steps toward the animal, making cooing sounds. The raccoon stops hissing, but still looks mortified. It doesn’t move. After a moment, James turns to ask, “Do you have an apple or something?”</p><p>Nodding, I go to the kitchen to grab one and return, giving it to the kid. “Don’t let it bite you. Your mother is going to kill me as it is.”</p><p>James lifts the apple in the air. He uses a pocket knife to cut small pieces off. James can barely get the first few pieces to the psychotic rodent, but eventually its stomach overpowers its fear, and the giant fur ball climbs down. James opens the front door and throws the remains of the apple outside. The raccoon runs after it, and bounds down the front steps. I slam the door shut, and lean against it, splaying my fingers against the metal. I close my eyes, and tilt my head back. A major freak out is building inside of me.</p> <p>James clears his throat and seems to look anywhere but at me. “It looks like he got in through the chimney.” The kid points at the old fireplace and the knocked over candles that had been on the hearth. “I can tell the landlord to fix the trap, and you should board that up. I have no idea how he squeezed his way down. Usually squirrels are an issue, not raccoons.”</p><p>I realize he’s talking, and blink. Looking at him, I shake my head, saying, “No, I’ll tell the landlord about it. You’ve been enough help.” My face is burning. I think I was running around naked in front of this kid for way longer than I should have. I bite my bottom lip to keep it from trembling. “Thank you.”</p><p>He smiles awkwardly at me and says, “It was my pleasure.” James smirks and then disappears through the door. I push it shut behind him.</p><p>Then, I plaster my hands to my face and fall to the floor and cry. I cry because my emotions are so tangled that I can’t tell which way is up. I thought someone was there, that the person who was following me was ready to butcher my body and hide me under the floorboards, and my only defense was a can of hairspray. I’m pathetic. No one’s been following me. I let me mind runaway with brains.</p><p>CHAPTER 2</p><p>After I pull myself together, I head back to my room to change. Something feels off, but I can’t tell what. I glance around and everything looks the same. It’s just the raccoon, I think to myself. He probably got in here and moved some things. Ignoring the ice swirling in my stomach, I go to my laundry basket and heft it onto the bed. I’m still trying to find my favorite pair of panties. I dig through the basket, but they don’t turn up. The dryer doesn’t eat expensive panties. I’m usually so careful with them and I cannot imagine what I’ve done with them.</p><p>Annoyed, I suck in a gasp of air and sit down hard on the bed, letting the cold, damp, sweater I’m wearing to slouch down a little bit. The window is closed. Sunlight pours into the room through the slats in the mini blinds. I pull my hair out of the towel. I take a second to figure out what else to wear, when I look up.</p><p>Across the room is my dresser. It’s old, a hand-me-down, and the top is covered in make-up, blush brushes, and lip sticks that I didn’t put away. A square mirror with a chipped edge hangs above the dresser. Scrawled across the glass in bright red lipstick is a single word.</p> <p>WHORE.</p><p>Every nerve in my body is already frayed. Seeing this makes me come apart. I feel myself unraveling bit by bit and I can’t stop it. My heart climbs into my throat, pounding wildly. My jaw drops open as I stand and walk toward the piece of glass.</p><p>I glance around again, but no one is here. I’m alone. There is no other sign that someone has been in my room. I touch my fingers to the cold pane, touching the W with my index finger. It’s written in lipstick, my favorite cherry red lipstick. It’s the one that I like to wear on dates. Shaking, I yank my hand back from the mirror like I’ve been burned.</p><p>Someone was here. It wasn’t my imagination. It wasn’t a raccoon that freaked me out. Someone had stood outside my bathroom door and then come in here.</p><p>Frantic, I dress, pulling on jeans and a tank top. Fear slices me into little bits, making my mind freeze up and not work. The only thing I can think is to ask James if he saw someone leave my apartment. I walk outside, run next door, and bang on his front door too hard. His mother appears. She has bright red hair that’s pulled away from her face with combs. A spattering of freckles line her pale cheeks. Her name is Gabby.</p><p>“Is James around?” I ask, breathing I little too hard.</p><p>Gabby’s arms fold over her chest, “What’d he do?”</p><p>“Nothing,” I shake my head. “Well, actually, he helped me get a raccoon out of my apartment earlier. I wanted to ask him if he saw something.”</p><p>The square of Gabby’s shoulders soften and she turns, bellowing for her son over her shoulder. “Thank God that’s all you had to say. I thought you were going to tell me he knocked you up or something.” She shakes her head and turns away from the door, leaving me on the porch alone.</p><p>I ignore her statement, which should have irked me, and glance up and down the street. It’s filled with people. No raccoons. No one wearing a sign that says STALKER.</p><p>James appears at the door. I step back to let him out and he walks onto the porch. “What’s up?” he asks, pushing his hands into his pockets. “More rodent problems?”</p><p>I shake my head. I can’t look him in the eye. Something creeps down my back and suddenly, I wonder if it was him—if this kid has been the one watching me, following me. I glance up at him, and think I’m insane. James is a good kid. “I think someone was in my apartment right before you came in. Any chance you saw someone come out when I started screaming?”</p><p>James’s eyes flick to the side like he’s remembering. His hand touches his jaw, but he shakes his head. “No, just the scream. And your door was locked when I got there. I would have come in if it wasn’t. I thought someone was hurting you.”</p><p>I nod slowly, my hope sinking into my stomach. “Oh, okay.” I turn to walk back. I feel the mental fog thicken. I don’t know what to do.</p><p>James says, “What’s the matter? Why do you think someone was inside?” I can’t answer him. I don’t want to admit it, because that will make it real. Right now it’s an abstract idea, but if I say it... Oh God. I wrap my arms around my middle and turn off the steps. I start to walk away when James calls after me, “Hey, wait a second.” He follows me back to my door, asking questions that I can’t answer. Finally, he says, “Are you all right, Miss Lamore?”</p><p>No, I’m not all right, but what am I supposed to say? He’s a kid. I don’t want to burden him with this, and if I say another word, the tears I’m holding back will spill down my cheeks. James looks at me, waiting for an answer.</p><p>I glance at him, and force a smile. “Anna, call me Anna. I’m not that much older than you. Thanks for helping earlier.” James nods slowly, like I might say something else, but I don’t. He turns to walk away and I go back into my apartment. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I shut the door behind me and flip the deadbolt lock even though its daylight. My throat is so tight and dry that I can’t swallow. Hysteria pushes its way through my veins. I want to get out of here and never come back.</p><p>I go back to my room, find my phone, and press in the numbers for Emma. I have to tell her even if I don’t want to. If she comes back here alone and something happens to her, I’ll never forgive myself. Em’s voicemail picks up, since she’s still at work.</p><p>I try to say it briefly, but as I’m talking, I think that I sound way too scared for what happened. So someone wrote something nasty on my mirror?</p><p>Someone was in your apartment, Anna! My mind snaps back. Shaking my head, I change the reason for the call and tell her a raccoon got in and to be careful when she gets home. I hang up and tap my phone. For some reason, I can’t say it. I can’t admit what happened, yet. At the same time, I don’t want her walking in here at night, alone. I have to do something.</p> <p>I call his number without thinking. He picks up on the second ring. “Edward?”</p><p>His voice sounds surprised, “Anna? What’s going on?”</p><p>“Any chance you could come over later? I have an appointment and I don’t want Em alone here.”</p><p>He asks what happened. I tell him about the raccoon, and that I’m a little on edge. I don’t know where it came from and the more I think about it, the less likely it seems that it came down the chimney. I wonder if the perv threw it in the apartment when he came in. I fall silent and Edward says something, but I don’t respond. I blink, looking at my mirror.</p><p>“I’ll head over now, okay? You sound out of sorts.” I start to protest, but he’s gone. I look at my phone and the screen’s gone black.</p> <p>I run to the kitchen and get the Windex. I scrub away the letters before anyone else can see them. I pick up my make-up and put it away, but one tube of lipstick is missing. The one that was used to write on the mirror is gone. I can’t think about it. I need Cole. My mind feels like its floating in glue and doesn’t want to think. My thoughts are sluggish. The shakes calm down to a small tremor. I fold my arms over my chest to hide it.</p><p>I pace the apartment, looking for signs of entry, but there is nothing. Just the hole in the old chimney. That fireplace was part of the reason why we chose this apartment. Although it doesn’t work, the hearth is really cute. I stare at the busted up wood and the door buzzes.</p><p>I check to make sure it’s Edward first, and then let him in. His dark hair is wet like he just took a shower. He’s wearing jeans with a cream colored shirt that’s tucked in neatly at his waist. He looks me over once. “What’s the matter?”</p><p>His question makes me want to cry, but I can’t say it. It sounds stupid. I’m crying because there was a nasty word on my mirror. I’m crying because I’m not a whore, but someone thinks I am. Biting my bottom lip, I shake my head and don’t look him in the eye. “Nothing’s wrong, just frazzled. That raccoon scared the hell out of me. I need to finish getting ready. Maybe you can seal up the fireplace? It looks like he came in that way.” Lies, lies, lies. The pit of my stomach twists. I hate lying.</p><p>Edward nods and walks away from me, into the living room. I return to my bedroom and feel a little bit better since I’m not alone. I hear Edward moving things and then the sound of wood snapping as he cleans up.</p><p>I pull the heated flat iron through my hair, careful not to burn myself. When I finish, I look like a different person. I put on a different outfit than I originally intended. I grab a pair of black leather pants and a tight tank. I put my make-up on darker than usual, trying to hide the fear in my eyes. I don’t want this to ruin my night with Cole. He already has too much on his plate, and in comparison, this seems silly.</p> <p>Edward wraps his knuckles on my open door. He stands in the open doorway watching me as I apply a coat of mascara. “It’s boarded up.”</p><p>“Thanks,” I say, trying not to stab myself in the eye. I hold the wand and glance at him, “Do you mind hanging out until Emma gets here?” I look at the mirror and carefully brush my lashes with the black goop. My hand shakes slightly. I rest it on the dresser and take a breath. Why can’t I calm down?</p><p>Edward leans against the door frame and folds his arms over his chest. I can tell that he isn’t going to cooperate unless he knows what’s going on. “What’s this about, Anna? I can tell something’s bothering you. Just tell me. Maybe I can fix it.” His eyes burn a hole in the side of my face. He hated it when I wore makeup when we were dating. He likes that au natural thing going on.</p><p>“I don’t want to get into it now, Edward.” I finish and put the make up back in my drawer. I turn to him and say, “Please, do this?”</p><p>Edward nods once, but his eyes don’t leave mine. I feel a chill work its way through my body. He never had sex with me and he’s watching me get dressed to have sex with someone else. The way he looks me over makes me nervous, but then again, everything makes me nervous right now. I go to brush past him, when he gently takes me by the elbow and stops me. I turn toward him.</p><p>“You’d tell me if you were in trouble, right?” he asks. “We may not be lovers anymore, but I hope you still think of me as a friend.”</p><p>Breathing slowly, I feel his fingers on my arm. The contact feels wrong. I turn toward him so his fingers slip away. I want to say that we were never lovers, but I know where he wants this conversation to go, and I don’t want to rehash the past. I want to get to Cole and stay with him until all my apprehension fades away.</p><p>I smile and say, “Of course, I do. Like you even need to ask that, Edward? I could have called anyone, but I called you.”</p> <p>I walk down the hall and grab my helmet. Strapping it under my chin quickly, I grab my keys. Edward speaks as I get ready to go. His eyes are downcast, making him look vulnerable. “You only called me because I’m Em’s brother. If it was just you here, alone, we both know who you would have called.” He means Cole.</p><p>“But I didn’t. I called you. You’re here now. And I could have called him anyway, but I didn’t.”</p><p>Edward looks at me funny, his head tilting slightly, “You didn’t tell him?”</p><p>“Tell him what? That a rabid animal tried to take a bath with me? No. It seems more embarrassing than anything.”</p><p>“What else happened, Anna? I can see it in your eyes.” He steps towards me and my heart ricochets off my ribs. I can’t talk about it. I squirm away from him.</p><p>“Someone got in, okay. I don’t want to talk about it, but I can’t let Emma come home and find a pervert in her room.”</p><p>“Someone broke in?” he asks, his eyes narrowing as he shakes his head. “Anna, did you call the cops?” I shake my head. Edward looks at me, things finally clicking into place. “You didn’t tell anyone, did you?”</p><p>“I told you,” I bit back. It feels like I ate a can of nails. I can’t stand the way he’s looking at me. I can’t stand the way I feel, like my heart is going to explode at any moment. Just talking about it makes everything worse. “Just watch out for Em.” I turn toward the door and place my hand on the knob.</p><p>Edward shakes his head and follows me to the door. “Fine, fine,” he says reassuringly. “I’ll be here when Em gets home, but I’ve got to tell you that you’re a real piece of work.”</p><p>“Right back at ya.”</p><p>CHAPTER 3</p><p>I pick at a tomato on my plate. We’re sitting in Cole’s apartment. When I arrived he greeted me with the sexiest grin I’ve ever seen. “I didn’t think you were into that,” he says, eyeing my outfit.</p><p>I smile back, but I’m still nervous. When I pulled my bike out the parking garage, I got spooked. My neck prickled and I’m to the point that I’m ready to jump out of my skin. The thing is, I don’t know how to tell him. Cole is great, and it’s not that he won’t understand, it’s more that he’ll over-react. Saying what happened out loud makes the whole stalker thing real, although if I think about it at all, the lipstick letters on my mirror already did that.</p><p>We’re sitting at his table, which is made from some exotic dark wood. I lean back in my chair and look up at him. “I had something weird happen today.”</p><p>“Tell me about it.” Cole grins at me. He expects a wild story and he’s going to get one. My stomach twists as I think about telling him and a lump forms in my throat. The smile slips from his lips. Cole leans forward and takes my hand. “What’s wrong?” It’s a command. I can see it in his eyes.</p><p>I don’t want to wriggle out of telling him, but it feels wrong to tell. Maybe I’m stupid, yes, that’s it—I’m a class A, completely insane idiot. I have to tell someone. Worry pinches my throat tight. What if he doesn’t believe me? What if he thinks it’s nothing? Stop it, Anna! Just tell him. I suck in air and dive into my story starting with the bathtub and ending with James flushing the raccoon out the front door. Cole’s eyes widen as I tell it, but he doesn’t laugh. He hears my voice hitch and become smaller, more strained as the story goes on.</p><p>“And then what?” His blue eyes lock with mine.</p><p>I can’t look away and the feeling climbing up my throat won’t subdue. It’s raw fear. I try to keep it out of my voice when I speak, but I can’t. I lick my lips and take a breath. “When I got to my room, I noticed that someone had been there. They took my lipstick and wrote something on my mirror.”</p><p>Cole’s body tenses. Every muscle in his strong arms twitches. He’s no longer eating. Cole looks at me, his lips parted slightly. His fingers ball into fists. He’s fighting back the reaction he wants to have. Fury. “What was written on the mirror, Anna?” His voice is soft. It’s the opposite of his body.</p><p>My lips are sealed shut. I can’t speak. My voice won’t come. My lips won’t move. Cole comes around the table and pulls me into his arms. I start to sob into his shoulder. He pats my head and I manage to blubber out, “Whore. He wrote ‘whore’ on my mirror with my lipstick. The tube is gone. He took it.”</p><p>Cole says soothing things that don’t register. He holds me tight and the crushing fear that I felt all day cracks and falls away. He pulls me from the embrace and holds me at arms-length for a moment, trying to see my face. Looking into my eyes, he says, “You didn’t see anyone? Hear anyone?”</p><p>I shake my head. “No. At first, I thought there was a person at the bathroom door, not an animal. I saw shadows and thought they were feet. Then I open the door and it’s a raccoon. I was convinced that I was going nuts, that it was just an animal in the apartment, until I saw the mirror.” My eyes are glassy, but I’ve stopped crying. “I asked James if he saw anyone leave, but he didn’t.”</p><p>“The apartment was locked up?”</p><p>I nod. “It’s not like it’s Ft. Knox, but I’m pretty sure everything was locked.”</p><p>“Is there anything else missing? Or out of place?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I nod slowly, feeling the realization creepy up my throat like bony fingers. “A pair of panties is missing.”</p><p>Cole just stares at me. His nostrils flare and he blinks. “When? When did all this start?”</p><p>I pull away from him and slip off his lap. I have to stand. Nervous energy floods my body and I start to pace. His eyes trail my movements and his arms fold over his chest. I try to swallow again, but it hurts. My mouth is too dry. “I don’t know. I felt like someone was following me, but there was never anyone there. And then I thought it was you—”</p><p>“Me?” he says shocked.</p> <p>“Yeah, you said you were following me around, trying to talk to me. I assumed that you were following me.”</p><p>“Anna, I never followed you like that.” Cole runs his hands through his hair. “Shit. I can’t believe someone is doing this to you. I went to places where I knew you’d be. I never stalked you. This is a fucking stalker and he’s gotten into your house.” Cole pauses a beat and lifts his eyes to meet mine. “Does Emma know?”</p><p>I nod. “Yes, well, sort of. I felt weird telling anyone. I mean all that stuff in the beginning was just a feeling. No one was there, and I figured that I just lost the panties, but then today...” I shake my head and my eyes sting with tears. I blink them away and rub my eyes with my hand. “I called her brother over so she wasn’t there alone after dark. I left her a message on her phone. I haven’t had a chance to talk to her yet.”</p><p>“You told her brother?” Cole asks. “You told him that someone was in the apartment?” I nod again, trying to remember exactly what I said. The day had that white haze over it, like it was a memory from a long time ago. The part with the bathtub and the raccoon is vivid, but the rest grows fuzzy fast.</p><p>“I told him that it wasn’t safe for Em there alone. I asked him to stay the night and didn’t really say why. He promised he’d stay.”</p> <p>“You need to tell her,” Cole says. His eyes lock with mine. I’m standing in front of him with my arms wrapped tightly around my middle. I hate feeling like this and talking about it makes it worse. Cole asks, “Who do you think it is?”</p><p>“I don’t know,” I answer, and close my eyes. I press my fingers to my temples and glance up at Cole as I speak. “For a second I thought it was James. He was there when I was screaming, but he was on the other side of the door. James doesn’t have a key and the door was locked. If he got in, I don’t know how.</p><p>“And that doesn’t make any sense anyway. The kid’s in school. He’d have to be cutting and ditching curfew to show up at the times when I’ve felt spooked.” Goosebumps spring up on my arms. I try to rub them away. Cole steps toward me and pulls me to his chest.</p><p>“It’ll be okay. You stay with me,” he kisses my head and holds me.</p><p>“Cole, I can’t.” I look up at him, not wanting to mention it. “Sottero wants to take everything you have. If you don’t fight back... you’ll have no home. Besides, whoever this is will just come at me when you aren’t around. I’d file a police report, but what am I supposed to say? I don’t have a description or a name. I don’t have anything.”</p><p>Cole looks like I kicked him in the stomach when I mention the lawsuit. He turns from me and sits down at the table. He works his jaw and is quiet for a while. I walk to the kitchen and grab a bottle of wine and open it. After pouring two glasses, I return to the table and offer him one. I chug mine like it’s a shot.</p> <p>Cole looks at me and I know something’s changed. His back straightens. Cole stands and says, “I need to make a phone call.”</p><p>Cole disappears from the room. I hear his voice, but can’t hear his words. I don’t know what he’s doing or who he’s talking to. Tonight was supposed to be a night of passion, a night of sticky sex, and sultry smiles. Instead, I’m spending it recanting how my day went to hell and that some nutjob thinks I’m a whore. I down another glass of wine and lean my head on my hand. In a moment, my body feels warm as the wine works its way through me. The fear that’s been coiled in my throat all day lessens.</p><p>Cole reappears and drops his phone on the table. He walks toward me and never takes his eyes off my face. Cole slips his hands around my waist and pulls me to my feet. Running his fingers through my straight hair he says, “I’ll protect you. I promise. Nothing will happen to you.”</p><p>I nod. He watches me for a moment and something shifts. I feel safe with him. I know I am. It doesn’t make sense to be so scared and then feel so frisky, but I do. I want him. I want his hands on me. I want him to hold me. I don’t care what kind of kinky stuff he had planned for tonight. I want to show him that I love him. I want things to be soft.</p><p>I thread my fingers through his hair. They graze across his cheek as I do, feeling the stubble under my skin. He leans his head toward mine, and I feel his mouth on my lips. Cole kisses me lightly, like I might break. His tongue sweeps across the seam of my lips and I part them for him. The kiss deepens. It becomes hotter and possessive. Cole’s hands slip over my body, pulling me to him, claiming that I’m his.</p><p>I moan into his mouth and press my chest against him. His hands are on my back, drifting lower, feeling my curves. When he grabs on tight and pulls me up, I crash into his mouth and the kiss changes. Instead of being light, his tongue strokes my mouth like he’ll die if I pull away. His lips smash down on mine. His fingers tangle in my hair and pull gently, tilting my head back and opening my mouth more. When his lips drift to my neck, I can’t stand. I feel my knees give out and he catches me in his arms.</p><p>Without a word, Cole sweeps me up in his arms and carries me to his bed. He places me gently on the covers and looks down at me. “You’re amazing, you know that?”</p><p>I smile softly at him. “What happens if I say that I’m not so sure?” I feel uncertain, like my life is spinning out of control. I don’t know who I am any more. I don’t understand why someone is stalking me or what they want, and the red letters burn behind my eyelids every time I blink. I pretend that it didn’t bother me, at least I try, but there’s a twisting inside my stomach that doesn’t quiet. It chokes me. I tangle my fingers together as I look at him.</p> <p>Cole sees the worry in my eyes. He winks at me and turns away like he’s decided something. Curiosity flames through me and I sit up. Cole takes something from behind his dresser. They’re large prints in a black Le Femme box. “These will change your mind.” His voice is soft.</p><p>“What is that?” I cross my leather-clad legs on the bed and sit up. Cole walks back to the bed and sits across from me.</p><p>He hands me the box and says, “See for yourself.”</p><p>I lift the lid and set it down on the bed next to me. Tissue paper is folded over the contents. I push the thin papers back, parting the thin sheets until I see the photographs. My hand stills as I recognize the model. I glance up at him, “These are from that day...?”</p><p>He nods. “Yes, and if there is any doubt in your mind about how incredibly seductive, alluring, or sexual you are after seeing those, well, I’ll just have to take more.” Cole grins wickedly.</p><p>I react wrong. I feel it coming and I know it’s the wrong response, but I can’t stop it. Instead of feeling better, tears well up in my eyes and spill down my cheeks. I suck in air so fast that I choke. Cole shifts so that he’s sitting next to me, his gaze rapidly sweeping my face trying to figure out why I’m crying. I hold the picture in my hands, trembling. It’s beautiful. The trail of crystals that draped my body, the way he posed me, the light and shadows...</p><p>I rasp in a jagged breath and try to stop acting like a lunatic. “These are beautiful.”</p><p>Cole takes his hand and rubs my back as I look at the portrait. He kisses a tear from my cheek and whispers in my ear, “You’re amazing, Anna. You stun me into silence, and it’s not just because of any one thing. It’s you. It’s who you are, everything from your sharp wit, to your amazing eyes, to the way you wear those pants like they’re jeans—which they’re not by the way—you’re the best thing that’s ever happened to me.” His eyes are on the side of my face as he speaks. I can’t turn. I’ll explode into a ball of tears. As he says these things, a smile spreads across my face.</p><p>I look at one image, and then the next. I say nothing for a while, just gazing at his creations, seeing me how he sees me. The images that were painted with light showcase every curve. The stones glitter in the darkness, giving the impression of my curves that remain unseen. A pale violet light rims my waist and hips, trailing up to my breasts, and spilling onto my neck. My face is turned toward the light source, and unlike his old work, my eyes are prominent. There’s a look on my face that I wish I could conceal. It makes me feel completely naked, as if being stripped wasn’t enough. I feel like he’s captured my soul.</p><p>“It’s perfect,” I finally say.</p><p>Cole is watching me, his blue gaze never leaving my face. He drinks in the look in my eyes, the way they devour the picture and take in every tiny detail. “So are you.” He leans in and kisses my cheek. It’s a gentle kiss, chaste even.</p><p>I smile in response when he pulls away. Glancing at him, I say, “I’m glad we met. I’m glad you interviewed me and not someone else. I’m glad I wore that hideous outfit and insulted you. If I hadn’t, none of this would have happened. I—”</p><p>Cole doesn’t let me say anything else. He takes the box from my hands and sets it on the dresser before leaning in and pressing his lips to mine.</p><p>The last few times we were together, everything felt hot to the point of combustion. This time it is different. Cole’s kiss is soft and perfect. He makes no attempt to watch me the way he did last time. He stays with me, kissing my mouth like he’s searching for something, like I’m the one he needs, the one he wants. His hands slip over my body, feeling each curve as we lay back on his bed. I reach my arms around his neck and tangle my fingers in his hair, losing myself in the kiss. It’s a good kiss. There’s no other word for it. There are kisses that burn with lust and then there are others that are sweet. This one is both. It burns, but it doesn’t make me crazy. Lust doesn’t surge through my veins, something else does, but I’m not entirely certain what.</p><p>I let the kiss linger and Cole is no hurry. His tongue seeks mine, playing, feeling the curves of my mouth. He tastes me like he could never get enough. Cole’s hand lingers at my waist as the other finds my cheek. He brushes the back of his fingers across my jaw and down my neck as the kiss continues. I can barely breathe. My body is warm, yearning for his. I want to take Cole in my arms and never let go. The world around me vanishes. Every worry that occupied my mind disappears until there is only the two of us, lost in this kiss.</p><p>Cole slowly moves on top of me, leaning all his weight on one arm. His fingers play in my hair and his other hand slips beneath my shirt. He splays his fingers on my stomach and slides his hand around to the small of my back, pulling me closer to him. I feel the heat of the kiss, the desire building between us. That attraction has always been there, but this is more. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Breathing hard, Cole breaks the kiss and looks down at me. “I love you, Anna.”</p><p>His blue gaze makes me feel like I’m flying. I smile widely and say, “I love you, too.” We continue kissing, maintaining a slow pace. Cole kisses me, enjoying my mouth before moving onto my neck. His teeth nip my ear, before pressing gentle kisses along the side of my neck.</p><p>I pull him to me, trying to flip him over so that I can spoil him with affection, but he won’t let me. “No, Anna. I want you like this. I want to show you how much I love you.” The way he says it sounds like a question, like he’s asking me if it’s all right.</p><p>My heart is pounding. The way Cole looks at me is wonderful and terrifying. I’m not sure what he means, but I want to find out. I tuck my hair behind my ear. “All right.” I hear my voice and am surprised at how frightened I sound. This is different for us. Lust burns hot and bright, but this—whatever this is—feels like forever. It feels like love, the kind that doesn’t ever fade away.</p> <p>Cole’s eyes follow my fingers as I move the curl. The corners of his mouth pull up. He looks down at me and asks, “You only do that when you’re nervous.”</p><p>“Maybe,” I confess.</p><p>Pressing a kiss to my neck, he asks, “What’s making you nervous, Miss Lamore?”</p><p>My eyes close as his lips press to my neck. God, his mouth is so warm. I enjoy the sensation. “Well, my boss says he wants me...” my lips twitch. I’m trying to smile, but I can’t. I’m scared and unsure why. My eyes lock with his. I tell him the truth. “I can do the lust thing, Cole, but I’ve never done the love thing.” My pulse pounds harder, until the only sound I can hear is my heart racing. I can’t swallow. I can’t breathe. I don’t know what I expect him to do. Confessing that I’ve never been in love before doesn’t seem that intimate, but now, at this moment, it does. I wonder if he knows what I feel. The crash of ecstasy and fear are twisting together inside my chest. My jaw locks as I press my lips together.</p><p>Cole is quiet for a moment. He looks at me, his eyes slipping over my face. Finally, he says, “At one time, I thought love was so devastating when it was over, that it wasn’t worth the risk. I don’t think that anymore. I think love’s worth chancing the agony that things may go wrong. Besides, I don’t want to live like that, always wondering what I could have had, if we would have been happy. I’ve done that. It’s a lonely life, Anna.</p> <p>“There are only a few things I’m certain of. I have here and now. I have today. I had thought that there were no promises in this life, nothing to grab hold of—I used to think that nothing was forever, Anna. But this, me and you, it’s worth the risk. You’re already part of me, and it’s not that I can’t let you go, it’s that I don’t want to. I love you, Anna. You’re worth the risk.” He caresses my cheek with the back of his hand. His gaze doesn’t stray from my eyes.</p><p>“What made you change your mind?” I lean into his hand. His touch makes my stomach fall away. I feel like I’m flying or falling—or both. The moment feels surreal, like it’s passing in slow motion.</p><p>Cole’s eyes lower. Answering, he breathes, “You. You changed my mind. You changed my world...”</p><p>Taking Cole’s face in my hands, I pull his lips down to meet mine. I kiss him. It feels like my life is in a free fall. I don’t know which way is up and at that moment, I don’t care. I feel found in Cole’s arms. I feel whole. The feminazi inside my mind is screaming at me, but I ignore her. Relying on another person isn’t weakness. Wanting a man doesn’t mean I’m not a strong woman. It means I have a heart. It means I can love someone and for some crazy-ass reason, he loves me back.</p><p>We spend the night together in his bed, neither of us sleeping. Cole’s hands study every inch of my body. His lips follow, and he touches me, kisses me, and learns my body. I lay on my back as he strips my clothes away, leaving me naked. His eyes rake my figure, but he quickly moves on to caresses and kisses so soft and adoring that I’m floating in sheer bliss. My skin grows hot as my insides twist with each gentle touch. Every kiss is like a flame licking my skin. I feel Cole slide between my legs. He touches lightly before pushing his hard length inside of me. I moan and dig my nails into his back. I feel dizzy and giddy. There’s a smile on my face and no matter how hard I try, I can’t hide it.</p><p>Cole’s hands tangle in my hair. He whispers in my ear, kissing my neck, as he rocks into me over and over again. I wrap my legs around his waist and pull him in farther. We stay like that, in that euphoric state for hours, until Cole finally pushes me over the edge. My body shatters as I come. Every inch of me is hypersensitive. I feel him inside me and want him there. My nails claw his back as he finds his release, saying my name. He moves to pull away, but I hold him there.</p> <p>Looking into his eyes, I say, “I love you, Cole.”</p><p>Our sweat covered bodies are tangled together. He lays on top of me as I stroke his hair. My heart is pounding and I can’t stop smiling. My messed up cave-man has a soft side.</p><p>CHAPTER 4</p><p>The night passes slowly. When I try to fall asleep, I find that I can’t. The red letters are there when I close my eyes, sending my pulse into panic mode. I refuse to be thrown out of my home, but this stalker has done more than that—he’s gotten into my head. Fear courses through me and I shudder. Cole lays next to me, dozing on and off. He feels me move and tightens his arms around me, hugging me to his chest.</p><p>I hear his heartbeat, slow and steady. The warmth of his body pressed to mine is perfect. We stay like that for a while. Eventually Cole kisses my brow and says, “I’ve been thinking about what you said, about my name.”</p><p>Surprise fills me. I didn’t expect him to decide anything. Actually, I realized his name is important to him. It is the only part of a life that he no longer has. I guessed that his last name is like a security blanket, that it gives him comfort in some way that I don’t understand. I can’t rip that away from him. It makes sense. It’s also the only reason I can fathom as to why he’s letting Sottero walk all over him and steal his fortune.</p><p>I don’t lift my head from his chest. I lay in his arms and feel his smooth skin under my fingers. “Oh?”</p><p>“I think you might be right—that it isn’t worth holding onto. Not anymore. I know who I am. I don’t need a name to tell me that.”</p> <p>Worry trickles through me. “Cole, I just want you to be happy. I’m not sure if you should listen to me on that. I really don’t know anything about it or what you went through... I just,” I chose my words carefully, “didn’t understand before, but I think I do now.”</p><p>“You think so?” He shifts me in his arms and looks down at me. His eyebrows lift into his hair. A crooked grin lines his sleepy face. I nod. “So, tell me, then.”</p><p>I squirm in his arms, but he holds me tighter, not letting me wiggle away like I want to. I relax and his grip loosens. “Maybe I don’t know my ass from my elbow, but it seems like that name means a lot to you. It anchors you, gives you security about who you are and who you want to be. I get why you want to keep it. I shouldn’t have said anything. I was thoughtless. You should ignore me. I haven’t lived your life. I have no idea about anything. I showed up in a tutu for godsakes. I seriously doubt you should be taking advice from a life-size Skittle.”</p><p>I feel Cole smile against the top of my head as I speak. He trails his finger along my arm. “I like your ass, and your elbows are lovely, Lamore. And—a secret between you and me—I actually think you know more than you let on. You see more than you let on, Anna. I love you. I want to hear what you think, and on this, you were right the other day.</p><p>“That damn name carries a ton of baggage with it. Every time someone says Mr. Stevens, I think of my father. I wonder if I’m like him, even though I’ve tried so hard not to be. I thought I needed the reminder. I thought it guided me and helped shape me into who I am, and maybe it did, but I was thinking and realized that I don’t need it any more. I know who I am, with or without the name. And I want you, without all the crap that the Stevens name brings with it.”</p><p>I turn on my side. There’s a pillow under Cole’s arm that is behind my head. I don’t know what he’s saying. I look at him and our eyes meet. “Cole?” My voice is light. The moment feels fragile. I watch Cole’s face, wondering what he’s thinking and can’t understand why he’s suddenly silent.</p><p>His eyes lower, and when he lifts them again, they are completely vulnerable. “Anna Lamore, you are the best thing that ever happened to me. I want to make you happy for the rest of your life. I want to hold you in my arms every night and see your face every morning. I want you to be mine and I want to be yours.” His eyes don’t leave mine. “Will you marry me, Anna?”</p><p>Shock hits me in the head like a pail of ice water. “What?” I eloquently blurt out. I push my naked body up on his bed and look down at him. Sheets cover his lower body. Cole folds his hands behind his head and smiles at me.</p><p>“Are you really that surprised, Miss Lamore? Did you really think that I only took you into my bed, but managed to keep you out of my heart?”</p><p>My jaw is hanging open. I can’t breathe. I never expected a proposal. My lips press into a thin line and then lift into a smile. It’s like my face can’t decide if I should laugh or cry. “Are you serious?” I pull the sheet up, covering my chest.</p><p>Cole pushes up onto his side. He reaches for the sheet and gently pulls it from my fingers. His eyes drink in my curves, before his gaze meets mine. “Completely. I can’t resist you, and if you say no, I’m afraid that I’ll have to keep asking until you say yes.” He leans over me and presses a kiss to my neck. His lips are so warm. I enjoy the sensation for a moment before my mind starts yelling at me to pay attention.</p><p>“Until I say yes?”</p><p>“Mmmmh,” he says, pressing another kiss to the back of my neck.</p><p>I can’t think. I don’t want to think. I want to say yes, but fear won’t leave me alone. I try to be light, to joke to avoid answering right then. I shudder as his kiss presses to the back of my neck, right at that lust-inducing spot. “I might need some convincing,” I say in breathy voice.</p><p>“I’d be happy to.” Cole doesn’t press me. Instead he continues his kisses down my back. I slip face-down on the bed and turn my head so I can see him. I clutch the pillow under my head as Cole lights my body on fire. His touch is electric, his kisses drip with sensuality. I can’t resist him. I know I can’t, and I don’t know why I feel like I have to. I give in to his caresses, to his hands. He loves me and shows me. It’s more than I thought I’d ever get. I thought I’d have to settle for someone. Cole isn’t settling. He’s perfect, and yet, I notice that I couldn’t say yes to his proposal.</p><p>The next morning Cole dresses quickly. He has a meeting with his lawyer and I have to show up for the hearing later in the afternoon. I don’t want to go, but it’s a necessary evil. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cole looks beautiful in his suit. The color is so dark that it makes his eyes look like sapphires. He straightens his tie as he looks at me sitting on his blue chair, with my robe barely covering me. “You make it impossible to leave, you know that, right?”</p><p>I pull my knees to my chest and see his eyes follow the sweep of my bare hip. “I know.” My heart is racing at the thought of being alone. I’m afraid of the stalker. I wonder if he’s waiting for me, watching me. I don’t want Cole to leave, but I try to banish the crazy thoughts before they make me nuts. I’m not living my life like this. A bolt of determination strikes me and I try to tempt Cole into staying a little longer.</p><p>A wicked grin crosses my lips. I stand and allow the robe to fall to the floor. Walking toward Cole, I wear nothing but a smile. Cole freezes. His eyes watch me move toward him. Tension lines his shoulders and spills down into his arms. God, that suit makes him look gorgeous. When I reach Cole, I thread my arms around his neck and gently kiss his lips. The feel soft and warm, completely perfect.</p><p>Cole sucks in a breath and slowly releases it after the kiss. His eyes close as he does it. I step away, loving the effect I have on him. Cole smiles for a moment and then his eyes open. He looks me over and says, “I want you wearing that exact same outfit next time I see you.” Cole grins, winking at me before he starts to gather his things and move towards the front door.</p> <p>I laugh, following him. “I’m sure Sottero will appreciate a buck-naked Anna at court.”</p><p>“I know I would,” he says, not looking back at me.</p><p>I fold my arms across my chest and lean against the doorway. “Maybe I shouldn’t come today. I mean, she’s just going to try and use me against you—to prove whatever whacked point she’s trying to make.”</p><p>Cole turns and meets my gaze. He only looks at my face, but I can tell he’s fighting the urge to let his eyes dip lower. “There’s no way for your testimony to support her claim since you weren’t there.”</p><p>“But you were, and it doesn’t seem to matter what you say.” I wish I could make this go away. I can’t stand watching this happen to him.</p> <p>“I haven’t been fighting this, Anna, but now I intend to. I’m not letting it slide. I’m changing my name before my father’s attorney forces me to and I’m fighting back.” He looks at me for a moment. At first I think he’s asking me if it’s okay, and then I realize that he’s telling me. There’s no question in his voice. He knows what he wants. He knows what he’s doing and he’s informing me of his intentions.</p><p>“There are some things that are worth fighting for.” He winks at me, repeating my words back to me. I nod and smile softly. I don’t want him to get hurt, but I think he’s made the right choice. I can’t hide it. Cole smiles at me. “Don’t do anything stupid. Keep the doors locked until you leave. Get in and out of your apartment as fast as possible. Stay out of alleys and abandoned buildings. I’ll see you this afternoon.”</p><p>“Cole,” my voice catches. I step toward him, hesitant. “Do you think he can get in here?”</p><p>“No, baby,” he shakes his head. “The doorman doesn’t let random people in, and your bike should be fine in the garage. No one can get in there either without the guard letting them through. There are a ton of cameras down there, too. Are you going to ride your motorcycle in later?”</p><p>“I don’t know. Which is better? The bike or the train? I could end up in a car alone. With the bike, I’ll end up in the parking garage alone. I can park the bike on the street when I get there.” Goosebumps prickle my arms as I speak. I hate this. I’m altering my life because of this douche. I rub the bumps away, but the creeped-out feeling still lingers on my skin.</p><p>“Take your bike. I’ll keep an eye out for you, and you better believe that if you’re a second late, that I’ll come looking for you.” I smile. Cole crosses the room and pulls me to his chest. He presses a kiss firmly to the top of my head and says, “No one will hurt you.”</p> <p>I nod as he pulls away. I watch Cole walk out the door and my pulse ticks up a notch. It nearly explodes when I shower. The scene from Psycho keeps playing through my mind in an endless loop. I watch the suds swirl down the drain and remember the ribbons of blood on the bottom of the tub from that movie. By the time I get out of the shower, I’ve nearly peed myself twice.</p><p>“Stop it, Anna.” I say out loud, just to prove that I’m alone. The back of my neck won’t stop prickling. It feels like a ghost is breathing down my beck. I go to Cole’s stereo and turn it on, hoping that the noise will help. I blow out my damp hair and clip it back to the nape of my neck. I want to dress, but there’s nothing here. I’d already discussed this with Cole. Emma should be home and as long as she is, I’m going to grab my suit. If not, the backup plan is to buy another one. Maybe it’s a stupid time to be cheap, but I really want my suit. It fits me right and there’s no way I’m going to find another one in a few hours and make it to the courthouse on time.</p><p>I call Emma, hoping she’s home. She picks up on the third ring. “Anna, are you okay?”</p><p>“Yeah, Em. I’m fine. I’m at Cole’s. Are you okay?”</p><p>“God!” she spews swear words at me like a drunk gremlin and then asks, “What the hell happened? Edward said an animal got in, and then James came by to make sure you were okay. He said you asked him if he saw someone leaving the apartment? Anna, what the hell is going on?”</p><p>“Edward didn’t tell you?”</p><p>“Tell me what?”</p><p>Rage shot through me. I clenched my free hand and wanted to hurl the phone at the wall. “That someone got in yesterday? He was supposed to stay with you last night. Did he—”</p> <p>She cut me off, “Yeah, he stayed, but he didn’t tell me crap. He just said that he wasn’t leaving. The ass slept on the couch all night. He was really tense, so of course, we fought like crazy. Then, when I tried to call you, you didn’t answer.” Em breathes, trying to steady her tirade. “How’d you know someone got inside?”</p><p>My veins fill with ice when she asks the question. The red letters flash in my mind. I steady my voice. “Because they wrote something on my mirror with my lipstick—‘whore.’” My voice is too soft. I can’t hide how much this is freaking me out. Emma is silent. I expected that she’d be spewing foul words, but she says nothing. “Em?”</p><p>“Sorry, Anna. Oh my God. I didn’t know.” She coughs and clears her through. It sounds normal when she speaks again. “Do you think it was a fluke? Like a random break-in or something.”</p><p>I want to say yes, but I know it’s not. I can feel it. “No, it’s not random. I’ve felt like I’ve been watched for a while now. Some nights, I would have sworn someone was following me, but I never saw anyone. Then this happened. Anyway, I wanted you to know. Our apartment isn’t safe. Neither of us should be there alone.”</p><p>“Edward said the same thing. He wouldn’t leave. I thought he was just being an ass. Damn, Anna. I had no idea. What do we do?”</p><p>“I don’t know. I told you, Cole, and Edward. I guess we just hope that the guy stops. It’s not like I can get a restraining order or something. There’s nothing to report.”</p><p>“There was no broken glass?”</p><p>“No.”</p><p>“How’d he get in?”</p><p>I shrug and shift the phone to my other ear. “I don’t know. I’m assuming he got in the same way the raccoon did—through the chimney—but I don’t know.” That doesn’t make sense, but then again, neither does anything else. “I need to run by there to grab a suit. I have to appear for Sottero later today and I don’t have anything here. Any chance that you’re still home?”</p><p>“Yeah. I’m still here. Come by and get what you need. I’ll wait for you.”</p><p>I pull on my clothes and race down to the garage to grab my bike. When I enter the parking lot, I look around longer than usual and then try my best not to run. My skin prickles again and my entire body is covered in goosebumps. No one is there. Anger rushes through me, but it’s not enough to choke back the fear.</p><p>I have the key in hand and have already strapped my helmet onto my head. As I get closer, I see something on the seat. The seat is black, but there is something on top of the leather that looks like a black tissue. When I’m a foot from the bike, I recognize what it is. My spine goes straight and my heart jerks to a stop. My eyes go wide as I stare at my favorite pair of black panties that went missing. They are tucked under the seat strap. I’m so creeped-out that I don’t want to sit on the bike. I glance at the guard in the booth and then back at my bike, at the panties. Someone took them. Someone found me here and put them on my bike, on the seat, where I’d be sure to find them. My heart is racing like a scared rabbit. The trembling in my hands is spilling into my stomach in icy waves. I feel sick, like I’m going to puke. Anger bubbles into the mix. I’m angry that someone is doing this to me. I’m angry that he got so close and I didn’t notice. How could I be so stupid?</p><p>I refuse to let this ass get to me. I whip my head around, feeling the blood coursing through me like a bottle of shaken champagne. I feel wired. If he steps out of the shadows now, I’ll rip his eyes out with my nails. My muscles tense, waiting for someone to appear, but no one materializes. No one claims the fear that ignited within me. I’m alone.</p><p>I take the panties and stuff them under the seat. I kickstart the bike and peel out, leaving skid marks behind. I speed all the way home.</p><p>CHAPTER 5</p><p>By the time I get home, I’m calm again. I shove my key into the lock, ready to twist it open when Emma throws the door open and pulls me into her arms. She bear hugs me until my ribs are breaking. I can’t breathe and try to pry her off of me.</p><p>Edward is sitting on the couch. He stands and walks over. Resting a hand on Em’s shoulder, he says, “She needs to breathe, Emma. Let go. She’s fine.”</p><p>Emma releases me and looks me over. She tucks a strand of dark hair behind her ear, and acts like she doesn’t believe that I’m fine. “Let me look at you. Did something else happen?”</p><p>Damn it, Emma. How does she do that?</p><p>“No,” I lie and walk into the kitchen. My brain asks, Why are you lying, but I don’t want to think about it. I don’t want any of this. I shake my head and smile lamely. “I’m just frazzled. Some ass in a truck almost ran me over.”</p><p>“How can you be so calm about this?” Emma scolds. “What if it was the stalker?”</p><p>Uhm, I’m freaking out inside. Wow, did she read me wrong. “I’m not calm. I’m freaked, okay?” I turn to her and snap. I don’t mean to. I shake my head and close my eyes. “I’m sorry, Em. I’m just kind of freaked. I’m going to stay at Cole’s for a while, until this blows over. I just wanted to be sure that someone could stay here with you. Or maybe you should crash at your mom’s for a while.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She laughs at that. “Yeah right.” Okay, maybe that’s a bad idea. Em and her Mom fight like rabid cats. “No, I’ll stay here. Edward will stick around for a while, right?” He nods. While we’re speaking, Edward crosses the room and slips himself up onto the kitchen counter. “I should be okay as long as I’m not alone. And you staying with Cole for a little while is a good idea.”</p><p>I nod and look at my hands. My fingers twist together. I glance up at her. “Actually, it might be longer than a little while.” I flick my eyes up to meet Em’s.</p><p>“He asked you to move in with him?” she asks, mouth hanging open. A wide grin spreads across her face. I glance at Edward, not wanting to say it in front of him, but he’s going to be around for a while.</p><p>I shake my head. “He asked me to marry him, Emma.”</p> <p>“Holy shit! What’d you say?” Emma’s eyes are so big that they look like saucers. She practically bounces up and down as she grabs my hands. She thinks I said yes, but I didn’t and I don’t know why.</p><p>I do my best to treat Edward like a person, but I can’t meet his gaze. I look back at Emma. “I didn’t answer. I didn’t know what to say.”</p><p>Emma drops my hands. She’s shocked into silence and stares at me with her mouth in an O. Two seconds later she shakes her head and looks at the clock. “I’ve got to get to work, but we are talking about this later.”</p><p>“Definitely.” Things feel normal for a second. Emma hugs me again, quickly this time. Her phone rings. Edward lifts it off the counter top and hands it to her.</p><p>“It’s work.” He says.</p> <p>“Damn it,” she mutters, and says, “Hello.” Emma takes the phone into the other room. Her voice carries through the apartment for a moment until she closes the door.</p><p>Edward and I are alone. He sits on the counter, his spine ram-rod straight. “So, a proposal?”</p><p>I nod, “Yeah, is that too weird? I didn’t know if I should mention it in front of you.” I don’t want to hurt you more than I already have.</p><p>Edward smiles at me and shakes his head. “Nah, don’t be silly. You and Emma are best friends. Tell her anything you want. Besides, I’m not real keen on leaving her alone right now, not with someone breaking-in and all that.”</p><p>“You’re a good brother, Edward. Emma’s lucky to have you.” I say the words and mean them. He’s a good brother.</p><p>Emma bursts through her door. She pulled on clothes, but doesn’t have that polished look she’s normally sporting. Em grabs an apple from the fridge. “That ass. He wants me there now. Thanks for telling me.” Emma says to herself, muttering. She looks at me, “I’m sorry. I didn’t mean to run out on you like this. I should have had another forty minutes. I can’t believe Stacy thinks he can call me in like this.”</p> <p>“Looks like he can,” Edward says, and Em shoots him a look that says drop dead.</p><p>“Stay with Anna until she leaves, okay? I’ll be home at five. Let’s have dinner, Edward. And I’ll catch up with you later tonight, Anna. Call me when you have a second. I want to hear about Sottero and Cole. I can’t believe he proposed!” She bites the apple and runs for the door, practically tripping over her feet. Turning back, she says, “I can’t believe you said no!”</p><p>“I didn’t say ‘no,’” I reply, but Em is already gone.</p><p>When the door slams, I look at Edward. “Mind hanging out for a few more minutes?”</p><p>“No, that’s fine.” He tilts his head toward me. “There’s something black on the back of your arm.”</p><p>I twist my arm and try to look. There’s a thin black line that runs from my upper arm to my elbow. It looks like tar. I press my finger against it and it smears. “Shit. What is that?” I look at my fingers.</p><p>Edward slips off the counter and comes over. He examines the black goo, but doesn’t touch. “It looks like grease or something. You want me to try and wipe it off with a sponge?”</p><p>“Nah, I know how much dirt freaks you out. I’ll do it.” But as I do it, I smear the black goo across my arm. It doesn’t come off and now there are black streaks of water running down my arm and into my shirt.</p> <p>Edward watches me for a second before snatching the sponge, “I swear, Anna. It’s a wonder you’re—” he stops before he says it. “Just stay still.” He puts warm water on the sponge and uses dish soap to get the grease off my arm. When he’s done, he throws the sponge in the sink and says, “Take a shower to get the rest of it washed off.”</p><p>I glance at the time. I need to get to the courthouse early. Cole’s lawyer is supposed to go over stuff with me. “Damn it.” I look at the gray schmutz on my arm. He’s right. I dart to my room.</p><p>Edward returns to the couch and flips on the TV. It’s blaringly loud, like he’s totally deaf, which is weird, but I’m in too much of a hurry to think about it. I strip quickly and pull on a robe. Racing to the bathroom, I turn on the water and scrub my arms until they’re raw.</p><p>When I return to my room, I’m dripping wet. I leave a path of puddles on the floor. My robe clings to me because my skin is still damp. I towel off my legs and then turn my head to the side to dab the ends of my hair. My eyes drift across the room to my dresser. The top of it is exactly the way I left it with one glaring difference.</p><p>My heart stops. I drop the towel. It lands in a lump at my feet. Fear chokes me, making it impossible to swallow. I stare at the tube of lipstick and feel my heart slam into my ribs like I just got electrocuted. I step toward it, my hand shaking as I lift the tube. I stop in front of it, not wanting to touch it. This was gone. The perv took it with him and now it’s back.</p><p>My panties on my bike.</p><p>The words on my mirror.</p><p>Horror washes over me in an icy wave. I lift the tube of lipstick and slip the cover off. It’s the cherry red. The tip has been smashed like someone used it as chalk. Terror courses through me and I drop the stick. It falls to the floor and rolls under my dresser. My hand slaps over my mouth to muffle a noise that sounds like a cross between a cry and a sob.</p><p>Frantically, I look around the room. There are no signs of forced entry, no broken windows, no opened locks on the windows, no nothing. My body acts like it wants to run. The muscles in my legs twitch. I turn toward the closet, deciding to get dressed and get the hell out of here. I’m never coming back. I’ll never leave Cole’s side again. And I’m telling Emma to frickin’ move.</p><p>My veins are coursing with panic. As I turn toward the closet, I catch movement out of the corner of my eye. Edward pulls the door open. He stands in the doorway, watching me in my robe. My wet hair is plastered to my face. A shiver slips down my spine like an ice cube. I stare at him for a second, wondering if he’s twisted enough to do this to me. I think I’m going insane and ignore the warning flags my mind is beating me with over the head.</p><p>Edward doesn’t look at me. He looks past me, at the dresser, and asks, “I heard something fall. Are you all right?” I nod, too freaked to talk. I clutch my robe tighter at the neck. Edward finally turns and looks at me. “Did you get the grease off? Are you clean?”</p><p>Am I clean? That question would have pissed me off a few months ago. Now, it just sends a jolt of panic through my throat. I can’t swallow. My mouth is so dry. My neck feels thick, like a log, and words won’t form. I nod again.</p><p>Edward steps into my room, his body blocking the door. I feel like I’m cornered. I glance over my shoulder at the window, wondering how much it will hurt to throw myself through it. Logic intercedes and tells me that this is Edward. I know him. He won’t hurt me. He isn’t the one that’s been messing with me. But, memories that seemed odd, or didn’t make sense before, come racing back.</p><p>Edward showing up when he didn’t know where I was. Edward finding me outside of Cole’s. Edward showing up at the beach. Emma knowing things she shouldn’t have known, things I never told her. The missing panties. The cherry red lipstick that he hates. The way he said he’d wait for me, that we weren’t over.</p><p>My chest tightens. I shrink back from him, still not wanting to believe what I’m thinking. Edward looks apologetic. I don’t understand why. He presses his palms together and then parts his hands as he speaks, “Good. I knew there’d be a day that you came home and I’d be here—that you’d want me here.”</p><p>“Edward,” I manage to choke out his name. I lift my hand without meaning to, the universal sign for STOP but he keeps coming toward me. “I need to get dressed. I have to be at court. Can we talk later?” My voice cracks. It’s a pathetic attempt to placate him, to ward him off, so that I can run and never look back.</p><p>He stops in front of me, my hand pressing into his chest. Edward presses his hands on top of mine. “Now’s as good a time as any. I heard what you said before—about not accepting his proposal.”</p><p>“Edward, I—” I try to pull my hand away, but his fingers wrap around my wrist. Edward lifts my hand to his lips and brushes a kiss against the back of my hand. I yank harder, but he won’t let me go.</p><p>“You’re still in love with me. I know.” He says it with complete certainty.</p><p>“I’m not!” I jerk my wrist again and stumble backwards when he releases me. A pained expression draws his dark brows together. It’s like he won’t accept that I don’t like him, that he intends to have me anyway.</p><p>“You are,” he insists. “You told him no. You dumped Jessie. I can forgive your infidelity, Anna, but I won’t tolerate your lying.” Edward’s eyes blaze with fury. His arm swings before I see it coming and he connects with my cheek in a loud WHACK.</p><p>Stunned, I stagger back into the corner. My back presses against the wall as my hands cradle my cheek. Pain splinters through my face, exploding behind my eye. I’m trembling. I can’t help it. Something is very wrong with him and I never saw it coming. I plead, “Edward, this isn’t like you. You—”</p><p>He steps toward me and lifts my chin. I can’t pull away from him. I’ve pinned myself against the wall. There’s nowhere to run. No way to escape. “I’m a forgiving person, Anna. I’ll take you back. You don’t even have to ask, but... Do. Not. Lie. To. Me.” His hand squeezes my face hard as he bites off the last words staccato, practically spitting in my face.</p><p>My body is jacked up. Part of me wants to attack him in order to get the hell away. The other part of me is falling to pieces, ready to fall at his feet and sob, hoping to God that he isn’t this monster he seems to be. I don’t decide what to do. My body trumps my mind, and before I know what I’m doing, I tear my face out of his hands and jerk my knee up between his legs. Edward sucks in air as he staggers back from me. I have enough room to get by. I dart for the front door, intending to run screaming into the street.</p><p>Before I manage to make it down the hall, Edward is behind me. I hear only the heavy thumping footfalls and my clamoring heart. Although the TV is blasting, I no longer hear it. My bare feet slip on the hallway floor as I race forward. The puddles that I tracked from the bathroom are still there, gleaming, and knock me off balance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>All I can think is too slow, I’m too slow. My lungs burn. It feels like I can’t breathe. I want to scream, but I have no voice. It’s like a nightmare, where I can’t run fast enough. My heel hits the floor hard and I slip. Frantically, my arms swing as I try to regain my balance. In that moment, Edward catches my elbow and rips me back. I jerk to a stop and whirl around, my robe swirling at my hips. His fingers dig into my arms and it feels like he’ll crush my bones. Edward’s face is twisted with rage. His eyes are narrow and dark. Without warning, Edward releases me and throws me into the wall.</p><p>My head hits the plaster hard, but I don’t feel it. Adrenaline is pumping through me. I should be able to toss a dumpster like a superhero, but I can barely stand up. Terror courses through my body, consuming me whole. It makes my movements erratic, like I can’t decide what to do or when. I twitch against the wall, and then try to go for the front door again. Edward blocks me. He uses his body to pin me in place, this time guarding his assets more carefully.</p><p>“When are you going to learn, Anna?” he growls at me. Edward’s knee pushes between mine, parting my robe. A sob bubbles up my throat, which seems to make him smile. He grips my wrists, slamming them to the wall above my head. I can’t move.</p><p>I take a few breaths to steady myself and intend to scream FIRE at the top of my lungs, hoping James is home and that he can hear me over the TV. Last time James heard me scream, he came running. But before I can exhale, Edward’s massive palm covers my mouth. I scream into his hand. I use my free hand to try and pry him off of me, but he doesn’t move. I don’t know what to do. I writhe beneath him, trying to break free. I can’t stand it. My heart is racing so hard that it’s going to explode. I don’t think. I act. I listen to the crazy girl inside my head that’s telling me to bite down and lock my jaw. I listen to her when she says to take my nails and shove them straight into Edward’s eyes.</p> <p>I bite and scratch. Edward yells, and shoves me hard. I’m flung across the hall and land hard on my hip. I don’t look back to see him pressing his hand to his eye. I don’t want to see the blood on his palm. I taste the coppery tang in my mouth. I know I made him bleed. I round the corner on my hands and knees and go to the kitchen to look for a weapon. Backing myself into the corner, I grab a knife off the counter. I’m standing by the time Edward enters the room. He comes at me again, even though there’s a knife in my hand. It’s the big, sharp one that Emma uses to cut up chicken. I don’t want to kill Emma’s brother with her chicken knife, but I don’t know what else to do. Part of me thinks he’ll stop, but the more feral part of me senses that he’ll never stop.</p><p>I clutch the knife harder. “I swear to God, I’ll stab you. Stay the fuck away from me!” I yell at him, spitting his blood out onto the floor when it leaks into my mouth as I speak. A streak of his blood must be smeared across my face.</p><p>Edward laughs, like I’m a child and he can do whatever the hell he wants. “You really intend to cut me?”</p><p>“You really intend to rape me?”</p><p>His jaw drops. Edward manages to look insulted. He steps toward me and presses his hand to his chest. “Rape you? That’s what you think this is?”</p> <p>“Yes, you crazy fucking bastard,” I growl, aiming the tip of the knife at his heart. I wonder if I should be aiming for his stomach, but I don’t move. My elbows lock. If he comes at me... Oh God.</p><p>He talks to me like I’m a child, too naïve to understand his intentions. “Anna, darling, put down the knife and we can talk about this. You obviously can’t tell, but I wouldn’t let anything happen to you. You’re mine. I intend to keep things that way.” He steps toward me. Lifting his hand, he says, “Give it to me, now.”</p><p>I press my body backwards, but hit the cabinets. The draw pulls bite into my bare legs. I’m pretty sure my robe is hanging open, but can’t look. I don’t move. Edward’s eyes lock with mine. He moves towards me. He’s too close. I jab the knife at him when he’s within an inch of me.</p><p>Edward stops. He lifts his hands like he surrenders. “Anna, please. You know me. You know I wouldn’t hurt you.”</p><p>“Then leave.” My arms are starting the shake, but my hands hold onto the knife like my life depends on it.</p><p>“I can’t do that,” he growls. “I can’t let you continue to act this way. Give me the knife or I’ll take it from you.”</p> <p>“You’ll have to kill me first—”</p><p>Edward rolls his eyes, “You are so damn dramatic.” He lunges at me.</p><p>I don’t want to stab him. He’s my best friend’s brother. It makes my arms turn to jelly when he slams into me. I hear him scream, but I don’t know why. Edward grabs my wrist, but I don’t let go of the knife. The blade is streaked with crimson. I watch it as Edward slams my hand against the counter, forcing me to drop the blade. It clatters as I watch in horror. Then, Edward reaches to pick it up. My pulse is pounding in my ears. My mind is screaming at me to run, while every muscle in my body is corded tight and bursting with panic.</p><p>I press myself against the cabinets and slip past him as he twists to grab the knife. I’m almost out of the tiny kitchen, but Edward grabs me. Pulling me into his arms, he turns me to face the counter top and presses the knife to my neck. It’s already slick with blood. I suck in air and go still in his arms. If I move, he’ll slice my throat. I know he will. Tears roll down my cheeks and I can’t stop them.</p><p>Edward hisses at me as he slams my head down on the counter. The knife resumes the position, pressed to the side of my throat. I feel his hips press against my bottom and feel how much he wants me. I sob, and beg him to stop, but he doesn’t. I hear the zipper on his jeans slowly open.</p><p>I try to scream, but can’t. His weight on my back makes it so I can barely breathe. I babble incoherent pleas as my eyes blur with tears. He doesn’t answer me. Instead I feel my robe being torn away and my legs being forced apart. He presses himself against me, and stays like that for a moment. The feel of him against me makes me want to vomit. My mind flips on again, and I stop begging him to let me go. I sniffle as thoughts fly through my mind. I try to think of any plan to escape, but nothing is within reach. I can’t hit him. The way he has me pinned is going to make me pass out. I can barely breathe. Edward’s arm is crushing me facedown into the counter. His leg is between mine, holding them open and the knife is at the side of my throat.</p><p>Edward’s voice fills with triumph. I feel something warm and slick from him slip onto my side. Out of the corner of my eye, I see a trail of red drip from his waist and onto mine. I must have cut him with the knife before. The wound on Edward’s side is deep and a steady stream of blood flows from it, but not enough to stop him.</p><p>“This is for your own good, Anna.” He sounds like he’s enjoying this. I can almost see the smile on his face. He leans harder on my back and I feel the pressure increase, and all the air is forced out of my lungs.</p> <p>I try to scream, but can’t. Tears overflow from my eyes and soak the counter. I open my mouth and try to yell, but it’s barely a whisper. I tense and close my eyes, not wanting to be here, wishing to God that this isn’t happening. I tune out his voice, not wanting to hear his words. He gloats that he’s won, that he knew he’d have me in the end. I’m aware of his hands on my body, touching me in ways he shouldn’t, as the world goes fuzzy at the edges. Blood pools under my face and gets in my eye. I don’t blink. I don’t writhe. He has me and there is nothing I can do. My heart feels like it has exploded. My body starts to go numb. His hand is on the back of my head holding me to the counter, while he leans harder on my back with his elbow. My arms dangle lifelessly at my sides. If he lets go, I’ll fall to the floor.</p><p>When he moves his hips, I want to cry, but can’t. No breath fills my lungs. I sag under him as he gets ready to push into me. Just as Edward’s about to rape me, the knife disappears. Then the arm that’s crushing my ribs is gone and my head falls to the side. I hear his voice—Cole—as I slip to the floor. I lay on my side and my eyes flutter open. One is caked with blood and won’t focus.</p><p>It is Cole. I blink slowly, trying to focus. Cole disarmed Edward and is beating him. Edward is on the floor in front of the refrigerator, covering his face with his hands. He doesn’t fight back. The knife is lodged in the wall next to the door way. Blood drips down the wallpaper in tiny red beads.</p><p>It takes me a moment to realize what’s happening. It feels like time is moving so slowly. Cole’s fist connects with Edwards ribs. Blood is everywhere—on Edward, on Cole, and on me. My robe is ripped any laying next to my feet. I want to reach for it. I want to cover myself, but it looks like Cole is going to kill Edward. Every time he punches him, Edward’s head slams back into the fridge. Blood is flowing from a head wound and from his side where I stabbed him.</p><p>I push myself up and feel like I’m going to hurl. Before I fall, I catch Cole’s arm as he’s about to swing another punch into Edward’s battered body.</p><p>“Stop,” I manage to choke out. The muscles in Cole’s arms bulge. I try to hold Cole back, but can’t. I start to fall, and lean into Cole.</p><p>When he sees me, the expression on his face is filled with fear. “Anna,” he breathes, pressing his hands to my face. He pulls me to him and kisses my face. “I thought—” his voice catches. “I saw you on the counter, and him on top of you. There was so much blood. I thought he...”</p><p>Tears steak my face. I can’t stand the look in his eyes. I lean against his chest as I speak. “He didn’t... I’m okay. He didn’t stab me.” I lean all my weight against Cole. After a moment, he supports me so I don’t fall over and pulls back to look at my side. Cole presses his fingers against my skin, wiping away the blood. “I’m not bleeding.”</p><p>Before Cole has a chance to respond, the door flies open. Two cops come in with their weapons drawn. The whole thing looks wrong. It appears that Cole is the one who attacked, not Edward. They move between us, pulling me away. They give me a blanket and I realize that I’m shivering, even though I don’t feel cold. They mutter something about shock and call for an ambulance.</p><p>They move through the apartment quickly and spot Edward laying on the floor in a puddle of blood. They sit me on the couch and one officer stays with me. He speaks to me, but I can’t focus. I pull the blanket tighter. I hear Edward’s voice and fear shoots through me in a cold burst.</p><p>“Miss,” the officer says again. Slowly, I turn my face and look up at him. I squint, trying to focus, “Do you know what happened?”</p><p>“Yes,” I rasp. Everything feels like it’s happening in slow motion. Every time I hear Edward’s voice from the other room, I crawl out of my skin.</p><p>The cop watches me squirm on the couch, pulling the blanket tighter to my throat. “Which one of them gave you that bruise on your cheek?”</p><p>I’m falling apart inside. I can’t hold myself together much longer. My voice shakes as I speak. “Edward. He hit me. He wouldn’t leave. He tried to...,” I choke on the words, but can’t manage to force them out. I stare unblinking at the kitchen wall. “Cole came and saved me.” I look at the cop. Tears start to flow again and leak out of the corners of my eye. My voice is barely a whisper as I start to shiver uncontrollably. “I need Cole.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cole has been standing across the room. One cop is watching both of us. They don’t want us talking to each other. Cole moves toward me, but the officer shakes his head. “I’m sorry. One more minute. The medics will be here and you can tell us what happened.”</p><p>I nod and sadness sticks to my insides like syrup. I feel like I can’t breathe. Cole steps toward me. He’s shaking, probably with rage, but he says nothing to me. Cole’s face is pinched. His arms are folded across his chest. Blood streaks his shirt with tiny beads splattered on his cheek. He looks older somehow. It’s his eyes. They reflect his fear and it’s all I can do to sit still without shivering. Guilt slams into me. I did this. I made this happen. Edward did this because I led him on. I had to do something, didn’t I? My eyes sting. I blink and look at my hands as I twist them together.</p><p>The paramedics arrive and swamp me and Edward. They poke me, ask me things that I know—like my name, when I was born, and that kind of thing. Then they ask what happened. I glance across the room, but Cole has been separated from me. He stands with the officers who arrived earlier with his back turned toward me. Cole’s speaking, but his eyes keep cutting across the room to me when he looks over his shoulder. Edward’s blood is on Cole’s shirt. They probably think Cole stabbed Edward.</p><p>“It was me,” I croak, trying to speak loudly, but I find that I can’t. The officers look at me and nod. Their eyes say they’ve seen this before. One smiles sadly at me and says that everything will be taken care of, to let the medics do their work.</p> <p>Cole speaks to me, his voice filled with something that breaks my heart. “It’s all right, Anna. Let them look at you.”</p><p>The paramedic next to me wants me to open my mouth. They check my throat and offer a rape kit, but I wasn’t raped. Edward didn’t get that far. I want them gone, but no one leaves. They ask me what happened. I tell them.</p><p>My story stays the same, but the guilt is killing me. “I must have done something,” I say to one of the medics. “But I don’t know what.”</p><p>The guy is well over six foot and looks like he could carry a walrus up a flight of stairs. Anger flashes in his eyes. His voice is firm, but gentle. “There is nothing, and I mean nothing, that you could have done to make this happen.” I nod, but I don’t know what I think. Cole is hurt. Edward is hurt. I’m hurt. I stabbed Emma’s brother. I’m going to lose my best friend.</p><p>My head feels hot and then cold. I shiver and the world goes fuzzy. Heat travels up my body in a wave and the world goes black.</p> <p>CHAPTER 6</p><p>The first thing I notice is the hard bed under my back. My fingers bunch the waffle-weave blanket in my hands. I recognize the texture. Between that and the scent of disinfectants, I know where I am. I peel my eyes open and look around the hospital room. I hate hospitals. I blink slowly and the world comes into focus.</p><p>Cole is sitting next to my bed, his arm dangling over the rail, stroking my cheek. “Hey,” he says, and offers a weak smile. His hand feels so warm. I shiver and want to pull him into the bed with me. I want his arms around me. I want to feel safe, but I’m too weak to move.</p><p>“Hey,” I say back, confused. I don’t know what happened. I don’t remember getting here.</p><p>Cole sees the questions in my eyes and says, “You went through a lot. They wanted to check to make sure nothing was broken, and then you passed out. Nothing’s broken, but you do have a sprained ankle.” He watches me, his eyes holding mine. I see the remorse in his eyes. He wants to say, I’m sorry I wasn’t there. I’m sorry I couldn’t protect you.</p><p>But he did. We both feel guilt that we shouldn’t feel. I wish I could take that away from him. He saved me. I press Cole’s palm to my cheek and lean into his hand. “If you didn’t come...” I take a deep breath, “How’d you know?”</p> <p>“You were late and didn’t answer your phone. Emma texted and said you were grabbing suit, and that she had to leave you. Then, when you didn’t show, I thought something was wrong. I raced over there and found him—” Cole’s jaw tenses, and he stops speaking. He works his jaw for a moment and finally says, “When I saw you, you weren’t moving. You were hanging there, limp. There was blood everywhere. My God, Anna, I thought he killed you.” Cole’s voice tightens as he speaks. It’s barely audible by the time he’s done. He rubs his hand across my cheek and takes a breath to steady himself. His gaze locks with mine. “I love you, Anna. I thought I lost you.”</p><p>“You didn’t,” I say, my voice still raspy. “I’m right here. I’m not going anywhere, dude.” I grin at him, but my face hurts.</p><p>“Stop cracking jokes, Lamore. You’ve got a couple of stitches in your cheek. You’re not supposed to aggravate it.”</p><p>I nod. “So, I have to ask how you kept my parents away.”</p><p>“There’s no force on earth that could do that. They were here fretting and pacing each other into a hysterical mess. I sent them to the cafeteria to get coffee. They’ll be back in a minute.”</p><p>I lean back into the flat plastic pillow and smile at him. It’s a doped-up dreamy kind of smile. “I love you, Cole.”</p><p>He opens his mouth to say something, but there’s a knock at the door. The doctor comes in. He speaks to me and explains a few things and is gone again.</p><p>Before he leaves the room, I ask, “Can I go home?” I don’t want to stay here a second longer than I need to.</p> <p>The doctor looks back at me and nods. “As long as you have some help, yes. Stay off your feet for a few days until the ankle mends. No strenuous activities.” His eyes cut to Cole when he says it, which makes me blush like my face caught fire. The doctor smiles and says to Cole, “Take care of her.”</p><p>“I will,” Cole replies. His blue eyes drift to me and he says, “I’ll always take care of you.”</p><p>Things feel different after the attack. I stay at Cole’s. He pushes back the court date a week, until I recover. I look like hell. My face has been beaten and is all shades of awesome. My entire body is sore, aching in places I didn’t even know I had. Cole keeps giving me ice packs and heating pads. I can’t believe he talked my parents into staying at his place, but he did.</p><p>I’m laying on his couch, with a pillow under my head, when Emma comes over. She hands Cole a huge bouquet of mums for me. They’re so big that I can’t see her when she walks through the door. When Cole takes the flowers from her, Em sees me for the first time and gasps. Her fingers press to her lips as she mashes them into a thin line.</p><p>“You’re not supposed to tell people they look like hell, Em.” I want to smile, but I can’t. I pull up the blanket and twirl the fringes under my fingers. I’m worried she’ll hate me. Cole assured me that she wouldn’t, but I’m still worried. I can’t undo any of this. I wish it never happened. Before I can say another word, Emma grabs my hands and starts talking.</p><p>“I’m so sorry, Anna. I didn’t know. I swear to God that I didn’t—” Emma can’t stop apologizing. Grief lines her face. Cole perches behind her on a stool. He flips through a magazine like he isn’t listening, but I know that he is.</p><p>I cut her off, “There was no way for you to know. I didn’t know. Nobody did.”</p><p>“I should have known. He’s my goddamn twin,” she rubs her eyes with the heel of her hand. Emma’s beautiful face is pinched, lining her forehead with wrinkles. “I should have known.”</p><p>I know how she feels. I feel the same way. I don’t know why I didn’t see it before, why I kept dismissing the warning signs. They were there, clear as glass, and I ignored them. We both ignored them.</p><p>Cole turns the page of his magazine, and doesn’t look up. “His mistakes are his alone. You didn’t do this to her, Emma. Edward did.” Emma turns to him, her mouth hanging open.</p><p>“But—”</p><p>Cole shakes his head, “But nothing. You had nothing to do with this. From the moment I met you, you’ve been nothing but a great friend to Anna.”</p><p>“I told her you were creepy.”</p><p>“Good,” he says. “You were looking out for her. You sure as hell wouldn’t have done this to her. Blame the person who actually did it. He’s not the guy you thought he was. Blood is strange like that. You’d think the apple doesn’t fall far from the tree, but some apples do. They roll so far away that they they’re nothing like the rest of their family.” Cole’s tone is firm. He’s speaking about himself as much as Edward. I feel the pain in his voice. I want to throw my arms around him. I hate hearing him speak about his father, but Emma needs to hear this, so he says it. “Blood or not—twin or not—he’s not you.”</p><p>Emma’s eyes fill with tears. It’s what she needs to hear. She looks back at me and says, “You’re my best friend. You always have been...”</p><p>“I always will be.”</p><p>Emma and I share a snot-filled cry. Cole left the room at some point after we use an entire box of tissues. Emma dabs her dark eyes. “I’m not sure if my timing is crap or not, so I’m just going to tell you.” She takes a breath and pushes her dark hair over her shoulder. “I met someone.”</p><p>My brows inch up my face. “Really? Who?” Emma is never serious about anyone, but I can tell in the way her posture shifts, in the way her shoulders shrink in, that this is important to her and she’s afraid of what I’ll think. “Tell me, Em. Who is he?”</p><p>“You already know him.” She presses her lips together for a moment. After taking a deep breath, she says his name. “Jessie. After you two broke up, I saw him. We talked about you for a while, and then... I don’t know what happened. He irritates the hell out of me, but I like him. A lot. I didn’t want to date him until I told you about it, but then this happened and I didn’t see you for a while.” She glances up at me. “Are you mad?”</p><p>I forget myself and smile. “No, that’s wonderful! I felt so bad for him. He’s so nice, but Cole... I wanted Cole. I’m happy for you, Em. I really am.”</p><p>She talks to me for a while longer and tells me about Jessie, about why she likes him. She’s so excited that it’s hard not to feel excited, too. Then she starts talking about her internship and the paper. “Then we ran this story on Sottero. Did you see it?” I shake my head. Emma looks around for Cole, and leans in, whispering, “I thought not. Apparently, it’s gotten around her social circles that she’s a two-faced bitch thanks to a loud-mouthed intern that quit a little while back.” She winks at me and smiles, like it’s wonderful. “Her clients don’t want to have anything to do with her. She’s been an icon for years. The article was about how the mighty fall from grace. A few other names were in there too. It was a business piece on the importance of being genuine and remembering where your next paycheck is coming from. It seems that the arrogant fall faster and harder than anyone. I guess the article kind of double-damned her.” She smiles at me. “I thought you’d like that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At first, I think I do. I mean, she deserves whatever bad things come her way. The woman is vile, but...</p><p>Em’s jaw drops, but she snaps it shut, “Oh my God. You’re too good. How could you not be happy that she got hers?”</p><p>I shrug. “I don’t know. Maybe my brain is broken, but I can’t take joy in someone else’s misery, even if it is Sottero’s.”</p><p>Cole’s voice cuts through the room, “And that’s why I love you.” He walks up behind me and kisses the top of my head.</p> <p>“Yeah,” Emma protests, “but Sottero had it coming. You can’t be a heinous bitch for two decades and not have it come back to bite you on the ass. Besides, she dropped the lawsuit, right?”</p><p>Cole shakes his head, “No, she didn’t.”</p><p>Emma’s jaw drops as her eyes widen. “What? Is she insane?”</p><p>“She’s playing the victim, Em.” I say. “If she gets the press to portray her in that light, then it makes sense why she’s been so bitter and fucked-up over the years. All will be forgiven. Kiss, kiss and all that.”</p><p>“No,” Em replies, looking shocked. “You think that’s her goal?”</p> <p>“I have no clue what her goal is,” Cole mutters. “She’s Sophia. This is typical Sophia.”</p><p>I shake my head, “It doesn’t seem like she wants money. She has plenty of that...”</p><p>Cole says, “Revenge. That’s what she wants. She wants to rip out my guts, the way I ripped out hers.”</p><p>“What are you talking about?” I ask.</p><p>“She thought I was loaded. She felt duped, Anna. Sophia was slightly off-balance before, but now, with the papers running stories about her—she’s like a rabid dog jumping at my throat.”</p><p>“Sorry,” Em says and shrinks back into the couch next to me, obviously feeling somewhat responsible for the increase in Sophia’s crazy levels.</p> <p>Cole says, “It’s not your fault. It’s your job. Besides, Sophia made her decisions and I made mine.” Cole shifts his weight. He looks at me for half a beat and then his eyes shift back to Em. “How would you like to run a story for me?”</p><p>Em’s dark eyebrow lifts. He’s caught her attention. “What’d you have in mind?”</p><p>CHAPTER 7</p><p>My parents insist on checking in with me so frequently that my eye twitches. My cell rings and I pick it up. “I’m still fine, Ma. Cole’s taking good care of me.”</p><p>“Thank God!” She blares into the phone. I pull it back from ear a little, so I don’t go deaf. Ma is one of those people who talks louder on a cell phone. She acts like it’s a tin can on a string and practically screams into the thing. “I’m having palpitations out here worrying about you. I can’t stand you living so far away. Come home, Anna. Your old room is—”</p><p>I groan, “Ma, I’m fine. Really. And what happened could have happened anywhere. It’s not like the whole stalker thing was random. He went to your house for Chrissakes. He seemed sane to you, too.” I shouldn’t have said it. Reminding her of her conversation with Edward is like a kick to the gut. Apparently his obsession with me was worse than anyone thought. When the police starting questioning my family, my Ma recognized him.</p><p>Ma’s voice shrinks back to a muffle. “I didn’t know, honey. I swear to God, I had no idea that he—”</p><p>I cut her off, “That’s the point. Nobody knew and it could have happened anywhere. I’m safe here, Ma. I’ll be at Cole’s for a few more days and then I’ll move back in with Emma.”</p> <p>I don’t pull the phone back in time for the wave of tyrannical threats that spew from the tiny speaker. I open my mouth to respond, but Cole snatches the phone from my hand.</p><p>He speaks over Ma, “Anna’s not going anywhere, Mrs. Lamore.” He says it so calmly, so certainly. I cock my head at him and feel extra stubborn. I don’t doubt for a second that he thinks I’m staying here indefinitely, but I feel like I need to get on with my life. It feels like I’m hiding here.</p><p>I can still hear Ma yelling back, “She better not!”</p><p>“I assure you, she is staying here with me, and if she insists on leaving, I will deposit her on your doorstep. She’s not going anywhere alone until Edward is behind bars. You have my word on that.” Edward’s out on bail, which is why things are kind of hard right now. No one wants to leave me alone so that he can take another go at me.</p><p>Ma’s voice lowers and I can’t make out what she’s saying. Cole avoids my angry gaze until he hangs up.</p><p>Cole sighs and hands me back my phone. “When were you going to tell me this marvelous plan?”</p><p>I squirm on the couch and pull my knees into my chest. “Never.” I knew he wouldn’t like it.</p><p>“I thought so.” He sits down next to me. “You can do anything you want, but it’s so far from smart that I can’t let you go back there. He’s out on bail. Edward could come after you again.”</p><p>“He won’t” I say, staring straight ahead.</p><p>“You don’t know that.”</p><p>“Cole,” I take a breath, and look at him. “I don’t want to hide for the rest of my life. I want to get on with things and that means going back to normal.”</p><p>“What if normal where here, with me?” His eyes are like twin gems, deep and clear. His voice is so sincere, so loving. Cole hasn’t mentioned the proposal since that night. Too many things happened.</p><p>My lips tug into a small smile. I lean my head against his shoulder. “Tell me what that would look like. Things are changing right now. I don’t even know what tomorrow will be like and neither do you. It makes it hard to dream right now.”</p><p>His arms wrap around me. “All I do is dream, right now. I dream about having you in my bed every night and seeing your beautiful face every morning. I dream about that lawsuit vanishing and having that part of my life over. I dream of being someone else’s son, with someone else’s name...” he strokes my hair as I listen to him. He breathes, “All I do is dream. I’m living in a fantasy world as long as you’re next to me. I can’t stand the thought of you leaving.”</p><p>Silence fills the room. It’s not the awkward kind, it’s the peaceful kind. Cole wraps his arms around me tighter and holds me like that for a second. When he moves to release me and get up, I stop him. My fingers brush his forearms and press him against me. “Hope is important, Cole. Don’t feel bad about that. As for your name, have you thought about what you want to change it to?”</p><p>He looks down at me and smiles. “Dude. You inspired me and I had to pick that one. People can call me Mr. Dude, the artist.”</p><p>I laugh way too loud and smack his arm. “You can’t change your last name to Dude! Besides, if I said yes, that’d make me Mrs. Dude and I am so not doing that.”</p><p>Cole grins. He sits and pulls me onto his lap. I turn to face him. His face is a breath from mine. “Oh? So you’ve thought about that a little bit, have you?”</p><p>I nod. “A little bit.” My heart is pounding.</p><p>“And that’s the only conclusion you’ve made?”</p><p>“It’s a pretty good conclusion, right? There’s no way in hell people are going to call me Anna Dude.” I laugh and he smiles. It makes the corners of his eyes crinkle the way I Iove.</p><p>“So, then what would you have me do?”</p><p>“Pick a name that suits you, one that makes sense, and that you’d be happy to have.”</p><p>“I’m not sure there is a name like that, Anna.”</p><p>I want to smile, but I try to hide it. Taking his face in my hands, I say, “Lamore.” I swallow hard, letting the idea sink in. I take a breath. The feeling that I’m falling won’t hush. My stomach is in my throat. “I don’t know what tomorrow will bring, but I know I want you in my life. I like my last name and what it stands for. Lamore’s think love is worth fighting for, that love is worth more than life, that—”</p><p>He cuts me off with a kiss. Cole’s lips press hard against mine and he pulls away grinning. “I would love to take your name. Wedding or not.” He’s not certain that I’ve accepted his proposal.</p><p>“Oh, there’ll be a wedding. I thought I had to know everything before I got married. I thought that my life was going to be laid out for me, that I’d go to college, graduate, get a job, get married, have kids—in that order—but it didn’t happen like that. I don’t have much, but what’s mine is yours...” he’s still quiet, watching me. I want to choke or run or jump out the window. I blabber on, adding, “If you still want me.”</p><p>Cole’s eyes remain locked on mine. Without a word he stands up, with me on his lap. I scream as he chucks me in the air and catches me. He makes a very loud, happy, sound that almost sounds like a whoop, and whirls around with me in his arms, spinning in circles. We both laugh and scream. I cling to his chest and close my eyes, but it doesn’t stop the joy from bursting like fireworks inside of me. By the time he falls onto the couch, my face hurts from smiling so hard.</p><p>I giggle, “Mr. Lamore, you’re going to be a handful.”</p><p>“Likewise, Mrs. Lamore.”</p><p>CHAPTER 8</p><p>“Are you sure that you want me to run this, Cole? It kind of sets things in stone.”</p><p>He nods, his dark hair falling forward as he moves. “It’s a warning shot. She needs to see it coming.”</p><p>“Who?” I ask. “Sottero?”</p><p>He nods. “She thinks that I won’t fight back because I never have, because I’ll lose my name. She knows my past and what that fucking name cost me.” He glances up at Emma. “Sorry—”</p><p>“Don’t apologize to me. I swear like a sailor. Anna made me tone it down so I don’t offend her virgin ears.” Emma flips her dark curtain of silky hair over her shoulder. Somehow she always manages to have this sleek look that could make a Pantene model jealous.</p><p>My face flames red, “My ears are not virgins.” I hiss, and then realize it sounds weird and grin rather stupidly.</p><p>Cole’s eyebrow lifts, “We’ll need to discuss that later, Miss Lamore.” I smack his arm.</p><p>We’re sitting in Emma’s apartment. It’s the first time that I’ve been back home since the day Edward attacked me. Em cleaned the place up. There’s no blood, but the smells and the way the light cuts through the blinds is identical. I’m glad Cole didn’t want me to stay here. I think I wanted to do it to prove a point—that Edward didn’t break my brain, that I’m not afraid. The thing is, I am, but the fear has changed. I know who he is and what he was doing now. Instead of feeling the choking panic, I feel jittery and stressed. It’s like a nightmare that surfaces during daylight, even though it was scary when it happened, in the light of day the cold tentacles of fear are still laced around my throat. I shiver and Cole pulls me closer to him. We are sitting at the breakfast bar and Em is across from us on the couch.</p><p>Emma ignores our banter. “Well, if you’re sure. Once the article is submitted, I can’t take it back. That’s all I’m saying.” She waits, watching Cole. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Do it.”</p><p>The article is short. It mentions that famed photographer Cole Stevens is changing his last name. While it might seem like a public interest story to everyone else, to Sophia it’s a bomb. It’s telling her to drop her lawsuit, that Cole is going to fight back, and that she will lose. It’s a very gentle, tactful way to warn her to back down. He surprises me with that, especially since Sophia is so vicious.</p><p>The article runs the day before the rescheduled hearing. I lift the paper and am surprised at the prominent location. The article is small, but Sottero v. Stevens has been in the papers on and off for a while now. I suppose that’s good, that there’s no way she’ll miss it.</p><p>Cole sees me sitting on the couch with the paper. He has a cup of coffee in his hand. He lifts it to his lips and sips it slowly before asking, “Well? Do you think that was worth doing?”</p> <p>“I don’t know. Sophia seems kind of crazy. No one else will know what this means, but she will.” I twiddle the edge of the paper between my fingers and look over it at him. “What do you want her to do, exactly?”</p><p>Cole takes a deep breath and sits at the table. The open floorplan makes it feel like he’s not that far away. The living room bumps up against the dining room, and the couch where I’m sitting is positioned in between. “I want her to drop the lawsuit, but I don’t think that’ll happen.” He looks at the black liquid in his mug. “Ya know, I can’t help but notice that you didn’t accept my proposal until after it was confirmed that I’d lose everything.” He looks up at me. “I wasn’t going to fight back, they seized my assets, and I lost many of my clients, and then you decided to stick around.” He sounds like he can’t believe it. He looks at me from under his brow, the steaming cup in his hand.</p><p>His tone worries me. It makes my stomach clench and twist. “Money doesn’t matter to me, Cole. You have to know that by now. All my life, it’s been this poison hanging over my head. I take what I need and nothing more.” I shrug away the defensive feeling that’s coming over me. “I just don’t want it.”</p><p>“You’re afraid of it.”</p><p>“Maybe,” I say honestly. “There’s a duality with money, like you can chose to have money or love, but you can’t have both. They negate each other, or at least it seems that way to me. So yeah, maybe your money terrifies me a little bit.” I look up at him. The expression in his dark eyes is difficult to read. I can’t tell if I offended or amazed him. Funny how those look so similar sometimes.</p> <p>Cole’s eyes lower. He looks at his mug as he speaks. “That’s part of the reason why I didn’t fight back with Sottero. I really didn’t want to. I thought I was being like my father, crushing a woman I already shattered. I never told Sophia that I was disinherited before I proposed to her. I couldn’t, and she had no idea. It hit her like a train. The ring wasn’t even taken out of the box. She slapped it from my hand, put it under her car, and ran it over. The look she gave me, Anna—damn—for the longest time I thought I deserved whatever she threw my way. My fortune, all of it was made because she inspired me in the first place.”</p><p>A string of images form in my mind. A young Cole returning from the army, wearing that uniform. The Tiffany’s box that was battered and locked in his safe. I blink these things away. They’re his ghosts and I wish they didn’t haunt him, but they do. I’m quiet for a moment and then something he’d said to me clicks into place. He owes her. He said it. He thinks that he’s indebted to her in a way he can’t repay. My mouth hangs open for a second and I think I understand. “She gave you your camera?”</p><p>He nods. “After I came back from the military, I was listless. I had nothing to do and nowhere to live. Sophia thought that I was on an international vacation for four years. I didn’t correct her. I couldn’t. She thought that I had no job because of my status, that I was a playboy like the papers made me out to be.” His eyes flick up to me. “Maybe I shouldn’t be talking about this, but I wanted you to know how I felt about it. I deserved what I got from Sophia, as far as I was concerned. I did fuck her over, in a manner of speaking. And the gag on speaking about the agreement to use my name and my disownment made it so I couldn’t respond. I deserve this Anna.” The way he says it makes my heart ache. I slip off the couch and hobble over to him. Cole’s eyes seek mine, looking for answers that he can’t find.</p><p>I sit in the chair next to him and take his hands in mine. “Listen, I don’t pretend to know what’s right and what’s wrong here. I hear the guilt in your voice when you talk about her, but Cole, I just don’t see it. Even if you led her on to think you were still the heir—which I don’t think you did—it’s been twenty years. She should have let it go by now. Even if she was burned, it’s unthinkable to stay mad this long.”</p><p>“I thought she loved me, Anna,” he says, but I can hear it. He means, Will you leave me, too? Have I deceived you so gravely that you’ll crush me as well?</p><p>The thread of insecurity is just that, a tiny string that tugs at Cole’s past and connects to his present. I want to snap it. I want to cut that thread and let things fall where they may. “There’s nowhere I’d rather be right now, than here with you. I’m not going anywhere. And if there’s ever a time that we have too much money, that it’s getting between us, we’ll fix it.”</p> <p>“How?”</p><p>“We’ll give it away. Cole, this is about us, now. I’m not Sophia. I want you for you—all of your kinky, sophisticated, sexy self—I want you. Nothing will ever change my mind. You think I’d share my name with just anyone?” I grin at him.</p><p>“You’re too good for me.”</p><p>I laugh. “I’d say the same thing about you. Apparently we both make each other better. Isn’t that what love is all about? It seems we stumbled on the fairytale without even trying.”</p><p>Cole smiles at me and something changes. I hear it in his voice when he speaks, “So, how far do you want to push this lawsuit? You want to just get her to back off or what?”</p><p>“Sophia’s reputation is hanging by a thread. I think that’ll do the most damage, if you want to do damage.” I think about Sophia and how horrible she is, how incredible arrogant and bitchy she acts. Her clients are leaving her. They can’t get away fast enough. One spark will ruin what she has left.</p><p>“Let’s see where we stand tomorrow and decide from there.” Cole puts his coffee down and pulls me onto his lap. He kisses the side of my face, and then holds me tight. I love every second of it.</p><p>CHAPTER 9</p> <p>“Miss Lamore, you mean to tell me that you have never seen any photographs or negatives of my client, Ms. Sottero, wearing this ring?” The lawyer is as nasty as Sophia. She’s a middle-aged lady with her dark blonde hair tied in a tight chignon at the base of her neck. Her gray suit fits her bean-pole body like a glove.</p><p>I shake my head and repeat myself, “No. I told you already.” Cole’s lawyer told me not to lie on the stand and I’m not. I didn’t see Sophia in any recognizable state, on a photograph or negative wearing that ring. I saw a naked chick on canvas wearing that ring.</p><p>The lawyer is exasperated. She comes at me again, her perfect face cracking with lines of fury. She presses her palms together. I look at the judge for a second, but he seems bored. The old guy is looking at something in front of him. I wonder what it is before I look back at Blondie. “Miss Lamore. May I remind you that you are under oath?”</p><p>“You already have.”</p><p>“Then, I must ask you to tell the truth. For the last time, did you or did you not see this ring in a photograph or negative of Sophia Sottero while you were in Cole Steven’s apartment?” Blondie presses her pointer fingers to her lips and stares at me. If her eyes had lasers, I’d be dead.</p><p>“No,” I say fervently, “I did not.” I look to my lawyer who squashes Blondie’s next needling of me since my answer is still no.</p><p>“Very well, Miss Lamore. Do you care to tell me how or why you recognized the ring my client was wearing the day you quit your internship at Sottero?”</p><p>“Why does this matter?” I blurt out.</p><p>Blondie opens her mouth to speak, but Cole’s lawyer is on her feet. They quibble back and forth and eventually Cole’s lawyer wins. I glance at Sophia. She looks mortified. I assume that Cole doesn’t let his lawyer off the leash, ever.</p><p>“Enough,” the judge utters. “If you have no further questions of this witness, that pertain to this case, she may be excused.”</p><p>Blondie bites her lip and returns to her seat. The judge hurries me off. I leave the stand and exit the courtroom. Reporters aren’t allowed near the courtroom, but they are close enough to snap pictures of me as I walk out. Ignoring them, I turn and walk the other way.</p><p>My heart is thumping. I’m lucky she didn’t ask the questions differently. Sottero must have thought I saw something else. Maybe she doesn’t know her photographs are paintings? I think about things as I stroll through the halls. I don’t know how much time has passed, but I’m aware that I lapped the building as I approach the ladies room. I don’t know how much longer Cole will be in there today. I walk into the ladies room to check my make-up. My eyes itch like crazy. The building has that old musty scent that makes my eyes water. I stand in front of the mirror trying to rub my eyes without messing up my eyeliner and mascara. I give up and rub like crazy, smearing one eye. After it stops tearing, I take a few things from my purse, intending on fixing it when I hear Sophia’s voice behind me.</p><p>“I can’t believe you perjured yourself for him.” Her voice is flat, but I know she’s livid. Sophia isn’t supposed to talk to me, but she doesn’t seem to care. “I know you saw that ring in those portraits.”</p><p>I turn to her, half my face rubbed clean of make-up. “Why do you even care? It’s not like...” those pictures matter anymore. I pause. It is like that. She wants those pictures. “Is that what this is about? Is that why you’re trying to seize all of his property, for those pictures?”</p><p>Her dark eyes meet mine and don’t stray. “I’ll hang you for this. Every single person of importance in Manhattan will believe whatever I tell them about you. It was bad enough when your hysterical boyfriend came to me about your relationship with Cole and I called the dean. I thought he was using you. I didn’t realize you were so devious, Anna dear.”</p><p>Rage shots through me. She did that? Sophia called the dean and cost me my internship. I want to slap Edward. He completely fucked up my life. Was there someone he didn’t talk to? Furious, I hiss, “Devious? What is it that I was trying to do? Bed a man you broke?”</p><p>She laughs, “As if anyone could break that man’s heart. He doesn’t have one, Anna. Why do you think I’m standing here?”</p><p>“Because you’re a money grubbing bitch.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She snarls, “He took everything from me. He’ll do the same to you.”</p><p>“If you think that I’m listening to you again, you’re mistaken. I only do stupid once per person. Sorry, you used your turn already.”</p><p>Sophia’s eyes burn a hole in my face. “What will it take? A cut? You want his money? Fine. Consider it done. I’ve spent the past twenty years trying to erase that man and he won’t surrender the only thing I want.”</p><p>I stare at her. “Cole’s changing his name. There’s nothing stopping him from crushing you. He’s not going to let you win. Not this time.” I toss my make-up back into my purse, and turn for the door. Sophia grabs my elbow. I jerk to a stop. When I turn back to look at her, she’s in my face.</p> <p>“Those pictures will destroy me. I built my name around being opposed to trash like that. I can’t be seen modeling in one of Cole’s risqué pieces. Find it, give it to me, and this is over.”</p><p>I yank my arm back. “Being a two-faced bitch is your own damn fault. If people find out, good for them.”</p><p>CHAPTER 10</p><p>I’m sitting with Cole. We are at his favorite restaurant for dinner. It’s quiet tonight. There are a scattering of people at the tables around us. They lean in close and speak softly. The candlelight flickers between us, highlighting his beautiful face. I’m wearing a little black dress with my glittering Chucks. It earned us strange looks when we walked in, but my foot is still swollen. When I hobbled, holding onto Cole’s arm, to our table, the waiter made that ah-ha face. No one appreciates juxtaposition in attire, except hobos and artists. Cole smiles at me.</p><p>After we’re seated, I look at my hands and then back up at his face. “I know we said we wouldn’t talk about court tonight, but I need to tell you something.” I haven’t seen Cole since this afternoon. I didn’t get to tell him what transpired between me and Sophia. “It’s the paintings. She wants them.”</p> <p>He has a wine glass in his hand. He stops, mid-sip, and his mouth falls open. He chokes out the words, “What? Why would she...?” he falls quiet and then nods, placing his glass back on the table. He shakes his head. “I can’t believe this. All this time, she wanted those pictures. Is that what she’s been after?”</p><p>“Cole, I don’t understand why she even wants them. It’s not like anyone would know it was her. They were taken twenty years ago. Not to be mean, but she doesn’t look the same anymore and with her anti-smut campaign, no one would think it was her anyway.”</p><p>Cole smiles softly, shaking his head. His dark hair moves like it’s caught in a breeze. I want to run my fingers through his hair and tug. However, I manage to remain in my seat and keep my hands to myself. He explains, “The original images showed her face. When I processed them and put them onto canvas, I altered the pictures to what you saw. They were supposed to be a wedding gift.” He smiles sheepishly. “Yeah, I stopped planning ahead after that. Anyway, Sophia never saw the images, but she knows what we shot. What you saw, well, those weren’t the original crop lines. Sophia doesn’t know what I have or what I don’t—she’s guessing—and after you mentioned that ring, she thinks you saw the portraits and assumed the worst.”</p><p>An idea bumps around in my mind like a ping pong ball. It jumps back and forth, forming a cohesive plan. It pulls a smile across my lips. I lean forward and rub my palms together like an evil villain. “You want to freak her out and shut her up at the same time?”</p><p>“You’re eyes are glittering in a savage, blood-thirsty way, Lamore. You’re a little bit scary right now.” Cole smirks as he says it. His foot gently brushes my good ankle and he winks at me. I smile back.</p><p>“What if you did a gallery show with those portraits—the version you showed me—as the center pieces? The unseen, early work of Cole Stevens. It could be the last show you do before you change your name. We could hype the hell out of it. People would swamp to it, including the media. Sottero would wet herself, until she shows up and sees what you did, which is spectacular by the way.” I grin at him and tap my fingertips together. Maybe it’s not diabolical, but it would get rid of her. Plus, it gives the world a glimpse of the Cole that I think is utterly fantastic. “Maybe she’ll buy them all. It’s the only way to make sure no one sees them again.”</p> <p>Cole stares at me. I can’t tell what he thinks. Sometimes I wonder if he was made without a revenge bone. I think I have two. They’re both pretty small and weak, but when put together, they can be kick ass. Besides, Sophia needs to get over herself. She needs to see that she’s a hypocritical idiot. I know she’ll love those paintings, as much as I know she never saw them.</p><p>“When?” he finally asks. The waiter comes by with our order. The food smells heavenly.</p><p>After the waiter leaves, I say, “This weekend. It gives us a few days to pull things together. I can alert Em and she can tell the rest of the news people. I’m not sure about the gallery...”</p><p>“I can handle that,” he says cutting into a huge steak.</p><p>“And I want to design the invitations,” I’m giddy, bouncing up and down in my seat. I know exactly what I’ll do. I’ll use the left side of the purple painting that shows the curves of her waist and chest, but nothing else. They’ll be elegant, black and white, with a touch of purple. The invitation will be written on sheer rice paper, and attached on top of the gallery image with a purple ribbon. Sophia will recognize it, but no one else will.</p><p>“Remind me never to cross you,” Cole mutters, looking up at me.</p><p>“Dude, it’s been twenty years. It’s time for Sophia to learn her lesson already.”</p><p>CHAPTER 11</p> <p>The gallery is chic. That’s the only way to describe it. The walls stretch up into a dark copper ceiling. The foyer walls are done in midnight blue with thick, flocked wallpaper that makes me want to reach out and touch the velvet. The color combination makes the place feel warm and posh. The way the light bounces softly on the ceiling gives the illusion of candlelight, but without the flicker. Once inside, there is a myriad of walls with different pieces of Cole’s work hanging on each one. A single spotlight accents his art.</p><p>The series of works of Sottero line the center of the room. They stand out against gray walls, drawing the eye around the room. The entire show is breathtaking. As Cole leads me through the rooms, we enter the back wing. I stop short. There is a portrait of me—an image that was not in the LeFemme box. It’s a painting of me with angel wings made from paint and seemingly random objects. The exposure is perfect. My skin has a silky glow and is perfectly smooth. A piece of silk covers part of my chest, while crystals cover the rest of my naked self. My hair is blowing and I look completely and totally awesome. If someone thought I’m a goddess, that’s what it would look like. It is standing in a back corner, set apart from the rest. The entire show has a somber feel, like the artist feels lost. Looking at the rest of the pieces has a calming effect, but this one is different than the rest. It screams of hope and happiness. It doesn’t belong.</p><p>“Cole, this shouldn’t be here.” I say, turning to him with my heart racing a mile a minute.</p><p>“I should have asked you. I understand if you don’t want anyone else to see it—”</p><p>I take his arm, stopping him midsentence, and turn him toward me. Cole thinks I’m too prude to let him show it. “That’s not it, Cole. You can leave it up if you want, but it doesn’t blend with the rest of the show. Those works out there are all melancholy and pensive. This one...”</p><p>I don’t know how to compare it. There is no comparison. The front of the show is all tortured artist, and this is happy dude. The only speck of black on the canvas is a crow that’s in the tippie top of one of my wings. There are other things too, objects that mean something to me or us; a yellow sneaker, a tutu, a red ribbon. I can’t help but smile when I look at it, and I want his last show to be amazing. This is so different that I don’t know people will say.</p><p>Cole pulls me to him, wrapping his arms around my waist. “It’s perfect. It’s everything I was missing, everything that’s important to me, now.” He kisses my cheek lightly, searing my skin. My knees feel like jelly for a second and I lock them so I don’t fall over. I smile at him shyly.</p><p>He says, “I have something for you.” Cole releases me and pulls a black box out of his pocket. My eyes grow wide and I glance between his face and the ring box—that is totally a ring box. “You’re the only woman who would accept a proposal without a ring.” He grins and cracks open the lid.</p><p>Inside is the most beautiful ring that I’ve ever seen. It’s not a traditional engagement ring. There’s no single diamond set on prongs. Instead it’s a glittering blue stone the color of Cole’s eyes, set in white gold. It’s so simple and sophisticated at the same time. My hands cover my mouth as I gasp. I don’t know why I’m shocked, but I am.</p><p>I’m shaking too much to move. Cole reaches for my left hand. He pulls the ring from the box and slips it on my finger. It fits perfectly. I smile, stunned into silence before throwing my arms around his neck and kissing his face over and over again.</p><p>“It’s beautiful.” I breathe after we part.</p><p>“It’s a diamond. I saw the color and that setting, and knew it was perfect for you, my beautiful bride.” Cole leans close to my ear and presses his lips to my neck.</p><p>Someone says, “Ah-hem,” and Cole pulls away from me with a wicked smile on his face. “This is the infamous Anna, I assume?”</p><p>Cole nods. “Frederick, may I introduce my bride-to-be, Anna Lamore.” Fredrick extends a dainty hand toward me. He’s five foot nothing with wavy black hair and tanned skin. His dark eyes glitter like he’s stealing a cookie. I smile at him as we shake. “Anna, this is Frederick Supoe, the gallery owner.”</p><p>“It’s nice to meet you,” I say. “Thank you for arranging this show so quickly for Cole.”</p><p>“Cole and I go way back. There’s nothing that pleases me more. He never shows certain works and I can tell from looking around that this is indeed the lost works of a lost man.” Frederick folds his arms over his narrow chest and moves towards the painting of me. He taps his front tooth and then points to the bright painting, “Except this one. This one is the most brilliant.” Frederick stares at it like he’s awestruck.</p><p>I don’t understand. I step next to Frederick. We’re nearly the same height. I glance at him. “Why?”</p><p>He doesn’t look at me. Instead he continues to gaze at the canvas. “Any man can be lost. Any man can capture that emotion in film or paint, but it takes a much more to pull up from the ashes and start again. That’s what this says to me. It says we have a new Cole. The piece is symbolic of his new name, of his new life. The front rooms are filled with the secrets of his past, but this—this is his future.” Frederick turns and looks at me. “You’re an impressive woman, Miss Lamore. I hope you’ll consider putting on a show here.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’m flabbergasted. I open my mouth, but nothing comes out. Supoe’s Gallery is the finest in the city.</p><p>When I make a squawking sound, Cole answers for me, “She would love to.”</p><p>“I’ll be expecting it.” He winks at me before walking to the front of the gallery. It’s nearly time to open.</p><p>I want to jump up and down. Glee spreads across my face. Cole takes me in his arms and swings me around. Cole and I laugh as we whirl in a circle. I’ve never seen him so happy.</p> <p>CHAPTER 12</p><p>Emma arrives about half way through the show. The gallery is packed with people. She moves through, asking them questions and smiling. Periodically, the guy from the paper with the camera snaps a picture and they move on to the next person. I remain in the front, away from my canvas. I want the limelight on Cole. Besides, Sottero has yet to show her face. I would have thought that she’d arrive before anyone and snatch the pieces of her up.</p><p>I sit on a black bench in the center of the room. People move around me. I can hear them whispering about Cole’s work, about how he’s one of the most talented artists in New York. I’m happy for him. I can’t stop smiling.</p><p>I don’t notice her until she’s standing next to me. “Anna, dear.” Her voice is curt. Sophia Sottero stands rigidly at my side. She’s dressed in her normal pristine suit. There isn’t a wrinkle on the entire thing.</p><p>I don’t stand up. “Sophia.”</p> <p>She doesn’t look at me. Her gaze is on the wall. Sophia’s eyes rake the paintings. Her body twitches with tension. “This was your doing.”</p><p>“Maybe,” I confess, and stare straight ahead as I cross my ankles.</p><p>“Is this because I helped the man who tried to rape you?”</p><p>My eyes cut to the side. I glance up at her face. A million emotions rage through my body. She mentioned that during her rant the other day. “No, but thanks for that. Getting raped is every girl’s dream. You basically pushed me straight into him.”</p><p>Her spine straightens more, if that’s possible. “I didn’t know.”</p><p>“That’s a pretty lame apology.” I don’t expect her to stay here chatting me up. She looks like she wants to slash the paintings and break every piece of glass in the place.</p> <p>Sophia swallows hard, still keeping her chin high. “I’m sorry.” Sophia doesn’t blink. Her voice retains that hard tone she always has, but I can tell she means it. I say nothing because there’s nothing to say, so I nod. She stands next to me for a few moments longer before saying, “You knew these weren’t full nudes.”</p><p>“And you didn’t.” Sophia doesn’t respond. I add, “Nice way to try and get them—accusing a guy of molesting you and then trying to take all of his stuff when you notice he won’t fight back—that he can’t fight back. If you asked, I’m fairly certain that Cole would have given them to you.”</p><p>She takes a breath, but doesn’t look at me. “Things didn’t work like that, then. These pictures would have ruined me...”</p><p>“If they were dirty like you thought, if Cole was the sleaze you made him out to be, but he’s not and these are most definitely art. The only thing I find objectionable is the model. I heard she’s a real bitch.”</p><p>Sophia looks down at me. “Well spoken.”</p><p>I stand and step in front of her. Sophia’s dark eyes meet mine. “What are you going to do now? I heard you lost half your client base and the ones you retained hate your guts, but didn’t want to lose their retainer fees.” My brow lifts as I speak. I tilt my head to the side and fold my arms over my chest. “Incidentally, most of your staff showed up tonight and asked Cole for employment—the interns, too. It seems that you’ve shot your studio in the head.”</p><p>“Perhaps I did.” She doesn’t fight. It irritates me. Sophia has vinegar running through her veins. She’s as nasty as they come. This attitude is like her, but the comments are not. She turns and looks at the blue painting and says, “Where is Cole?”</p><p>Cole must have been watching us, because he steps up behind her and says, “I’m right here, Ms. Sottero.”</p> <p>Sophia turns. She looks at Cole with fear in her eyes. “This is all that remains of that shoot, isn’t it?”</p><p>“It is.”</p><p>“I never believed you were capable of something like this. I thought everything with you would be panties and bare skin.” She looks at him for a second. “Apparently I was wrong and you have a very fearsome way of demonstrating that.”</p><p>“You forced my hand, Sophia. I would have left them unseen. I would have let things go, but you held onto the past so damn hard. It wasn’t good enough to part ways. You had to destroy everything you touched.”</p><p>“And yet, I didn’t destroy you.” She sniffles a sad laugh, “It’s quite the opposite, really. My studio is in shambles and I’m financially drained from pursuing a lawsuit that’s fallen apart. And your little intern here—”</p><p>“My fiancé,” Cole corrects.</p><p>Sophia smiles slowly, “Ah, well, your fiancé tells me that my staff has left me as well.” Cole nods, but doesn’t say anything else. Sophia sucks in a ragged breath and puts on a fake smile. She looks at me and then Cole. “I’m terminating the lawsuit.” Neither of us answer.</p><p>Everything she made crumbled in her hands. Sophia built her own empire and destroyed it, single handedly. Without another word, Sophia turns and cuts through the crowd, heading towards the front door.</p><p>When she leaves, I turn to Cole. Every muscle in his body is taught, like he’s ready to fight. “Are you all right?”</p><p>He pulls me into a hug, “As long as I have you, I am.” He kisses my temple and smiles before disappearing back into the crowd of people.</p><p>I smile at him and sink back down onto the bench again. The rest of the night passes in a blur. Several paintings sell for astronomical amounts of money, including the angelic portrait of me. The critics will write up their reviews tomorrow, but I already know what they are going to say. I heard the words fall from their lips. The show was adequate, but the piece that defined it was the last work of an earthly angel. There are pieces that an artist is known for, a piece that defines him and that piece is Cole’s.</p><p>CHAPTER 13</p><p>Sottero makes good on her claim. The lawsuit ends as quickly as it started. Suddenly, there is nothing pulling at us, demanding our attention. We spend hours at the Long Island studio, sitting on the beach and watching the surf. Cole’s fingers weave together with mine.</p><p>The breeze blows his hair into his eyes and he pushes it back. The sky is gray, like it might rain and the air is nippy, like some artic air came this way early. We’re both wearing sweatshirts and jeans. The ocean roars, pounding waves into the sand. I wiggle my bare toes in the sand and look at his beautiful eyes.</p><p>“Have you given any thought to the wedding?” Cole asks me.</p><p>I grin at him and nod. “Maybe.”</p><p>“When did you become so allusive?” He smiles at me and bumps my shoulder with his.</p><p>“When I figured out that it drives you crazy.” I smirk at him in response and bump him back.</p><p>“Don’t make the mistake of thinking that I won’t pin you on the sand and tickle you until you scream. I will get a date out of you one way or another.”</p><p>I laugh, not believing him, which is stupid. “Yeah, right,” I mutter.</p><p>Cole launches himself on me and within seconds he has me pinned. I squirm, trying to pull my arms or legs, but I can’t move. When Cole goes to tickle me, I say, “Don’t you dare!”</p><p>Cole’s fingers find my sides under the thick sweatshirt and wiggle against my skin. I laugh hysterically and try to get away. I manage to get an arm free and tickle him back, but the bastard isn’t ticklish.</p><p>“Pick a date, Miss Lamore.” The sky opens up and it starts to rain. The drops fall to the ground in big globs. The water is freezing.</p><p>“It’s raining!” I manage to say, but Cole doesn’t stop.</p><p>“So, pick a date.” Cole tickles me more and I squirm in the sand. Rain pelts my face and feels like ice. I’m the worst tickle ninja ever. I can’t get away from Cole and he seems impervious to tickles. So, I curl into a ball to attempt a lame defense.</p><p>Cole rolls me around on the shore like a cat with a ball of yarn. “Next summer?” he asks.</p><p>“No!” I laugh hysterically, tears filling my eyes. My clothes are soaking wet, as are Cole’s. Water pours off his face and splatters on mine. “Winter.” I’m breathing hard, but he hears me.</p><p>Cole’s fingers stop. He climbs on top of me and tangles his fingers in my wet hair. “Winter?” he sounds surprised. It’s fall. Winter is really soon.</p><p>“Yeah. I don’t want to wait.” I feel uncertain. The expression on his face is hard to read. “Is that all right? Did you want daffodils or something?”</p><p>Cole laughs, “I just want you, Anna.” He presses his lips to mine and I melt into his arms. </p> </body></html>"]