["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The light of predawn had mellowed to a cool gray blue as Petra ran with the Land Dwellers through thick patches of mist-coated fauna and over a series of perfect miniature waterfalls cut into the easy hillside. As always, she lagged slightly behind the Shifter party who hunted their section of the rainforest every other day. Unfortunately it was the reality of one who was not a Shifter and whose lungs and muscles normally gave up before the meal was even spotted.</p><p>\"Damn.\" She came to an abrupt halt near a wide collection of mud and let her head fall forward as she gripped her knees. The sound of her heavy, labored breaths competed with the thunderous noise of the Shifters steady though departing heartbeats in her ears. Even after twenty-four years in their society, those glorious Shifter heartbeats still made her jealous.</p><p>Would she ever have one?</p><p>Her parents, the kind and generous lion Shifters who had taken her in as a baby, claimed her as part of their pride and protected her secret from the rest of the breed population that she was not Shifter born, had always told her that someday they would help her find her true beginnings. But she was starting to have some serious doubts. Her parents' number-one priority was to protect her and her brothers, and Petra couldn't help but wonder if their claim to know only the name of her birth father was true.</p> <p>As the thundering mass of heartbeats moved farther and farther away, Petra picked up on one that did not, one that was actually intensifying, coming straight for her. Under the canopy of trees, she forced herself to stand, forced herself to turn, her gaze instantly spotting the mass of brown fur in the distance. The earth beneath her feet started to shake with its approach, and the cracks of branches and twigs intermingled with the menacing shift of flora.</p><p>The bear.</p><p>A growl echoed through the wood, the fierce sound penetrating Petra's chest. Head down, it rushed toward her, muscles rippling beneath its thick fur, massive paws hitting the dirt in an intimidating cadence.</p><p>Petra didn't move.</p><p>Faster and faster it came, mouth gaping, eyes focused. The entire forest seemed to brace itself, preparing for the bear's assault. But the massive brown giant surprised them all-the trees, the ground, and the fauna-by jerking to a halt right in front of Petra, and shifting into a handsome human male.</p> <p>He grinned broadly. \"Damn close to the finish today, Pets. I thought you were going to make it.\"</p><p>Wearing only a strip of fabric around his lean hips, the male who stood before her, his straight brown hair licking his tanned shoulders, was tall and intimidatingly muscular. But as he gazed down at her, only humor and affection lit his gorgeous pale brown eyes.</p><p>Petra returned his smile. \"I honestly don't know why I keep playing this game.\"</p><p>Brodan, a bear Shifter and the community's well-respected healer, took a step toward her and put his hands on her shoulders. \"Someday you'll be there for the capture and kill, Pets. Then you will feast alongside us.\" His eyes locked with hers. \"I can't wait for that day.\"</p><p>\"Neither can I.\" Petra's smile faltered, as it always did when Brodan found a reason to touch her. \"And maybe at that point I'll have developed a taste for raw meat.\"</p><p>He laughed, and as she turned, he dropped an arm over her shoulders. \"How about I walk back with you?\"</p> <p>\"No.\" She hoped the word hadn't come out too quickly. She liked Brodan a lot, respected the hell out of him, but she didn't feel the same way about him that he felt about her. He was her friend, and she wanted to make sure nothing screwed that up. \"Thanks though. I'm going to head over to the mountain and check on Malen. See how she's fairing.\"</p><p>Under the light of the waning moon, Brodan's expression changed from familiarity and humor to sympathy. \"Poor Malen. Transitioning that early is so difficult on the mind. Bring her by the clinic if you see she's exhibiting any signs of depression, all right?\"</p><p>Petra nodded, admiring Brodan and his kind heart. Why couldn't her own heart find him a match? A female would be so lucky to have his love and care.</p><p>\"You know,\" she began, \"I've seen this several times during early transition therapy. This first month, and for Malen, the first moon cycle, is the worst. But I have some mental and physical exercises I think will help her to cope.\"</p><p>\"You are very dedicated and very good at your job.\"</p><p>\"So are you.\"</p><p>He smiled with his whole face. It was the kind of smile that made a female's knees turn to water. \"We would make a good team, don't you think?\"</p><p>Most females in the rainforest community would've loved to have this attention from Brodan. He was highly sought after as a mate, a wonderful healer, devastatingly good looking-and totally honorable. Like everyone else in the community, he believed she just hadn't gone through her transition to Shifter yet, but unlike everyone else, he found her attractive despite her body's late, or as some had called it, \"defunct\" response.</p> <p>The honorable, perfect male.</p><p>Damn, she wanted to love him. Perhaps she was latent in both her heartbeat and her emotional maturity, she thought with a mental kick of hope. Perhaps those feelings would develop over time. Perhaps she just needed to be patient.</p><p>\"You'd better catch up,\" she told him, easing out from under his hold. \"Don't want to miss the kill.\"</p><p>He nodded, but his gaze roamed thoughtfully over her face.</p><p>Don't look too deep. You won't like what you see.</p><p>He leaned in and gave her a quick kiss on the cheek. Then he moved away, lifting a hand in her direction. \"I'll see you later, Pets.\"</p><p>Petra watched him shift back into his bear state, leaving behind the scent of desire and longing. It was the one thing she did have, the one thing that gave her hope that she would someday claim her shift, her animal-a good nose. Several feet away, Brodan stretched up, leaned into a tree, and growled. He was magnificent, massive, fierce-fortunate to know who and what he was.</p><p>With one last glance in her direction, he turned and barreled away, the forest once again alive with the sounds of an animal on the hunt.</p><p>As she always did, Petra watched until he was out of sight, then she turned and made her way out of the forest. Brodan made no secret of his hope that someday she'd suddenly shift into her animal-preferably for him, a bear-and inside the dead muscle housed and protected by her ribs a steady, life-giving beat would begin.</p><p>Someday, they would both know the truth of what she was.</p><p>Under the cover of trees, the sky looked as though it had lost some of its nighttime blue to a sea of gray clouds. Walking up and over the ridge toward the lake, it was hard to make out the lightly populated, but sprawling village below. Shrouded in fog, Petra moved cautiously, down the hill, over massive stone boulders and sharp-edged rocks. Malen, the young female she was going to check on, had experienced her first shift into her wolf state just two nights earlier. The typical age for a first shift was somewhere between fifteen and twenty-one, and Malen was only eleven. These early shifts took a hard toll on the body and mind, and no one understood why they occurred. It was Petra's job to help all Shifters during their transitions, but with someone as young as Malen, she always made sure she checked in for a good three to six months afterward.</p><p>Unable to see clearly, Petra lost her footing for a moment, her shoe slipping on a wet rock, and she went down on her ass. \"Dammit,\" she muttered, scrambling to her feet. Even on a sunny day, dexterity was not one of her strong suits. Something she tried very hard to keep under wraps around the Shifters she lived and worked with, as each one of them moved with perfect grace, speed, and agility.</p><p>Moving low and slow, she continued down the hill. At this pace, she'd be to Malen's house by midday meal. She smiled to herself, heading for a break in the fog several feet ahead. But as she neared, a strange humming noise started up around her. At first she thought the sound might be coming from the native people who lived on the other side of the river. Normally, they never crossed the thirty-foot-wide raging bed of water, but sometimes if she was passing close by, she heard them talking and laughing as they washed their clothing. But the sound she heard now was not laughter. It was singular and coming, not from the direction of the river, but from beneath her, within the rock hill she traversed.</p><p>Within the ancient caves.</p><p>Cautious and quiet, she abandoned her path down toward the village and made her way over several more small boulders to the edge of the hill. The fog was lighter here and she was able to see a piece of flat land jutting out over the more uninhabited section of the village. The land near the caves was mostly black earth, with patches of green here and there, no trees. She inched closer, dropped down on her haunches, and listened. At first, she heard nothing but the wind, no voices, no rhythmic humming. She was about to call herself crazy, about to stand up and continue down the hill to see Malen, when something emerged from the cave.</p><p>It was a male; tall and broad and heavily muscled like most the male Shifters she knew. But she'd never seen this male before. With hair the color of the night sky, a purposeful jut to his strong jawline and the stride of one who cared nothing for the opinions of others, she'd certainly have remembered if she had.</p><p>Petra drew nearer, narrowed her gaze. He was carrying something. His back was to her as he walked out onto the patch of earth. The sky was still a dark gray and the fog rolled in gentle puffs below, but she recognized the classic shape of a female in his arms. The fog shifted, and for a moment Petra was able to see things clearly under the moonlight. Holding the female tightly against his chest, her long red hair spilling out over his left arm, her body flopping with each step he took, Petra frowned with the ugly understanding that this female no longer breathed.</p><p>What had happened here? Petra wondered, gripping the rock she was crouched on. She hadn't heard of anyone being ill in this part of the territory. And who did she know that had hair that color? None of the wolves.</p><p>The male stopped then and glanced up at the sky. After a moment or two, he dropped to one knee. As Petra waited, breath held, to see what would happen next, the male did the strangest thing. He curled in over the female in his arms, and like a hen pecking at food, tapped at her body with his mouth. Fear and confusion rolled through Petra. What was this? What was he doing to her? It was wrong and obscene. No Shifter she knew acted like this over its dead.</p><p>With gentle hands, the male placed the female's body on the ground. After several long seconds, he rose and stood over her. A desire to leave her perch and run to the female stirred within Petra. If something could be done, if the female's life wasn't over . . . But her thoughts, her will to help, was overshadowed by a sudden and overwhelmingly intense sense of doom. Dawn was breaking in the far edges of the gray sky. She looked down at the male. He was in the same spot, standing over his female. Again, she glanced up at the sky. Adrenaline poured through her and she gasped, jacked to her feet.</p><p>Move!</p><p>The word exploded from her mind, startling her. The male, the start of day . . . Real and terrible fear pounded at her nerves. But why? What was this reaction? She detected no threat . . . yet it was there-in that strip of pale pink morning sky. She knew it on a visceral level.</p><p>Go! Go now!</p><p>But the male didn't move. It was as though he were rooted to the spot, unable to look away, unable to break free. Didn't he understand? Daybreak was seconds away. Petra's mind spun, her skin shivered with anxiety. And as the first pale yellow rays moved over the stretch of earth below her, panic flared white hot inside of her. Living with Shifters had taught her to trust her instincts above all else. She may not understand what drove this desperate fear raging through her blood, but she believed something terrible was about to happen.</p><p>Her gaze lifted, caught the rays of the sun, and followed them as they moved over their prey. Petra froze, her eyes wide with terror and shock as she watched the female's body begin to smoke.</p><p>Smoke . . . Gods, where there is smoke there will be-</p><p>Petra's eyes cut to the male. He remained, standing over the female, watching her. Heat surged into Petra's chest, and she opened her mouth to scream.</p><p>Move, damn you! Move!</p><p>But before she could utter a word, the female's body erupted into flames.</p><p>The male cried out and dropped to his knees.</p><p>Unable to hold herself back a moment more, Petra leaped from the edge of the cliff, hit a rock below, and jumped again. She landed with a jaw-cracking thud onto the black earth several feet away from the male. Every inch of her shaking with fear, she ran at him and threw herself on top of his massive frame. He was huge and blisteringly hot. Growling in pain, no doubt out of his mind, he tried to buck her off. But Petra refused to let go. Instinct as old as the dirt they struggled atop drove her to protect him, but the sun was even older and far more powerful. For reasons she knew not, it attacked every inch of skin it could claim on the male-his hands, the front of his neck. He fought it like he fought her, but it was useless. Weak with pain, he jerked forward and collapsed beside the red-haired female, who was turning to cinder and ash before her eyes.</p><p>Not the male! her mind screamed. Not knowing or caring where the strength would come from, she grabbed his arms and began pulling him back toward the cave. His deadweight had her stumbling a few times, but she was past determined. She was possessed. However hurt this male was, he would not die; he would not sustain any more burns than he already had. As she strained and pulled, groaned and cursed, she kept her gaze on his blistering face, his closed eyes, and his bared teeth. Teeth? No . . . those were . . .</p><p>Canines? Did he belong here? Was he a Shifter? And if he was, why wasn't he protecting himself? Why wasn't he-</p><p>\"No,\" he uttered hoarsely, cutting off her thoughts as they reached the mouth of the cave. \"Leave me. Let me be.\"</p><p>Petra ignored him. The internal drive to save him, keep him for the sun, was too strong. In fact, the more he struggled, the stronger and more determined she became.</p><p>\"Stop fighting me,\" she said through gritted teeth. \"Do you want to die?\"</p><p>\"I need to be with her.\" His accent was strange and unfamiliar.</p><p>\"You need to be out of the sun!\" she returned.</p><p>Groaning with the effort, she continued to pull him inside, yanking him back, all the way to the deepest, darkest part of the cave. Once there, she breathed a quick sigh of relief, but it was all he would grant her. The moment she released him-the moment she collapsed in an exhausted heap-he was scrambling to his hands and knees and crawling back toward the mouth, toward the sun.</p><p>Dammit! She ran after him, her legs slow and her arms shaking. But she managed to catch him, grab him by the ankles and start the process over again.</p><p>\"Goddamn you, stop it!\" she cried out. \"What the hell are you doing?\"</p><p>\"Release me.\"</p><p>She squeezed his ankles even tighter. \"You're insane.\"</p><p>\"I have to see her,\" he said, his voice hoarse and desperate as he fought to move forward. \"I can't make that mistake again.\"</p><p>Panting, she continued to try and haul him back toward the cool darkness. \"What mistake?\" But it was like trying to rein in a charging bull.</p><p>\"I thought she was dead once before,\" he said, nearly at the mouth of the cave-nearly in the path of the sun. \"I have to see her.\"</p><p>It was all she could do. Petra leaped on top of him, taking the sun's rays upon her. The male cursed and moaned, but ceased his struggle as he stared straight ahead. Petra lifted her gaze, wanting to know what had changed his manic need to get outside, get to the female. But when she saw it, she gasped with horror and shock. The female's body was gone. Only a pile of sparkling black ash remained. Black ash that, before their very eyes, was rising slowly into the air and little by little blowing away on the morning breeze.</p><p>Her breath catching in her throat, Petra watched until the very last bit of ash was gone. Then silence followed. The wind calmed. Not even a single heartbeat sounded.</p><p>Slowly, Petra rolled off the male, trying to make sense of what she'd just witnessed. She knew magic, she knew the amazing gift that was shifting from human to animal, but never in her life had she seen anything like that.</p><p>\"I should've gone with her,\" the male rasped miserably, crawling over to a patch of shade against the cave wall.</p><p>\"No.\" It was all she could say in her state of confusion. Confused by him, by her own actions, what she'd just seen.</p><p>He glanced up to look at her, his face and neck destroyed by the sun, but his dark eyes wet and swimming in misery. \"You have never known the wondrous and debilitating depth of love, have you, Veana?\"</p><p>Veana? The male spoke in a different dialect-or was it madness?</p><p>She was about to answer him, tell him she didn't know what a veana was, but that she had a family and knew all about love, when his eyes rolled back in his head and he collapsed on the floor of the cave. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Death was not as Synjon had imagined. There were no wild, untamed winds to ride or sunshine that didn't inflame his skin. Instead it was unbearable, teeth-clenching pain surrounded by utter blackness. How could this be? It was not what the Pureblood scholars had promised.</p><p>And where was Juliet?</p><p>It was in death that they could finally be together; no lies, no tricks, no need to be each other's true mates-as the laws of their kind had no rules in the afterworld.</p><p>\"Pull the covering to his chin. He's in shock. The shaking will lesson if we keep his body warm.\"</p> <p>Black nothingness coated the exterior of Synjon's mind, but this sound, this voice . . . it wasn't Juliet's. It had a lower resonance and held no claim on his memory.</p><p>\"Are you going to wake him up?\"</p><p>This time the voice that snaked inside his ears, his mind, was female, and oddly familiar, but he wasn't sure why.</p><p>\"No,\" the male said softly. \"He won't be able to handle the pain. It's best to keep him sedated until there is some semblance of healing.\"</p><p>\"Why is the salve having no effect?\" she asked.</p> <p>\"It is a miracle to our shifters. But this male's skin is different, thinner, yet far more durable. It's a strange combination.\" The male sighed with frustration. \"I am hoping if we keep reapplying the salve there will be some change.\"</p><p>\"I don't understand this, Brodan-how this happened to him.\"</p><p>It was the female again, sounding concerned, perhaps even fearful. Synjon tried to focus, tried to force connections in his mind. Where was he? Why was he blind? The pain of thought was acute, but two absolutes floated to the surface of his consciousness.</p><p>The female wasn't Juliet.</p><p>And he wasn't dead.</p><p>\"Most likely it's an allergy to sunlight,\" the male said as Synjon felt something cool press against his neck. \"I've seen something similar on our shifters who have little hair. But nothing this severe or as fast as you described it happening.\"</p> <p>There was a moment of silence, then the female spoke again. So quietly, Synjon had to strain to hear. \"Do you think he's human?\"</p><p>\"I don't know what he is.\" The male's tone held both curiosity and distrust. \"He has no heartbeat yet he breathes. I've never encountered such a creature.\"</p><p>\"No Shifter has had such an anomaly?\"</p><p>\"Never.\"</p><p>The female was quiet, and Synjon wondered what made her so. What made her voice thin with sadness when she spoke of him?</p><p>\"You're not going to tell anyone about him?\" she asked.</p><p>\"No. Not yet.\"</p><p>\"Good.\"</p> <p>\"With the lack of heartbeat they could deem him a possible threat.\"</p><p>\"I know.\"</p><p>\"We haven't had a mystery in our community since-\"</p><p>\"Me,\" she finished for him.</p><p>The male laughed. \"Yes, Pets, but it's not a worrisome or potentially problematic mystery like our male without a heartbeat here.\" His voice dropped to a husky whisper. \"You and the animal you will someday become is a mystery I look forward to unraveling.\"</p><p>A low growl permeated the air, and it took Synjon a moment to realize the sound had come from his own throat. Shocked, he forced himself to swallow. Bloody hell. What was going on? Why was he angry? Why had he reacted to the male's words with such aggression?</p><p>\"Did you hear that?\" the female whispered. \"Is he waking, Brodan? Can he hear us?\"</p><p>Yes, Female. But unfortunately that is all I can do.</p><p>\"Back up,\" the male said, all lightness and flirtation now stripped from his tone. \"If he is waking, the pain will be too great for him to handle. I'm going to give him another dose, keep him under until we see how his healing progresses.\"</p><p>Syn's mind flared with panic. This prat was drugging him, holding his body hostage. He wasn't dead, this wasn't the afterlife, and Juliet . . .</p><p>The growl sounded once again, and this time Syn felt it deep within his chest. He had to stay awake.</p><p>He felt the male's hands on him. There was a quick, sharp prick in his arm. Goddamn, ruddy bastard. Syn wanted to grab him by the throat, throw him against the wall-</p><p>The light in Syn's mind dimmed and he felt a rush of warmth move through him before he dropped back into blackness once again.</p><p>When he woke, perhaps hours later, perhaps minutes, his eyes still refused to open. He tried like hell to get himself to move; just a finger, an eyelid, anything that would tell him that he still retained some semblance of control.</p><p>But every inch of skin, muscle, and bone refused him.</p><p>Fuck!</p><p>Where was the female? The one who worried for him? The one who might come to his aid if he could manage a word or two? Bloody hell, he wanted to hear her voice.</p><p>But when he listened for movement, all his ears picked up were the sounds of machinery, beeps and clicks, and the scent of antiseptic and something verdant. The scent? Had his sense of smell returned?</p><p>He concentrated on bringing in air, flaring his nostrils. With his scent intact he could predict danger, he could figure out where he was . . .</p><p>\"I can't keep you a secret for much longer, Male,\" a voice said above him. A familiar voice. But not the female's . . . \"It's been a week and you haven't healed.\"</p><p>A week? Christ. He couldn't have heard the male right. It wasn't possible. Wasn't possible that a week had gone by since he'd seen Juliet. Since he'd laid her in the sun.</p><p>A week since he'd nearly followed her there.</p><p>A warm hand gently prodded his neck, his chest. \"She won't like it,\" the male said with a sigh, brushing something cool and wet onto his neck. \"I think she feels a kinship with you. Both being different, both being anomalies of sorts.\"</p><p>Who was the male speaking of? Not Juliet. The female? he wondered. The voice that had made him feel grounded, the voice that had soothed him? Scent floated into his nostrils again. That same scent. What was it? Something pungent. Antiseptic? Oh yes, of course. The talk of salve, healing-the prick of a needle. He was in a medical facility. But why? What had happened to him?</p><p>\"How did the sun do this to your skin?\" the male said. \"And how the hell do you live and breathe with no heartbeat?\"</p><p>The answers, the full and unedited truth, which had clearly being perched on the edges of his mind, suddenly came back to Synjon in a panicked rush. Juliet was dead. The mad vampire Cruen had killed her. Synjon had flashed her out of her caged prison and to the rainforest she'd loved so much, the forest where she'd wanted them to live out their long lives together once upon a time. But instead of them living there, Synjon had come alone, to release her body to the sun.</p><p>Inside his chest, something squeezed. After placing her on the solid earth, he hadn't been able to walk away, hadn't been able to leave her when he'd just found her again. Instead, he'd stood his ground, choosing to die with her, follow her into the afterlife where they could find another rainforest to live within.</p><p>Christ . . . and he'd almost done it, almost succeeded. He'd felt the sun blazing down on him, claiming his skin as it had hers. Until something had rushed him, covered him.</p><p>Saved him.</p><p>Wrenched him away from Juliet.</p><p>\"You look pained again, Male,\" said the doctor, his voice drifting upward. \"I know no other answer but oblivion. Rest easy. Perhaps tomorrow you will know peace.\"</p><p>Synjon felt his lips move, part, then black warmth sucked him in once again.</p><p>This time when Synjon woke, the pain in his face and neck was so excruciating it felt as though a truck were driving back and forth over them. But with that pain came the awareness that his body was no longer heavy and immobile. He swallowed, inhaled deeply, feeling both the action of his throat and the rise and fall of his chest. He made a quick mental inventory. Every muscle felt alert and ready to spring, every bone ached with lack of use. His mind was clear, and if he wanted to open his eyes and take in his surroundings for the first time, he knew he could.</p><p>But he wasn't sure if that was the wisest course of action. What waited for him? Who might attack? Though he felt the readiness in his blood to fight, he didn't know if he had the strength to match it.</p><p>\"Why won't he heal, Brodan?\"</p><p>The female. She was back, Synjon mused, his skin humming as her voice wrapped around him like a soft blanket.</p><p>\"I don't know,\" the male answered, his tone ever frustrated. \"Nothing I give him seems to have any effect.\"</p><p>\"But he will recover,\" she said with deep conviction. \"I know it. We just have to give him more time.\"</p><p>\"We don't have more time, Petra.\"</p><p>Petra. So she had a name, this one who fought for him. \"No one has to know he's here,\" she continued. \"You have him in a secluded area. Keep him medicated. I won't say anything to anyone.\"</p><p>The male sighed. \"You don't understand, Pets. He is in horrific pain, and keeping him asleep has become far more difficult. His body is starting to reject the drugs.\"</p><p>\"Then give him different drugs!\" she cried.</p><p>There was a moment of silence, and Synjon had the most desperate desire to open his eyes and see the look that was passing between the pair.</p><p>\"Why are you acting like this?\" the male demanded, his tone far less gentle now. \"You don't even know this male. He is nothing to you.\"</p><p>\"I saved his life!\" she exclaimed.</p><p>Synjon's blood froze in his veins.</p><p>\"Maybe you shouldn't have.\"</p><p>\"What?\"</p><p>The male sighed. \"Maybe you should've let him die.\"</p><p>She's the one! Syn cried out in his mind. She was the one who'd pulled him from the sun, from Juliet . . .</p><p>\"I'm pretty sure doctors aren't supposed to say things like that,\" the female said with barely masked fury.</p><p>\"You need to face some facts here, Pets. The male's burns are dire and he won't heal. I've done everything I can. And shit, even if he did heal, what kind of existence would it be? Look at him. He's a monster. No one will care for him. No one will touch him. And if he's anything like us, desperate for the touch of another being, he won't want to continue living.\"</p><p>\"That's bullshit,\" the female said, her tone resolute.</p><p>Even through Synjon's extraordinary physical and mental pain, heat rumbled within his chest. How was it possible that this female fought for him? This female he didn't know? It was extraordinary.</p><p>Petra's voice was barely above a whisper when she spoke again. \"If you were burned and in pain and no one knew how to help you, would you expect me to turn away from you, Brodan?\"</p><p>\"Come on, Pets. Our . . . friendship is different.\"</p><p>\"How?\" she asked. \"This male could have the same kind of friends elsewhere. Family. A lover.\"</p><p>\"A lover, eh?\"</p><p>The grin, the lightness, the heat, in the male's voice inflamed Synjon, and he nearly allowed another feral growl to escape his chest. Clearly this male wanted Petra, and even clearer was her disinterest in him. Didn't the doctor get it? Didn't he understand what stood beside him?</p><p>Synjon's mind squeezed.</p><p>What . . . ? What was he saying? What stood beside the doctor?</p><p>A rush of heat surged into his veins.</p><p>\"All right, Pets,\" the doctor said with a reluctant chuckle. \"You fight for him, I fight for him. I just wish I knew what to use as a weapon.\"</p><p>His blood pumped fast and thick. What was wrong with him now? The female . . . her scent was pushing into his nostrils. No, not female.</p><p>Veana.</p><p>A tsunami of pain and hunger and desire unlike anything he had ever known slammed into Synjon. He had no breath, no ability to reason or remain still and silent. With a gasp, his eyes slammed open, and when he saw the veana above him, he roared.</p><p>\"Oh my gods,\" the female cried out and grabbed his hand.</p><p>But Synjon saw only sustenance before him.</p><p>\"You!\" he cried out, his gaze raking down her neck to her arm. \"Your blood, Veana! I need your blood.\"</p><p>He yanked her hand to his mouth and twisted, his fangs striking the inside of her wrist with shocking force. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>With a scream of pain, Petra yanked her arm away from the male and stumbled back. Clutching her stinging wrist in her hand, she watched with wide, horror-filled eyes as Brodan rushed toward the male and plunged a long needle into his neck.</p><p>What-?</p><p>What the hell had just happened here?</p><p>Her gaze cut to the male's face, looking for answers, for some kind of reaction. But apart from his eyes, he was deadly silent and still now. Fire-ravaged face and dark eyes strained with pain, his gaze locked onto hers. Petra felt her breath catch in her throat at the confusion and feral hunger that registered there. But it was his lips, stained red with her blood, that truly stalled her breath, and had her backing up another foot.</p> <p>Her blood!</p><p>With a quiet whimper, she pressed her palm harder against the wound on her wrist, making sure she was stopping the flow. What had he done? And why? Was he angry with her-shit, she'd saved his life!</p><p>But she would get no answer from him. Not today. On the raised pallet before her, the male's body went limp and his eyes fell closed.</p><p>\"He's out.\" Brodan was at her side in seconds, immediately reaching for her wrist. \"He bit you, broke the fucking skin.\" His gaze lifted to her face and he looked furious, looked near to shifting into his bear. \"I should kill him right now.\"</p><p>Her wrist stinging, Petra shook her head. \"No. No. He didn't know what he was doing.\" Why was she protecting him still, after what he'd just done?</p> <p>\"I don't give a shit, Pets. Whatever he is, he's rabid.\" He hesitated, exhaled heavily, seemed to be trying to get control over himself. \"Thank the gods you won't suffer further for that bite. With all the testing I've done on this male, there's been no sign of disease, so at least we're covered there. Are you all right?\"</p><p>\"Yes,\" she said honestly, finding that the pain and stinging were easing. It was only the fear and confusion that remained. Well, that and this insane drive she had to keep the male alive, find a way to heal him.</p><p>\"He has incredible strength,\" Brodan remarked, grabbing a chunk of cotton and wetting it with soap and warm water. \"And a powerful bite. Perhaps even quicker and more powerful than our Shifter males.\"</p><p>\"I wouldn't know,\" Petra said with a forced and nervous smile. \"No Shifter has ever bitten me before.\"</p><p>\"Not yet.\" Brodan cleaned the wound and bandaged it, then offered her a gentle smile. \"Only mated couples bite one another, from the canine and the feline breeds. And we know he's not any Shifter breed.\"</p><p>She caught Brodan's gaze. \"Please don't report him.\"</p> <p>\"Dammit, Pets.\" He sighed, searched her eyes, then shook his head. \"Fine. Maybe you're right, maybe he didn't know what he was doing. The drugs, the pain.\"</p><p>Relief poured through her.</p><p>\"But,\" he continued. \"I can't have you near him again.\"</p><p>\"You're giving me an order, Brodan?\"</p><p>\"No. I know better than to tell you what to do. What I'm giving you is a choice.\" His chin dropped and his voice grew deadly serious. \"You want me to heal him, keep him hidden? I will. I'll do that because you asked me to. But only if you're somewhere else, somewhere this male can't get to you.\"</p><p>His words made absolute sense, and yet Petra couldn't stop the struggle within her. The male had just bitten her. He'd looked at her like fresh kill, and yet she didn't want to leave him. There was so much she wanted to know. What if she never saw him again? Who was he? Who was the female that had turned to dust in the sun?</p><p>And the most dire and secretive reason of all. He shared a trait with her, something she'd never encountered before in the rainforest.</p><p>A lack of heartbeat.</p> <p>Realizing Brodan had the upper hand, and that if she put up any amount of fight she was jeopardizing her chance to find out the truth, she nodded. \"Fine. I'm going home. I promised to have main meal with my family anyway.\"</p><p>\"Tell them I send my good wishes.\"</p><p>She pointed at him. \"You can tell them when you stop by to give me an update later. I won't come near him, but I want to know how he's doing.\"</p><p>Brodan's mouth formed a grim line. \"Your keen interest in this male's recovery, though admirable, is starting to concern me.\"</p><p>Join the club, she thought. \"I saved his life, Brodan.\"</p><p>\"Are you sure that's all it is?\"</p><p>Her skin prickled. Brodan, like everyone else in the Shifter community, knew nothing about her lack of heartbeat. She gave him a confused shrug. \"What else could it be?\"</p><p>His eyebrow lifted. \"Attraction.\"</p><p>Her mock confusion died and she glared at him. \"Get serious. He's unconscious and he bit me.\"</p><p>\"He marked you.\"</p><p>She didn't like this conversation, didn't like where it was leading. \"Okay, I'm going home now. And I think you should get out of here. Take a break, maybe get some sleep.\"</p><p>But Brodan's eyes continued to track her. \"Maybe.\"</p><p>Petra glanced at the male one last time before she rushed out the door, ripping off her bandage as she headed down the hallway.</p><p>Marked her.</p><p>Brodan was acting like a jealous male instead of a concerned doctor. It was a bite, a moment of madness, nothing more, she assured herself as she brushed her thumb against the skin of her wrist. A soft gasp of shock escaped her as she felt only smooth, unharmed skin.</p><p>Her gaze dropped. The bite marks had already healed.</p><p>Within the rainforest community there were four factions, all existing together: the Avians, the Mountain Beasts, the Land Dwellers, and the Water Lords. Petra worked within all four and had grown quite close with certain families. It was a strange closeness, as each faction tended to work, hunt and breed with its own kind. Of course, there was a common bond being Shifters, and much was traded and shared between them, but the factions couldn't help but form their own tight communities.</p><p>Petra's family-her pride-were Land Dwellers. They lived in a sprawling one-story home with six bedrooms and a grass roof on a stretch of flat land near the river. It was the largest dwelling in the area, as her father and two brothers were the law enforcement.</p><p>\"I was starting to get worried about you.\"</p><p>Petra's mother, Wen, stood in the doorway, her blond hair loose to her ankles, her blue eyes concerned, but her broad smile happy.</p><p>\"Nothing to worry about, Mom,\" she said, passing through the door and into the hallway where she dropped her bag on a chair.</p><p>Wen followed her into the kitchen. \"Okay, I'm sorry for pushing and prying, but you said you'd be here an hour ago.\" She rounded on Petra and gave her a wicked smile across the cutting table. \"Please tell me it was a male.\"</p><p>Oh, it was a male all right.</p><p>There wasn't much she kept from her mother and closest friend. Besides the grand secret of her non-Shifter lineage, there were the small crushes she'd had and the danger she sometimes faced at work. But mostly, she liked to share her day-to-day life events with the female. This, however, seemed different. Problematic. Telling her mother, her family, about the male she'd rescued from the sun, the male who had no heartbeat like her, and the male who had bitten her . . . well, it seemed like a bad idea.</p><p>She gripped the table, still feeling shaken up inside. The last thing she wanted was for her family to know all that had gone down at the clinic and all she was feeling regarding the male's physicality and behavior. If they did, they'd make damn sure she didn't see him ever again.</p><p>\"I was with Brodan,\" she said simply, truthfully.</p><p>Shit. Brodan . . . She was going to have to intercept him. If he came to the house tonight he might very well say something he shouldn't.</p><p>Her mother's smile brightened as it always did when Brodan was mentioned. \"A good male, handsome too.\" She shrugged demurely. \"Your father and brothers would approve. And I suppose I can forgive him for being a bear Shifter if you really care for him.\"</p><p>\"Thanks, Mom.\" She leaned across the table and kissed the female's cheek. \"That's really generous of you.\"</p><p>Wen laughed, showing off her brilliantly white teeth. \"Help me set the table, Pets? Your father's off dealing with some infraction with the Avians, but your brothers will be home soon.\"</p><p>Soon? How about now? Petra grinned as she heard movement outside the house. \"Did you have to invite the boys to lunch? They'll eat everything in sight. And their table manners. Disgusting. Like animals.\"</p><p>\"No,\" her mother corrected. \"Like lions, dear.\"</p><p>Two raucous roars followed those words, and Petra turned to the open doorway with a mock scowl. Lions crowded the wide archway. Two massive, beautiful creatures stood with manes as gold as the sky at day's end and eyes as black as the ashes in the fireplace to their right.</p><p>\"Lions eat with far finer grace,\" Petra said, her eyes flashing, her mouth twitching. \"I would say you two should've been pig Shifters.\"</p><p>Behind her, their mother's tinkling laughter filled the air, and Petra couldn't help but join in. She watched as the lions shifted back to males. Gorgeous blond, blue-eyed, tall as trees, smirking like cats, males. They grabbed jeans from the hooks on the wall and yanked them on.</p><p>Petra rushed at them and let each one lift her high in the air, then toss her to the other. It was their ritual, had been since they were young, as were all the good-natured insults.</p><p>But today, for some reason, Sasha appeared surly as he placed her back down on the ground. In fact, he growled at her, his eyes narrowing.</p><p>\"What's with you?\" Petra asked. \"Did the lioness down on River Three dump you again? I swear I told you to stop using that hideous scent.\"</p><p>\"It's not my scent that's the problem today,\" Sasha returned, his nostrils twitching in her direction. \"What the hell is that?\"</p><p>Petra went instantly on high alert. \"What?\"</p><p>\"Yes, I scent it too,\" said Valentin, inspecting her with his gaze, his own nostrils flaring. \"Are you bleeding?\"</p><p>Oh, shit. The scent. Not her scent. Panic rushed her like a sudden wind. But instead of answering them, she backed up a step.</p><p>Gods, she was an idiot.</p><p>Sensing her reticence, knowing how she acted when holding onto a secret, her brothers pounced.</p><p>\"Tell us now, Pets,\" Sasha said through gritted teeth, stalking toward her. \"Has someone harmed you?\"</p><p>\"We will find out,\" added Valentin, beside him.</p><p>Nervous and worried about what it would mean if they managed to get this information for her, Petra had the urge to fight back, tell them to back off, to get out of her face-leave her the hell alone. After all, she'd managed to say those words at least once a day for the past twenty years.</p><p>\"Hell, yes indeed,\" Sasha continued, his lion flickering in and out of his features. \"And we will be obliged to rip out his heart and watch it cease beating.\"</p><p>But Petra didn't fight back, or couldn't. In fact, when she opened her mouth all that squeaked out were the two most ridiculous words on the planet.</p><p>\"Too late.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Synjon had been conscious for more than an hour, but he hadn't moved a muscle. Not outside his body at any rate. Inside, he was working his bloody ass off, running facts in his head, posing questions and possible outcomes, trying to reason his way out of the medical facility without drawing attention to himself and subsequently spilling any more blood they he needed to.</p><p>As he plotted, he woke each muscle, made sure every bone was strong and intact, and followed the flow of the blood running through his veins. His blood mixed with just a hint of hers. Petra. His fangs twitched beneath his lips. The pain in his face, though not gone entirely, had subsided, and it was due to that female's blood.</p><p>Her rich, powerful, and deliciously pure veana's blood.</p><p>He wanted more.</p> <p>If he was going to leave this place, truly hunt the paven who had murdered his love and ruined his existence, he needed more.</p><p>He needed her.</p><p>For a solid five minutes, Synjon allowed his ears to work. He had superb hearing, and it traveled the clinic searching for sound-Shifter sound-all the while keeping himself calm, keeping himself still, as though the medicine that shite doctor had given him was still working. But though his nose still picked up the male's scent, his ears captured nothing more than the low-level drone of a few insects.</p><p>Doctor Brodan, it seemed, was elsewhere.</p><p>Syn opened his eyes, and with deft fingers quickly removed anything that was attached to his body. The room was pleasingly dark except for the machinery he'd been hooked up to and two small disk lights on the walls bracketing the door. The exit.</p> <p>Time to take a walk, follow his nose, and see how much blood he had to get through before he found the one he needed.</p><p>She'd lied about the blood, used the oldest trick in the book and blamed her period. There was nothing that shut down Shifter males quicker than talking about the monthly curse, and she was pretty sure if she tried to go with a cut or something like that Sasha and Valentin would ask not only to see it, but for the details on how she got it.</p><p>Nobody was asking anything now. In fact, they seemed to be avoiding eye contact all together.</p><p>Pussy cats.</p><p>She grinned at them. Sasha and Valentin were sitting side by side across the table from her, the furs of their ancestors who had died in their animal states, on the walls behind them.</p><p>\"Sandra's avoiding you because she's not interested in a mate right now,\" their mother was telling Valentin, who looked as though he'd rather be anywhere else. \"Her mother told me. It's not that she doesn't find you attractive.\"</p> <p>Sasha burst out laughing. \"No, Val, you're very attractive.\"</p><p>\"He is!\" Wen said, touching her son's arm.</p><p>\"Okay, please stop,\" Valentin ground out, grabbing another venison chop from the middle of the table. \"I'm not even into that female. She's a friend.\"</p><p>\"Right.\" Still laughing, Sasha reached for his own chop. \"Friends is code for 'I tried and was totally shot down.'\"</p><p>Valentin ripped a piece of meat from the bone. \"You would know, Whiskers,\" he uttered, invoking Sasha's dreaded cub nickname. \"Rejection has become your middle name this year.\"</p><p>\"Boys, that's not nice,\" Wen said, giving each of them a pointed glare. \"You're family.\"</p><p>\"That's right,\" Petra remarked. \"And the family that gets dumped together stays together.\"</p><p>\"You're next, Pets,\" Sasha growled playfully.</p> <p>\"Seriously.\" Valentin grinned, his mouth stuffed with food. \"That bear Shifter doctor friend of yours isn't going to wait around forever.\"</p><p>Petra rolled her eyes as she popped a grape in her mouth. Unlike the rest of her family, she consumed fruit, grains, and seeds-not raw meat.</p><p>\"Watch it, Pets,\" Sasha said. \"Or your eyeballs'll stay like that.\"</p><p>\"In a state of perpetual annoyance, you mean?\" She snorted. \"Sounds about right.\"</p><p>Wen laughed, then jumped in to quickly break up a fight as the boys reached for the same chop and ended up in a shoving match.</p><p>\"Don't go back to your office tonight, Petra dear,\" her mother said wistfully, sitting back down. \"Take the night off.\"</p><p>\"Yeah, sis,\" Sasha said, giving his brother one last shove as he did as his mother asked and relinquished the chop. \"You can have my pallet.\"</p><p>\"He'll wash the night drool off it first,\" Valentin said before taking an enormous bite of the raw meat.</p><p>Sasha flipped him off. \"No, that's your bed, asshole.\"</p><p>\"Enough,\" their mother warned.</p><p>But Val wasn't listening. \"Oh, right. I'm the drooler and you're the snorer.\"</p><p>Petra put her hand on her mother's arm. \"I can't. I never got to check in on Malen, plus the Avians want to discuss a dual transition they believe is coming at the end of the week. I need to prepare.\"</p><p>\"Malen,\" Wen said thoughtfully. \"That's the young wolf Shifter female.\"</p><p>\"Out by the caves, right?\" Sasha added, his verbal sparring match with Val all but forgotten now.</p><p>\"Near there, yes.\" The secretive edge to her voice was obvious. She needed to watch that.</p><p>Glancing up from his thoroughly cleaned chop, Val said, \"I heard there was some issue out there a few days ago.\"</p><p>\"What?\" Petra blanched, but forced herself to remain calm, cool. \"What did you hear?\"</p><p>He shrugged. \"A small brush fire or something.\"</p><p>Relief moved through her and she forced her expression to calm. Everything was fine. Small brush fires happened from time to time, and if they thought that was what went down out there, she wasn't going to correct them.</p><p>Petra turned, noticed her mother staring at her.</p><p>\"You're not eating?\" Wen said, her eyes concerned. \"Are you ill?\"</p><p>\"No. Just a little tired.\"</p><p>\"Then stay home, rest your body. Work can wait.\"</p><p>To some, the henpecking and overly concerned ways of a parent might irritate at times, but Petra never felt like that. In fact, she felt quite the opposite. She adored her mother's care and concern because it meant she was loved. Never once had any of them acted as though she wasn't a part of their family, Shifter born or not.</p><p>She leaned in and kissed the female on the cheek. \"All is well, Mom. I love you.\"</p><p>The female's eyes grew bright with adoration and warmth. \"Love you, my pet.\"</p><p>Petra stood and grabbed her plate.</p><p>\"What about us?\" Valentin said, looking ridiculously morose.</p><p>\"Yeah, Pets,\" Sasha said, sticking out his bottom lip. \"You don't love us?</p><p>\"Awww, boys,\" she began. \"I always have love for the pathetic.\"</p><p>They grinned and Val turned to Sasha. \"She was totally talking about you.\"</p><p>Laughing, Petra went into the kitchen and placed her plate in the tub sink-the same sink that had been in their home since before she could remember, and had been used by their mother to bathe each one of them. She was just turning off the water when she heard the sound of wings beating against the breeze outside.</p><p>\"My ride's here,\" she called, heading for the hallway and her bag. \"I'll see you all tomorrow!\"</p><p>\"Petra?\"</p><p>She turned to see her mother standing in the kitchen now. \"Yes?\"</p><p>The female glanced behind her, then turned back and asked, concerned, \"Are you sure you're all right?\"</p><p>\"Of course.\"</p><p>Her voice dropped. \"I know it's not your monthly time.\"</p><p>It was all her mother said-all she needed to say. The female knew Petra had lied to her brothers. Petra's gut clenched and for a moment she just stared at Wen.</p><p>She couldn't tell her, not now. Not yet.</p><p>\"Tomorrow,\" Petra said.</p><p>The female nodded, but her eyes glittered with worry.</p><p>She granted her mother one final smile she didn't feel and walked out the door into the night air and toward the massive hawk Shifter, who was waiting on the front lawn to take Petra to her office. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After nicking the clothes left behind by the good doctor, Synjon had bolted from the clinic and traveled, searched and hunted for an hour in the pitch black of night. It hadn't welcomed him. In fact, its cool, gentle wind had led him astray more than once. With all the animal scents to contend with, finding hers hadn't been easy.</p><p>But he wasn't an amateur.</p><p>Tracking had always been his pleasure.</p><p>He moved swiftly across the large expanse of land toward the dwelling that held her scent, his fangs lowering with every footfall. Though his face and neck still pulsed with pain, it was the ache in his belly that disturbed him the most. He needed to nosh. And the veana's pure blood called to him, beckoned him forward, teased the shite out of him.</p> <p>A low growl escaped his throat as he rounded the dwelling and searched the length for a clear way inside. Announcing himself was a certain ticket into the fighting ring, and though he loved a good going over, now wasn't the time to go looking for it. There were four heartbeats inside the home. All he had to do was get inside and find the body that didn't contain one.</p><p>After a few minutes of searching, he found a window on the far side of the house that was unlatched. The entry point was barely a foot and a half around, but he managed to get through. Once inside, he went low and silent. He followed his nose from room to room until he caught the thick scent of the one he sought. His skin vibrated with need and his fangs dropped heavy and hungry as he pulled back the door. His eyes cut instantly to the bed, the white sheet, the shape beneath, and he moved quickly, ready to strike. He was coiled over her, saliva pooling in his mouth, when he heard the thick pounding of a heartbeat in his ears.</p><p>Then a fist in his face and the bone-shattering slam of his body hitting the wall.</p><p>The irritating, rhythmic pounding woke Petra, and she jacked up in her chair with a soft curse. Her neck was stiff and the right side of her face felt numb. What the hell? She squinted in the semi-darkness, trying to pull her mind out of her ass. Dammit. She'd fallen asleep at her desk again. The pounding continued and she pushed herself up out of her chair. Rubbing her eyes, she padded across her office floor, which consisted of several dozen sanded branches from the tree her office resided in. During one of her work sessions in the Avian district the previous year, she'd come across the most amazing tree, a massive thing that she'd fallen deeply in love with. One of her transition families had built the office as a surprise, and as a thank you for helping their daughter through an incredibly difficult month-long transition process.</p><p>\"Oh my gods, enough with the pounding,\" she called out, yanking the door open.</p> <p>\"Took you long enough,\" the blond male growled with deep irritation. \"I almost knocked the fucking thing down.\"</p><p>Petra leaned against the doorjamb, moonlight filtering down through the trees overhead. \"Sasha, it's the middle of the night. What are you doing here?\"</p><p>\"Checking on you.\"</p><p>\"Why?\"</p><p>That made him pause. His gaze checked left and stayed there like he was debating what to say.</p><p>\"Come on, Sash,\" she said, crossing her arms over her chest. \"If you were going to lie to me, you should've come up with it on the way over here. Now, what the hell is going on?</p> <p>His blue eyes shifted back to meet hers. \"There's been a break-in at the house.\"</p><p>\"What?\" An invisible fist squeezed her gut. \"Is everyone all right? Did you catch them? Which faction did they come out of? It better not be Water-they've got a good half dozen rebirths coming up and the last thing they should be doing is screwing with my family-\"</p><p>\"He's not from a faction, Pets.\"</p><p>Petra's breath froze in her lungs. \"I don't understand.\" Please let me not understand. Please-</p><p>Sasha interrupted her silent begging with even worse news. \"A male attacked Valentin.\"</p><p>\"Val-\"</p><p>He put a hand up. \"He's fine. But, sis . . .\" He cut himself off this time.</p><p>\"What?\" She pushed away from the doorjamb and went out onto the porch with him. \"Dammit, Sasha, what?\"</p> <p>His pale blue eyes locked with hers. \"The male didn't have a heartbeat.\"</p><p>Though her insides were shooting off panicked firecrackers, she held herself together. She could forget the begging, hoping. She knew exactly who had broken into her house and attacked her brother. \"Did you notify anyone?\"</p><p>He shook his head.</p><p>\"Is the male contained at the house?\"</p><p>He shook his head again.</p><p>Firecrackers turned to a churning sick feeling. \"He got away?\"</p><p>\"Yes.\"</p><p>Oh, gods. The male could be anywhere, or he could be gone. She didn't know what she feared more; him coming after her or never seeing him again.</p><p>Could a bigger fool than her exist?</p><p>How the hell had he escaped the hospital? And where was Brodan? Did she get rid of her brother and go find him, or ask him to help her search? After all, the male was still injured.</p><p>Behind Sasha, the massive hawk who had brought her to the office several hours ago touched down and instantly shifted into a gorgeous pale blond female with a nose ring. She gave Petra a grin, then turned to Sasha. \"Ready to go?\"</p><p>Petra stared at the female. \"What're you doing here, Dani?\"</p><p>The blond female nodded in Sasha's direction. \"Your half-wit brother begged me for a ride.\"</p><p>\"And your perpetually pissed best friend charged me for it,\" he returned with a sneer.</p><p>\"I was in my freaking bed!\"</p><p>Sasha's mood changed in an instant. He grinned wickedly at her, his cat shifting in and out of his face. \"And I promise I'll put you right back in it.\"</p><p>She glared at him. \"You put me to bed and I'll put you in the clinic for a week.\"</p><p>Sasha's sensual purr echoed throughout the dark forest. \"Damn, Female. You've been invading my dreams again.\"</p><p>She snorted. \"You couldn't handle this, Feline.\"</p><p>\"Cats eat birds, Dani, or haven't you heard? It's nature at its best and most delic-\"</p><p>\"Okay!\" Petra said, holding up both hands. \"I am officially grossed out.\"</p><p>Dani pointed at Sasha. \"He started it.\"</p><p>Sasha winked at her. \"And I'll finish it, not a problem.\"</p><p>Turning around, Petra uttered brusquely, \"Going back inside now. Night night, you two.\"</p><p>\"Wait, Pets.\"</p><p>She glanced over her shoulder at Sasha. \"What?\"</p><p>Playful flirtation no longer glittered in his eyes. He stepped forward and released a weighty breath. \"Listen, Mom and Dad want you to stay here. Don't come to the house. We're not sure what this bastard was after, but we don't want you getting in the middle of it.\"</p><p>She had a pretty good guess as to what the male was after, but she wasn't about to discuss it with her brother. \"Got it.\"</p><p>He nodded. \"You have enough in the way of supplies for a few days?\"</p><p>\"'Course. That's me. Always prepared.\"</p><p>\"Good. I'll check in tomorrow.\" Sasha shifted his focus to the blond female who was in that very moment shifting into her hawk form. \"All right, Dani. I'm ready for my ride.\"</p><p>With a wry smile, the hawk turned to look at Petra. \"Will I be endangering our friendship if I fly over the lake and let him slip off my back?\"</p><p>\"Do what you gotta do, Dani.\" Laughing, Petra closed the door on the sound of her best friend taking flight. But it was the sound that met her ears when she walked back into the dimly lit room that had her belly coiling with tension.</p><p>\"Evening, Love.\"</p><p>In the light of the dying moon streaming in through the windows to his left, Petra saw the male she had rescued, the male who had bitten her, the male she couldn't stop thinking about no matter how hard she tried.</p><p>\"I've come for more of your rich veana's blood.\" He grinned, his dark eyes moving down her face, stopping just below her jawline. \"Think you can spare a pint or two?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He'd thought her beautiful asleep, but awake, she was a goddess. Tall, with long ink black hair, an athlete's body, and a face that exuded strength, she commanded his gaze. Not to her curves, which were pretty bloody fantastic, but to her eyes. They were the palest of blue and sharp as shite.</p><p>He tracked her as she went over to the dining table, lit a match, and touched the flame to each of the four candles huddled in the center. The combination of her scent growing ever closer and the hit of sulfur made his gut scream with hunger. He wanted more of that rich blood on his tongue, in his veins.</p><p>\"Who are you?\" she asked softly.</p><p>Her voice had an affect on him, reminding him of his days in the medical facility and how she'd fought for him. \"My name or my species?\"</p> <p>She pulled out a chair at the table and sat down. \"Let's start with the name.\"</p><p>\"Synjon Wise.\" He saw no reason to lie.</p><p>\"And what species do you belong to, Mr. Wise?\"</p><p>\"Same one as you, Petra.\"</p><p>He saw the vein at the base of her throat pulse. Yes, I know your name.</p> <p>\"You're not a Shifter,\" she said, doing her very best to act impassive.</p><p>\"Bloody hell.\" He chuckled softly. \"No. I belong to an ancient, respected, deadly species. As do you.\"</p><p>Her nostrils flared. \"What I am hasn't been determined yet.\"</p><p>\"I've determined it. The moment I scented you.\"</p><p>\"What am I then, Mr. Wise?\" Her pale blue eyes flashed with fire-fueled curiosity. \"And where is your proof?\"</p><p>Synjon brought a hand up and cupped his ear, pretended to listen. \"I hear nothing.\"</p> <p>\"It's night,\" she said dismissively. \"The Avians don't wake until-\"</p><p>\"No,\" he interrupted almost caustically. He was growing tired of playing games. There was work to be done outside this strange oasis, but he needed the veana's blood first. \"What I am listening for is a heart that doesn't beat.\" He raised an eyebrow. \"Your heart is dead, Veana, just like mine. It's the first and best way to identify our species.\"</p><p>Her mouth dropped open and her eyes went wide.</p><p>Irritated, Synjon pushed away from the wall and strode toward the table. \"Is this an act, or do you truly not know what you are?\"</p><p>She closed her mouth then, not answering him.</p><p>He stopped inches away and coiled over her. \"Why are you here? In this land, in this place?\" His head cocked to one side, and he knew he must look hideous, his burns beside her beauty, but he didn't give a shite. \"Our kind doesn't belong here. You don't belong here.\"</p><p>\"My family is here,\" she retorted. \"My family whom you attacked.\"</p><p>\"Bullocks,\" he mumbled, yanking back a chair and sitting down beside the raven-haired veana. \"I didn't mean to get into it with your family, or whatever you believe them to be. I was looking for you.\"</p> <p>\"For my blood,\" she corrected, her wary gaze searching his. \"Right?\"</p><p>He shrugged. \"They're a package deal, really.\"</p><p>\"Well, you already have my blood-taken without asking, I might add.\" One black eyebrow lifted. \"You won't be doing that again.\"</p><p>His lips thinned. He didn't envy the male who took on this steely firecracker of a package. He liked his females like he liked his blood; warm, soft, and uncomplicatingly sweet. Like Juliet.</p><p>His gut clenched with pain. With hunger. With grief . . .</p><p>He had to get out of here. Find the murderer Cruen and let him feel the unrelenting pain of the sun's justice.</p><p>\"Does my face look different to you, Petra?\" he asked, moving closer to the candlelight.</p><p>\"You've healed some,\" she acknowledged.</p><p>He nodded. \"That's right. But there is more work to be done.\"</p><p>\"Then why are you here? Why are you wasting time seeking me out? Not just because you're still thirsty. Or is it hungry?\"</p><p>\"You tell me. It's different for every one of us.\"</p><p>She jerked back in response, but continued as if he hadn't said a word. \"Why don't you go back to the medical facility, let Brodan continue the treatment-\"</p><p>Synjon's laughter brought her suggestion to a halt. \"This wasn't in reaction to anything your lover gave me or did to me, Veana.\"</p><p>Her jaw tightened. \"Brodan is not my lover.\"</p><p>\"He's working his way there. Give him another couple of weeks, and those capable hands will be looking to heal the most intimate parts of you, Veana.\"</p><p>She looked horrified. \"All right, that's it.\" She stood and pointed toward the door. \"You need to leave. Go back to the medical facility or return to whatever rock you crawled out from under.\"</p><p>Synjon's nostrils flared as he leaned back in his chair. Her blood grew hot with her anger. \"I want to leave, Veana. I do. But I have the revenge job of a lifetime waiting for me outside your strange little paradise, and I can't go looking like this. It'll blow my cover.\"</p><p>\"Not my problem.\"</p><p>\"It's more than your problem. You owe me.\"</p><p>She sniffed. \"How do you figure that?\"</p><p>\"The cave,\" he said, his hands lifted. \"You dragged me in there, out of the sun.\"</p><p>Hovering above him, she narrowed her eyes. \"I saved your life.\"</p><p>\"Precisely.\"</p><p>Her derision turned to quick laughter. \"Wouldn't that be you owing me?\" she said.</p><p>\"I didn't ask to be saved,\" he said. \"In fact, I believe I requested several times that you back the fuck off and let me bloody die.\"</p><p>The room fell silent. She blinked several times as she stared down at him. Then she said in a quiet voice, \"If you truly want to die, do it. I won't stop you this time. Sun's up in a few hours.\"</p><p>Synjon's chest squeezed with the pain of loss. \"It's too late,\" he uttered.</p><p>\"It's never too late,\" she returned.</p><p>He turned away. \"Not in the way I wished it.\"</p><p>\"Going with her,\" Petra finished.</p><p>Intense anger surged through him and he slammed his fist on the table. But when he spoke his tone was soft and deadly. \"You took that from me, Veana.\"</p><p>\"I'm sorry, Mr. Wise.\"</p><p>His gaze cut to her face. Her expression was anything but remorseful. \"No, you're not.\"</p><p>\"Right.\" She pushed away from the table and went to the small wood island in the kitchen, lighting more candles. \"How dare I try and save someone's life? How dare I give a shit about someone I've never met, whose skin in burning in the fucking sun? I should have walked away, right? Let you die, let you scream and writhe in agony? What kind of creature helps one who's in pain!\" She looked up, pinning him with her pale eyes. \"I'm a monster!\"</p><p>\"No, Female,\" he said softly. \"I'm the monster.\" He watched as her gaze moved over his fire-ravaged face. He sighed, some of his ire falling away. \"Look, you were caught up in something that had nothing to do with you, I get that. But you interfered, you changed the plan.\"</p><p>\"Was that really your plan, Mr. Wise?\" Her brows lifted and she shook her head. \"Didn't look like it.\"</p><p>His hands fisted around the wood chair. He didn't answer her. Not right away, at any rate. Maybe because the question was one he never wanted to answer. Juliet was gone, she was dead, he'd done what he came to do-give her a proper burial, say goodbye when he'd never had the chance before.</p><p>Now, his focus had to be on one thing and one thing only.</p><p>Hunting and killing Cruen.</p><p>\"You want me to go, and I want to leave,\" he began with as much control as he could wrangle. \"But I can't, not until I am healed. And you, tall drink of throat lashing whiskey, are the only one who can heal me.\"</p><p>Her hands went to her hips. \"And how do you figure that?\"</p><p>\"Because you already have.\"</p><p>The surprise he expected to see was right there. \"What?\"</p><p>\"The small amount of healing you see on my neck and face is because of you.\"</p><p>She shook her head, grinning like she wasn't about to play along with his joke. \"I'm not a magician, Mr. Wise.\"</p><p>\"No. But you are a vampire. A Pureblooded female vampire. And as such, you have the power to heal me.\"</p><p>Petra stared at him, this powerful, terrifying wreck of a male for a second or two, then turned back to the counter, picked up her paring knife, and began slicing fruit. Apple, pear, another apple.</p><p>\"Did you hear me, Veana?\"</p><p>He needed to stop calling her that. \"I heard you.\"</p><p>\"And yet you are not responding.\"</p><p>\"This is how I respond to insanity.\"</p><p>\"Cutting up fruit.\"</p><p>\"That's right.\"</p><p>He released a weighty breath and came over to stand on the opposite side of the counter.</p><p>\"Brave male, getting this close to my blade,\" she remarked, glancing up, a nervous energy crackling in her blood.</p><p>He didn't respond. Instead he glared at the cutting board. \"Do you eat that?\" he asked with distaste in his tone. \"Food that drops from a tree? Food an animal would eat?\"</p><p>\"If I want to stay alive, yes.\"</p><p>He lifted his gaze. Dark as the night, and deeply intense. \"But you aren't alive, Petra. Well, not in the way you think or believe.\"</p><p>His words cut through her well-constructed protective exterior. The one she'd built over her twenty-four years. It wasn't as though she didn't know she was different or that she didn't desire answers about who and what she was. She did. More than anything. But this male didn't seem to genuinely care about offering her that information. He seemed to be baiting her, tossing out little blasts of non-specific information he knew would shock her. Even if he claimed he was telling her the truth-that he absolutely knew what she was-how could she trust him?</p><p>She would find out what she was, but not this way.</p><p>She tore her gaze from his intimidating face with its painful burn scars and haunting eyes and pointed her knife at the door. \"You can leave now.\"</p><p>He sniffed with derision. \"That's the last thing you want me to do, Love.\"</p><p>To make her point, she turned the blade on him.</p><p>His brows lifted. \"Hotheaded, emotional, brave; your doctor is one fortunate bloke.\"</p><p>She couldn't tell if he was serious or not, but she refused to bite. \"I have work to do. If you still want to chat about what you believe my true species to be, come back later. Say, in three to four hours.\"</p><p>\"The sun will be up, Petra.\"</p><p>\"Exactly.\"</p><p>\"You saw how that worked out the last time.\"</p><p>\"I did,\" she answered, lowering her blade, her gaze and returning to her fruit. \"And I promise not to interfere again.\"</p><p>But the male was not about to give up. He leaned over the counter. All the way until she felt his breath on her forehead. Her hand stilled, the blade of the knife halfway through a pear.</p><p>\"You want to know who you are,\" he whispered. \"Who you really are.\"</p><p>\"I know who I am,\" she lied.</p><p>\"Really? What is that? Not human unless you have a heartbeat I'm not picking up on. Not a Shifter-as I understand it from Dr. Feelgood, transitions to their animal state happen by twenty-one and you're . . .\"</p><p>Twenty-four.</p><p>As if he knew what worked inside her head, he continued, \"I have more than a name, a species title. I have the truth, the story, the history, the rules-all of it. And I can give it to you.\"</p><p>\"How generous.\" Her eyes lifted.</p><p>\"And in return-\"</p><p>\"Of course.\"</p><p>His mouth curved, but the smile that formed was not a pleasant one. \"In return you will grant me your healing breath, and as much blood as I require to build my strength.\"</p><p>Her knife slipped from her hand and clattered onto the counter.</p><p>He chuckled softly. \"Don't look so shocked, Love. You barely felt my bite earlier, and when you did, the pain was a right good one, eh?\"</p><p>Words seemed to abandon Petra in that moment, both in her mind and on her lips. For the first time that night she felt true fear. Not for Synjon Wise's presence in her office, though she probably should have, but for what he'd just said. The bite, his bite to her skin. It was healed now, too swiftly to be logical, but the pain had been anything but unwelcome.</p><p>Her eyes locked with his and her insides began to defrost.</p><p>He shook his head, his voice dropping to a mere whisper. \"You can't deny to me, Veana. You can't deny yourself.\"</p><p>Petra held her breath, caught in some dreamlike state with him so close, his breath against her face. She didn't trust him, not by a mile. But she couldn't seem to push back this sudden, frantic need trembling inside her. Truth or lies, manipulations or a bargain to agree to, she had to hear what he had to say.</p><p>She licked her dry lips, found her voice. \"They're looking for you,\" she told him. \"My family.\"</p><p>\"Let them look.\" He couldn't have appeared less concerned.</p><p>\"They'll come to my office door again. My brothers, Brodan . . .\"</p><p>His chin dropped, making his eyes so dark and fearsome, she gasped. \"I can be a ghost when I need to be.\"</p><p>\"I won't allow you to hurt them,\" she warned.</p><p>\"The doctor is not my target. And your brothers can take care of themselves.\"</p><p>\"Did they give you a pounding?\" She gave a nervous laugh, knowing that Sasha and Valentin must've held their own with this male.</p><p>\"Let's just say it was a mutual blood sport. I have much respect for your brothers' skill.\" He cocked an eyebrow. \"But I won't be held back if anyone takes a swing at me.\"</p><p>She sobered. She knew he wasn't playing around with that threat.</p><p>\"So, we have a bargain, Veana? The history of our species for a pint or two of your blood?\"</p><p>She couldn't believe she was agreeing to this. It was impetuous behavior, madness, and yet her curiosity-a lifetime of questions without answers-nudged her forward.</p><p>She nodded. \"It's a bargain. But I want to hear your information first.\"</p><p>He leaned in another inch, his dark eyes electrifying. \"You're going to make me remain this way, hideous and in pain?\"</p><p>She swallowed thickly, tried to force her insides to calm. He was so damn close. \"You attacked me and my brother. You broke into my house.\"</p><p>His eyes glittered. \"Then think of it as a gift for yourself. Do you really want to look at this face any longer than you have to?\"</p><p>She wasn't sure what made her do it, but the impulsive move couldn't be stopped. She reached out and touched his face, his cheek. The skin was warm and rough under her fingers. She knew she should pull away, but she didn't.</p><p>She lifted her gaze to his and whispered, \"I don't think it's so bad.\"</p><p>Synjon Wise's brows drew together, and his eyes darkened with wariness. \"You are a strange veana, Petra,\" he said as he eased back away from her, and away from her touch. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He'd told her all about morpho and Meta, he'd told her about the credentis, he'd talked of his years in the military-and finally he'd told her his age.</p><p>\"One hundred and eighty?\" she exclaimed.</p><p>Synjon nodded. Across the small dining table, candles burning down to low flames, Petra sat with her arms folded on the table, her head jutting forward as if she was afraid she'd miss something. Her black hair spilled over her arms and her pale blue eyes glinted with feverish interest.</p><p>\"How long can you live?\" she asked.</p> <p>\"We,\" he corrected, \"can live forever.\" He shrugged, amending, \"If the blood continues to flow and we . . .\"</p><p>She inched forward in her seat. \"What?\"</p><p>The events of a week ago pushed once again through his mind, and his unbeating heart. \"Remain out of the sun. Though females can survive it, the sun is a morphed male's enemy.\"</p><p>Her eyes softened. \"Is it your only enemy?\"</p><p>\"No.\" Cruen's face flashed inside his head, made his blood burn in his veins. There were many enemies within their breed.</p> <p>\"The woman,\" she began, \"the one you carried so gently, the one you so desperately wanted to give your life for-\"</p><p>\"Do not speak of her,\" Synjon warned coolly.</p><p>\"She was a vampire?\"</p><p>\"Yes,\" he ground out.</p><p>She bit her lip. \"How did she die?\"</p><p>A low growl rumbled in Syn's chest and his eyes narrowed on the veana before him. \"I told you not to speak of her.\"</p> <p>\"I know,\" she said quickly, her eyes not meeting his. \"I'm sorry. This is hard, I understand, but I have to know. It wasn't the sun? You said the sun can't hurt females.\"</p><p>The anger that surged through him in that moment concerned him. It felt reckless, and was fusing with his painful hunger-urging him to reach across the table and bite the veana. For her blood and her silence.</p><p>\"It is time for your end of the bargain, Petra,\" he growled.</p><p>His fiercely uttered words seemed to snap her out of the one-track-questions race she'd been on for the past hour. \"My blood?\"</p><p>Was he wrong or did he actually see a flash of interest, of excitement, cross her wide-eyed gaze? \"Yes,\" he answered. \"I need your blood. You have no idea how much. But first, I need your breath.\"</p><p>\"Am I doing this right?\"</p><p>\"Stop talking. We'll know in a moment.\"</p><p>They were seated on the floor, Petra on her knees. She had lit more candles, wanted to make sure she saw everything, was aware of everything. She was really nervous, wondering what she was doing, and if she could somehow screw it up. The idea sounded insane; blowing one's breath on another to heal them. Could she truly have the kind of power he was suggesting? Or was this some kind of attempt at manipulation or embarrassment before the real deal commenced?</p> <p>The drinking of her blood.</p><p>\"I can feel your timidity, Petra.\" He opened his eyes. They were the color of wet bark and they implored her. \"For this to work, you must be confident.\"</p><p>\"That's the problem,\" she said. \"Confidence about something I've never done before, can't imagine will work, and-\"</p><p>\"Stop talking.\"</p><p>\"Fine,\" she grumbled.</p><p>\"Just focus. You have this power. I swear it to you.\"</p><p>\"That would be great if I actually trusted you.\"</p><p>He reached out and gripped her shoulders. \"Bloody hell, Veana. I'm not asking you to trust me. I'm asking you to trust yourself.\"</p><p>She stilled. Her breath catching in her lungs, she looked at him. His ravaged skin, his intense gaze, his mouth . . . Gods, how had this happened? How had she been the one near the caves that day, seen him carry the female? Why was she the one to pull him from the blistering sun? This male with no heartbeat. Who claimed he was a vampire, who swore she was one too. She took a deep breath. Was it the truth?</p><p>Was it her truth?</p><p>And if so, when did it kick in?</p><p>\"Petra.\"</p><p>His voice, his command, pulled her back into the moment. If she did this and it worked, she would have her answer, wouldn't she? What the hell?</p><p>\"Okay.\" She closed her eyes and for a moment just drew on her belief in herself and her strength. Then she pursed her lips and released her breath.</p><p>She heard nothing but her exhale.</p><p>\"Again,\" he said tightly.</p><p>Her blood rushing in her veins, she focused deeper, her mind connecting with her will. She inhaled and blew her warm breath against his face. This time, Synjon said nothing. This time, after ten seconds or so, he sighed. Actually sighed. No pain accompanied the sound. Just an easy sigh of relief.</p><p>She dared to open one eye, see if in truth her breath had actually done anything at all. Through the strange field of view, she saw that his right cheek was . . . Her muscles tensed, she opened her other eye.</p><p>\"Amazing,\" she breathed.</p><p>He touched his face. One small section, the section that had felt her breath, was completely healed. His eyes flipped up and he grinned. \"Yes, you are, Love.\"</p><p>She just stared at him, shock barreling through her. How was it possible? If he was right about this-- If this was true, then . . .</p><p>\"Continue, Veana,\" he demanded, cutting through her thoughts with an almost playful growl.</p><p>Her eyes cut to his and she gave him a slow grin. \"Please.\"</p><p>\"I don't say please.\"</p><p>\"I'm not surprised. You have very poor manners.\"</p><p>\"Continue, Veana,\" he said, then muttered something under his breath that sounded a lot like, \"Please.\"</p><p>Brimming with sudden and intense confidence, she cupped her ear. \"I'm sorry. What was that?\"</p><p>His lip curled with annoyance. \"Just do it already.\"</p><p>She didn't move.</p><p>\"You like truth, facts about our species, yes?\" he said through gritted teeth.</p><p>\"Yes.\"</p><p>\"Well, then, here is another. Healing a paven, a Pureblood male, is a veana's pleasure.\"</p><p>She thought about this for a moment, then shrugged. \"Pleasure or no, I'm sure these veanas would require the barest of manners. A please and a thank you.\" She lifted her chin. \"It's common courtesy, Mr. Wise.\"</p><p>Synjon looked away, trying to keep his temper under control. Even with the burns on his face, he was a formidable male, ruggedly handsome, sexually interesting. Petra had never truly thought of a male that way. Kind, yes. Strong, yes. Reliable, intelligent, honest, handsome-yes.</p><p>But sexually interesting, no.</p><p>When he turned back to face her, his eyes blazed with heat. He crooked his finger at her until she leaned back toward him. Then he followed suit until they were just a few inches apart. His lips parted and Petra's gaze dropped.</p><p>\"Please,\" he whispered. \"Blow me, Veana.\"</p><p>The words meant nothing to her in that moment, but the sensual purr in his throat was crystal clear, and it reached inside her chest, grabbed the muscle that refused to beat and for just one brush of a second set it aflame with life.</p><p>She swallowed hard and pretended she wasn't affected.</p><p>Then, she gave him a very pleased, innocent smile. \"See. That wasn't so hard, was it?\"</p><p>For a moment, he looked confused, then a slow wash of understanding, and of self-disgust moved over his face. His nostrils flared and he nearly snarled at her. \"Close your eyes, resume your work. Let's get this done.\"</p><p>Petra was no fool. She knew exactly where his mind had gone. He'd forgotten for a moment about the female. He'd allowed himself to relax, to play. She wouldn't try to reason with him. It was not her business. Right now, she needed to complete their bargain.</p><p>With infinitely more confidence, and eyes open and watchful, Petra inhaled again and blew. Everything moved more quickly this time. As his skin changed and healed, Petra switched to another section until his entire face was free of burns and blisters. It was truly awesome, this power she possessed. She didn't know what to think of it, how to proceed, but the truth was, her world had just opened up.</p><p>Her eyes pinned to his face, she finished her work, used her healing breath on his neck.</p><p>\"Mr. Wise?\"</p><p>Her voice drew his attention and he opened his eyes. Petra nearly gasped. The bark-brown color of his irises now glowed with rich, sensual gold. She couldn't turn away, her skin prickled and hummed. She'd never seen anything like it, like him.</p><p>She cleared her throat and pushed out her query. \"Is the pain gone?\"</p><p>His gaze moved over her face, and she wondered if he was deciding how to answer.</p><p>\"The burns, I mean,\" she amended, almost nervously. \"I know the pain of losing-\"</p><p>\"Petra-\"</p><p>\"If you wanted to talk about it, you could, that's all I'm saying.\"</p><p>\"Petra, please.\" His lips thinned. \"And again, I'm saying please. What happened out there near the caves is my own. It will never be discussed here.\"</p><p>\"Okay, but sometimes it helps.\"</p><p>\"That is an innocent's perspective.\"</p><p>\"And that is a cynic's response.\"</p><p>He sighed, his teeth clenched as he glanced past her to the windows. \"Bloody hell. I never thought I'd be pleased to see the impending emergence of the sun.\" He turned back to face her. \"Since we can't seem to finish this . . . whatever it is-\"</p><p>\"Bargain,\" she finished for him.</p><p>\"I'm going to need somewhere to hold out.\"</p><p>She stood up. \"Come on. The bathroom is the darkest and most shaded room in the treehouse.\"</p><p>She'd never seen anyone look so insulted. She started to laugh. \"What?\"</p><p>His nostrils flared. \"I am to nod off in the toilet?\"</p><p>\"It's a very nice bathroom,\" she assured him, not able to control her grin. \"I designed it myself.\"</p><p>\"I could try to flash before the sun comes up.\" He growled. \"But I think I'm too fecking weak to risk it.\" He got to his feet and followed her. \"I will remain in your loo if I must, Veana, but I won't wait all day for blood. I want you now.\"</p><p>She whirled around inside the arch of the bathroom door, her skin humming with his words. \"Perhaps you would like to rephrase that, Mr. Wise.\"</p><p>He came to stand before her, his gaze taking full command of hers. Petra saw hunger and curiosity burning there, but it was the strain of grief that truly tugged at the muscles in her chest. He was thinking of her. The female he'd brought to the rainforest. Did he feel guilty for being with Petra now, standing here before her, wanting her blood, and maybe something more?</p><p>And if he did, Petra thought, her eyes searching his for answers, for a mutual understanding of this attraction she felt, would that guilt send him away the minute he had what he wanted?</p><p>She mentally shook her head. Wasn't that exactly what should happen? Wasn't that what she wanted as well?</p><p>The knock at the front door stunned them both, and they jerked their heads toward it.</p><p>Synjon dropped into a predatory, fighting stance, a low growl sounding in his throat.</p><p>Petra made an attempt to shove him into the bathroom. \"Get in there.\" But it was like trying to move a boulder.</p><p>His eyes flashed with fierce, hungry heat. The kind that usually led to fists connecting with faces. \"Are you sure you don't want me to answer the door for you?\"</p><p>The knocking grew louder and more insistent.</p><p>Petra glanced at the door, then back at him. She hissed, \"You want blood, Mr. Wise?\"</p><p>He sniffed at the thinly veiled threat. \"All right. I'll disappear into the loo. But it would be a grave mistake to forget about me.\"</p><p>Petra didn't answer him, just closed the bathroom door the very second he stepped back.</p><p>Forget him?</p><p>Was he kidding? How could she forget him? She was actually going to let this male bite her again, let him remove, drink, and consume blood from her body. As she headed for the front door and whatever stood behind it, a strange and unexpected rush of heat overtook the nerves inside of her. If she wasn't mistaken, though her mind cringed at the idea of feeding her blood to the dangerously handsome Synjon Wise, her body was more than just able and ready.</p><p>It was willing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was bullocks.</p><p>Synjon stood in the very same spot he'd occupied when the veana had left him ten minutes ago. Inches from the bloody door. But now, he leaned against it, listening as Doctor Forgive and Fuck Me refused to get a clue and leave. If this kept on, Synjon wasn't sure he could follow through on his promise to remain hidden. Though his face and neck were healed, his gut ached with hunger. If he didn't feed soon, he would start to grow feral.</p><p>His head dropped against the wood as he heard the veana speak again.</p><p>\"Thank you for the food, Brodan, but I'm pretty well stocked.\"</p> <p>\"Shit, I'm so sorry, Petra.\"</p><p>\"For what?\"</p><p>His voice drew nearer to the bathroom, his footfall heavy. \"I don't know how he got away.\"</p><p>\"It's not your fault.\"</p><p>\"I should've stayed at the clinic, watched him until he woke up. I thought I could go home for a few hours, shower, change clothes-\"</p> <p>Petra interrupted. \"Seriously, Brodan. It was impossible to predict.\"</p><p>Yes, seriously, Brodan, Synjon thought with irritation. Give it a rest already, you stupid gatecrashing git.</p><p>\"I don't like you being here on your own,\" the doctor said.</p><p>\"I'm always here by myself. Nothing new, nothing to worry about.\"</p><p>\"Not while that thing is on the loose.\"</p><p>Thing. Synjon's upper lip twitched and his fangs started to descend. If anyone in this place is a thing . . .</p> <p>\"The family doesn't want me at the house in case he returns,\" Petra responded quickly. \"This is the perfect hideout. I have everything I need.\"</p><p>\"Come home with me, Pets. He'll never follow you there, and if he did I can take care of it.\"</p><p>Bloody hell. Just tell her you want to shag her and let's be done with this.</p><p>\"I appreciate it,\" Petra said. \"I really do, Brodan. But I'm good here.\"</p><p>\"Then I'll stay with you. A little company, a little protection.\"</p><p>A scream of hunger assaulted Syn's gut and he groaned.</p><p>Cut that off, Veana. Cut that off now before I have to do it.</p><p>\"I don't need protection, Brodan,\" she said with growing seriousness. \"I have a ton of work to do. I have all the supplies I need.\" She lowered her voice, but Syn could still hear her. \"This is not how we should have our first outing.\"</p> <p>\"No,\" he replied in a husky tone. \"It will be outside, near the waterfall.\" He chuckled. \"I have it all planned, you see.\"</p><p>Synjon growled low in his throat. The hunger was starting to make him insane, make him possessive over his food.</p><p>\"All right, Pets,\" Brodan continued. \"I know better than to push you. But I'm coming back to check on you.\"</p><p>Brilliant, mate. Now, get the hell out.</p><p>Synjon picked up on some final departing words, then the welcome sound of the front door closing. He was nearly panting when the bathroom door opened with a flourish.</p><p>\"I assume you heard everything,\" she said.</p><p>\"The chat between you and your boyfriend? Afraid so.\"</p><p>Her cheeks went pink. Or maybe they were flushed before she came into the bathroom. He didn't like it either way.</p><p>\"Brodan and I aren't mates.\"</p><p>\"Yet,\" Syn finished, nostrils flaring as he took in her scent. \"But he wants it pretty damn bad.\"</p><p>She shrugged nonchalantly. \"Perhaps that's a good thing then. After all, he is a well respected male; strong, smart, kind.\"</p><p>\"Polite.\"</p><p>\"Yes,\" she agreed, walking toward him, stopping when they were only a few inches apart. \"It's an attractive quality in a male.\"</p><p>He grunted. \"Pleases and thank yous.\"</p><p>\"Of course.\"</p><p>\"Never take without asking.\"</p><p>\"Exactly.\"</p><p>\"Sounds like a recipe for a ruddy dull life.\"</p><p>\"Not to me.\"</p><p>\"Too bad, Petra.\" He studied her face, her stunning, mysterious, and stubborn face. In another lifetime, he might've gone arse-over-tit for someone like her. She was the kind to make a bloke forget.</p><p>But he wasn't in the business of forgetting.</p><p>\"For our final tutorial,\" he said, his eyes connecting with hers. \"You must know that no true Pureblood vampire male will ever ask you for a kiss. If he wants it, he'll take it.\"</p><p>\"Is that right?\"</p><p>\"Indeed. And afterward, it will be you who offers the overly polite, 'thank you.'\"</p><p>\"You're arrogant as shit, you know that?\"</p><p>\"Yes.\"</p><p>\"And barbaric.\"</p><p>\"Welcome to your world, Veana.\"</p><p>She stared at him, nostrils flaring. \"Well, I don't think I want it.\"</p><p>\"You're lying.\"</p><p>\"No, I'm not.\"</p><p>He cocked his head and stared at her neck. \"I see your vein pulsing as I speak, Love. I see your eyes dilating. Your mind may be trying to convince you otherwise, but the desire to submit is written all over your face.\" He leaned in, nostrils flaring, and sniffed. \"And I'm willing to bet if you were stripped bare right now, a male would find that desire displayed in other areas on your person as well.\"</p><p>She looked stunned and livid and shit, aroused. What was he doing? Christ, what the hell was he doing? This was about hunger, not desire. This was about caring for his body, not punishing it.</p><p>\"Petra . . .\" he began, but she cut him off.</p><p>Closing the space between them, she practically growled at him. \"I may live among Shifters,\" she said menacingly, her eyes flaring with ire and heat and confusion, \"but you are the true animal.\"</p><p>His mind died in that moment, as did his soul. She was near and he was starved. For blood, for heat . . . for the feel of a female's skin . . .</p><p>He slid an arm around her waist and pulled her against him. Crikey, her body fit his far too well. His breath came out in a rush, and he took her mouth like he wanted to take her blood. Tears behind his eyes, caught in his throat and his chest, he forced every thought out of his head, every memory from his unbeating heart-and every shred of decency he had left, and just kissed her. She tasted sweet and perfect, and her lips were warm and soft. She responded instantly to him, wrapping her arms around his neck and returning his passionate assault as if she too wanted to release some great heaviness of shame and guilt. With a moan of pleasure, he ran his tongue over her top lip, and when she met him with her own wet heat, he felt his cock stir.</p><p>Fuck.</p><p>Bloody hell.</p><p>He eased back until she was forced to release him. For several long seconds, they stared at one another, breathing heavy, skin flushed with desire. Syn had no idea what was going on in her head, but what was going on in his was brutal. He was a cock-up, a prat, a rogue, and a rat bastard. He deserved to be strung up by his fangs for touching another female.</p><p>\"I'm famished,\" he said in lieu of an excuse or an apology. \"In pain. I need your blood now before I lose what little control I have left.\"</p><p>Her skin was pink and the scent of her arousal in the air couldn't be missed by either one of them, and yet she nodded and stepped back. \"Will it hurt? Will I be weak afterward?\"</p><p>\"There is a moment of pain, as you felt in the clinic. But it doesn't last.\" He went over to the wood bathtub and sat down, rested his back against the side. \"You may feel tired afterward, or you may feel energized. I'm not sure how your body will react.\"</p><p>\"I'm nervous.\"</p><p>\"But you're willing?\" He wasn't about to fight her for it. Shite, right now he was out of fight.</p><p>Without a word, she came to sit beside him. And after several deep breaths, she lifted her chin and offered him her wrist.</p><p>Synjon didn't say anything more. Frankly, he was so amped up, heavy with desire, and ravenous with hunger, whatever came out of his mouth at this point would probably be grunts and groans. So he gave in to his true and honest need and became a Pureblood vampire paven.</p><p>He brought her wrist to his lips, and within the space of a breath, his fangs plunged into her vein.</p><p>The rush of heat, pain and undeniable pleasure moving through Petra was mind-boggling. At first, when his fangs had entered her skin, pricked her vein, she'd wanted to pull away, rescind their bargain and get the hell out of the bathroom. But in seconds the fear, the strangeness of the act fell away and she was left with a feeling she could only describe as pre-orgasmic.</p><p>Panting slightly, she watched him, his dark head coiled over her wrist, his body moving to the rhythm of his suckle. With every pull, she felt him inside her. With every swallow, her mind conjured images of his mouth on hers again.</p><p>Sweat broke out on her forehead and she leaned against his shoulder. His hand instantly reached for her, grabbing her thigh and squeezing. Below her waist, heat surged and the small heartbeat hidden inside her clit swelled. She'd never felt anything like it, and a moan escaped her lips.</p><p>As his fingers clenched and unclenched like a feline's claws against her skin, she fought the swirling desire inside of her. But it was impossible to control. She was incredibly turned on. Every goddamn inch of her. Her mouth was dry, her nipples were hard, her sex was wet, and her mind was begging for him to slide his hand from her thigh up to where she ached.</p><p>\"Oh, Synjon,\" she whispered almost desperately, her head starting to pound. \"Please . . .\"</p><p>Gods, what was she asking? What was wrong with her?</p><p>In front of her eyes, spots formed. She blinked rapidly, licked her lips and swallowed. She couldn't feel her limbs, her face . . .</p><p>\"Please,\" she uttered. \"Don't. Stop. Please. I can't . . . breathe.\"</p><p>Suddenly, the room faded of all color, and just as the male pulled from her vein, she lost consciousness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Shite. Oh, bullocks.\" He'd caught her just as she was heading for the floor.</p><p>Panic lunged within Syn as he stared down at her, limp and unconscious in his arms, her lashes so dark against her pale cheeks. What had he done? Had he taken too much blood? Too fast?</p><p>He placed her down on the bamboo floor as gently as he could manage, then bolted to his feet. His mind shook with fearful thoughts. He wasn't losing another veana. He reached for the faucet on the tub and cranked the water all the way to cold. This was going to feel like utter rubbish for the both of them, but it was the only way he knew to revive her quickly.</p><p>Returning to her side, he stripped off her clothing and lifted her into his arms. The energy, the heat, the strength inside of him from her rich, pure blood made it feel as though he were carrying little more than a butterfly.</p> <p>Still dressed, he climbed into the tub and lay down. He didn't give a shite about his own clothing, didn't give a shite about anything but waking her, seeing her eyes and hearing her voice.</p><p>Gods, that voice. It had carried him through near death, brought him back to life.</p><p>The smooth wooden bath was hardly big enough to fit his body, but he managed, placing her on top of his chest, so she faced the ceiling.</p><p>The frigid water claimed him like a sponge, but he hardly felt it. He was too considered for Petra. She too was immersed in the water, but she didn't wake. Christ, she didn't even stir.</p><p>What had he done?</p> <p>His breathing quick and panicked, he started splashing her with the cold water. Over her chest, her belly . . . her face. Come bloody on, damn you. Her skin beaded, turned even paler, yet she still didn't wake. He switched tactics. Easing out from under her, he placed her entire body in the water.</p><p>\"Come on, Veana,\" he begged, gutted. \"Fuck!\"</p><p>Only her face hovered above the surface. Eyes wide, fear gripping every inch of him, he prayed. She looked so still. Her lips were turning blue.</p><p>\"I can't lose you too,\" he moaned, his hands in the water as he rubbed at her arms, her neck, throat.</p><p>And then it happened. One moment she was as still as death and the next she was gripping his wrist and coming awake with a splutter. Her eyes slammed open and she gasped. Thrashing around, not sure where she was or why, she started to panic. Synjon yanked her up, into his arms and pulled her out of the frigid tub so fast he surprised himself.</p><p>He had a large white towel wrapped around her body and was on the floor, easing her into his lap before she could say anything.</p> <p>\"Synjon?\" she rasped.</p><p>Shite. She was alive. In his arms. Her eyes open.</p><p>He rocked her back and forth like he'd lost his mind. And maybe he had. \"You all right? You all right, Love?\"</p><p>\"I think so.\" She pressed herself tight against his chest, her soft cheek cold against his skin. \"What happened?\"</p><p>\"You passed out. I'm so sorry, Petra.\"</p><p>\"It's okay.\"</p><p>The hell is was. He was a fucking animal, an animal with no self control. Her blood had been like a drug to his system. Even now, if he could get to it he'd take it.</p><p>He needed to bugger off. Now and for good. She wasn't safe with him around. No female was.</p> <p>\"I'm so cold, Syn,\" she whispered, burying her face in his chest, rubbing her face back and forth against one pectoral.</p><p>His blasted cock stirred. Teeth gritted, he started to get up. \"I'll take you to your bed. Get every bloody blanket on top of you.\"</p><p>\"No!\" She looked up, her eyes wide and concerned. \"The sun is high right now. It comes in through the windows like a bitch.\"</p><p>\"I don't care.\"</p><p>\"I do,\" she whispered passionately, her gaze traveling from his lips to his eyes. She shivered again and pressed herself closer.</p><p>This was wrong and torturous. He couldn't have her starkers and curled against him for much longer and continue to stay sane.</p><p>She reached up and touched his face, her palm on his cheek. \"I want to stay here. With you.\"</p><p>Synjon released the breath held captive inside his lungs. \"Petra . . . Pets . . .\" The way she was looking at him, her eyes heavy with relief and gratitude and desire, it slayed him. It wasn't a look of sexual desire-though if he searched deep enough in those pale blue orbs he knew he might find that too-but a look of desire for him-the male, the paven. She trusted him, wanted him, needed him near her to protect her and comfort her. His chest squeezed. It was so bloody honest and raw, that look. Vulnerable as shite. And he never wanted her to stop, to look away.</p><p>But she did.</p><p>Her gaze dropped to his mouth and she ran her thumb over his upper lip, catching the tips of his fangs in the process.</p><p>His growl reverberated off the walls of the dimly lit, forest-fragrant room and he forgot everything right and real. The fantasy before him beckoned and he could not deny himself. In a series of quick and possessive movements, he rolled her to her back, slid his body over hers, and took what he was truly hungry for.</p><p>Petra had never wanted anything more than Synjon Wise buried inside of her. She was totally and utterly inexperienced with mating, but as she wrapped her arms around his neck and she kissed him hard and with a deep and abiding need, she understood that being with a male-the right male-wasn't about experience.</p><p>It was about connection.</p><p>Even if that connection only lasted for a short time.</p><p>The weight of him, the sweet weight of him, made the icy cold from a moment ago disappear and she wrapped her legs around his waist and squeezed. His clothes were wet, but they heated on his body. And gods, what a body. Every inch of him that she could see, feel, or touch was powerful muscle under smooth skin.</p><p>She wanted to see him.</p><p>No, she wanted to feel him. Naked against her.</p><p>As he licked and nibbled at her lower lip, making hungry, sexual sounds she would remember and dream about for years to come, she managed to wriggle out of her towel and cast it aside.</p><p>\"I want to feel you,\" she whispered against his lips, pulling at the bottom of his shirt. \"Make me warm, Synjon. Inside and out.\"</p><p>He lifted his head and growled at her-a sound she felt all the way to her sex-then yanked the material over his head and tossed it against the side of the tub. He did the same with his pants, then moved over her.</p><p>Petra instantly wrapped her legs around him again, sucked air through her teeth when she felt him hard and long and thick against her belly.</p><p>Her pussy shuddered with anticipation.</p><p>She wanted him inside her. Now. Deep. Pounding away until she could barely breathe, maybe until she passed out again.</p><p>\"Your skin,\" he uttered, his voice sexy and heavy with lust as he ran his hands up the sides of her ribs, his thumbs grazing the plump flesh of her breasts. \"You turned hot, Petra. For me, you're so fucking hot.\"</p><p>He dipped his head and nuzzled his face and his nose against one of her nipples. The combination of his movement, his hungry moans, and the warm curl of his breath on her skin, made her writhe and wriggle beneath him; her pussy looking for a way to get the head of his cock inside her.</p><p>But the vampire wasn't giving her what she craved. Not yet. Instead he was going to give her what would make her crazed, make her beg, make her mind dissolve.</p><p>With his nose he flicked one taut nipple, then caught it with his mouth. He drew on the bud, suckling hard until Petra screamed with desperation, feeling his sweet torture all the way down her belly, between her legs, and up inside her sex.</p><p>\"Please, Syn,\" she begged, her mind lost, her body completely his. \"I need you. I've never needed anything more.\"</p><p>\"Oh, Love,\" he breathed, switching to the other breast, laved, nipping at her other nipple. \"If I start this, if I get inside you, I won't be able to stop.\"</p><p>\"Damn right you won't!\" She thrust her hips against him, pumped against his rock-hard cock until he growled. \"I don't want you to stop. Now, please. My body's on fire.\"</p><p>In one incredible movement of skill and intensity, Synjon drew his entire body down to her belly, found her clit with his fingers, then surged upward until the thick head of his cock hovered at the entrance to her sex.</p><p>His weight on one elbow, his eyes on her, his thumb slowly stroking her clit, he entered her with one delicious thrust.</p><p>Petra cried out, her legs squeezing his waist as she gulped in air, as her pussy stretched to accommodate him. He was so big, so thick, and she was so tight. She gripped the meaty flesh of his backside and pumped against him.</p><p>Synjon groaned and started moving inside her. \"You're so tight, Petra.\"</p><p>\"It's perfect,\" she uttered, circling her hips slowly. \"You're perfect. Don't stop, don't slow down. Just fuck me hard, Synjon. Fuck me until neither one of us can breathe.\"</p><p>He dropped his head and nuzzled the sweet spot between her shoulder and neck, let his fangs graze her skin as his fingers worked her ever-swelling clit and his cock thrust deep inside of her.</p><p>Petra moaned, the wet heat of her body screaming for release. She couldn't stop herself now, couldn't slow her impending climax. And she didn't want to. Madness took her, stole her thoughts, feelings, and emotions and allowed her to be one raw nerve surrounded by a blazing hot sun.</p><p>Synjon could no doubt feel her clenching around him and though he quickened his touch, he gentled it too. He was going to draw out her climax, keep her crying, moaning, begging for seconds upon seconds until she had nothing left.</p><p>\"Synjon!!!\"</p><p>Her scream was deafening, and as her insides shattered and her outsides writhed and arched and gave in, Synjon bit lightly into her flesh, thrust up into her cunt and followed her over the edge into delicious madness. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lying back on the soft floor mat, Synjon refused to think of anything more than what was before him, what was beside him, and what had been beneath him.</p><p>If he did, he'd be utterly lost to madness.</p><p>He covered Petra with the towel, wanting to make sure she kept warm as she snuggled against his side, her head on his chest.</p><p>For several long moments, neither one of the spoke. Outside the bathroom, the day was in full progression. No doubt there would be a knock on the door at any moment, disrupting their little oasis, their scared space where nothing was challenged or explained, justified or forgiven.</p> <p>\"Maybe it's best for both of us,\" she said, breaking the silence, her lips moving against his chest. \"But I don't know if I can forget this, Synjon.\"</p><p>Her words made Syn's gut constrict with too many emotions he refused to look at. He tipped her face up to his, then leaned down and kissed her. Soft at first, his lips moving over hers, brushing. Then stronger, his fangs nipping at her lower lip. \"I don't want to forget this, Petra.\"</p><p>Her eyes implored him. \"What do we do?\"</p><p>He kissed the tip of her nose. \"Do you want to stay here?\"</p><p>\"My family is here.\"</p> <p>\"That doesn't mean you must.\" What was he saying? What was he asking in his sacred space that had no rules of regrets?</p><p>Her gaze warmed and her mouth lifted into a gentle smile.</p><p>\"Come with me when I leave,\" he said impetuously. No regrets. No looking back. \"I'll take you to the credentis. You can see how your kind lives.\"</p><p>Her smile broadened and reached her pale blue eyes. \"I would love to see that.\"</p><p>\"There is so much to show you.\" The fantasy continued inside his head. \"But first, I have I take care of some business. You can stay with my friends, the Romans. They are good pavens and veanas. Their mates will befriend you, tell you all about Meta-\"</p><p>\"Business?\" she repeated, her brow furrowing and her eyes losing a touch of their happy glow. \"You're talking about revenge, aren't you?\"</p> <p>He inhaled deeply. He didn't want to go there, not now. That part of his life had no place in this fantasy. But he implored her. \"It's justice, Petra. And I will have it. I must have it.\"</p><p>She will have it.</p><p>His gut aching, he eased Petra's head to his chest again and pulled her closer. \"Please understand. I must end it, end that bloody bastard to move on. You wouldn't want to know me, be near me, if I didn't.\"</p><p>She was quiet for a moment, her hand brushing back and forth over his chest. \"What if he gets to you first? What if he hurts you?\"</p><p>Synjon sniffed his derision, the bitterness creeping in whether he wanted it to or not. \"Cruen has already hurt me in the worst way imaginable. It is his turn now. His and any kin he may have sired.\"</p><p>Synjon felt her go still against him, and her hand cease its soft caresses against his chest. He brushed her hair away from her shoulder and wondered if he should say anything more or just let her digest what was already given. No doubt she was exhausted. No rest the night before, feeding him her blood, passing out, the ice cold bath-and then their very lively mating.</p><p>Poor veana.</p><p>\"Nothing needs to be decided now, Love,\" he whispered against the top of her head. \"Just close your eyes, and sleep.\"</p> <p>It was a long while before he felt her body relax and her breathing slow.</p><p>He was truly the most beautiful male she had ever seen. And it was going to destroy her to never see him again.</p><p>Tears pricked Petra's eyes as she stared down at Synjon Wise, asleep on her bathroom floor. They had been through so much in such a short time, and she knew that never again would she feel such a connection, such a need, such a desire for anyone.</p><p>But she had to leave him, and the only home she had ever known.</p><p>Before walking out of the room, she gave him one last look, the male who had stolen her unbeating heart, then broke it into a thousand sharp pieces with just one word.</p><p>One terrible revelation.</p><p>Her bags were gathered at the front door and she moved toward them with the speed of a snail. She didn't want to go. Everything inside of her pleaded with her mind, her reason, to reconsider. But she kept walking until her hand curled around the door handle.</p><p>Even if he woke now, he wouldn't be able to go after her. The sun was high in the sky, and he wouldn't harm himself.</p><p>Not for her.</p><p>Quick and quiet, she stepped outside to the porch of her treehouse and closed the door on her home and her life. A few feet away, Dani waited solemnly in her hawk form. They didn't speak, they didn't need to. Her best friend understood her plight and would keep her secret.</p><p>There was only one thing Petra knew about her birth family, and it was the name of her father. It was an unusual name, and she knew it as well as she knew her own. In all her years on this earth, that name had only been used by her mother.</p><p>Until today.</p><p>When the male who slept on her bathroom floor, the male she wanted more than anything, spoke of justice and killing.</p><p>She positioned herself on Dani's back and the hawk kicked off the porch and exploded into the sky.</p><p>She had to find Cruen. She had to find her father before Synjon Wise did. </p> </body></html>"]