["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Never look them in the eye,” Uncle Gerald murmured.</p><p>Grace nodded. He’d calmed down some when they had boarded the plane, enough to offer her a reassuring smile, but now as they landed, he turned pale. Sweat gathered at his hairline. Gripping his cane, he scanned the human currents of the airport as they entered the terminal building. His fingers shook on the pewter wolf’s head handle. She’d seen him take out a couple of men half his age with that cane, but she doubted it would do them any good now.</p><p>He cleared his throat, licking his dry lips. “Never contradict. Never ask questions. Don’t speak until you’re spoken to and then say as little as you can. If you’re in trouble, bow. They consider it below them to strike a bowing servant.”</p><p>Grace nodded again. This was the sixth time he had recited the instructions to her. She realized it calmed him down, like a prayer, but his trembling voice ratcheted her own anxiety until it threatened to burst into an overwhelming panic. The airport, the booming announcements spilling from the speaker, the crush of the crowd, all of it blended into a smudged mess of colours and noises. Her mouth tasted bitter. Deep inside her a small voice protested, “This is just crazy. This can’t be real.”</p> <p>“It will be fine,” Gerald muttered, hoarsely. “It will be fine.”</p><p>They passed the gates into a long hallway. The bag slipped off her shoulder, and Grace pulled it back on. The simple action crested her panic. She stopped. Her heart hammered, a steady heavy pressure pushing on her chest from inside out. A soft dullness clogged her ears. She heard herself breathing.</p><p>Twelve hours ago she woke up four states away, ate her usual breakfast of an egg and a toasted English muffin, and got ready to go to work, just like she had done every day. Then the doorbell rang and Uncle Gerald was on her doorstep with a wild story.</p><p>Grace always knew her family was special. They had power. Small magic - insignificant even - but it was more than ordinary people had, and Grace had realized early on she had to hide it. She knew there were other magic users in the world, because her mother had told her so, but she had never met any of them. She’d thought they were like her, armed with minor powers, and rare.</p><p>According to Gerald, she was wrong. There were many other magic users in the world. Families, whole clans of them. They were dangerous, deadly and capable of terrible things. And one of these clans had their family in bonded service. They could call upon them at any time, and they had done so for years, demanding her mother’s assistance whenever they needed it. Three days ago they requested Grace. Her mother had told her nothing; she simply went in her place. But Clan Dreoch called Gerald. They wanted Grace and only Grace. And so she flew to the Midwest, still dizzy from having her world turned upside down and listening to Gerald’s shaky voice as he told stories of terrible magic.</p> <p>Her instincts screamed to run away, back into the airport filled with people who had no concept of magic. It was just an animal reaction, Grace told herself. The Dreochs had her mother and if she did run, her mother would have to take her place. Grace was twenty-six years old. She knew her responsibilities. She had no doubt her mother wouldn’t survive whatever they demanded, otherwise they wouldn’t have required her presence. Grace knew what she had to do, but her nerves had been rubbed raw, and she simply stood, unable to move, her muscles locked into a rigid knot. She willed her body to obey, but it refused.</p><p>The crowd of people parted. A man stood at the end of the hallway. He seemed too large somehow, too tall, too broad, and emanated power. He loomed, a spot of otherworldly magic among people who stubbornly ignored his existence. She saw him with preternatural clarity, from the ash-blond hair falling to his shoulders to the pale green eyes, brimming with mournful melancholy like the eyes of a Russian icon. His was the face of a brute: powerful, stubborn, aggressive, almost savage in its severity.</p><p>He looked straight at her and in the depths of those green irises she saw an unspoken confirmation: he knew. He knew who she was, why she was here, and, more, if she were to turn around and dash away, he wouldn’t chase her. The choice was hers and he was content to let her decide.</p><p>The flow of people blocked him and she reeled, released from the spell of his eyes.</p><p>Uncle Gerald thrust into her view. “What is it? You have to come now, we can’t keep them waiting, we—”</p><p>She looked at him, suddenly calm. Whatever would be would be. Her family owed a debt. Her mother had been paying it for years, carrying the burden alone. It was her turn. “Uncle,” she said, holding on to her newfound peace.</p> <p>“Yes?”</p><p>“You have to be quiet now. They’re here.”</p><p>He stared at her, stunned. Grace shouldered her bag and walked on.</p><p>They reached the end of the hallway. The man was gone, but Grace didn’t worry about it. She headed to the twin slope of escalators. Behind her Gerald mumbled something to himself. They took the escalator down to the baggage claim.</p><p>“Grace!” The shot laced her ears. She wheeled about and saw her mother on the escalator rising in the opposite direction. Her mother stared at her, a horrified expression stamped on her face.</p><p>“Mom!”</p><p>“Grace! What are you doing here?”</p><p>Mother turned around and clutched the escalator handrail, trying to head down, but two people in grey blocked her. She pushed against them. “Let me through! Gerald, you old fool, what have you done? I’ve lived my life, she hasn’t. She can’t do this. Damn it, let me through!”</p> <p>The escalators dragged them in opposite directions. Grace spun around to run up the moving steps and saw the man with green eyes blocking her way. He towered behind her uncle, immovable like a mountain. Green eyes greeted her again. Power coursed through them and vanished, a sword shown and thrust back into its scabbard. Uncle Gerald turned, saw him and went as white as a sheet.</p><p>They reached the bottom. Three people in grey waited for them, one woman and two men. Grace stepped onto the floor, light-headed as if in a dream.</p><p>“I’ve done . . . I’ve done the best I could,” Gerald muttered. “The best. I—”</p><p>“You’ve done wonderfully,” the woman said. “Nikita will escort you back to your plane.”</p><p>One of the men stepped up and held out his hand, indicating the escalator heading up. “Please.”</p><p>The green-eyed man stepped past them. His gaze paused on Grace’s face. An unspoken command to follow. Grace clenched her teeth. They both knew she would obey, and they both realized she hated it.</p><p>He strode unhurriedly towards the glass doors. Grace matched her stride to his. She supposed she should have bowed and kept her mouth shut until she was spoken to, but she felt too hollow to care. “You robbed me of what might be my last moment with my mother,” Grace said softly.</p><p>“It couldn’t be helped,” he answered, his voice quiet and deep.</p><p>They stepped into sunshine in unison. A black vehicle waited for them, sleek and stylish. The trunk clicked open. Grace deposited her backpack into it. The man held the rear door open for her. Grace took her seat on the leather.</p><p>The man slid next to her, filling the vehicle with his presence. She felt the warmth of his body and the almost imperceptible brush of his magic. That light touch betrayed him. She glimpsed power slumbering inside him, like an enormous bear ready to be roused and enraged in an instant. It sent shivers down her back, and it took all of her will to not wrench the car door open and run for her life. “You’re him.”</p><p>He inclined his head. “Yes.”</p><p>The car pulled away from the kerb, carrying them off. Grace looked out of the window. She had made her choice. She was a servant of Clan Dreoch and there was no turning back.</p><p>The scenery rolled by, scrawny shrubs and flat land, its sparse-ness mirroring her bleak mood. Grace closed her eyes. A whisper of magic tugged on her. It was a polite touch, an equivalent to a bow. She glanced at him. Careful green eyes studied her. “What’s your name?” he asked.</p><p>“Grace.”</p><p>“It’s a lovely name. You may call me Nassar.”</p><p>Or “Master”, she thought and bit the words before they had a chance to escape.</p><p>“How much do you know?” he asked.</p><p>“I know that my family owes your family a debt. One of you can call on one of us at any time and we must obey. If we break our oath, you’ll murder all of us.” She wished she had been told about it sooner, not that it would make any difference at the end.</p><p>His magic brushed her again and she edged away from it.</p><p>“What else?” Nassar asked.</p><p>Say as little as possible. “I know what you are.”</p><p>“What am I?”</p><p>“A revenant.”</p><p>“And what would that be?”</p><p>She looked him in the eye. “A man who died and robbed another of his body so he can continue to live.” The cursed revenant, Gerald had called him. A bodysnatcher. An abomination. Monstrously powerful, clouded in vile magic, a beast more than a man.</p><p>Nassar showed no reaction, but a small ripple in his magic sent her further away from him. She bumped into the door.</p><p>“Any further and you’ll fall out of the car,” he said.</p><p>“Your magic . . . It’s touching me.”</p><p>“If all goes as planned, you and I will have to spend the next few days in close proximity. I need you to become accustomed to my power. Our survival will depend on it.”</p><p>She sensed his magic halt a few inches from her, waiting tentatively. She was a servant; he could force her. At least he permitted her an illusion of free will. Grace swallowed and moved within its reach. His magic brushed her. She winced, expecting his power to mug her, but it simply touched her gently, as if her magic and his held hands.</p><p>“I won’t hurt you,” he said. “I know how people in your family see me. Body thief, aberration, murderer. The Cursed One. What I’m called doesn’t concern me. Neither I nor my family will torture, rape or degrade you in any way. I simply have a specific task I need completed. I need you to want to succeed with me. What would make you want to help me?”</p><p>“Freedom,” she said. “Let my family go, and I’ll do whatever you ask.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He shook his head. “I can’t give you permanent freedom. We need your services too much. But I can offer you a temporary reprieve. If you and I succeed, you can go home and I promise not to call on you and yours for six months.”</p><p>“Ten years.”</p><p>“A year.”</p> <p>“Eight.”</p><p>“Five.” The resolute tone of his voice told her it was his last offer.</p><p>“Deal,” she said softly. “What happens if I fail?”</p><p>“We’ll both die. But, our chances of success will be much better if you stop fearing me.”</p><p>That was certainly true. “I’m not scared of you.”</p> <p>His lips curved slightly. “You’re terrified.”</p><p>She raised her chin. “The sooner we get done, the faster I can go home. What do you need me to do?”</p><p>Nassar reached into his jacket and took out a rolled-up piece of paper. “In our world disputes between the clans are resolved through war or by arbitration.”</p><p>Grace arched her eyebrow. “How many clans are there?”</p><p>“Twelve. We’re now in dispute with Clan Roar. War is bloody, costly and painful for everyone involved and neither of the families can afford it now. We’ve chosen arbitration. The issue is pressing and the dispute will be decided through a game.”</p><p>He unrolled the picture and held it. She would have to move closer to him to see it. Grace sighed and moved another three inches to the right. Their thighs almost touched.</p> <p>Nassar showed her the paper. It was an aerial photograph of a city.</p><p>“Milligan City,” Nassar said. “Squarely in the middle of the rust belt. A couple of decades ago it was a busy town, a blue-collar haven. Good life, family values.”</p><p>“Defined future,” she said.</p><p>He nodded. “Yes. Then the conglomerates shifted their operations overseas. The jobs dried up, the real-estate values plummeted, and the residents fled. Now Milligan’s population is down 42 per cent. It’s a ghost city, with all the requisite ghost city problems: abandoned houses, squatters, fires and so on.” He tapped the paper. “This particular neighbourhood is completely deserted. The city council’s getting desperate. They relocated the last of the stragglers to the centre of the city and condemned this neighbourhood. In nine days, it will be bulldozed to make way for a park. The arbitration will take place here.”</p><p>“When I think of arbitration, I think of lawyers,” Grace said. “Both sides present their case and argue to a third party.”</p><p>“Unfortunately this case isn’t something that can be settled through litigation,” Nassar answered. “Think of it in this way: instead of having a large war, we decided to have a very small one. The rules are simple. This area of the city was warded off from the rest, hidden in the cocoon of magic and altered. It’s been officially condemned, so no others are allowed near it. Those who try are firmly discouraged, but if someone does make it through, to their eyes the area will appear as it always was.”</p><p>She chewed on that “others”. Normal, non-magical people. He said it in the way one might refer to foreigners.</p><p>“Arbitration by game is a big event. By last count, representatives often clans have shown up for the fun. Two weeks were allowed to each clan who so wished to dump whatever hazards they could manage into this space. It’s full of things that go bump in the night.”</p> <p>“The other clans don’t like you,” she said.</p><p>“None of the clans like each other. We compete for territory and business. We have wars and bloody battles. And it will be up to you and me to help us avoid such a war this time.” He touched the photograph. “Somewhere in the zone the arbitraries have hidden a small flag. Two teams will enter the game zone to retrieve the flag, while the rest of the clansmen will bet on the outcome and enjoy their popcorn. Whoever touches the flag first will win and be ported out of the zone. Whether the flag is retrieved or not, in three days’ time the wards will constrict, sweeping anything magic from the area into its centre. The pyromancers will destroy it in a preternaturally hot bonfire, while the locals blissfully sleep.”</p><p>“Are we one of the teams?”</p><p>“Yes.”</p><p>Now she understood. Mother was almost fifty and overweight. She wouldn’t be able to move fast enough. They needed someone younger and she fitted the bill. “Will the rival team try to kill us?”</p><p>Another light smile touched his lips. “Most definitely.”</p><p>“I don’t have any offensive magic.”</p><p>“I’m sure,” he said. “You’re entirely too polite for that.”</p><p>It took her a moment to catch the pun. “I’m a dud. I sense magic and I can do small insignificant things, but I can’t foretell the future like my mother and I haven’t been trained as a fighter like Gerald. For all practical purposes, I’m the ‘other’, a completely ordinary person. I’ve never fired a gun, I’m not exceptionally athletic, and my strength and reflexes are average.”</p><p>“I understand.”</p><p>“Then why do you need—” Magic stabbed her, cold and sharp, wrenching a startled gasp from her. Her eyes watered from pain.</p><p>“Lilian!” Nassar barked.</p><p>“Go!” The chauffeur mashed a square button on her dashboard.</p><p>The roof of the vehicle slid aside. A dark sheath coated Nassar.</p><p>The pain pierced Grace’s ribs, slicing its way inside.</p><p>Nassar jerked her to him. She collided with the hard wall of his chest, unable to breathe.</p><p>The dark sheath flared from him, filling the vehicle in long protrusions, shaping into a multitude of pale feathers.</p><p>“Hold on,” Nassar snarled.</p><p>Grace threw her arms around his neck and they shot straight up, into the sky. Wind rushed at her. The pain vanished. She looked down and almost screamed — the car was far below.</p><p>“Don’t panic.”</p><p>The flesh of Nassar’s neck crawled under her fingers, growing thicker. She turned to him and saw a sea of feathers and, high above, huge raptor jaws armed with crocodile teeth. Her arms shook with the strain of her dead weight.</p><p>“It’s OK,” the monster reassured her in Nassar’s voice.</p><p>Her hold gave. For a precious second, Grace clung to the feathers, but her fingers slipped. She dropped like a stone. Her throat constricted. She cried out and choked as a huge claw snapped closed about her stomach.</p><p>“Grace?” The feathered monster bent his neck. A round green eye glared at her.</p><p>She sucked the air into her lungs and finally breathed. “Your definition of OK has problems.” The wind muffled her voice.</p><p>“What?” he bellowed.</p><p>“I said, your definition of OK has problems!” The ground rolled past them, impossibly far. She clenched her hands on the enormous scaly talons gripping her. “Is there any chance that this could be a dream?”</p><p>“I’m afraid not.”</p><p>Her heart hammered so hard, she was worried it would jump out of her chest. “What was it?”</p><p>“Clan Roar - our opponents in the game. Or one of their agents, to be exact. They’re not dumb enough to attack you directly. Once the game is scheduled, all hostilities between the participants must cease. Interference of this sort is forbidden.”</p><p>“What about Lilian?”</p><p>“She can take care of herself.”</p><p>Grace shivered. “Why would they be attacking me in the first place?”</p><p>“You’re my defence. If they kill you, I’ll have to withdraw from the game.”</p><p>“That sounds ridiculous! You’re the revenant and I can’t even defend myself.”</p><p>“I’ll explain everything later. We’re beyond their range now and we’ll arrive soon. Try to relax.”</p><p>She was clutched in the talons of a monstrous creature, who was really a man trying to rescue her from a magical attack by flying hundreds of feet above solid ground. Relax. Right. “I serve a madman,” she muttered.</p><p>Far beyond the fields, an empty piece of the horizon shimmered and drained down, revealing a dark spire. Tower Dreoch, Uncle Gerald had called it. He’d said the Dreochs lived in a castle. She thought he’d exaggerated.</p><p>Nassar careened, turning, and headed to the tower.</p><p>They circled the tower once before Nassar dived to a balcony and dropped her into a waiting group of people below. Hands caught her and she was gently lowered to the ground.</p><p>In the overcast sky, Nassar swung upwards and swooped down. The group parted. A dark-skinned woman grasped Grace by her waist and pulled her aside with the ease one picks up a child.</p><p>Nassar dived down. His huge talons skidded on the balcony and he tumbled into the room beyond. Feathers swirled. He staggered up. “Leave us.”</p><p>People fled past her. In a moment the room was empty.</p><p>Grace hugged herself. Up there, in the evening sky, the cold air had chilled her so thoroughly, even her bones felt iced over. Her teeth still chattered. She stepped to the double doors and shut them, blocking off the balcony and the draught with it.</p><p>The large rectangular room was simply but elegantly furnished: a table with some chairs, a wide bed with a gauzy blue canopy, a bookcase, some old, solidly built chairs before the fireplace. A couple of electric table lamps radiated soft yellow light. An oriental silk rug covered the floor.</p><p>Nassar slumped in front of the fireplace. Bright orange flames threw highlights on his feathers, making them almost golden in the front. His feathers seemed shorter. His jaws no longer protruded quite as much.</p><p>Grace crossed the carpet and stood before the fire, soaking in the warmth. It all seemed so dreamlike. Unreal.</p><p>“This will be your room for the next couple of days,” he said.</p><p>“You have no idea how strange this is to me,” she murmured.</p><p>His smart eyes studied her. “Tell me about it?”</p><p>“In my world people don’t turn into . . . into this.” She indicated him with her hand. His feathers definitely were shorter now. He’d shrunk a little. “People don’t fly unless they have a glider or some sort of metal contraption with an engine designed to help them. Nobody tries to murder someone through magic. Nobody has mysterious castles masquerading as empty fields.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A careful knock interrupted her.</p><p>“It’s your room,” Nassar murmured.</p><p>“Come in,” she called.</p> <p>A man entered, pushing a small trolley with a teakettle, two cups, a dish of sugar, a ewer of cream and a platter with assorted cookies. As he passed her, she saw a short sword in a sheath at his waist. “Your sister suggested tea, sir.”</p><p>“Very thoughtful of her.”</p><p>The man left the trolley, smiled at Grace, and departed.</p><p>Grace poured two cups of tea.</p><p>“I suppose in your world people don’t drink tea either?” he asked.</p> <p>“We drink tea,” she said with a sigh. “We just don’t always have servants armed with swords to bring it. Cream?”</p><p>“Sugar and lemon, please.” Nassar had returned to his normal size. The feathers were mere fur now, and his face was bare and completely human.</p><p>“What’s happening with your feathers?”</p><p>“I’m consuming them to replenish some of my energy. Transformations such as this are difficult even for me.” He sank into a chair, took a cup from her with furry fingers, and sipped from it. “Perfect. Thank you.”</p><p>“I live to serve.”</p><p>His lips curved into a familiar half-smile. “Somehow I deeply doubt it.”</p> <p>Grace sank into the other chair and sipped shockingly hot tea, liberally whitened by cream. Liquid heat flowed through her. His magic brushed her again, but she had flown over miles bathed in it and she accepted his touch without protest. She was so very tired. “This is a dream. I’ll wake up, and all of this will be gone. And I’ll go back to my quiet little job.”</p><p>“What is it you do?”</p><p>Grace shrugged. He knew, of course. His clan had been keeping tabs on her family for years. When you own something, you want to pay attention to its maintenance. He probably knew what size of underwear she wore and how she preferred her steak. “Why don’t you tell me?”</p><p>“You’re a headhunter. You find jobs for others. Do you like it?”</p><p>“Yes. It’s boring at times and stressful, but I get to help people.”</p><p>“You didn’t know about your family’s debt, did you?” he asked.</p><p>“No.” She refilled her cup.</p><p>“When did you find out?”</p> <p>“Three days ago.”</p><p>“Was it sudden?”</p><p>“Yes,” she admitted. “I always knew about magic. I was born able to feel it. At first I was told I was a very sensitive child, and then, once I was old enough to realize I needed to keep it to myself, more complicated explanations followed. I live in a world of very small magics. I can sense if I’ll miss the bus. In school, I could usually foretell my grade on tests, but I could never predict anything else accurately. If I concentrate very hard, I can scare animals. A dog once tried to chase me, and I was frightened and sent it running.”</p><p>She drank again. “Small things, mostly useless. I thought that all magic users were like me. Working their little powers in secret. I never imagined people could fly in the open. Or walk through crowded airports without being seen. My mother is a fabric buyer. My uncle’s a mechanic who really likes weapons. My dad’s normal in every way. My mother and he divorced when I was eighteen. He runs a shift at a tyre repair plant.”</p><p>Grace drank more tea. Her head was fuzzy. She was so comfortable and warm in the soft chair. “When Uncle Gerald told me this half-baked story about blood debt, I didn’t believe him at first.”</p><p>“What convinced you?”</p><p>“He was terrified. Uncle Gerald is like a rock in the storm: always cool under pressure. I’ve never seen him so off balance.”</p><p>She yawned. She was so drowsy. “I think my mother hoped I would never have to do this.”</p><p>“I can see why,” Nassar said softly. “We live in constant danger. I would think any mother would want to shield her child from us.”</p><p>“I would.” Drowsiness overtook her. Grace set the cup down and curled into a ball in the chair. “Even though your world is so . . .”</p><p>She vaguely saw him rise from his chair. He picked her up, his magic cloaking about her. She should have been alarmed, but she had no resolve left.</p><p>“So?”</p><p>“So magical.”</p><p>He drew the canopy aside and lowered her onto the bed. Her head touched the pillow and reality faded.</p><p>Nassar stepped out of the room, gently closing the door behind him. Alasdair waited in the hallway, a lean sharp shadow, with a robe draped over his arm. Nassar took it from him and shrugged it on, absorbing the last of his feathers. His whole body hurt from too much magic expended too quickly. Walking was like stepping on crushed glass.</p><p>“Is she asleep?” Alasdair asked.</p><p>Nassar nodded. They walked down the hall together.</p><p>“She’s pretty. Chestnut hair and chocolate eyes - a nice combination.”</p><p>She was also calm under pressure, smart and wilful. When she looked at him with those dark eyes, Nassar felt the urge to say something intelligent and deeply impressive. Unfortunately, nothing of the kind came to mind. It seemed her eyes also had a way of muddling his thoughts. The last time he felt that dumb was about fourteen years ago. He’d been eighteen at the time.</p><p>“You like the girl,” Alasdair offered.</p><p>Nassar levelled a heavy gaze at him.</p><p>“Lilian said you tried to be funny in the car. I told her it couldn’t possibly be true. The moment you try to make a joke, the sky shall split and the Four Horsemen will ride out, heralding Apocalypse.”</p><p>“How droll. Did you double the patrols?”</p><p>Alasdair nodded his dark head and stopped by the ladder. Nassar walked past him, heading to his rooms.</p><p>“Did you?” Alasdair called.</p><p>“Did I what?”</p><p>“Did you joke with the girl?”</p><p>Nassar kept walking.</p><p>“Did she laugh?” Alasdair called.</p><p>“No.”</p><p>Nassar entered his room. He hadn’t expected her to laugh. He was grateful she didn’t collapse in a hysterical heap. Her uncle had been scared to within an inch of his life - fear had rolled off of him in waves. In Gerald’s life of some fifty odd years his services had been requested only twice, but the second time had scarred him for life. In the zone he would be useless.</p><p>Grace’s mother, Janet, was always meticulous and formal. She took no initiative. Working with her was like being in the presence of an automaton that obeyed his every order while being grimly determined to dislike it. Taking her into the zone, even if he could compensate for her age and health, would be suicide.</p><p>He was never comfortable with any of them. He was never comfortable with the whole idea of the bonded servant and took pains to avoid requesting their presence. But this time he had no choice.</p><p>Working with Grace presented its own set of difficulties. He could still remember her scent: the light clean fragrance of soap mixing with the faint rosemary from her dark hair. His memory conjured the feel of her body pressed against his and when he’d picked her up to place her on the bed, he hadn’t wanted to let go. He wasn’t an idiot. There was an attraction there, and he would have to manage it very carefully. The imbalance of power between the two of them was too pronounced: he was the master and she was the servant. Don’t think about it, he told himself. Don’t imagine what it would be like. Nothing can happen. Nothing is going to happen. She’s off-limits.</p><p>Grace followed the servant into a spacious atrium. Morning sun shone through the glass panels in the ceiling. The stone path wound between lush greenery, parallel to a stream lined with smooth river pebbles. Spires of bamboo rose next to ficus and ferns. Delicate orchids in half-a-dozen shades dotted the moss-covered ground. Red Kaffir lilies bloomed along the stream’s banks, echoed by paler blossoms of camellia bushes. The air smelled sweet.</p><p>The path turned, parting, and Grace saw the origin of the stream: a ten-foot waterfall at the far wall. The water cascaded over huge grey boulders into a tiny lake. Near the shore stood a low coffee table surrounded by benches. A dark-haired man lounged on the bench to the left, sipping tea from a large cup.</p><p>Nassar stood next to him, talking softly. He wore blue sweatpants and a light-grey T-shirt. A towel hung over his shoulder and his pale hair was wet and brushed back from his face. Poised like this, he appeared massive. Muscles bulged on his chest when he moved his arm to underscore a point. His biceps stretched the sleeves of his shirt. His legs were long. Everything about him, from the breadth of his shoulders to the way he carried himself - controlled and aware of his size - communicated raw physical power. His wasn’t the static bulk of a power weightlifter, but rather the dangerous, honed build of a man who required muscle to survive. If a genius sculptor wished to carve a statue and name it Strength, Nassar would’ve made a perfect model.</p><p>He glanced at her. His green eyes arrested her and Grace halted, suddenly realizing she wanted to know what he would look like naked.</p><p>The thought shocked her.</p><p>Something in her face must’ve equally shocked him, because he fell silent.</p><p>A torturous second passed.</p><p>She forced herself to move. Nassar looked away, resuming his conversation.</p><p>I can’t be attracted to him. He forced me to come here and risk my life and I don’t even know why. I know nothing about him. He’s a monster. That last thought sobered her up. She approached the benches.</p><p>“Grace,” Nassar said. His magic brushed her. “This is Alasdair, my cousin.”</p><p>Alasdair unfolded himself from the bench. “Charmed.”</p><p>“Hello.” Grace nodded at Alasdair, then turned to Nassar. “You drugged my drink.”</p><p>“Actually I drugged the cream,” he said, “and technically it was my sister who did it.”</p><p>“Why?”</p><p>“You were in shock. I wanted to spare you the breakdown and anxiety when you came out of it.”</p><p>Grace held herself straight. “I would appreciate it if you didn’t do it again. We have a deal. I’ll keep my part, but I can’t do it if I have to watch what I eat and drink.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nassar considered it for a long moment. “Agreed.”</p><p>“A deal?” Alasdair’s eyebrows crept up. He was lean and sharp, his movements quick. His stare had an edge. If Nassar was a sword, Alasdair was a dagger.</p><p>“I’ve agreed to do my best to help you and, in return, you’ll leave my family alone for five years,” Grace said.</p> <p>Alasdair grimaced at Nassar. “That’s incredibly generous, considering what they’ve done. We owe them nothing.”</p><p>Nassar shrugged his massive shoulders. “It’s worth the reward to have her full cooperation.”</p><p>Grace took a seat on the bench. “What did we do exactly?”</p><p>“You don’t know?” Alasdair passed her a plate of scones.</p><p>“No.”</p> <p>The dark-haired man glanced at Nassar, who shrugged. “You tell it,” he said.</p><p>“At the end of the nineteenth century your family and our clan were in dispute,” Alasdair said.</p><p>Grace was learning to decipher their code. “In other words, we were murdering each other.”</p><p>“Precisely. The dispute grew out of control and so our families agreed to end it. The peace was to be sealed through a wedding. Jonathan Mailliard of your family was to marry Thea Dreoch.”</p><p>“He was your great-grandfather’s brother,” Nassar supplied.</p><p>“The wedding went well,” Alasdair continued. “There was a very nice reception in one of the Mailliard gathering halls, a beautiful old hotel. Everyone ate, drank and was merry. The couple went upstairs to their rooms, where Jonathan pulled out a knife and slit Thea’s throat.”</p> <p>Grace froze with a scone halfway to her mouth. She had expected something of this sort. To force her family into indefinite servitude, the crime had to be horrible. But it still shocked her.</p><p>“He waited for almost two hours by her cooling corpse,” Alasdair continued, “until the party died down. Then he and several Mailliard men and women went through the hotel door to door. They murdered Thea’s sister, her husband and their twin daughters who were flower girls at the wedding. They killed Thea’s parents and her two brothers, both minors, and would’ve slaughtered the entire party, but they were seen by a Dreoch retainer, who started screaming. Our offensive magic was always stronger and we were inside your family’s defences. There was a bloodbath. Every member of the Mailliard family was killed, except Thomas Mailliard, who was fourteen at the time. He hid in a closet and wasn’t discovered until later in the day, when the butchery had stopped. Because Thomas was a child and hadn’t participated in the slaughter, he was given a choice: death or servitude for all of his descendants. And that’s why you now serve us.”</p><p>Grace sat in a sickened silence.</p><p>“Anything to say?” Alasdair asked.</p><p>“That’s very horrible,” she said.</p><p>“Yes, it is.”</p><p>“However, I never knew Jonathan Mailliard. I didn’t even know his name. I feel awful about the murder and I understand that my family bears responsibility, but I never killed anyone. I’ve never hurt you and neither has my mother, my uncle nor my great-grandfather, who hid in the closet.” She tried to make her voice sound calm and reasonable. “I’ve done you no harm, yet you limit my freedom and force me to risk my life because of a crime perpetrated a century ago by someone I’ve never met. Our family has served yours for over a hundred years. At some point this debt will have been repaid. When do you think will that be?”</p><p>“Never,” Alasdair said.</p> <p>It felt like a slap. She looked to Nassar. “So this is how you do things? You dumped all of the blame for a bloody feud onto a fourteen-year-old child who hid in a closet, and because he failed to stop grown men from killing, you keep his descendants in perpetual servitude?”</p><p>“Hardly perpetual,” Nassar corrected. “Since I assumed the responsibility for the clan fifteen years ago, I’ve called on your family only four times.”</p><p>“But we know we can be called on at any point. We have to live with the knowledge that at a moment’s notice we might be required to risk our life for a complete stranger for no reason and we might never see our loved ones again. We can’t refuse. The terms are obedience or death. Would you want to live like this?”</p><p>“No,” Nassar admitted.</p><p>“Can you tell me when the debt will be paid?” she asked.</p><p>“This arrangement is to our advantage,” Nassar said. “It makes no sense for us to release you.”</p><p>“I see. I’ll have to release us then.”</p><p>“Really?” Alasdair gave a short barking laugh. “How exactly are you planning on doing that?”</p><p>“My uncle has no offspring and I’m my mother’s only child. To my knowledge, I’m the last of the Mailliards. I’ll have to make sure that I don’t continue the line.” She rose. “I think I’ve seen the washroom on the way here. I really need to splash some water on my face.”</p><p>“Second door on the right,” Nassar told her.</p><p>“Excuse me.”</p><p>Grace walked away. Her knees shook a little in her jeans. Her face burned.</p><p>Nassar watched Grace’s figure retreat down the winding path.</p><p>“Wow,” Alasdair offered.</p><p>“Yes.”</p><p>“Think she’ll do it?”</p><p>“She’s a Mailliard.”</p><p>He’d seen the same steely resolve in her mother’s eyes, Nassar reflected. He suspected it was the same will that drove the wedding night atrocities a century ago. It enabled her mother, Janet, to grimly bear her service, and fuelled Grace’s fight against it. He doubted she would ever go into outright rebellion, not while her mother and Gerald were alive, but he could tell by the way she held herself, by her face and her eyes and her voice, that she would rather give up her future children than bring them into the Dreochs’ “service”.</p><p>“You like her,” Alasdair said.</p><p>“What of it?”</p><p>“Why don’t you make a move?”</p><p>The imbalance of power between them was too great, and her antipathy and contempt for Clan Dreoch was painfully obvious. Nassar took the towel off his shoulder and sat on the bench. “Because she can’t say no.”</p><p>When Grace returned, Alasdair was gone; Nassar sat alone. It was easier if she simply admitted it, Grace decided. Sometimes you see another person in passing, your eyes meet, and you know by some instinct that there is something there. She felt that something for Nassar.</p><p>It was wrong on so many levels that her head reeled from simply contemplating it. He was a revenant, a creature more than a man. Her great-grandfather’s brother slaughtered his relatives. His family held hers in bondage. If he really wanted her, he could simply order her to submit. Maybe it was some sort of twisted version of Stockholm syndrome. Or an animal attraction. He was . . . not handsome exactly, but very male. Powerful. Masculine. Strong. But there was more to if. the sadness in his eyes, the courteous way he managed himself, the feel of his magic. It pulled her to him and she would have to be very careful to keep her distance.</p><p>“You still haven’t told me what you need me to do,” she said.</p><p>He rose. “Walk with me, please.”</p><p>Grace followed him down the path deeper into the atrium. Nassar led her out through an arched door and into a large round chamber. Bare, it was lit by sunlight spilling through a skylight very high above. A thick metal grate guarded the skylight. Plain concrete made up the floor, showing a complicated geometric pattern with a circle etched into its centre. Nassar stood on its edge.</p><p>“When a revenant takes a new body, he gains great power but he also inherits the weaknesses of that body. The body I took was cursed. After I transferred into it, I was able to heal the damage and break the curse. But all of my invulnerability to the curse is gone. I’ve used it all up.”</p><p>“And the man who was born in this body? What happened to him when you took it?”</p><p>“He died,” Nassar said.</p><p>She’d hoped he wouldn’t say that.</p><p>A woman entered the chamber through the door in the opposite wall. A pale blonde like Nassar. She smiled at them. Nassar didn’t quite smile back, but the melancholy of his face eased slightly.</p><p>“This is Elizavetta. My sister.”</p><p>“Call me Liza,” she said. “Everyone does.”</p><p>“Grace,” Grace said simply. “You’re the one who drugged the cream.”</p><p>Liza nodded. “Yes. Alasdair warned me I may have earned your undying hate for it. I sincerely hope we can put it past us. I didn’t mean to hurt your feelings in any way.”</p><p>“Given that I’m a servant, my feelings are hardly relevant, but I appreciate it,” Grace said.</p><p>Liza blinked. An uncomfortable silence ensued. Nassar cleared his throat. “Liz?”</p><p>“Yes, right.” Liza stepped inside the design.</p><p>“Every revenant has a fatal weakness,” Nassar said, his gaze fixed on his sister. “This is mine.”</p><p>Liza arched her back, spreading her arms. Her hands clawed the air. She spun in a place, twisting. Magic pulsed from her and filled the lines etched on the floor with pale yellow light. Liza brought her hands together, cried out and forced them apart with a pained grimace. A clump of mottled darkness appeared between her fingers. She stepped back.</p><p>The clump spun, growing, and ruptured, vomiting a creature into the circle. The beast was three-feet long and slender, shaped like a slug or a leech except for the fringe of carmine feathery hairs along its sides. A patina of grey and sickly yellow swirled over its dark hide, like an oil rainbow on the surface of a dark puddle.</p><p>The creature shivered. The red fringe trembled and it took to the air, sliding soundlessly a foot off the ground. A cold, foul magic emanated from it. It touched Grace. She jerked back and bumped into Nassar.</p><p>“What is that?”</p><p>He put his hand on her shoulder, steadying her. “A marrow worm. They live in dark places, where there is stagnant water and decay. They feed on small animals, fish and old magic.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The worm hovered behind the glowing outline of the circle. Its head was blunt and as it rose up, testing the boundaries of its invisible cage, Grace saw a slit of a mouth lined with sharp serrated teeth on its underside.</p><p>Liza approached the worm. The creature shied away, sliding as close to the glowing lines as it could.</p><p>“Think of them as germs. Most people have a natural resistance to them, an immunity. I don’t. To me, they’re fatal. We did our best to keep this fact to ourselves, but I have no doubt the Roars know it. They would be fools not to. Unfortunately, marrow worms are easy to summon.”</p> <p>He’d stepped behind her and she was painfully sensitive to the presence of his large body only an inch from her back. His magic touched her. Her every nerve shivered, hyper-aware of his movements. She sensed him lean to her and almost jumped when his quiet voice spoke into her ear. “Do you remember when you sent that dog running? I want you to do that again.”</p><p>Grace swallowed. “I don’t remember what I did. It just happened.”</p><p>His big hand pushed against her back gently, making her take a step towards the circle. “Try.”</p><p>Grace took a deep breath and stepped over the glowing lines inside the circle. The worm jerked away from her like a wet ribbon. Grace glanced at Nassar.</p><p>“That’s just normal resistance to humans. Keep trying.”</p> <p>Grace stared at the worm twisting. Go away, she thought. Gone. I want you gone.</p><p>The worm remained where it was.</p><p>Grace glanced at Liza. “Any idea what I’m supposed to be doing?”</p><p>Nassar’s sister shook her blonde head. “None. Dreochs are aggressors. We have few defensive abilities and they’re radically different from yours. Mostly our defences consist of Nassar hacking at things with something large and sharp.”</p><p>“The magic you’re trying to do is called the Barrier,” Nassar said. “It’s one of the natural Mailliards’ magics. Very talented members of your family used it both as a defence and as a weapon. Your mother stated that it can’t be taught. You simply do it or you don’t.”</p><p>Grace focused on the worm and tried to pretend it was a large, mean-looking German shepherd.</p> <p>An hour later she sat exhausted on the floor. The worm floated at the edge of the design.</p><p>“It’s useless.” Liza unscrewed a cap from a fresh bottle of water. She had gotten a cooler with drinks, migrated to the wall, and now sat on the floor. “Why Janet didn’t practise with Grace is beyond me, but she didn’t. We’ll have to change the plan. Instead of you and Grace, I’ll go with Alasdair.”</p><p>“No.” Steel laced Nassar’s voice. He leaned against the wall.</p><p>“You’re being unreasonable.”</p><p>Nassar’s face was dark like a storm. “Both of you will die. I have resistances and power to counter Clan Roar’s attacks. You don’t.”</p><p>“You can’t counter this one.”</p><p>He didn’t answer.</p><p>“Why don’t you just turn into a bird and fly through the zone?” Grace asked.</p> <p>“Flight is forbidden in the game,” Nassar answered.</p><p>Liza sighed. “Grace, would you like some water?”</p><p>“Yes.”</p><p>Liza tossed her a new bottle.</p><p>“Thank you.” Grace caught it. “Why are you fighting the Roars anyway? What’s this dispute about?”</p><p>“It’s about children,” Nassar said. “And killing me.”</p><p>“Our aunt married a member of Clan Roar,” Liza said. “Arthur Roar. He turned out to be a wart on the ass of the human kind: abusive, violent, cruel. She left after eight years and took their three kids with her.”</p><p>“Should’ve left sooner,” Nassar said. His green eyes promised violence, the light irises so cold that Grace took a small step back.</p><p>“She had her reasons for staying,” Liza said. “There was a large dowry involved and she didn’t want us to have to pay restitution and interest. But in the end it was just too much. After Arthur broke his son’s legs, she grabbed the kids and came home. Now, nine years later, Arthur suddenly wants his children back.”</p><p>Liza took a drink from her bottle. “He’s never shown any interest in them. No calls, no letters, not even a card. He’s done nothing to support them. But Aunt Bella signed the wedding agreement that specified equal amount of time with the children for each parent in the event of separation. Arthur claims that since the kids were with her exclusively for nine years, now he has exclusive rights to them.”</p><p>“He doesn’t give a damn about the kids. It’s an excuse for the Roars to test the waters,” Nassar said. “They have a couple of strong people and they’re thinking of moving in on our interests. Before they do it, they want to weaken us. They knew that if they challenged the clan, I would enter the game, and they believe they have a reasonable chance of killing me. They’ll knock out the biggest power user of our clan and earn respect from other clans for killing a revenant, and they will do it all before the war ever starts.”</p><p>He pushed from the wall. “It’s almost time for lunch. Let’s take a break.”</p><p>Lunch was laid out on a long table in a vast dining hall. Nassar held out a chair for Grace and she sat down. He took a place to her right, while Liza sat down at her left, next to Alasdair. Other people came into the room — two men and three women. They took their seats, nodded and smiled, started conversations in calm voices. Alasdair said something and a woman laughed. They were so at ease and the warmth of their interaction began to thaw Grace’s resolve.</p><p>The four chairs directly opposite her remained empty. She wondered who would sit there and a couple of minutes later she had her answer. Three children entered the room, followed by a pale woman. Of course. Nassar had arranged it so she would spend the meal looking at the faces of the children whose fate would be decided in the game.</p><p>They took their seats: the woman with careworn eyes, a young boy with a wild mass of dark hair, and two girls, one slender and blonde, and the other only about ten or so, with short dark hair and big blue eyes. The youngest girl saw Nassar and came grinning around the table. “Hug?” she asked him seriously.</p><p>“Hug,” he agreed and put his massive arms around her.</p><p>“And no dying,” she reminded him.</p><p>He let go and nodded.</p><p>The girl noticed her. “Hi. I’m Polina.”</p><p>It was impossible not to smile back. “Hi. I’m Grace.”</p><p>“You’re supposed to protect Nassar,” Polina said.</p><p>“That’s what he tells me.”</p><p>The child looked at her with her blue eyes. “Please don’t let him die,” she said softly. “I like him a lot.”</p><p>“I’ll try my best.”</p><p>Polina went around the table to her seat. Grace leaned to Nassar and whispered, “Laying it on a little thick, don’t you think?”</p><p>“I didn’t put her up to it,” he told her.</p><p>She glanced into his green eyes and believed him.</p><p>Lunch went on. Dishes were brought and passed around the table: roast beef and mashed potatoes, green beans, corn, iced tea and lemonade. The food was delicious, but Grace ate little. Mostly she watched the children. The boy leaned to his mother, making sure her cup was filled. The older girl seemed on the verge of tears. She became more and more agitated, until finally, just as peach cobbler made its way past Grace, the girl dropped her fork. Her voice rang out. “What if they win?”</p><p>The table fell quiet.</p><p>“They won’t,” Nassar said calmly.</p><p>“If Arthur touches us, I’ll kill him.” Steel vibrated in the boy’s voice.</p><p>Their mother leaned her elbows on the table and rested her forehead on her hands. “No. You’re not strong enough,” she told him in a dull voice. “Not yet. You must do whatever it takes to survive.”</p><p>“That’s enough.” Nassar’s magic surged out, spreading behind him like invisible wings. It brushed against Grace. Breath caught in her throat. So much power . . .</p><p>Nassar fixed the children with his stare. “You’re our kin. You belong to Clan Dreoch. Nobody will take you from us. Anyone who tries will have to go through me.”</p><p>With his power rising above the table, the prospect of going through him seemed impossible. His magic was staggering. It would take an army.</p><p>The anxiety slowly melted from the children’s faces.</p><p>“Let’s try again,” Nassar said, as the two of them strode back into the room.</p><p>The worm still floated in the circle. Grace stepped inside. It shied from her. “Why did you tell the children about the curse?”</p><p>“I won’t lie to them. The possibility of defeat exists and they have to be prepared.”</p><p>That defeat seemed very likely at the moment.</p><p>“But I will fight to the death to keep them safe. And even if I lose, the clan won’t surrender them. We will go to war. We won’t turn over children to a man who will break their bones.”</p><p>Neither would she. It didn’t matter who they were. A child was a child. She couldn’t let them suffer, not after watching them near panic with the fear of having to leave their mother. Their family and their home, all would be ripped away if Nassar and she lost.</p><p>“Now do you understand why I fight?” he asked her softly.</p><p>She nodded.</p><p>“I need your help desperately. Please help me, Grace.”</p><p>“I wish I could,” she said, her voice filled with regret.</p><p>Nassar watched her for a long moment. “What do you remember about your encounter with the dog? What did you feel?”</p><p>Grace frowned. “It was twelve years ago. I remember being scared for myself. And for the dog. He was my friend’s dog. I knew that if he bit me, he would be put down.”</p><p>Nassar strode to her, a determined look on his face.</p><p>“What are you doing?”</p><p>Nassar kept coming.</p><p>She realized he was going to cross the line. “Liza isn’t here to save you!”</p><p>“No.” He gave her the familiar half-smile. “Only you can save me now.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Nassar stepped over the line. The worm streaked to him. It skimmed the surface of his magic and clamped onto his shoulder. Nassar’s magic shrunk. He staggered and ripped the worm off. Grace cried out.</p><p>The worm flipped in the air and slid over him. Nassar tried to knock it off, but it slipped past his hands and leeched onto his side. Nassar gasped. His face went bloodlessly white. He spun, tripping over his feet, pulling at the writhing body, and stumbled to her. The worm slithered from his fingers and swooped down on him. Nassar fell.</p><p>Grace lunged forwards. She meant to thrust herself in front of it, but instead magic pulsed from her in a controlled, short burst. The worm hurtled back, swept aside.</p> <p>She pushed harder and the worm convulsed, squeezed between the press of her power and the glowing lines. “Nassar?” She knelt by him. “Nassar, are you OK?”</p><p>Nassar’s green eyes looked at her. His nose bled. He wiped away his blood with the back of his hand. “Protective instinct,” he said. “You’ve done it.”</p><p>It felt so right. As if the pressure straining at her from the inside suddenly found an outlet. So that’s what she’d been missing. All these years, she had suspected there was something more to the magic coursing through her and now she finally found it.</p><p>“I guess I did,” she murmured.</p><p>“Were you scared for me?”</p> <p>“Yes. How could you have done that? That was so reckless. What if I couldn’t save you?”</p><p>“I hoped you could,” he said.</p><p>The way he looked at her made her want to kiss him.</p><p>“Your family is free,” he said.</p><p>“What?”</p><p>“I’ve let Clan Mailliard go,” he said. “I signed the order before lunch.”</p> <p>She sank to the floor. “Why?”</p><p>He sat up. “Because I decided that’s not what I do. I don’t force people to fight our battles. I don’t want to be the man who blames children for their parents’ mistakes. And I don’t want you to be the last of the Mailliards. Whether you have children should be your choice alone. I don’t want to take it away from you.”</p><p>It slowly dawned on her. “So I’m free?”</p><p>“Yes.”</p><p>She stared at him. “You don’t even know me. I could just take off right now and leave you here to deal with the game on your own. Do you have any idea how scared I am? I don’t want to die.”</p><p>“Neither do I.” He gave her another sad smile.</p><p>She hung her head, torn. She was deeply, deeply afraid. But walking away from the children wasn’t in her. She wouldn’t be able to look herself in the eye. It was as if they stood in the road with a semi hurtling at them at full speed. What kind of person wouldn’t push them out of harm’s way?</p><p>“I should practise more,” she said.</p> <p>“We’re going to need another worm then,” Nassar said.</p><p>She glanced at the beast. It lay dead, sliced in half.</p><p>“You killed it,” he told her. “Sometimes the Barrier magic can also become a blade.”</p><p>“But I don’t even know how I’ve done it.”</p><p>“We don’t need to worry about that now,” he said. “As long as you can defend me, we should be fine.”</p><p>Three days later Grace stood in the middle of the street in Milligan City, hugging herself as the sun set slowly. Nassar loomed next to her. Behind them unfamiliar people moved, their magic shifting with them, their clothes colour-coded by their clan: grey and black for Dreoch, green for Roar, red for Madrid. Nassar had explained the rest of the colours, but she couldn’t recall any of it. The anxiety pulsated through her with every heartbeat.</p><p>Ahead a seemingly empty stretch of a suburban street rolled into the sunset. The round, red sun hung low above the horizon, a glowing brand upon the clouds.</p><p>Familiar magic brushed her and a heavy hand touched her shoulder gently. Nassar. He wore grey pants tucked into military boots. A long-sleeved shirt hugged his arms and over it he wore a leather vest that wanted very much to be called armour. She wore the same outfit. The leather fitted her loosely enough not to be constricting, but tight enough not to get in the way.</p><p>“Don’t worry,” Nassar said.</p><p>Her gaze slid to the large axe strapped to his waist. She touched her own blade, a long, narrow combat knife. Gerald had taught her the basics of knife-fighting a long time ago but she’d never been in a real fight.</p><p>A male voice rose to the side. “Can he bring a servant into the game?”</p><p>It took a moment to sink in. Of course, her status would be public knowledge among them, but it still cut her like a knife. She turned. A group of people stood on the side. Five of them wore dark blue robes. The arbitrators, she remembered from Nassar’s explanations. An older female in the arbitrator robe regarded her with serious grey eyes.</p><p>“If you want to withdraw, you may do so now,” the woman said.</p><p>She could withdraw. She could simply refuse to go in. If she did, Nassar would be doomed. He had already committed to the game and she knew he couldn’t simply substitute someone else in his place. He wouldn’t.</p><p>Overnight, her fears had grown into near panic. Now she could walk away from them.</p><p>Grace looked at the gathering of the clansmen. Her family used to be a clan. Her people should have stood right here. Instead the clansmen viewed her as a servant. Pride spiked in her. She had as much right to be here as anybody else. The vague feeling of unease that had eaten at her ever since Nassar had transformed into a bird crystallized and she finally understood it: it was envy. Envy of the magic used freely. Envy of knowledge. Circumstances had jettisoned her out of this world, but she refused to stay locked out.</p><p>Grace drew herself to her full height. “Why in the world would I want to withdraw?”</p><p>A red-haired man in Clan Roar’s green shook his head. “She can’t refuse. She isn’t even properly trained. She’s a servant.”</p><p>“Not any more,” Nassar said softly behind her.</p><p>The gathering suddenly grew quiet.</p><p>The arbitrator surveyed them for a long moment. “Nassar, am I to understand that you’ve released Clan Mailliard from their service?”</p><p>“Yes,” he answered.</p><p>The arbitrator looked at her. “You’re here of your own free will?”</p><p>“Yes,” Grace said.</p><p>The arbitrator glanced at the Roar clansman. “There is your answer. Let the record reflect that Clan Mailliard chose to assist Clan Dreoch. You have our leave to proceed.”</p><p>They passed her. Grace let out her breath.</p><p>“Thank you,” Nassar murmured.</p><p>“You’re welcome.”</p><p>Two young men in Clan Roar’s green came to stand at the other end of the street. Both were lean, strong and hard, as if twisted from leather and twine. Both had long hair bound into horse tails: one red, one black.</p><p>Nassar leaned to her. “Conn and Sylvester Roar. Powerful, but they lack experience.”</p><p>The arbitrators passed between them, blocking her vision. As the blue robes fluttered by, Grace saw Conn Roar turn to her. He grinned, his eyes alight with feral fire, and snapped his teeth.</p><p>Alarm dashed down her spine in a rush of cold. She raised her eyebrows. “Someone forgot his muzzle.”</p><p>“See the pendant around Conn’s neck?”</p><p>Grace glanced at a small black stone hanging on a long chain.</p><p>“That’s a summoning stone. They’ll use its power to manifest creatures.”</p><p>Marrow worms. They’d use it to summon the marrow worms. Nassar had warned her that the Roars would try to kill them. Him, specifically. The game was only the opening salvo to the hostilities between the two clans, and the Roars wanted to land the first blow by taking out the Dreochs’ best magic user.</p><p>The arbitrators raised their hands. A controlled surge of magic washed over the street. The reality drained down, as if it were a reflection in a melting mirror. A new street opened before them. Green and red lianas hung from the dark, sinister houses. Kudzu vines climbed in and out of windows. To the left a huge clump of yellow foam dripped rancid red juice onto the street. A puddle of brown slime slivered across the asphalt like an amoeba and slipped into the storm drain under the light of street lamps. Ahead something furry dashed across the intersection: a long, shaggy body with too many legs.</p><p>Somewhere in that zone a flag waited. Whoever touched the flag would be instantly transported out. They just had to survive long enough to reach it.</p><p>The woman arbitrator raised her hand, fist closed. Next to Grace, Nassar tensed.</p><p>“Let the game begin!” A white light pulsed from the arbitrator’s fingers. The crowd erupted in a ragged cheer.</p><p>The two Roar clansmen screamed in unison. Flesh bulged out from under their skin. Their bodies contorted, their limbs thickened. Black fur sheathed their skin. Horns burst through their manes. Their eyes drowned in golden glow and an extra pair opened beside the first set. As one they raised monstrous faces up, the sharp fangs in their jaws silhouetted against the red sky. Eerie howls tore free from their throats, blending into a haunting song of hunt and murder.</p><p>The Roars dashed into the zone on all fours. Nassar watched them go, his face calm. Leaping and growling, they turned the corner and vanished behind the abandoned houses. The echoes of their snarls died. Nassar took his axe from its sheath, rested it on his shoulder, and strode into the zone, unhurried. Grace swallowed and followed in his footsteps.</p><p>The street lay quiet. They would be watched by magical means while in the zone, but for now the press of many stares bore directly into her back. Her nerves knotted into a clump.</p><p>They reached the intersection.</p><p>A hint of movement on the roof of a two-storey house made her turn. Grace frowned.</p><p>A flat, wide shape leaped off the roof, aiming at her. She caught a glimpse of a fang-studded mouth among bulging veins. Too stunned to move, she simply stared.</p><p>Nassar’s huge back blocked the mouth. A hot whip of magic sprung from his hand, cleaving the creature in two. Twin halves of the beast fell to the ground, spilling steaming guts onto the asphalt.</p><p>“You’re allowed to dodge,” Nassar said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The enormous blue beast bore on them. Grace watched it come. It thundered down the street, its six stumpy legs mashing potholes in the crumbling pavement.</p><p>In the past seven hours, she’d used her magic for defence countless times. Blood splattered her face, some dried to flecks, some still wet. Her side burned where a red, furry serpent had bitten her before Nassar chopped off both of its heads. A long rip split her left pant leg, exposing puckered flesh of the calf where a liana stung her with its suckers. It never ended. There was always a new horror waiting to pounce on them from some dark crevice. Grace clenched her teeth and watched the beast charge.</p><p>It brushed against a house, sending a shower of broken boards in the air, and kept coming, cavernous mouth gaping wide, the sound of its stomping like a cannon blast salute at a funeral. Boom-boom-boom.</p> <p>Keep it together. Keep it steady.</p><p>Boom-boom-boom.</p><p>The beast was almost on her. Two bloodshot eyes glared. The black mouth opened, ready to devour her.</p><p>“Now!” Nassar barked.</p><p>She slammed her magic into it.</p> <p>With a surprised roar, the beast rammed the invisible barrier. Her feet slid back from the pressure. The beast’s momentum pitched it to the side. The mammoth body fell, paws in the air. Nassar leaped over it, a feral shadow caught in the moonlight. White light sliced like a huge blade from his hand and Nassar landed by her. Filthy and bloody, he looked demonic.</p><p>Behind him the beast lay split open, like a chicken with a cleaved breastbone. The soft, beach-ball-sized sac of its heart palpitated once, twice, and stopped,</p><p>Grace stared mutely at the carcass. She had never imagined the night could hide things like it - terrible, awful things. She felt like she had aged a lifetime.</p><p>A soft humming filled her skull. She shook her head.</p><p>“What is it?” Nassar grasped her face and turned it to him.</p><p>“Buzzing.”</p> <p>He raised his head, listened and grabbed her hand. “Run!”</p><p>She’d learned not to ask why. They sprinted, zigzagging through the labyrinthine streets, past overgrown lawns, past an abandoned playground, where small things with round red eyes clutched at the jungle gym with sharp claws, past office buildings, and burst into a park. In the middle of the park lay a pond, bordered by a row of street lamps spilling orange light. The moon slid from the clouds, illuminating the water’s surface and the raised concrete basin of a dried fountain in the centre.</p><p>Nassar pulled her into the water and pointed to the fountain. “Go!”</p><p>She swam through the murky water without thinking. Something soft brushed her legs. She shied and squeezed a frantic burst of speed from her exhausted body. Dizziness came and then her hand hit the concrete base. She pulled herself up. Nassar climbed up next to her, grabbed her by her waist and hoisted her up into the seven-foot-wide basin. She fell on dried leaves and dirt.</p><p>The buzzing grew louder, steady and ominous like the hum of a giant engine.</p><p>An invisible whirlpool of magic built around Nassar. He stood cocooned in its fury, his axe held high. His body trembled under the pressure. The cuts and gashes on his arms reopened and bled.</p><p>The buzzing swelled like a tidal wave.</p><p>She saw the axe fall in an arc, its tip prickling the pond. The magic sucked itself into the axe handle and burst through its blade into the water. The pond became preternaturally calm, its surface smooth like glass. The buzzing vanished.</p> <p>Nassar swayed. Grace grabbed his shoulders and pulled him against the lip of the basin, steadying him. His hand squeezed hers. He turned carefully, leaped up, and pulled himself into the basin next to her.</p><p>A swarm of insects spilled from the street. Green and segmented, like grasshoppers armed with enormous teeth, they were the size of a large cat. They streamed around the water in a mottled mass, bodies upon bodies, but none touching the pond.</p><p>“What are they?” Grace whispered hoarsely.</p><p>“Akora. The spell keeps them out of the water. As long as nothing disturbs the surface, they can’t see or hear us. Don’t worry. They can’t survive the sun. They’ll stay here entranced by the spell until morning.” He lay on his back and closed his eyes.</p><p>Across the water the green insects crawled over the stone benches, perched on lamp posts, and combed the weeds of the once perfectly cut lawn. They had surrounded the pond. Everywhere Grace looked long segmented legs rubbed, sharp mandibles gnawed on random refuse and backs split to flutter pale wings.</p><p>There were too many of them.</p><p>She felt so hollow. The seven hours she had spent in this place had consumed her: there was nothing left inside her. “We’ll die here,” Grace whispered.</p><p>“No.”</p><p>“They’ll eat us, and I’ll never see my mother again.” What was the point of going on? They’d never make it out. She no longer cared if they would.</p><p>A warm hand grasped her and pulled her with irresistible strength snug against Nassar’s chest. His arms closed about her, shielding her, shocking her cold body with their heat. His cheek rested against her hair. “I won’t let you die, Grace,” he whispered. “I promise I won’t let you die.”</p><p>She lay rigid against his chest, her face in his neck, listening to his strong, even heartbeat. His lips grazed her cheek. “I must be out of my mind,” he whispered and his mouth closed on hers.</p><p>He kissed her, at first gently, then harder, as if he tried to breathe his life into her. She felt numb, but he persisted, his kiss passionate and searing. His arms caged her. His large hard body cradled hers, keeping her from slipping off into the empty deadness. His magic wrapped them both. He kissed her again and again, anchoring her, refusing to let her go. Caught on the threshold between complete numbness and painful awareness, Grace teetered, unsure. He pulled her back to life, back to the desperate reality. She didn’t want to face it.</p><p>A shudder ran through her. She closed her eyes and let him part her lips with his tongue. He drank her in and finally she thawed. She wanted to live, to survive so she could feel this again. She wanted Nassar.</p><p>Tears wet her cheeks.</p><p>Nassar released her mouth and crushed her to him. “I want you so much,” he whispered, his green eyes looking into the distance. “And I can’t have you. I really must be cursed.”</p><p>She lay in his arms for a long time.</p><p>The coal darkness of the sky faded to the pale grey of predawn. Grace stirred. “Why did you do it?” she asked softly. “Why did you become a revenant?”</p><p>“I was dying,” he answered, his voice hoarse. “We had a feud with the Garveys. They cornered my brother, John, and I went to get him. John didn’t want to be taken alive. He didn’t think help was coming, and he cursed himself and all those around him with a plague of marrow worms. A suicide curse is very potent. I brought him out of the trap, but the curse had caught me. We were both dying and the family could do nothing to keep us alive. I’d lost consciousness. John knew that if I took his body, I’d gain a temporary boost of power to break the curse. He made the family commence the ritual.”</p><p>“He sacrificed himself?” she whispered.</p><p>“Yes. I remember there was a rush of red, like I was swimming through a sea of blood and drowning, and then I saw this shape floating in the depths. I thought it was my body and I knew if I wanted to survive, I had to get to it. I grabbed it, saw it was John . . . The pull to live was too strong. I awoke in my brother’s body.”</p><p>She put her arms around his neck and kissed his cheek.</p><p>“I killed my brother so I could live,” he said. “It doesn’t get any worse than that.”</p><p>She simply held him.</p><p>A low growl froze both of them. Grace flipped onto her stomach and glanced over the lip of the basin. In the night, the insects had stopped moving. They lay still now, entranced by the spell, their chitin mirroring the grass and weeds around them so closely that if she didn’t know they were there, she would’ve mistaken them for heaps of vegetation.</p><p>A lean muscled creature trotted along the edge of the pond. It gripped the ground with four oversized paws armed with sickle claws. Its serpentine tail lashed its dark pelt, which was spotted with flecks of red and yellow. The beast padded down the shore, its dragon-like jaws hanging open, showing off fangs the size of her fingers. Foamy spit leaked from between its teeth, staining the long tuft of red and yellow fur hanging from its chin. It halted, sniffed the air and turned to the basin. Four glowing amber eyes glared at her.</p><p>“Sylvester Roar,” Nassar murmured.</p><p>Sylvester sniffed the water. His narrow muzzle wrinkled. He looked like he was grinning at them with his monstrous mouth.</p><p>Nassar growled. “No, you young idiot! Can’t you see the spell on the water?”</p><p>Sylvester snapped his teeth and snarled in a feral glee. An eerie raspy growl came from between his teeth. “I see you, Nassar. You can’t hide from me.”</p><p>“Inexperienced fool.” Nassar reached for his axe.</p><p>“I’m coming, Nassar. I’m coming for you.” Sylvester gave a short ragged howl and splashed into the water. Little waves ran over the surface of the pond. Behind Sylvester the akora swarm swelled. Buzzing filled the air. Sylvester turned—</p><p>Nassar grabbed Grace and forced her to the floor of the basin, next to him.</p><p>A hoarse scream sliced through the morning, a terrible howl of a creature in impossible agony being torn to pieces. Grace squeezed her eyes shut. Sylvester screamed and screamed, the buzzing of the akora a morbid choir to his shrieks, until finally he fell silent.</p><p>Grace lay still, afraid to breathe. Slowly she opened her eyes.</p><p>An akora perched on the lip of the basin. It sighted her with dead black eyes. Its back split, releasing a pale gauze of wings.</p><p>Sun broke above horizon. Its rays struck the insect. Tiny cracks split its shiny thorax. The insect shrieked and fled, breaking apart over the pond. Grace rose. All around the pond the insect horde fractured and crumbled under the rays of the sun. The air smelled faintly of smoke. She looked beyond the heaps of melting insects and drew a sharp breath. Past the park, to the right, rose a tall heap of rubble that had been a multistorey building in its former life. Atop the rubble a small white flag fluttered in the wind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“The flag!”</p><p>Nassar had already seen it and jumped into the water. Together they swam across the pond. As she waded onto the solid ground, Grace passed a human skeleton, stripped bare of all flesh - all that remained of Sylvester.</p><p>Nassar moved cautiously along the sidewalk, jogging lightly on his feet, axe at the ready. She followed him, gripping her knife.</p> <p>He wanted her and she wanted him. He’d forged a connection between them she couldn’t ignore. The way he had held her, the way he’d touched her made her want to hold on to him. She had no idea what would come of their connection, but her instinct warned her she wouldn’t get an opportunity to find out. Thinking of losing him now, before she had a chance to sort it out, terrified her.</p><p>They reached the rock pile. Nassar paused, measuring the height of the rubble with his gaze. It was almost three floors tall. He glanced at her. She saw the confirmation in his green eyes: it was too easy. He expected a trap.</p><p>“We go slowly,” he said. “We must touch it together.”</p><p>She nodded.</p><p>They climbed the pile of debris, making their way higher and higher. Soon they were level with the first floor of the neighbouring buildings, then the second. The flag was so close now, she could see the thread weave of its fabric.</p> <p>The cold magic slammed her. Grace screamed. A lean shape burst over the top of the pile - half-man, half-demon, surrounded by marrow worms, the summoning stone on his chest glowing with white. The beast hit Nassar in the chest. Nassar reeled, the refuse slipped under him, and he plunged down, rolling as he fell, the dark worms swirling over him.</p><p>Grace ran after them. Below, the beast that was Conn Roar tore at Nassar, all but buried under the black ribbons of worm bodies.</p><p>She wouldn’t get to him in time. Grace jumped.</p><p>For a moment she was airborne and falling and then her feet hit hard concrete midway down the slope. It gave under the impact, pitching her forwards. She fell and rolled down, trying to shield her head with her arms, banging against chunks of stone and wood. Pain kicked her stomach; she’d smashed into a section of a wall. Her head swam. Her eyes watered. Grace gasped and jerked upright.</p><p>Ten feet away the marrow worms were choking Nassar.</p><p>Magic surged from her in a sharp wave. The blast ripped the worms clear. They fled.</p> <p>Nassar lay on his back, his eyes staring unseeing into the sky. Oh no.</p><p>She killed the panicked urge to run to him, crouched, and picked up his axe from where it had fallen. Her own knife was gone in her fall.</p><p>A dark shape launched itself at her from the pile. She whipped about, reacting on instinct. Nightmarish jaws snapped, her power pulsed, and Conn Roar bounced from the shield of her magic, knocked back. His paws barely touched the rubble before he sprung again. This time she was ready and knocked him down once more, deliberately.</p><p>Conn snarled.</p><p>She backed away towards Nassar’s body.</p><p>“He killed my brother,” the demonic beast said. His voice raised the small hairs on her neck. “Let me have Nassar and I’ll let you live.”</p><p>“No.”</p><p>“You can’t kill me.” Conn circled her. He limped, favouring his left front paw, and a long gash split his side, bleeding. Nassar had got a piece of him before he went down.</p> <p>“Of course, I can kill you,” she told him, building up her magic. “I’m a Mailliard.”</p><p>She only had one shot at this. If she failed, he’d rip her to pieces.</p><p>Conn tensed. The muscles in his powerful legs contracted. He leaped at her. She watched his furry body sail through the air, watched his jaws gape in joy when he realized her Barrier wasn’t there, and then she sank everything she had into a single devastating pulse. Instead of a wide shield, she squeezed all her power into a narrow blade.</p><p>It sliced him in two. His body fell, spraying blood. His head flew by her, its four eyes dimming as it spun.</p><p>She didn’t give it a second glance.</p><p>“Nassar?” She dropped the axe and pulled him up by his giant shoulders, sheltering a weak flutter of magic emanating from him with her own power. He was covered in blood. Her chest hurt as if she’d been stabbed. “Come back to me!”</p><p>He didn’t answer.</p><p>No! Grace dropped and put her ear to his chest. A heartbeat, very weak, faltering, but a heartbeat.</p><p>She wiped a streak of blood from her eyes with her grimy hand so she could see. She couldn’t help him. She didn’t know how. But his family would.</p><p>Grace looked up at the pile of concrete and rubble, to the very top, where a white flag flailed in the breeze.</p><p>Nassar leaned against a tree across the street from a brick office building. Grace was inside. He couldn’t sense her, not yet, but he knew she was inside.</p><p>He vividly remembered waking up to the familiar vaulted ceiling. He’d whispered her name and Liza’s voice answered, “She’s alive. She dragged you out, and I released her and her family, like you wanted.”</p><p>He didn’t believe her at first. He knew how much he weighed. No woman could have dragged his dead weight up that heap, but somehow Grace had done it.</p><p>She had left no note. No letter, no message, nothing to indicate that she didn’t hate him for dragging her into the horror of the game. He thought of her every day while he lay in his bed waiting for his body to heal.</p><p>It took a month for him to recover. Three days ago he was finally able to walk. Yesterday he was able to make it down the stairs unassisted. Now, as he leaned against an old oak for support, his left arm still in a sling, he wondered what he would say if she told him to leave.</p><p>He would say nothing, he decided. He would turn around and go back to the airport and fly back to his life as the cursed revenant of Dreoch Tower. Nobody would ever know what it would cost him.</p><p>He wanted to hold her, to take her back with him, to have her in his bed, to taste her lips again, and to see the sly smile hidden in her eyes for him alone.</p><p>The door opened. Three women stepped out, but he saw only one.</p><p>Grace halted. Nassar held his breath.</p><p>She took a small step towards him, and then another, and another, and then she was crossing the street, and coming near. He saw nothing except her face.</p><p>Her magic brushed him. She dropped her bag. Her hands went up to his shoulders. Her brown eyes smiled at him.</p><p>She kissed him. </p> </body></html>"]