["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Alone.</p><p>I'd lived alone for so many centuries that I'd had enough, and so I'd decided to end it that night, and I prayed to whatever gods might exist that there was no such thing as the immortality of the soul, or that if there was, I had lost mine long ago. I had no desire to go on. Not then. Not in any form.</p><p>There remained in me, ironically, the heart of a romantic, the soul of a poet who didn't compose, only felt. Fitting, then, that I chose to make my last moments on this earth worthy. That is why I found myself lying on the hard, dew-dampened cliff above a thundering waterfall in the darkest hours of that long ago night.</p><p>I lay there, listening to the roar of the waterfall and tasting its mist on the air. I stared up at a moonless sky full of diamond-like stars and waited to see the sunrise for the first time in countless centuries. I wondered how high that golden orb would climb before its kiss caused my body to smolder; how long I would be allowed to gaze upon it before fire consumed my flesh and bones.</p> <p>It would be painful - unbearably, maddeningly painful to a creature whose senses were as heightened as those of a centuries-old vampire. I will not say I didn't fear the pain - I did. I waited in dread of it. And yet, I would welcome it for the sweet release of nothingness I so hoped would await me on the other side.</p><p>It had been a long life, a full one. But not a good one. Immortality had been wasted on a man like me.</p><p>I lay there, awaiting the sun, awaiting death, my back upon the cool, solid stone of the earth, my face and clothes coated in the falls' mist, my eyes filled with the stars as they faded slowly into a sky that paled from indigo to purple. It wouldn't be long now. Another hour, two at most.</p><p>The roar and rush of water was joined by the harmony of those birds that rose before dawn and began their nightly task of singing up the sun. I listened to that song as I never had before. Always it had been a warning to me. Now it was a dirge, my personal requiem. I closed my eyes and relished the symphony as I awaited death's arrival.</p><p>Then an unwelcome sound stumbled into the song - one of discord - a sour note that did not belong and that would change everything. I think I knew it, even then. It was the sound of a woman, crying.</p> <p>I opened my eyes, angered at the interruption. Ruined. My beautiful, poetic exit from the world was ruined. Sitting up, I sought the source of the weeping, thinking the interloper would be fortunate if I didn't decide to take her with me on my final journey. When I saw her, I rose to my feet, my body acting of its own will.</p><p>Even at this distance I could see that she was beautiful. There was no question, not to my preternatural eyes. She stood on the opposite side of the dark cascade, on the very edge, staring down into the rocky froth far below, and I knew that she intended to jump.</p><p>She intended to die. Just like me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>From the moment my eyes fixed upon her, my awareness of my own misery faded. Her misery, instead, filled my mind. Her golden hair, long and curling, moved with every blast of wet wind that rose from the pounding falls. I willed her mind to open to mine. It wasn't difficult to read her - her emotions were bubbling over. There was pain and grief - overwhelming grief.</p><p>Why, I wondered? What could cause such pain in one so young?</p><p>Suddenly, I knew I had no time to plunder the depths of her mind in search of answers, for she inched nearer the edge, her unclothed toes curling over the side, her chin lifting even as she opened her arms to her sides like the beautiful Cathartes Aura drying its feathered wings in the morning sun.</p><p>I shouted, using the full power of my voice - an awesome thing in a vampire as old as I. \"Nu! Stai!\"</p> <p>She flinched, her eyes fixing on mine across the yawning chasm. She showed no fear at the unnatural force of my command, though she had to know that voice could belong to no ordinary man. Facing me she stared, and then her eyes widened - with recognition.</p><p>I held up a hand, telling her without another word to remain where she was. She knew me - I was royalty. She must obey.</p><p>And yet, she did not. Rather, she leaned forward and fell, more than jumped, into the void. Left with no choice, I dove - and with little more than the force of my will and the wisdom of instinct - arrowed my body downward, angling toward her.</p><p>She fell slowly, her body flat, arms and legs splayed. I shot, arms and feet pointed, my body cutting through the air like a blade, even as the power of my mind tried to slow her descent and speed my own.</p><p>I had not mastered flight, though some of my kind had. I could change my form, but it took time to accomplish such a feat, and time was something I did not have. So my choice - if it could be termed a choice at all - was to break her fall with my own body.</p> <p>Everything seemed to happen at half speed. I sliced through the upsurge of mists that seemed to bolster her. And then I was there, my body colliding with hers. I tried to make the impact less than crushing as I wrapped my arms around her slender frame and I turned to put my back to the earth.</p><p>For one instant her eyes, as gleaming black as pure onyx, held mine with a force I'd never felt. \"Why?\"</p><p>she whispered.</p><p>The pain in that single word was beyond understanding, and for the life of me I could not think of an answer. I didn't know why.</p><p>Pain exploded in me then, as the river's jagged rock teeth stopped our descent all at once. Icy water enveloped me, filled my nose, mouth and lungs. Bones cracked beneath my skin and all went dark.</p><p>I knew even as I embraced it that this was not the darkness of death. This respite was temporary - as it had been so many other times before. It was the same darkness that was my prison, my life.</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I woke to the smell of a wood fire. Conifer branches - the sizzle and snap of the pitch were unmistakable to my honed senses. Pain wracked my body. I knew then, it must still be night. I couldn't have been unconscious for long. Some time, however, had clearly passed.</p><p>I lay in the shelter of a cave, behind the face of the waterfall, and I saw a tunnel that twisted farther into the mountainside and downward, away from the cascade, which must have been the path we'd taken.</p><p>The tiny fire leapt and danced a few feet from me, and my clothes were drying, slowly, on my body. She sat on the other side of the fire, gazing at me through the tongues of yellow flame.</p><p>\"I thought you might be dead,\" she said. Her voice was like honey with bits of the comb still caught in its depths; smooth with unaccustomed coarseness tripping it up now and again. \"I am glad you're not.\"</p> <p>\"But not so glad that you are not.\"</p><p>She blinked and averted her eyes. \"Not so glad of that, no.\"</p><p>\"Why?\"</p><p>Lowering her head, she let her small shoulders slump forward. Her dress was faded brown and plain, its neckline rounded, its fabric worn. \"My entire family is gone,\" she whispered. \"I see no reason not to join them. There's nothing for me here.\"</p><p>I nodded. \"I see.\"</p> <p>Her dark eyes narrowed. \"You aren't going to argue with me? Tell me how much I have to live for, how much lies ahead for a girl of seventeen, the way all the others have done?\"</p><p>\"Why would I argue against seeking the solace of death when I was up there tonight planning to seek it out for myself?\"</p><p>She blinked, clearly stunned by the revelation. \"But you - you're the prince.\"</p><p>\"And I know pain. And I bleed, just as you do. No, I'll not argue with you, pretty one. I cannot even tell you why I took it upon myself to interfere with your plans. Except...\"</p><p>\"Except?\" she asked.</p><p>I shrugged. \"Except that I was so struck by your beauty, I couldn't help myself. It was pure selfishness on my part. For one brief instant, when I looked at you on that precipice, I thought I glimpsed -\" I drew a breath and plunged on. For what difference did it make now, whether I spoke honestly or falsely for the sake of manners or pride? \"I thought I glimpsed a reason to live for perhaps one more night.\"</p> <p>\"That reason being - to save me?\"</p><p>\"No,\" I said quickly. \"Not to save you. To...know you. To speak to you. To share my pain with someone who might understand it.\" I lowered my head. \"I told you. Entirely selfish. I'm sorry if I have prolonged your suffering by my thoughtless intrusion.\"</p><p>She studied me for a long moment, and finally lowered her eyes and whispered, \"I can die as easily tomorrow as tonight, I suppose. Tell me about your pain.\"</p><p>I stared back at her. The flames sizzled and popped. And I heard myself whisper, \"Perhaps I will. But there is this first. What I tell you here, in this cave has never been told to another soul. It can never leave this place.\"</p><p>She shrugged. \"I don't intend to ever leave this place, my prince. I will take your secrets to my grave.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"So tell me,\" she whispered. \"How is it you speak in a voice louder than the waterfall? And how is it you flew through the mists to save me as surely as a hawk swooping upon a snake in the meadow?\"</p><p>\"How do you think?\" I asked. \"I can see you have some notion. Have you been listening to the villagers and their gossip about me?\"</p><p>She smiled, not a smile of joy, but one of bitterness. \"One cannot live among the gossips and not hear their tales. They say you've sold your soul to the devil and made yourself immortal. They say the king isn't even your true father, but rather some distant descendant of yours, passing you off as his son to help keep your secret.\" She fixed her eyes upon his mouth. \"They say you drink the blood of virgins to remain ever young.\"</p><p>For the first time I saw a light in her eyes. A light of excitement, of danger. She was reckless, this one.</p> <p>\"And what do you say?\" I asked.</p><p>She shrugged. \"I say if this were true, why would you be so eager for death? I say if this were true, you would not be lying here in pain right now.\"</p><p>I shrugged. \"It's true, I am in pain. But I will sleep during the daylight hours, and when I wake at sundown, I will be completely healed.\"</p><p>Her eyes widened.</p><p>\"Or, I could heal much faster. Right now, in fact, with just a sip of your virgin's blood.\"</p> <p>Her smile died slowly. \"You're trying to frighten me. You can't, you know. If you wish to take my blood, take it. Drain me and leave me dead. I don't care.\"</p><p>\"I wouldn't leave you dead, my beauty. Only gasping with pleasure. And perhaps no longer so virginal.\"</p><p>Her eyes were dark and fiery as she surged to her feet and came around the fire. She knelt in front of me, and tore the neckline of her dress open, baring her neck and her breasts. \"Do not take me for an ignorant little fool,\" she said. \"If it's my virginity you want, you've no need to resort to horror stories. I'd just as soon know a man before I die.\"</p><p>I stared at her. Her breasts, round and firm with youth. Her beauty and vitality overwhelmed me, and the hunger that gnawed at me night after night rose up like a beast and demanded sustenance.</p><p>I sat up slowly, and the hunger overshadowed even the pain that movement caused. I reached for her, clasped her nape in my hand, and drew her closer. With my lips, I traced a path along her jawline from her chin, to her neck, to her collarbone, to her breasts, giving my full attention to them until the girl was breathless and arching in pleasure.</p><p>Then I slid my mouth upward again, to her neck, her delicious, salty neck. I parted my lips and suckled the skin there, feeling the rush of blood in her jugular as surely as I could feel the pounding of the waterfall outside our cave.</p> <p>Cupping her head, tugging it backward just enough, I bit down. And when my fangs pierced the vein and her blood rushed over my tongue, I felt everything she felt - including the climax that rocked her body. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>That mere sip of her blood hit me as a bolt of lightning would have. So ferocious was its power, that I dropped the woman and stumbled backward, falling onto my haunches, breathless and stunned. Only belatedly did I realize that she lay there, still, on the cold stone, her hair spread around her like a puddle of golden silk.</p><p>Scrambling to my feet, my nerves still tingling and snapping with whatever power lurked within her blood, I hurried back to her, knelt over her, and lifted her from the floor. Her hair fell like a curtain, but I saw no blood, felt no lump on her head.</p><p>\"Wake up, pretty one. Wake up.\"</p><p>Her brows furrowed into a tight little frown, and then she blinked and squinted at me as if I were a light that hurt her eyes. But the only light in the cave came from the fire beside us.</p> <p>\"What ...happened?\"</p><p>\"You don't remember?\"</p><p>Screwing her face in concentration, she nodded. \"Ah, yes. You tried to frighten me with silly vukodlak tales. And then you kissed me.\" As she said it she lifted a hand to touch her neck, where the skin was no doubt tender.</p><p>\"Did you faint from fear? Or desire?\" I asked, wondering if she had felt the power when her blood melded with my own. Had she forgotten it, in her swoon? Or was she only denying the memory because she did not understand it?</p><p>\"I faint at any overabundance of excitement,\" she said, lowering her head. \"I used to be so strong. So very strong. I could outrun and outclimb most of the boys in the village when I was growing up. I could outfight most of them, too.\"</p> <p>I couldn't help but smile. \"I don't doubt it.\"</p><p>\"You should. I'm as worn out as an old woman now.\"</p><p>It was a shame. And yet, I was beginning to understand why I'd been so compelled to save her - even when doing so would thwart my own plans - and to see the powerful impact from a mere taste of her blood.</p><p>I had to know for sure.</p><p>\"Are you ill?\" I asked. \"You said all your family had died. Is it the same sickness that took them?\"</p><p>\"I'm ill, yes. But not with the plague that took my family. It was swift and sudden, taking them with a ferocity unlike anything I'd seen.\"</p> <p>I nodded. I'd seen the ravages of the plague that had been sweeping the outlying villages. Its victims were stricken down with raging fevers, hacking coughs that threatened to tear out their lungs. Within a few days they either improved or died. It was fast and merciless.</p><p>\"It took my mother first, leaving no one but me to care for the others when they fell ill. My father. My brothers. My baby sister. She was only two.\"</p><p>I lowered my head, feeling her pain. Feeling her, more than I had before. There was a connection between us; I knew it now. And that tiny sip of her blood had strengthened it still more.</p><p>She was like me. She was one of The Chosen. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Could I tell her what she was? Should I?</p><p>God knew it was information no one had bothered to share with me. And I'd resented it - for centuries I'd resented it.</p><p>\"What ails me,\" the beautiful creature went on, \"no one knows. I only seem to grow weaker with every year and I've grown tired of being a young woman in the body of an old one. Whatever it is, it will take me sooner or later. I say, I prefer sooner. I wish to have done with it.\"</p><p>\"I see.\"</p> <p>\"You cannot possibly see.\"</p><p>I hooked my finger beneath her chin, tipping her face up to mine. \"But I do. By day, you tire easily, sleep often. Only come sundown do you feel any energy at all. When cut, you bleed profusely. And -\"</p><p>Her small gasp silenced me. Her eyes met mine, wide and amazed. \"How can you know these things?\"</p><p>\"Because I suffered from the same ailments myself, child. Long, long ago.\"</p><p>\"And yet, you live,\" she whispered. \"And you're strong. How did you cure yourself? Tell me!\"</p> <p>\"I will, if you will tell me something first.\"</p><p>\"Anything,\" she promised.</p><p>I nodded, and settled into a more comfortable position beside the fire, for my broken bones still ached.</p><p>\"What do you wish to know, my prince?\"</p><p>\"Nothing so difficult.\" I told her. \"Only just ...your name.\"</p><p>Sighing, she lowered her head. \"My name?\"</p> <p>I nodded and saw the relief in her eyes. She had expected me to ask something else, something more difficult. She whispered, \"Elisabeta.\"</p><p>\"Beautiful,\" I told her. \"Like you.\"</p><p>\"I am often called odd looking. Never beautiful.\"</p><p>\"Oh, but you are. The pale golden hair and those onyx eyes. It's a rare combination.\"</p><p>\"Rare is odd.\"</p><p>\"Diamonds are rare, Elisabeta. Not odd, but precious.\"</p><p>She lowered her head, and I saw her cheeks color. \"Will you tell me now, what you know of my ailment?\"</p><p>I glanced toward the cave's entrance, where the color of the sky was paling more than before. No longer purple, but violet near the top, and gray near the bottom. \"The sun's rising. Do you feel it? The daylight coming, tugging at your senses, drawing you to rest?\"</p> <p>\"Yes,\" she whispered. \"Yes, I do. I thought I was the only one who could sense the dawn's approach.\"</p><p>\"All those like us do. After the...the cure is taken, Elisabeta, it doesn't just call to you. It insists. I... must sleep by day. I cannot resist it, even if I try.\"</p><p>She lifted her head. \"You're falling asleep even now, aren't you? But I so want to know ... I so want to know if I can be well.\"</p><p>\"You can be...as well as I am. And I will tell you how, precious one. Stay with me, here. Sleep safe in my arms this day. And when night falls again, and I wake, I'll share with you all of my secrets.</p><p>Secrets...no one has ever known before.\"</p><p>I lay back on the stone, far from the entrance and a safe distance from the fire. Without my bidding, she came to me, and curled up beside me in the cradle of my arms.</p><p>\"These secrets I will share - could cost me all that I have. Even my life,\" I told her. \"They demand a steep price, Elisabeta.\"</p><p>\"I'm poor. I have nothing to offer a prince,\" she whispered.</p><p>\"You have everything to offer me, child. In exchange for my secrets, you must agree to stay with me...for always.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"The price for the cure...is my companionship?\"</p><p>\"Not for the cure. For the knowledge. For the secrets.\" My eyes were growing heavy, my body languorous. \"If you don't wish to take the cure -\"</p><p>\"Why would I refuse it?\"</p><p>I closed my eyes. \"You didn't want to live at all, only a short while ago.\"</p> <p>She nodded. \"I suffered this illness for the sake of my family. The weakness, the dizziness, the sick feeling in my stomach - all of it. Now that they're gone, I see no reason to go on suffering, when only death awaits me at its end. But if I could be well, if I could be cured, and...and if I could be with you... \" She nodded firmly. \"I would not refuse the cure.\"</p><p>\"You very well might,\" I said. \"But that's for later. Later, 'Beta. If you refuse the cure, you must stay with me until your mortal life ends. And if you take it, you must stay with me forever, for that is how long you will live.\"</p><p>She lifted her head, her eyes not quite believing, and with a trembling hand, she brushed the hair from my forehead. \"Does that mean you've decided not to end your own life?\"</p><p>\"If I can share it with you, Elisabeta, perhaps it might be worth going on.\"</p><p>Tears filled her eyes as she threaded her fingers in my hair.</p> <p>\"I've known you only a few short hours, my prince. And I cannot fathom why a man as glorious as you would want a peasant girl to make you such a promise. But I tell you now, I do make it. I will stay with you, for all my days, be they few or be they countless. And I make that promise without any need for your secrets. I make that promise freely. You owe me nothing in return. No secrets, no cures. It's a promise you cannot buy.\"</p><p>My heart swelled. It made no sense, I know, for I barely knew the girl, and yet I felt, for the first time in my memory, something warm filling my body besides the freshly drawn blood of a living being. It might have been hope. It might have even been...love.</p><p>\"I'll tell you the cure, Elisabeta. When I wake.\"</p><p>\"Then sleep, my prince. Sleep and I will do the same.\"</p><p>And so I slept. And she did, too, I believe. It was peaceful, and I was more content than I had ever been. But I worried, deep inside my mind. I feared what her reaction would be when I told her the truth.</p><p>That in order to live much longer, she must accept the dark gift that had been forced upon me by a demon who wanted an immortal slave in a time near the dawn of history.</p> <p>What would she do when I told her what I was? Would she believe me? Would she flee from me in horror and disgust? Or would she embrace me still?</p><p>I slept. I slept like the dead. And yet I remained, somehow, impossibly, aware of what went on without my body. I knew when someone entered the cave, a man, who called her name in a voice that was impatient.</p><p>\"Elisabeta! What do you think you're doing there! By the Gods, girl, who is that man?\"</p><p>I felt my beloved stir, and tug herself from my arms. \"It's not what you think, Uncle. I...I nearly fell from the cliffs, and the prince saved my life. He was injured in the effort, and I only -\"</p><p>\"The prince?\" The man's voice conveyed both surprise and fear. \"Move aside. Let me have a look at him.\"</p><p>And I felt the man's breath on my face, his hand, rough with calluses, on my chest as he felt for signs of life.</p><p>\"He asked me to stay with him until he wakes.\"</p><p>\"Oh, he won't be waking, girl. He's dead. The prince is dead, God help us all.\"</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Elisabeta wept. I felt her pain washing through me and I heard her tears, every one of them, as they spilled to the stone floor, and onto my body. \"He cannot be dead,\" she cried. \"He cannot be.\"</p><p>\"Stop. Don't act that way. Lord above us, what will the villagers think?\"</p><p>\"I don't care!\" she cried. \"I don't care!\"</p><p>God, why did the old fool have to come? She would have rested by my side until I woke at sundown.</p> <p>She would have been all right. But now -</p><p>\"Where are you going, girl? What do you think you're about?\"</p><p>She called back, from somewhere farther away. \"If he's gone, then I'm going with him. I don't want to live!\"</p><p>If the bastard let her fling herself from those cliffs, I vowed in helpless silence and impotent rage, I would kill him when I woke. I would!</p><p>I heard his footsteps pounding on the stone, and then I heard no more. And with her absence, the day sleep closed in and claimed the consciousness to which I had clung.</p> <p>I knew no more until nightfall, when energy and life seeped back into me as it did at sunset every night.</p><p>My veins sang, my skin tingled, my lungs filled with their first breath in many hours, and my eyes opened.</p><p>She lay across my chest, weeping. \"Why? Oh, cruel fate, why? Why did you give me hope only to tear it away from me again? Why did you give me love only to replace it with pain deeper than any I'd felt before. Why?\"</p><p>My shirt was wet with her tears. I felt their warmth on my skin. And only then did I realize we were no longer in the cave. We were in my so-called father's private chapel.</p><p>I lay on a bier surrounded by candles. No coffin. No flowers, not yet. Had the king been told of my condition I'd have no doubt been safe in my own rooms by now, awaiting my nightly resurrection - he'd seen me in a deathlike slumber before, and knew I would return. How he explained it to himself, I know not. I only know he loved me as a son and trusted me.</p><p>But since I was here, he must still be away, on the secretive journey he'd undertaken a day earlier.</p> <p>She was here, though. My beloved Elisabeta. And I couldn't bear to see her cry. I lifted my hand and stroked her hair.</p><p>She shot up from where she'd lain upon my chest, gazing down at me with eyes wider than the moon. \"</p><p>Prin meu? My prince?\"</p><p>\"Do not weep, child. I'm not dead. I was...I was only sleeping.\"</p><p>\"You were cold!\"</p><p>I nodded, gathering my wits about me, sitting up slowly. \"Don't be afraid. This...Elisabeta, this is part of the secret I promised to share with you.\" I lowered my head, cursing myself for a fool. Was I truly about to trust this stranger with my life?</p><p>Yes. I was - she was no stranger and I knew it by then. \"By day I rest, and in my rest, I seem to all the world like a dead man. But I am not.\"</p><p>\"Then...what are you?\"</p> <p>\"A man. A lonely man, who will live forever. A prince in need of a princess, Elisabeta. I am immortal. I am...\"</p><p>\"Undead,\" she whispered. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The horror in her eyes was like a blade to my heart as she stumbled backward, away from me. One hand pressed to her heart, but she moved it all at once, to press her fingertips to her throat, where I had tasted her.</p><p>\"You...you...\"</p><p>\"I am the same man you met last night. No more. No less. You have nothing to fear from me, Elisabeta.\"</p><p>\"Nothing to fear? How can you say that?\" She stared at the polished onyx floor as she backed away from me. Her feet, bare last night, were clad in thin slippers now, worn, their color faded. The dress she wore was different, as well, a dark purple linen garment, beneath a threadbare black cloak with a hood that hung from her shoulders. \"You are a demon. A monster.\"</p> <p>I flinched and told myself not to let the words hurt me. She didn't understand. She was afraid. \"I am no monster. I'm a man, I tell you.\" I swung my legs from the bier, let them hang over the side. \"Won't you listen to me? Let me explain?\"</p><p>She brought her head up, fixing her gleaming black eyes on mine. \"You told me you knew a cure for the ailment that is killing me. What could be more monstrous than to lie to me about my very life? My very...death?\" She shuddered on the final word.</p><p>\"You didn't have any fear of death last night, Elisabeta. What's changed?\"</p><p>\"You gave me hope. False hope.\"</p><p>She whirled to run from the small, stone chapel, but by then my strength was with me again, every injury from the day before healed, and the power of the night surging in my veins.</p> <p>I lunged after her, moving faster than her eyes could have hoped to follow. To her, it seemed I simply appeared in front of her to block her escape. And even as she tried to stop short, and fell instead, against my chest, I caught her shoulders and held her tight. She tugged against me and shrieked, \"Let me go!\"</p><p>\"It wasn't false hope. I can help you. I can save you.\" I shook her. \"Do you hear me? I can!\"</p><p>Her struggles ceased. She stared up at me with huge eyes, finally, it seemed, hearing my words. Pale and frightened, close to fainting, I guessed, from the excitement, she searched my face and whispered,</p><p>\"How?\"</p><p>\"Then you're ready to listen to me? Finally?\"</p><p>She blinked twice, and after a moment, nodded. \"I'll listen. I suppose if you intended to kill me you could have done so last night.\"</p> <p>\"I could. But I would not rob the world of such a gift.\" I looked around the chapel. \"Does anyone know you're here?\"</p><p>\"No, I -\" She bit her lip as if she regretted the admission, but then seeing no need of pretense, she went on. \"I snuck in. I...I wanted to see you. They said you were dead.\"</p><p>\"But you know now that I was only sleeping, as we all must by day. By night, my energy is boundless.\"</p><p>Her brows bent together. \"I am much the same - though my energy is never boundless, it is greater at night.\"</p><p>\"Oh, Elisabeta, we are more the same than you could begin to imagine. Come, let us leave this place and go where we can talk comfortably.\" I took her arm, but she resisted. I looked again into her eyes.</p><p>\"You felt something for me last night, 'Beta. Now you feel only fear. Which of the two is more real?</p><p>Which do you trust?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She never answered the question, but she came with me. I led her through the stone chapel to a small door in the back.</p><p>\"What of the servants who placed you here?\" she asked. \"If they return to check on you, they'll be shocked to find you gone.\"</p><p>\"They will not return to check on me. They've heard too many rumors. They fear me.\"</p><p>She lowered her head as we exited and moved through the night. I led her to the meadow, where my stallion grazed alone.</p> <p>\"He grazes by night?\" she whispered. \"While the others are all penned up in their stalls?\"</p><p>\"By my command. If I'm about by night, it's logical my mount should be, as well.\"</p><p>\"It only stirs more gossip,\" she told me.</p><p>\"My very existence stirs gossip,\" I said with a sigh. \"I should leave this place.\"</p><p>\"Why haven't you?\"</p> <p>I sent a thought to my horse, and whispered, \"Come, Soare. \" He swung his head toward me, shook his mane, then galloped across the meadow, stopping beside me. I leapt upon his back, and reached down for her.</p><p>\"Soare,\" she repeated. \"Sun. A strange name for a horse as black as midnight.\"</p><p>\"Not so strange to me.\" I took her hand and pulled her up, settling her in front of me.</p><p>\"No stranger, I suppose, than a horse who wears no saddle, bears no reins.\"</p><p>\"I don't need them to direct him.\"</p><p>\"He seems, almost, to hear your thoughts.\"</p> <p>\"He does. You can, too.\" I gazed down at her as Soare carried us away, and I thought, You are beautiful, Elisabeta.</p><p>She gasped and stared up at me in surprise.</p><p>\"You see? It's not all bad, being as I am.\"</p><p>\"Then it's true. You are what they say you are? Undead? Vampyre? \"</p><p>\"That's what some call what I am. But it tells you nothing about what I truly am, 'Beta. It tells you nothing about me, \" I said, thudding a fist to my heart.</p><p>\"Then tell me. Tell me about you, my prince. Tell me why you stay here, when you are so very unhappy, and when the villagers speak of you only in fear-filled whispers. Tell me that above all else.\"</p><p>I nodded, and guided Soare with my thoughts, to take us over the twisting path through the forest. \"I came here because it was once my homeland. I truly am a prince of this place, you see. But the gossips have one bit right. The king is not my father. I am, in fact, one of his forebears.\"</p><p>\"It's beyond belief.\"</p> <p>I nodded. It was, to most. \"I used my powers and my strength to convince the king that I was his son, when in truth his son died in battle several years before my arrival.\"</p><p>\"How could you convince the king to believe such a thing?\"</p><p>The way her body rested against mine gave me a feeling of warmth I had seldom known, and I relished it. She wasn't afraid. Not yet. \"I can...control the thoughts and minds of many.\"</p><p>She lifted her gaze. \"Mine?\"</p><p>\"I've no wish to try, 'Beta. Never fear.\"</p><p>She smiled. \"Go on with your story.\"</p><p>I nodded and went on. \"You see, there is a woman. An immortal, like me, who has certain gifts of...prophecy. Necromancy. Divination.\"</p><p>\"What is her name?\"</p><p>\"Rhianikki. Or it was. She changes it from time to time. She was a princess and priestess of Egypt. One who accepted the gift when I offered it to her.\"</p><p>\"So you're here because of a woman.\"</p><p>\"Because of what that woman told me. What she saw in my future. She told me I would find my soul's true love, here in this place. That's why I've stayed. But until I saw you, on the cliffs last night, I had given up hope.\"</p><p>Her face went as still as stone. \"You mean...you believe it's me?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I'm going to let you be the judge of that,\" I told her. \"Once you've heard my story.\"</p><p>I bade Soarse halt, then slid from the stallion's back, and helped Elisabeta to the ground, as well. We were in a tiny wildflower-strewn clearing, surrounded by trees on three sides, and the river on the fourth.</p><p>A deer stood nearby, nibbling red clover blossoms, unafraid.</p><p>\"I was ill as you are now, weak and growing weaker. I was thirty years old, at the time. And one night I was simply taken from my bed by a man as strong as ten men should have been. He took me to his home, a crumbling ruin of a castle, and there he...well, he made me into what he was.\"</p> <p>She stood looking up at me, her hands still resting on my shoulders. \"How?\"</p><p>\"I don't want to frighten you with such -\"</p><p>\"How?\" she asked again.</p><p>Yes. She needed to know, all of it. \"He sank his teeth into my neck, right here.\" I touched her neck. \"It wasn't painful, as you know. But he didn't merely taste me in passion, as I did with you last night. He drank from me until I was all but drained. And then he made me drink from him. And I did.\"</p><p>A soft gasp was her only reaction.</p> <p>\"When it was done, I slept as if dead. I thought myself to be dead as I drifted into that slumber, for it was far deeper than any sleep I had ever known. And when I woke...I was changed.\"</p><p>Her face was pale in the darkness. She seemed afraid and yet eager to hear all I had to tell her.</p><p>\"Changed in what ways? Did you feel differently? Look differently?\"</p><p>I nodded. \"My senses were heightened to a point where it was nearly unbearable at first. Every touch was magnified a thousand times, and more so with every year I live. Be it pain...or pleasure.\"</p><p>\"Oh.\" She averted her eyes.</p><p>\"My hearing was acute. My eyesight, like an eagle's. My weakness - gone and replaced by a strength such as no human being has ever known. I can run too fast to be seen by mortal eyes. I can leap, to the top of this tree if I wish it. I can listen to the thoughts of humans, and other immortals, as well, and speak to them and...there's so much, 'Beta. So much. I'm immortal, ever young, ever strong.\"</p> <p>She nodded slowly, turning to pace away from me, and then sitting in the grasses and flowers. I moved to sit beside her. \"You make it all sound wonderful.\"</p><p>\"It is...or, it could be.\"</p><p>\"Then why had you decided to take your own life last night?\"</p><p>I looked at her sharply. \"You are too insightful for me,\" I told her. \"But you're correct, there are...drawbacks to living this life. I can never see the sun again. It would burn me to cinders.\"</p><p>\"Then...you can die?\"</p><p>\"Everything can die. I think in time, everything does. I can die, from the sunlight, or by fire. An open flame is a dangerous thing to a man like me. A cut, even a minor one, could cause me to bleed to death.</p><p>And pain for me is...it's excruciating.\"</p><p>\"I see.\"</p> <p>\"But worse than all of those things is the loneliness. When you live so long, Elisabeta, everything you know dies before you. Kingdoms come and go. Ways of life, entire civilizations pass out of existence, and yet, you go on.\"</p><p>\"Searching,\" she whispered. \"For someone to share it with.\"</p><p>\"Yes. Exactly that.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"How old are you,\" she whispered.</p><p>I lowered my head. \"I have lived more than four thousand years.\"</p><p>She blinked and nodded slowly. \"And what about...what about what they say about you. That you have to drink the blood of virgins to survive?\"</p><p>I met her eyes, smiling slightly. \"Living blood. Be it that of virgins or sheep. And I don't need to kill in order to feed, little 'Beta. I tasted of your blood last night - only a sip. And yet you live.\"</p> <p>She lowered her eyes from mine. \"It was a sensation I...I never...\"</p><p>\"I know. I felt it, too.\" I stroked her golden hair, remembering, my blood heating, my hunger growing.</p><p>\"Is it always like that?\"</p><p>\"No. At first I didn't know why the sensations of blood sharing were so exaggerated with you. But I think I understand now.\"</p><p>\"Then make me understand.\"</p> <p>I nodded. \"Most humans cannot become what I am, Elisabeta. Only a select few. It's something about the blood, something different, and unique. Among my kind we call those unique ones The Chosen. We sense them, are drawn to them inexplicably and irresistibly. There is a powerful attraction between the Undead and The Chosen. \"</p><p>\"On both sides?\"</p><p>\"Yes,\" I whispered, my fingertips stroking her cheek.</p><p>\"And what of my illness? We share that, as well?\"</p><p>I nodded. \"The Chosen always grow weak and sick. They die young unless they are changed. For you, death is near - few months, perhaps weeks away. I don't want to let it take you.\"</p><p>\"I don't know,\" she whispered. \"I don't know if I can bear to live a life such as you've described to me. I don't know if I can...\"</p> <p>\"Let me show you how it can be, between us. Let me show you, Elisabeta. Only then can you decide.\"</p><p>\"I...\" She looked up at me, afraid and yet curious, and aching for something she did not understand.</p><p>\"Let me make love to you, 'Beta.\"</p><p>\"I want that so much. But - you won't change me?\"</p><p>\"I vow it to you. I will not change you.\"</p><p>\"Then yes, prin meu. Yes.\"</p><p>I kissed her then. I pressed my mouth to hers and tasted her lips, slid my tongue between them to sample the moistness inside. And she gasped and was stiff and tense.</p><p>I lifted my head. \"I can make it easier for you,\" I told her.</p> <p>\"How?\"</p><p>\"I can take the fear and the inhibitions from your mind by commanding it with my own. Would you like that, Elisabeta?\"</p><p>She blinked in surprise. \"To surrender to you? My very mind?\"</p><p>\"Yes. Surrender to me. Your mind. Your body. Your soul.\" I nuzzled her neck, her shoulder, and lowered her body into the deep grasses. \"Say yes, Elisabeta. Give yourself over, just for a little while.</p><p>Trust me.\"</p><p>\"I do trust you.\"</p><p>\"Then...\" I sat up and left her lying there. I probed into her mind with the power of my own, and took what I had been asking her to give me. \"You have no fear of me, Elisabeta. You know I will never harm you. You trust me utterly.\"</p><p>\"Yes,\" she whispered, and the fear and hesitation fled from her eyes, from her mind. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I freed the clasp of her cloak, and spread it open, then slowly unlaced the dress she wore down the front.</p><p>Her breasts strained against the fabric, until I pushed it away, baring them to the night sky, to my eyes, to my touch.</p><p>I did not take control of her mind. I wanted her to give herself to me freely. But I did ease the fears and the shyness away. I soothed her, whispering to her innermost soul that she could trust me utterly. And she could, it was nothing less than the truth.</p><p>My lips traced a path over her neck and chest, to her breasts, and then I took them, suckled them deeply and hungrily, one and then the other. My lady's hands clasped my head, held me to her, arched her back, and from within her mind I knew the delicious sensations coursing through her. I knew her every thought, her every desire. When she wished my tongue to flick over her stiffening peaks, I complied. And when she wanted the pinch of my teeth, I gave it to her.</p> <p>And all the while, my own desire grew. I rubbed against her outer thigh, to show her, and in a vain effort to seek release, though it only served to arouse me more. When I lifted her skirts, she began to stiffen up again.</p><p>No, my love, I whispered to her inside her mind. No, you aren't afraid. You want this. You know you do. You want my touch. Here ...</p><p>And with the thoughts, I pressed my hand to her center. She whimpered and moved against me, until I parted her folds and explored within. Heat and wetness greeted me.</p><p>I wanted more than I had ever wanted before as I probed and plumbed the very depths of her, and then focused all my attention on the center of her desire, the tiny kernel of flesh that set off a thousand sensations when I pressed and squeezed and rolled it.</p><p>Her cries grew louder, unabashedly animalistic while my hand worked her center, and my mouth, her breasts. I grew rougher, hungrier, and she seemed to enjoy it all the more.</p> <p>Impatient now, the bloodlust raging in me, I opened the dress down the front, and parted it so that I could see all of her. Utterly naked, exposed to me. In a flash her hands flew to cover her body.</p><p>I sat up over her, staring down. \"No, Elisabeta. You are mine, body and soul. You want to give yourself over to my every desire. Don't you?\"</p><p>\"Yes.\"</p><p>\"Then say it.\"</p><p>\"I am yours,\" she moaned. \"And you are mine, my prince.\"</p><p>I stripped away my garments in a frenzy of desire, and then I lay atop her, my hands pressing her thighs apart as I lowered myself to her center, and without hesitation, slid inside.</p> <p>She gasped, her nails digging into my shoulders and her thighs going taut.</p><p>\"Open to me,\" I whispered.</p><p>And she did; she opened wide and I sank myself inside her to the very depths of her, like burying myself in a sweet haven from which I never wished to emerge. I pulled back and drove again as she moaned in sensation.</p><p>With my hand I tipped her head to one side, and pushed the golden hair away from the skin of her neck, baring it, and watching the tiny pulse beat just beneath the flesh as I took her body and lowered my head to take her blood, as well. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I sank my teeth into her throat and she screamed and I knew it wasn't in pain, but in the most exquisite pleasure she had ever known.</p><p>The orgasm rocked her body as I fed, and it was echoed in my own until I forced myself to release her neck, to ease my body down beside hers. I held her gently in my arms until the waves of pleasure subsided. It was, I knew, beyond ordinary release. Beyond even, preternatural sensation. Beyond anything I had ever known, and certainly far beyond anything she had ever imagined.</p><p>Breathless, she whispered, \"I never knew it was...it would be like...\"</p><p>\"It's not. Or not with anyone else, 'Beta. It never has been.\"</p> <p>She looked up, surprised. \"Really?\"</p><p>\"I'm as stunned by it as you are,\" I told her. \"Though, perhaps, not surprised. I've been told that sharing blood with one of The Chosen can be overpowering.\"</p><p>She snuggled closer into my arms. \"It was. And wonderful. But -\"</p><p>\"But?\" I felt the cold finger of panic touch my heart. To me, in my mind, that act of lovemaking, of blood sharing, had bound this woman to me. I thought I had claimed her as my own, and she had claimed me as hers. It hadn't occurred to me that she might feel differently. \"You still have doubts?\"</p><p>\"I...\" She seemed to search for words. \"Making love to you is heaven. Beyond heaven. But it tells me nothing of living as...as you must live. Nothing of being...what you are.\"</p> <p>I lowered my head, my heart sinking. \"I thought it would be enough.\"</p><p>Her palm cupped my face. \"It may very well be, my prince. My love. But I'm not yet at death's door.</p><p>Can you not give me time to know more? After all, it's more than the decision of a lifetime. It's a decision for all time.\"</p><p>\"What can you learn in time that you don't already know?\"</p><p>\"I could be with you. Live with you. As you do.\"</p><p>I was impatient, angry, perhaps, but unsure why. I suppose I wanted her unabashed acceptance, rather than something so noncommittal.</p> <p>\"My love,\" she said softly. \"You told me that once I knew your secrets, I would be bound to you for all my days. Be they many or be they few. I have no desire to alter that decree. I wish to be with you, from this day forward. That I know. My only uncertainty lies not with you, but with myself. I need to decide whether my days with you will be those of my mortal lifetime - or the endless days of eternity. And for that I need more time.\" She brushed her lips over mine. \"Do you understand my feelings, love?\"</p><p>I swallowed. \"I do, but I don't like the notion of waiting. Anything could happen, 'Beta. As long as you remain mortal, you cling to the fragile lifetime of a mortal. The smallest accident or illness could take you from me before I could do a thing to prevent it. By the Gods, woman, your family perished of the plague.\"</p><p>\"But I did not. It was weeks ago - and I'm not ill. Not with the plague, at least.\"</p><p>I sighed, pulling her tightly into my arms. \"I don't think I can let you go, 'Beta.\"</p><p>\"Give me a few days, my love. Enough to become used to this idea. Enough to...to adjust, to understand and accept. Please?\"</p><p>I stared at her for a long moment, at the genuine feeling in her eyes. And at last I said, \"Yes. I will give you the time you ask for, if you will give me something in return.\"</p><p>\"Anything,\" she whispered, and blushing added, \"though I believe I've already given you all that I have of value.\"</p><p>\"What you've given me is priceless. What I ask is even more so. Give me your hand, Elisabeta. Be my bride. Marry me. Tonight.\"</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"Marry you? T-tonight?\" Her wide black eyes seemed endlessly deep with wonder, and a hint of disbelief. \"How can you know me enough to make me your wife after an acquaintance of mere hours?\"</p><p>\"Think about it, 'Beta. Had we never met, neither of us would be alive tonight. I had no wish to be alive before I found you - nor did you before that fateful meeting on the cliffs. How is it so difficult, then, to believe that we belong together?\"</p><p>\"Is that what you really believe?\"</p><p>\"It is,\" I told her, and it was true. I did believe it. I still do. \"We have no one to answer to, 'Beta. We can do this if we wish it. I'm the prince, I do as I please. And you have no family to object.\"</p> <p>She looked up at me, smiling in a watery way that made my throat go tight. \"I do believe I love you, prin meu. Yes. No matter how I end up choosing to spend my time with you, I will marry you.\"</p><p>I gathered her into my arms, lifting her off her feet and spinning her around and around, and then I lowered her slowly as our lips met, and mated. I do believe that night was the happiest I had ever known until that point. Certainly there have been none better since.</p><p>Together we raced back to the village that spread out in the shadow of the castle on high, and to the home of the priest. We woke him from his sleep, stood in his doorway as he gazed at us, wondering what we were about.</p><p>\"What's this?\" he asked. And then his gaze took focus and his eyes went wide. \"Your highness! I had been told you were dead!\"</p><p>\"The castle servants are bumbling fools, I'm afraid. I was laid out in my father's chapel, awaiting your visit - which I'm sure was impending,\" I added with a meaningful crook of my brow.</p> <p>\"Naturally, my liege! I had only thought it best to wait for daylight.\"</p><p>Ah, so the superstitious gossip had instigated fear of me even in a man of God. It didn't matter. I should have been angry, but I was too happy then to let his ignorance cause me any concern.</p><p>\"I was suffering from little more than a blow to the head, which left me in a deep stupor for a matter of hours. I'm fine now, as you can see.\"</p><p>\"Yes, yes. Do come inside. I've a warm fire, bread and wine if you wish.\"</p><p>\"We have only one wish this night, Father,\" I told him, turning to gaze into my beloved's eyes. \"To be wed.\"</p><p>We had followed him inside his small cottage, and he stood now with the plank door still open.</p> <p>\"Tonight?\"</p><p>\"Indeed. Within the hour if you can manage it.\"</p><p>\"But...but there's been no betrothal. No reading of the -\"</p><p>\"Nor will there be,\" I said, my voice lowering slightly.</p><p>The priest stared from me to Elisabeta, and then he frowned. \"This child is still in mourning for her family.\"</p><p>\"We will be wed this very night, unless you wish to find yourself in the castle dungeon before dawn,\" I told him.</p><p>I felt my 'Beta go stiff beside me, felt her gaze turn to one of disapproval as her hand tightened on my arm. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The priest sucked in a sharp gasp, and 'Beta held my eyes and shook her head firmly. \"Not like that, my love. Not like that.\" And then she turned to the priest. \"Marry us, or don't. You'll not be harmed either way. We shall simply leave this place and find another who will.\"</p><p>He agreed, not because of her reasoning, but out of fear of me. He knew I did not make threats I would not carry out, and didn't trust this mite of a woman's ability to temper my rage. Nodding his acceptance, he said, \"I will meet with you in the castle's chapel in an hour. Is that acceptable?\"</p><p>\"It is,\" I told him, and with my bride in the circle of my arms, I tugged her from the cottage.</p><p>From there we mounted my horse and rode to the castle, where we woke every servant and friend, relative and guest of the king. He still hadn't returned from whatever journey he'd undertaken, which worried me. The man believed me to be his son, despite that it wasn't so. He didn't often keep things from me.</p> <p>At any rate, I shouted orders in a way that must have shocked and surprised them all, for I tended to keep to myself and to remain quiet and undemanding, so long as my privacy was respected. Not tonight.</p><p>Tonight my often morose expression was replaced with a beaming smile, and my orders were given joyfully.</p><p>By the time the hour had passed, the servants had located a beautiful gown for my lady - the color of rich cream. They had gathered flowers for her to carry, and even tucked a few blossoms into her hair; forget-me-nots, their tiny blue heads as delicate as 'Beta herself. They had awakened minstrels and the cook to alert them to the impending celebration and set them to work preparing the hall.</p><p>\"You are so beautiful,\" I told my bride as she came to stand beside me before the priest. \"I am almost convinced this is all no more than a sweet dream, and that I will awaken to the lonely reality of my life as it was before.\"</p><p>\"It is a dream,\" she told me softly. \"A dream come true.\"</p> <p>The tiny stone chapel was filled with people - strangers, servants and people who feared me - as my beloved and I knelt at the altar that night, and she pledged to be mine forever, and I pledged to cherish her always. Little did those gathered to witness our vows know just how much more those promises meant when spoken by a man who would never die.</p><p>And then it was done, and I took her into my arms and sealed our bond by pressing my lips to hers. I thought that fate, for once, had smiled upon me. I was glad to be alive for the first time in centuries. I relished this life; I thanked the fates that it was eternal, for surely I thought 'Beta would agree to let me share the dark gift with her. To make her as I was. To be with me for all eternity.</p><p>Surely she would. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>As eager as I was to carry my bride to our bedchamber, I knew she deserved a celebration worthy of her. For though a commoner, she was far more. A descendant, no doubt, of some ancient royal line. It was the tale I would weave for the world. And one I had no reason to doubt could be true.</p><p>For how could a family produce a woman like her without having royal blood in its lineage? How? One so perfect, with the face of an angel and the gold-spun hair to go with it. And those eyes, those piercing, bewitching black eyes.</p><p>How I loved her. My jewel. My princess.</p><p>Musicians played their lyres and flutes as we entered the castle hall. The cooks began lining tables with the foods they'd managed to prepare in short order, while the smells of still-roasting meats filled the hall and watered the mouths of all present. Ale and wine flowed, and I danced with my bride and saw her cheeks pink with joy, even though the rest of her countenance seemed to pale.</p> <p>Holding her in my arms, I frowned at her. \"Are you feeling worn out from all of this?\"</p><p>\"Only a little tired. But my love, I don't wish for this night to end.\"</p><p>\"It must. All nights do. Be we need not end, 'Beta. Not ever.\"</p><p>She smiled and rested her head against me. \"I know.\"</p><p>Before I could ask if that meant she had made up her mind, the doors burst open, and the entire room fell silent. The music and dancing stopped. The eating and talking stopped. Everyone went still. I turned to see my so-called father, the king, standing just inside the entryway, flanked by soldiers-in-arms.</p> <p>He found my gaze across the crowed room, spoke softly to his men, and made his way to me. \"It seems I've interrupted a celebration,\" he said. \"And my morose son, with a smile on his face and a beautiful prize in his arms. Dare I hope -?\"</p><p>\"She is my wife, Father,\" I told him. \"Elisabeta. Your father and your king.\"</p><p>I felt her hand tremble as she dropped to her knees before the king, lowering her head.</p><p>\"Rise, child. Rise,\" the king said. He bent, and taking her shoulders, helped her to stand. \"You are a princess, and far too special and beautiful to bow before an old man.\" Smiling, he kissed her cheeks, then turned to face me, still holding 'Beta's hands. \"So sudden?\"</p><p>\"I had only to gaze upon her once to know she was the one,\" I said, uncustomarily sentimental. \"I could not wait, not even for you.\"</p><p>\"I would not have had you delay. Truly, you've claimed a rare treasure, my son. I only wish I didn't have to spoil your celebration with dire news.\"</p> <p>I frowned. \"You went on a secret journey - and took with you soldiers, I see,\" I said, nodding toward the soldiers who remained near the door. \"Soldiers who don't seem eager to join in tonight's revelry.\"</p><p>The king grabbed a passing servant. \"Tell my men they may eat, but not drink any wine or ale. And remind them to remain alert,\" he commanded.</p><p>This alarmed me more. \"What is it, my king?\"</p><p>\"I left to verify rumors of enemy troops amassing at our northern borders. Saw no reason to disturb you with what was, then, just gossip. But I found it to be true. We are being invaded, my son. We are...at war.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"We need to turn them back before they cross the river. My son, we need every man, or the kingdom will fall.\"</p><p>I owed the man so much. My life. Had he not taken me in, accepted me as his son, I would never have found my wonderful bride. I could not refuse him. And I knew what he did not - that I was his most powerful warrior. Turning, I stared down at Elisabeta.</p><p>She gazed up at me, love and fear in her eyes. \"I don't want you to go,\" she whispered.</p><p>\"I wish I didn't have to. Come.\" I took her with me, leaving my father to put an end to the revelry as he must. We climbed the curving stone staircase to my bedchamber - our bedchamber.</p> <p>Its window hole was covered by thick layers of black cloth, for my protection when I slept there by day.</p><p>The bed was huge and comfortable, and it, too, was surrounded in dark curtains as an added defense against the sun. The door could be barred from within. I didn't bar it, only closed it behind us, and moving to the window, I tore the cloth away.</p><p>\"My bride will see the sun for as long as she can,\" I told her.</p><p>\"Put it back!\" She flung herself into my arms. \"I've made my decision,\" she told me. \"I'll be as you are, I will. I wish to be with you always. Just please, don't go. Don't go to war, my love.\"</p><p>I held her, rocked her gently in my arms, kissed her hair, her face. \"Don't fear for me, my precious 'Beta.</p> <p>I'm immortal.\"</p><p>\"But you can die. You told me so! The sun, the bleeding...suppose you are pierced with a sword or an arrow?\"</p><p>\"I promise you, I will not die. I will return to you. And when I do, if you still wish it, I'll instill in you the spirit that lives in me. That of eternal life.\"</p><p>\"Do it now.\"</p><p>I pushed her hair from her tear damp face, and shook my head. \"I need to be with you afterward. I need to help you understand what you'll be experiencing, to explain to you, to hold you through it all. It's like a death, Elisabeta. A death and a rebirthing. You cannot go through such a change alone. I won't have it.\"</p><p>\"Then stay. Stay and do all those things. Stay with me for always as you promised to do before the priest!\"</p> <p>I lowered my head as grief made my voice catch in my throat. \"I cannot. I simply cannot.\"</p><p>She trembled and wept, and I tipped her face to mine and kissed her, tasting her tears. \"I love you, 'Beta.</p><p>Who knew a man could fall so deeply in love so suddenly? You...you've stricken my heart like a bolt of lightning. Nothing could keep me from you. Not ever.\"</p><p>\"Let me come with you,\" she whispered against my neck.</p><p>I closed my eyes in sweet agony. Gods, it was tempting. To have her by my side...but I knew better.</p><p>\"You're not strong enough. You must conserve your energy, rest, and be well until I return. The battle will be fierce and I expect, over within a day or two at most.\"</p><p>\"What if it's more?\" she asked me. \"What if you stay away too long and I die in your absence?\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"If it's more than two days, I'll return for you. You have weeks, perhaps months yet, 'Beta. I promise.\"</p><p>\"I love you,\" she told me.</p><p>\"You are the princess of this keep,\" I told her. \"There is no queen. Anything you desire, you have but to ask. The servants love you already.\"</p><p>I heard horses below as soldiers made ready. \"I have to go.\"</p> <p>\"I love you,\" she told me, again, and kissed me desperately. \"With all I am, I love you!\"</p><p>\"And I you.\" With deep regret, I withdrew from her arms to don my battle gear, my weapons. She walked with me down the stairs and out into the courtyard, and bless her for it, her eyes were dry as we joined the others there, her chin held high. Queen-like, she was. Glorious.</p><p>I kissed her once more as I mounted Soare, and I felt her eyes on my back as we all rode away to face battle.</p><p>It was fierce, the combat. We fought for three days straight, and all that prevented me from returning to her after the first two as I had promised, was the certainty that it would end on the third. We had but to press on to achieve our victory. For me to pull out then might have ensured defeat. And so I broke my promise to my bride.</p><p>When I returned, it was to see the chapel doors thrown wide, servants, villagers, everyone who hadn't been with us in battle, filing in and out, wailing and weeping aloud. Flower petals lined the path outside.</p> <p>Frowning, I dismounted and hurried forward, asking first one person and then another what was happening. Was this a service for all the fallen soldiers? It couldn't have been for we had only just returned with their bodies.</p><p>But each person I approached only looked at me in something like shock, and then backed away, crossing themselves and muttering prayers.</p><p>Baffled, I shouldered my way through the crowd, and into the chapel. And then I died inside, for I saw her.</p><p>My beloved Elisabeta lay on the same bier where she had wept for me only four nights prior. Her golden hair spread around her, and the finest gown she had ever owned covered her slender frame.</p><p>A cry like that of a wounded animal was wrenched from the depths of my soul as I ran to her, gathered her into my arms, and felt no life in her. She was cold. Stiff.</p><p>\"No! No!\" I cried. \"By the Gods, it cannot be.\"</p> <p>\"Come, my son -\"</p><p>The priest was there, his hand on my shoulder, but I whirled on him, on all of them, screaming at them to get out. To leave me to my grief. And they did, all except one mourner who waited silently, in the shadows a good distance from me. For hours she waited there, while I wept and held Elisabeta's body in my arms, and railed against the Gods, against Fate for having given me such bliss only to rip it from my hands.</p><p>Eventually, the rage ebbed and I knew what I must do. If my beloved would leave this life, then I would go with her. I'd no desire to live without her. And perhaps, somehow, we would be together again on the other side.</p><p>My decision made, I moved to return to the cliffs where my life would end, after all. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"It's nearing dawn,\" a woman's voice said. \"You weep over her body any longer and you'll burn with the sunrise.\"</p><p>I gently laid Elisabeta's body down, and turned to face the woman.</p><p>I knew her. I had given her the Dark Gift long, long ago, when she'd been a princess in Egypt, rejected by her father, the Pharoah, and sent to the temple to be raised by Priestesses of Isis.</p><p>\"Rhianikki,\" I said.</p> <p>\"I go by Rhiannon now.\" She stepped out of the shadows, her long jet black hair reaching to her waist, a gown of fine gold fabric draping from her shoulders to her feet and leaving her slender arms bare. She nodded to a spot beyond me. \"It's a beautiful likeness, isn't it?\"</p><p>I turned to see a painting, a portrait of my Elisabeta hanging on the chapel wall. It so captured her beauty and her spirit, it took my breath away.</p><p>\"She had the artist working day and night from the moment you left. It was to be a wedding gift to you upon your return.\"</p><p>I could barely raise my head, my grief was so powerful. \"What happened to her?\" I asked.</p><p>\"She was told you had died in battle. That uncle of hers, I believe. She didn't believe it until the second day had passed without word. It was only twelve hours ago, at dawn on the third day, that she threw herself from the tower, in order to join you, her prince. One of the servants heard her cry out that were you alive, you would have returned to her by then. She'd barred the chamber door from within; no one could get to her in time.\"</p> <p>It was more than I could bear. I dropped to my knees. \"Then it was my broken promise that cost her life.\" Shaking my head, I said, \"Why did you tell me I would find her here, if she was only going to leave me again, Rhiannon?\"</p><p>She sighed and lowered her head. \"It wasn't supposed to happen this way. I did not foresee this, my friend.\"</p><p>I nodded, believing her. \"No matter. I will join her, soon enough.\"</p><p>Rhiannon came to me, placed her hand on my shoulder. \"Always you've been so morose. Always.</p><p>Hating your eternal life, resenting it, mourning your loneliness. There's nothing in the world so tiresome as a vampire unable to embrace his nature. At least now you have reason for your constant melancholy.\"</p><p>I lifted my head, knew she was leading up to some argument as to why I should live on. \"I won't go on without her,\" I said, hoping to forestall her words.</p> <p>\"Yes,\" she said, \"you will. Shall I tell you why?\"</p><p>Blinking the salty dryness from my eyes, I nodded, and managed to get to my feet again. \"I don't suppose I have a choice. Go on, tell me why I would put myself through the hell of living even one more day without her?\"</p><p>\"I have had a vision,\" she told me. \"I don't get them often - less and less as I grow older and more powerful. But this one was real and it was strong. Do not even think to doubt its veracity.\"</p><p>\"No one dares to doubt or question the immortal princess of the Nile, do they?\" Bitterness, not humor, laced my words. \"Go on, if you must. I cannot walk into the sunrise until it comes, and there is still an hour of hell to endure before then. So go on, tell me of this vision.\"</p><p>\"She will return to you.\"</p><p>My head came up, my heart leaping in my chest.</p><p>\"Oh, it will not be easy. For first and foremost you must remain alive until she does. If not, there's no telling whether the two of you will ever find one another again. So you cannot, you see, walk into the sunrise. You must live, in spite of your pain. For her.\"</p><p>I shook my head. \"I would do anything for her. But...for how long?\"</p> <p>Even the most hard-hearted vampiress in the world could not hold my gaze as she whispered the length of my sentence. \"Five-hundred years. Or thereabouts.\"</p><p>I stumbled. She caught me, kept me from falling.</p><p>\"You will find her in a place called New Hampshire. In a village called Endover. That is where she will return to you five centuries hence - if you can endure that long.\"</p><p>I faced Rhiannon squarely. \"I've never heard of such a place.\"</p><p>\"That's because it doesn't yet exist.\"</p><p>I held her gaze, probed it. \"Are you certain?\"</p><p>\"I am.\"</p><p>Sighing, I returned to my beloved, to her body, the shell that had once housed her. I leaned over her, and I kissed her still, cold lips. \"I will try, my love. I vow, I will try. Though living that long without you might very well do me in. If I can last, for you, I will.\"</p><p>I closed my eyes on the hot tears that welled in their depths, and I moaned, \"Come back to me, Elisabeta.\"</p><p>From somewhere beyond the walls of the chapel, I swore I heard her voice whisper, \"I will.\"</p><p>The End </p> </body></html>"]