["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>VALIANCE WALKED UP behind the Prima as she lounged at her favorite table. Six. There were six ways he could attack her while her back was to the main entrance of the coffee shop.</p><p>He looked around. The space hummed, pulsed with life. Even under the coffee's aroma and the espresso-soaked floors, he could smell the life of this place, the life of every person in here. His stomach growled.</p><p>This was a test of some sort. Prima Violet was famous for them, pushing everyone the extra step to make them better. Scheduling his monthly meeting here instead of in his own place of business was a test. Her directive to be unarmed was a test. And judging by the uncomfortable nakedness between his shoulder blades and the pressure of the others' energy, he wasn't going to pass this one.</p><p>But he could at least teach her something. Make her better.</p> <p>Finding the ebb and flow of the life around him, he moved toward her, in sync with the others in the cafe. Their heavy steps along the wooden floor covered the sound of his boots as he slid up behind her. He wasn't going to ignore the irony of stalking a were-panther.</p><p>Valiance knelt slowly and whispered in her ear. \"You could be dead.\"</p><p>The tall woman jumped in her seat and turned around almost as fast as he could blink. Then she laughed as she smiled down at him. \"You really shouldn't stalk people like that, Val.\"</p><p>\"You really shouldn't sit with your back to the door.\"</p><p>Prima Violet pointed to the amulet above the door. \"Most powerful charm in existence. Nothing bad is getting through these doors, Val. You're safe here.\"</p> <p>He exhaled. Her faith was going to be her downfall, but he would fall with her for the faith she had put in him. \"You still shouldn't make a habit of it.\"</p><p>\"Lesson learned, Solider boy. Sit.\"</p><p>Valiance slid into the seat across from her, folding his hands on the table between them. From this vantage point, he could see everything. At least one of them should be on the offensive, no matter how protected the Prima thought she was. Better a thousand times safe than once dead.</p><p>The Prima finished a text message and put the phone on the table. She swept her dark hair over her shoulder and settled her content moss green eyes on him. \"So how is my favorite vampire this evening?\"</p><p>His gaze darted to the surrounding tables to see if anyone heard her. The cafe had become the primary haunt of the Wandering community, the magical taking refuge in the haven the Prima had created, but he still wasn't used to the openness. He'd spent a hundred and sixty-seven years trying to hide what he was from everyone, other Wanderers included. Violet was the only one in the pack who had reached out to him, who took a moment to realize that he wasn't the monster from the movies.</p><p>\"I am fine, Prima.\"</p> <p>She rolled her eyes. \"You rolled around in ghoul guts with me. You can call me Violet.\"</p><p>He nodded. \"Yes, ma'am.\"</p><p>She leaned forward on the table. \"And you're not fine. You're pale, gaunt even. Have you been feeding?\"</p><p>He nodded again, keeping his eyes to the table between them. He bounced his leg to relieve some of the pressure down his unprotected back.</p><p>\"Valiance, look at me.\"</p><p>For a moment, her burnt magnolia scent, laced with pure concern, swirled around him like a warm, spring breeze. He drew his gaze up to clear eyes practically glowing with power and licked his suddenly dry lips.</p><p>\"What's wrong? And remember my policy on honesty. Are you eating?\"</p><p>Valiance nodded. \"Once a month. Just like we talked about. They don't remember anything.\"</p> <p>\"Then what is it? You look like a ghost.\"</p><p>Valiance adjusted in the seat, knowing it wasn't the seat that was uncomfortable. \"Nothing. Life is very . . . quiet,\" he finally said.</p><p>His Prima smirked. \"I don't understand that word. Quiet. What is this quiet that you speak of?\"</p><p>The smile crawled slowly across his mouth until he was smiling with her. The Prima's infectious humor. Some days it was more powerful than the panther that lived within her.</p><p>Prima Jordan was rarely alone, constantly bombarded by her pack mates. If it wasn't the minutiae of their everyday lives, it was the demon last August that had to be beheaded or the invasion of imps that swarmed Dallas until they were netted and sent back through the Veil. She always called him in for the fight, but after all the action, she went home to a full house, and he went back to an empty apartment.</p><p>Violet reached across the table and rested her hand over his knotted fingers.</p><p>The action startled him, and his entire body tensed. In the connection, he could feel her power and the slow rhythm of her heart. It was strong, steady, and echoed in the vastness of the energy undulating around them.</p><p>Violet only tightened her grip with his flinch of protest. \"I can't even begin to imagine how hard it was for you after your Clade up and left you. But now, you've got to be brave again.\"</p><p>Valiance looked up. \"Another demon?\" For a moment, his heart raced with the thought of battle. A purpose for him and his blade. Something to draw him away from the stillness of his life.</p><p>Violet laughed. \"No, but good one. You've got to start living. Get out of the shop, get an assistant. Take up quilting. Hell, take a vacation and come back to tell me what it's like.\"</p><p>And here it was. This entire evening was a test. He knew it. A test to see if he was capable of rejoining the human race or, at least, walking beside them again.</p><p>She leaned back in her chair, her hand and her power retreating. \"Do anything new lately that didn't involve sneaking up on people?\"</p><p>The monotony of his life flashed through his mind in a matter of moments. \"Bought some sheets?\"</p><p>She raised her dark eyebrow sharply. \"That was your big adventure? You're killing me, Val. I expected romance, intrigue, danger.\" She leaned forward again and lowered her voice. \"You're a vampire. That's got to get you into some trouble. Hell, being so blasted good-looking should get you into trouble.\"</p><p>\"I thought you wanted us to stay out of trouble.\"</p><p>\"No, I want you to stay out of danger. Living life comes with trouble.\"</p><p>Life was uncomfortable, like a wool sweater he hadn't gotten used to wearing. But there was one softer moment he could remember, where it didn't feel like life was trying to suffocate him.</p><p>\"There was this girl.\"</p><p>Violet's energy sizzled around them, and she smiled. \"Girls are always trouble.\"</p><p>Valiance shook his head. \"It was nothing.\"</p><p>\"If you mentioned it to me, she was something. Let me guess. Tall and exotic? No, wait. I bet she's a redhead with legs for days.\" She leaned forward, her chin in her hands. \"Tell me a story.\"</p><p>Valiance couldn't believe he was about to tell this to his leader, the one he followed into battle.</p><p>But frankly, he didn't have anyone else to talk to about the girl. Maybe if he talked about her, she wouldn't keep circling around in his head. \"Complete opposite. The girl who sold me the sheets.</p><p>Dark hair. Brown eyes.\"</p><p>\"Name?\"</p><p>\"Esme.\" Saying her name out loud only coalesced all the thoughts of her into something bigger and brighter.</p><p>\"List three reasons you didn't ask her out right then.\"</p><p>The first one screamed through his brain every time he thought about the petite brunette: she was human, fragile and human. Valiance leaned back in his chair, letting his hands drop to his lap.</p><p>He pinched the flesh on his ring finger and watched the near-bloodless skin slowly smooth out.</p><p>\"This is ridiculous. You're my Prima, for Christ's sake. You shouldn't be worried about my personal problems.\"</p><p>Violet sat up straight in her chair. \"Valiance No-Last-Name, my entire job is to make sure you choose your own problems, and they don't come after you. You don't need me like the others do. I still can't figure why you don't have a Clade of your own. So if you need me to be an ear so you can talk about a girl, I'm right here. And if you need Chaz to hunt her down, I can lend him to you for an evening.\"</p><p>His eyes flicked up to his Prima, and she was smiling. In the past six months, he'd learned she meant every word she said, after you got through the Violet-speak. Frankly, she was the closest thing to a friend he had in Dallas since his Clade brothers left him there. Left him because he took a stand for their future in Dallas. Left him because he showed an ounce of spine in a moment of crisis. He looked down at his hands in his lap only to find his fists, white and bloodless.</p><p>\"Will we see you at the full moon?\"</p><p>He wriggled his fingers to get the little blood left in him flowing again. \"Are you going to hassle me about dating?\"</p><p>Violet shook her head. \"No. Maybe. Do you want to go to the full moon? You can bring your sword. I've been practicing a little. Might give you a run for your money this time.\"</p><p>He actually had to think about the question. Did he want to go? Sitting on a porch being lonely around other Wanderers didn't really seem like a great way to spend a weekend. He knew they saw him as the worst of their kind, something that stole the life they fought for. Alone with his thoughts, he saw himself like that most days.</p><p>But if he didn't go to the full moon, he knew Violet would just drag him someplace else. \"I need to return Chaz's whetstone.\"</p><p>Violet smiled. Just as he thought she was going to hound him more about his current activities, her phone began to vibrate. She grabbed the dancing device, looked at the screen, and rolled her eyes. As she rose, she answered the line but didn't talk.</p><p>Valiance stood with her. He knew his manners were outdated for this century, but there were certain habits he could not break. Stand when a lady enters and exits. Always carry a handkerchief, and be on time.</p><p>She almost looked him straight in the eyes. \"Don't make me worry about you, Valiance.\"</p><p>\"No, ma'am.\"</p><p>Violet just winked at him as she left the coffee shop, taking the next caller in a long line of people who needed her help.</p><p>He sighed and sat back down at the table. His Prima had just told him to \"Get a life.\" How pathetic was that? \"EXCUSE ME, SIR. I'm looking for Esme?\"</p><p>Her skin prickled. It started on the back of her head and shimmered down her spine. She'd never heard that before. Ever. She looked up from her work of stocking the pillowcase wall and saw the back of a man talking to her manager. He was a million feet tall, with hair that, under the fluorescent lights, looked like the inside of a down comforter.</p><p>\"Esme?\" her manager asked.</p><p>\"Yes,\" the man said. His voice was deep, smooth, and not from around here. \"Short, slender, biggest brown eyes you've ever seen.\"</p><p>\"Oh, you mean Hannah Jane up in Juniors.\"</p><p>The man sighed. \"Why would I shop in Juniors? No, she works in Housewares, and her name is Esme. It's on the receipt.\"</p><p>She dusted her hands off on the apron and put the box cutter in her pocket. Slowly, she made her way around to the back of the register, careful to keep behind the display of AS SEEN ON TV products until she got a look at him.</p><p>It only took one glimpse of him running his fingers through his hair before she recognized who it was. Black damask sheets. Seven-hundred-count. Credit card. His hand had trembled as he handed her the card.</p><p>As she rounded the display, her manager sighed. \"Thank God. Do you know someone named Esme?\"</p><p>\"I'm Esme.\"</p><p>Her manager sighed and walked away, which left her in the very keen sight of the man with the black sheets.</p><p>\"What can I do for you?\" The words didn't feel natural coming out of her mouth. She rarely had to speak at work, let alone help a customer. It's why she worked in Housewares, the only department without a monthly sales quota for its workers.</p><p>His broad shoulders relaxed, but he didn't smile. \"I was in here a couple of days ago, and you helped me pick out a sheet set.\"</p><p>\"Seven-hundred-count Egyptian cotton in black with a damask stripe.\"</p><p>There was a twinge at his mouth. \"You've got a great memory.\"</p><p>\"It was my only sale this month.\" She finally saw a white plastic bag hanging around his wrist.</p><p>\"Did you need to return them?\"</p><p>\"No. Actually, I'd like another.\"</p><p>\"Oh. Um. This way.\"</p><p>She walked him over to the exact same spot they had stood last week. She felt stalked, like a dark cloud just before a storm was following her. It only intensified when she turned to him at the display and found that the storm was in his dark blue eyes.</p><p>She really wasn't sure what happened next. She didn't really do the customer thing, except at Christmastime when everyone was looking for the electric blankets, and that was mostly pointing like a game-show host, like she was doing now. \"Ta-da.\"</p><p>God, she had actually said that out loud. She was pathetic. She tucked her hair behind her ear and waited, staring down at his unusually shiny black shoes. Come to notice it, he was a little dressed up for sheet shopping.</p><p>\"Thank you,\" he said as he took another set, exactly the same.</p><p>In his smooth movement, she was flooded with the smell of him, a musky cologne with undernotes of Downy, but there was a darker twang to it. Something familiar tickled her nose.</p><p>As he inspected the plastic package, she looked up at him. His tired blue eyes, his pale skin. But even her caramel skin looked peaked under these lights. It was probably nothing.</p><p>\"Did you need the matching comforter? It's on sale.\" Wow, maybe she was cut out for this sales thing.</p><p>\"Sure.\" He chuckled. \"Lead the way.\"</p><p>She walked him over to the wall of comforters. \"The store brand is pretty nice. Comes with a bed skirt.\"</p><p>\"Never really understood the need for a bed skirt.\"</p><p>\"My abuelita believes it keeps the dust bunnies from nesting.\"</p><p>He laughed. It was a deep laugh, short but honest. \"Good to know.\"</p><p>\"We have pillows, too.\"</p><p>\"I think I'm good on pillows. I have to walk home.\"</p><p>\"Walk? No one walks in Dallas.\"</p><p>\"I enjoy the exercise.\"</p><p>And it showed. Even under his black trench, she could see the broad expanse of his chest and how his buttons strained when he'd reached for the sheets. Given the wrinkled shirt under her dusty apron, she looked like she didn't shower. But then again, until him, no one had noticed her.</p><p>Ever.</p><p>\"Can I help you find anything else?\"</p><p>He opened his mouth but closed it again and shook his head.</p><p>\"Then the cash register is this way.\"</p><p>As she walked him back to the register, she felt it, that pressure in the back of her head. She wondered if all girls got this when they were being followed, like she could feel him looking at her, watching her messy ponytail bob back and forth.</p><p>And he just kept looking at her, and she just kept smiling like an idiot as she rang up the bed set. \"Total is seventy-three ninety six.\"</p><p>\"That is a good sale.\" He handed her the credit card again, and again, his hand trembled. This time she paid attention to the name. Val Lance. Very knightly.</p><p>She ran the card and handed it back to him. Their fingers brushed for a second, and his fingers were cold, like touching an ice cube. She snapped her hand back.</p><p>\"Sorry about that,\" he apologized as he put his card back in his wallet and his wallet in his coat pocket, not in the back pocket like most boys these days. \"I really should start wearing gloves.\"</p><p>\"We have gloves in men's wear.\" She blushed when she realized that she hadn't talked so much in ages. She was like a babbling brook under his intense gaze.</p><p>Esme pulled her hair behind her ear and slipped his purchases into the handled paper bag.</p><p>\"I came to get your number.\" The statement spilled out of his mouth like a gangly kid in a foot race.</p><p>Her jaw dropped as her brain contemplated the possible answers to \"Why?\"</p><p>His blond brow furrowed. \"To ask you out for coffee?\"</p><p>Excited goose bumps trickled down her arm. \"Why do you need my number to do that? Just do it now.\"</p><p>He laughed that one short laugh and let out a long breath. \"Would you do me the honor of having coffee with me?\"</p><p>She looked up at him and into those tired blue eyes. They were old. Older than her abuelita's, but she felt seen. For the first time in a long time, she felt like she was a normal girl. That should be something, right? Even if it was just a cup of coffee before he realized how completely boring she was, and he forgot her like everyone else did. \"Yeah. Yes.\"</p><p>He smiled, and something glowed within him. It was a wide smile that completely changed the dynamic of his features. It lit up his eyes and chased away the storm clouds. \"Wonderful. May I have your number so we can set up a time?\"</p><p>\"Actually, I don't have a phone.\"</p><p>\"Why not?\"</p><p>\"No one remembers to call me.\"</p><p>She wanted to giggle but fought the light, fluttering feelings in her stomach. She knew exactly where to meet. One of her favorite places in Dallas, where the baristas never forgot her order.</p><p>\"There's this coffee shop off Oaklawn. Big black cat in the window?\"</p><p>She watched as what little blood colored his cheeks faded, and his Adam's apple bobbed slowly.</p><p>\"Do you know it?\"</p><p>He licked his lips. \"I sort of know the owner.\"</p><p>\"Really? I love that place.\" She let one excited smile slip.</p><p>\"Thursday night?\"</p><p>She nodded.</p><p>\"So Thursday. Coffee shop. Eight?\"</p><p>\"Sounds good. I'm Esme, by the way.\" She stuck out her hand.</p><p>\"Val,\" he said.</p><p>As his cool hand slipped into hers, she shivered again, this time with excitement as the hair prickled on the back of her neck.</p><p>He squeezed gently, then pulled away. \"See you on Thursday, Esme.\"</p><p>She stayed behind the counter for at least fifteen minutes after watching him walk away. What had gotten into her? Did someone seriously just ask her out on a date? And not just a someone. A tall, Viking-looking thing who should be wielding a sword and not sipping coffee.</p><p>Esme smiled. Her first date. Her abuelita was going to be so proud. And she might just go upstairs and visit Hannah Jane in Juniors to find something to wear. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>UP UNTIL THAT moment, Valiance was convinced vampires didn't sweat. One hundred and sixty-seven years old, and he was as nervous as a long-tailed cat. It made him smile. Violet would appreciate that. Violet wound be proud of this whole endeavor, no matter how badly it ended. He wiped his palms on the legs of his jeans before he took a deep breath and pulled open the door.</p><p>The smell of humans hit him hard in the gut. He should have fed. He'd thought about it, but there was an echo within him whispering he shouldn't pulse with someone else's blood, someone else's life, on his date with Esme. Some very old-fashioned part of him wanted him to be pure for this.</p><p>Like he could ever be pure again. He had the lives of a thousand people running through his veins. One more shouldn't have mattered. But it did tonight.</p><p>His nose twitched with the soft scent of baby powder and flowers. His gaze was drawn to the front window, where Esme was sitting in the window seat, watching him with doe-like eyes.</p> <p>She stood and smoothed her green skirt over her dark leggings and pulled at her jacket. Her rose sweater reminded him of just that, a flower, with her soft scent and delicate features.</p><p>Esme met him halfway to the register. \"Hi.\" Her eyes fluttered somewhere around his elbow as she pulled her dark hair behind her ear.</p><p>\"Hello.\" He led her over to the register. \"What's your usual?\"</p><p>\"The Mexican Mocha. It's got this kick like Abuelita makes.\"</p><p>Valiance turned to the manager. Bastian was one of the few humans in Dallas who knew of the Wanderer community and happily served them coffees and cookies. It struck Valiance that this might be the first time he'd ordered anything here. \"Two Mexican Mochas.\"</p> <p>Bastian raised his eyebrow at the order. \"Really?\"</p><p>Valiance pressed his lips together in a tight smile. \"Please?\"</p><p>The manager shrugged and rang up their coffees. \"It will be a moment. I'm a little behind on orders.\"</p><p>\"Are you hiring?\" Esme asked.</p><p>Bastian laughed as he went to make their drinks. \"Don't I wish.\"</p><p>Valiance saw an instant of sadness cross her eyes, and a metal hook pierced his heart. He needed to change the subject quickly. \"You talk about your grandmother a lot.\"</p> <p>\"I live with her.\" Esme dropped her face into her hands, and the flower scent around her increased as she blushed. \"I wasn't going to tell you that. Now I look pathetic. A twenty-two-year- old still living at home.\"</p><p>Valiance chuckled. \"Families should live together.\"</p><p>She peeked out from between two fingers. \"Really?\"</p><p>FROM THAT MOMENT on, he was sunk. She was adorable. And nervous. And honest. She spun the porcelain cup in its saucer as she talked about her college literature courses and how the poetry class she was taking now was her last before she graduated though she didn't know what she could do with her degree. She talked about her incredibly large family and how she had to live with her grandmother to get any peace because everyone in her family was loud and in each other's business. She talked about how he was the first customer who ever asked for her again.</p><p>\"Oh God. I shouldn't have said that. You're going to think I'm even more pathetic.\"</p><p>\"I'm not going to think you're pathetic.\"</p><p>She scrunched her nose. \"Can you tell I don't talk to people much?\"</p><p>\"Probably more than I do.\"</p> <p>She raised an eyebrow. \"So now we're going to play who's more pathetic?\"</p><p>\"I'd win. I work in a storefront alone, selling things online. The only person I talked to this week was the mailman. And you.\"</p><p>She smiled up at him, her sparkling brown eyes, her rosy lips, her sharp chin. The only thing that could have pulled him away from that moment was the spike of icy energy that rammed down his spine and made him jerk.</p><p>The cafe was suddenly less illuminated than it had been a moment earlier, a grim shadow quickly cast over his evening. His hand moved to his neck and inside the collar of his jacket. He brushed the familiar hilt just to make sure. He'd tried to leave the house without his sword, but it had been his only companion through all this. And, frankly, he felt naked without it.</p><p>\"Something wrong?\" Esme asked. \"Something's wrong. You went all stony.\"</p><p>He was honest. \"I don't know.\"</p><p>\"Did it get cold in here?\" She rubbed her hands up and down the arms of her jacket.</p><p>\"More than just cold,\" he said as he scanned the front windows of the shop. It was never cold here, part of the spell the Prima had put on the place. \"It's time to go.\"</p><p>\"Oh. Um. Okay.\"</p><p>\"Where's your car?\"</p><p>\"In the lot out back.\"</p><p>\"Let's go.\"</p><p>She didn't question him. She just grabbed her bag and put it across her chest, taking one last drag of the mocha before he escorted toward the rear of the cafe.</p><p>\"Are we allowed back here?\" she whispered as he ushered her through the storage room.</p><p>\"I know the owner, remember?\"</p><p>He guided her through the dark and toward the glow of moonlight from the back door window.</p><p>His senses heightened by the fear creeping down his back, he was completely lost in the smell of her hair, the flowers, and her warmth as it pushed against him in the darkness.</p><p>He knew right then that she was too good for him. Too sweet. Too pure. What was he thinking even talking to her? Valiance reached around her to push open the back door, and they broke out into the cold night.</p><p>\"Which one is yours?\" he asked as he reached into his front pocket to get his cell phone.</p><p>\"The . . .\"</p><p>Esme sucked the words back in with a gasp as a dark figure swooped down and skittered in the gravel before them. Valiance pulled her behind him. He inhaled sharply as she buried her face between his shoulder blades, pressing the long, hard edge of iron against his spine.</p><p>The darkness faded around the figure, and his Clade Brother Mondrian's violently blue eyes smiled at him. \"Nice to see you again, Valiance.\"</p><p>Six months of loneliness hit Valiance like a load of bricks in the pit of his stomach. \"What do you want?\"</p><p>Mondrian ran his fingers through his long brown hair, then pulled at the cuffs of his black leather jacket. \"A little hospitality, for starters.\"</p><p>\"What do you want, Mondrian?\" Valiance repeated.</p><p>Mondrian spread his hands out. \"Just to talk, older brother.\"</p><p>Slowly, Valiance pressed his cell phone into Esme's leg. Her hand wrapped around the phone, catching his fingers in hers for a moment. The thrill of it jumped up his arm and made him stand straighter. \"Now is not a good time.\"</p><p>Mondrian's rage twisted his usually perfect face. \"You think you're too good for your Clade now? That shifter bitch tell you that?\"</p><p>This wasn't right. Mondrian's first emotion wasn't anger. His brother would have tried charm first, seduction. Swung around to flattery before resorting to anger. This wasn't a hospitality visit, and the knowledge grated on Valiance's nerves, setting everything on edge.</p><p>Valiance's power spiked around him, and the magic enhanced him. His muscles readied, his vision focused, and his fangs pressed down on his lower lip. \"You do not talk about the Prima like that.\"</p><p>\"You can't tell me you've actually gone native?\"</p><p>\"And if I have?\"</p><p>\"Going to make this harder than planned.\"</p><p>A shadow swooped down and plowed into Valiance. He slammed against the pavement, the wind knocked from his lungs. The figure was gone as quickly as it attacked.</p><p>Valiance's only thought was that Esme was exposed and defenseless against them as she stood frozen.</p><p>He sat up too quickly, and black spots swarmed in his vision. \"Run.\"</p><p>His hoarse voice must have made something click within her, because she ran off into the night.</p><p>When Mondrian didn't blink, Valiance scoured the darkness around the parking lot, looking for others, waiting for the next attack. He didn't have to wait long. The shadow swooped again, but this time he was ready. His hand reached behind his head and pulled out his sword. When the figure hit him, he rolled and grabbed the material on the man's chest. He slammed him down to the gravel and had his sword to his throat in less than a breath.</p><p>\"Finnegan?\"</p><p>Valiance dropped the man's shirt, and both were on their feet in the blink of an eye. His muscles rejoiced at the feeling of his sword in his hand, at the use of his speed again, but his heart sank at seeing another one of his brethren on what now had to be a mission from Andrin, the leader of his former Clade.</p><p>\"Brothers don't attack brothers in the darkness.\"</p><p>Mondrian just smiled, and Valiance remembered everything the two of them had done together.</p><p>Every war. Every city. Every woman. His stomach churned as he remembered the carousing, the drinking, and, most of all, the camaraderie he had desperately missed in the past six months.</p><p>Valiance's gaze bounced between the men. Three. There were three ways out of this. None left him unscathed, but Esme would be safe. \"You left me here, Mondrian. That's not a very brotherly thing to do.\"</p><p>\"Andrin ordered us to leave. It wasn't our fight.\"</p><p>\"Prima Jordan was fighting for all of us. Fighting to make sure we could still have something to fight for.\"</p><p>Finnegan snickered. \"He really did drink the Kool-Aid.\"</p><p>Valiance heard the rumble of an engine, and Mondrian began to turn his head. Valiance flicked the tip of his sword and pressed it to Mondrian's chest. \"Andrin was a coward, running from the fight. I will not align with cowards or those who follow them.\"</p><p>Mondrian looked down at the blade against his jacket and shook his head. \"You shouldn't have said that.\"</p><p>\"Why? You're in the compromised position here.\"</p><p>A yellow Volkswagen Bug revved its engine and flew out of the parking lot. A weight lifted off Valiance's shoulders as he saw Esme's features in the window, her knuckles glowing white on the steering wheel. But he also knew he was watching his last chance for any sort of normal relationship drive terrified into the night.</p><p>Mondrian brushed away the tip of Valiance's sword and continued with his speech. \"Andrin wants you back. He's gotten us into trouble, and he needs his warrior prince.\"</p><p>\"Why aren't you good enough?\" Valiance tested the weight of his sword in his hand. She was perfect, had always been perfect.</p><p>He could hear Mondrian's teeth grind across the space between them. \"He wants you.\"</p><p>\"I've pledged my allegiance to Dallas and to the Prima. I will not break my word for a coward.\"</p><p>\"You sound like you're still in the eighteen hundreds, Val. Back when you were still Thomas Valmont, son of an aristocrat. Your perspective needs to change. It's not about honor and codes now. It's about survival and us against them.\"</p><p>\"You never had honor and codes, Mondrian. You wouldn't understand.\"</p><p>Mondrian had always been faster. At least that part of him remained the same. Mondrian slammed Valiance against the brick wall so hard he was sure they'd shaken the foundation of the coffee shop. Mondrian's breath was fresh with blood, but there was something else beneath the metallic scent.</p><p>\"Are you drinking from Andrin?\" The words themselves left a sour taste in Valiance's mouth.</p><p>\"He shares his power with us.\"</p><p>Valiance strengthened his jaw against the fresh pain in his head. \"It's a way to control you. You know that, Mon. We've seen this frantic power grab before. Next, he'll start trying to bond new vampires to the Clade.\"</p><p>Mondrian's face didn't betray him, but his teal eyes did. The look told Valiance that his former leader had already started hunting for purebloods with the vampire potential. Once Andrin bit them, and their power had been solidified, they'd be his Clade Brothers forever. Like Emilio had bitten Valiance, and Valiance had bitten Mondrian.</p><p>Valiance dropped to the ground and swept Mondrian's legs out from under him. The boy never could predict a leg sweep. The younger vampire bounced against the concrete like a child's play ball and came at Valiance again, but Val's sword was faster.</p><p>The iron blade pressed into the hollow of Mondrian's throat. \"I will not go.\"</p><p>Something happened to Mondrian. He shivered, from top to toe.</p><p>\"You will rejoin your Clade.\" It wasn't Mondrian's voice. Mondrian had been born in the Americas, like Valiance. This voice was deeper and had the lilt of an Irishman in it. Full possession.</p><p>It was worse than Valiance thought. Andrin's energy coursed through Mondrian.</p><p>Valiance couldn't believe what he saw. His best friend reduced to the point that another could possess him. It both fueled him and disgusted him.</p><p>\"I will not live under the tyranny of a coward.\"</p><p>\"Then you will die under one.\"</p><p>WHEN ESME REALIZED she could barely see where she was driving, she pulled into the parking lot of a brightly lit convenient store and tried to get her brain to stop yelling at her.</p><p>Of course, he's a monster, and you were just about to be one of those girls in the movies who gets eaten. You are nothing. Why would a guy like him even notice you in the first place unless it was for dinner? How stupid could you be? Maybe there is a reason your parents gave up on you.</p><p>Her brain went a little numb after the last thought. The following tears were hot and thick, and she sobbed for a good ten minutes before her tear ducts ran dry.</p><p>But he saw her. She shuddered through a deep breath. He saw her, and he had told her to run when those other things showed up.</p><p>Esme looked over at the cell phone in her passenger seat. Why'd he given her the phone? Because he knew she didn't have one. What kind of a monster gives you a phone so you can call for help? Her hand still shaking, she reached out to take the phone. The simple flip model jumped to life when she opened it. Did she call 9 - 1 - 1? What could they do? These things moved faster than she could see. What were the cops supposed to do about that? Did she call his family? She'd heard them say brothers. Maybe they were looking for his brother? Not used to the phone's buttons, she pressed a few and ended up opening his contacts list.</p><p>His extremely short contacts list. One. Jordan. She'd heard that name before. The coffee shop, as a whisper in the air. He'd said he knew the owner. Was that his only contact? Taking in another breath, she made a decision. Call this person. Let them know Val was in trouble, then race home and never leave her abuelita's couch ever again. That was all she owed him for the coffee.</p><p>The phone rang a few times before a woman answered. \"Hey, Val. How'd the date go?\"</p><p>Esme didn't exactly know what to say, so she was honest. \"Not good.\"</p><p>\"Who is this? Is this Esme?\"</p><p>Her skin prickled. How did this woman know who she was? \"Val was attacked at the coffee shop. He needs help.\"</p><p>\"My coffee shop. Nothing can get into the coffee shop.\"</p><p>\"Behind it. Look. I don't know what those guys were, but he's in trouble.\"</p><p>\"How many?\"</p><p>\"Two, that I saw. I hightailed it out of there pretty fast.\"</p><p>The woman actually laughed. \"Thank you, Esme. You may have just saved his life.\"</p><p>Esme closed the phone. Did she want to save his life? Would he try to eat her now? She didn't know, but she started up her car and wished she'd just stayed hidden down in Housewares. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>MONDRIAN SLAMMED VALIANCE'S face against the car door and Val heard his jaw crack. That was going to hurt in the morning. If there was a morning.</p><p>Mondrian turned him around and buried his nose into Val's shirt and inhaled deeply. \"You've got a girl on you.\"</p><p>\"Leave her out of this.\"</p><p>\"Why you chasing dames the old-fashioned way?\" Finnegan asked as he swung Valiance's sword around. \"Just sway them. It's easier.\"</p> <p>Valiance ground his teeth together, and his vision was lost for a moment in the spinning pain of his broken jaw and his concussed brain.</p><p>\"Oh, I think he likes this one.\" Mondrian dropped Valiance's shirt, and Val slid down the car, landing hard on his ass. He felt a rib shift like it really shouldn't have shifted, and his sword arm, ripped from its socket, dangled loosely at his side.</p><p>\"Is that why you won't come back with us?\" Mondrian asked. \"Some girl. We can find her, you know. See if she's right for the bleeding.\"</p><p>\"Never,\" Valiance growled as he pushed himself up to his feet.</p><p>Mondrian let him. Valiance knew he was being played with. After the possession had faded, Mondrian was just enjoying kicking Valiance's ass on principle for all the times he had had to rein Mondrian in, keep him from crossing a line Valiance knew didn't even exist for him anymore.</p> <p>\"Is she pretty, at least? Tall, dark, and exotic. Like that Jolie woman?\"</p><p>\"She's totally one of us,\" Finnegan pitched in as he spun Valiance's sword around like a parade rifle.</p><p>Valiance looked from one to the other. They didn't see Esme. She'd been right there, and they hadn't seen her. How could they not have seen her? The sudden realization ripped a gasp from him. It wasn't just her quaint manner. She might actually be invisible to some people.</p><p>Valiance chuckled at the sheer cosmic joke of it all. That he could see invisible girls. Next thing he would discover was that she was a ghost who had died in a tragic pillow avalanche. Sounded about par for this year.</p><p>\"Going to share the joke?\" Mondrian asked.</p><p>Finnegan was at his throat in a blink, the sharp edge of Val's own blade pressed into his sensitive skin. \"Yeah, Brother. We like a good joke.\"</p> <p>The smell of burnt magnolias filled the parking lot. \"Then you're going to think that I'm hilarious.\"</p><p>Valiance had never been more relieved to smell Prima Jordan. He swore in that moment he would never make a long-tailed cat joke for the rest of his long life.</p><p>She sauntered through the parking lot. When she was within striking distance, she studied both men. \"These those Clade Brothers you keep talking about?\"</p><p>\"Every family has its fights,\" Mondrian said, leaving Valiance for a moment. \"Stay out of this one.\"</p><p>Violet shrugged. \"Not impressed, Val.\"</p><p>Mondrian was fast as he charged her, but Violet's reactions were faster. Something like pride swelled within Valiance as he watched Violet throw Mondrian across the parking lot. Maybe he had taught her something in their sparring sessions.</p><p>She took a moment to recover Valiance from the ground. \"So, night going well?\"</p><p>Valiance took her offered hand and got to his feet. His ears were ringing courtesy of the last slam into the car. \"I don't think your phrase friggin' peachy has ever really made sense until now.\"</p> <p>\"Are you good?\"</p><p>\"No.\"</p><p>Finnegan and Mondrian didn't give them time to organize a proper strategy. Mondrian went for Valiance's throat, teeth out and ready for blood.</p><p>Valiance was ready for him. He knew every move Mondrian would throw at him, every just-off- center punch and the way he favored his left claw to his right. Even after a harsh blow to the ribs, Val felt a smile cross his lips.</p><p>\"Please share the joke, Brother.\"</p><p>Mondrian landed a fast backhand across Valiance's jaw but couldn't shake the smile.</p><p>\"You're too predictable. Always have been.\"</p><p>\"Predictable?\"</p><p>\"Even down to your taste in clothes. Must everything be black?\"</p><p>\"Brings out my - \"</p><p>Valiance landed a hard right hook on Mondrian's jaw, reveling in the sound of the contact that echoed off the brick building.</p><p>Blood trickled out of the corner of Mondrian's mouth, and he wiped it with the back of his hand.</p><p>\"So you're really not going to consider coming back to us?\"</p><p>\"No.\"</p><p>There was a shimmer in the air, and Violet's panther made a black streak across the parking lot after Finnegan. The young vampire ran in panic, dropping Valiance's sword as he fled.</p><p>The two vampires saw the sword at the same time, but Valiance was faster this time. They slid across the parking lot, but Valiance felt the familiar thrum in his fingertips as touched the metal.</p><p>He curled his fingers around his sword, and she felt amazing in his hand. Good girl.</p><p>\"Are you forgetting I have one of those, too?\" Mondrian pulled his own blade out from its sheath.</p><p>\"Mine's bigger.\" Valiance winked before he swung the sword in the first of a dozen attacks. He wasn't as strong with his left arm, but Mondrian hadn't trained any more than what Valiance had put him through the past seventy years. Valiance had never stopped practicing. Even Violet had taken up swordplay and had the speed to be a challenge for Valiance. She had made him better.</p><p>Mondrian had only slowed him down, made him wait for his younger brother to play catch-up.</p><p>Valiance was tired of waiting. He wanted this done. He hated waiting. He hated that he'd been in limbo for six months, and the one night he decided to try to get back on the horse, they showed up.</p><p>With every angry thought, Valiance's blade lashed out. For every word he couldn't say, his iron spoke for him.</p><p>Until Mondrian was pressed against the wall, unarmed, bleeding, and smelling of fear. Valiance took in a deep breath of his scent though he didn't need a reminder of Mondrian's smell.</p><p>Iron sliced through flesh with a sickening sucking sound that made Valiance turn away from his brother just in time to see Finnegan's head roll under a parked car.</p><p>Violet, in human form, stood over the body, weapon hanging at her side.</p><p>Valiance was frozen by the feeling of his Clade Brother as he died. A cold chill ran over his skin despite his battle-charged heat. It was like spiderwebs drawn across his chest as Finnegan's energy was released back into the earth.</p><p>Mondrian obviously didn't have the same reaction. He grabbed Valiance's wrist and wrenched his injured arm outward and spun under it.</p><p>The tendons in Valiance's shoulder ripped around the dislocated shoulder. The pain numbed his hand and screeched into his ear. Mondrian rammed his knee into Valiance's torso, then was gone, like the air in Valiance's lungs.</p><p>\"Crap,\" Violet said as she dropped the sword and went to help Valiance up.</p><p>The power of her panther still ebbed around her, and the heat of her pressed against his injured body. As they shuffled over to the dead body, he might have held on to her shoulder longer than he needed just to have her soothing power close to him.</p><p>\"I didn't mean to . . .\" Violet said as she stood over the headless vampire. \"I think you taught me a little too well.\"</p><p>\"Right. You didn't mean to chop his head off.\" Valiance shook his head. Pain flared from his right knee to his left ribs to his right shoulder to his left jaw. He was a zigzag of pain. Thinking in a straight line was nearly impossible.</p><p>\"Well . . .\" Violet turned to him. \"Want me to fix that arm?\"</p><p>\"You a medic now, too?\"</p><p>\"No, just accident-prone. I've had to do it enough times that I'm an expert. Take off your jacket.\"</p><p>There really was no saying \"no\" to her, so he slipped off his jacket carefully. His new dress shirt was shredded, blood drying in long lines across his chest. He had the thought that more blood was on the outside than on the in.</p><p>He could feel the heat of her hands through his shirt, She walked her fingers down his shoulder blade. Carefully, she took his wrist and brought his arm up to a right angle. \"We probably need to talk about something happy because this usually hurts.\"</p><p>\"Andrin's using his blood to possess the Clade.\"</p><p>\"That's your idea of happy?\"</p><p>She carefully rotated his arm outward, and every inch she moved it made his head swim in pain.</p><p>She could relocate it, but the ligaments would still need time to mend. She kept moving his arm, her fingers at his back to gauge the process.</p><p>\"It's not like it is in the movies, you know. That dramatic pop as the hero slams his shoulder back into place. You need to relax. This isn't going to work if you're tense.\"</p><p>He knew she was talking to keep his mind occupied, keep it from focusing on the pain, on the betrayal of his Clade. His failure to his brothers. She was kind of great like that.</p><p>Violet kept cranking his arm back and forth, but he couldn't relax with her touching him. It hadn't been that long since he'd been with a woman, but he was definitely affected by the heat of panther power against his side. It reminded him of Esme, her soft warmth that smelled like flowers.</p><p>The thought of her relaxed him for a moment, and Violet hit him like linebacker in the shoulder.</p><p>A pop echoed through the parking lot, and Valiance grabbed his shoulder as he jerked away from Violet.</p><p>\"Finally got you to relax enough.\"</p><p>Valiance bent over and let the pain consume him for a second before it settled into a dull throb.</p><p>He stood and slowly rotated his arm. He'd be better by morning, providing he got something to eat.</p><p>\"Your girl called me. Told me you needed help.\" She pulled out her phone and began texting.</p><p>\"She's not my . . .\" Valiance stood quickly as the pain cleared his head, and his thoughts resumed in a straighter line than before. \"Mondrian said he'd go after her, and she might be special.\"</p><p>Violet looked up from her glowing phone with a raised eyebrow. \"Like Wandering special?\"</p><p>\"I don't know. But I wouldn't put it past Mondrian to go after her just to get me to come with him. He never could disobey an order.\"</p><p>\"Sounds like there's a story.\"</p><p>Valiance looked across the dark and empty parking lot. \"We went through three wars together, and we got the job done. Mondrian was . . . overzealous on occasion.\"</p><p>\"And you?\"</p><p>\"When the cause was right. Never dull a good blade on an evil purpose. The purpose and the sword will betray you.\"</p><p>\"Sound advice.\"</p><p>Violet's phone buzzed in her hands. \"The Cleaners are on their way to get rid of the body.\"</p><p>\"Tell them to box and burn the head.\"</p><p>\"Afraid he'll come back? 'Cause I don't think he's coming back.\"</p><p>Valiance sighed but still relinquished a small smile at her ability to bring levity to every situation.</p><p>\"It is a show of respect,\" he explained. \"Now you need to find Esme. Make sure she's safe.\"</p><p>\"Me. No. This, this is all you, honey.\" Violet started toward the back of the coffee shop. \"I got you out of the trouble that came to you. You have to get out of the trouble that you caused yourself.\"</p><p>She threw open the back door, and Valiance had to lengthen his stride to follow her. \"What are you talking about? There's a potential innocent about to get attacked by a vampire.\"</p><p>They hit the bright lights of the coffee shop, and Valiance flinched and blinked away his enhanced vision. The light hurt his eyes, and the scent of blood on the both of them overwhelmed him. He probably looked like death, yet the few customers just looked at him, then went back to their reading. Maybe this is what Esme felt like all the time? \"And what are you going to do about it?\"</p><p>Valiance's feet stopped as Violet leaned against the counter casually, like a waiting customer.</p><p>He studied her. Six months wasn't enough to completely decode her. He had no sympathy for her husband. \"Is this one of those tests? You're forcing me to grow up somehow. Listen, I'm a full century older than you. I'm grown. You need to stop being childish and go help a Wanderer.\"</p><p>\"How? I know her name, and that's about it. I don't know what she looks like, what she smells like. How am I supposed to help her?\"</p><p>Bastian slid a hot cup of coffee across the pickup area, and Violet sipped it. There was a shimmer in her energy as the hot liquid touched her lips and a glimmer in her eye as she looked back at Valiance, waiting.</p><p>He needed a drink.</p><p>ESME THREW OPEN the door of the little house, and the walls shook.</p><p>\"My goodness, child, no need for - \"</p><p>Esme threw her arms around her grandmother's neck and knocked the words from her as Esme began to sob. Again. She took in a deep, safe breath of her grandmother's baby-powder scent and tried to focus on that one thing instead of the fifty-seven other things running through her head.</p><p>Her grandmother stroked her hair and cooed in Spanish. \"It's okay, little bird. It's okay, palomita. You're safe here. You're safe now.\"</p><p>Esme let herself be led to the couch and dropped down into the well-worn cushions. The flight response had left her body tired and her bones aching.</p><p>Her grandmother locked the door and kicked down the ash branch that always rested in front of it. Within minutes, Esme's hands were wrapped around a cup of hot chocolate with a bit of her grandmother's special spice. One sip, and she immediately calmed down, her mind seemed to focus, and the fear of monsters' chasing her subsided.</p><p>Her grandmother sat next to her, her knees creaking all the way down. \"What happened, little bird?\"</p><p>The words flew out of her mouth so fast Esme didn't have time to filter out any of the crazy.</p><p>\"This guy asked me for coffee and I met him at the same place I always go, and then he got this stony look and said we had to go and I thought he was just ending the date early because I'm not the most interesting person in the world. When he walked me to my car, this guy, like, attacked him, but it was like he couldn't see me and then he gave me his phone and then this shadow thing knocked him down and he told me to run. So I did and then I called his sister or something and she knew who I was and then I drove home because I got the distinct feeling they wanted to eat me.\"</p><p>Esme watched her grandmother process the information, too calm for Esme's liking. Her grandmother stirred her cocoa. \"You had a date?\"</p><p>\"That's the part of the story you're paying attention to? These things were monsters. They moved too fast. He moved too fast, and he had a freaking sword down his back.\"</p><p>\"Iron or silver.\"</p><p>\"What?\"</p><p>\"Was the blade shiny silver or a dull gray?\"</p><p>Fear crept across Esme's skin despite the hot drink in her hands. She didn't need to think about it. The image of his pulling the blade out of his coat like a sinister magic trick was burned into her retinas. \"Dull. Not like the ones in the movies.\"</p><p>Her grandmother let out a long breath and muttered something in Spanish Esme didn't catch.</p><p>\"What?\"</p><p>\"Drink your cocoa, palomita.\"</p><p>Esme did as she was told. She relaxed again, swirling the spicy flavor around in her mouth before swallowing.</p><p>Her grandmother's eyes focused sharply on Esme. \"The others didn't see you?\"</p><p>\"Looked right past me, like I wasn't even there. But everyone looks past me. Except Val.\" That thought kept dancing around her brain. He had seen her. But saying it out loud made the thought even more real and even more frightening.</p><p>\"Good to know the magic is still there. I was afraid the spell had worn off.\"</p><p>Esme realized she was about to freak out and took the precaution of putting her hot cocoa on the coffee table. \"Spell? Abuelita, what are you talking about?\"</p><p>\"It's all real, my little bird. All the fairy tales I told you. All real.\"</p><p>Esme's thoughts stopped. She just stared into her grandmother's brown eyes, which had always held all the answers before. \"What?\"</p><p>\"The chupacabra, la llorona, the skin-walkers, all real. And all alive and well in Dallas.\"</p><p>The flight response was back and in double force. Esme leapt off the couch and started to pace.</p><p>Her Mary Janes echoed off the wood floors. \"Why are you telling me this?\"</p><p>\"Our blood is very faint. The magic only surfaces once a generation. Skipped your mother entirely. \"</p><p>\"Magic?\" Esme stopped before her grandmother. \"Are you trying to tell me you're a witch? I'm a witch?\"</p><p>\"Fairy actually.\"</p><p>Esme laughed. \"Seriously?\"</p><p>A furrow formed between her grandmother's brow, nestled between her other wrinkles there, and she rose from the couch. \"I would never lie about this, palomita. Not now. Not that you've been seen by one.\"</p><p>\"Seen?\" Esme's entire life flashed before her eyes. Everyone ignored her; she slipped by in every class because the teacher never called on her. She was ignored in movie lines. She'd started wearing steel-toed boots at work because people stepped on her feet so often. Everything clicked in her head. \"I'm invisible.\"</p><p>\"No, my little dove. You burn too brightly. The magic keeps you hidden from those who would take your light. Take another sip of your cocoa.\"</p><p>Esme looked down at the table. That clicked, too. \"The spice. Have you been drugging me all these years?\"</p><p>\"Don't be ridiculous, Esme. It's just nutmeg, cayenne, and maybe some ground poppy seed.\"</p><p>He grandmother didn't meet her eyes, suddenly very interested in the rug beneath them.</p><p>\"Oh God. You've been using magic on me.\"</p><p>\"It's nothing, just a bit of garden magic, palomita. It's part of our heritage.\"</p><p>\"You're insane.\"</p><p>Her grandmother grabbed her shoulders and poked a stubby fingernail into Esme's chest. \"You need to listen to me if you've got vampires after you.\"</p><p>\"Vampires?\" Esme's knees gave, and her grandmother pushed her toward the chair, where she landed with a jarring bounce. \"He's a vampire?\"</p><p>\"Iron blade. If it were silver, I would have said shifter.\"</p><p>\"I just went on a date with a vampire.\" Even when she said the words out loud, they didn't feel real. Didn't jibe with what she knew of vampires. He'd been kind, and opened the door for her, paid for coffee.</p><p>But he didn't drink it. He'd just spun it as they talked, as he watched her talk. And he'd probably just opened the door for her to see the long line of her neck in the moonlight. See what his next meal was going to look like.</p><p>\"But he saw you,\" her grandmother said.</p><p>\"Yeah, probably as dinner.\" Esme pinched the flesh of her pinky, the pain focusing her thoughts as the tip turned bright pink with blood.</p><p>\"No,\" her grandmother said. \"He saw you. He saw through the magic. You said the others didn't.\" Her grandmother smiled. \"His intentions are good, Esme.\"</p><p>Esme huffed. \"Well, his intentions can stay on his side of town.\"</p><p>She rose and brushed past her grandmother as she grabbed her bag and went back to her room and made a spectacular show of slamming her door. She was going to have to find a new place to work, a new coffee shop, and maybe a new life altogether. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"HE'S HERE.\"</p><p>Valiance could smell his blood on the wind. Mondrian had always been good at tracking, but Valiance had never fully appreciated his brother's skills until his scent stopped right outside a house with a magical border around it a mile thick. The white stones around Esme's house glowed in the moonlight, creating a boundary around the property Valiance was sure he couldn't even get through.</p><p>Violet crouched beside him. \"Think we just confirmed your girl is family.\"</p><p>\"She's not my . . .\" Valiance dropped it. Violet wasn't going to stop, and he didn't have the breath to waste.</p> <p>\"What's the plan?\" she asked.</p><p>Valiance had to shift his weight to accommodate the fire burning down his injured leg. \"Wait him out. And then you can see if she's okay tomorrow morning.\"</p><p>\"That's not the Valiance I saw stand up against his Clade Source.\"</p><p>Valiance clenched his jaw, and the entire back of his head lit up like a lightning storm, all bright lights and pain. His jaw was still throbbing though he'd set it himself on the way over here. The blood from the crack on the back of his head was dried now and made the leather of his sheath itchy.</p><p>Violet winced for him. \"You need to feed, don't you? It's why you're not healing. Not enough of your own power to heal yourself. Isn't that how it works?\"</p> <p>\"You volunteering?\"</p><p>Violet finally shut up for two seconds, so he could think. Mondrian wouldn't be able to get through that border, especially if his intentions were to hurt Esme. But even if Valiance was right and Mondrian couldn't see Esme, he might be able to see her grandmother.</p><p>Valiance might be able to make it through the border. Make sure they were okay. But if Esme had seen three seconds of what happened in the parking lot, she was never going speak to him again, let alone invite him in to wait out the night against another vampire.</p><p>His head dropped down to his chest. His true colors had shown through, and she'd seen them and ran.</p><p>\"I smell pity,\" Violet said.</p><p>\"You smell a man realizing he should have stayed in the shop.\"</p> <p>\"Yep. Self-pity. Smells a little like rotten milk.\"</p><p>\"Were you always so campy?\" He looked over at his Prima.</p><p>She nodded. \"Yes, actually. But I'm right.\"</p><p>Violet jumped and reached for the glowing cell phone in her back pocket. \"Just when things were getting good.\" She sighed as sat down on the cold ground. \"Hello. What? Now? I'm kinda in the middle of something, Nash. Oh, well talk about burying the lead. Of course. I'll meet you there.\"</p><p>Violet hung up the phone, and her energy danced around her. \"I have to go.\"</p><p>\"What?\" Valiance snapped.</p><p>\"Kandice just went into labor a month early. I have to go.\"</p><p>\"You've got a hostile vampire hunting innocents in the city.\"</p> <p>Violet patted him on the back. \"And I've got my best Riko on the case.\"</p><p>\"Riko? That's a shifter title.\"</p><p>Violet ran her fingers through her long hair as she pulled it back into a ponytail. She slipped off her tennis shoes and shoved them in her messenger bag. \"I'm a shifter. The words are pretty. Do you accept?\"</p><p>\"Accept what?\"</p><p>\"The rules and responsibilities of being the warrior and the protector of the pack?\" She zipped up her jacket against the cold wind. She dropped her personal borders, and her power sizzled around them. \"Do you accept?\"</p><p>Valiance knew you didn't say \"no\" to Violet, and even if you did, it didn't stay a \"no.\" \"Yes?\"</p><p>\"Wonderful. From what I've heard, there's a vampire going around and attacking innocents.</p><p>Take care of it. Call Tucker if you can't handle it.\"</p><p>Violet winked. In a blur of black and a whirl of energy, her panther form streaked down the street in the direction of downtown before Valiance could even manage a protest.</p><p>He clenched his jaw, and the pain flared again. \"I don't have my cell phone,\" he finally said to the wind.</p><p>\"Told you she wasn't worth it.\" Mondrian appeared in the street before Valiance, his hands casually in his pockets.</p><p>Valiance rose. The slick red over Mondrian's lips was unmistakable, even in the dim glow from the streetlights. He'd gotten a chance to feed. It was like hitting a reset button on the evening.</p><p>He'd be faster now, stronger than Valiance who barely had anything, power or blood, left.</p><p>\"The Prima trusts us to clean up our own messes.\"</p><p>Anger made the angles along Mondrian's face sharper, uglier. \"Is that what I am? A mess to clean up?\"</p><p>Valiance walked out onto the street, hiding the wince of every step. \"Destroyed my evening.\"</p><p>Mondrian looked at the small house. \"So your girl is special?\"</p><p>\"Yes.\"</p><p>\"And you're going to kill me, your own brother, to protect her?\"</p><p>\"Yes.\" The honesty rang through Valiance and made the sword on his back hum with anticipation.</p><p>Valiance saw another figure in the darkness. Female. Older. And completely under the sway. He recognized the glassy eyes of the woman as she stumbled this way and that. Like a marionette on strings, she danced how Mondrian wanted her to dance.</p><p>Valiance didn't have time to get her before she fell to her knees beside the white stone periphery of the house, her teeth snapping against each other as she dropped. Where a vampire couldn't touch the protective border, an innocent human would have no problem pulling a stone out of place to break the spell.</p><p>He ran for her, but Mondrian met him in the middle of the street. His brother slammed against him with the force of a semitruck, and they flew down the street. Valiance landed hard on the pavement, with his brother on top of him, and they rolled, both struggling for the upper hand.</p><p>There was a distinct clap of flesh meeting something solid, but it didn't come from him.</p><p>Valiance looked over from his position beneath Mondrian to see an old woman with a baseball bat standing over the limp body of the puppet woman. It had to be Esme's grandmother, the abuelita she spoke so lovingly about, wielding the bat like Babe Ruth himself.</p><p>The older woman's courage gave Valiance the kick he needed. He threw Mondrian over his head and jumped to his feet. He used the last of his energy to enhance himself, heal his leg, and give his muscles the strength they needed to wield his sword.</p><p>\"Keep the circle,\" he called out to the old woman.</p><p>The woman yelled something back at him. But he missed it when his eyes landed on Esme standing in the doorway of their small house. The entire world stopped for a moment, and he was caught up in the sight of her. Her dark hair unbound, her cheeks flushed, she glowed in the doorway of her home with her tear-filled eyes.</p><p>He heard Mondrian's sword sing as it cut through the air behind him. Valiance ducked and felt the wind of the attack against his hair.</p><p>Valiance swung his arm back hard, and Mondrian's ribs cracked under his blow. He turned around sharply and swept Mondrian's legs out from underneath him. The other vampire bounced against the concrete like a rubber ball. Valiance caught his shirt in his fist and threw him at the protective spell.</p><p>Mondrian slammed against the magical border and sizzled and seized within the white energy before being thrown across the street into a car. There was no alarm, just Mondrian's long groan.</p><p>Valiance tried not to smile, but it was the first break he'd gotten all evening.</p><p>He turned back to the house, where Esme and her grandmother were together on the porch.</p><p>He walked over to the edge of the white stones but didn't dare step across. He looked at Esme.</p><p>\"Are you okay?\"</p><p>\"No problem here,\" her grandmother said, her grip still tight on the bat.</p><p>\"Stay inside. I'll be right - \"</p><p>Mondrian's boot landed square between Valiance's shoulders, and he flew forward through the white-stone protective spell and landed hard on the frozen ground of her front yard.</p><p>Mondrian's hand clamped down on Valiance's ankle and raked him back along the ground. As Valiance struggled to stop, he felt the protection spell break around him as he pulled a white stone from its place, like the pop of an electrical transformer.</p><p>Mondrian ripped him from the ground and threw Valiance into the same car that had broken his own fall. Valiance let gravity take him and slid down to the pavement. He couldn't feel his legs for a moment and fell forward to his knees, seeing nothing but stars.</p><p>He leaned back against the car and shook the celestial array from his vision. He had to blink a few times for his sight to focus.</p><p>Mondrian was already on the porch. He grabbed Esme's grandmother and locked an arm around her neck, swinging her petite frame around like a rag doll.</p><p>He was less than a foot away from Esme, who had plastered herself against the outside wall next to the door.</p><p>His brother didn't need to yell; the wind carried his threats fine enough. \"Bet she never goes out with you again if you let her grandmother die.\"</p><p>Mondrian cloaked him and her grandmother in darkness and blurred away into the night.</p><p>Valiance tried to push himself up against the car, but the power was gone. He fell to the concrete. He couldn't breathe. Everything hurt, but it wasn't over. He might not have his unnatural strength, but he was still breathing. He wouldn't stop fighting until he stopped breathing.</p><p>Slowly, he pushed himself up to his feet and stumbled to the edge of the yard. He carefully put the stone he'd dragged out of alignment back into place.</p><p>He looked up to see Esme still standing on the porch, like a frightened statue, only her wide eyes following him across the yard.</p><p>\"Do you know where the locking stone is?\" he asked. He started to walk the periphery. He didn't know much about this kind of magic, but he knew the locking stone needed to be recharged if the border was going to go up.</p><p>Esme didn't answer, just watched him.</p><p>He kept walking. Fairy magic wasn't foreign to him; he was one, for Christ's sake. The glamour, the seeing of the unseen. The taking and giving of natural magic. Granted, he was the darker distant cousin of what normal people thought as fey, but the same principles applied. Too bad he'd never dabbled too much in garden magic.</p><p>It could have been his raw state, but as he passed the corner stone in the yard, a power sort of tickled at his ankle. He knelt. Well, it was supposed to be a kneel, but really he fell forward, landing next to a larger than average white stone half-buried in the yard.</p><p>He put his hand on the stone, and it was warm. A normal fae could probably just push power into the stone, but he was a vampire. It had to be blood with him.</p><p>He looked down at his hand to find a small trickle seeping from a wound on his knuckles. He smeared it against the stone. The periphery jumped back to life, like plugging back in a line of Christmas lights. What did you know? He did have it in him.</p><p>He had to take a deep breath before he pushed himself to his feet. When he did, Esme was standing right next to him. The spell between them didn't prevent him from smelling the flowers in her hair or seeing the bright sparkle in her eyes from the fearful tears that stayed wavering on the edge.</p><p>\"Where did he take her?\" she asked.</p><p>\"I do not know. But I will get her back.\"</p><p>Esme looked him over from head to toe. \"She didn't tell me much except that you're a . . .\"</p><p>Valiance cringed. He didn't want her to say the word; it would kill everything within him to hear the disdain in her voice.</p><p>\"That you can see me because you're a good guy.\"</p><p>Valiance felt like he could breathe again.</p><p>\"You'd better come inside. You don't look so good. And someone's going to notice that car.\"</p><p>He shook his head. \"We need to find your grandmother.\"</p><p>\"Abuelita is strong, apparently stronger than I ever gave her credit for. You need help before you go and get yourself flattened. Again.\"</p><p>SHE TOOK HIM into the kitchen, but when she flipped on the light, he flipped it off right behind her. It left the only light in the small room the glow from the stove top and the moonlight that filtered in from the small window.</p><p>Fear sizzled down her spine as she went to the far side of the room to get the first-aid kit.</p><p>However, all the fear turned to a kind of strange excitement as she watched him gingerly take off his jacket and his shredded dress shirt, exposing the sword running down the length of his back.</p><p>His shoulders were broader than any man's she'd ever seen, and the handle of the sword seemed to wink at her in the moonlight streaming in from the windows.</p><p>He slowly walked across the kitchen to the sink and began to wash his hands.</p><p>She grabbed a few towels for him and quickly set them beside him before scurrying back to her place at the end of the counter.</p><p>She could see pain in his eyes as he moved. He slowly dried his hands. He wetted the towel and held it to his face, wiping off some of the dried blood and sweat.</p><p>He drew in a tired breath before he spoke, his voice low, soft. \"Do you still have my phone? I think I need to call for help.\"</p><p>Esme had to think. The encounter already seemed like a lifetime ago. \"It's in my purse.\" She scooted around him quickly and dashed into her room to find it.</p><p>The foreign phone was easy to find in her familiar purse, and she slipped back into the kitchen swiftly, setting the phone between them on the counter.</p><p>Valiance took it and popped it open. He hit a few buttons and growled as he put the phone to his ear. At least, it sounded like a growl. \"No answer.\"</p><p>Esme gulped. \"So no backup?\"</p><p>Valiance turned around and leaned against the kitchen counter. \"I don't know.\"</p><p>\"You've said that too many times.\"</p><p>Valiance turned his blue eyes to hers. \"I am sorry, Esme. I never meant to . . .\"</p><p>Her spine stiffened, and the words that came out of her were hers but from someplace within her she wasn't familiar with yet, someplace jarred loose from this evening's activities. \"It's too early in the evening for apologies. What do you need to get her back?\"</p><p>Valiance sighed. He walked over to the table and sat down, looking much smaller than he had just moments ago as he put his bruised face into his hands.</p><p>He was less than two feet away, and she swore that every cell within her pulled toward him, pulled toward the fragility draped across his shoulders.</p><p>The decision solidified within her as she spoke words that were hers but not hers. \"I'm willing.\"</p><p>Her voice was barely a whisper across the kitchen.</p><p>His steel blue eyes were grayer now, as if the color had drained out of them, along with his blood, as he looked up at her. \"You don't know . . .\"</p><p>\"I do.\" Her voice was stronger as she reached for the unused first-aid kit. She cut an appropriate-sized piece of gauze. \"I mean I think I know what you need. Abuelita told me stories about people like you. You need blood to heal, and I can't find my abuelita without you.\"</p><p>She ripped off four pieces of tape and dangled them over the edge of the kitchen counter. Then she rolled up the sleeve of her jacket and held out her arm. \"I trust her, and the only thing she said to me tonight that made any sense was that you wouldn't be able to see me if you really wanted to hurt me.\"</p><p>His cool fingers reached out and slid around the inside of her wrist, just holding it gently. Goose bumps shot up her arm, and she gulped.</p><p>\"I made a promise to myself that I . . .\" He was so exhausted, he couldn't finish the sentence.</p><p>\"I've never had to make promises to myself. I've never had anything this horrible ever happen before.\"</p><p>He looked down at her pale wrist as he stroked it with his finger. \"You think I'm horrible.\"</p><p>She took in a deep breath, trying to calm the stammering of her heart. Her words might be brave, but her body was still catching on to the idea. \"No. But as far as first dates go, I'm sure this is up there with the worst ever.\"</p><p>\"It was selfish of me. I just wanted to have a pleasant evening with a pretty girl.\"</p><p>His words caused a flutter in her stomach. She tried to convince herself he would say anything right now to get blood, but she couldn't believe it. Especially after he looked up at her, his skin paper white in the dim light. The heavy look in his eyes made her forget about the press of sharp white on his lower lip.</p><p>\"Esme, I . . .\"</p><p>She cut him off. \"I did nothing, Valiance.\" The name those men had called him fit better as she said it out loud. It was more him than the abbreviation. Even more regal than the name on his credit card.</p><p>Esme went on. \"He was three feet away from me, and I froze. I couldn't even move until after he'd already taken her. I need to do this. I failed in my first attempt at bravery. I will not fail in my second. I will not fail her.\"</p><p>His hand tightened on her wrist, and he pulled her down the edge of the counter until she stood before him. Her pulse raced in her ears as he leaned forward, his forehead almost resting against her breasts as he pulled something off the counter behind her. He pressed that something into her right hand as he pulled away.</p><p>She looked down at the silver knife. \"Will this really do any damage?\"</p><p>\"It's sharp enough to ensure I stop.\"</p><p>Esme curled her fingers around the handle though she wasn't sure she could use it on him.</p><p>His eyes trailed down to her tender wrist, still in his hand, as he sat back down on the chair before her. \"I promise this will not hurt much.\"</p><p>When his lips touched her arm, heat flew up her wrist and burned into her core. She barely felt the slice of his teeth against her skin. She was more focused on the other hand he slid around her waist, pulling her closer to him, keeping her still.</p><p>His tongue began to coax out the blood, undulating slowly against her skin. Not that he needed to work much, her stammering heart was rushing blood to all her extremities and warming every part of her.</p><p>She leaned back against the cabinets, and her eyes fluttered shut. Immediately, her thoughts traveled to what else he could do with that tongue, where else it might have the same flushing effect.</p><p>He gripped her waist tighter, and the pressure on her arm increased. She gasped as she felt a stronger pull of blood out of her veins.</p><p>\"Val,\" she said softly.</p><p>When his fingers began to dig into her arm, she gasped, and cool fear fought the intense heat that had spread throughout her.</p><p>\"Val,\" she repeated. She tried to pull her arm back, but his grip was too strong.</p><p>\"Valiance,\" she cried out.</p><p>He was standing above her in less than a blink. His eyes were livid blue with blown pupils, and his mouth was stained red. His body pressed her against the counter, and she was awash in the smell of blood and sweat. The monster was here, and still hungry.</p><p>But just as fast as he had risen, Esme had the knife to his throat. The flash of the silver blade dug into the pale skin, and her eyes steadily gazed into his dark pools. Her heartbeat steadied, and she let out a long breath. That other part, that braver part, saved her and settled in for the evening.</p><p>\"Sit,\" she ordered.</p><p>Valiance did as he was told, and the moment he was in the chair, he looked away.</p><p>Esme looked down at her wrist to see nothing more than an inch-long slice on her lower forearm. It wasn't like the movies at all, probably wouldn't even scar, but then again, she didn't need anything to remind her of what happened tonight. She grabbed the bandage and taped up the small wound, keeping her fist to her chest to stop any bleeding.</p><p>He was looking down, away, his neck exposed.</p><p>She watched the fair flesh come back together at his cheek, mend itself until it was a bruised reminder of what had happened earlier. Esme couldn't believe the magic before her eyes. That a little bit of her blood could do all that wonder. Maybe she really was something special.</p><p>\"Valiance?\" She kept her voice soft as she reached out to his shoulder.</p><p>\"Are you okay?\" he asked, still looking away from her.</p><p>\"You were the one pulverized.\"</p><p>\"Please, Esme.\" When he looked up at her, she'd never felt so seen. His blue eyes glowed with power, and everything about him was perfect. The bruises on his cheeks were gone. He looked rested, flushed even. His cheekbones could cut leather, and his lips were the most perfect shade of rose.</p><p>He still wasn't as beautiful as when he had smiled at her in the coffee shop the first time.</p><p>\"I'm fine,\" she finally managed.</p><p>\"Please don't look at me like that.\" He stood and strode across the kitchen to a darker corner.</p><p>\"What?\"</p><p>\"It's part of the blood, part of the glamour. It attracts, and I feed. Do you understand?\"</p><p>\"The power makes you pretty?\"</p><p>\"It makes me attractive, so I can feed.\" He licked his lips of any red still left there. \"And you're fey, right? I wasn't really sure.\"</p><p>Esme grew colder as she thought about the why of his perfection and that he was tasting the magic in her blood. She shivered. \"But you're faster, stronger, too. I mean, I saw you fight that other vampire, and you were - \"</p><p>\"Some days, the other perks aren't worth it.\"</p><p>She tried to lighten the mood, get the conversation going again because the guilt that shaded his eyes struck a pain through her heart, and the last thing she needed right now was a sullen vampire on her hands. \"Did you know that to her family and friends, Emily Dickinson was more known for her gardening than her writing, and she would send bouquets to her friends with poems attached?\"</p><p>Valiance frowned, but his expression slowly turned into a smile. \"You really do like that poetry class you're taking.\"</p><p>She smiled, relieved, and started packing up the first-aid kit. \"I just relate to them. All the great ones looked in from the outside. We loners have to stick together.\" She thought she heard him chuckle from the other side of the kitchen. \"What do we do now?\"</p><p>Valiance looked down at his hands, his long fingers, and turned them over to inspect them. He rubbed his chin and tested it. \"I should be able to track him down now. He's not a strategist, so he'll go where he feels safe.\"</p><p>\"What will he do with my abuelita?\"</p><p>\"Nothing. He's still trying to get me to go with him.\"</p><p>\"What about kidnapping my abuelita will convince you to go with him?\"</p><p>\"I have no idea. Just managed to piss me off really. You don't touch grandmothers. They are universally off-limits in the rules of engagement.\"</p><p>\"Rules of engagement? You sound like one of those old generals in a Civil War movie.\"</p><p>\"I was one of those generals in the Civil War.\"</p><p>\"Oh.\" That meant he was old. Like really old. She let the fear wash over her again before she took a deep breath and just integrated it with what she knew about him. He opened doors, he drank blood, he fought to protect her, and he was older than her grandmother.</p><p>It was more interesting than her list of traits: inviso-girl.</p><p>Esme put away the first-aid kit and rolled down her sleeve. \"So what do we need to do?\"</p><p>\"We?\"</p><p>\"She's my grandmother. I'm going after her. Don't exactly know what I can do as the invisible girl, but I'm going with you.\"</p><p>Valiance stepped out of the darkness and into the light from the stove. Gold fell across his perfect features, and her breath caught in her throat as he continued toward her.</p><p>Even his voice was smoother now, deeper, softer. \"I want you to be sure about this, Esme.</p><p>Once you've seen violence, seen evil, it changes you, and I don't want to be the reason you see the world a little darker.\"</p><p>Esme's skin flushed with his words and with his scent as it beat around them both. \"What's your real name?\"</p><p>\"What?\"</p><p>\"That thing called you Valiance, but it's not the name on your credit card. What's your real name?\"</p><p>Valiance licked his lower lip.</p><p>\"Why?\"</p><p>She was honest. \"Valiance sounds made up.\"</p><p>\"It was.\"</p><p>Esme looked up and tried to fight a smile. \"What?\"</p><p>\"My Clade Source Emilio, the one who made me, renamed us into our new life. One word to describe us.\"</p><p>\"And yours was Valiance?\"</p><p>\"Warrior prince, he used to call me.\"</p><p>Esme knew that no other name could suit him. \"Like the fairy tale?\"</p><p>\"I'm not a fairy tale.\"</p><p>\"I'm not saying you are,\" she said quickly. \"I'm simply saying that it's like a fairy tale. Like everything else that's come true tonight. And if vampires and fairies can be real, then I think we have a good chance of getting my abuelita back.\"</p><p>Valiance watched her for a long moment, then went to get his jacket from the kitchen chair. His movements were fluid, smooth, not the jerky pain from before. \"There are three places he might go. The apartment, the shop, or this warehouse off Industrial.\"</p><p>\"Great. Let's go find him.\"</p><p>\"We need more of a plan than just knocking on the door.\"</p><p>\"What if I knock?\" she asked. Her stomach tightened. Where would an insane plan like that come from? \"What?\"</p><p>Esme licked her lips. \"What if I knock, he doesn't see me, and I sneak in? Distract him somehow?\"</p><p>Valiance thought. It took him a long time, and Esme was suddenly nervous. What did she know about covert ops and rescue missions? It was probably a ridiculous idea that might lead straight to her death. Or worse, her grandmother's.</p><p>Slowly, a smile spread across his lips. \"I don't think you're the same girl I asked out for coffee.\"</p><p>\"I've been through a lot this evening. I'm not the same girl I was five minutes ago. I woke up this morning a normal human girl with low self-esteem, and now I'm some fairy who's invisible to bad guys. Who knows what I might be by dawn?\"</p><p>He laughed. That one deep laugh as he looked at her. \"We need to get going. Can you drive?\"</p><p>\"Is that why you walk everywhere? You can't drive a car.\"</p><p>\"Over a hundred and fifty years old, and I still can't get the hang of it.\"</p><p>\"But you have a cell phone?\"</p><p>\"I like texting.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>VALIANCE WAS HAVING a hard time sitting still in the front seat of her car. The power, the energy that flowed through him, was like nothing he'd ever had before. The little bit of blood that he had taken had given him more power than he'd had in a decade. Everything smelled sweeter, everything felt softer. His muscles tingled anxiously, waiting for action again. Not only was she a fairy, but she was powerful one.</p><p>When his cell phone rang, he jumped in the passenger seat, and Esme swerved.</p><p>\"You all right?\"</p><p>\"Fine.\" Valiance looked at the caller ID and put it on speakerphone. \"Talk quick. Phone's almost dead.\"</p> <p>\"You guys okay?\"</p><p>\"He took Esme's grandmother. We're hunting him down.\"</p><p>\"I'd volunteer to send Chaz, but there's a swarm of ghouls tearing up some butcher shop in Oak Cliff.\"</p><p>\"So your night is going well?\"</p><p>\"Never a dull moment. How's your girl holding up?\"</p> <p>Valiance looked over at the driver's seat. He wanted to say Esme was the most luminous thing he had ever seen. But it was only a first date. Maybe all first dates were like this, minus the kidnapping and bloodletting.</p><p>Esme beat him to it. \"We are going to get my grandmother back, then you and I are going to discuss getting me a job at the coffee shop.\"</p><p>The phone line was quiet for a moment. \"Well, Bastian is really the manager there.\"</p><p>\"I'm tired of folding towels, and I'm sure the owner could put in a good word for me.\"</p><p>\"Val, take me off speaker.\"</p><p>Valiance did as he was told, prepared to get an earful.</p> <p>Instead, Violet only said. \"Keep her, please. You don't meet a girl every day who can just fall into violence and still be confident enough to backtalk the Prima of a city.\"</p><p>\"She doesn't know - \"</p><p>\"Keep her. Sounds like you've got some pretty good backup. But if you really need help, send up a flare, and I'll be there.\"</p><p>\"Yes, ma'am.\"</p><p>Valiance hung up but looked down at the phone in his hand.</p><p>\"What didn't I know?\" Esme asked.</p><p>Valiance licked his lips as he prepared his words. \"Violet's not just a coffee-shop owner. She's the most powerful Wanderer in the region. Possibly in the country.\"</p><p>\"And?\"</p> <p>\"You just told her she needed to get you a job.\"</p><p>\"And?\"</p><p>Valiance smiled. \"You're just nothing that I've seen before.\"</p><p>\"I'm nothing anyone has ever seen before apparently.\" Esme flashed him a smile as she continued down the highway.</p><p>ESME PARKED ALONG the curb. It was an older neighborhood she had never been to before. Just another example of her universe expanding this evening.</p><p>\"Welcome to my second home,\" Valiance said as he pointed to the shop across the street.</p><p>Emilio's Antiques was a restored home in a long line of restored homes turned into shopfronts. If this looked like a normal shop, she wondered how many other places her grandmother had dragged her to were also run by things that went bump in the night.</p><p>Suddenly, Valiance turned to stone in the passenger seat next to her.</p><p>\"He's here, isn't he?\" she whispered, as if Mondrian could hear them.</p><p>\"Yes,\" Valiance said. \"I wasn't able to feel him like this before. Forgot how much of an effect we have on each other.\"</p><p>\"Which means he knows we're here, too. So much for the element of surprise.\" She sighed.</p><p>\"What about me? Can you feel me in your head since I'm supposed to be magical or something?\"</p><p>He looked over at her. \"I don't know,\" he whispered. \"My head's a little funny around you anyway.\"</p><p>Esme bit her lower lip and suddenly found the edge of her jacket very interesting. This was now officially the worst best date ever.</p><p>Valiance turned to her in the car. It was a bit comical, his long legs twisted up in the front of her VW, as he reached down by his boot to unlace a bowie knife from his calf. \"When we get in there, your only goal needs to be getting your abuelita out of there.\"</p><p>The skin tightened along her shoulders as his perfect accent caressed the familiar word.</p><p>\"Do you understand?\"</p><p>\"Yes, but how?\"</p><p>\"You're going to knock on the door.\"</p><p>Esme laughed. \"You can't be serious.\"</p><p>\"Completely. You knock on the front door, and I'll go in through the back door.\"</p><p>\"And if he's got both covered somehow?\"</p><p>\"You hide. I'll fight. Now take this.\" He shoved the leather-sheathed knife at her. \"He will get violent. Ultimately, he wants me to come back with him - \"</p><p>\"Which means he doesn't care about me and abuelita.\"</p><p>\"Exactly.\" Valiance sighed.</p><p>\"So we protect ourselves and leave you to the wolf?\"</p><p>Valiance looked into her eyes. \"I'll survive.\"</p><p>\"I don't want you to survive. I want you to live with all your parts in place. I'm not leaving you in there like a coward. If I've discovered anything about myself in the past four hours, it's that I am not a coward.\"</p><p>Valiance blurred before her, and his lips were upon hers before she could finish her thought. His lips were warm but hesitant. He slid his hand up to hold her jaw but didn't deepen the embrace.</p><p>Her body hummed like a fluorescent bulb. Energy danced along her skin with the novelty of being kissed in the front seat of her car like a high schooler, something she hadn't actually had done as a high schooler.</p><p>She kissed him back, taking in more of his soft lips, tasting the slight copper of him. She burned the taste of him into her brain, the warmth that pulsed against her. Their warmth, she thought again. Her bravery had brought him back to life.</p><p>He was the one who pulled away, and when he did, she knew he was different, changed from the moment before to the moment after. Everything she'd ever read about warriors flashed through her mind, and she had half a notion to give him a token as he went off to war.</p><p>Valiance licked his lips, leaving them shiny in the moonlight and completely distracting. \"You knock on the front door. I'll go in through the back, and we'll meet in the middle.\"</p><p>Esme looked ahead and tried to focus on the plan. Knock on the door and sneak in. But as she shifted in the seat again, his arm brushed against hers, and all she could think of was his lips on hers and how she wanted to do that again.</p><p>\"Esme?\"</p><p>She could feel his breath on her neck. \"Yes?\" She gulped as she stared at the steering wheel.</p><p>\"I think you're glowing.\"</p><p>She looked down at her hands, held out before her. They looked like her hands, all normal and small. \"I think you might be seeing things.\"</p><p>\"I don't think so.\" He turned the rearview mirror toward her, and she could see what he had seen. Like someone had sprinkled her with candlelight, there was a slight illumination to her skin.</p><p>And there was a sparkle in her eyes that wasn't normally there.</p><p>Her gaze snapped over to Valiance. \"What does that mean?\"</p><p>Valiance shrugged and put the rearview back where it had been. \"I only know one fairy.\"</p><p>\"And does she glow?\"</p><p>\"Only when she's happy.\"</p><p>Esme looked away but fought the urge to bury her hands in her face. \"So much for being dark and exotic and not pathetic at all.\"</p><p>\"Dark and exotic has nothing on you.\"</p><p>Esme tried to bite back the smile that accompanied the butterflies in her stomach. She didn't think that one human could feel so much in one moment. Fear for her grandmother, embarrassed that he could see right through her, and complete admiration for the man in the seat next to her.</p><p>But then again, she wasn't all human, so maybe this was just par for the course.</p><p>\"We'd better get going.\"</p><p>He hurried out of the car and swooped around to the driver's side to open her door for her. He offered his hand to help her out. She knew that she shouldn't be smiling, but she did as she slid her hand into his. It was warm, soft, and gave her just enough support as she exited.</p><p>It was a horribly outdated gesture, but effective. It gave Esme the distinct feeling that this was still a date. There might still be some hope, providing they survived the night. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>VALIANCE STILLED HIMSELF at the back of the building and drew the darkness around him. It was an old talent he hadn't used in a while and the power, the glamour, was hard to hold.</p><p>He locked his eyes on Esme. She'd taken a position at the front of the building and was leaning against the wall, her head against the brickwork as she prayed. He watched her cross herself and close her eyes. Her rose lips muttered a prayer For the first time in a century, Valiance prayed, too. It wasn't to God or anything. It was just to the wind and the dirt. He didn't know any blessings or anything. He kept it simple. Keep Esme safe. If you gave her this power, then keep her safe so she can learn how to use it.</p><p>The wind carried Esme's floral scent to him, and for a moment, he thought maybe the wind had heard him. Maybe the wind was at their back. Maybe the earth was a fan of grandmothers as well.</p><p>Esme let out a long breath and fluttered her eyes open to look back at him. Despite his cloak of darkness, Esme waved and gave him a thumbs-up. With a soft smile, she slipped around the front of the building.</p> <p>She was going to be something amazing, and every ounce of him wanted to be there when it happened.</p><p>Valiance squared his shoulders and turned the hilt of his sword over in his hand before finding a grip. He walked softly up to the back door and surveyed it. Carefully, he reached out and touched the door handle. No electrical charge. Not iron. No precautions.</p><p>Did Mondrian want to get caught? Was a part of him asking Valiance to kill him to get it over with? There was only one way this was going to play out. One.</p><p>He closed his eyes and listened, with a capital \"L,\" for Esme to knock on the front door.</p><p>The sharp rap on the door echoed through the building. Valiance counted to ten before he turned the knob and pulled open the door.</p> <p>The explosion lifted him up and off the ground. The flames burned his jacket, and his fair eyebrows were forfeit.</p><p>The chain-link fence at the back of the property cradled him like a wiry catcher's mitt, and he rolled forward onto the ground. He landed on his knees, and his lungs smoldered as he tried to catch his breath.</p><p>Mondrian wasn't going to give Valiance those brief seconds to recoup. He charged toward Valiance, his sword slashing out before him. Valiance had moments to flatten himself against the ground to avoid the edge of the blade.</p><p>Valiance grabbed Mondrian's leg and jerked him to the ground. Mondrian crashed, and his sword was knocked out of his hand.</p><p>Valiance shook the ringing from his ears before he went on the offensive. He jumped to his feet and darted to where his own sword rested in the long grass. The sword vibrated in his hand as if agreeing to his purpose.</p><p>It took Valiance one thought, one flash of a second to let his power consume him, let his energy enhance everything about him, heal his burns, and adjust his eyes to the dim lighting in the yard.</p> <p>The thought that this energy was Esme's fueled him further; that he was doing this for her made him stronger Mondrian still searched for his sword. \"Didn't peg you to come alone. Thought you'd have that pussy Prima of yours.\"</p><p>Valiance waited. His brother might have taken the wrong path, but he still deserved an honorable death. \"You're stalling. You always get mean when you stall.\"</p><p>\"I'm not stalling. I've got 'til dawn to convince you to come home.\"</p><p>\"My home is here.\"</p><p>\"Our place in Atlanta is amazing. The old family seat, Valiance. It really would be Thomas Valmont coming home.\"</p><p>Atlanta. The memories were so far gone that Valiance's mind fogged trying to recall them. For a moment, he saw himself happy. He saw himself with his family, with his grandmere on the porch, her soft sweet smile as she hummed into her needlepoint.</p><p>Valiance shook the memory from his head. His grandmere was dead. The house had been burned in one bout of violence or another. There was no home for him there anymore because there was no family there anymore. He wasn't Thomas Valmont anymore.</p><p>Just as Valiance was about to say that, Mondrian slammed into him. Valiance doubled over the man's shoulder and rammed the hilt of his sword into Mondrian's spine. The man cried out and crumpled beneath him.</p> <p>Valiance kept hold of his sword as the fight became a twisted mesh of swinging arms and wrestling legs. Once they regained their footing, Valiance always had the upper hand; his sword did not fail him. Mondrian's grunts punctuated the heavy staccato of metal on metal.</p><p>Valiance spun Mondrian's sword off into the darkness, only adding fire to his fury. As Mondrian set up for another attack, Valiance watched as his friend, his brother, disappeared and was replaced by a monster. Valiance would mourn later, only after he'd put him out of his misery.</p><p>Valiance cried out into the darkness as he ran at the man. There was another exchange of blows. This demon was fast, but Valiance was smart. He tasted blood, smelled blood, but his energy, her power, was a fire that ran through him.</p><p>The sound of a car door distracted Valiance for a moment, and in that one moment, Mondrian pinned him to the ground. His lips were pulled away from his sharpened teeth, and his eyes burned with a dark fire. A kind of dark Valiance hadn't seen since, well, since the demon he and Violet had taken out six months ago.</p><p>Until Violet, he had never known true darkness.</p><p>Until Esme, he'd never known true light.</p><p>\"I will never go back.\"</p><p>Mondrian's Master spoke. \"What have you got that's worth dying for?\"</p><p>For the first time, he was honest with his brother, and the wind and the stars that shone down on him. \"Hope.\" Hope in her. Hope in his city. Hope that someday he could be that man.</p><p>\"Pfft,\" the Master said. \"Hope is a city in Arkansas.\"</p><p>\"Hope is a thing with feathers.\"</p><p>Mondrian's blade flashed above them. The sword made a sickening thud as it sank into the back of Mondrian's neck.</p><p>The man reared up and spun on his invisible attacker.</p><p>Esme screamed and ran.</p><p>Valiance jumped to his feet. He grabbed the handle of the sword and pulled it out of Mondrian's neck. The force pushed Mondrian off balance, but he still stumbled in Esme's general direction, his claws lashing out into the night, his head dangling by his windpipe.</p><p>Using gravity and the sheer need for this to be over, Valiance swung the blade over his head to deliver the last strong blow to Mondrian's neck.</p><p>Blood sprayed the small yard as Mondrian's body fell lifeless to the ground. His head rolled but found a resting place in a soft patch of weeds.</p><p>Valiance's chest heaved as his heart raced. His arm dangled at his side as he looked at the still body. For the second time that night, he found himself praying. Keep him. Take his energy back into the earth and remember him, remember what he was.</p><p>That's when Esme started screaming.</p><p>Valiance dropped his sword and rushed to her. \"Are you okay? Are you hurt?\"</p><p>Esme burrowed her face into his chest and shook. He wrapped his arms around her and felt every ounce of his fight response seep away, replaced by a warm pulse, her pulse. It was only when he realized he'd synced to her heartbeat that he let her go. Her fingers were wound tightly in his cotton shirt, so he couldn't go far.</p><p>\"Please, Esme. Are you okay?\"</p><p>Her wide brown eyes were not filled with tears, but her body still shook. \"I just killed someone.\"</p><p>\"Technically, you just injured him really bad.\"</p><p>A strand of her dark hair fell across her forehead and caught in her lashes. \"But he's dead. I did that.\"</p><p>Valiance reached up and pushed the errant strand of hair behind her ear. He'd been wanting to do that all night.</p><p>Esme frowned slightly. \"And I did it to protect you.\"</p><p>He nodded. \"You did. Thank you.\"</p><p>Esme smiled, then her entire body shook.</p><p>\"Where is your abuelita?\"</p><p>\"In the car with the bowie knife. She told me I needed to rescue you.\"</p><p>\"It seems you have.\"</p><p>Esme closed her eyes and took in a long breath as she rested her head on his chest. Valiance's eyes closed as he reveled in the heat of her, the pulse of her, so close and so unafraid of him. This was a quiet he could get used to.</p><p>Slowly, the shaking stopped. \"It's grass.\"</p><p>\"I was just rolling around in it.\"</p><p>\"No, the deeper smell. I thought it was just a cologne or something, but that's the real you. The underneath you. A vampire that smells like fresh-cut grass.\"</p><p>Valiance couldn't stop smiling; his cheeks were beginning to ache with it. \"I guess I don't notice it.\"</p><p>\"What do I smell like? My deeper smell.\"</p><p>He knew part of this was the trauma talking. He took the opportunity to run his arm around her shoulders and begin to nudge her slowly toward the front of the house.</p><p>\"Wildflowers. Sun-warmed wildflowers.\"</p><p>They cleared the backyard, and Esme's fingers finally unfurled from his shirt.</p><p>\"I guess for a fairy, smelling like flowers isn't very original.\" Esme pulled away from him and seemed steady enough to walk on her own.</p><p>\"I can with all honesty say that I've never heard someone quote Emily Dickinson before delivering a deathblow.\"</p><p>Esme stopped and put her face in her hands.</p><p>Valiance's stomach tied up in knots. \"I'm sorry,\" he said quickly.</p><p>Esme started to softly chuckle. \"No,\" she said as she dropped her hands from her face and shrugged. \"I guess that's what I do in times of action. Something else I learned about myself today.\"</p><p>\"So what's the grand total?\"</p><p>They stopped by Esme's car. Valiance gave a small wave to her grandmother, who sat in the front seat with the knife clearly displayed.</p><p>Esme counted the newly learned facts on her fingers. \"I'm invisible to bad guys. I'm a fairy. I'm not a coward. And I quote poetry when I fight. What have you learned today?\"</p><p>Valiance took in a deep breath. There was a dead body in the backyard that the Cleaners would need to dispose of, and he was pretty sure he should call their contact in the police force because an explosion would catch someone's attention, even in this neighborhood. But none of that seemed to matter. \"This was probably the worst best date ever. Or the best worst date ever.\"</p><p>A blush spread across Esme's cheeks, and her floral scent filled the air around him and seemed to seep into him. \"It was a first date. I've been told all first dates are hell.\"</p><p>Valiance found his hands shaking as he asked the question, so he jammed them in his pockets.</p><p>\"Is it too early to ask for a second?\"</p><p>Esme looked down at her hands. He saw the blood crusted in her fingernails, the crimson spray across her shirt. The moonlight caught the white bandage at her wrist, and again, he felt his palms begin to itch with nerves.</p><p>But when she looked up, and those wide brown eyes caught his, the hope that he had spoken about earlier seemed to flutter through him.</p><p>\"Sure beats folding towels on a Saturday night.\" </p> </body></html>"]