["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Luce wanted to live up to her name tonight. She’d just turned twenty-one, started her new job, moved into her own place last weekend and finally, finally had some goddamn privacy. Her life was her own and tonight she intended to start living it on her terms.</p><p>No more Mom watching at the living room window and coming out to chase off a date who kissed Luce too long. No more nosy brothers and sisters getting into her stuff or listening to her phone calls and tattling to Dad. No more parking on golf courses and twisting herself into a pretzel to screw in the backseat of her Mustang. She was an adult now. She could go where she wanted, when she wanted. She could cruise the clubs every night, and bring home whatever guy she wanted and no one could say shit about it.</p><p>There would be plenty of them, too. Luce needed sex, thought about it, craved it all the time. Nothing made her feel as beautiful or powerful as when she made it with a new guy.</p> <p>She’d planned to start the evening at Infusion, the goth club that her friends always raved about, but she couldn’t find an open parking space within five blocks of the place. With Christmas only a week away, it seemed as if everyone had come out to party early. She drove south until she found a spot and wedged her car between an Escalade and a Hummer across the street from the Sunset Sails Hotel. Her mom and dad had honeymooned at the place, she remembered, and they’d been all broken up when it had closed. As Luce crossed the street and looked up at the peeling paint and broken windows of the ageing hotel, she felt a surge of disgust. The place had become an eyesore that needed to be torn down before the junkies turned it into a crack palace.</p><p>Luce turned to start the long walk north toward the lights and noise of the clubs, and stopped as a very cute guy almost walked into her. “Excuse me.”</p><p>The guy didn’t say a word, but went around her, stepped over the chain across the drive, and walked up to the front doors of the hotel.</p><p>“Hey, it’s closed,” she called after him, and frowned as the door opened and he disappeared inside. “I mean, it’s supposed to be closed.”</p><p>Luce looked around before she stepped over the chain and started up the drive. The glass doors had been boarded up, but someone had sawed through the two-by-fours, right down the middle. Red light glowed in the thin gap between the raw ends. As she got closer, Luce smelled something deliciously hot and sugary.</p> <p>Here’s a bat.</p><p>At the same time she heard the whispering voice, another, cuter guy brushed shoulders with her as he walked past and went inside.</p><p>“What is going on?” Luce moved to the door and tried to peer through the gap. “You having a Christmas party in there?”</p><p>She wasn’t stupid; no way was she walking into what could be a flop house or meth lab. But while she couldn’t see anything but red light, she didn’t hear or smell anything scary. It was all quiet, warm and sweet.</p><p>“I’ll say I’m lost,” Luce muttered to herself as she curled her fingers around the door handle. “That I need directions to the club.”</p><p>The first thing Luce saw inside were hundreds of hurricane lamps made of pretty red glass with a rainbow sheen – carnival glass, her mother called it. Every one of them had been lit, and filled the deserted lobby with soft rosy light. No Christmas decorations, but someone had recently been working in here; paint-stained tarps cover the reception desk, the lobby furniture and part of the floor.</p> <p>Nowhere did she see the two guys or another soul.</p><p>“Hello?” Her voice bounced off the walls and rang, high-pitched and nervous, in her own ears. “Is anybody in here?”</p><p>I am here. Here’s a bat.</p><p>“What?” Luce still couldn’t make sense of the words the voice kept murmuring. “I don’t see any bats.”</p><p>Here’s a bat.</p><p>No bats appeared, but the two cute guys came out from doors on either side of the desk. They stopped and stood a few feet away from her, not looking at her or anything in particular.</p><p>“Hey.” Luce tried to smile at the cutest of the pair, but his empty expression made her uneasy. “Sorry, I was going to ask . . . sorry.” She backed up a step and spun around, prepared to run. Only the voice began whispering again – stay, pretty girl, here’s a bat – and her legs went numb, and her head began to spin.</p><p>The voice wasn’t saying here’s a bat, Luce realized. It was one word, like a name: Heresabat. A strange name. “What do you want?”</p> <p>The whisper echoed her words with slightly different emphasis. What do you want?</p><p>Luce’s fear drained away slowly, leaving a blessed emptiness. “Guys,” she heard herself say in a drowsy voice. “Sex with guys. A lot of guys. As many as I can take, all night, every night.” No one came near Luce, but she still felt a cool hand curl around her throat. “Heresabat will give you what you want, pretty girl. What will you give in return?”</p><p>“Anything.” The smell of cotton candy and gratitude warmed Luce’s cold heart. “Everything.” #</p><p>“This belongs to Missing Persons,” Homicide Detective Samantha Brown said as she tried to hand the file she’d just been given back to the records clerk. “We only get them when they’re found deceased.”</p><p>“Came from upstairs, detective, sorry,” the clerk said. “You want to bounce it back, talk to your captain first. Merry Christmas.” He pushed his file cart back out into the hall.</p><p>“Thanks a lot, Santa.” Sam dropped the file on top of the stack of paperwork she had yet to read, partially tipping it over. She glanced over at her partner, Rafael Suarez, who was typing up a witness statement. “Did someone cut the budget again and forget to tell us?”</p><p>“Medrano is on holiday until the new year, and Colley had to transport a juvenile back to New York,” Rafael said absently. “According to yet another memo that you didn’t read, we are to fill in.”</p><p>“Marvelous.” Sam opened the file and skimmed the top report. “Luce Figueroa, twenty-one, last seen by parents on December fourteenth, car towed from Bahia Mar parking lot on the morning of the fifteenth.” She reached for the weekly morgue report and checked it. “We haven’t had any Jane Does come in since August.” She kept reading. “Looks like she just got a new job and moved into her own apartment.”</p><p>“Perhaps she was overwhelmed by the responsibilities, and decided to take a street trip,” Rafael suggested.</p><p>“Road trip.” Sam flipped over to the next statement. “According to the parents, she just moved into this place the end of November.” As her phone rang, she reached out and groped until she found the receiver under the collapsed file stack and answered it. “Homicide, Detective Brown.”</p><p>“Infusion, your lord and master,” a man with a low, vaguely-British accent mocked. “What are you wearing?”</p><p>She laughed. “My badge, and a fully-loaded nine millimeter.”</p><p>“One would hope so.” Lucan, Sam’s lover and the lord paramount who ruled the southernmost Kyn territory in America, had a voice as velvety as the gloves he always wore. “But what are you wearing beneath them?”</p><p>“You should remember.” She glanced down at her tailored burgundy blouse and black trousers. Both were made of light, obscenely comfortable silk. “You had to redress me before I left the lair.”</p><p>“You kissed me,” he said. “Under the circumstances, I cannot be held responsible for any garments I may rip from your body.”</p><p>“Which is why I make you buy all my clothes now.” Sam closed the Figueroa file. “So what’s on your mind, Goldilocks?”</p><p>“Aside from thoughts of making love to you until you promise to stop using that ridiculous nickname for me? Nothing at all.” He sipped something. “Our beloved seigneur, however, has asked a favor of us for the holidays. As much as I would enjoy telling him to bugger off, I could not refuse.”</p><p>Sam rubbed her forehead. For centuries Lucan had despised Michael Cyprien, who as seigneur ruled over all of the suzerain in America, and his feelings had been reciprocated. Now that Michael had made Lucan one of his suzerain, their relationship vacillated awkwardly between strained, reluctant and hostile. “What does he want?”</p><p>“It seems that Jamys Durand, Thierry’s son, needs some time away from his blood kyn,” he said. “He is travelling here to spend Christmas in Fort Lauderdale. Michael asked if we would look after the boy for a few weeks.”</p><p>Sam tried to remember what Burke had told her about the Durands. They were an old French family somehow associated with Cyprien. “Why didn’t Jamys call and ask himself?”</p><p>“He’s mute,” Lucan said. “He was tortured by the Brethren. They tore out his tongue.”</p><p>Reflexively she swallowed. “Jesus.”</p><p>“Had nothing to do with it, I assure you,” he said. “But there is some hope for him now. Alexandra has operated on him and repaired the damage.”</p><p>Dr. Alexandra Keller, a human reconstructive surgeon who had been accidentally turned to Kyn by one of her immortal patients, had changed many lives. Her skills had repaired a great deal of the damage done to the Kyn, and Lucan had even used her transformed blood to heal a gunshot wound that should have killed Sam.</p><p>“Since we heal instantly, why isn’t he talking?” she asked. “Or did Alex mess up?”</p><p>“The surgery was a success, but the boy will not speak,” Lucan admitted. “I spoke briefly to Alex, and she believes Jamys is remaining silent out of fear that the results will disappoint his father and family. I’ll wager sending him here for the holidays was her suggestion.”</p><p>“Makes sense.” Sam eyed her partner. The Darkyn followed strict customs and rituals, most of which had been practiced during medieval times. Whenever one of the immortals came into another’s territory, all sorts of elaborate, formal introductions had to be performed. “Do you need Rafael back at the club for the meet and greet?”</p><p>“No, Burke is handling the arrangements. Young Jamys travels alone, and should be no trouble.” Lucan’s tone changed. “Of course, if you could see your way to leaving work early, we could spend some time in our bedchamber, discussing how we might entertain the boy.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She eyed the slumped pile of case files. “Not tonight.”</p><p>“I could make it worth your while, Detective.”</p><p>Discussing anything with Lucan in a room with a bed generally resulted in no discussion at all. The man was insatiable. “We’ve got a missing girl to track down, so stop trying to seduce me over the phone.”</p> <p>“Trying?” he echoed. “Samantha, I am your liege lord, your life companion and your lover. I do not have to try.”</p><p>He sounded so profoundly offended that she laughed. “I think we’ll discuss this later, Romeo. Good-bye.” She hung up the receiver. “You can stop smirking,” she said to Rafael. “Any time now.”</p><p>His smile didn’t waver. “Yes, my lady.”</p><p>One of the drawbacks to working the night shift was arranging interviews with victims, witnesses and suspects. Most mortals were asleep by midnight, so if Sam and Rafael didn’t hit the street early in the evening, they usually ended up rousing someone from their bed.</p><p>Eduardo and Carmen Figueroa were not sleeping at all, from the look of their strained, shadowed faces. They invited the detectives into their modest North Miami Beach home and then sat, silent and still, as Rafael questioned them about their missing daughter.</p> <p>“I don’t want her to live apart from us,” Eduardo said. “She is too young, I tell her. She should be married first. But does she listen? No. And now this.” He stood and abruptly left the room.</p><p>Carmen watched him go before she turned to Rafael. “Please, Detective, excuse my husband.” She took a crumpled Kleenex from her pocket and wiped her eyes. “He drives the streets all night, looking for our Luce. He blames himself.”</p><p>“Did your daughter have a new boyfriend, Mrs. Figueroa?” Sam asked. Knowing how mothers felt about their young daughters, she chose her next words carefully. “Someone she might be spending some time with, or who might taken her somewhere out of the area for the holidays, maybe on a trip to Disney World?”</p><p>“No.” Carmen lowered her voice. “She never went steady with any boy.” She stared at the brightly-wrapped presents under the artificial Christmas tree set up in one corner. “She was a butterfly, my Luce.”</p><p>“Can you give us the name of the boy she was dating just before she disappeared?” Rafael asked.</p><p>“I don’t think so.” The woman shifted on the sofa and wouldn’t meet his gaze. “I can’t remember.”</p> <p>Sam recognized the woman’s evasiveness as being motivated by shame; she wasn’t telling them everything because she already knew something was wrong with her daughter. “Adam, could you ask Mr. Figueroa if he’d show you Luce’s room?”</p><p>Rafael nodded and left them alone.</p><p>Sam moved to sit beside the other woman. She didn’t like using her body’s scent, known as l’attrait among the Darkyn, to compel mortals to tell the truth, but she had to know what the woman was so determined to hide. “Did your daughter have a problem with boys, Mrs. Figueroa?”</p><p>Carmen pressed a hand over her mouth, as if to stop herself from saying anything. Then Sam’s subtle, dark scent surrounded her, and she let her arm drop.</p><p>“She dated so many,” she said, her pupils dilating. “A new boy every night. I told her she would ruin her name if she kept doing it. That no decent boy would want her.” She made a languid gesture. “She only laughed at me. She said she had to have it from different boys all the time.” Her expression became blindly radiant as she leaned closer to Sam. “You smell so nice, Detective. Like walking through the mountains at night.”</p><p>She was becoming too drugged by the scent, Sam realized, and moved away from the woman, taking a seat across from her. “She was having sex with all these boys?”</p><p>Carmen nodded slowly. “I heard her talking on the phone to her friend. She would go out to these bars to find them. I caught her once here with a boy, in our house, and I told her never again. Never again. She didn’t stop. I think she did it in their cars, or at their houses.” Her voice grew wearier as the effects of l’attrait began to wear off. “She would even steal boys from her friends at school.”</p><p>During her high school years, Sam had known a few girls who had been such self-absorbed narcissists that they would steal other girl’s steadies just to prove they could. “You’re certain that she wasn’t simply dating the boys?” Sam asked.</p> <p>“They were not just dates,” Carmen said. “She went with them only to have sex with them. With all of them. Her best friend told me that she was addicted – like it was some sort of drug to her.” She frowned. “I didn’t want to say that.”</p><p>“You’re telling the truth because you love your daughter.” Sam took out her PDA. “What bars did Luce go to find these boys?”</p><p>“She liked Fort Lauderdale beach,” Carmen said. “She always went there, her friend told me. She even picked her apartment because it was close.” She gazed at Sam, and the drowsiness vanished from her expression as her terror conquered l’attrait. “You think she got in trouble with one of these boys? That he might have taken her away to hurt her?”</p><p>“All we know is that your daughter is missing, Mrs. Figueroa,” Sam said. “We have no evidence that anything has happened to her. We may find out that she’s simply stayed with someone for a few days.”</p><p>“She wouldn’t,” Carmen insisted. “She never did.” She flushed miserably, and then her eyes widened. “Wait. Luce told me once that she would be okay because she always took her car wherever she went. She said it was so she could leave when she wanted if she was having a bad time.” She grabbed Sam’s hand. “Please find our Luce, Detective. I know she has done some bad things, but she’s still my baby girl.”</p><p>Chapter Two</p><p>“Young man.” A frail hand rested over his. “It’s time to wake up.”</p><p>Jamys Durand opened his eyes to the sight of a wrinkled, gentle face surrounded by a halo of bright white curly hair. For a moment he thought her a tired angel, until he recognized her as the elderly mortal female who had sat beside him during the journey.</p><p>“I didn’t want to bother you, dear,” she said, patting his hand, “but we’ve arrived at the station.”</p><p>He removed his sunglasses and checked the window. Outside the train, a crowd of people stood waiting on the platform.</p><p>“You slept the whole trip,” she said, smiling as she tucked the child’s garment she was knitting into her tote bag. She turned a yawn into a sigh of relief. “I love visiting the grandkids, but I’ll be glad to get home to my own bed.”</p><p>Jamys nodded and collected his own bag, standing and offering a hand to the old lady when she had some trouble rising to her feet.</p><p>“Do you have family meeting you?” she asked as they moved out into the center aisle.</p><p>Jamys nodded again.</p><p>“You don’t like to talk too much, do you?” Rather than taking offense, she chuckled. “My oldest son-in-law, Thomas, is the same way. Of course my Margie talks enough for three people. Even if he wanted to, around her he couldn’t get a word in edgewise.”</p><p>The woman continued chatting about her family as they stepped down from the train, until a bald elderly man came and took her in his arms. She forgot all about Jamys as she kissed and hugged him.</p><p>Jamys slipped around them and scanned the platform. He didn’t pick up the scent of other Kyn, but spotted a very young woman dressed in a black suit moving toward him. A white-fur-trimmed, peaked red velvet hat covered the top of her short hair, which had been dyed an unlikely shade of scarlet to match the hat and her smartly tailored blouse. On her lapel she wore a small black cameo brooch with an elegant ivory carving of an arrogant-looking man.</p><p>The colors and the cameo she wore indicated that she served Suzerain Lucan, the immortal Kyn lord ruling the southernmost American territory. Also Jamys’s host for the duration of his stay.</p><p>For a moment he was tempted to disappear into the crowd. Before Suzerain Lucan had come to America, he had been the deadliest of the assassins who had served the high lord of the Darkyn. Alexandra had assured him that Lucan no longer killed for anyone, even Richard Tremayne, but Jamys wasn’t entirely convinced. It seemed unlikely that a Kyn male who had spent centuries hunting and executing the Kyn’s enemies would even wish to stop.</p><p>“Mr. Durand?” she asked. When he inclined his head, a swift, fetching smile flashed across her narrow features. “Merry Christmas, and welcome to South Florida. I’m your ride. I mean” –she gestured toward the parking lot beyond the platform– “ the car is this way, my lord.”</p><p>His young driver attended to him with swift courtesy, opening the rear passenger door and offering him bloodwine before she drove him from the train station. She also seemed to know about his silence, for she didn’t ask him questions that required more than a yes or no answer. But she did talk, like the elderly woman, quite a great deal.</p><p>“Everyone is really nervous about you coming down here,” she said as she skillfully maneuvered the limo into the busy traffic downtown. “I haven’t been doing this tresora thing for very long – Lucan’s guy, Herb, is teaching me – but I’ve never seen the other guys so jumpy.”</p><p>Jamys could well imagine how the jardin felt about Thierry Durand’s son coming into their territory. The last news anyone here had likely heard about his father was that he had gone mad. Then there was Thierry’s reputation as a Kyn warrior. During the last years of the Crusades, Jamys knew his father had done terrible things in order to protect the Templars retreating from their enemies. No one remembered the centuries Thierry spent afterward, helping to build Kyn strongholds in France. All they cared to recall were the countless heathens the senior Durand had slaughtered.</p><p>Jamys knew his father’s true nature was gentle and kind, and that the terrible things he had been forced to do in his human and his Kyn lives had hurt him far more than the torture he had endured. He’d only gone mad when Jamys’s mother, Angelica, made him believe the Brethren had killed her. She had gone so far as to have Jamys made a mute to keep him from revealing the truth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Retreating into himself had kept Jamys from facing what his mother had done, and his father had nearly paid for his silence with his sanity and his life. Once Thierry had been brought out of madness through the love of his sygkenis, Jema, he had</p><p>forgiven Jamys.</p><p>Now if only I could forgive myself, Jamys thought.</p> <p>“My name’s Christian, but everyone who doesn’t hate me calls me Chris.” The girl spoke to the rearview mirror, but the sound of her voice effectively brought him out of his dismal thoughts.. “You’re not what I expected at all. I mean, I know you’re like a million years old, but you look the same age as me. You won’t tell on me if I forget to call you my lord, will you?”</p><p>Amused now, Jamys shook his head.</p><p>“Excellent. Not that I plan to forget or anything, my lord, but, well.” She laughed at herself. “I guess I’m kinda nervous, too.”</p><p>Jamys would have used his talent to reassure her, but while he could communicate his thoughts to any mortal he touched, it usually resulted in them falling unconscious – something he didn’t want the young one to do while she was driving.</p><p>Jamys looked out at the walkway paralleling the road, and saw a steady stream of mortals strolling under the bright lights of the restaurants and clubs. As Chris stopped at a traffic light, one young couple caught his eye. The handsome young male had an odd-looking helmet of light brown hair and an outdated rust-colored suit that contrasted sharply with the shaved skulls and casual wear of the other males around him. His companion, a stunning golden-skinned gazelle of a girl who had painted her full lips bright red to match her sparkling mini-dress, also looked distinctly out of place. Both moved in a decisive manner, forcing the other humans walking toward them to move out of their way. Then the young female turned her head and fixed her gaze on Jamys’s face. She stopped walking, and oddly her companion did the same in perfect unison.</p> <p>Her lips moved as she spoke to him, but the noise of the traffic made it impossible to hear the words. Caught up in the sadness of her eyes, Jamys felt a surge of blood hunger.</p><p>The young female stepped off the curb and walked toward Jamys, until the front of a taxi came to a screeching halt only a few inches from her hip. She turned to regard the driver, who stuck his head out of the window and shouted his poor opinion of her gender and her intelligence.</p><p>That effectively broke the spell over Jamys, who released the handle and sat back, bewildered by his own reaction. Something about the girl had stirred him to hunger and pity. As if he wanted to feed on her and comfort her at the same time. Chris drove on, and gradually the ravenous feeling subsided.</p><p>Jamys began to glance back, but the effect the mortal had had upon him made him think better of it. He was alone in a small space with another mortal, and if the hunger truly came over him again he might make use of Chris. Among the Kyn, feeding on a mortal who belonged to suzerain without permission or the human’s consent was considered a serious personal insult.</p><p>Fortunately Chris seemed to be oblivious to what had just occurred. “Sam – Samantha, Lucan’s lady? – she’s putting in some overtime tonight, so she won’t be at the club when we get there. Even though she has the whole Kyn thing now like you guys, and more money than God, she still works as a cop.” She pushed some of the overlong wisps of scarlet hair back from her eyes. “She’s doing okay, though. I think the cop thing helps her handle all this, mostly because she isn’t using her powers for the dark side, you know?”</p><p>Guilt filled him as he thought of Alexandra Keller, another mortal female from this era that, like Samantha Brown, had been given no choice when she had been turned from human to Kyn. Alex now served the immortals as their first physician and surgeon, and she had spent nearly a week performing the special operations required to reconstruct Jamys’ mutilated mouth. He knew she had done her best for him; that had been another reason he had retreated into the self-imposed prison of silence. As much as he wanted to speak, he could not bear to disappoint her or his father again.</p> <p>“I think she’s glad to be alive. She really loves Luc.” She caught his expression in the mirror. “Lord Lucan. Sorry. I gotta stop doing that. For a while there I was calling him Skywalker, you know, just to make Sam laugh? Then he heard me one night, and I had to explain, and then he borrowed all my Star Wars DVDs so he could see who Luke Skywalker was.” She rolled her eyes. “Then he said if I was going to make fun of him, he wanted to be called Lord Vader. You should hear him do the breathing sounds. He cracks me up.”</p><p>Jamys tried to imagine the deadliest Kyn ever to walk the night jesting with this young mortal. Obviously Lucan had changed, perhaps for the better, as Alexandra had insisted.</p><p>“Anyway,” Chris continued, “we’re almost there.” She turned onto the coastal road that paralleled the seashore, and drove south through a snarl of cars and wandering pedestrians. “Listen, if you ever need to get away from the whole jardin thing while you’re here, just ask for me. Lord Vader lets me drive this monster whenever I want, and I have a gas card and a VISA with no credit limit, so I can take you to do whatever you like.” She pulled into a private parking spot in front of a nightclub, the doors of which were guarded by two large, dark Kyn warriors. “Just keep it in mind, okay?”</p><p>Chris didn’t wait for an answer, but got out of the car and came to open his door for him. Jamys took her hand as he climbed out and held it for a moment.</p><p>Thank you, Chris.</p><p>She grinned up at him, her eyes bright. “You’re welcome, my lord.” # As they left the Figueroa residence, Sam’s mobile rang. She switched it to speaker before she answered with, “Brown.”</p><p>“Sam.” The voice belonged to her supervisor, Captain Ernesto Garcia. “I need you and Rafael to head downtown.” He gave her an address of a popular bistro. “Tenderson will meet you there.”</p><p>A murder at a beach café at the busiest time of night guaranteed the next eight hours would be nonstop hell. “What happened?”</p> <p>“It’s not clear yet,” Garcia said. “A couple of college kids found the remains of a young adult male in a men’s room stall. From the condition of the body, it may have been stolen from a grave.”</p><p>“Did the kids see who dumped the body in there?”</p><p>“No,” Garcia said. “They both say the same crazy thing. They swear they saw the corpse walk into the restroom ahead of them.”</p><p>Rafael drove as Samantha went over the sketchy report made to Garcia, and by the time she finished the call they had arrived at the bistro. After wading through a throng of onlookers trying to see what was going on inside the club, Sam spotted two FLPD bike patrolmen taking names and contact numbers from the small crowd of patrons who had been herded away from the restrooms and headed their way.</p><p>“Hey, Andy. Josh.” Sam waved them over. “Can you give me what you have so far?”</p><p>“We got the call an hour ago. Those two” – Andy nodded at a pair of stiff, silent young men sitting at the bar – “discovered the body and called in the manager. Lucky for us he had the sense to lock up the john and keep everyone out of there.”</p><p>“Guy’s been dead for a while,” Josh added, “but the patrons who saw him insist that he walked in here alone.”</p><p>“Maybe he did.”</p><p>“Not this time, Sam.” Andy gave her a strange look. “You’d better go look at the body.”</p><p>Sam verified that the assistant medical examiner was en route before she went back to the restroom and ducked under the band of yellow tape stretched across the open door way. The smell of decomposition that hung over the thin, still form on the floor was so strong that after her first breath she had to blink a few times to clear her eyes. Fortunately she didn’t have to breathe now that she was Kyn, or she suspected she would have puked on the spot.</p><p>The corpse lay on his back, his body dressed in a strange-looking two piece rust orange suit with contrasting white stitching around the cuffs and wide lapels. The victim’s face appeared to be made of shriveled, gray wax, with the lips drawn back from two rows of yellowed teeth and the clouded eyeballs sunk deep in their sockets. Both hands were contracted into curled claws, and the shoes had fallen off the man’s bony feet.</p><p>Whoever he was, he had died long before his body had been placed here.</p><p>Sam crouched down to look at the visible wounds. His throat had been cut sometime in the distant past, judging by the appearance of the neck wound, as had the inside of both wrists. There was not a speck of blood on the body, the clothes he wore or the floor of the men’s room.</p><p>Before Lucan had changed Samantha from human to Darkyn, she had been able to touch the blood of a murder victim and see in her mind the last minutes of their life. Being made a blood-dependent immortal hadn’t changed her ability, but had rather enhanced it. She had become acutely sensitive to the presence of blood, even in the tiniest amounts.</p><p>Her talent told her the dead man did not have a single drop left in his collapsed veins.</p><p>Her partner came into the restroom and closed the door. “The assistant medical examiner will be here in a few minutes, my lady.” He pulled on a pair of latex gloves as he came to stand on the other side of the body. “I have not seen a suit like this in thirty years.”</p><p>“No one’s worn them since the seventies.” Sam leaned in close to examine the jagged edges of the laceration on the victim’s neck. “At least we know how he died, whenever that was.” There should have been blood all over the victim’s clothing, but the old suit was spotless. “They must have redressed the body.”</p><p>Rafael turned his head and walked over to the trash can by the sinks. He moved it aside and picked up a knife. “Perhaps not.” He handed it to her.</p><p>She examined the blade, which had a black plastic handle and an oddly familiar grip. No blood stained the steel, but bits of gray flesh clung to the serrated edge. “Why cut the throat of a corpse? And why dump him here, in such a public place?”</p><p>“A ritual. Perhaps a warning to the owners.” Rafael methodically searched through the suit until he extracted an old, battered leather wallet and opened it. “He has a Virginia driver’s license. It expired in nineteen seventy-four. His name is Wilson Robert Carcher.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She bagged the knife and considered the victim’s perfectly-trimmed bowl-like hair style, which resembled what the Beatles had worn when they had first invaded America. “What’s his date of birth?”</p><p>“December third, nineteen fifty-two.”</p><p>“He’s certainly not fifty-six.” She studied the waxen features. “He had to have died young.” As she said that, the door to the restroom swung open.</p> <p>“Why don’t you open his mouth and check his teeth?” a snide voice asked.</p><p>Sam looked up at Evan Tenderson, who looked as if he’d slept in his clothes, smelled like a breath mint, and sounded like a cow chewing it’s cud. The assistant medical examiner had given up cigarettes over the summer and now compulsively masticated nicotine gum. “He’s not a horse.”</p><p>“Watch and learn, Detective Brown.” He pried open the victim’s mouth and aimed a penlight inside. “See those lumps in the back of his jaw. Those are his wisdom teeth, and they weren’t removed, and they haven’t erupted. That puts his age range roughly somewhere between sixteen and twenty at TOD.” He picked up the right hand and straightened the fingers before he removed a ring. “He was a high school grad – class of seventy.”</p><p>Sam offered him an evidence bag. “So he might have been eighteen when he died.”</p><p>“That’d be the safe money.” Tenderson continued examining the body before he stood. “I’d like to know what the hell he was kept in all this time.”</p> <p>“You don’t think he was buried?”</p><p>“Aside from the obvious Ode de Necrophilia, I don’t see any incisions indicating that he was embalmed,” he told her. “Without proper chemical treatment, bacteria would have eaten him up back when Nixon was President.”</p><p>“He might have been frozen,” Rafael said.</p><p>“If they put him on ice in the seventies, by now the tissues would show signs of freezer burn.” Tenderson stood. “I’ll know more once I finish the autopsy.”</p><p>“Fax a copy of the driver’s license up to Virginia,” she told him. “See if they have any for us on him.”</p><p>Samantha left the restroom and went over to the pair of college boys who had found the body. Both were staring the direction of the crime scene with haunted eyes.</p> <p>“I’m Detective Brown,” Sam said as she sat down with them and took out her PDA. “I know you’ve already told the officers what happened, but I’d like to ask you some questions, if that’s okay?”</p><p>The boys exchanged a look before they nodded.</p><p>“What brought you here tonight?” she asked.</p><p>“We always eat before we go to down to the clubs,” the younger one said. “At the pizza place, usually, but it was packed and we didn’t feel like waiting. We figured we’d come in here and grab a burger.”</p><p>Sam jotted down some notes. “Did you tell anyone you were coming here?”</p><p>“No. And we didn’t have anything to drink,” the older boy said, “and we’re not high.”</p><p>“She isn’t going to believe us, either, Mark.” The younger one regarded Sam. “We saw the guy come around the corner from the public parking lot on third street. He was maybe half a block ahead of us when he came in here. But he was alive, lady.”</p><p>Sam began to wonder if the whole thing might be some sort of ghastly practical joke. “Why do you believe that that the body you found in the restroom was the man you saw walk into the restaurant?”</p> <p>“He was the only one wearing that weird retro suit and the helmet hair,” Mark said. “I even said to Leo, that guy must think he’s Austin Powers or something. But he didn’t look dead, the guy we saw come in. He was pale, but he wasn’t . . .” he glanced at the men’s room. “Like that.”</p><p>Sam doubted the body or the man the boys had seen could have fit through the restroom window. “Did you see anyone else or look in any of the stalls in the men’s before you came out to get the manager?”</p><p>“I don’t know.” Leo frowned. “I don’t think anyone else was there. The smell was so bad, we got out pretty fast. I think maybe all the doors to the stalls were hanging open.”</p><p>“You think the guy we saw pulled some kind of switch?” Mark demanded. “Like to freak us out?”</p><p>“We’re not sure what happened. Are either of you in any trouble? Have a fight with a friend, anything like that?” When the boy both shook their heads, Sam leaned closer and shed some of her scent. “What aren’t you telling me?”</p><p>Mark’s expression turned somewhat dazed. “I wish I could ask you for your number. You’re really pretty for a cop.”</p><p>Leo shifted closer. “I thought I smelled something right before I went in the john.”</p><p>“What did you smell?”</p><p>“Something hot and sweet. It reminded me of the circus.” He swallowed. “It made me feel strange. Like I needed to eat.”</p><p>“The chef was making spun sugar in the kitchen for one of the desserts,” Rafael said as he joined Sam. “The kitchen is on the other side of the restrooms. If anyone else asks what you smelled, that is what you will say.”</p><p>Leo’s tense expression relaxed. “Sugar. Desserts. Kitchen.”</p><p>“Excuse us, guys.” Sam took her partner’s arm and led him out of earshot. “What are you doing?”</p><p>He shrugged. “The young one may mention the scent to another mortal. He needed a reasonable explanation for it.”</p><p>“So instead of finding out what the source was, you planted a phony suggestion in his mind?”</p><p>“I already know the source of the smell,” Rafael said, startling her. “What he describes is the scent of a Kyn lord hunting. Someone unknown to us has come into our territory.”</p><p>“Someone who hunts thirty-year-old corpses? He must be pretty hard up for blood.” She rubbed her eyes. “Look, I don’t want to stomp on your new theory, Rafe, but not everything is about the Darkyn.”</p><p>“This is.”</p><p>“Then why didn’t we pick up the scent?” she demanded. “I can smell Kyn a mile away, and so can you. There should have been some trace left on the corpse.”</p><p>“I agree, but that is not all. I took this off the body before the medical examiner could retrieve it.” He handed her an old passport. “According to the stamps, the victim left America to travel to Europe in nineteen seventy.”</p><p>“So Wilson took a trip after graduation.” Sam felt impatient. “A lot of kids do. That doesn’t prove—”</p><p>“The stamps indicate that Wilson has been traveling all over eastern Europe for the last thirty-eight years.” He opened the passport to the last page. “And that he returned to the states a week ago.”</p><p>“He’s not Kyn.” She stared at the restroom. “Is he?”</p><p>“I think he was hunted by Kyn, who left him in that condition.” He took her arm</p><p>and started guiding her to the door. “We can’t go now,” she argued. “I have to finishing interviewing the witnesses.”</p><p>“A Kyn male did enter our territory shortly before the body was discovered here,”</p><p>he told her. “One whose talent affects the minds of mortals.”</p><p>“Jamys Durand.” She gave him a stricken look. “Burke sent Chris to pick him up at the station.”</p><p>Chapter Three</p><p>Lucan watched seven different angles showing Jamys Durand standing outside the club. The wall of security monitors in his office provided him with a clear view of every area surrounding his unorthodox stronghold as well as every inch of the interior. Behind the wall, recording devices soundlessly archived all of the images, which were also monitored by two of Lucan’s guards three floors above him.</p><p>After seven hundred years and countless confrontations with hostile Kyn, murderous Brethren and even a few overly-ambitious mortals, Lucan had learned that there was no such thing as being too prepared.</p><p>He expected no trouble from Thierry Durand’s son, however. The last time he had seen the boy, he had been hanging from a pair of meat hooks in a Brethren torture chamber. Lucan remembered the blank indifference in the boy’s eyes when he had freed him; a stark contrast to the raging madness of his tortured, mutilated sire.</p><p>“My lord,” Burke said over the intercom. “Our guest has arrived. Should I have the men assemble in the club or the formal reception rooms?”</p><p>“Neither, Herbert.” He switched off the monitors. “I will meet him alone.”</p><p>“I will not remind you that such a informal meeting is not according to established protocols, my lord,” his human servant murmured, “as you said the next time I nagged you about such things that you would carve out my liver with a dull spoon.”</p><p>“Your wisdom increases by the hour.” Lucan rose, and then hesitated. Before he had become suzerain, he had never bothered with being politic. No one had cared how politely he had killed them. Now as a ruling lord, he had to consider almost every word before it left his lips. “As he cannot or will not speak, doubtless young Durand will wish to avoid situations that would require a great deal of talk. I imagine that the men could be discreetly advised of this.”</p><p>“I will see to it personally, my lord,” his tresora assured him.</p><p>Lucan pulled on a pair of gloves before he walked out of the office and into the empty club. Samantha’s young tresora in training, Chris, entered with Jamys at her side. As they came in, the faint scent of sandalwood colored the air.</p><p>Chris gave him one of her cheeky grins before she remembered to bow. “Suzerain Lucan,” she said, “May I present Lord Jamys Durand?”</p><p>“Welcome to South Florida.” Lucan deliberately offered his gloved right hand, which the boy took without hesitation. “I trust your trip was without incident?”</p><p>Jamys inclined his head as he returned Lucan’s polite grip. He then rested his left hand on the young mortal’s shoulder. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“He says it was fine, and he slept most of the way,” Chris said. “He’s also grateful for your hospitality, hopes not to be any trouble, etc. etc.”</p><p>Lucan glanced at the girl. “Indeed.”</p><p>“It’s the same boring stuff they always say,” she told him. “Why can’t you guys just settle for ‘Hi, how are you?’”</p> <p>“Seven centuries of inviolate tradition and custom cannot be distilled down into four words.” He smiled a little. “There should be at least five, perhaps six.”</p><p>Jamys shifted his hand on Chris’s shoulder and studied her face.</p><p>“I keep telling you, I’m fine.” She turned to Lucan. “He thinks if he uses me as a psychic interpreter for too long that I’m going to pass out. I never . . .” She swallowed and swayed. “Okay, maybe that’s a good call.”</p><p>Jamys guided her over to a chair and helped her to sit down before he took out a notepad and pen, wrote something on it and handed it to Lucan.</p><p>I am sorry. My talent does this to mortals. I cannot speak through them for very long.</p> <p>“You cannot communicate through talent with Kyn?” When Jamys nodded, Lucan thought for a moment. “Other than a few inappropriate gestures, none of us know sign language.”</p><p>“I think I can make myself understood,” a cool voice said from behind Jamys.</p><p>Lucan regarded his sygkenis, who had her hand resting on the grip of her weapon. She appeared ready to employ it. “Samantha. I expected you an hour ago. This overtime is becoming an annoyance.”</p><p>She ignored him as she moved between Jamys and Chris. “Are you all right?” she asked the girl.</p><p>“I’m fine.” Chris stood. “You look pissed off, though.”</p><p>“We just recovered a body three blocks from here. Young guy in an old leisure suit. Some Kyn we don’t know was involved. And guess what, there’s only one Kyn we don’t know in our territory right now.” Sam shifted around until she blocked Lucan with her body. “Rafael?”</p> <p>Lucan saw his seneschal, armed with a copper-edged sword, step up behind Jamys. His temper flared, causing several bottles of liquor behind the bar to shatter and spill “Have I perhaps been replaced as ruling lord and everyone has forgotten to tell me?”</p><p>Rafael breathed in and then lowered the blade. “His scent is not what the mortal described to us, my lady.”</p><p>Sam didn’t move. “Maybe he did some suggestion-planting before he left the bistro. Chris, get away from him,” she added as the girl went to Jamys.</p><p>“He can’t talk unless I help him.” She gripped his hand and looked up at his face. “No, it’s okay. I can do it.” She turned to Samantha, and her eyes took on a curiously bright sheen as her voice dropped to a deeper register. “I have not harmed anyone, my lady. I was with Christian from the time I left the train to when I arrived here. I would not insult the suzerain by attacking anyone in his territory.” She blinked, and in a more normal voice said, “He’s telling the truth, Sam. I was with him the whole time.”</p><p>“That’s only what you remember.” She flinched as Lucan took the weapon from her holster. “What are you doing?”</p><p>“Hopefully I am avoiding a grievous insult to the Durand family, and the son of the most efficient killer I know besides myself.” Lucan pocketed the weapon. “Now, shall we sort this out like civilized folk?”</p><p>“I have a backup piece,” she reminded him before she stared at Jamys. “You should know that I keep my weapons loaded with copper rounds. I don’t care who your Daddy is, you try anything – anything at all – and I’ll blow your head off.”</p><p>The young Kyn male, who had not moved since the beginning of the confrontation, nodded slowly.</p> <p>Despite the danger she had just put them all in, Lucan felt almost proud of her. His woman might not be the soul of diplomacy, but she would kill to protect what was theirs, and damn the consequences. Not even Cyprien could boast of such a life companion. “Now that you have finished with the death threats, sweetheart, come and sit down and tell me about this killing.”</p><p>In terse fashion, Samantha related the tale of the body she and his seneschal had found in a nearby restaurant, and the statements made by the witnesses.</p><p>“Kyn do not feed on the dead.,” he pointed out. “Nor do they drag them about Europe for three decades.”</p><p>“Two years ago I chopped the tail off a Kyn who had spent a couple of centuries feeding on snake blood.” Samantha eyed him. “Maybe this one uses the dead for dinner.”</p><p>“How may I explain this to you?” Lucan thought for a moment. “When you were mortal, would you have eaten a maggot-ridden piece of rotting meat? No? That is what feeding on the blood of the dead is like for us.”</p><p>Jamys took out his notepad and pen and wrote something quickly. He handed it to Rafael, who read it and shook his head.</p><p>Samantha frowned. “Mind sharing that with the rest of group?”</p><p>“He writes that the victim may have been taken from his grave to be used by a Kyn lord,” Rafael said. “It is nothing but an old superstition among our kind.”</p><p>“You think the boy we found was raised from the dead?” When Jamys shrugged, Samantha turned to Lucan. “Just when were you going to mention that you guys can make zombies?”</p><p>“Never, as we cannot. We have our own ridiculous folk lore, my darling, just as humans do.” Lucan felt impatient now. “There has to be another explanation. I have roamed every continent not covered by ice on this earth, and never once have I seen a mortal brought back to life as a revenant.”</p><p>“Have you?” she asked Jamys, who reluctantly shook his head. “Good, because I’m not putting zombie on my report.”</p><p>“He didn’t hurt anyone,” Chris said, her tone sharp. “Burke tested me before I signed on for this gig. You know I’m resistant to l’attrait.”</p><p>“But not to talent.” Samantha stood and addressed Jamys. “I know you’re here as a guest, and I’m sorry you can’t talk. I know I’ve probably embarrassed the hell out of Lucan by questioning you. But my job is to find out who killed this boy. If it was you, or you were in any way involved, you and I are going to have a serious problem.”</p><p>Jamys took out two copper daggers and placed them on the table before he rose, bowed, and walked out of the club.</p><p>“What does that mean?” she asked Lucan.</p><p>“He is not insulted.” He picked up the blades. “He disarmed.” He looked at his sygkenis. “It means he agrees with what you’ve said.”</p><p>“Then why did he leave?”</p><p>“That you will have to ask him,” he advised her. “If he returns.”</p><p>After sending Chris home, Sam went up alone to the penthouse suite she shared with Lucan. The smell from Wilson Carcher’s body still clung to her; she needed a shower and a fresh change of clothes. After that she planned to head down to the morgue to see what Tenderson had found during the autopsy, and what she would probably have to compel him to forget. If she were quick, she might even avoid the reckless idiot she loved.</p><p>She didn’t make it out of the shower.</p><p>“As erotic as I find your working garments,” a silky voice said as a large shadow appeared on the other side of the frosted glass door, “I prefer to sleep with you in your skin.”</p><p>She shut off the water. “I have to go back into work for a couple hours,” she told him as she wrung out the long, dripping tail of her hair. I’ll be sure to strip when I come home.” She watched as a thin crack ran diagonally from the top of the shower door to the bottom. “Or not.”</p><p>“You,” he said pleasantly, “are not leaving. Come out of there.”</p><p>Sam emerged to find her lover standing and holding a large black bath towel. The delicious scent of jasmine curled around her, which dispelled most of her remnant anger. “I suppose you want me to apologize.”</p><p>“Not at all.” He began drying her off as impersonally as a valet. “I’ve been despised among the Kyn for several lifetimes. Another century or two of hostility will not make much difference.” He draped the towel over her head and began to massage it against her damp hair. “And I am sure the men will understand why my lady is acting in my place when it comes to territorial matters. Perhaps you can persuade them to name you suzeraina, as they did with Jayr of the Realm.”</p><p>“Okay, I get it. I was out of line.” She glanced up at his beautiful face, but his expression remained impassive. “Go ahead, yell.”</p><p>“Why would I shout at my life companion, the woman I love above all others, whose love for and loyalty to me is as constant and unwavering as the sunrise?” His eyes glittered. “When she is not threatening to blow the head off the beloved, only son of a Kyn lord who single-handedly slew five hundred mortals, of course.”</p><p>She swallowed. “That many?”</p><p>“That many.” He kissed her brow. “On one of his bad days.”</p><p>“I’ll go after the kid and explain and apologize.” Sam reached for her clothes.</p><p>“Rafael is already tracking him, and I think you have said enough for one evening.” He swept her up in his arms and carried her out into their bedroom, where he sat down in his favorite oversize armchair with her. “Be still,” he told her when she tried to get up. “I am still deciding whether or not to beat you.”</p><p>Sam hid a smile. Lucan might be one of the most powerful Kyn in existence, with a talent that could cause a living being to literally explode, but he’d never hurt her. “Let me suggest some reasonable alternatives. You could give me a time out. Make me stand in the corner. Or have me write ‘I will obey my lord and master without question’ a couple hundred times.”</p><p>“You are not a child, Samantha.” He looked down his nose at her. “Although I confess, the thought of giving you a good, hard spanking appeals to me.”</p><p>She angled her head to put her mouth a breath away from his. “Is that really the only good, hard thing you want to give me?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He shifted under her, and then glancing down as she unfastened the front of his trousers. “You have another reasonable alternative to propose?”</p><p>She slid down from his lap, kneeling in front of him as she freed and cradled his shaft between her hands. Delicately she laved the smooth, engorged head of his penis before parting her lips to take it in to suckle.</p><p>Velvet brushed against her scalp as he worked his gloved hand through the hair at the back of her head.</p> <p>“I understand now.” He muffled a groan as she tugged rhythmically at him. “You mean to punish me.”</p><p>Samantha felt her dents acérées push out of her palette, and gently scored him with the sharp tips as she drew her head back. He’d taught her the trick of how to do it without drawing blood, although in that moment she wanted nothing more than to bury her fangs in his flesh. She felt the same urge whenever they argued, although she didn’t want to do it to hurt him. Somehow it was mixed up with her endless desire for his body as well as her longing for his love, a dual craving as constant as her need for blood as nourishment.</p><p>As always, Lucan seemed to read her thoughts, and dragged her up to his chest. This time, however, he didn’t comfort her, or assure her that the sex was enough.</p><p>“Again.” He shook back his long fair hair to expose his throat. “Here.”</p><p>Samantha pressed her forehead against his neck, struggling against the instinct. Knowing he offered his blood made the temptation to take it a thousand times worse. “I can’t.”</p> <p>“It is what we both want, my lady,” he murmured, kissing the curve of her shoulder as he spread her thighs and settled her against him. “It is what we are.”</p><p>She could feel the blood beneath his skin, driven by the slow, heavy beat of his heart. Her throat tightened and her mouth ached, and then she couldn’t think anymore. As he pushed his cock into her body, she set her open mouth against him and drove her teeth deep.</p><p>As she drank from him, she felt his velvet glove spread over her spine, his fingers flexing like the claws of a cat. He didn’t move inside her or permit her to move, but held her sheathed as he swelled and pulsed deep within. When she tore her mouth away he brought her face to his and took her lips, adding the heat of his kiss to the lingering dark wine of his blood.</p><p>When Sam drew back she saw the depth of need in his. “Is this my punishment?”</p><p>He slid his big hands down to grasp her hips. “If it is, you must never obey me again.”</p><p>He stood, holding her welded against him as he carried her to their bed. There he dropped down atop her and worked himself into her with hard, powerful strokes. Sam had already come but he brought her over again, and then a third time as he used his teeth on her breasts.</p> <p>When she felt him slow and tense, she wrapped her arms and legs around him, using her inner muscles to clamp down and milk his cock until he pumped his cool, thick semen into her womb.</p><p>He collapsed on her for a moment before he rolled them to their sides. Sam combed the bright, soft hair back from his hard cheek and watched his pupils expand from thin slivers of hunger to the full roundness of satisfaction.</p><p>“I love this,” she whispered, tracing his lower lip with a fingertip. “And I want this, all the time, so badly I can’t begin to describe it. But in my heart, it’s not about the blood or the amazing sex or anything about being Kyn.”</p><p>His eyes moved over her face. “Then what is in your heart, Samantha?”</p><p>“You.” She rested her hand over his heart. “I love you, Lucan. That’s why I forgot all the stupid fucking rules tonight. I was scared, and then when I came in all I could see was him between you and me.”</p><p>“Jamys Durand did not come here to harm me or anyone,” he said, covering her fingers with his. “He is in trouble, but it has nothing to do with the dead mortal you found. I think Alexandra sent him to me because she believes I can help bring him back to himself.”</p><p>“Can you?”</p><p>“Nothing is certain,” he admitted. “I rescued him from the Brethren who rendered him mute, so the boy may feel some gratitude toward me. Then again, he was catatonic at the time.”</p> <p>“If Jamys isn’t involved with my victim, then there’s another strange Kyn in our territory,” she said. “One who could have done this to get to you. Who could be hunting you right now.”</p><p>“I’ve been hunted before, my love.” He pressed her closer. “Many times.”</p><p>“If anything were to happen to you . . . ” unable to complete the thought, she closed her eyes. “Don’t keep me out of this. Please.”</p><p>“We will find the Kyn who did this together,” he said against her hair. “I promise.”</p><p>Chapter Four</p><p>On the fourth floor of the Coral Palm Weekly Rentals building, an alarm clock went off. A thin hand knocked over a smeared bottle with an inch of cheap wine in the bottom as it groped for the off button, disturbing two cockroaches and an overflowing tin ashtray.</p><p>Once she’d shut off the goddamn noise, Alisa crawled out of the frayed, torn cocoon of bed sheets and tottered her way across the scuffed linoleum to the bathroom. There she reached under the sink for the bottle taped to the back of the pipe, and shook out the contents into her palm. Three white oval pills were all that tumbled out, even after she banged the empty bottle against the sink.</p><p>By her count, she should have had at least six left. Her fucking source had shorted her again.</p><p>She popped the last of her stash, bending over to get a mouthful of water from the tap to help them go down. Three were just enough to take the edge off and get her ass in gear. As she straightened, the bulb over the mirror illuminated the wide white and gray stripes on either side of the part in her hair. Four inches of her real hair color couldn’t have grown out since her last dye job; the stupid hairdresser must have used a temporary color last time instead of the permanent stuff. She didn’t have a wig, but after fumbling a bit she was able to hide the worst of it by drawing it back in a loose ponytail.</p><p>“Go see that bitch tomorrow,” she promised her reflection. “Make her do it again the right way.”</p><p>She peed before she searched through the clothes scattered around the floor for something she could wear for her nooner. She hated getting up this early, especially after working until sunup, but one of her regulars had called in and wanted her at his office downtown. He was only a half-mile from her source, the stingy cocksucker, who had put her on COD since September.</p><p>She could give up the Vicodin anytime; that wasn’t a problem. The synthetic shit was always easier to kick than real morphine. But Christmas was next week, and she’d promised herself a little wine-and-vike vacation for the holidays. As soon as January first rolled around, she’d wean herself off, go after some better trade and start saving for a new place. This rent-by-week dive had gotten old, fast.</p><p>The manager, a skinny redneck named George, snapped at her when she came downstairs. “Where’s my money, Red?”</p><p>Alisa kept walking, so of course he trotted after her so he could cut her off and get in her face. “I’m going to pick up my paycheck now,” she told him. “I’ll give you what I owe when I get back.”</p><p>He sneered. “Whores don’t get no paycheck.”</p><p>“Some guys want me for a party,” she lied. “That all right with you, or you want me to wave a magic wand and make the cash appear?”</p><p>“Don’t you get fresh-mouthed with me.” He shoved her back a step. “You owe me for three weeks. I want the money.”</p><p>“I’m sorry, okay?” She gave his raw-boned arm a half-hearted rub. “We can work it out, George, huh? Like always.”</p><p>“You can’t even suck dick worth a damn anymore,” he told her. “I want the money, tonight, or I’m tossing you and your shit out.”</p><p>He’d never turned her down before this. Alisa felt her throat tighten, but then remembered the young skank who’d just moved in with her kid last week. That made sense – he was probably getting it day and night off her. “Yeah, sure, whatever.”</p><p>If she’d had enough cash for a taxi she would have flagged one, but the downtown buses ran every half hour and that was all she could afford until her nooner settled the tab. It made her a few minutes late getting to his building, but it would do him good to wait. He always worked himself up while he did, and since she hadn’t done him in a month or two, he’d be primed.</p><p>Larry met her in the lobby as usual, but after staring at her for a minute he turned her around and walked her back out of the building.</p><p>“We going to a motel?” she asked him.</p><p>“You can’t come here looking like this,” he said, his jowls waggling.</p><p>“What’s wrong with how I look?” Her dress needed ironing, sure, and she’d forgotten to put on stockings, but he was acting like she was naked.</p><p>“Jesus Christ, Alisa. You look like a frigging skeleton.” He lifted her arm to show her where his fingers overlapped around her wrist. “When was the last time you ate something?”</p><p>She couldn’t remember, but that didn’t matter. “You know a lady can never be too rich or too thin.”</p><p>“You’re not a lady, and you smell like you haven’t had a shower in a week.” He stopped and took out his wallet. “Here.” He thrust a twenty in her hand. “Thanks for coming by.”</p><p>“Wait a minute.” She hurried after him. “Our arrangement is two hundred.”</p><p>He wouldn’t look at her. “That was when you were worth it. Maybe you should check into some rehab place. Get some intervention or whatever they call it.”</p><p>“I am not a junkie,” she screamed at him. When he didn’t answer her, she trotted after him. “Okay, okay, Lar, I’m sorry. I’ve had hard times lately, and I got up late this morning. I’ll go to the ladies and clean up.” He wouldn’t stop walking. “I’ll do whatever you want. You wanted to try anal with me on your secretary’s desk, didn’t you? We’ll do that.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>At the door he turned on her. “Don’t come around here again, or I’ll call the police on you.”</p><p>Alisa stood outside the glass doors and watched his fat ass twitch as he waddled away. She was tempted to go after him again – twenty bucks wouldn’t buy her shit, and he was married with a couple of kids – but there was no time for that. She could already feel the edge coming back, and if she didn’t turn over some fast cash, by tonight she’d have the sweats and the shakes.</p><p>She hadn’t turned tricks on the street since she was a kid, but it was a short walk down to the beach. Too damn early for serious trade, of course, but there were always tourists looking for a cheap fuck.</p> <p>Once she found a stretch of sidewalk not being worked by one of the regular street girls, she unbuttoned the front of her dress down to her sunken waist and slowed her pace to a seductive saunter. She’d always been good with the street trade, cheap pricks that they were. Guys who cruised the beach liked skinny redheads who could suck hard. Today they must have been down in Miami, she thought after an hour with no takers. The only drivers who braked gave her a look and then took off. After another wasted hour she moved further south, but soon discovered that this end of the beach was almost deserted.</p><p>Alisa sat down on the edge of a short driveway wall in front of an abandoned building and swiped her hand over her sweating face. All she needed was another fifty bucks. That would get her twenty Vikes, enough to take care of her for the night. She’d give George some jewelry to hold as security until she made enough to pay the rent. She was almost sure she still had that strand of real pearls one of her johns bought so she could shove it up his ass. All she needed was fifty. Two tricks, maybe three.</p><p>A young, dark-haired whore in a sparkling red cocktail dress came from behind Alisa and sat down beside her.</p><p>“I’m working this end of the strip, kid,” she told her, but the girl only looked at her with her big dark eyes. “Get lost.”</p><p>The girl reached out and brushed a trickle of sweat from Alisa’s cheek. Normally she would have knocked the kid on her ass for daring to touch her, but Alisa didn’t feel so good now.</p> <p>“I’m sick,” she complained as she turned her head away. “I need my pills but I don’t have enough money to pay for them.” She took out her cigarettes, lit two and passed one to the girl. “You got any cash? I’m good for it.”</p><p>The girl took a drag, released the smoke and smiled.</p><p>What do you want?</p><p>Alisa could have sworn she didn’t hear the girl speak, but the words echoed inside her head, bouncing back and forth like the throb of the vicious headache she’d gotten from all the walking.</p><p>“I want my pills.” She jumped as the girl took hold of her arm, but the cool hand felt good on her feverish skin. “I need money. You got any cash I can—“</p><p>What do you want? The voice asked again, and this time Alisa was looking straight at the girl, and saw that her lips didn’t move.</p> <p>Some animal instinct inside her told her to get up and run, but other feelings welled up and quickly smothered the panic.</p><p>“I want to forget,” she heard herself say. “The money. The booze and the drugs. All the things I’ve done for them. I can’t stand it anymore.”</p><p>The girl touched the side of her neck, running her fingers over the tiny twin scars there. At the same time, the voice in her head asked Do you remember who gave these to you?</p><p>“The best trick I ever had,” Alisa said, and sighed. “He had a thing for biting me. And he dumped me for a cop, if you can believe that.”</p><p>If you tell me what you know, I will give you what you want.</p><p>Alisa felt a confusing sense of relief. She didn’t mean pills, but that didn’t seem to matter anymore. “You want to know about Lucan?”</p><p>Yes. The girl leaned forward and gave her a soft, sweet kiss before taking her by the hand. Come inside and tell me everything.</p><p>During his human life, Jamys had taught to track and hunt game by his uncle, Gabriel Seran. Gabriel had taken him into the forests of Provence, and shown him how to use his senses and his intuition, and think like the creatures they pursued. In a few years Jamys had become so adept that he brought meat to his family’s table every time he returned from the hunt.</p> <p>“Honor the hunt and take down only what you need,” Gabriel had cautioned him. “To kill for pleasure wastes what God provides and defiles your talent.”</p><p>That talent had changed after he and Gabriel had risen to walk the night. While he and his uncle had been given other abilities, both of their senses had also been enhanced, become almost painfully acute. Whether God had cursed them, or they had been infected and altered by what Alexandra Keller called the Kyn pathogen, Jamys and his uncle remained two of the best hunters among their kind.</p><p>Tonight Jamys set out to find the nameless Kyn who had desecrated the helpless dead, and cast doubts over his own reasons for coming to Lucan’s territory – but first he had to deal with Lucan’s seneschal, Rafael, who had been tracking him since he’d left Infusion.</p><p>Kyn scent was nearly impossible to erase, but Jamys knew how the Kyn tracked each other, and began his ruse by doubling back over his own steps in order to confuse the direction of his path. After retracing his steps several times, he ducked into an alley that stank from mortals using it to relieve themselves, where he deliberately walked through the two standing puddles of urine. From there he jumped up onto a third-floor fire escape, where he opened the window and shed enough scent to make Rafael believe he had entered that room.</p><p>Again he leapt to a window ledge in the opposite building to do the same there, then to the fifth floor of the first, and continued to leap back and forth and mark each landing until he reached the roof, where the wind coming from the ocean blew steadily. He didn’t walk across the flat tarred roof panels, but jumped from the building’s edge to the top of a cooling tower, then from there to the roof of the next building.</p><p>It took jumps to and from six other buildings, but by the time he had finished he felt sure that the wind had scoured away most of the scent he had left behind in the air. By the time Rafael finished searching the rooms in the buildings where he had left his scent and moved onto the roof, Jamys felt sure even the slightest trace of his scent would be gone.</p><p>Once he climbed back down to the street, he hailed a cab and had the driver take him to the bistro where Samantha had found the dead mortal. He didn’t make the mistake of trying to enter the restaurant – leaving any scent trace there would only reinforce the lady’s belief in his involvement, but had the driver stop a block away. As soon as he paid and got out of the taxi, he realized two things: he couldn’t smell any trace of Kyn scent but what Samantha and Rafael had left behind, and this was the same spot where he had seen the beautiful female who had tried to approach him.</p><p>Jamys went to stand where the girl had, and crouched down beside the postal box she had touched. Many, faint mortal scents clung to the painted metal, but one stood out, strong and distinct, a mixture of a single female’s musk mingling with several males’ seed. There was also something else in the scent, something that he didn’t expect – the bitter, metallic aroma of very old blood.</p><p>Jamys breathed in to fix the complex scent in his head, and turned until he picked up the trace. It did not lead toward the restaurant; from here the girl had abruptly changed direction and walked south.</p><p>“You know if they find you down here,” a wry voice said, “they’re going to think you did it.”</p><p>Jamys turned to see Chris parked at the curb in a much smaller car than the one she had driven from the train station.</p><p>“Don’t look so surprised,” she added as she leaned over to open the passenger door. “If someone accused me of doing something this nasty, the first thing I’d do is prove that I didn’t. Get in.”</p><p>He would have to send her away, and climbed into the car to do so. Before he touched her, however, she held up one hand.</p><p>“Don’t try to shazam me and send me home,” she said. “I’m not here because of Sam or Luc. I’m here for you.”</p><p>He set his jaw and stared through the windshield.</p><p>“You think you don’t need help, fine. But I’ve got wheels, I know the beach, and I’m the only person who knows for real that you’re innocent.” She nudged him with her elbow. “How hard would it be to think of me as your tresora for the night?”</p><p>He took hold of her wrist. The one who did this is dangerous.</p><p>“I don’t know if you’ve noticed, but I work for the most dangerous lord in these parts.” She watched his face. “Tell you what. I’ll stay in the car and drive you where you need to go. I won’t even get out.”</p><p>He needed to return to the walkway, where the scent trail was strongest. But as he opened the car door, he knew she would simply follow him. To protect her, he would have to compel her to leave him and forget everything she had seen – but he couldn’t bring himself to send her away. Back in the club, she had defended him. In this strange territory, she was the only friend he had.</p><p>“You think that girl in the red dress who stepped out in front of that cab is part of this, don’t you?” she asked, startling him again. “I saw her when it happened; I just didn’t make a big deal out of it because I know how you guys attract women. I think you’re right, too. She was with a young guy in a retro suit. Sam said the dead guy was wearing the same thing.”</p><p>Chris’s eye for detail had made the connection between the girl and the victim, and that decided the matter for him. He closed the door.</p><p>“Which way did she go from here?” she asked. When Jamys pointed south, she said, “Okay. When you need me to stop, just put your hand on the dash, and I’ll pull over.” She put the car in drive and merged back into traffic.</p><p>Jamys opened the window and leaned out, letting the air wash over his face. It was more difficult to track from a moving vehicle, but not impossible, and the scent of the girl in the red dress was so unusual that he followed it easily. When the trace began to thin, he placed his hand on the dashboard and Chris pulled over. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Beneath streetlights that weren’t working, Jamys studied the tall building beyond the empty walkway. It appeared to be a hotel that had been closed; the lawns were a tangle of overgrown grass and weeds, the outside walls had been heavily painted with graffiti, and sheets of plywood had been nailed over the windows on the lower floors.</p><p>“That’s the Sunset Sails.” Chris told him. “I didn’t know it was still here. It was supposed to be demolished over the summer.”</p><p>Abandoned buildings made excellent hiding places for rogue Kyn. Jamys opened the car door but turned back to put his hand on the girl’s shoulder. Keep your promise and remain in the car.</p> <p>“You’re not going in there alone,” she told him. “You don’t even have a knife on you.”</p><p>I will not enter the building. I have but to see if she did.</p><p>Chris didn’t look happy. “You better stay where I can see you, or I’m calling the boss.”</p><p>As soon as Jamys stepped over the rusted chain stretched across the long drive, the fresh scents of other mortals bombarded him. He stood, breathing and sorting through them until he found the one he wanted. She had sat for a time on a wall to the right of the chain. Her scent led from there toward the abandoned building’s front entrance.</p><p>Slowly he trailed the girl’s scent, until he felt something else and stopped halfway to the hotel’s doors.</p> <p>The air around him pressed in, and unseen hands caressed his face. As he jerked back, he heard a laugh, and words in a low, guttural language, which suddenly changed to the ancient French he had spoken during his human life.</p><p>There is nothing you want here, dark one.</p><p>Jamys staggered back as the invisible hands slammed into him, almost knocking him off his feet. Both the hands and the voice belonged to a Kyn with a talent something like his. He could feel it, although his unseen attacker had much more power to draw on. They both might be able to speak through their minds, but the strange Kyn was using something else, a power unlike anything he’d encountered among his kind.</p><p>The girl in the red dress came walking down the drive, halting a few feet away from him.</p><p>Run away now, the voice in his head commanded, and I will not send my children after you.</p><p>Who are you? Why have you come here? Jamys seized the girl’s arm. Tell me.</p> <p>Her dark eyes widened. “I’m Luce,” she choked out. “My name is Luce.”</p><p>Jamys realized that her speaking voice did not match the tone of the one in his mind – in fact, that voice had gone silent. Did you kill the man found in the restaurant?</p><p>“No. Heresabat did. The boy was almost all used up anyway.” Tears spilled from her dark lashes. “It still has me and all the others.”</p><p>How does he use you? How is he controlling you?</p><p>“Heresabat takes our blood and our strength. It keeps it young. It traps us inside and uses us. I can’t fight it.”</p><p>The girl spoke of the Kyn as an it, not a he. Jamys had the feeling it was not because to the girl the Kyn seemed like a monster. Is Heresabat a male or a female?</p><p>“I can’t tell.” She staggered a little as his talent began to affect her balance. “You have to help us. It won’t—“ she stopped as soon as he took his hand away from her, and the fear disappeared from her face. Without another word she pulled out a copper dagger and slashed at his face.</p><p>Jamys turned just in time to save his eyes, and felt the burn of the blade slice through his scalp. As he brought up his arms to protect his face, someone grabbed him from behind and yanked him around.</p> <p>“Come on.” Chris wrapped her arm around his neck and pulled him away from Luce. Jamys picked her up, holding her against his chest as he ran for the car. He didn’t look back until he pushed Chris inside, but as he turned to face Luce he saw dozens of other humans had joined her on the driveway, and more were pouring out of the front of the hotel. Most were dressed in red jackets, dresses or pants, which for a moment made Jamys think of the enormous crowd of customer representatives used in commercials and advertising by a popular mobile phone company.</p><p>“Get in here.” Chris slid over to the wheel. “Hurry.”</p><p>He climbed in, and she took off before he could close the door.</p><p>“What the hell was that?” she panted as she glanced back. “Why did she cut you? Are you okay?”</p><p>Using his sleeve, Jamys wiped the blood from his face and probed the head wound. Long strands of his hair fell into his lap, but the edges of the gash were beginning to slowly close. He used his other hand to touch Chris. I’m not hurt badly. Do not take me back to the club.</p><p>“We are so going back to the club,” she snapped. “I’m going to tell Lucan exactly what that bitch did to you.”</p><p>We cannot lead her to him.</p><p>Chris braked suddenly, stopping the car in the middle of the road. “Why the hell not?” she demanded. “He’ll come down here and bust her into a million pieces.”</p><p>She is being used by her Kyn master. I think he came here to challenge Lucan, Jamys thought of the terror in Luce’s eyes, and what she had told him. He will not face the suzerain himself. He will send the humans he’s controlling.</p><p>Chris flinched as a horn blared behind them. “How many humans does he have in there?”</p><p>The scents that had filled his head in the drive had been too many to count, but he had felt the span of her borrowed power. Hundreds.</p><p>“We need to think this through,” she said as she accelerated. “I’ll take you to my place.”</p><p>A short time later Chris led Jamys up the stairwell of an apartment building and into a flat on top floor. She didn’t give him time to admire the neat red and black décor, but guided him through it to her privy, which was done in stark, icy white. He had stopped bleeding, but took care not to touch anything.</p><p>She left him and brought back a small steel-backed chair with a black vinyl seat cushion. “Sit down.”</p><p>He wanted to tell her he could clean up by himself, but she already had a small kit out and was tearing open a packet of gauze pads.</p><p>“You’re a mess,” she muttered as she dampened a pad and began cleaning the streaks of dried blood from his face. “You shouldn’t have left your blades back at the club. I know you guys are all about the honor and stuff, but that was dumb.”</p><p>He raised his brows.</p><p>“Don’t get all Kyn on me,” Chris told him. “She could have blinded you.” She finished wiping his face and carefully pushed aside what was left of his hair to look at the wound. “It’s closed, but it’s not healed. You need blood.” She began rolling up her sleeve.</p><p>Jamys caught her arm. No, Chris.</p><p>She glared at him. “It’s part of my job.”</p><p>I will not feed on you.</p><p>“The honor thing is getting really old and tired now.” She yanked down her sleeve. “I keep some bloodwine in the fridge for Sam. I’ll get you a glass.” She stalked out.</p><p>Jamys stood and looked at his face in the mirror. Luce’s blade had hacked off most of the hair on the side of his head; he was lucky not to have lost an ear. He searched through the kit until he found a small pair of scissors and went to work on the rest. By the time Chris returned with the bloodwine he had filled her small trash can with cuttings.</p><p>“I liked it better long.” She handed him the glass and took the scissors. Shadowed crescents rimmed her eyes, and he could almost feel how exhausted she was. “Sit down and let me do the back.”</p><p>Jamys sat and sipped from the glass, closing his eyes as the rejuvenating warmth of the bloodwine spread through him. His head felt oddly light without the length of his hair, and the gentle brush of Chris’s fingers soothed him.</p><p>“It’ll probably grow back in a week,” she said as she snipped. “I wish mine would. Last year I went blonde, huge mistake, and then I tried to dye it over with this gorgeous purple color. It ended up the color of sewer sludge.”</p><p>He drained the glass and set it aside, but the taste lingered on his lips. He needed to leave and hunt, but Chris’s luscious scent filled his head. When she came around to stand in front of him he latched onto her wrist.</p><p>“Ouch.” She grimaced. “Little sore there.”</p><p>He turned her wrist over and saw the stained bandage she’d wrapped around it, and then looked at her pale face. What have you done?</p><p>“I kinda lied to you. I don’t keep any bloodwine in the fridge for Sam.” She tried to smile. “It’s okay. I’ve got six pints, and you needed the boost.”</p><p>She’d bled herself for him. If he could have cursed, he would have. He lifted her into his arms and carried her out, looking this way and that until he found the room where she slept.</p><p>“This is nice,” Chris murmured as he placed her on her bed. “Just like in the movies.” When he tried to straighten she tugged on his shirt. “I’m cold.”</p><p>He wasn’t, not with the force of her blood coursing through him. He eased down beside her, gathering her close and pulling the black and white geometric bedspread over her shivering body.</p><p>“I’d really love to have sex with you,” she whispered, “but I think I’m going to be criminally stupid and pass out now.” Her eyelids slowly closed, and her body relaxed.</p><p>He checked her bandage to make sure she hadn’t cut herself too deeply, then rose from the bed to stand at the window. Sunrise was only a few minutes away. He glanced at the telephone on the bedside table. He needed to warn Lucan about the Kyn who had come here, but even if he could speak, he doubted they would believe what he told them.</p><p>Behind him, Chris whimpered, and Jamys went to her. He placed a hand on her forehead. All will be well, my little friend, he lied to her. Forget what has happened tonight and rest now.</p><p>When he was sure she slept peacefully, he found her car keys and slipped out of the apartment. As he went downstairs, he didn’t see the girl in the sparkling red dress step out of the shadows at the back of the landing.</p><p>Chapter Five</p><p>Sam eased out from under the heavy weight of her sleeping lover, and took her clothes from the closet before sneaking out of their bedroom to dress. She never needed to rest as long as Lucan did during the day – one more oddity of her adjustment to being made Kyn – and knew after the hours they’d spent making love that he’d probably stay conked out until dusk. That would give her the time she needed to follow up with Tenderson and see if there was any evidence linking Jamys Durand to the victim. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She felt sorry for the kid, but the last couple of years had taught her never to blindly assume anything about the Darkyn. If she were wrong and Jamys wasn’t involved, she’d apologize.</p><p>Evan Tenderson was just finishing his shift at the morgue when she arrived, and grumbled as he went back to his office to retrieve his preliminary autopsy notes.</p><p>“Virginia confirmed the I.D., although the kid’s parents are dead and so are all the other living relatives,” he told her as they walked down the hall. “According to their FAX, the vic was reported missing in sixty-nine and declared dead in seventy-six.”</p> <p>“Did you find any trace?”</p><p>“Not so much as an epithelial or an eyelash,” he said, pressing a square of gum from a foil packet he took from his pocket and popping it in his mouth. “Considering the condition of the body, it was extraordinarily clean,” he said as he chewed. “Makes you wonder if Bundy had a little brother.”</p><p>She didn’t like jokes about serial killers, but she could appreciate the reference. Ted Bundy had kept the bodies of many of his victims for some time, amusing himself with them as well as washing and grooming them. “Cause of death?”</p><p>“I can’t say by what means yet. I didn’t find any blood or body fluids, so I sent hair, tissue and bone samples for a tox screen.” He opened a drawer of his immaculately tidy desk and took out a steno pad. “No sign of failure or trauma in the internal organs or the brain, and the neck and wrist injuries were post-mortem. Barring anything unusual from the tox, your vic probably died of heart failure. I found a good-size blowout in the aorta. What I’d love to know is why every drop of blood is missing. The heart for damn sure didn’t pump it out.” He tried to blow a bubble with his gum and failed.</p><p>“Yeah, that’s a little weird.” Sam kept her voice bland. “What else?”</p> <p>“Something even weirder,” Tenderson said. “Virginia advised me that Wilson Robert Carcher filed for a name change before leaving the states. Birth certificate reads Wilma Rachel Carcher.”</p><p>She would never have guessed, looking at the corpse. “Wilson had a sex-change?”</p><p>“Nah. All she changed was her name and wardrobe,” Tenderson told her. “She strapped down her boobs, and kept a dildo in her drawers for appearances, but her body was never altered. Your vic was a female.”</p><p>“When did he – did she – die?”</p><p>“That’s what I don’t want to put in my report.” Tenderson gave her an uneasy look. “Yesterday.”</p><p>“What?”</p> <p>“I knew no one would believe me, so I saved a sample.” He went to the small refrigerator beside his desk and took out a vial filled with a thick red substance. “I pulled this out of her sternum and checked it under the scope. From the condition of the marrow, this gal was alive yesterday.”</p><p>Sam took the vial and studied it. “Who else have you told about this?”</p><p>“Well, I thought about calling Doctor G. up in Orange County,” he said, spitting out his gum into the trash and replacing it with a fresh piece, “but somehow I don’t think she’d want me to upstage her on her cable show.”</p><p>“Is this the only sample you have?” When he nodded, Sam pocketed it. Before he could squawk, she placed a hand on his neck and shed enough scent to make his eyes darken. “Evan, I want you to forget about the bone marrow anomaly and the bite marks on the body. Report that the victim died of natural causes. Arrange to have the body released to the county, and send her to be cremated.”</p><p>“Forget. Report. Arrange,” he said in a distant monotone.</p><p>“Try to give up the gum and have a merry Christmas while you’re at it.” Sam ripped the pages of notes he’d made from the pad and stuffed them into her pocket before she opened the door to the office. “Thanks.”</p><p>The fresh air removed the bemusement from the medical examiner’s face. “Yeah, yeah.” He removed the wad of gum from his mouth and pitched it at the trash can. “Happy holidays to you, too.”</p><p>Sam went down to headquarters and reported to Garcia’s office, where she briefed him on the case. After relating the details from the autopsy along with the startling fact that the victim had been a woman, she asked, “Is it possible she was killed by a Kyn lord because she was a cross-dresser?”</p> <p>“Possible, but highly unlikely. She could not have fooled a Kyn lord for long.” Garcia tapped his nose. “They can smell our gender.”</p><p>“Okay. Could she have been this Kyn lord’s tresora?”</p><p>Garcia, who like the rest of his family had served the Kyn his entire life, frowned. “Also unlikely. Our lords generally do not feed on us unless they have no alternative.” He hesitated, and then added, “Over time a few tresori also serve as kyaran, the mortal companions. As such they provide our lords with blood, sex and affection. But a Kyn lord would not wish to have his kyara dress like a male.”</p><p>Sam knew most of the Kyn were remarkably conservative when it came to matters of sexuality. They were still wrestling with the reality of modern alternative lifestyles. “Let’s say he did. Why would he drain the body of blood and then dump it in a public place?”</p><p>Garcia made an uncertain gesture. “I cannot say, Samantha. Such intimate relationships between lord and tresora are difficult to sustain, but they do happen, and sometimes result in tragedy. The more often a Kyn lord uses a mortal, the more likely he is to lose control, go into thrall and kill them. But had that been the case, you would have found an unconscious Kyn beside the mortal.”</p><p>“Maybe it happened somewhere else.” She waited as Garcia answered his phone, and then took the receiver when he handed it to her. “Brown.”</p><p>“My lady, forgive me for disturbing you at your work,” Herbert Burke said, “but I am concerned about Christian. She did not come to the club today, and she does not answer the phone at her flat.”</p><p>Sam thought of how upset Chris had been after the confrontation with Jamys. “She’s probably pissed at me, Burke. Let’s give her the day off.”</p><p>“Of course.” He cleared his throat. “My lord Lucan also bid me to pass along a request that you return to the stronghold immediately, for your own safety.”</p><p>She smothered a chuckle. “I bet he didn’t say it like that.”</p><p>“No, my lady,” Burke admitted, “and please don’t ask me to repeat his exact words.”</p><p>She needed to track Wilson Carcher’s last movements, and that would take time. “Tell Lucan I’m fine. I have to track down some information about the victim and see if that tells us anything about this Kyn running around our territory. I’ll be home in a couple of hours.”</p><p>Burke sighed. “As you wish, my lady.”</p><p>Samantha hung up the phone and took out the passport Rafael had found on the victim. “Before she came over her, Wilson Carcher’s last stop in Europe was in the Netherlands. Do we have any friends among the Dutch authorities?”</p><p>Garcia smiled. “We have friends everywhere on the planet.” He jotted down a number and handed it to her. “Rafael called while you were at the morgue. He lost Jamys Durand’s trail downtown last night.”</p><p>That didn’t bode well for Rafael or Jamys. “We need to find out where this kid is before any more bodies turn up.”</p><p>“Rafael has summoned the best trackers in the jardin,” Garcia assured her. “If he is still in Fort Lauderdale, they will locate him.”</p><p>She left the captain’s office and went to her desk, where she called their Dutch contact. The senior inspector, who spoke beautifully-accented English, was able to access and e-mail her the passenger manifest for the flight Wilson Carcher had taken from his country to hers.</p><p>“There is something else, my lady,” the inspector said. “The flight was bought out by one individual, who paid for all two hundred and seventy-six passengers.”</p><p>That sounded like something a Kyn would do. “What’s his name?”</p><p>“Her name is listed as Erzsébet Cséjthe of Magyarország,” he said.</p><p>Sam didn’t even try to repeat it, but had him spell the name and the place for her. “Is that last bit some place in Belgium?”</p><p>“No, my lady. It is the proper name of a country. Let me think . . .” He fell silent for a time. “Ah, yes. Now I remember the English. You call it Hungary.”</p><p>“I didn’t know we had Hungarian Kyn,” she said.</p><p>“Neither did I, my lady. I will make some calls and see what I can learn.”</p><p>Sam thanked him and ended the call. Knowing that Carcher had traveled to the</p><p>U.S. on a plane with his seat and all the others paid for by a Hungarian woman didn’t make things less complicated, but at least she had a name now. She pulled up a search engine and put in the name the inspector had given her.</p><p>The first link that popped up took her to some sort of online travel journal written by a filmmaker traveling around eastern Europe. She began to read about the English woman’s difficulties in getting across borders and finding decent accommodations, and wondered why people who didn’t like the discomforts of travel were always the first ones to jump on a plane and go to a third-world country where they didn’t even speak the language.</p><p>After a few paragraphs of whining about the food, the hotels and the inconvenience and expense of obtaining the travel papers she needed, the filmmaker posted some blurry graphics of herself, a distant pile of ruins, and two books. One had a lurid-looking jacket and the screaming title of Dracula was a Woman while the other bore an enigmatic sunburst and had been titled and subtitled, but she could only make out the header: The Bloody Countess.</p><p>The phone rang, dragging her attention away from the screen. “Brown.”</p><p>“Detective, this is Carmen Figueroa,” a frantic voice said. “My husband just call me. He say he see Luce down on the strip, but when he go to her she no talk to him. She walk away. When he try to stop her, she push him and he fall.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m sorry to hear that,” Sam said. “But at least you know she’s alive and okay now.”</p><p>“She is not okay,” Carmen insisted. “She is dressed like a puta. She say nothing, not one word. She hurt my Eduardo.”</p><p>Sam tried to think of what to say. “I think maybe Luce is trying to tell you that she needs some time to herself.”</p> <p>“Don’t you no hear me?” Carmen shrieked. “She hurt my husband bad. He had to go to the emergency room. Luce broke his arm.”</p><p>“Sometimes a bad fall can cause a fracture, Mrs. Figueroa.” When the other woman began arguing with her, she gave up. “If you want to press charges against your daughter for assaulting your husband, I can send an officer over to the hospital. We’ll issue a bench warrant for her arrest.”</p><p>“You no understand,” the woman said before she gave up on English and continued in Spanish. “I spoke to my husband and the emergency room doctor. The fall did not do this to Eduardo, Luce did. She did all of it.”</p><p>“Like I said—”</p><p>“It was not one bone,” Carmen said. “It was thirty. Detective Brown, she broke every bone in his arm, his wrist and his hand.” #</p> <p>Chris’s blood rejuvenated him, but Jamys’s strength slipped away just the same as soon as the sun rose in the sky. Resigned to seeking the rest he needed, he pulled in and parked under a shade tree in the back lot of an all-night fast food restaurant. The cramped backseat of Chris’s car wouldn’t accommodate half of his long frame, so he reclined the driver’s seat down until his head couldn’t be seen through the windows, pulled his jacket over his face, and closed his eyes.</p><p>He resisted dreams whenever he felt them hovering around his thoughts, for he never dreamt of anything but the terrors and sorrows of the past, but this time he forgot to keep up his guard, and found himself walking through the quiet forests of his homeland.</p><p>Relief surged through him. No bad memories dwelled here for him; when he had hunted with his uncle he had always known keen pleasure and a sense of belonging, as if he had been born to hunt. As Kyn he could no longer feed on animals, but that didn’t seem to matter now. He followed one primitive scent after another, surprising a hare, then a boar, then a doe nursing a beautiful white-spotted fawn.</p><p>He watched the deer for a long time, taking solace in the sight of such innocence, until someone came up behind him and frightened off the pair.</p><p>Jamys turned to see Thierry dressed in his white Templar tunic, copper-edged swords in both of his huge hands. He wanted to greet him, but his mouth would not move, and neither would his body.</p><p>“I know you are in trouble.” Thierry thrust his swords into the ground. “Show me where you are, and I will come to you.” He waited, but when Jamys didn’t answer he scowled. “I shall kill anything that harms you. You know this. Tis why you summoned me.”</p> <p>Jamys looked down at the swords, and words spilled from his lips. “Those times are over, Father.”</p><p>“You are in danger, boy, and I will not—“ Thierry stopped and stared at him. “Do you speak to me, Jamys?”</p><p>Speaking was all Jamys could do. “I did. I am.” At least here, he could.</p><p>Thierry grinned and tried to embrace him, but something came between them and pushed him back. “Jamie. What is happening to you? Tell me now.”</p><p>“One of the old ones has come here,” he said. “A hunter who can use mortals as weapons. Lucan has become prey, as have his people. They see only the bait, not the trap.” He felt frustration snarling inside him. “I know, but I cannot tell them.”</p><p>“Alexandra should never have done this to you.” Thierry turned away. “I will wake, and I will come to you. Together we will find the hunter and defeat him.”</p><p>“You cannot help the boy, Thierry.” Gabriel stepped out from behind the trunk of an old oak. He wore only an old pair of buckskin trousers. “This is Jamys’s battle.”</p><p>“Uncle.” Jamys saw the terrible burn scars on Gabriel’s torso. “I do not think I can do this alone.”</p> <p>“The hunter is always alone,” Gabriel chided. “So is this one. No matter how many mortals are used for the traps, in the end, it will be you and the other.”</p><p>“I do not have your power,” Jamys protested. “I cannot defeat him.”</p><p>“You have all you need,” his uncle promised. “You have but to remember what I taught you here. Remember that you are also your mother’s son.”</p><p>“Do not speak of Angelica.” Thierry seized Gabriel’s arm. “My son has nothing of her inside him. And he cannot use a bow and arrow to defeat a Kyn lord.”</p><p>“He has but to use his gifts.” Gabriel took Thierry’s arm, and pulled him away. “Leave your son to his work now, brother.”</p><p>Jamys wanted to call after them, but they vanished as quickly as they had appeared. Then he was left alone again – alone and with no thought of what next to do.</p><p>“You could come and get me out of here.”</p><p>He turned around, but only when he tipped his head back did he see Chris, standing on a high branch of the oak. She jumped down, floating to the earth, where she landed lightly on her feet.</p><p>“Sam told me about this place,” she said, smiling. “I didn’t think I could come here.”</p><p>“Where are you, Chris?”</p><p>She shrugged. “Someplace small and dark. Not much fun here.”</p><p>She must still be in pain from bleeding herself for him. “I never meant for you to hurt yourself for my sake,” Jamys told her, reaching out for her. “Forgive me.”</p><p>“I didn’t mind. I really like you. And this place is fabulous.” She threw out her arms and whirled around. “How long can I stay here?” Before he could answer, her arms fell and her shoulders slumped. “They’re waking me.”</p><p>“They?”</p><p>She gave him a sad smile. “Yeah, I have to go.”</p><p>A fierce dread settled over him. “Chris, where are you?”</p><p>“I don’t know. Not a good place.” She climbed up the side of the tree, pausing to glance down. “Your uncle is right. This is your battle, Jamys, and you are your mother’s son. Don’t forget what they both taught you.”</p><p>Jamys jerked awake and pulled the jacket from his head. The south Florida sky had turned pink and gold, with dark blue clouds stretching out over the setting sun. As soon as he opened the window, the unlovely smell of hot grease and cheap meat wafted in. Parking behind the fast food restaurant had given him a chance to rest without attracting notice, but he couldn’t imagine why humans patronized such places. The food smelled so vile he wouldn’t have fed it to a goat.</p><p>And if he kept thinking about that, he wouldn’t have to remember the dream.</p><p>The last rays of the sun made his eyes burn, so he searched in his pockets until he found his shades and slid them on. Whatever his dream meant, he knew Chris was safe, although he would have to go back to her apartment and use her again. This time he would have her call Lucan’s stronghold and relate what he had discovered. This time he would write it all down rather than use his talent, so that he would not further exhaust her.</p><p>When Jamys arrived at the girl’s apartment, however, he found the door ajar and the place empty. Her scent was all over everything, but it was faint, as if she had not been in the flat for some hours. He turned and saw her purse still sat where she had left it on the small table in the kitchen, and went back to the bedroom. There, by the bed, he picked up another, unwelcome scent.</p><p>Luce had stood here, and put her hands on the coverlet. She had come for Chris.</p><p>Jamys cursed himself as he followed the scent of both females, which lead out of the apartment and down to the parking lot, where it abruptly disappeared. She must have taken Chris away in a vehicle.</p><p>Chris, who as a tresora in training would know everything about Lucan’s stronghold, his defenses and the number of warriors guarding him.</p><p>Jamys jumped back into the car and began driving toward the beach before he realized he couldn’t go into the Kyn’s lair alone. He would have to return to Lucan’s stronghold and somehow explain what had happened. He was tempted to pick up a human from the street and compel them to speak for him, but with as much as he had to say, they would only end up falling unconscious.</p><p>He stopped at a petrol station and parked next to a telephone booth in the lot. For the first time since Alexandra had operated on him, he tried to use his voice. His tongue, which the Brethren had mutilated and Alex had rebuilt, moved sluggishly, but no sound came from his throat to form words. He tried again, but the muscles in his neck knotted, and all that came out were bursts of air.</p><p>You didn’t tell your father about your mother’s evil. You hid away inside yourself and let him suffer. Why would you think you could tell Lucan about the danger to Chris, and how she is now being used against him?</p><p>Jamys choked on the bitter taste of his own helplessness, and without thinking rammed his fist into the windshield. The glass exploded outward, bouncing all over the hood of the car. He pulled back his hand and watched the glass shards fall from his unmarked flesh. Chris’s blood had restored his strength – and he couldn’t say a word to warn her friends and save her life.</p><p>A car pulled up beside him, and he got out and went around it to the driver’s side. The woman behind the wheel was short, plump and middle-aged, with a tired but kind face. She stopped hunting through her purse when she saw him, and then stared at his chest. “My lord, but you’re a mess. Were you in an accident, honey?”</p><p>Jamys glanced down; he’d forgotten the dried blood on his garments, now covered with bits of the shattered windshield as well. He held out his hand, and when she took it he released his scent and spoke in her mind. I need you to make a phone call for me.</p><p>She nodded, smiling as she got out of her car, and walked slowly to the booth. He touched her once more to give her the number, and then took out his pad and pen and began to write.</p><p>Chapter Six </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Samantha was waiting for the Dutch inspector to fax over the credit card receipt used to purchase all the seats on the flight Carcher had taken from Belgium to Florida when her phone rang. She saw the number displayed by caller ID, hesitated, and then picked up the receiver. “I’m almost finished here, Lucan.”</p><p>“Glad I am to hear it,” he said. “I am enjoying a myriad of spanking fantasies now. If that is all you wished to tell me, you needn’t rendezvous with me. Just go up to the penthouse and wait. I shall be along shortly.”</p><p>“What are you talking about, rendezvous?”</p> <p>“Burke gave me your message, from when you called earlier.”</p><p>She frowned. “I didn’t call you.”</p><p>“This small piece of paper says that you did, and you wished to meet me in the bar at midnight.”</p><p>“Lucan, I never called or left that message.”</p><p>“Give me a moment.” Lucan then called for his tresora.</p> <p>Sam tucked the receiver between her cheek and shoulder as she pulled on her jacket.</p><p>“Darling,” Lucan said, “Transfer me over to Rafael if you would.”</p><p>“He’s still out hunting Jamys.” She switched the receiver from one ear to the other. “Who does Burke say left that message?”</p><p>“You need not concern yourself with—”</p><p>“Fluffing me off hasn’t worked since I was human,” she reminded him. “Tell me.”</p><p>“As you wish.” Lucan sighed. “Burke swears on a stack of good books that he spoke to you an hour ago.”</p> <p>“An hour ago I was on the phone with Europe,” she said. “Nice people, the Dutch. Very helpful.”</p><p>“Burke must have made a mistake.” Lucan sounded remarkably unconcerned.</p><p>Sam knew Lucan’s tresora, his most trusted human servant, didn’t make mistakes. Not only had Burke and his family had been in service to the Darkyn for centuries, but he took his duties very seriously. He was also utterly devoted to Lucan, and would have set himself on fire before he allowed anyone to get at the suzerain.</p><p>Which was what was happening. Someone was trying to get to Lucan, and he knew it, and he didn’t want her to know about it. Sam could hear it in his voice. “Ask Burke what line the call came in on.”</p><p>Lucan did, and then said to her, “The main number to my office downstairs.”</p><p>Which Sam never used. She grabbed her car keys. “I want you out there. Now.”</p><p>“I think not.” Lucan’s drawl took on a hard, cold edge. “I shall deal with this. You will stay downtown.” He hung up before she could tell him to go to hell.</p><p>Sam dialed Rafael’s number as she hurried out to the employee parking lot. As soon as he answered, she said, “Someone pretending to be me is meeting Lucan at the club at midnight. How far away are you?”</p> <p>“We are at young Chris’s apartment.”</p><p>She unlocked and jerked open her car door. “Tell her to stay there and meet me at Infusion. Now.”</p><p>“Chris is gone, and so is her vehicle,” Rafael said. “Jamys Durand’s scent is all over the apartment.”</p><p>Sam froze. “He took her from the apartment?”</p><p>“That or she invited him in and left willing with him,” her partner said. “That is more likely, my lady. She is a friendly child, and sympathetic to him.”</p><p>“She’s an idiot and I’m going to kill her,” Sam promised.</p><p>“That is not our concern now.” Rafael’s tone changed. “If our lord is in danger, he must be our first priority.”</p><p>She knew he was right, but she didn’t have to like it. “I’ll get to the club before you do and see what’s going on. Send all the men in.”</p><p>“Do not try to get between Lucan and this intruder,” Rafael warned. “If he is as powerful as our lord, you will only get yourself hurt.”</p><p>Sam put on her emergency lights and used them to speed downtown. Along the way she took out the vial of bone marrow from her pocket and thumbed off the top. Placing the open end against the gunshot scar in the center of her palm, she turned the vial over.</p><p>As soon as the fluid touched her scar, it invoked her talent, which allowed her to see through Wilson Carcher’s eyes during the last minutes of his life. The first thing she saw was Luce Figueroa’s face. The missing girl lay under her, her face blank and her eyes staring up at the ceiling, her body bobbing back and forth against damp sheets. Sam shuddered as she realized Wilson was having sex with the girl by penetrating her with strap-on. The device didn’t repel her as much as the grinding motions Wilson was making with it, as if he were some kind of screwing machine trying to get as deeply inside the girl as he could. Two blank-faced boys stood on either side of the bed, their trousers open and their fists working up and down their erections.</p><p>Wilson climbed off Luce, unstrapped the artificial cock and watched as the two boys ejaculated on Luce’s breasts and face. Their semen mixed with tears from the girl’s eyes. Why do you weep, pretty girl? He was only thinking the words, but somehow Sam knew Luce could hear them just as well as if they were spoken. This is what you wanted. Was it not enough? Shall I fuck you again?</p><p>Sam didn’t know how she knew it, but the psychic voice didn’t belong to Wilson Carcher – as if his mind and body were clothes that the voice dressed itself in. She also sensed Luce, trapped somewhere inside that mask of a face, was also being controlled by the voice. The girl was still inside her head, however, and screamed silently through the revulsion and hopelessness in her eyes.</p><p>Sam felt nauseated, and pulled over, switching off the emergency lights. As soon as she did the images took over her vision, blinding her to everything else except what seemed to be the last hours of Wilson Carcher’s life. He dressed in his leisure suit, taking care to bind down his breasts and stuff his crotch with another fake cock. As he did, he also watched Luce get up from the bed and pull on a sparkling red dress. She didn’t attempt to wipe the semen from her face or body.</p><p>We will go out and have dinner, Wilson thought to Luce. I will show off my new pretty girl to the world, and then you may climb under the table and use your mouth to pleasure me.</p><p>Sam followed them out of the hotel room, down a flight of stairs crowded with boxes and heaps of tarps, and out of plywood-covered doors into the night. They walked north until they reached a traffic light, and Wilson turned to see Luce staring into the street.</p><p>Who is that? A pretty boy?</p><p>Sam saw Jamys Durand sitting in the limo with Chris, who had stopped at a red light. He was staring back at Luce, who must have had some effect on him, for his pupils shrank to black slivers.</p><p>Wilson seemed almost pleased. You cannot have that one, pretty girl. He is one of my kind.</p><p>Through some impossible surge of will, Luce broke free of the voice for a moment and stepped down from the curb, walking in front of taxi that just stopped short of running her down.</p><p>I am not done with you, Wilson screamed into Luce’s mind. Come back to me at once.</p><p>Luce did the exact opposite, turning away from him and heading back south along the strip. Wilson didn’t seem disturbed by it, however, and continued on into the restaurant. Sam could feel a spreading numbness inside as he walked into the men’s room and took out the blade he was carrying. At the same time, whatever presence was in his mind began to fade.</p><p>You were a good child, Wilma. Wilson drew the blade over his wrists, opening his veins. A mist of red blood escaped through the cuts and formed a cloud in front of him. I shall miss you. He then used the knife to cut his own throat.</p><p>The cloud shrank in on itself and seeped out of the small window while Wilson fell to the floor, the knife skidding away out of sight behind the trash bin. As the presence vanished, Sam felt the body rapidly decaying, and heard a single thought flashed across what little was left of Wilson’s mind before it shut down.</p><p>Free.</p><p>As Lucan stripped off his gloves and walked out of the elevator, he wondered which enemy would be waiting for him at the bar. Whoever had entered his territory might have heard that Lucan had given up his role as Richard’s pet assassin and had vowed not to kill again. Perhaps the fool considered that a measure of safety that would protect him while challenging Lucan inside his own stronghold. This unknown lord had made a serious tactical error by coming to here, but he had in essence committed suicide by pretending to be Samantha.</p><p>Burke had followed his orders and cleared out the mortal patrons and the staff, except for one lone redhead sitting on a stool and sipping a martini. As soon as Lucan smelled her, his tension grew. He didn’t need some bloody mortal female getting in the middle of this.</p><p>He was only mildly surprised when she turned and he saw her features. Alisa had been in his employ until he met Samantha, and had provided him with regular relief. When love had destroyed his common sense, he had broken off their arrangement. “You must leave here at once, my dear.”</p><p>Alisa set down the martini. “My master sent me to bargain with you,” she said in a low, flat voice.</p><p>“If I recall, you serve many masters.” Lucan saw how dilated her pupils were. “But perhaps you will tell me more about this one.”</p><p>“My master was not aware of your presence until after our arrival. Apologies are made for the intrusion.” Alisa slid off the stool and began walking around the club. “This is an imaginative place. You must attract many humans each nightfall. My master envies you.”</p><p>Lucan didn’t think her speech was rehearsed, but decided to switch from speaking modern English to a more archaic tongue that Alisa could not have understood. “Name your master, and the reason for which he sends you here.”</p><p>“You have seen through me, then,” Alisa replied in the same forgotten language, her voice much more animated now. She also acquired a thick eastern European accent. “I am come to bathe in beauty, Golden One. That is all.”</p><p>“You are in my territory, using my humans without my leave,” Lucan said, following her. “You will release this mortal, and all the others under your sway, and I may yet allow you to live.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She laughed with delight. “You speak with such arrogance. How young you are.” She turned to look at herself in the mirror behind the bar. “Come out, my children.”</p><p>Burke stepped out of Lucan’s office.</p><p>He barely glanced at his tresora. “Not now, Herbert.”</p> <p>Burke didn’t reply or stop walking toward Alisa. He stopped to stand behind her, his eyes and expression blank. From the office and the supply room and behind the bars, more of Lucan’s mortal servants appeared. They walked in silence and gathered around the prostitute, forming a wall of bodies.</p><p>“Herbert,” Lucan said carefully. “You belong to me. You serve me. Get away from that woman.”</p><p>His tresora didn’t move.</p><p>“Your man had a stronger will than the others,” Alisa informed him. “It took me near half an hour to bring him around. It is a bit easier when they have need, like this one’s craving for oblivion.” She patted her own cheek. “When they are wanting, then they give themselves to me almost at once. Once I bathe in their beauty, then they are mine forever.”</p><p>Two young human males entered the club. Between them they dragged a struggling young female – Samantha’s friend, Chris.</p> <p>“Let me go.” Chris writhed as she tried to fight free of their hold. She stopped when she saw Lucan. “Luc, help me.”</p><p>In spite of himself, he took a step toward her.</p><p>“Stay where you are, my lord,” Alisa warned, “Or I will have Gerald and Stephen snap her neck.”</p><p>Each of the boys holding Chris seized her throat with one hand.</p><p>“An impressive show of talent,” Lucan said, sounding bored. “But not one I find particularly threatening. You may, of course, kill as many of my mortals as you wish. They are rapid breeders. I can always acquire more after I find you and scatter your remains to the winds.”</p><p>“Lucan,” Chris gasped, her young, pale face appalled.</p> <p>“What of your lady Samantha?” Alisa inquired sweetly. “Burke was kind enough to tell me of the great love you have for your sygkenis. Can you replace her so easily?”</p><p>“She can’t get to Sam,” Chris shouted. “She can only do this to humans—” she choked as the boys holding her tightened their hands on her neck.</p><p>Light bulbs began to pop in their sockets, sending down showers of sparks as Lucan’s eyes narrowed. “You do not touch Samantha and live.”</p><p>“I do not have to, my lord.” Alisa glanced at Burke, who took out a pistol and raised it in a shaking hand. Sweat poured down his face as his lips pressed together, and his expression turned to one of pain, but then Alisa rested a hand on his shoulder, and Burke fired.</p><p>The copper round caught Lucan in the upper arm, knocking him back against the bar. When he found his footing, he grabbed his shoulder and felt the bloody holes on both sides, indicating that the copper round had gone through and out of his flesh.</p><p>“That is what one mortal who reluctantly serves me will do,” she said as she took the gun away from Burke. “Imagine how efficient three hundred who have given themselves wholly over to me are.”</p><p>“Who are you?” When she didn’t answer, he said, “What do you want?”</p><p>“That is more like it.” Alisa smiled. “Let us retire to your chamber of business, and there we will discuss terms.” #</p> <p>Samantha arrived at Infusion as soon as her head cleared enough for her to drive. Seeing through the eyes of a human turned into a zombie had left her feeling sick and unclean, as if even the vision had somehow polluted her soul. At least now she understood the intruder’s talent, and what had happened to Luce Figueroa. She could warn Lucan and together they’d hunt down this bastard and force him to free the people he used like puppets.</p><p>The front entrance to the club was not guarded, making Sam wonder where the hell Rafael and the men were. She stepped inside and almost on the body of one of their bartenders. Bending down, she checked his pulse; he had been knocked out but otherwise seemed unharmed. As she looked across the club she saw other bodies, and hurried over to the next.</p><p>Someone had come into the club and knocked out every single human in the place, including Burke. It had to be the Kyn who had taken over Wilson and Luce, and when she heard voices coming from Lucan’s office, she broke into a flat run.</p><p>Of all the things Sam had expected to see when she kicked open the door, Lucan in the arms of another woman was not one of them. For a moment all she could do was stand there and watch the skinny redhead stick her tongue in her lover’s mouth.</p><p>No wonder he didn’t want me down here. Her shock turned into a slow, simmering outrage. “Am I interrupting?”</p><p>Lucan pulled the redhead’s clinging hands from around his neck and pushed her away. “The lady is leaving now.”</p><p>“Do not forget what I told you, Golden One.” The redhead brushed a final kiss over his lips before slipping out of the office.</p><p>“Golden one?” Sam clenched her fists to keep from drawing her weapon. “Are you kidding me?”</p><p>“It is not what you are thinking.” Lucan wouldn’t look at her. “I did not invite her here, nor did I ask her to touch me.”</p><p>“Yeah, I could see how hard you were fighting her off.” She turned to go, but found herself being spun around. “Oh, you don’t want to do this with me right now. Not when I’m carrying copper rounds.”</p><p>“You must listen.” He jerked her against him and folded his arms around her in a painful hold. “I am sending you to Orlando,” he whispered against her ear, as if it were a secret. “Tonight. You will stay with the Kyn at the Realm.”</p><p>“Excuse me.” She had to speak loudly to hear herself over the roaring in her head. “Did you just say you’re kicking me out?”</p><p>“Samantha, please.” He tucked her head under his chin. “I cannot explain, but you must trust me. You have to go. Now.”</p><p>“Trust you, but get out. After I find you with a hooker.” She had to use her Kyn strength to pull free. “Lucan, we’re not human anymore, and we’re certainly not married. You just have to say it’s over. Which I think you’ve pretty much done here by sucking face with that skank.”</p><p>“It is not over.” His eyes turned to chrome, and then he glanced at the door before he lowered his voice again. “I do this for your protection.”</p><p>“From who? Your new girlfriend?” She laughed. “I think I can take her.”</p><p>“No.” His pupils contracted and his fangs emerged as he seized her shoulders. “I am your liege lord, and you will obey me, damn you. You are not to go anywhere near her, do you hear?”</p><p>“Perfectly.” She slapped him. “You son of a bitch.”</p><p>He didn’t stop her when she left this time. It was only outside the office did she smell his scent and his blood, and saw the fresh stain on her sleeve.</p><p>She remembered the last time she had seen the whore he’d had in his arms. The girl had come to the club looking for him about a year ago. He hadn’t even bothered to see or speak to her personally, but had told Burke to give her some money and send her away. When Sam had asked him about her, he explained that she had been one of the mortals he’d paid to use for blood and sex. She’d taunted him about his past bad behavior coming back to haunt him.</p><p>He’d sniffed and pretended to be offended. There is nothing wrong with such arrangements. After several hundred years, a certain amount of skill and professionalism have their own attractions.</p><p>A guy as gorgeous as you, with all your superpowers, paying for it. She had laughed. That is utterly ridiculous.</p><p>He’d pulled her into his arms. Fortunately I don’t have to anymore.</p><p>Back then the hooker had been vaguely attractive, in a tawdry, working girl fashion. Tonight she’d looked twenty years older, her face and body rack-thin and her skin pasty from what must have been a long stretch of malnutrition and drug dependence.</p><p>Samantha knew she wasn’t perfect, and that she and Lucan had their problems. She imagined he had a long list of complaints about her and how many ways she annoyed him. But there was love, too; love that had changed both of them. They had been loners who had been lucky enough to find each other, and after a wrenching series of tragedies and heart aches, they had fallen in love. Fate had done the impossible and seen to it that they would always be together. Lucan might never be completely happy with who she was, but she knew he would never deliberately hurt her or destroy what they had.</p><p>Not without very good reasons.</p><p>I do this for your protection.</p><p>She shook off the anger and breathed in. The strong smell of gun powder tainted the air. That and the blood stain convinced her to turn around and go back. She looked through a gap in the door, and saw him tearing the remains of his shirt from his torso, throwing it to the floor in disgust. At some point during the evening, every glass object in his office had shattered – and it hadn’t been during their confrontation.</p><p>Sam came in and watched him pour a healthy amount of whisky over the still-oozing wound. “Did she threaten to shoot me, too?”</p><p>Lucan’s head snapped up. “I told you to get out of here.”</p><p>“I remember.” She closed the door and picked up the remnants of his shirt. “Christ, she got her stink all over you.”</p><p>“I do not have time for this. Where is Rafael?” He tried to go around her, but halted as she wrapped her arm around his waist. “For God’s sake, Samantha, go.”</p><p>“Not going. Not this time.” She looked up into his eyes, and saw pain and fear behind the anger. “She was sent here, wasn’t she? By the zombie lord. He made her do this – all of this – to hurt me.” She felt him shake. “And you.”</p><p>He rested his forehead against hers. “I’ll find him,” he murmured. “When I do, I’m going to tear him apart. Slowly. Limb by limb. And I’m going to enjoy it.” He raised his head. “Until I do, you will never be safe. Neither will any of these damn mortals around us.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“So we hunt him together.”</p><p>“No.” His voice went flat. “He has over three hundred mortals at his command.”</p><p>“Everyone on the plane,” she said, nodding. She saw him frown. “He brought over his own zombie army from Europe. The dead guy we found at the bistro was one he used up.”</p> <p>“How used up?”</p><p>“He got angry after he lost control of one of them for a few seconds. The longer they’ve been with him, the more damage he does to their minds and their bodies. But when he’s angry, I think it burns them up faster.”</p><p>“The loss of control angers him.” Lucan sat down on the edge of his desk. “We have to break his hold over the mortals. Somehow.”</p><p>“There is only one Kyn who can do that,” Burke said weakly from the doorway. “Jamys Durand.” He doubled over, and Sam went to grab him. As she helped him straighten, he looked at Lucan. “My lord, my life is yours. I am so ashamed. I tried, but I could not stop her. I could not get her out of my head.”</p><p>“Her?”</p> <p>Burke nodded. “The one who did this is a woman. Very old, and very powerful. One of the first Kyn ever to walk the night. One of the worst, after she went mad in the seventeenth century.”</p><p>“Who the devil do you mean?”Lucan demanded.</p><p>“The Bloody Countess,” his tresora said. “Erzsébet Báthory.”</p><p>“I thought she was dead,” Lucan said. “Richard had her walled up and starved to death in her own torture chamber four hundred years past.”</p><p>Sam frowned. Rafael told her that the high lord had done the same thing to his own murderous wife. “Is that the only punishment Richard doles out?”</p><p>Burke and Lucan glanced at her and answered in unison. “No.”</p> <p>“She must have escaped, my lord. Only she had the talent to control the bodies and minds of mortals.” Burke made a disgusted sound. “That is how she takes them, by the incarnatio.”</p><p>“The what?”</p><p>“Embodiment, for want of a better translation,” Lucan said. “A very few of the old Kyn could move between bodies, and possess that of another. It was a talent common to them, and known as the incarnatio.”</p><p>“How old is she?”</p><p>“No one knows, my lady,” Burke said. “No one can remember a time when she did not walk the night. Some say it is what drove the countess to madness.”</p><p>“Hang on,” Sam said as she put together the web site she’d seen and the name Burke had mentioned. “Are you talking about Countess Elizabeth Bathory? That nut job who killed six hundred girls so she could take a bath in their blood?”</p><p>“Six hundred and twelve, actually,” Burke said. “And she did quite a bit more than simply bathe in it.” The tresora stiffened. “Please, my lord. Hit me.”</p><p>“Why?”</p> <p>“I can feel her inside me.” He gritted his teeth. “She is trying to take control again. Hit me now!”</p><p>Lucan clipped Burke across the jaw, knocking him out. Sam gently lowered him to the floor before looking outside.</p><p>“The rest of them are waking up,” she told Lucan. “And they don’t look too friendly.”</p><p>Lucan bent down, put his shoulder to her belly, flipped her over it and ran.</p><p>Chapter Seven</p><p>No one answered any of the phone lines at Lucan’s stronghold, which made Jamys fear that the worst had already happened. After wiping the memory of the woman he had used to place the call, he broke out the rest of Chris’s windshield, cleaned the glass off the car and drove as fast as he dared to the club. Rafael intercepted him at the door, demanding to know where Chris, Lucan and Samantha were.</p><p>Jamys shoved the pages of notes he had written into the seneschal’s hands and pulled him toward the car. Rafael drew a dagger, but then he put it away and finished skimming the notes.</p><p>“You are certain she is in this place?”</p><p>Jamys nodded, pointed to himself and then to the south.</p><p>“You cannot go in alone.”</p><p>He drew on the strength of his dream as he took out his pen and wrote on the palm of his hand. I MUST.</p><p>“I will surround the building with our men,” Rafael said. “But I can only give you a few minutes. After that we must attack.”</p><p>A few minutes was all it would take for him to succeed or die trying. Jamys nodded again, and went back to the car.</p><p>Rafael leaned in to hand him an old, worn dagger. “I know you have your own weapons, but take this.” He pressed it between their palms. “It always brought me luck on the battlefield.”</p><p>Jamys wished he could speak his thanks. Instead he slid the blade into his forearm sheath and drove off toward the Sunset Sails.</p><p>Red lights glowed in every window of the old hotel, and the front entrance doors stood open, welcoming him. Jamys walked in and saw Luce standing in the deserted lobby.</p><p>“We have been waiting for you, dark one,” she said in the monster’s voice. She turned and walked down a hall.</p><p>Jamys followed, keeping his mind clear and his hand on his dagger as she led him into what must have once been a grand ballroom. There hundreds of mortals stood assembled like polite guests around the empty dance floor, where an enormous red cloud swirled like a small tornado around a darker, less distinct shape.</p><p>As Jamys stepped onto the floor, Luce went ahead of him and walked into the cloud, which tightened around her as it forced its way into her open mouth. Her chest swelled out as more and more of the cloud funneled into her, until it disappeared down her throat and she closed her lips to smile at him.</p><p>Behind her, the body of a thin, red-haired female lay stretched over the top of a large trunk. She stared up at the ceiling, her fist still curled around the knife she’d thrust into her heart.</p><p>“Never mind her. She was too far gone to last more than a few hours.” Luce nudged the body off the top of the trunk and sat down in its place. “Welcome to my new home. I have been expecting you.”</p><p>Jamys took his hand from the hilt of his blade and walked slowly to her, stopping a foot away to drop to his knees.</p><p>“Do you come to beg for mercy?” she asked, coming to stand over him. “Or do you wish me to give you back that noisy mortal I took from you? I have not finished playing with her yet. In fact, I have tried to get into her for almost a day now, and still, she resists me. I think I will designate her to serve as my chief form. This female” –she gestured at herself— “is too enamored of men.”</p><p>Out of the corner of his eye he saw Chris being dragged toward the dance floor, but kept his head down and put his hand over his mouth in a plaintive gesture.</p><p>“Yes, I forgot, you are a mute. Have I ever told you how attractive I find that in a man?” Luce snapped her fingers. “Bring her to him.”</p><p>The mortals holding Chris forced her across the floor and down on her knees beside him. As soon as they released her, Jamys took hold of her hand. She turned her head to stare at him, and then looked up at Luce.</p><p>“Lord Durand wishes to give you his oath,” Chris said, her voice quivering over each word. She swallowed and shook her head. “He say that he will serve you faithfully.” To Jamys she said, “How can you be such a traitor? You know what she is – what she does to humans – what she wants to do to me.”</p><p>“What I shall do.” Luce giggled. “I must say, I find this offer quite intriguing, seeing as Lord Durand came here to kill me.”</p><p>Jamys tightened his grip on Chris’s hand.</p><p>“Lord Durand knows you have the power of incarnatio, and cannot be slain through your servants,” Chris replied. Tears streaked down her face. “But mortals can only protect you so much. You have no Kyn servant to watch your back and keep you safe from the likes of Lord Lucan. Lord Durand offers to serve as your seneschal.”</p><p>“I do not believe it.” Luce clamped her hand over Chris’s face, holding her mouth open, and releasing a small tendril of red mist from her own lips. The girl moaned as the mist entered her mouth, and then just as abruptly withdrew. “You speak the truth.” Luce frowned at Jamys. “You would give me your oath and your life.”</p><p>Jamys nodded.</p><p>Luce snapped out her arm. “Give me a sword.” When one was placed in her hand, she brought it over Jamys’s head as if she meant to decapitate him. Then, with a flash of copper, she touched the blade to one of his shoulders and then the other.</p><p>“Speak the oath,” she said.</p><p>Through Chris Jamys gave her his oath of service, pledging to serve her for the remainder of his life. Chris fell to the floor by the time she finished, panting with the strain of serving as his conduit. She only looked at Jamys when he wrapped his hand around her ankle and gave her his final command.</p><p>Luce held out her hand and helped Jamys to his feet. “I have never had a seneschal,” she whispered in delight. “We will have so much fun together.”</p><p>Glass splintered, and Jamys looked over Luce’s shoulder to see webs of cracks spreading out over the ballroom’s windows.</p><p>“Your first task is at hand, seneschal,” Luce told him. “It seems Lord Lucan has escaped my children at his club, and comes here to murder me. You will kill him.”</p><p>Jamys took position in front of Luce and scanned the room. The mortals parted, and the suzerain appeared. He was not armed, but he had removed his gloves, and there was death in his glittering silver eyes.</p><p>“Get out of my way, boy,” Lucan said as he strode onto the floor, heading for Luce.</p><p>Now was the only moment he had left, Jamys knew, and he cast down the sword Luce had given to him, turning to cradle her face between his hands.</p><p>The three words he uttered were barely whispers, but she heard them. “Send her out.”</p><p>Luce shrieked, tearing away from him and falling back over the trunk. The red cloud erupted from her like boiling steam, rising to hang above them in the air.</p><p>All around Jamys, the possessed mortals began making ugly, angry sounds as they crowded in on him. He ignored their anger as he went to the next human nearest to him, put his hands on the boy’s shoulders, and repeated the command. Someone clawed at Jamys’s back, but the boy coughed, forcing the red mist out of his lungs. Jamys moved to the next mortal, and the next, and each time he commanded them with his talent, their bodies purged the red mist. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By this time the other mortals were stumbling over each other trying to get at him. He shrugged them off, but he knew it would take too long to touch each human before the Kyn possessing them stirred them into a killing rage.</p><p>“Jamys, I got it.” Chris dragged in the fire hose he had sent her to retrieve, and turned it on, spraying the ones he hadn’t touched with water.</p><p>Jamys knelt in the puddle, drew on every ounce of strength he had left, and placed his hands in the water. The hunter inside him knew how everything was connected by water, and the Kyn in him hoped that with the right focus it could be used as another conduit. He imagined his talent like electricity, and sent it crackling through the water as he shouted his final command in a clear, loud voice. “Send her out.”</p> <p>Every human in the room collapsed, and a thick cloud of red mist rose to join with the immense mass hovering over them. As the last of it rose, Samantha appeared and swept her scarred hand through it. She turned to Lucan. “The trunk.”</p><p>Lucan strode over and yanked off the lid, and Jamys staggered over to help him. Inside the small space was something at first glance that looked like a child. Its wasted limbs were curled up in a fetal position, and long white hair veiled its body. The stench of rotting flesh was so thick that Samantha made gagging sounds. The face, that of an incredibly ancient old woman, wrinkled as the shriveled lips stretched into an ugly smile. The eyes, red as blood, opened and stared up at Lucan.</p><p>“I thought she was supposed to be young and beautiful from all the blood baths,” Samantha muttered, covering her nose.</p><p>“She was,” Lucan said. “Before she was walled away from mortals for three years.” He addressed the old woman. “You used your own blood to escape your prison. You sent it out through the windows and the cracks, and put it into mortals so you could control them.”</p><p>“Just as it once kept my flesh sound and sweet,” her withered voice said. “I rewarded all the mortals who came to me. I made them my children. They always want something, and they know only I can give it to them.”</p> <p>“Get back.” Lucan shoved Jamys away, and then thrust his hand around the monstrous thing’s scrawny neck. “This is what they all want, old woman.”</p><p>The trunk exploded outward, disintegrating around the body inside as it blew apart. The cloud above the room went still, and then came down like blood rain, soaking everyone and everything.</p><p>Chris turned the hose first on the humans, washing the countess’s blood from their bodies. Then she held the hose up so that it showered down on her, Jamys, Lucan and Samantha like rain. The blood slowly thinned until all that remained as a large pool of watery pink.</p><p>Everywhere a piece of the countess’s body landed, the flesh blackened and fell apart into the water. Within a few minutes all that remained of her were a few puddles of wet ash.</p><p>Jamys went to Chris, taking the hose from her and closing the valve before pulling her into his arms. He held her for a long time, just like that, their wet clothes dripping between them, their arms tight.</p><p>When he could manage it, he held her at arm’s length. “Thank you,” he croaked.</p> <p>“You’re welcome.” She grinned up at him. “My lord.”</p><p>Samantha took Luce Figueroa to the best private rape treatment center in Miami, where she was admitted for her physical and spiritual injuries. Carmen and Eduardo accepted Sam’s explanation that their daughter had been abducted and drugged, and with a little nudge from l’attrait, Eduardo even forgot that Luce had attacked him and broken his arm.</p><p>Luce, however, felt differently about her experiences. “Don’t make me forget what happened,” she pleaded when Sam came to see her in her room. “I know what you are, and that you can, but please, don’t.”</p><p>Sam felt perplexed. “Why would you want to remember?”</p><p>“So I don’t ever let it happen again.”</p><p>She couldn’t allow a mortal to retain memories that might expose the Kyn, but she could offer her some comfort before she removed them. “You didn’t let this happen to you, sweetie. You were a victim.” She held the girl as she wept, and then gently compelled her to forget about the countess and everything that had happened since she had been abducted. She then spoke to the unit’s psychiatrist, and made sure that Luce would be treated for sexual addiction as well as her other injuries.</p><p>Lucan called for several buses to transport the mortals from the Sunset Sails to a private compound in Miami he had set up to provide temporary sanctuary for the Kyn refugees fleeing the Brethren in Europe. Rafael travelled with them, and promised to see to it that each survivor was returned to his country and family, as soon their memories were wiped clean and they were provided with a plausible explanation for the length of their disappearance.</p><p>The ownership of the Sunset Sails was quickly transferred from the Hungarian holding company that had purchased it over the summer to one of Lucan’s private corporations. He hired a demolition company and scheduled the old hotel to be torn down within the month. As soon as it was, he planned to have the rubble taken by cargo ship to be dumped in a deep trench in the Atlantic, and then have his landscapers go in and burned over and plowed under the property several times, just to be sure.</p> <p>Jamys had a great deal of explaining to do, but the strain of speaking kept his voice at a whisper for another day. The following evening he was able to sit down with Lucan and Samantha and explain what he had done.</p><p>“I convinced Chris that I meant what I had her say for me,” he said. “That is why the countess believed me, because Chris believed me.”</p><p>“She’s not that easy to fool,” Samantha said. “You must be one hell of an actor.”</p><p>Jamys thought of his mother, who had allied herself with the Brethren but lied to her husband and family to make them believe her still loyal to the Kyn. “’Tis a family skill, I think. One I hope I will not have to use very often.”</p><p>“How did you know the mortals would obey you and expel the countess?” Lucan wanted to know.</p><p>“I already knew that they could not be compelled by l’attrait,” he admitted. “But while she occupied their bodies, she was not actually part of the flesh. My talent compels the body as much as the mind, so I gambled that their bodies would obey me.” He noticed Chris standing beyond the tables. From her expression he knew she had heard every word. “Would you excuse me?”</p><p>His friend folded her arms as he walked over to her. “You lied to me.”</p><p>“If I had told you my true intentions, she would have discovered them. The ruse was necessary.” He took her hands in his. “Am I forgiven?”</p><p>“You rescued me and almost four hundred other zombies, plus Lucan and Sam, and you have the sexiest voice I’ve ever heard from a guy..” She cocked her head. “You’ll be lucky if I don’t turn into a love-crazed groupie and start stalking you.”</p><p>Jamys kissed her forehead. “I can think of many fates much worse than that.”</p><p>“Where is that damned assassin, and what has he done with my son?” a low, rough voice called out. Thierry Durand stalked into the club, followed by his exasperated sygkenis, Jema Shaw, who had to trot to keep up with him.</p><p>“Suzerain Lucan,” Jema said, dropping a fast curtsey. “I apologize in advance for my lord.”</p><p>“She apologizes before he messes up.” Samantha leaned over. “Now might be a good time to learn how to do that.”</p><p>“On your behalf, or my own?” he countered.</p><p>“You.” Thierry stopped in front of the table and pointed at Lucan. “You are a ruling lord now. What do you imagine that means?”</p><p>Lucan stroked his chin thoughtfully. “I can have you thrown out of here, or into the dungeon – if I had a dungeon – or–“</p><p>“It means that for once in your miserable life, you have responsibilities,” Thierry snarled. “I send my only child here for sanctuary, so that he might rest and make peace with himself, and what do you do? You nearly have him killed by a mad old Kyn and her army of revenants.”</p><p>Lucan glanced at Samantha. “I suppose I did.”</p><p>“You admit it?” Thierry roared, pounding the table with his fist. “To my face?”</p><p>“But of course.” He rose to his full height, which put him on the Frenchman’s eye level. “We have so little in the way of proper entertainment for visiting Kyn. I thought slaying a monster would do the boy some good. I’ll have you know that he had a marvelous time and wishes to visit us again next Christmas.”</p><p>Before Thierry could respond, Jamys said, “He is right, Father.”</p><p>“Jamie?” Thierry whipped around and peered at him. “Did you just – my God.”</p><p>He strode across the room and enveloped him in his arms. “Do I dream again?”</p><p>“No, Father,” he told him. “I can speak. What shall I say?”</p><p>“Father.” He cupped his face between his trembling hands. “Say it again. Please.”</p><p>“Father.” He smiled. “I love you.” </p> </body></html>"]