["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter 1</p><p>Two explosions rocked Deputy U.S. Marshal Brian Simmons on August 15 at 4:32 in the afternoon: the first was the sight of his perennial wet dream, Layla Creed; the second was the detonation of a launched grenade.</p><p>Brian heard the whistling of the approaching explosive a second before the projectile hit one of three Chevy Suburbans waiting to transport Layla from a safe house to the Baltimore/ Washington airport. Lunging forward, he tackled her to the ground, shielding her with his body with only seconds to spare.</p><p>The blast radiated from the point of impact, sending a surge of heat roiling over them. The shock wave jolted her slender body and he curled around her, clutching her tightly. The ringing in his ears was deafening, dulling the sound of Layla’s screams. But he felt them. Felt them vibrate against him.</p> <p>Shrapnel rained down. Fire licked at the soles of his shoes. He scrambled to his feet, pulling her up and hauling her back into the apartment building. His ears felt as if they were stuffed with cotton, his focus narrowed by the instinctive need to get Layla to safety.</p><p>Layla.</p><p>Withdrawing his service weapon, Brian steered her with a firm grip on her elbow. They bypassed the elevator and slipped into the stairwell. He glanced up, momentarily considering the viability of returning to the room she’d occupied the night before. Then, he pulled her down toward the subterranean garage.</p><p>The safe house had been compromised. At least two deputies had lost their lives, one of whom was a friend he’d known for years. He wasn’t certain who he could trust, and with Layla in the crosshairs, he wasn’t taking any chances. Hard-driving possessiveness pushed him forward. She kept up; her fingers linked tightly with his as they thundered down the stairs.</p><p>They burst through the metal stairwell door into the garage. A forest green Honda was backing out of a parking spot to their left and Brian stepped behind it, withdrawing his badge and identification from his pocket.</p> <p>He met the gaze of the female driver who gaped at him through her rearview mirror. “I need you to get out of the car, ma’am.”</p><p>A harried-looking brunette climbed out from behind the wheel, her widened eyes on his Glock. She held both hands up, her purse dangling from the bent crook of her elbow.</p><p>He holstered his weapon and handed her his business card. “Call that number and they’ll get you squared away.”</p><p>Grim-faced, Layla slid into the passenger seat without prompting.</p><p>Brian was pulling out of the garage when the wail of sirens announced the arrival of the local authorities and fire engines. He could see the black plume of smoke as he hit the freeway on-ramp.</p><p>Chapter 2</p> <p>Layla gripped the edge of the Honda’s passenger-seat cushion and glanced at the man she hadn’t seen in the flesh in five long years. He looked different than he did in her dreams. Harder. Leaner. Still dangerous. A person would have to be nursing a death wish to face off with Brian Simmons.</p><p>Which hadn’t stopped her from giving him her virginity ...</p><p>“Are you hurt?” He glanced at her, cutting straight through her with his crystalline green eyes.</p><p>“No. Wh-what about—” She cleared her dry, aching throat. “Sam? The others?”</p><p>He shook his head.</p><p>Jesus. Her stomach knotted so tightly she thought she might be sick. Sam Palmer had become a friend over the last three years she’d spent in the Witness Security Program. Beyond his job, the inspector had become her lone tie to reality. His monthly phone calls to check up on her had become the only reminder that she was still Layla Creed underneath her assumed identity of Layla Cunningham.</p><p>She used to live a normal life. She used to live in the same town she’d been born in and have friends who knew her well enough to put up with her pining over the man sitting just inches away from her now. She’d lost it all that fateful weekend she partied in Tijuana, trying to prove to herself that she was truly over Brian Simmons.</p><p>Pulling a cell phone out of his pocket, Brian hit a speed-dial button.</p> <p>“We’re hot,” he said without preamble to whoever answered the phone. “They hit the convoy with a fucking grenade launcher.”</p><p>In the midst of a nightmare, Brian’s low-pitched and faintly husky voice was soothingly familiar. She dreamed of that voice, remembered it groaning with pleasure and biting out raw, heated sexual words. He was a vocal lover and his openness made her shameless. She’d had no inhibitions with him, no reservations or hesitation. Nothing to shield her heart from a man who lived to be in the line of fire.</p><p>He could have died today, right in front of her. The biggest nightmare of all.</p><p>“No,” he went on. “I’ll have to get her out of town another way ... I can’t do that either. Someone leaked the safe house. I don’t know who to trust ... I can guarantee she had nothing to do with word getting out ... It’s Layla, Jim. Yeah, that Layla. Listen—I need a favor. Take everything you need out of the Bronco, toss what body armor and camping gear you can spare in the back, and head over to the gas station on Main and Seventh. Leave the keys in the ashtray and go for a walk ... Thanks, man. I owe you.”</p><p>He ended the call.</p><p>Layla blinked through her tears. She didn’t ask any questions. If there was anyone on earth she trusted with her life it was Brian. It was the way he took care of his own hide that had led to their breakup.</p><p>They pulled into a retail store parking lot. He took a spot in the very back, near the garden center, and dropped the keys in the ashtray and closed it. Then he popped the battery out of his cell phone and tossed the separate pieces on the backseat. As if on cue, Layla’s cell began to ring. She wriggled it out of the small backpack-style purse she wore and handed it to Brian, who waited with his hand held out.</p><p>As he disassembled her phone, he said, “There’s a bank inside. We both need to pull out the maximum amount we can from the ATM. When we leave, we’ll be traveling on cash to California—gas, food, lodging, the works—and we won’t be able to pull out more. We’ll need to grab clothes and toiletries while we’re inside, and we need to be quick.”</p><p>She nodded, briefly examining the crushed sunglasses in her bag before discarding them in the center console. “Are we hiding from the good guys, too?”</p><p>“For now.” He tossed her phone onto the rear seat beside his. “Let’s go.”</p><p>Layla climbed out of the car with a racing heart. Her palms were damp and her breathing shallow. When she rounded the trunk, he caught her by the hand and set off at a brisk pace. They entered the store and it felt like every eye was on them. Her ears were still ringing, whether from the explosion or her own thundering blood, she didn’t know. Her grip on him tightened.</p><p>Giving her a reassuring squeeze, Brian leaned in close. She saw the words on his lips more than heard them. “It’s okay, baby. I’ve got you.”</p><p>He’d said the same thing to her while she’d quaked with her first orgasm, his breath humid against the slick folds of her pussy. A shiver accompanied the memory, still so vivid despite the years that had passed. He pulled free of her grasp and draped his arm over her shoulders, careful to keep the loose tail of his unbuttoned flannel shirt over his holster.</p><p>“You’re in shock,” he murmured with his lips to her ear, sending another tremor through her body. “Just hang on to me.”</p><p>The warmth of his leanly muscled frame sank into her side and she soaked it up, her arm wrapping around his waist. He wore Dr. Martens and loose-fitting jeans with a super-soft white jersey T-shirt. His green, tan, and aqua flannel was so attractive she would have stolen it if they were still together.</p><p>Brian got a shopping cart and led her through the store with swift efficiency, thinking of everything from underwear and toothbrushes to disposable cell phones and two small wheeled suitcases. They separated briefly, standing across the aisle from one another while she grabbed clothes and he picked up razors. They were in the checkout line in less than twenty minutes. The ATM was next, where they withdrew a collective fifteen hundred dollars. They exited out the front entrance instead of through the garden center, and he stopped by a bench near the main doors to cram most of the clothes in one carry-on and the rest of the items in the other.</p><p>“We’re going to cross the street to that convenience store.” He reached for the packed bags, but paused, studying her. Whatever he saw caused him to straighten and reach for her. He cupped her nape in one hand, her hip in the other, and pulled her close. Their foreheads touched. “You’re being so brave, baby. I’m proud of you.”</p><p>Her eyes stung. “I’m not a little girl anymore, Brian.”</p><p>“Believe me, Layla. I know that.” Releasing her, he dug two baseball caps out of the bag and slid one onto her head. His fingers sifted through the dark tresses draped over her shoulders, as if he couldn’t help himself. “When we get to the car, I want you to change your shirt and tie up your hair.”</p><p>“Okay.”</p><p>He grabbed the bags and set off, heading in the opposite direction of the Civic he’d commandeered. They made their way across the street, his stride smooth and easy, but she knew he was sharply focused on their surroundings. He was always alert, but he was inclined to be hypervigilant with her. Not just because she was a protected witness, but because she was his best friend ’s younger sister and the woman he’d once loved.</p><p>He walked directly to a beat-up Bronco parked off to the side of the convenience store and tossed the bags through the lowered rear window. “Hop in.”</p><p>When he slid behind the driver’s seat, he handed her a body armor vest he’d pulled out of the cargo space.</p><p>They were back on I-70 in less than five minutes.</p><p>Brian took the cap off his head and tossed it on the floorboard behind Layla’s seat. She was already pulling her Henley off, as comfortable in her own skin as any woman had a right to be. As she bared a tealcolored lace bra that perfectly matched her irises, he could barely keep his eyes on the road.</p><p>“So the guy whose car this is,” she began. “A deputy? Or a SEAL?”</p><p>“Can’t he just be a civilian?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not with you. You live and breathe the job—on duty and off.”</p><p>Which was why she’d left him. “Deputy.”</p><p>She dug into the plastic bag of clothes he’d set between her feet. “What do we do now?”</p> <p>Now that they were on the move, his tension eased up a fraction, although he knew he wouldn’t be fully relaxed until after Layla testified. Looking over, he saw the bullet-hole scar on her back and the rapidly bruising flesh on her elbows from when he’d tackled her to the ground. His teeth grit again. “We’re going to drive straight through to San Diego. Fourteen hours a day on the road will get you there on time. I know that’s not going to give you much opportunity to go over your testimony with the assistant U. S. attorney.”</p><p>“Well . . .” She exhaled harshly and straightened. “Missing witness prep is better than death.”</p><p>Fucking understatement of the year, but so like her. The daughter and sister of Navy SEALs, she’d been raised to be a straight shooter. The day she’d turned eighteen she had marched right up to him at her birthday party and tossed a gauntlet at his feet—Teasing’s over, Bri. Put out or get shut out. I’m not hurting for dates.</p><p>Prior to that day, he’d told himself to wait a little longer. Let her go to college, spread her wings. He knew once he had her, their future together would be cemented for both of them. She’d be his and he would be hers ’til death parted them.</p><p>But faced with the possibility of seeing her with other guys, laughing and playing and fucking other guys ...</p> <p>His hands tightened on the steering wheel. “Tell me what happened.”</p><p>She glanced at him, then yanked a new shirt over her head. She slid the vest on over it with impatient but practiced movements. “What are you talking about?”</p><p>“Tell me how you got into this mess.”</p><p>Sitting back, she put her seat belt on. “Steph and I headed down to Rosarito and Tijuana for spring break. She hooked up with this dude she met at Papas and Beer, and since she was drunk and hellbent on getting it on with him, I had to stick with her. I wasn’t going to let her take off with some strange guy all by herself. So he rounded up a friend of his and we climbed into a Camaro and headed back up to TJ.”</p><p>Fighting to relax his tautened jaw, he bit out, “You fucking know better!”</p><p>“What’s the problem, Deputy? Living dangerously only applies to you?”</p> <p>“Don’t even try to compare reckless partying with the job I do.”</p><p>Layla stared out the passenger-side window, frustration vibrating from her slim body. Her feelings about what he did for a living had broken them apart. He understood that losing her father and brother had set her against the military, so he’d finished out his naval service and arranged to stay stateside by joining the Marshals Service. She hadn’t liked it, but she’d tolerated it. Until he joined the Shadow Stalkers.</p><p>“Go on,” he said tightly.</p><p>“Why? So you can get your kicks out of treating me like a kid?”</p><p>“Layla.” He shoved a hand through his hair. “I can’t help how I react when you’re in danger.”</p><p>She glanced at him with those cool eyes that turned him inside out. “Now you know how it feels.”</p><p>Brian took the hit. He’d made the worst mistake of his life thinking she’d come around eventually and take him just as he was. Instead she’d been shot and absorbed into WITSEC before he knew what hit him. It was the worst irony that she’d joined his world, and instead of bringing them closer together, it had taken her further away from him than ever.</p><p>“We made it back to TJ,” she continued. “We were near the border—not too far from that town square with the mechanical bull—when we slowed for a turn. These two guys stepped out of the shadows and lit us up. It seemed like we were getting shot at from all sides. The guy who’d joined us at the last minute fell out of the passenger side and I squeezed out after him. That’s when I got hit. He did, too. He threw himself over me, but I think they wanted him alive, because they stopped firing. I think he knew they’d stop for him and that’s why he did it. To save me . . .”</p> <p>Her voice had softened with every word until the last was hard for him to catch.</p><p>“He was the undercover DEA agent? Sandoval?”</p><p>Layla nodded. “Ricardo Sandoval. Although I didn’t know that until later. The gunman standing above us . . . I remember looking up at him over the barrel of a semiautomatic and seeing a sick glee on his face.”</p><p>“Angel Martinez.” It was her testimony against Martinez—one of the cartel’s most prominent lieutenants—that endangered her life. They would not have risked the offensive they’d taken today, on American soil, for anyone less.</p><p>“Yes. Martinez. Agent Sandoval swung at his thigh with a knife he had. Blood spurted everywhere and Martinez dropped like a ton of bricks. The other shooter started firing again, but the shots were wild. It was chaos with Martinez hollering. Sandoval dragged me around the back of the Camaro and into an alley that emptied into another street. Some guys speaking English were partying nearby. I screamed at them for help. They turned out to be marines from Pendleton and they got us back to the border. Agent Sandoval d-died later that night.”</p><p>Sandoval’s murder had been nationwide news when it broke—the blatant attack had hit a nerve first struck by Enrique Camarena’s torture and killing by the same cartel. Layla had been the “unidentified witness” referenced in the reports. Although Brian had heard the story before, listening to Layla tell it, hearing her voice crack and tremble as she spoke ... Fuck it all, she should have been with him, would have been, if he hadn’t been so goddamn stubborn.</p><p>“You still have nightmares, baby?” he asked quietly.</p><p>She looked at him, brushing her wind-whipped hair out of her face. “How did you know?”</p><p>“I know you.” He reached out and caught up her hand. “You hold your pain close to the chest.”</p><p>Her gaze dropped to their joined hands. “So do you,” she said quietly.</p><p>Brian didn’t know if she was referring to her brother Jacob’s death or their breakup. “Sometimes.”</p><p>“I’ve seen you laugh and I’ve seen you spitting mad, but I’ve never seen you cry.” She pulled away. “When I told you we were over, you didn’t even blink. I should have seen that coming. I was too young and naïve, I guess.”</p><p>His fist clenched, his palm aching from the loss of her touch. His damn pride had gotten in the way before, and it was clogging his throat now, preventing him from saying words that would slice him open if she threw them back in his face.</p><p>Still, he had to say, “You knew what you meant to me, Layla.”</p><p>“I knew it wasn’t enough. We had Jacob and great sex in common. That was it.”</p><p>“Bullshit.” He checked his mirrors for the millionth time, canvassing for trackers. “The sex was great because we had something special.”</p><p>“Then why didn’t you come after me when I left?”</p><p>There it was. Colossal fucking mistake number one. “I thought you needed a little time to cool off.”</p><p>“No,” she argued, setting her elbow on the windowsill and her head in her hand. “You thought I needed to grow up. That I’d eventually see things your way, which just goes to show what a mistake we were. I’m always going to be Jacob’s kid sister to you. I grew tits and reached the age of consent, but you were never going to treat me as a woman who deserved a say.”</p><p>“You’re starting to piss me off.”</p><p>“Hitting too close to home?” she taunted, with a sly smile that made his dick hard.</p><p>“No, sweetheart. You’re way off base.” At least in regard to the way he felt about her. Yeah, the sex between them had always been white-hot—in that aspect of their relationship, they’d never had any trouble—but he loved her, too. So much it ate at him. There were times in the last few years when he’d been half-insane with the need to see her and hear her voice, to hold her and feel her hands on him.</p><p>Silence fell between them, thick with all the things that needed to be said. With every mile that passed, he was taking her closer to the point where he’d lose her again. Once she testified, she’d get sucked back into WITSEC. A new identity, new location and occupation, a new inspector to check on her. He had three days to clear things up and fix everything that was fucked up between them. Three days to remind her of how good they were together. She was a captive audience, with no one around to screw things up for him.</p><p>Except himself. Unfortunately, he could do that well enough on his own.</p><p>Time was racing away from him, but that didn’t stop him from sitting there with his jaw locked shut and his gut churning. Scared shitless by the possibility that she was over him by now. She had grown up since he’d let her walk away, while he was the same guy he’d been before—rough around the edges and unable to say how he really felt about the most important thing in his world.</p><p>Chapter 3</p><p>I’m going to head over to the diner and get us something to eat.”</p><p>Layla arched a brow at the brooding, impossibly sexy man standing by the motel room door.</p><p>One motel room. With one king-sized bed.</p><p>Outside in the parking lot, there were so few cars or rooms with lights on that it was obvious the motel had a room available with two beds.</p><p>He met her gaze with a defiant scowl, knowing damn well what she was thinking. “What do you want?”</p><p>“Looks like you already made that decision for me,” she shot back dryly.</p><p>“To eat,” he grated.</p><p>Him, for starters. But she wasn’t going to let him off easy. He could have at least been subtle enough to get two beds, even if she was a sure thing.</p><p>They both knew they wouldn’t be able to keep their hands off each other when they were alone. Especially not while they were getting stripped down for showers and there was a bed nearby. In their present situation, while they were on the run and people they’d respected had paid with their lives, they were going to need each other more than ever. And time was so short. She had less than seventy-two hours with the man she’d loved for as long as she could remember. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She toed off her running shoes and pulled her shirt over her head. When she heard him inhale sharply, she hid a smile in the folds of the cotton. “A cheeseburger and fries would be great, with an unsweetened iced tea. I’m going to grab a shower while you’re out. And don’t forget to order a cot from the front desk. It’s too bad they were sold out of double-bed rooms. Those rickety rollaways are especially uncomfortable for men your size.”</p><p>The door closed behind him with more force than necessary.</p><p>Laughing softly, Layla propped one of the suitcases open on the luggage rack she pulled out of the closet. She paused in the act of digging a razor out, her gaze caught by a box of condoms and personal lubricant. She whistled.</p> <p>She knew him. Knew how he worked.</p><p>Brian Simmons was arrogant and well aware that he was her weak spot, but getting her into bed wasn’t about getting laid. If sex was all he was after, he could pick up someone at the diner. If he set his mind to it, he could have a woman against a wall before his food got cold. He was hot as hell and radiated dark sex appeal, but what really drew the chicks like flies was the dangerous remoteness about him. Brian was a real-life American antihero and he was impossible to pin down, which only made women want to try harder. God knew she’d tried.</p><p>But the same couldn’t be said in reverse—Brian knew how to get to her. He knew how to strip her defenses until she was wide open to him, and that’s certainly what he’d been thinking about when he was picking up such optimistic items. The pleasure wasn’t the goal; it was a means to an end.</p><p>Her consolation was that when she was laid bare, he willingly opened himself to her in return. In bed, inside her, was the one place where he gave her all of himself. She wished he would take those risks with her in the real world. That’s all she’d ever wanted.</p><p>Tossing the condoms on the bed and the lube in the nightstand drawer, Layla headed into the bathroom and closed the door. With the click of the latch, her shoulders drooped, taking her by surprise. Her chest grew tight, the moment of privacy revealing how vulnerable she really was, something she’d suppressed all afternoon without realizing it. Grief and regret rushed over her like an avalanche. She stumbled into the shower stall, her head bowing beneath the hastily turned on water. Tears flowed. Her chest shook with sobs. Gripping her lower lip in her teeth, she stemmed the sounds that would have betrayed her fragility.</p> <p>It would be so easy to turn to Brian, to fall apart on him and take the comfort he would give her without reproach or hesitation. But they both needed her to be strong now. She couldn’t distract him. He was one man transporting a witness who was supposed to have a half dozen of the Marshals Services’s top deputies keeping her safe. Shadow Stalkers they were called. Special ops deputies who most often hailed from military special forces like Brian did.</p><p>It was his acceptance into the Shadow Stalkers that had broken them apart. After losing her father and brother to military service, she’d been determined not to lose Brian, too. He’d led her to believe that leaving the Navy was a new road for him, but it hadn’t been a safer road; not after he volunteered to be a Shadow Stalker. She couldn’t forgive him for what she’d thought at the time was a monumental deception and callous disregard for her concerns.</p><p>When she returned to the bedroom, Brian was back. The room smelled like tasty greasy food and he was glaring at the turned off television with his hands on his hips. He’d ditched his shoes and his flannel, leaving him in jeans and a fitted T-shirt, with his holster strapped around his shoulders.</p><p>Layla paused midstep, her uplifted hands stilling in the act of scrubbing her hair dry with a towel.</p><p>It struck her abruptly: she felt safe.</p><p>He couldn’t know what that meant to her. Feeling safe was a comfort she’d thought she’d lost forever that night in Mexico. And yet the sight of him, so strong and confident, so determined, made her feel like nothing could get to her. Anyone who wanted her would have to get through Brian first and she couldn’t see that happening.</p> <p>He gestured at the condoms in the middle of the mattress, his green eyes hard as jade. “Contrary to what you might think, I wasn’t planning on fucking you tonight.”</p><p>“I could tell.”</p><p>“Smart ass.” He rubbed the back of his neck. “I don’t want you sleeping alone tonight. You’ve had a rough day. The inspector you’ve been talking to for years died in front of you. I know you, sweetheart. You can’t just shrug that off. You’re hurting and you’re bottling it up.”</p><p>Her throat tightened and she shook her head, warning him away from a topic that would lead to more tears.</p><p>He stepped closer. “I want to hold you, keep you warm, make sure you feel safe. I’m not going to let anything happen to you, Layla.”</p><p>She swallowed hard. “I know. Right now, that’s the only thing I know for sure.”</p><p>Before she knew it, she was in his arms, held tight against him. Burying her face in the soft cotton jersey of his shirt, Layla breathed him in—the warm, clean scent of virile male. Brian wasn’t a cologne kind of guy; just soap, antiperspirant, and natural pheromones, which did a number on her every time. Her reaction to him was instinctual and primal, as if she’d been hardwired to seek out this one man, the only one who made her feel as if she was right where she was supposed to be.</p><p>Layla dropped the towel in her hand. Her hands fisted at his waist, gripping both his shirt and belt loops. As always, she felt like she was hanging on to him with a death grip, trying to stave off the inevitable separation. Even when he’d been hers, she’d never really felt like she had all of him. His job owned him first and foremost, and eventually she’d realized that if she made him leave it behind, the loss would alter him in a fundamental way. She couldn’t ask that of him. He had to make that decision for himself.</p> <p>And he had.</p><p>The job won.</p><p>Exhaling in a rush, she released him and stepped back. His arms fell away reluctantly, loosening the towel she’d secured around her torso with a tuck between her breasts. She barely caught it before it parted and fell. Brian sucked in a sharp breath and turned away, displaying a restraint she wouldn’t have expected from the Brian of old.</p><p>“You need to eat.” He dug into a large bag and pulled out a foam container. He peeked inside it, then grabbed a napkin and some plastic utensils.</p><p>Layla watched as he set a rudimentary place setting for her at a small round table by the window. The blackout drapes were drawn tightly together, shielding them from view of any passersby. She grabbed a fresh change of clothes and donned them in the steamy bathroom before sitting down to eat.</p><p>“What did you get?” she asked.</p><p>“Burger. Same as you.”</p><p>She chewed a fry thoughtfully, her gaze moving to the bed and the condom box.</p><p>“They were near the razors,” he muttered. “I didn’t go out of my way looking for them.”</p><p>Layla managed to repress the smile wanting to escape. His surly moods always brought her amusement. He was the type of guy for whom most everything just rolled off his back. The only thing capable of knocking him off his game was her. “God bless stores with convenient layouts.”</p><p>He growled and ripped off a bite from a burger that was easily twice the size of the one she had. Brian wasn’t a fan of breakfast, but he more than made up for it with the amount of food he ate the rest of the day.</p><p>“Aren’t you going to join me?” she asked sweetly.</p><p>His gaze narrowed suspiciously, but he snatched up his food and came over, pulling out the chair opposite her and sinking into it with movements that were inherently graceful. She’d always loved to watch him in motion, loved to watch the way his muscles bunched and lengthened with sleek fluidity.</p><p>“You look great, Bri.” Her voice was low and warm, prompting her to take a quick drink of her soda to cover the slip. Letting him know she still loved him would be a mistake. They had even less of a future now than they’d had before.</p><p>He stilled midchew. Swallowing, he said, “Thanks. So do you.”</p><p>She offered a shy smile and resumed eating.</p><p>“So . . .” he began. “What have you been doing the last few years? Have you been in Maryland the whole time?”</p><p>“Pretty much.”</p><p>“Do you like it?”</p><p>She shrugged. “It’s all right. Nothing like SoCal.”</p><p>“No,” he agreed. “Are you still studying interior design?”</p><p>She shook her head. She hesitated, then took a deep breath before elaborating. “Criminal justice.”</p><p>His brows rose and he studied her over the lip of his cup. She knew he was thinking of how big a change that was. He might even be wondering if it might tie into his and Jacob’s former plans to start their own private security firm. Their dream wasn’t one she had shared beyond her anticipation of having the guys home more often, but she’d grown to love it since joining WITSEC. In a way, it kept her connected to Brian and her brother.</p><p>“Are you happy, Layla?” he asked softly.</p><p>“I’m not unhappy.”</p><p>“Are you seeing anyone?”</p><p>Layla washed her food down with a leisurely draw on her straw. “Shouldn’t you have asked that before you bought the condoms?”</p><p>“Damn it.” Brian dropped his half-eaten burger onto his fries. “You’re not going to let it go, are you?”</p><p>“Sure. I’ll drop it.”</p><p>“Thank you.” He shoved three fries into a pile of ketchup, then pushed them into his mouth.</p><p>“But about the lube—” She blinked innocently when he erupted into coughing. “You gotta admit, that’s pretty personal. And ambitious. It’s one thing to rekindle a little fun in the sack, but anal sex, Bri? I’m sure you’ve known women who serve that on the main menu, but that’s a chef ’s table item for me.”</p><p>“Layla.” He pushed back and stood.</p><p>“You really should eat,” she admonished. “You’ve got to keep up your strength. We’re on the run after all, and you’ve got some serious mattress gymnastics planned.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fuck it.”</p><p>“Yeah, I got that from the lube—”</p><p>“Shut up.” He walked to the bed, grabbed the box of condoms, and tossed them across the room into the trash can. Digging into the suitcase carrying the toiletries, he searched for the personal lubricant.</p><p>She watched him. She ate her burger and fries. And she got hotter by the minute. He was seething, so damn passionate in his aggravation and embarrassment. She’d rarely seen him like this out of bed.</p><p>“Where is it?” he barked.</p><p>“If I promise to be a good girl and stop picking at you, will you come back and eat?”</p><p>“Don’t patronize me!”</p><p>“I’m sorry.”</p><p>He held up a hand to ward off any further words.</p><p>“Really,” she pressed. “Can I help it if I want to see if I can still get under your skin?”</p><p>“As if you ever got out from under it.” He pointed an accusing finger at her. “Don’t look so damned shocked! I’m not the one who split us up.”</p><p>“Aren’t you?”</p><p>“No, damn it. I’m not. I was in it for the long haul.”</p><p>Layla shook her head, her own ire rising. “’Til death do us part doesn’t add up to much when you can be dead any minute.”</p><p>“Don’t.” He stalked closer, vibrating with all the emotions he was usually so adept at leashing. “It’s five years later, baby. I’m still breathing.”</p><p>“Only because we’re not together. If you haven’t noticed, men don’t live long around me.”</p><p>Brian stopped two steps away. “You can’t be serious.”</p><p>She shrugged and closed the lid of her box, her appetite gone. “Your food’s getting cold.”</p><p>“If you’re a death sentence, that meal on the table isn’t the last thing I want to eat.”</p><p>Standing, she went to move around him.</p><p>He caught her arm.</p><p>“I’m tired,” she lied, achingly conscious of his grip and proximity. The top of her head was level with his shoulder. She wanted to turn into him and hold him again. Fear held her back. The fear that she wouldn’t have the strength to part from him again when the time came, which was only a couple days away.</p> <p>Pressing a quick, hard kiss to her forehead, he released her.</p><p>She brushed her teeth, then climbed into bed. Brian gathered up what he needed and headed into the bathroom to shower. She feigned sleep when he slipped between the sheets and curled up behind her. Soaking up his warmth and the comfort of his embrace, she finally shut off the horrible images in her mind and drifted off.</p><p>Chapter 4</p><p>Layla’s soft cry of distress woke Brian a moment before she jerked violently in his arms.</p><p>“Baby,” he murmured, jostling her carefully. “Wake up. It’s okay.”</p><p>Her short nails dug into the forearm he had draped over her waist. She gasped and turned into his chest, burying her face against his bare skin.</p><p>“It’s okay,” he said again, running his hands up and down her spine to soothe her trembling. “I’ve got you.”</p><p>She pushed him to his back and climbed over him, clinging to his torso like a crab.</p><p>“Wanna talk about it?” he asked quietly, glancing at the clock on the nightstand. It was just past two in the morning.</p><p>“No,” she mumbled into the crook of his neck. “Just hold me.”</p><p>“Always.” He hugged her tight.</p><p>Wriggling over him, Layla got more comfortable. The position notched her pussy directly over his cock, the heat of her flesh burning through her boy-short underwear and his boxer briefs. His dick responded despite his strenuous efforts to keep it in check. When it came to Layla, he’d never been able to control his reactions to her—bodily or otherwise.</p><p>He knew the moment she became aware of his hard-on. She tensed slightly, her breathing hitching a moment, before continuing with a cautious tempo that was obviously considered.</p><p>“Ignore that,” he said.</p><p>Instead, she rolled her hips, stroking herself with the hard length of his cock. With her lips to his skin, she whispered, “It’s too big to ignore.”</p><p>Her tongue flicked over his throat and he cursed, his body tightening.</p><p>“Layla . . .” he warned.</p><p>Her hands slid down the sides of his chest to his waist. “Here’s a tip, tough guy: You’re about to get laid.”</p><p>Christ. Brian’s eyes squeezed shut. He wanted her so badly his teeth ached with it, but adrenalized by a nightmare wasn’t the state of mind he wanted her in when they finally went at each other.</p><p>But Layla wasn’t the kind of woman to be deterred, especially when it came to sex. And when she slid down his body and her teeth scraped lightly over the flat disk of his nipple, Brian lost the will to deny her.</p><p>Her tongue licked over the sensitive flesh and he jolted with a grunt.</p><p>“Watch it, baby,” he growled. “You know what it’s like with me when it’s been a while since I’ve had you.”</p><p>She wouldn’t have forgotten. He’d sometimes been overseas on a mission for months at a time. When he came home to her, she knew to have a cleared schedule and the kitchen stocked, because they wouldn’t be leaving his house for days.</p><p>“God, you’re sexy, Brian,” she said with a low moan and unmistakable note of resentment. “I get wet and needy just looking at you.”</p><p>And he was apparently going to pay for that. The way she reached between them and squeezed his erection wasn’t tender or tentative. It was firm and demanding. The stroke of her palm up and down was quick and forceful.</p><p>“Just thinking about you does it for me,” he said gruffly, startled when she lifted off him and slid out of bed.</p><p>“Get naked.”</p><p>Her sharp order had his blood raging. She’d been a virgin the first time he’d had her and that first encounter had set the tone for their sexual relationship—he led, she followed. That was the way he liked it—and she as well—but he was more than willing to let her have some fun. Shit, he was very willing. “Bring it on, baby.”</p><p>As he lifted his hips and pushed off his boxer briefs, Brian heard her undressing. The lamp on the nightstand rattled as she bumped into it, but she was too focused to complain. Focused on him. On fucking him.</p><p>He’d never seen her like this. When it came to Layla, he was easily seduced. A heated glance or a coaxing, “Brian, honey . . .” was all the encouragement he required to have a rock-hard dick and a spurring impatience to find some privacy. But right now, she was running the show and going full throttle, and he was going to let her—for a little while—and just enjoy the ride.</p><p>Layla returned to him in a rush of silken limbs and warm, soft woman. His woman. The only thing in the world he’d ever felt truly belonged to him. And he’d let her walk away. Because he had shit for brains. No man in his right mind would have let that happen.</p><p>He tried to catch her, to kiss her, but she was sliding lower, her beautiful perfect tits caressing his abdomen the whole way down. Reaching up, Brian fisted each side of his pillow, wishing the light was on so he could watch her suck him. There was something in her eyes when she gave him head, a softness and vulnerability that flayed him open. They connected when they were intimate with each other, in a way he’d never known was possible until she had shown him. He couldn’t explain it—the way her pleasure became his own, the way his joy made her happy, the way the need to touch and taste became as necessary as breathing. He just knew that he’d lost the ability to be happy when he lost her, that he had stopping living and just barely managed to make it through each day without her.</p><p>She gripped his throbbing cock in her hand, her slender fingers not quite able to surround him. Her partial clasp was a torture all its own and he groaned, so thick and sensitive he knew he wasn’t going to last long. She pumped him a few times with her fist, priming him, bringing the first drops of pre-cum to the tip. The moment her tongue licked across the engorged crest, he cursed.</p><p>“I’ll let you play, sweetheart,” he bit out, as her breath blew hot over the dampness she’d left behind. “But now’s not the time to tease.”</p><p>Her fingers massaged his balls, gently tugging at their tautened weight. “You’re the one who says it’s no fun when you rush.”</p><p>“Who’s rushing?” Gripping her by the hair, he arched his hips and nudged her lips with the crown of his dick. “I’ll be fucking you’til sunrise.”</p><p>Brian felt the little shiver that moved through her. Once they took the edge off, they’d settle in for a slow, deep ride. She knew how it would be. The intensity. The intimacy. The unbearable pleasure. He couldn’t wait to get there. He’d been dying in slow degrees ever since she took that away from him.</p><p>She touched the back of his thigh. “Spread your legs and bend this knee. Let me get comfortable.”</p><p>“You won’t be down there long enough to get uncomfortable. You’re just going to ease me back a bit, so I don’t bruise your tight little pussy on our first go-round.”</p><p>He swore he could feel her smile. And then her sassy mouth was engulfing him and his head pressed back into the pillow, his gut knotting from the heated pleasure. “Fuck, yeah.”</p><p>Layla took him deeper, her mouth so hot and tight he spurted a wash of pre-cum over her wicked fluttering tongue. She moaned and swallowed, sucking hungrily for more.</p><p>“That’s it, baby,” he said hoarsely. “Suck my dick . . . Ah, God.”</p><p>Eyes closed and teeth clenched tight, Brian’s mind spun from how damn good it felt. Her head lifted and lowered, her lips sliding slickly up and down, her fist pumping him at the root. As if she was starved for the taste of him.</p><p>The pressure in his balls increased when her mouth drew hard on his cockhead. Her fingers left his scrotum, sliding lower, the pads of her index and middle finger stroking over the pucker of his ass.</p><p>He tensed in surprise. Her hand withdrew, her lips curving around his cock.</p><p>“Witch,” he hissed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Layla’s tongue swirled around the sensitive crest, making his teeth grind. His spine was rigid with the need to come, his stomach so taut he felt like he couldn’t move. Shit, he didn’t want to move. If he could hang on to the edge forever, so damn ready but still able to hold off, he would. There was nothing in the world like the pleasure she could give him or the love he felt in every touch, kiss, and moan she gave up to him.</p><p>“So good.” He groaned. “You suck me so fucking good . . .”</p><p>Her fingers returned between his parted legs, once again teasing the tight ring of muscle, her touch now slickened with what he quickly realized was the missing lube. Her head rose and fell faster, her mouth working his aching cock in what he was sure was a deliberate attempt to distract him from the pressure for entry she was applying.</p><p>“Layla, baby, what are you doing?”</p><p>She released him with a pop. “You bought the lube; you can’t tell me you didn’t want some anal play.”</p><p>She knew damn well his ass wasn’t what he’d had in mind, just as he knew that this was his punishment for excessive optimism in buying the lube to begin with. Neither of which mattered, because he’d always give Layla anything she needed.</p><p>Brian pushed out, as he’d taught her to do when accepting his cock in her rear, and the slim tip of one finger slipped inside him. Instantly, sweat misted his skin. He forced himself to relax, to give her no resistance while she explored a new aspect of their lovemaking.</p><p>Chest heaving, he absorbed the feeling of penetration and the vulnerability that came with it. Layla took his cock in her mouth again, sucking the head with delicate pulls, her finger pulling out and then pushing back in.</p><p>“Ah, Christ.” His neck corded tight with strain. His thighs began to quiver.</p><p>He gasped when she pushed a second finger inside him, the slight burn sending a violent shudder through his frame. She rose to her knees, her hair falling over his hips, her mouth sucking in a greedy, demanding tempo. Her fingers moved in and out, fucking his ass.</p><p>“Damn it, Layla. You’re shredding me.” The shock and instinctive recoil he felt was tempered because it was Layla who touched him. She was already so deep inside him, so much a part of him, that ceding the intimacy to her was a natural extension of that connection. It also felt surprisingly good. Without conscious thought, both of his knees fell wide, encouraging more forceful thrusts of her hand.</p><p>“I’m going to kill whoever taught you this,” he bit out. “String him up and castrate the motherfucker. Ah . . . shit, baby. I’m gonna come. Slow down.”</p><p>The sounds filling the room—her vibrating moans and his tortured growls, the voracious suckling and the rhythmic thudding connection of her knuckles to the lower curve of his buttocks—were driving him insane. His dick was so hard it hurt, his balls drawn up tight and full. She owned him, possessed him completely, and he felt his surrender burn through him like a fever.</p><p>“I’m gonna come hard,” he warned hoarsely. “Ease up, baby. Now. Ah . . . fuck! ”</p><p>She’d found his prostate. Rubbing the gland swift and hard, she threw him over the edge.</p><p>Mindless with the savage, wrenching pleasure, Brian cried out and climaxed violently, his hands in her hair, his hips bucking. His head slammed back into the pillows, his eyes and jaw squeezed shut, his spine so stiff he thought it might break.</p><p>He pumped her mouth full and couldn’t stop, years of pent-up lust and longing exploding from his aching dick with a force that felt ripped from his vitals. Her hungry moans made his head thrash; her greedy swallows barely kept up. Her evil fingers still worked his ass, coaxing every drop from him until he collapsed into the mattress.</p><p>Dripping with sweat, he forced his cramped fingers to release their grip on her hair. She gave one last hard suck, then straightened. In a distant part of his ecstasy-dazed mind, he heard her pad to the bathroom and run the sink. That short distance between them was too much. He needed her next to him, with him, where he could hold on to her and never let go again.</p><p>“Leave the light on when you come out,” he said gruffly. “Keep the door cracked.”</p><p>Layla stepped into view a moment later, naked and flushed and so damn beautiful his heart thudded painfully in his chest. His dick twitched, a response that shouldn’t have been possible after the orgasm that just shattered him, but wasn’t totally unexpected with her. He’d been built for her, designed to please her. As long as her hot little body was hungry for cock, his body was ready to give it to her.</p><p>“Come here.” His arms lifted to embrace her. “Kiss me.”</p><p>She draped her body over his. The moment their lips touched, Brian rolled her beneath him, his head angling to form a tighter seal. His tongue thrust in slow and easy, stroking alongside hers, gliding over the soft recesses. She quivered and moaned, surrendering, her body going lax and pliant beneath his. He pushed a thigh between hers, finding her pussy slick and swollen. She’d always gotten off on his pleasure. Because she loved him. He knew she loved him still or she couldn’t have touched him so intimately. But that didn’t mean she loved him like she used to, with her heart and soul, and not just because of fond memories and the connection they’d shared through Jacob.</p> <p>Lifting from her, he bent his head and caught a hard, peaked nipple in his mouth. He groaned at the feel of her on his tongue, the joy of having her close, the relief from the constant ache he’d lived with the last five years of his life.</p><p>Layla bit her lip and whimpered as Brian’s tongue curled around the tip of her breast. The vibrations of his groan sent ripples of sensation skipping across her nerves. She arched her spine, fisting her hands in the bottom sheet. His skin was hot and damp to the touch, his scent sifting through her mind like intoxicating smoke.</p><p>From the time she was sixteen, she’d been drawn to his clean masculine smell. Her primal attraction to him had ultimately exposed her love to her brother. Jacob had caught her sleeping in one of Brian’s shirts and he tore her a new one. It was Brian who told him to lay off, waving her thievery aside as if it was just aggravating kid sister shit. But he’d shot her a look that gave him away, a look that revealed a tempered hunger that made her ache. She’d known then that he was aware of her the way she wanted him to be—as a woman.</p><p>The next two years of waiting to turn eighteen had seemed endless. Just as the last five had.</p><p>“Brian.” She touched his broad shoulders, stroking over the lean flexing muscles with a soft hum of delight.</p><p>He bit lightly on her nipple, the tip elongated by his suckling. Nuzzling his way across her chest, he paid the same focused attention to her other breast, plumping the swollen flesh with his large callused hand. She was barely a handful, but he worshipped her tits as if they were the best pair on the planet.</p><p>“You’re so beautiful,” he praised, squeezing her hip before sliding lower. “I’ve dreamed of having you like this again . . . hungered for it until it gnawed at me. Your body is like food and water to me, Layla. I can’t live without it.”</p><p>She closed her eyes, fighting back tears and words she couldn’t afford to say.</p><p>When he slid between her thighs, she opened to him as he’d opened to her. Not just to take pleasure, but to give it. Knowing the sounds she made, her unrestrained reactions to his touch soothed something ferocious inside him.</p><p>Brian draped her leg over his shoulder, his lips kissing their way down her inner thigh to the tender flesh clenching in emptiness. She’d felt empty for so long. So lonely and alone.</p><p>She had walked away from him because she’d needed to be the one that left, instead of the one that was always left behind. She knew she couldn’t survive another official car pulling up to her house, carrying men bearing the news that someone else she loved was gone forever. She had cut the tie first, but she’d paid the price. She was still paying it.</p><p>He pressed a soft kiss to her clit, then massaged it with the pointed tip of his tongue.</p><p>“Later,” she said, staying him.</p><p>His head lifted, his gaze meeting hers. His smile was wolfish, but it faded. Whatever he saw on her face, he knew what she needed.</p><p>He came over her in a rippling display of gorgeously delineated biceps, washboard abs, and long thick cock. Biting her lip, she slung one leg over his hip, wanting him inside her more than she wanted to live to see another day. A soft sound escaped her when she felt the wide crest part the slick folds of her pussy.</p><p>“Shh, baby. I’ve got you.” Brian cupped her buttock, canting her slightly, making it easier for her to take the first hard inch.</p><p>Heat flared across skin, flushing her.</p><p>“So pretty,” he murmured, pushing deeper. “I love the way you blush when I slide into you. And, God . . . I fucking love the way you feel. So tight and hot. So slick. Your cunt gets so wet for me.”</p><p>She lifted her hips, needing faster and deeper. “Hurry.”</p><p>His gaze was on her face, tender and searching. “Didn’t we already talk about rushing?”</p><p>“I need you in me. You can slow down once you’re there.”</p><p>“You’re tight as a virgin, Layla.” He slid a fraction deeper, his eyes darkening as her pussy rippled greedily. “You feel like you did the first time I had you.”</p><p>Turning her head, she pressed her hot cheek into the cool pillowcase. She’d tried starting a relationship with someone else, gave it her best shot and stayed with great guys longer than she should have. But after a couple years of trying her damnedest, she’d given up. She was hurting men who didn’t deserve to be hurt and she was hurting herself.</p><p>Brian caught her face in both hands. “Open your eyes, Layla.”</p><p>Her neck arched as he withdrew a little bit, then pushed deeper.</p><p>“Look at me,” he coaxed. “Let me watch you take my cock.”</p><p>Her lids lifted. She watched him, too. Watched his skin tighten over his cheekbones, watched the pleasure cross his face like the sweetest agony. He worked into her with slow easy drives, holding her gaze as the connection deepened. Tugging him closer with her legs, Layla lifted as he bore down, the pleasure hot and drugging. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The leisurely penetration felt like a deep inner massage and she moaned. “Brian, please . . .”</p><p>His tongue followed the curve of his lower lip, his look so fiercely sexual she trembled with the force of her desire. “There,” he purred, rolling his hips and pushing home. He stroked in and out, then pushed his torso upright. “You’ve got all of me.”</p><p>God, how she wished that was true.</p> <p>With her legs draped over his thighs, Brian looked down between them. “I’ve dreamed of this. Dreamed of filling you again. So many damn times.”</p><p>His thick cock pulled free to the crest. The vein-corded length pushed back into her, stretching her deliciously. His raw, serrated groan of pleasure made her come.</p><p>“Oh!” She trembled violently as the climax hit her. “Brian.”</p><p>“Yeah,” he growled, holding her hips and pounding through her orgasm, driving deep and hard. His head bent to her breast, his mouth surrounding an aching nipple and working it with his tongue, his hands keeping her still as his cock shafted her convulsing pussy with savage hunger.</p><p>She clung to his wrists and fought for breath, the mattress squeaking under the ferocity of his thrusts, her body quaking with the violence of her pleasure.</p> <p>“Me, too, baby.” He gasped. “Ah, shit . . . me, too.”</p><p>He crushed her against him, his hips grinding against hers as he emptied his seed deep inside her.</p><p>“Layla.” He gripped the sides of her head and rubbed his cheek against hers. “Layla.”</p><p>Closing her stinging eyes, she held on as tightly as she could.</p><p>Chapter 5</p><p>Showered, dressed, and standing over the bed, Brian woke Layla with a gentle tug on her ear with his teeth.</p> <p>“Put it away, stallion,” she muttered, clutching tighter at the pillow in her arms.</p><p>He laughed, his love for her a purring beast in his chest. “I’ve got a hot bath waiting for you. I’m going to grab something to go from the diner, make a couple calls, then gas up the truck. I should be back in about thirty minutes, then we’ve got to hit the road.”</p><p>“What time is it?”</p><p>“Seven thirty.”</p><p>“Oh, man . . .”</p><p>He smacked her ass through the sheets. She’d never been a morning person. On nights like the one behind them, she usually didn’t roll out of bed until after noon. “You can sleep in the car.”</p><p>“How can you be awake right now?” she groused. “I’m dead.”</p><p>“Sex with you is invigorating. You keep me going.”</p> <p>“Don’t remind me.”</p><p>For all her complaints, when he pulled the sheet back and trailed his lips along the curve of her back, she moaned with pleasure and arched into the contact. The bruises on her elbows were darker than they’d been the day before, reminding him of how fragile she was.</p><p>“Be a good girl,” he whispered against her skin, “and I’ll reward you later.”</p><p>One bloodshot eye opened and glared at him. “You owe me.”</p><p>“I’ll pay. Gladly.” Brian straightened and backed away from the temptation her sleep-soft naked body presented. He’d fucked her for hours, finally managing to pull away from her when sunlight peeked around the edges of the blackout drapes. But he still had so many nights to make up for. He’d had little appetite for sex since she left him and it felt as if every hunger that had been dammed up behind his heartache was breaking loose. “Don’t forget to pack the lube.”</p><p>She held up a hand, revealing the bottle clutched in her fist.</p><p>The smile on his face fled the moment he left the room. Before he walked away, he made certain the latch was firmly engaged. The morning was cool and gray, with a slight nip in the air. With a baseball cap pulled down low over his forehead, he kept a careful surveillance of his surroundings. He took a weed-riddled path through a copse of trees to the strip mall up the road, where he’d parked the Bronco. There, he bought a newspaper from a coin-operated stand in front of a grocery store and looked for any signs that the vehicle had been staked out. Digging one of the disposable cell phones out of his pocket, he called Jim.</p><p>“Hey,” the deputy answered. “You all right?”</p><p>“So far. How are things on your end?”</p><p>“They’re not looking at me for anything, so you’re still clean with the car. But you’re the lead person of interest, of course. Your mug has been sent to every law enforcement agency across the country. The heat is on, my man.”</p><p>“I can take it.” He’d expected it. He had survived the blast and taken off with the witness. To call that suspicious would be an understatement. “Thanks, Jim.”</p><p>“Take care. I won’t breathe easy until you get to San Diego.”</p><p>“You and me both.”</p><p>Brian ended the call and dismantled the phone. Then he pulled out another one and called the assistant U.S. attorney in San Diego to assure her that Layla Creed would appear on the witness stand as scheduled. He made the call short and to the point, despite the groggy AUSA’s valiant efforts to get more details out of him. He took that phone apart, too, and as he passed a parked pickup truck, he tossed the pieces in the bed. Then he drove the Bronco to a gas station and back to the motel, where he grabbed some foil-wrapped breakfast burritos and coffee from the adjacent diner.</p><p>When he returned to the room, he found Layla packed up, bathed and dressed, and falling asleep at the small table under the window. He loaded the suitcases into the truck, then came back for her.</p><p>“Ready?” he asked.</p><p>“Yep.” She pushed to her feet, slapped a hat on her head, and set her hand in his. She’d pulled her dark hair back into a ponytail, showing off the slender neck he loved to run his lips over. She wore jeans and a T-shirt with body armor over the shirt, and his flannel from the day before over that. Call him a caveman, but he loved the idea of her wearing his scent. Loved that she’d always wanted to and still did.</p><p>He’d backed into the parking spot in front of the motel room and left the passenger door open. Keeping Layla between the vehicle and himself, he escorted her to the car, then rounded the back end of the Bronco and climbed behind the wheel. He headed straight for the highway.</p><p>“Thanks for this,” she said, referring to the unzipped sleeping bag he’d set on the floorboard. She dragged it up to her neck and snuggled into it.</p><p>“Recline the seat. Take a nap. If you’re hungry, there are egg, bacon, and salsa burritos in the bag. Coffee with way too much cream and sugar—just the way you like it—is right here.”</p><p>Instead of looking at the cup he pointed to, Layla kept on looking at him. “Are you okay?”</p><p>He took a sip of his overly hot black coffee. “After last night? I’m better than okay. I haven’t felt this good in years.”</p><p>“Liar.” Her exhale was audible. “What is this going to do to your career, Bri? How much trouble are you going to get into for this?”</p><p>“I’m not worried about it.” Not absolutely true, but mostly so. He’d invested a lot in his job. Shit, he had lost her over it. But that old argument between them had been about his life being on the line. Now, they were talking about hers. There wasn’t anything he wouldn’t sacrifice to keep her safe.</p><p>“I am.”</p><p>“Don’t be.” He glanced at her. “The only thing you need to be concerned with is following my directions.”</p><p>She nodded, but still looked troubled. He wasn’t worried about her making his job harder. She knew the drill and she was an intelligent woman. She might give him a hard time about everything else, but when it came to his job and her safety, she’d do what needed to be done.</p><p>Silence followed, but when he looked at her, she was still watching him.</p><p>“Tell me about your dream last night,” he said.</p><p>She shook her head. “It was morbid.”</p><p>“I don’t care. It might do you good to talk it out.”</p><p>“I doubt it.” Her lashes lowered over her eyes. “Just remember you asked for it.”</p><p>With a sigh, she began. “You died in the car bombing. Everyone died except for me, and I was screaming at your corpse, telling you I’d known it would happen. That I knew you’d leave me behind. I was so mad that out of all people to be the sole survivor, it had to be me.”</p><p>“Jesus,” he breathed, feeling like he’d been punched in the gut.</p><p>“I’m sure I had that dream because I was so damn happy to see you yesterday. I stepped out of the safe house and saw you and . . .” Her eyes fully closed on a harsh exhale. “I was too happy. You were running toward me and I thought it was for a different reason at first. Then, everything blew up and you hit the ground face-first at my feet. And I couldn’t cry about it, because I was too pissed off at you.”</p><p>Brian rolled his shoulders back, remembering the wounded animal noise she’d made while asleep.</p><p>“As you can see, I have issues,” she muttered, snuggling deeper into the sleeping bag.</p><p>Layla may have been ticked off at him in her dream, but the way she’d externalized her emotions wasn’t with anger. She had reached for him and held on as if she would never let go. Then she’d seduced him. Shredded him. Stripped him down to nothing but his need for her.</p><p>“It’s okay to be pissed off at me, baby,” he said. “I’m pissed off at myself. I shouldn’t have let you walk away.”</p><p>“It was for the best. We were both strong enough to break it off when we needed to.”</p><p>“Stubbornness isn’t strength. It’s fucking stupid. Living miserably without each other is stupid.”</p><p>“Have you been miserable, Bri?” She was looking at him again; he could feel it. “You asked me if I had anyone in my life, but you never said if you did.”</p><p>Glancing at her, he said, “You know better than to ask me that.”</p><p>“Because it’ll just make me jealous? I’ll get over it.” Her face gave nothing away. That was new for her. She’d once been so expressive, so open. But she’d been innocent then and life had dealt her some painful blows. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“There’s nothing to get over.”</p><p>“Still lovin’ and leavin’ ’em?”</p><p>He caught her gaze and held it. “No.”</p><p>Her lush mouth twisted wryly. “Sorry. Fuckin’ and leavin’ ’em?”</p><p>“No, damn it.”</p><p>“Fine. Don’t tell me. But don’t expect to interrogate me. It goes both ways, Bri.”</p><p>“Really?” he said grimly, his muscles hard with building anger and barely tempered jealousy. “Did you save your body for me, baby? Did you think of me at night and get yourself off? Were your fingers—maybe some toys—the only things to fuck that sweet, hot cunt of yours, because damned if you’d let another man touch what’s mine?”</p><p>“Ha!” She straightened. “As if you spent the last five years jacking off to memories of me. Jacob told me all about you, Bri. Tried to warn me off of crushing on you with stories of your many, many conquests. You can’t keep it in your pants.”</p><p>“Did those stories make you hot?” he purred, pissed off that she didn’t give him the credit he damn well deserved. “You sure asked about them often enough.”</p><p>“Fuck you.”</p><p>“Only you.”</p><p>Layla shut up, her open mouth snapping closed. She glared at him.</p><p>“Say you don’t believe me,” he coaxed darkly, reaching between his legs to rub his palm over his cock.</p><p>“You’re a crazy-assed motherfucker if you’re serious.” Her voice was clipped and hard. “You sure found it easy enough to let my golden pussy get away.”</p><p>“Letting you go was a lot of things, but easy sure as hell wasn’t one of them.”</p><p>“At what point did you realize you’d made a mistake?”</p><p>He breathed in and out carefully, trying to rein in his temper. “The instant before you walked out the door. I knew I couldn’t live without you.”</p><p>“But you did. For two years before that trip to Mexico screwed up my life.” She sat up and reached for her coffee.</p><p>“We hooked up before you had a chance to grow up. I felt like I’d pulled you straight out of high school into a marriage-like situation and you hadn’t had the opportunity to get your bearings or really figure out what you wanted.”</p><p>“Always trying to make all the decisions for me, because I’m just a kid.”</p><p>“What the fuck? I tore my heart out giving you the opportunity to make all the decisions you wanted.”</p><p>“And who made the decision that I needed those opportunities?” Putting the coffee down, she dug into the bag for a burrito and dropped it into his lap, then grabbed one for herself.</p> <p>“I’m not hungry.”</p><p>“I decided you are. Eat.”</p><p>Brian cursed under his breath.</p><p>“I knew what I wanted, Bri—you. I knew there wasn’t another man in the world for me. I didn’t want to check out the scenery or waste time that could be spent with you.”</p><p>“Then why did you leave?” Keeping one hand on the wheel, he used his teeth to rip the foil wrapping off the burrito.</p><p>“You know why.”</p><p>“And you knew what I did for a living when we started.”</p><p>“You lied to me when you joined the Marshals Service.”</p><p>“Bullshit.”</p><p>“You never said anything about volunteering for the Shadow Stalkers!” She tore a chunk out of the burrito with violent gusto.</p><p>“I was qualified.”</p><p>She chewed angrily, then washed down her food with a large swallow of coffee. “You were also qualified as a security expert.”</p><p>He put the burrito down. Starting his own firm had been a dream he’d shared with Jacob. After his best friend died, Brian felt as if the dream had died, too. He couldn’t imagine going forward with the endeavor without Jacob on board. “Things changed.”</p><p>“You didn’t. You’re an adrenaline junkie with a hero complex.”</p><p>“And a big dick,” he lashed out, stung. “Don’t forget that.”</p><p>Her gaze bore into him. “Truth hurts, doesn’t it?”</p><p>“Your pussy doesn’t seem to mind.”</p><p>She flipped him off and resumed eating, canting her body toward the window.</p><p>He’d wanted to at least have a dialogue about his work with the Marshals Service Special Operations Group before she tossed out her ultimatum, but she’d said the discussion should have been held before he volunteered for SOG and she wasn’t staying with a guy who had a death wish.</p><p>“What about your painful truths, Layla? Your fear of abandonment kept you from trusting me. You were always laying out ultimatums, with the proof of whether or not I loved you hanging in the balance. You were always waiting for some excuse to say I wasn’t going to stick around after all.”</p><p>“And you gave it to me, didn’t you?”</p><p>“Look for something hard enough, you find it, whether it’s really there or not.”</p><p>Shrugging, she said, “People have baggage. When you love someone, you deal with it.”</p><p>“I was dealing with yours. You’re the one who couldn’t deal with mine.”</p><p>“You know what?” Layla pivoted on the seat to face him. “I don’t know why we’re talking about this. It really boils down to the fact that our personal issues conflict. What you require to be happy is exactly what makes me unhappy and vice versa.”</p><p>“And the fact that I need you and you need me?” he challenged. “What about that?”</p><p>“What about it? In forty-eight hours or so, I’m going to disappear and you’re going to face whatever the hell you’re going to face for going rogue with a witness.” With a sigh, she faced forward again. “We’ve been trumped by fate, Bri. Consider it a blessing. God knows we’re too stupid to stay away from something that’ll never work.”</p><p>Maybe, he thought savagely. But stupid or not, he wasn’t giving her up again without a fight.</p><p>Chapter 6</p><p>They holed up for the night in Joplin, Missouri. The motel Brian chose was cheap and in need of serious updating, but Layla was so relieved to get off her ass that she didn’t care. She stumbled into the room and collapsed on the bed face-first, pointing her toes to stretch out her legs.</p><p>She heard Brian bring the suitcases in and sighed with gratitude, eager to take a hot shower.</p><p>“What do you want for dinner?” he asked, his hand wrapping around her ankle and squeezing.</p><p>“A salad with grilled chicken or fish. Nothing fried. I can’t keep eating crap while sitting on my butt all day. I’m starting to feel icky.”</p><p>“Good call. I’ll be back in a bit. You know the drill.”</p><p>“Yes. Don’t answer a knock at the door, even if it’s you.”</p><p>He closed the drapes before leaving the room and Layla crawled off the bed. She repeated her preparations from the night before, wondering as she pulled out another disposable razor if Brian was thinking at all about the box of condoms they’d left in the trash in the other motel.</p><p>Condoms were something they’d never used. She’d always been on the pill and they’d both been too addicted to the feeling of total connection to put a barrier between them, not to mention how spontaneous they were. He probably thought she was still on birth control.</p><p>She wasn’t. What was the point when she wasn’t having sex?</p><p>Remembering his assertion that he’d been celibate since they broke up, Layla felt a surge of guilt. She’d taken lovers after they’d broken up. Enough to prove what she had always suspected—no other man would ever make her feel like Brian did. She’d found men who were similarly attractive, men who had dark and ravenous appetites, men with experience and the patience to make sure she had a good time. But sex was just sex without love, no matter how good it was. She’d never gotten over the feeling that she was in bed with the wrong guy.</p><p>She took a long, leisurely shower. She shaved her legs smooth and rubbed the motel’s complimentary lotion into her skin. Anticipation thrummed through her veins, along with the steady flow of adrenaline brought on by their circumstances and the desperation of knowing they were only two days away from losing each other again.</p><p>When she left the bathroom, she found Brian sprawled on the bed in just his jeans. He’d freed the buttons on his fly and sat with his back against the headboard and his bare feet crossed at the ankles. Holding the remote in one hand and a bottle of water in the other, he was watching the news until she came out. When he looked at her, his eyes became dark and hot with want.</p><p>“Feel better?” His voice was low. Rough.</p><p>Layla soaked up the sight of him. His chest was tanned from his daily shirtless runs, the broad expanse covered in a light dusting of hair that tapered into a thin line bisecting washboard abs. His arms were a work of art, the ripped biceps flexing when he lifted the water to his lips and drank deeply. His throat worked with each swallow, making her body tighten with need. She was starved for the feel of him.</p><p>He was so damn sexy. Deliciously powerful and virile.</p><p>She nodded.</p><p>“What are you thinking about, sweetheart?” He licked a drop of water off his lower lip.</p><p>“How bad I want your mouth on my pussy.”</p><p>His low growl made her nipples hard. He came off the bed in an agile rush of movement. “Eat your dinner while I grab a shower. Then, I’ll eat you.”</p><p>The look he gave her made her nipples hard.</p><p>His gaze lowered to her chest as he approached and stopped in front of her. “I’ve been thinking about licking your mouthwatering cunt since you stopped me last night. I fantasized about pulling over at a rest stop, dragging you into the back of the Bronco, and tonguefucking you until you screamed.”</p><p>“Brian.”</p><p>He pushed his hand into her panties and cupped her. “Umm . . . you’re hot and juicy already.”</p><p>Her legs parted at his urging, her heart racing. He was such a highly sexual man and unashamed of his needs. His lack of inhibition turned her on and drove her crazy. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She gripped his biceps as he parted her with his fingers and stroked over her clitoris. Her knees went weak. Her breathing was shallow and fast. His fingertips circled the clenching opening of her pussy, then two long fingers pushed inside her.</p><p>“Oh God,” she whispered, welcoming his penetration with a hot rush of moisture. She returned the favor, reaching into his open fly and down the front of his boxer briefs. His cock fell heavily into her waiting palms, the plush head already slick with pre-cum.</p><p>He caught her leg with his free hand and urged it up to his waist, opening her to his touch. His fingers withdrew, then thrust deep, making her back arch on a gasp.</p><p>“How many times have we done this, baby?” he purred, pushing his cock into her grasping hands. “How many times did you need to come so badly I’d have to find the nearest corner and finger-fuck you to orgasm?”</p><p>“Not enough.”</p><p>“It’s never enough.” He pumped his hand, working her with scissoring fingers and deft twists of his wrist. His thumb found her clit and massaged it, taking her to the edge of climax. “God, you’re so beautiful. You make my chest ache.”</p><p>Layla jacked his cock with both hands, using the fast, firm grip she knew he liked.</p><p>“You’re so wet.” He groaned. “I’m dying to taste you. And you’re so close to making me come . . .”</p><p>“No.” She stilled, giving him one last firm squeeze.</p><p>“Layla!” he protested, curling his fingers to rub her G-spot.</p><p>“When you come, you come inside me.”</p><p>His green eyes narrowed dangerously a second before he bent his head and took her mouth. His kiss was softer and sweeter than she expected, lush and hot and leisurely. It was his kiss that kicked off her orgasm.</p><p>Her moan drifted into his mouth. Her pussy trembled around his fingers and her hands tightened convulsively on his cock.</p><p>He hissed, jerking in her grip. “You’re killing me.”</p><p>But he kept on thrusting gently, drawing out her climax until only sweet aftershocks remained. She leaned into him, breathing hard, relying on his support to keep her standing.</p><p>“I’ve got you,” he murmured, nuzzling his cheek against the crown of her head. Releasing her leg, he caught her around the waist and drew her close.</p><p>“Shower later.”</p><p>“I have stubble, sweetheart. I need to shave.” Brian backed away. His face was flushed, his eyes feverish with lust. “I want you naked when I come out.”</p><p>She was already stripping before he stepped into the bathroom. As she heard the shower come on, Layla grabbed her salad and crawled between the cool sheets. Needing to slow her raging heartbeat, she picked up the remote from the nightstand and turned on the television. A few channel switches later, she found a showing of Navy SEALs.</p><p>She started watching, her thoughts drifting to why a man would choose such a life. Jacob had chosen it because of their father, who had chosen it because of his father. But Brian never really had an answer to that question. He didn’t have those family traditions. He’d been raised by a single mother, who never told him who his father was. When Layla had asked him why he’d joined the military, he’d shrugged and said, “What else was I going to do?”</p><p>But he was good at everything, from fixing transmissions to masonry to cooking. He could have done anything with his life that he wanted to.</p><p>“You’d better eat quick,” he warned, when he turned the shower off. “I’m about to pounce.”</p> <p>Layla hit the mute button and feigned a loud snore.</p><p>“Ha! I know how to wake you up.”</p><p>“Bring it on.”</p><p>When he stepped out of the bathroom in all his naked glory, she felt her heart stop. Tears welled and blurred her vision. She dashed them away with impatient swipes, unwilling to lose even a second of the sight of him.</p><p>“God,” she breathed, loving him so much her chest was tight with it.</p><p>He paused near the bed, letting her look her fill. He was leaner than she’d ever seen him, which told her he was working too hard, but his body was perfect in every way regardless. There was nothing she’d change about him, nothing more she could want. She closed her to-go box and set it on the nightstand without looking away.</p><p>Brian caught the edge of the sheet and tugged it down, revealing her body in slow increments. “I feel the same way when I look at you,” he murmured. “Like I can’t catch my breath. Like I can’t blink, in case you disappear when I do.”</p><p>He saw her. Truly saw her and who she was, knew her and cared about her with all her history and flaws. After feeling invisible for years, hidden behind a name and life that wasn’t really hers, it meant so much to be with someone who got her. It meant the world to be with Brian now, during the most dangerous and stressful period of her life.</p><p>He set his palms down on the mattress, then his knees, crawling toward her in a luscious display of masculine strength and agility. His cock hung heavily between his legs, making her tummy flutter in anticipation. Her toes curled when he kissed the arch of her foot. His parted lips slid up to her ankle, his hand reaching for her other foot and squeezing.</p><p>“Brian?”</p><p>“Yeah, baby?”</p><p>“Come here.”</p><p>His dark head lifted, his gaze snaring hers. “No.”</p><p>“I’m not stopping you,” she said huskily. “I just want to hold you a bit first.”</p><p>He exhaled, then climbed over her, stretching out beside her.</p><p>She rolled into him, burying her face against his chest. His skin was still damp and cool, his heartbeat sure and strong. His arm draped over her and she tilted her head back, pressing tiny kisses to his clean-shaven jaw, so damn grateful for the opportunity to hold him in her arms again.</p><p>“Layla . . .” His voice was low and hoarse, with an aching note of yearning.</p><p>Even with a raging hard-on and her willingness, he’d taken the time to shave his evening stubble so as not to scratch her. He was always thinking of her, in both big and small ways. Always ready to give her whatever she needed.</p><p>Except when it came to his job.</p><p>“Make me understand,” she whispered. “Why is it so important to you to risk your life?”</p><p>Brian stiffened, then rested his chin atop her head with a sigh. “It’s not that.”</p><p>“What is it, then?”</p><p>“I don’t know. I’ve thought it over so many times. Lying in bed without you, wondering where you were, if you were okay, wondering why the hell I didn’t just say to hell with the fucking job when you gave me the choice.” His hands stroked down the curve of her spine.</p><p>She closed her eyes and nuzzled closer. “It gives you something I can’t. Something you need.”</p><p>“I don’t need anything as much as I need you.” He pushed her to her back and loomed over her. His thigh slid between hers, his weight settling atop her in the way that always made her feel safe and cherished. “That’s what shreds me, that you’d ever believe I could love anything more than you . . . that I ever gave you a reason to think that.”</p><p>Putting her fingers to his lips, Layla cut off anything else he might say. He nipped her fingertip with his teeth, the slight sting sending a quiver through her. His tongue flicked over the tiny hurt, his gaze unwavering on her face.</p><p>“Grab on to the pillow,” he said gruffly. “Don’t let go.”</p><p>She reached up and did as he ordered, the position arching her back and lifting her breasts to his waiting mouth. He licked her nipple, and she made a soft noise of pleasure.</p><p>His breath blew softly over her skin. “I love the sounds you make.”</p><p>“I love the way you touch me.” As if she was the most precious thing in the world, as if her pleasure was the only thing that mattered.</p><p>“Then I won’t stop.”</p><p>Wet heat surrounded the sensitive point of her breast as he took her into his mouth. His cheeks hollowed on a soft, slow suck that radiated through her body. Her head fell back and she moaned. “Yes . . .”</p><p>Her pussy spasmed with jealousy. His hand cupped her other breast, kneading, his thumb and forefinger rolling and tugging her tight, sensitive nipple.</p><p>Her back arched, her lips parting on panting breaths. It felt as if she was being touched for the first time in years. The sensations were too fierce and hot, too vivid compared to the numbness she’d lived with since she left him. “God, Brian . . .”</p><p>His tongue lashed the tender tip of her breast, the drawing pulls of his mouth echoing in the throbbing between her legs. She pressed her pussy against him, slickening his skin with her desire, riding the hard muscle in an effort to ease her aching to be filled.</p><p>“You make me so hot,” she breathed.</p><p>Sweat misted her skin. She felt almost sunburned, her flesh so sensitive it was nearly painful. When Brian’s mouth moved to her other breast, she cried out, the surfeit of sensation intoxicating her. He sucked harder, his teeth grazing with just enough pressure to make her shudder.</p><p>Her fingers were cramping by the time he slid down between her thighs. She draped one leg over his shoulder; the other fell to the side.</p><p>“So pretty,” he praised, parting her with his fingers. He flicked her clitoris with his stiffened tongue and she lifted to his mouth, seeking more. “And so sweet. I’m going to eat you for hours ... make up for all the times I hungered for the taste of your pussy and you weren’t there.”</p><p>“Bri, please . . .”</p><p>“That’s it, sweetheart.” He licked through the saturated folds with a low groan of pleasure. “Beg me. Let me hear you.”</p><p>Cupping her buttocks, Brian lowered his head and worked her clit with massaging rubs of the flat of his tongue. Her hips circled, grinding her trembling flesh against his firm lips. He traced her folds with slow, teasing glides, then rimmed the clenching opening to her pussy until she whimpered from the torture of it.</p><p>“Don’t tease me,” she whispered, so tense it hurt. “Make me come.”</p><p>“Not yet.”</p><p>“I’ve waited five years. Don’t make me wait anymore.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I won’t be done,” he warned.</p><p>Layla bit her lip, writhing beneath him. “Please.”</p><p>Gripping her hips, he fucked her trembling pussy with rapid thrusts, his head tilting to deepen his reach. It was a fervent, wrenching kiss, his hungry growls making her hotter and wetter. The slick sounds of his avid mouth against her drenched sex were searingly erotic. Her hips churned, her pulse pounding in her neglected clit.</p><p>His plunging tongue felt so good she couldn’t control the ferocity with which she bucked into the rhythmic penetration. The pleasure was too much, her love for him too powerful, his love for her too evident and fierce.</p><p>Brian moved with a groan, his lips surrounding her clit and suckling, licking, pushing her into an orgasm that shattered her.</p><p>Chapter 7</p><p>No more.” Layla pushed weakly at his head.</p><p>“One more time,” Brian whispered, tonguing her swollen clitoris. “Just once more, baby.”</p><p>He had lost count of how many times she’d come, but it could never be enough to satisfy him. His dick was pounding in demand for its turn at her slick, scorching cunt, but he held himself in check, needed her pleasure more than he needed his own.</p><p>With patient coaxing, he brought her to orgasm again, his groans muffled in the folds of her soft, sweet pussy as he fucked her rippling depths with his tongue. Her cries were low and hoarse, her perspiration-damp body trembling with exhaustion.</p><p>As he pulled away, her leg slid heavily off his shoulder, her body lax and replete. She was vulnerable now. Open. Almost where he needed her to be.</p><p>She curled on her side as he left the bed, her eyes on the thick stalk of his raging erection. She licked her lips. “I can suck you off.”</p><p>He reached for the nightstand drawer.</p><p>A tiny whimper escaped her.</p><p>“You’re soft and relaxed now,” he soothed, gripping the lube in his fist. “You don’t have to do anything. You don’t even have to move. I’ll take care of everything.”</p><p>“Brian . . .”</p><p>“We need this, Layla. You know we do.”</p><p>He watched the goose bumps sweep over her skin. She turned, lying prone, and he joined her on the bed, running his parted lips down her spine. “I can’t tell you how often I dreamed of this ... how many times I woke up hard and aching.”</p><p>Grabbing a pillow, Brian slid one arm under her slim hips and lifted her, pushing the pillow beneath to cant her body to just the right angle.</p><p>Layla’s hands fisted in the bottom sheet, her chest rose and fell with swift breaths. “You’ll kill me . . . I can’t take this. Not now.”</p><p>He squeezed a line of lube in the seam between two of his fingers and a larger dollop on his fingertips. “You know it has to be now.”</p><p>She shivered when he touched the pucker of her ass, the tight ring of muscle flexing. He rubbed in slow, gentle circles, willing to be patient. He knew what this act did to her, how much of herself she gave when he took her this way, how exposed and defenseless she felt. She’d shown him by example last night, made him experience in the flesh what he’d thought he understood in his mind.</p> <p>“No one else has been here, have they, baby?” he asked softly.</p><p>Her lower lip quivered.</p><p>“You’re still mine, aren’t you, Layla? Just as I’ve always been yours.”</p><p>“Brian, please ... I can’t bear it.”</p><p>One fingertip pushed inside her, and she gasped. Her slender body shook.</p><p>He slid in and out, twisting his wrist. After a moment, another digit joined the first. She whispered a curse. Her hips began to move in tiny circles, seeking the pleasure of his touch.</p><p>She hissed when he pressed a third finger into the tightly stretched opening.</p><p>“You’re so damn tight.” He groaned when she clenched around his thrusting fingers. “And scorching hot.”</p><p>“Oh God . . .”</p><p>He pulled free of her clinging depths and filled his palm with lubrication. He stroked his cock from root to tip, squeezing the thick pulsing length, imagining how damn good it was going to feel once he got inside her. More than the raw physicality of the act, it was her surrender that turned him inside out. He ceded to her in many ways, couldn’t help himself from wanting to see to her happiness, found it almost impossible to say no to her, but in this one demand of his, she yielded completely.</p><p>If he’d needed proof that there was still an emotional wall between them, her token resistance was it. She’d never denied him anything, especially not in bed. But she was vulnerable now—weak from pleasure and falling for him all over again. After her expressionless face yesterday, he could finally read her tonight and he knew this was it—his chance to reach her, to make her feel his need and regret and pain. To feel the longing for her that was eating at him from the inside.</p><p>Brian gentled her quivering with a hand at her hip. Taking himself in hand, he ran the wide head of his cock up and down between her cheeks, teasing the flexing opening. With a sharp inhale, she pushed out, accepting him. He pressed forward, sliding into her, growling at the heat and damn near unbearable tightness.</p><p>Her exhale was shaky. “Brian . . .”</p><p>“I’m right here with you,” he said hoarsely, sliding deeper. “It’s tearing me up, too, baby. Killing me . . .”</p><p>Layla pushed back with her hips, taking him halfway. She was stretched tightly around him, clenching rhythmically. The pleasure was stealing his sanity. He could barely breathe through it. Sweat coursed down his chest and back, his hands trembled like a junky’s, his mouth was so dry he could hardly swallow.</p><p>Reaching around and beneath her, Brian cupped her cunt, groaning at how wet and swollen she was. He pushed deeper into her rear, his fingers penetrating her pussy at the same time.</p><p>“Fuck,” he bit out, feeling himself through the thin membrane between his fingers and cock. He struggled against the need to come before he was fully inside her.</p><p>She clawed at the sheets. Cries spilled from her throat, soft sounds of desperate hunger. Her legs slid farther apart; her ass lifted to take him deeper.</p><p>“That’s it,” he praised. She opened, and his cock slid in to the root. “There, baby. Right there.”</p><p>“Bri . . .” Her voice broke.</p><p>Withdrawing his fingers, he yanked the pillow out from under her and tossed it aside. He caught her around the waist and rolled them as one, adjusting them so that he was spooned behind her, still deep inside her. His biceps cushioned her cheek, his other arm was slung over her waist. He linked his fingers with hers, holding their joined hands against her taut stomach, anchoring her in place as he began to thrust.</p><p>Layla felt herself unraveling ... falling to pieces ... and she couldn’t stop it. She shook uncontrollably, as naked as she would ever be, her arousal so fierce and wild it frightened her with its power. It writhed beneath her skin, fighting to be freed.</p><p>Brian was everywhere—behind her, around her, inside her body and her mind. His chest heaved against her back. His skin was feverishly hot and wet with sweat, sealing them together.</p><p>She needed him so much. Too much. Needed his ferocity and hunger, which made her feel how deeply he needed her in return.</p><p>His hips pulled back, dragging the furled underside of his cockhead across hypersensitive tissues. The sensation was agonizingly exquisite, coaxing her to arch her buttocks against him to reclaim more of the stretching fullness.</p><p>“Easy, baby.” His voice was made gruff by his raging lust. “Nice and easy.”</p><p>He pushed back into her. The slow, sure glide ensured she absorbed every nuance of the penetration. The feelings of possession and dominance.</p><p>Her head fell back against his shoulder. The slight pain of his entry was its own pleasure. She clenched around the invading hardness, her body desperate to hold him as he began to withdraw again.</p><p>“Fuck, yeah,” he growled, spurting a scorching wash of pre-cum inside her. “Keep squeezing me like that. You feel so good, Layla. So good . . .”</p><p>She moaned, her hand sliding downward to her pulsing swollen clit. He moved with her, their fingers still linked together.</p><p>“Let me.” His index and middle fingers settled over her pussy, parting her, touching her so gently she felt like weeping.</p><p>His cock slid free until only the wide crest remained inside her, then he thrust home fast and deep. His serrated groan vibrated against her back. Two long, thick fingers pushed gently into her spasming pussy. His palm massaged her throbbing clitoris.</p><p>“I need . . .” Her words came slurred with pleasure. “Oh God . . . Fuck me. Please. Now.”</p><p>Cupping her between the legs, Brian began to shaft her tender rear with smooth measured strokes. His hips worked like a welloiled machine, pounding against the curve of her buttocks, his steelhard cock caressing nerve endings only he’d ever touched.</p><p>Layla sobbed, her blood raging. The sounds he made spurred her dark hunger—the rough growls and muttered curses, the desperate groans of pleasure. The heel of his palm nudged her clit with every thrust, pushing her closer and closer to an orgasm she knew would destroy her. She’d have no defenses left against him by the time he was done with her, nothing to shield her from the pain of losing him all over again.</p><p>“I love you, Layla.” His voice was a harsh rasp in her ear. “So damn much.”</p><p>He pushed her forward slightly, gaining purchase with his knees. His strokes came faster, deeper ... his fingers sliding in and out with the same perfect tempo.</p><p>“Love you.” She gasped the agonizing truth, coming in a brutal rush. Her body seized, clamping down on his shuttling cock, tightening as he climaxed with heated spurts deep inside her.</p><p>Brian gripped her tightly. Holding her together. Holding her to him. For a moment the desperation melted away, leaving them alone with each other. The closest they’d ever been, while also the furthest away.</p><p>Layla awoke before Brian. She roused from sleep to the feel of his heavy arm draped over her and his leg tangled between hers. His face was buried against her nape, his rhythmic exhales soft against her skin.</p><p>Tomorrow she’d be in San Diego and Brian would go his own way. Again. It was a small comfort that he regretted allowing her to leave him that long-ago day. If they had a second chance, she knew they’d both do things differently. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’d been so young when she left him. Barely nineteen. For all intents and purposes, Brian had been her first relationship. How childish she must have seemed to a mature twenty-five-year-old man, demanding he choose between her and the livelihood he’d worked so hard for. He’d chosen not to reenlist in the Navy because of her need to keep him close to home.</p><p>What had she sacrificed for him? Not enough. She’d been dizzy with adolescent yearning and seeking a Grand Gesture to prove his love for her. She had lacked confidence in her ability to keep Brian’s interest and to satisfy his sometimes-dark, often-demanding appetites. And she’d mistaken his care and consideration as babying, feeling as if he was treating her like a child instead of the truth—he indulged her because he loved her and wanted her to be happy.</p><p>Now, it was too late.</p> <p>She sighed. Brian tugged her closer.</p><p>“Don’t think about it,” he said gruffly, pressing his lips to her shoulder.</p><p>“I’m trying not to.” She started thinking about running away instead, thinking about the viability of leaving the country and being on the lam together, and never letting him go. But neither of them could do that. Agent Sandoval had died saving her life; it was her responsibility to help bring to justice the men who’d killed him and Steph.</p><p>Lifting his hand to her lips, Layla kissed his knuckles, then rubbed her cheek against them. She felt his breath catch, then quicken. His embrace tightened.</p><p>“I’m sorry,” she whispered. “So sorry.”</p> <p>“No, sweetheart. I fucked it up. I was the one who should have known better. You needed reassurance and I didn’t give it to you.”</p><p>She turned in his arms and snuggled into his hard chest. “I was worried that I was too inexperienced and undereducated to keep you from getting bored.”</p><p>His smile made her chest tight. “You’ve always been a handful. Boredom has never been a concern.”</p><p>“I was sick with jealousy whenever a woman nearer to your age flirted with you or gave you a please-fuck-me look. I felt inadequate every time I met one of your friends’ wives or girlfriends and saw how mature and confident they were.”</p><p>“While I was thinking I was the luckiest man in the room to have you.”</p><p>Her tears wet his chest. “I kept thinking I’d blackmailed you into being with me. I knew you weren’t ready, but I also knew you couldn’t stand the thought of me with someone else. I put you in the position of being the lesser evil, but I never felt like you were really comfortable with it.”</p> <p>Brian’s callused hands cradled her back. “I wasn’t.”</p><p>Layla looked up at him. His short hair was mussed and his eyes bloodshot. She thought he was the most gorgeous man she’d ever seen. “I knew it.”</p><p>“I was worried I was too settled for you. I’d already had my fair share of late nights and too much to drink. When I was home, all I wanted was to be alone with you.”</p><p>“I wanted that, too.”</p><p>He exhaled harshly. “I felt old. I figured you’d get over your crush on me soon enough and it would gut me to lose you. The moment you broke it off was the last possible moment you could have done it and not killed me. I survived it only because I still hoped you’d come back. That when you were ready to settle down, I’d be the guy you would want to settle with.”</p><p>“That’s why you let me go? Because you still could?”</p><p>“Partly. And partly because I thought you needed to live a little. See what else was out there. You weren’t the only one who was insecure. I wanted to be sure you didn’t look back and wonder if there might have been someone better for you, if you’d just taken the time to look around.”</p><p>Layla closed her eyes, sinking into an exhaustion that was more than physical. “I’m glad we had these few days together,” she said softly. “Anytime I was set to meet a new deputy, I’d hold my breath and hope it would be you. I’d always feel this strange mix of relief and disappointment when it wasn’t. It’s good to have some closure. At least I know we saved some of the good—”</p> <p>“Shh.” He pressed his lips to hers. It was a reverent kiss. Full of tenderness and sorrow.</p><p>Layla pressed herself against him, wishing she could crawl inside him. Cherish him. Keep him.</p><p>God knew she loved him and had no idea how she was ever going to live without him. Knowing he was out there somewhere, still loving her ...</p><p>“Don’t think about it,” he repeated.</p><p>Easier said than done when her heart was breaking all over again.</p><p>Chapter 8</p><p>They drove straight through to Albuquerque with only a few quick stops for food and gas.</p><p>Pulling off I-40, Brian headed into the suburbs. Layla was quiet beside him, as she’d been most of the day. Her gaze was trained out the passenger window. He could feel the sadness radiating off her even though her face was hidden from him by the brim of a baseball cap. His own gut was tight with grief and frustration, his hands flexing restlessly on the wheel while he damned himself for not preventing this.</p><p>If he’d just talked to her when she needed reassurance, if he had given her a say in his plans, they would be in a totally different place in their lives now. She’d be safe, he would be with her, and they’d both be happy.</p><p>He pulled into a quiet residential neighborhood and she stirred, turning her head to look at him with her brows raised in inquiry.</p><p>“I’ve got a buddy out here,” he explained, slowing down in front of a one-story ranch house with a Chevy Silverado in the driveway and a Sea-Doo trailer in the space beside it.</p><p>Parking, he left the keys in the ignition and said, “Let me see if he’s home.”</p><p>Before he could step out, the front door opened and Jack Killigrew appeared. Tall and dark in appearance and demeanor, the man was an SOG deputy like Brian, a Shadow Stalker Brian could trust with someone as precious as Layla.</p><p>“Sit tight,” he murmured, getting out of the Bronco. Rounding the hood, he called out, “Hey, Killigrew. I’m in a bit of a bind.”</p><p>“Understatement of the year.” The other deputy held out his hand and they clasped forearms, pulling each other close for quick slaps to the back. “You’re hotter than a bitch in heat. It’s her, isn’t it? Your Layla?”</p><p>“Of course.”</p><p>A pretty blonde in a wisp of a summer dress stepped out of the house and offered him a tentative smile.</p><p>“Ah, shit,” Brian muttered. “I didn’t think about Rachel and Riley being here. We’ll head out.”</p><p>Jack had recently been in a similar position to Brian’s—in love with a woman he couldn’t have. But Jack had worked things out. He’d gotten the girl and the future he had once only dreamed of. Brian would be damned if he’d fuck that up.</p><p>“Riley’s with his grandmother,” Rachel interjected. “In California.”</p><p>Brian extended his hand. “It’s a pleasure to meet you, Rachel. Brian Simmons.”</p><p>“Hi, Brian.” She smiled. “We’re getting ready to grill up some steaks. Jack bought enough for an army, as usual. I hope you’re planning on staying for dinner.”</p><p>He looked at Jack with a rueful smile. “I appreciate the offer, but I just stopped by for a moment.”</p><p>“Bullshit,” Jack said. “Your timing is perfect. I told everyone I was going to be at Rachel’s in Monterey so they’d leave us alone. No one knows we’re here.”</p><p>“Jack—”</p><p>Jack ignored him and walked toward the Bronco. “I’ve got guest rooms. I’ll move my car out of the drive and you can park in the garage.”</p><p>Opening Layla’s door, he introduced himself and gestured at the house. She looked to Brian and he shrugged.</p><p>Their eyes held for a moment, a surge of emotion passing between them.</p><p>So little time left. He hated to share even a moment of it, but he needed a fellow deputy’s input and help, and Layla needed a place to decompress.</p><p>He held out his hand to her when she reached him. She linked her fingers with his and he led her into the house.</p><p>“How can I help?” Layla asked, watching as Rachel pulled the vegetables for a salad out of the fridge.</p><p>“Are you up for peeling a cucumber and chopping it up with some tomatoes?”</p><p>“Absolutely.”</p><p>After rinsing and prepping, Layla joined Rachel at the granitetop kitchen island. She smiled at the friendly blonde, whose short golden curls perfectly framed a lovely face and kind blue eyes.</p><p>“You have a lovely home,” Layla said, envying the other woman’s happy family.</p><p>“It’s not mine. Jack and I are still pretty new to each other. At least, in the romantic sense.”</p><p>“I never would have guessed.” Jack clearly doted on Rachel. In some ways, he reminded Layla of Brian. Both men were tough, no-nonsense guys ... who just happened to have a soft underbelly they exposed only to the women they loved. When Jack looked at Rachel, the tender heat was obvious.</p><p>“We’ve known each other for years. He was my late husband’s best friend and he’s my son’s godfather.”</p><p>“You and I have a lot in common,” Layla noted.</p><p>Rachel continued to shred a head of lettuce with her hands. “Jack gave me a brief rundown of why you’re here. I can’t imagine what you’re going through right now, yet you’re so pulled together and brave. You’re amazing. Jack says you’re from a military family?”</p><p>“Jack seems to know a lot about me.”</p><p>“I said the same thing.” Rachel laughed. “Apparently Brian talks about you a lot. It must be a relief to have him with you now.”</p><p>“Huge.” Layla began to dice the tomatoes. “It’s ironic. We broke up, in large part, because of his job. And now I couldn’t be more grateful that he does what he does and that he’s helping me get through this.”</p><p>“Jack ’s job got in the way for us, too. He felt like it was too dangerous for Riley and me, and that I’d eventually regret how often he’s away.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I never minded the separation so much,” Layla said, thinking about it. “Maybe because I grew up living with it. My problem was—still is—his need to sign up for the most dangerous jobs, situations, whatever. I mean he couldn’t just be a deputy U.S. marshal, right? He couldn’t just be a sailor in the Navy. He had to go Special Forces all the way.”</p><p>“It’s scary when they’re gone, I know.”</p><p>“It’s scarier when they don’t come back.”</p> <p>Rachel paused, her gaze trained downward at the counter.</p><p>Exhaling in a rush, Layla stopped chopping. “I’m sorry. I shouldn’t have said that.”</p><p>“It’s okay.” Rachel left the counter and grabbed a beer out of the fridge. She held one up for Layla, but Layla shook her head. “I had to think long and hard about that very possibility before I pursued Jack. I had to be sure I was truly committed, because I was risking putting Riley through losing a stepfather as well as his own dad.”</p><p>Layla set the knife down. “What made up your mind for you?”</p><p>“Jack. He deserves to be loved. He deserves to have someone to come home to. With all that he does for everyone else, he deserves something of his own.” Rachel took a long pull on her beer, then set it down and got back to work. “Jack was raised in foster care. It took me a while to understand it, but the men he works with are his family, the only one he’s ever had. I realized I have to look at his job the same way I would an unpleasant mother-in-law—it comes with the territory. I have to take him the way he is.”</p> <p>Gripping the counter, Layla forced herself to breathe in an even tempo while her heart lurched in her chest.</p><p>Dear God.</p><p>Families were supposed to be comprised of people who cared for you, people who would do anything for you . . . even die for you. She’d been blessed with that, but like Jack, Brian hadn’t been. His mother was engrossed in the men in her life, losers who used her and eventually left her when the novelty wore off. Brian had no idea who his father was and no siblings he knew of.</p><p>So he’d chosen fields and jobs that would give him the support system of a family. Careers that provided him with people he trusted with his life. And hers.</p><p>She’d demanded he give that up for her. Coming from a young woman he feared might leave him at any moment, it must have seemed like an impossible request. He’d already lost Jacob.</p><p>Layla understood now why he hadn’t been able to let the job go. It wasn’t the job itself; it was the ties the job gave him. And she hadn’t offered him a dependable alternative to that loss.</p> <p>“Are you okay?” Rachel asked softly.</p><p>“Sorry. I’m just wiped out.” Layla lifted her head. “I was already stressed about the trial. Then these last couple of days . . .”</p><p>“It’ll be over soon, won’t it?”</p><p>“It will never be over. Once I testify, I’ll go back into WITSEC and wait for the possibility that they might need me again.”</p><p>“Will Brian be with you?”</p><p>Layla shook her head. “He won’t even know where I am or what my last name is. Today and tomorrow is all we’ve got.”</p><p>“Then why the fuck are you in the kitchen with me?” Rachel asked without heat. “I’ve got dinner covered. Go spend some time with your man.”</p><p>“I think he’s talking with your man, actually.” Layla felt herself smiling despite herself. She liked Rachel. She wished this sort of life was possible—spending time with people who were important to Brian, grilling a meal on a lovely day, commiserating with fellow significant others who knew what it was like to wait and worry and hope for the best. The worst part was that she’d once had the life she was now coveting and she had thrown it away.</p> <p>“Then take a shower and a nap instead. It’ll be a few hours yet before the food’s ready.”</p><p>“I’ll feel like a mooch if I don’t help.”</p><p>“You can help me clean up later, how’s that? I enjoy the prep part. It’s the mess I don’t much care for.” Rachel rounded the island. “Let me show you to your room. The house has two masters, so you have your own bathroom.”</p><p>“Thank you, Rachel.” Layla met the blonde’s blue-eyed gaze and tried to convey the depth of her gratitude. It meant so much to her that she and Brian had this brief respite with trusted friends in a home filled with love. It felt real and true, although she knew it was as much a moment out of time as the past two nights spent in rundown motels.</p><p>Rachel grabbed her hand and squeezed. “Anytime.”</p><p>“You weren’t fully briefed before you got there?” Jack asked.</p><p>“I was a last-minute replacement—” Brian’s voice faded when Layla walked by the den’s open double doors. The slump of her shoulders and low-hanging head told him so much about her mood.</p><p>Heaving out his breath, he leaned heavily into the front of Jack ’s desk. The other deputy stood with his back to the hallway, but he turned his head to follow Brian’s gaze.</p><p>“What are you going to do about her?” Jack asked quietly.</p><p>“What wouldn’t I do?” Brian shoved a hand through his hair. “She’s blaming herself for us breaking up in the first place.”</p><p>“Wasn’t it her fault? She left you.”</p><p>“We’re both equally at fault,” he said gruffly, feeling the need to protect Layla from censure. “We both needed something from each other that we couldn’t vocalize at the time.”</p><p>Jack grimaced in sympathy. “I’ve been there.”</p><p>“None of which matters now. I can’t even think about living without her again. It makes me insane.” Brian forced his thoughts back to the most pressing issue at hand—keeping Layla safe. “I was brought in at the last minute because one of the deputies who was supposed to be on Layla’s detail called in. I need you to find out who that person was.”</p><p>“I’m sure they’re working that angle, too, and if the deputy’s involved, he or she has likely planned for that contingency, but I’ll see what I can dig up.” Jack crossed his arms. “The DEA has a big stake in this. This is personal for them.”</p><p>Brian understood what Jack was saying. This was interagency business—reputations were on the line and the media attention was fierce. Every precaution would’ve been taken, most especially assigning only the most trustworthy, heavily vetted deputies. For one agency to have to admit to another that one of their own had gone rogue and betrayed the service was both embarrassing and the opening of a huge can of worms. “With any other situation I’d be betting on the witness fucking it up somehow. But not Layla. She knows better and she values the lives of others too much to jeopardize anyone needlessly. Someone had a price.”</p><p>“What else can I do to help?”</p><p>Brian’s mouth curved in a rueful half smile. “You’re doing enough already. Layla’s tired and scared and worried about things we can’t change. She needed a safe haven that wasn’t a dingy, by-the-hour dump.”</p><p>“You’ll stay the night.” It wasn’t a question.</p><p>“We’ll be heading out before oh three hundred. I want to get her into San Diego prior to close of business so she can have at least a couple hours with the AUSA before she has to testify the next day.”</p><p>Jack nodded.</p><p>“I could use new wheels,” Brian said. “I was pushing my luck getting this far with Jim’s Bronco. Could you help me get a rental with some teeth to it?”</p><p>“Take my truck.”</p><p>“I can’t do that. You’re doing too much as it is.”</p><p>“You and I both know a rental is unreliable and more likely to attract attention.” Jack crossed his arms. “Take the truck.”</p><p>Brian straightened. “I owe you.”</p><p>“Big-time. Don’t think I’m being completely selfless here. I’m coming out ahead by holding a favor from you in my pocket.” Jack turned toward the door. “I’m going to spend some time with my woman. You do the same.”</p><p>“Thanks, Jack.”</p><p>His friend paused on the threshold. “Anytime.”</p><p>Entering the bedroom, Brian heard the shower running and started to undress. Once he was stripped, he pushed the partly closed bathroom door open and stepped inside the steamy room. Layla stood with one hand on the tiles in front of her and her head bowed beneath the spray of the showerhead. Her long, dark hair hung heavily around her face.</p><p>Her pose was one of such pain and dejection Brian couldn’t bear it. Opening the glass door, he stepped inside and turned her to face him, clasping her heaving body close. She was sobbing violently and his heart ached at her misery.</p><p>“Sweetheart,” he murmured, running his hands up and down her back. “I can’t stand it when you cry.”</p><p>She wrapped her arms around him and buried her face in his chest.</p><p>He held her, whispering softly, offering what little comfort he could. Eventually, she quieted to hiccupping sobs and he took care of her as he should have been doing the last five years. He washed her hair and body, then bundled her up in a towel and carried her to the bed. They curled together beneath the blankets, falling wearily to sleep.</p><p>Chapter 9</p><p>He walked in with my brother Jacob and I fell head over heels.”</p><p>Layla leaned back in her chair, enjoying the cool evening breeze that sifted through her hair. “I was sixteen. He was twenty-two and breathtaking. Gorgeous really, with a body built for sin. He had such intense sex appeal that it was like a match to my teenage hormones. He was the hottest man I’d ever seen.”</p><p>Rachel laughed softly. “Sexual chemistry.”</p><p>“To say the least. Totally ruined me for the guys in high school. They were fumbling little boys in comparison.” Layla’s fingertip circled the lip of her water glass. “But he only saw me as his best friend ’s annoying kid sister.”</p><p>“If only,” Brian interjected, coming up behind her and pressing a quick hard kiss to her temple. “She had me feeling like a lecher. Totally fucked me up. I wanted her more than I’ve ever wanted a woman before or since, and I couldn’t have her until she grew up.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ha! Don’t let him fool you, Rachel,” Layla said, shooting him a glance. “He was no saint in the interim.”</p><p>“Neither were you.” He pulled out the Adirondack chair next to her and caught her hand in his. “You knew you were turning me inside out. You did it on purpose.”</p><p>“You needed it. With the number of chicks falling all over you, you were getting full of yourself.”</p> <p>Jack returned from the kitchen with a fresh bottle of beer for Rachel. The look the other couple passed to each other was both loving and intimate.</p><p>Layla turned away, her gaze finding Brian with his head back and his eyes closed. He appeared relaxed, but she knew he was far from it. Neither of them had eaten much for dinner. They were both too worked up to fully enjoy Jack ’s skill at the grill.</p><p>“Want to crash?” she asked softly, knowing he was running on fumes despite their earlier nap.</p><p>He inhaled deeply and nodded. “We should. We’ll be heading out in a few hours.”</p><p>She looked at Rachel and Jack, who made such a striking couple. Rachel’s short blond curls were a lovely contrast to Jack ’s dark good looks. “Thank you for dinner and for harboring fugitives in your home.”</p> <p>“Thank you for cleaning up after dinner.” Rachel pushed gracefully to her feet. “I’ve really enjoyed having you, Layla. I hope this won’t be the last time we see each other.”</p><p>It would be. In a day or few, Layla Creed would cease to exist once again and she would become someone else. Layla pushed the thought away with a forced smile, choosing to take every moment as it came. Doing otherwise only drove her crazy. She hugged the other woman, then Jack.</p><p>The deputy looked down at her, his handsome face stark and austere. “I admire you, Layla. You’ve got balls taking on the Tijuana cartel and Simmons here. Stay tough and fierce.”</p><p>Her eyes stung. Praise from a guy like Jack Killigrew was high and she appreciated it. “Take care of him for me, will you?” she asked softly.</p><p>He nodded.</p><p>She backed away. “Thank you.”</p> <p>“I’ll be there in a minute,” Brian told her, stroking his fingers through her hair.</p><p>She fled with relief, needing time to get her rioting emotions under control. When she got back to the room, she brushed her teeth and hair, then changed into the camisole she’d bought to sleep in. She climbed between the cool sheets and faced away from the middle, her gaze coming to rest on Brian’s gun and badge on the nightstand.</p><p>He came in a few minutes later. He moved quietly through his evening routine without turning the lights on. When he got into the bed, he slid over to her side, fitting his hard body to her back.</p><p>She absorbed his warmth and breathed in the beloved scent of his skin. His cock was rigid against her buttocks and sexual tension tightened his frame. His firm lips whispered across her shoulder, while his hand at her waist slid beneath the hem of her top.</p><p>Layla responded to his proximity with familiar alacrity—her nipples beaded tight and hard, her breasts swelled, her pussy softened. She’d gone without his touch for too long. She hungered to hear his raw groans and feel his powerful muscles flexing against her flesh. Her arms ached from the need to hold him close.</p><p>“Layla,” he murmured, nuzzling her nape. “Don’t shut me out.”</p><p>She looked at the clock, which counted down their remaining hours together. “I need you to promise me something.”</p><p>His callused hand cupped the swell of her breast and squeezed gently. “Anything.”</p> <p>“Promise me you won’t wait for me again. Promise me you’ll find someone to love you and take care of you.”</p><p>He stilled. “Correction: anything but that.”</p><p>She turned to face him. His eyes glittered down at her in the semidarkness. The plantation shutters covering the windows weren’t fully closed; they angled the moonlight upward to the ceiling, bathing the room in a soft silver glow. “I want you to have what Jack has with Rachel. A family, people who love you and are waiting at home for you. You deserve it. You need it. Don’t let me fuck up your life any more than I already have.”</p><p>“I can’t have what Jack has without you.”</p><p>Cupping his cheek, she said, “Because you’re hanging on to a dream that’s dead. I killed it, and now you have to let it go. You have to let me go.”</p><p>Brian’s fingers flexed restlessly into the muscles bracketing her spine. “Shut up, Layla.”</p><p>“I wish I’d left you alone when Jacob started bringing you around.” Her voice was hoarse with regret. “I wish I’d—”</p><p>He pressed his mouth to hers. Beneath the blankets, he caught the waistband of her panties in his fist and tore it. Then he kneed her legs open wider. He pushed the loosened crotch of her underwear aside and took himself in hand. The wide, silky crest of his cock parted the lips of her pussy and nudged her clitoris.</p><p>“Christ.” He groaned. “I’ve been dying to push my cock into you since we woke up.”</p><p>Perspiration misted her skin. He wanted what she did—the connection, the ephemeral feeling that they were one and could never be parted.</p><p>Layla averted her head, gasping. “Brian, damn it. You’re deliberately distracting me.”</p><p>“Stop talking and enjoy it.” His lips slid across her jawline to her ear, where his tongue traced the shell. His breathing was harsh and loud, turning her on with the passion conveyed by the accelerated tempo. He stroked his cockhead down to the clenching opening of her pussy, notching himself briefly and growling at her trembling grip on that most sensitive part of him, before rubbing back up to nudge her swollen clit. “You’re so wet, baby. So ready.”</p><p>A soft sound escaped her as he continued to glide through the saturated folds of her sex with the heavy length of his beautiful cock.</p><p>“Promise me,” she gasped, her hands gripping his hips.</p><p>“I’ve been riding you bareback, Layla,” he murmured, his tongue worrying a hardened nipple through the thin cotton of her camisole. “And you specifically told me to come inside you. You’re not protected, are you?”</p><p>She sucked in a shaky breath. “You don’t know that.”</p><p>He slid his cock downward to the entrance of her pussy and pushed the thick crown into her. “Your cunt is tight and greedy. You haven’t taken a man inside you in a long time. Why take the pill if you’re not having sex?”</p><p>She was briefly startled by how perfectly his words mimicked her thoughts from the day before. “That’s not the only reason women take the pill, Bri.”</p><p>“You’re evading the question.” His lips circled the tip of her breast.</p><p>He worked another few inches inside her. She trembled with desire, her body so sensitized by his confident, relentless seduction. His virility and potent sensuality were their own foreplay. Being the recipient of that intense focus and dominant need was impossible to resist.</p><p>“Brian . . .” Her hips arched in an effort to take more of him.</p><p>“Do you want my baby, Layla?” he purred darkly, rolling his hips to slide even deeper. “Are you hoping you’ll walk away with a piece of me inside you?”</p><p>“You’ve always been inside me,” she whispered.</p><p>Lowering his hips, he drove in to the hilt with a low hiss of pleasure. The headboard tapped against the wall. “You’re asking me to let you go, while you’re trying to hold on to something of me? Someone who’s part of me?”</p><p>Her legs lifted and wrapped around his muscular thighs, holding him at that delicious point where he filled every centimeter of her. “Shut up, Brian. You’re the one who wanted to fuck instead of talk.”</p><p>Reaching behind him, he caught her wrist and pulled her hand up and away from his back. He pinned it to the mattress beside her head, then did the same with her other arm. His face was tight and hard with lust, his eyes dark, his sensual mouth drawn into a thin line. He withdrew slowly, stroking her inner walls with the wide head of his cock. Then he thrust home hard, ramming the headboard into the wall.</p><p>Layla bit her lip to stifle a moan. Heated pleasure raced through her veins.</p><p>“I’ll have to take you slow and easy,” he bit out, his jaw clenched tight. “Damn bed.”</p><p>She tightened around him just to torment him.</p><p>“Witch.” Circling his hips, he put pressure on her throbbing clit.</p><p>Her head pressed hard into the pillow as an orgasm hovered just out of reach.</p><p>Releasing her, he shoved another pillow under her shoulders. “Watch me fucking you, Layla. Watch what you do to me.”</p><p>Brian pulled out, his cock thick and glistening. “See how hard you make me? I’m so hot for you. I’ll never have enough of this, never have enough of you.”</p><p>He eased the heavily veined length back inside her, his teeth grinding audibly.</p><p>“It’s so good,” she breathed, wanting it to last nearly as badly as she wanted to come. “You feel so good.”</p><p>“As good as it gets,” he said hoarsely, snaring her wrists again. “You know it, too. We’re it for each other, baby. There’s no one else out there for us. You can’t tell me to settle. I won’t.”</p><p>He withdrew to the tip, then surged into her in a slow, deep glide. His harsh groan reverberated through the room. His head hung over her, his broad shoulders shivering as her pussy rippled helplessly around his hardness.</p><p>“I love you,” Layla whispered, her entire being filled with a desperate longing. “I love you so much.”</p><p>He caught her mouth with his own, his lips slanting across hers. His hips rose and fell, shafting her aching pussy with measured leisurely thrusts. Her pinioned hands clenched and released as she ate ravenously at his mouth, suckling his tongue as she longed to do to his cock. Sweat coated their skin, their bodies flexing and arching and straining together, their hips meeting each other with rhythmic erotic slaps. His heavy testicles swayed and smacked against her buttocks with every deep plunge, his chest heaving as the pleasure tore through them both. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The controlled pace was both maddening and delicious. They writhed against each other, driven by the need for a hard pounding tempo that would dull the reality of their inevitable parting.</p><p>Brian withdrew suddenly. She cried out in protest, her womb spasming with need.</p><p>“Fuck this noisy bed,” he growled. He hauled her up and carried her to the wall by the bathroom, pinning her to the flat surface with a desperate thrust into her.</p><p>She gasped at the rough impalement, potently aroused by his ferocity, knowing it came from the need to ignore the swiftly passing time.</p> <p>“ Yes,” he hissed as her pussy spasmed in greedy delight. “Hold on, baby.”</p><p>Clenching her hips in a fierce grip, he worked her up and down on his throbbing erection, his thrusts fast and furious.</p><p>She moaned, her nails digging into his back. “Harder. Deeper. Yes. Oh God . . . I’m coming.”</p><p>He fucked through her climax, dragging it out, making it last, watching her quake with the force of the sensations tearing through her. “That’s it. Give it to me, Layla.”</p><p>Finally, the racking tension left her. Her body sagged in the aftermath of the violent orgasm. But Brian kept working her, slamming his hips against hers as he shoved his way through the tightened grip of her sated pussy.</p> <p>As the pleasure built again, Layla moaned. “Brian.”</p><p>“One more time,” he rasped, the strain of holding out evident in his tightly clenched jaw.</p><p>Grinding his pelvis against her clit, he brought her off. He cursed as she cried out and rippled along his length, his cock jerking as he came in thick spurts of white-hot semen.</p><p>His knee hit the wall with a harsh thud; his big body crowded hers as he leaned into her for support. With his lips to her throat, he groaned through the wrenching orgasm, clutching her hard while she trembled in his arms.</p><p>“I love you.” He nuzzled his perspiration-slick forehead against her cheek. “And your golden pussy, as you called it, is going to kill me. It’s going to suck the life right out of me one day. But, man . . . what a way to go.”</p><p>Layla laughed, his humor unexpected and welcome. She felt him smile against her skin, the moment as intimate as the climax they’d just shared. He stumbled back to the bed with her, staying inside her, even as they sank back into the mattress.</p> <p>She pushed her hands into his sweat-soaked hair and held him close. “I want you to be happy. I want that more than anything in the world.”</p><p>“I know.” He pushed his arms beneath her shoulders and squeezed her.</p><p>“I don’t want to make you miserable.”</p><p>“Then stop talking about this, Layla.”</p><p>“That is so like a man,” she muttered. “Ignore a situation and hope it goes away.”</p><p>He nipped the tender spot between her neck and shoulder with his teeth. “I’m not promising to forget you or move on without you. Give it up.”</p><p>“Promise me you won’t let my memory get in the way of having a good life.” Her fingers massaged his scalp. “I can’t bear the thought of you waiting around for another chance that we might see each other a decade or more down the road.”</p><p>He lifted his head and looked down at her. “And if I did run across you, will you have moved on? Will you be married and happy?”</p> <p>The mere thought caused physical pain in her chest. Perceptive as he was, Brian saw it. “Thought so. I rest my case.”</p><p>“Brian—”</p><p>“Go to sleep.”</p><p>She wondered how she was supposed to do that, with his heavy body atop hers and his cock still inside her. But she would never complain. She wanted the feeling imprinted on her skin, a vivid memory she would hold on to in the years to come.</p><p>Chapter 10</p><p>Brian was staring out the kitchen window at the pre-dawn sky when Jack reentered the room. The other deputy had come in earlier to make coffee shortly after Brian first left his guest room. This time, Jack was dressed. Like Brian, he wore his shoulder holster, and his badge was clipped to his belt.</p><p>Brian tossed back the rest of his cooled coffee and went to the coffeemaker for another cup. Despite his lack of sleep, he was wired. It was a big day. The biggest of his life.</p><p>Leaning his back against the countertop, he crossed his feet at the ankles and looked Jack over. It wasn’t yet three in the morning and the man had his boots on. “Why are you dressed?”</p><p>“I’m coming with you, of course.”</p><p>“The hell you are.”</p><p>Jack smiled. “You’re a ray of sunshine in the morning, Simmons.”</p><p>“Rachel needs you.”</p><p>“She’s got me.”</p><p>“This is my gamble to make. Stay here.”</p><p>“No can do.” Jack ’s dark eyes were hard, his shoulders set. “That lady of yours has a very important appointment tomorrow and you need more eyes.”</p><p>“Fuck.” Brian couldn’t argue against the need for help and more comprehensive protection for Layla. He wouldn’t. The only argument he could make was a personal plea for Jack to put himself first, and Layla’s testimony trumped that. “These guys aren’t fucking around, Jack.”</p><p>“Rachel accepts the risks. Did you call Jim?”</p><p>“I tried last night. Left a message. There was nothing in his recorded greeting that suggested trouble. He would have slipped in something I’d recognize if I needed to watch my back.”</p><p>“Okay. So you and Layla will take my truck, and I’ll follow in the Bronco.”</p><p>Brian shoved a hand through his shower-damp hair. “For the record, I strongly object to your involvement, Killigrew.”</p><p>“You’ll get over it.”</p><p>When they pulled over in Flagstaff for breakfast, Brian took a few minutes to leave a message on the AUSA’s office voice mail. Then he switched to a new disposable cell phone and called Doug Preston, a supervisory deputy U.S. marshal in the Southern District of California. Relying on voice mail again, he explained the situation in a low, steady tone. He started with the explosion and ended with his anticipated arrival in San Diego. Aside from the last, he fully expected the information to be a rehash of what was already known, but Brian wanted his version of the events to be recorded in case something prevented him from giving a statement later. The closer they got to San Diego, the more dangerous the situation would become. He had to make sure he protected Layla with the truth as he knew it, even if he couldn’t do so in the flesh.</p><p>Jack approached with a newly refilled soda in hand. “You sure you want to do that?”</p><p>Realizing the other deputy had eavesdropped, Brian shot him a wry glance as he pulled the battery from the phone. “You wouldn’t if you were in my shoes?”</p><p>“I would, but I’m your friend. I have to ask.”</p><p>Brian nodded, biting back further words when Layla stepped out of the restroom. He offered her a quick smile and she returned it, but they knew each other too well to hide anything from each other. She knew he was feeling raw. Twisted up over her, over her safety, over how much he loved her. Her eyes said it all in return.</p><p>“You ready?” he asked when she took his hand.</p><p>“No.”</p><p>He tightened his grip on her and shielded her the distance to the trucks.</p><p>“Criminal justice, you said. Do you like it?”</p><p>Layla looked at Brian as they crossed the border from Arizona into California. He’d started trying to distract her about a half hour prior and she was going along with it as much as she was able, considering she had a knotted stomach and heavy heart. “I do.”</p><p>“You sound surprised.”</p><p>“It was a bit unexpected,” she confessed. “I knew I wouldn’t hate it, but I didn’t realize I’d love it.”</p><p>He glanced aside at her and smiled in the way she loved—halfwicked, half-tender.</p><p>She looked out the front window at the desert vista around them. “God, I’ve missed Cali.”</p><p>“You’re a native; you’ll always miss it.”</p><p>“How about you? Are you on the East Coast now?”</p><p>“For now. I’ve been moving around, taking transfers when I can.”</p><p>“Do you like it?” she asked, tossing his question back at him. The thought of Brian living a nomadic existence filled her with sadness. “The hopping around?”</p><p>He lifted one shoulder in a shrug. “Moving keeps me busy.”</p><p>“What did you do with your house?”</p><p>“I sold it.”</p><p>“You loved that house.” She had loved it, too. She’d been with him when he bought it and had seen the possibilities in the older Anaheim home. But what he’d done with it exceeded her imaginings. He had torn out the carpet and installed dark wood floors. Light rugs and walls paired with mostly black furniture had made the ’50s-era home both modern and masculine. She’d given him a multicolored blown glass vase for a splash of color and he had placed it in a place of prominence, even installing track lighting to spotlight it.</p><p>“I loved the idea of the house,” he corrected. “The idea of sharing it with you and watching you change it like you were changing me. Once you joined WITSEC I knew you’d never be coming back to SoCal, so the house lost its charm.”</p><p>“Brian.” Layla sucked in a shaky breath. “You’re killing me.”</p><p>He reached over and linked his fingers with hers. “No more than your change of major kills me.”</p><p>“Have we both been living for a future we have no possibility of having? And making amends for mistakes, even though we couldn’t know what the other was doing?”</p><p>He lifted her hand to his mouth and kissed her knuckles. “What else were we going to live for?”</p><p>It broke her heart to realize that he was right. Somewhere, in the back of her mind and deep in her heart, she’d been taking each day one at a time, waiting for the impossible moment when she’d see Brian again. She hadn’t been able to picture a world in which they breathed the same air yet would be separated forever.</p><p>Her hand tightened on his. “I love you, Brian.”</p><p>As often as she said it, she felt like she couldn’t say it enough. The painful fact was that she’d given up on him when she walked out. If he took anything away from the last few days with her, she wanted it to be that he was loved. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I know,” he murmured, looking grim. “I love you, too, baby.”</p><p>They pulled over for the final time at a gas station off I-8 to switch cars. Layla held Brian’s flannel closed over her chest, concealing her body armor, and looked at Jack as he slid behind the wheel beside her. He’d swapped clothes with Brian while they’d been in the store; everything but their shoes.</p><p>He sighed as he settled into the seat. When he caught her gaze, he smiled sheepishly. “This seat is way more comfortable than the Bronco’s.”</p> <p>He and Brian had been driving for nearly eleven hours. San Diego was only minutes away.</p><p>She was scared. Brian had left her with Jack and her heart was in her throat at the thought that she might not see him again. As soon as they checked in with the AUSA, he was going to face the consequences for going rogue with her. He could be tied up with interviews/ interrogations for weeks. In the meantime, she’d be absorbed back into the system.</p><p>Jack started his truck. Brian was already merging the Bronco into the traffic on the street.</p><p>“What’s going on?” she asked, knowing that something was up for them to switch places so thoroughly.</p><p>Jack looked over his shoulder for possible obstructions, then backed out of the parking space. “We can’t get ahold of the owner of the Bronco. He’s not answering his home phone and his cell goes straight to voice mail.”</p> <p>“What does that mean?”</p><p>“Could be nothing, but we can’t take any chances. If the Bronco has been compromised, we don’t want you in it.”</p><p>Brian was in it. “Why don’t we just leave it at the Park ’n’ Ride?”</p><p>Jack looked at her. “If it’s hot, keeping it on the road will deflect attention from this vehicle.”</p><p>“Oh my God.” She felt the blood drain from her face. Flashes of memory from the explosions in Maryland had her recoiling into the seat. “He’s bait?”</p><p>“Hey,” he said softly. “They’re not going to launch grenades in the heart of San Diego, and at this late date, they need to make sure you’re dead. They’ll want to get up close and personal, which is where Brian is at his best.”</p> <p>“Is that supposed to make me feel better?” Her hand went to her throat, attempting to massage the tightness out of it.</p><p>“Brian has to do his job, Layla.”</p><p>“By luring killers out after him?” Swallowing hard, she looked out the window. She felt like she was going to be sick. She wondered if Rachel had felt similarly when Jack left their bed that morning.</p><p>“For what it’s worth,” Jack murmured, “I believe everything happens for a reason. The chances of you and Brian crossing paths the way you did were pretty damn slim. Things stacked up for you two like a chain of dominoes: the prominence of the Sandoval trial warranted SOG deputies and Brian was in the right place at the right time. He saved your ass and his, and managed to get you across the country without incident. I can’t believe you both would get this far for nothing. Have a little faith in fate or a higher power—whatever your poison is.”</p><p>Layla shook her head. “You have no idea what it’s like being the one who’s always left behind. The one wringing their hands, pulling out their hair, and vomiting from the stress and god-awful terror.”</p><p>“What do you think Brian went through when you joined WITSEC ? You were the one with her ass on the line, the one in danger while he was stuck with the fear. He tried to keep it together around the rest of us, but sometimes his control slipped. I never called him on it, but I was really worried about him for a while.”</p><p>Jesus. And she was about to do it to him again. Maybe that was what was making him so reckless now. Maybe he was throwing himself directly in the line of fire because he was in the same state she was—half out of his mind with grief and worry.</p><p>She sat up and straightened her shoulders. She needed to get someplace safe, so Brian could focus on all the shit that was about to blow up his career. It wasn’t nearly enough, but it was all she could do. “Get me to the AUSA, Jack. Let’s get this over with.”</p> <p>“That’s the plan.”</p><p>Brian was pulling into a motel on Pacific Coast Highway in San Diego when Jack ’s cell phone rang. He reached for it and answered, his greeting cut off by the impatience of Jack’s regional supervisor on the other end of the line.</p><p>“Hey, Killigrew. I’ve got the information you asked for.”</p><p>Brian parked and kept his gaze on the rearview mirror. “Who was it, sir?”</p><p>“James Reynolds was the deputy who called in that afternoon. He was questioned already and released, but his whereabouts are unknown now. Do you think he’s colluding with Simmons?”</p><p>Jim. Fuck. “I’m absolutely certain he’s not.”</p><p>There was a moment of silence. “Who is this?”</p><p>“Killigrew should, at this very moment, be escorting Miss Creed into the AUSA’s office.” Brian exhaled, mentally kissing his career good-bye. “Thank you for your help, sir.”</p><p>He hung up and slid out from behind the wheel. Standing in the apex between the open door and the body of the vehicle, he surveyed his surroundings. The end of the road was in front of him, but he was suddenly reluctant to get there. Jim had been his friend for a long time. Brian had trusted the deputy with his life more than once. Surely Jim was tracking them via the Bronco’s theft recovery system. But he’d allowed them to get this far.</p><p>Why? Brian intended to ask the man that question directly.</p><p>Thank God he was wearing gloves. If not for them, Jim Reynolds doubted he could keep his grip on the Maglite in his hand. Breathing roughly, he wiped the blood off the end of the flashlight with a Kleenex, then dropped it on the corpse lying prone on the floor behind the front desk. He disabled the outdated and poorly placed security camera overlooking the closet-sized lobby area, then wiped the recording of the feed going back a solid twenty-four hours. It only took a moment to find a master keycard. Before Jim left, he placed the WILL RETURN SHORTLY sign on the counter.</p><p>“You’re a lucky bastard, Reynolds,” Jim muttered to himself, stepping out of the dimly-lit front office into the moonlit night beyond. He glanced down the road to where his Bronco was parked at a twenty-four-hour diner. He’d known Simmons long enough to be familiar with his routine. Out of the dozens of motels lining the street, he’d found the deputy and his witness girlfriend at the first one he tried. A quick flash of his badge and a picture of Simmons were all the desk clerk had needed to confirm his guess.</p><p>But then things had been going his way since Simmons first called him three days ago. It would have been simpler if the cartel had killed the girl in Maryland, but as far as fuckups went, the unexpected appearance of Simmons had worked in Jim’s favor. The former SEAL was the only deputy who had a personal stake in Layla Creed. Anyone else would have seen her absorbed back into the system and Jim would have been scrambling to find her. Simmons was also the only one who would risk a last night in a motel instead of taking her directly in for witness prep, because his dick was driving the bus. That gave Jim this opportunity to take out the girl and Simmons in a staged murder-suicide that would wrap everything up in a nice, neat bow.</p><p>He pulled a roll of Rolaids out of his pocket and bit off three to fight the burning ache of ulcers in his stomach. He didn’t recognize himself anymore. He’d become a man he hated. But as much as he regretted what he was about to do, it would be a relief to end it.</p><p>Pausing outside Simmons’s room, Jim noted the darkness within and the silence. He gripped the master key in one hand and reached for his Taser with the other. He’d have to be quick. Once the door opened, Simmons would be a blur of movement if Jim missed his target.</p><p>He slid the keycard through the lock and threw the door wide, aiming the Taser at the lumpy, disheveled bed and firing. An instant of brightness lit the room as the electrical current sizzled. Then, he heard the racking of a gun slide behind him.</p><p>He froze.</p><p>“Why, Jim?”</p><p>His eyes closed at the sound of Simmons’s quiet voice behind him. He’d lost his edge long ago and getting caught like this only proved it. “When did you make me?”</p><p>“A couple hours ago, and I still can’t believe it.”</p><p>Jim turned around. A quick scope of the area revealed deputies scurrying across the second floor breezeway and more encroaching from the far left and right sides of the parking lot.</p><p>“Why?” Simmons asked again.</p><p>“Stella.”</p><p>“What does your daughter have to do with this?”</p><p>“The cartel is far more determined than we give them credit for.” Jim’s arms dropped listlessly to his sides. “Stella met a boy last year—her first year in college. He’s a handsome and cultured young man. She brought him home for Christmas and I liked him. He spoils her and makes her happy.”</p><p>Simmons’s expression was hard to read in the semidarkness. “He’s with the cartel.”</p><p>“Of course. He revealed himself to me a couple weeks ago. They’ve planned this for God knows how long. Think of the dedication involved ... the patience and planning that went into finding me and my family, then finding the right guy to mesh with us, setting him up in school, giving him months to make sure Stella is so head-over-heels in love with him she won’t believe he could do anything wrong. I’ve tried talking to her, but it’s no use. She thinks she knows him, and now she’s with him all the time. He can kill her at any moment—something he reminds me of every chance he gets. I can’t imagine how many other deputies they’ve put the screws to, but I’m sure they’ve got their hooks into every deputy you call a friend. They’ve been drawing in their search net for years and it probably didn’t take much digging to put you and Layla Creed together.”</p><p>“You should have turned to the service for help.”</p><p>“I couldn’t take the risk.” Jim’s gut burned with a fresh wash of bile. “At least give me credit for the past three days. I could have taken you both out when you took my truck, but I felt I owed you some time with each other before all was said and done. Plus I really believe it would have been a mercy to finish you both together. Better than losing her to the system again, knowing those bastards are hunting her down.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Christ, Jim.”</p><p>“Will you look after Stella for me? Maybe now she’ll believe that the man she’s sleeping with is just waiting for the signal to kill her.”</p><p>“You could have gone another way. You could have talked to me, let me help you.” Simmons scrubbed the back of his neck wearily. “I’m really fucking sorry you didn’t.”</p> <p>The deputy turned his back to Jim and the flanking deputies moved in.</p><p>Chapter 11</p><p>The exhaustion Layla felt as she exited the courtroom was so profound, she felt almost as if she was drugged. Heaviness weighted her shoulders and eyelids, and her movements were sluggish enough to elicit concerned glances from the deputy beside her.</p><p>She hadn’t seen Brian in over twenty-four hours.</p><p>Her grief over that was a mixed blessing. It dulled her anxiety, which allowed her to get through the AUSA’s questioning. She faced more questions tomorrow, followed by cross-examination. She’d been dreading her court appearance for months, but now she was too consumed by fear and concern to devote any energy to nervousness.</p> <p>“You did well today, Layla,” AUSA Terri LeBow said with a reassuring smile.</p><p>For a moment, the cold dark eyes of the man who’d shot her and murdered Agent Sandoval invaded Layla’s mind. As she’d relayed the events of that horrible night in Mexico to the jury, the reality of having her nightmare sitting just feet from her had brought a cold sweat to her skin. If not for the numbness brought on by Brian’s disappearance, she might have broken down into a sobbing, quivering mess.</p><p>“I want that bastard to pay,” she said with quiet grimness.</p><p>“We’ve got a strong case.” Terri slowed, then stopped before a closed door. She gestured to it. “If you could step in here for a moment, I’ll see about your escort.”</p><p>With a sigh, Layla entered the room. She paused when she found two men bent over paperwork on the table and a third one standing behind them. For a moment, she stepped back, thinking she was intruding by accident. Then the man farthest away from her straightened and looked at her.</p><p>She sucked in a ragged breath. “Brian!”</p> <p>He met her halfway, crushing her to his chest. “Sweetheart. I’m sorry I wasn’t in the courtroom today; I had some things to take care of. I’ll be there with you tomorrow.”</p><p>“I don’t care about that. I was worried sick about you.” She pulled back to examine him. “Are you okay?”</p><p>“I will be.” His smile had an edge. He looked tired, but there was an air of anticipation that lent him energy.</p><p>The other men in the room departed, the smiles on their faces defusing some of her worry. Still, she had to ask, “What’s wrong?”</p><p>“Nothing.” He looked down at her with heated eyes. “Depending on what you say next, things could be really damn right.”</p><p>A flutter tickled her tummy. “Oh?”</p><p>Brian urged her toward a chair and she sat. He inhaled a deep breath, then sank to one knee.</p><p>“Oh my God,” she breathed, feeling dizzy.</p> <p>He reached into his back pocket and withdrew a ring box.</p><p>Her heart hammered in her chest. “What are you doing?”</p><p>“Getting ready to tell you I love you,” he said softly. “And then asking you to marry me.”</p><p>Her eyes fell to the ring he revealed, a large round diamond in an antique platinum setting. Her hands lifted to her mouth.</p><p>“Layla Creed. I love you and I really need you to marry me.”</p><p>She looked at him over her fingers, her breathing rough and eyes wide. “What . . . ? How ... ?”</p><p>Smiling, he explained, “I signed the contract to join you in WITSEC. The two gentlemen who left the room work for the county. One can get us squared away with a marriage license and the other can marry us in a civil ceremony. In about an hour, you can own me for life.”</p><p>“I don’t already?” she asked hoarsely, joking because her brain was unable to fully grasp the enormity of what he was offering to do for her.</p><p>“Let’s make it official. We can make it pretty in a few months with a proper ceremony, once we settle wherever we’re going to end up.”</p><p>Layla exhaled in a rush, her hand lowering to touch the gorgeous ring. “Your job ... ?”</p><p>He pulled the ring free of its velvet box and slid it onto her finger. “I’ve got money socked away from the sale of the house and the past five years of doing nothing but working. You’ll get through school, then we’ll start our own security firm. I can’t imagine anything that would make me happier.”</p><p>She cupped his cheek. Her lower lip quivered.</p><p>“Well?” he prompted. “I’m dying here.”</p><p>“Shh.”</p><p>His brows rose.</p><p>“If you wake me up,” she warned, “I’m going to kick your ass.”</p><p>His laughter broke through the chill she’d felt all day. “No more dreaming, baby. I want the real deal.”</p><p>“What are the odds that we’d get this second chance?”</p><p>“Slim to none. Don’t blow it.”</p><p>Layla leaned forward and pressed her forehead to his. “I won’t.”</p><p>“Is that a yes?”</p><p>“That’s a hell yes.”</p><p>Brian stood and pulled her up with him, lifting her into the air.</p><p>“It won’t be easy,” she warned, remembering vividly how hard it was for her in the beginning of the program.</p><p>“I can take the heat.”</p><p>Wrapping her arms around his shoulders, Layla seized what she wanted. “Take me instead,” she purred.</p><p>“’Till death do us part,” he vowed, carrying her to the door. </p> </body></html>"]