["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>The sexy little vampiress walked into the bar as if she owned the place. Since Howling Moon was a low-rent dive hidden on the shadier side of Miami, a bar that catered to werewolves, wel , the lady was very much out of fucking place. And, if she wasn’t careful, she might just become the night’s entertainment.</p><p>Jace Vaughn tensed when he saw her. He wasn’t as drunk as the other wolves, not yet anyway, so he recognized the deceptively delicate woman instantly. He could see the hint of her smal fangs peeking out just behind the plump ful ness of her too-red lips.</p><p>Vamps’ fangs always came out when they were about to fight or fuck. So which one was the vamp about to do?</p> <p>She stil ed inside the doorway of the bar. Her long blond hair tumbled behind her as her gaze raked to the left. To the right. Huh. Looked like she was hunting for someone</p><p>—or something. In this place, the only thing she’d find was a pack ready to rip her to pieces. Vampires and wolves weren’t exactly playing nice these days. Or any days.</p><p>She should know that.</p><p>But then her gaze swept by him. Swept by, then came right back. Her blue eyes</p><p>—bright with a vamp’s power—caught his. She stared at him, and Jace found he couldn’t look away. A vampire’s trick of compulsion?</p> <p>Nah...more likely just his own lust. Because the lady was hot. Most female vamps were, those pureblood ones anyway. And Jace knew he was looking at one of the elite pureblood Florida vamps.</p><p>A pureblood, in a werewolf hel .</p><p>He smiled. Fate must be laughing her ass off somewhere.</p><p>Then, she smiled too. A lick of heat shot straight through his body, and the beast that he kept chained inside stretched and growled.</p><p>Want.</p><p>She started walking toward him in her high, fuck-me or fuck-off black boots. Jace shoved away from the bar.</p> <p>But the others had noticed her now, and they were closing in. Three males. Big and hulking because that was the way of the beast.</p><p>“Vampire...” The snarl floated in the air, and the males reached for her.</p><p>“No!” His roar broke a second too slowly.</p><p>Two of the males crashed into nearby tables. They’d made the mistake of actual y touching her. You didn’t touch a vampiress who didn’t want to be touched. Fools should know that rule.</p><p>Purebloods were especial y strong.</p><p>Excitement had the beast inside yanking on his leash.</p><p>Every person in the bar froze for a moment, then instantly turned their attention on her. The vamp had the third wolf on the floor in front of her. He hadn’t shifted, not yet, but his claws were already lengthening. She had one smal hand at his throat while the other held tight to his hair, yanking his head back to better expose his neck. Vampires always went for the throat. So predictable. Their hunger made them weak every time.</p><p>“Kil the bitch...” Ah, that mutter came from one of the guys she’d tossed a good ten feet. He was already rising with his claws out and blood dripping from his busted cheek. Jace lifted his hand, staying the men even as they rose. “Not...yet.”</p> <p>He knew no one would disobey. They couldn’t. He was alpha, and if they tried, he’d be the one kicking ass.</p><p>Even the shitty band stopped playing as he crossed the room. The few human females in the bar glanced around curiously, and he saw a couple of the shifters push them toward the back. The women came to play at Howling Moon. Or rather, the wolves played with them. Those women knew the score about the supernatural world, and they knew to keep quiet about the paranormal society.</p><p>The vampiress didn’t release her grip on her prey. Jace took his time stalking toward her. Like most vamps, she had pale, ivory skin. Her features were...damn, pretty perfect. Wide eyes, high cheeks, smal nose. Her chin was pointed a little, giving her a slightly stubborn edge, but then, bloodsuckers were not exactly known to be easy going. Neither were wolves.</p><p>She wore al black. Tight black shirt, a very short black skirt, and those boots that oozed sex.</p><p>Sex and violence. Yeah, that was pretty much how vamps and wolves rol ed. As he closed in on her, Jace picked up her scent, separating the light perfume of her skin from the booze, sweat, and the cigarettes in the air. The vampire smel ed sweet, tempting. Her kind always did. The better to lure their prey in for that deadly bite. But she was—</p><p>More.</p><p>He inclined his head toward her. “Let him go.”</p><p>“Of course.” Her voice rol ed lightly, soft, sensual, but had no accent. She dropped her hold on the wolf instantly.</p><p>Then Mike made the mistake of lunging back up and slicing at her with his claws.</p><p>Rage exploded inside of Jace, and he leapt forward even as his own claws broke from his fingertips.</p><p>Don’t hurt—</p><p>She stepped back, ducked, then shoved her fist right at the wolf’s heart. Her punch threw Mike back against Jace.</p><p>Jace grabbed the wolf and twisted him around. He lifted the other guy off the floor and glared at him. “I don’t remember giving you permission to attack, Mike.”</p><p>He heard the vamp’s breaths panting lightly and knew she wasn’t as control ed as she appeared. No scent of fear, not yet.</p><p>“B-bloodsucker...comin’ in here...” Mike snarled. “She can’t just...walk in...”</p><p>“I was invited here,” she said smoothly.</p><p>Stil trapped in Jace’s grip, Mike twisted and glared over his shoulder. “Who the hel</p><p>would be dumb enough to invite a vampire here—”</p><p>“Your alpha.” Her answer came with a shrug as her gaze lifted back to Jace. Then she inclined her head in the smal est of subservient gestures. Submission. “I was told of your offer, and I’m here to accept.”</p><p>Mike’s head swung back toward him. “Jace?” His voice was stronger now. Wolves always healed fast. “What bul shit is she talking about?”</p><p>Jace slammed his forehead into Mike’s nose. Bones crunched and blood spurted even as the smal er wolf howled. Then Jace threw the guy against the nearest wal , one that was about fifteen feet away. When Mike crashed, he didn’t get up. Silence. So thick it covered the whole bar. Jace stared at the vamp, trying to keep al emotion from his face. Then, slowly, he closed the remaining space between him and the woman who was going to change everything for him.</p><p>He caught her hand and turned her palm over. Hel , yes, the mark was there, cradled inside her left hand. Just like he’d known it would be. A blood-red rose. He stood close enough to see the circle of gold in her eyes. The faint gold that marked her just as her hand did. She was something far more than an ordinary bloodsucker. She was a vampire princess. His key to power, immortality, and she was the perfect weapon that he needed to kick the ass of the demons who’d come to town looking to wipe out his people.</p><p>Her lips parted as she stared up at him. He glimpsed her deceptively delicate fangs. And he caught the scent of fear as it swept through her.</p><p>She was right to be afraid. Now that she was there, within his grasp, and he’d never let her go.</p><p>Never.</p><p>“I’m Jace.” He let her see his own fangs. “And you’re mine.” A claim made before al the wolves in the room. From now on, any wolf who touched her would face him</p><p>—and death. She swal owed and tilted her head back to better meet his stare. “Hel o, husband.”</p><p>The wolf within growled... Mine.</p><p>When you were stuck between death and hel , sometimes, you had to turn to big, bad wolf for help.</p><p>The door to the smal storeroom closed with a soft click behind Morgan LaBeaux, and she tried hard not to tense her shoulders.</p><p>Alone. With him. The werewolf’s footsteps padded around the room. She kept her chin up and knew that he’d smel her fear. Dammit, she hated being afraid. But the idea of bonding with this male and staying with him for the rest of her very long life—</p><p>hello, fear.</p><p>Morgan didn’t fear many things, but every vamp in lower Florida knew it was smart to step cautiously around Jace Vaughn. He hadn’t earned the alpha title by playing nicely. No, he’d earned it by cutting a bloody path through his rivals and leaving their savaged bodies in his wake.</p><p>And I get to marry him?</p><p>Some days, a bride was just lucky.</p><p>“I didn’t think the vamps were going to accept my deal.”</p><p>His voice sounded more like a beast’s than a man’s. Deep. Rumbling. He propped his shoulders against the wal in front of her and crossed his powerful arms over his chest. His eyes, so dark they almost looked black, swept over her once more. “A real fucking princess,”</p><p>he muttered as he shook his head. “I’l be damned.”</p><p>Probably. They al would be. That’s why they were monsters. Though she real y hadn’t been given much choice since she’d been one of the few vamps actual y born to the blood’s cal .</p><p>She cleared her throat. “At first, the Council didn’t plan to accept your...ah...offer.”</p><p>The Vampire Council—the strongest vamps in the area—hadn’t exactly been keen on Jace’s plan. But then the game had changed when their guards started showing up dead, courtesy of the demon bastards who’d come to town.</p><p>Once upon a time, the supernaturals had al lurked in the shadows, content to exist only in the nightmares of humans. Why take the spotlight? Death and persecution would only fol ow. The witch trials had taught them al that.</p><p>Vampires had never sought attention, stil didn’t.</p><p>Wolves, yes, they got a little wild and some rumors had been known to circulate about them, but they’d kept fairly quiet over the centuries, too.</p><p>But the demons—those assholes who were escaping hel in increasing numbers</p><p>—they weren’t in the mood for quiet. They’d amassed in Miami and were planning one deadly coming out party. But first, they wanted to prove they were the biggest, toughest prey in the night.</p><p>So they were eliminating their supernatural competition.</p><p>A war was coming. No, it had already started. Vampires versus demons. Demons versus wolves.</p><p>The enemy of my enemy...</p><p>Is my husband.</p><p>“The demons want to wipe us out,” she said. “You want them stopped as much as we do.” He stil hadn’t moved. Just stood there with his arms crossed. But at least there was no sign of his claws, not anymore. “You were right. The best way for us to end this battle is to team up.”</p><p>He smiled, a half-smile that didn’t lighten his face. It just made him look al the more dangerous.</p><p>The guy exuded danger like no one she’d ever seen. Darkly tan, golden skin covered a body hard with muscles. Jace Vaughn towered over her, easily passing sixfoot-three or sixfoot-four. He wasn’t handsome, no, his face was too savage for that.</p><p>His long, dark mane of hair brushed his shoulders. He had hard, tense features.</p><p>Not handsome. But...sexy. Dammit, sexy.</p><p>Wolves and their animal appeal. She hadn’t thought that appeal would work on her.</p><p>She’d been wrong.</p><p>“Wolves are holding their own...” Now his arms dropped as he stepped toward her.</p><p>“So far,” she whispered. That would change soon enough. Once the demons started concentrating their ful strength on them. “You know we have to find the doorway that’s letting these demons out of hel and close it. If we don’t, they’l take over.”</p><p>And their coming out party to the humans would be a nightmare. His eyes held hers.</p><p>When he took another step toward her, Morgan held her ground. She had an image to maintain. A vampire can’t tremble before a werewolf. But the slight flare of his nostrils told her that the wolf was drinking in her scent, and no doubt picking up on her fear.Great.</p><p>When his hand lifted toward her, she tensed.</p><p>“Easy, princess,” he murmured, “it’s just a touch.”</p><p>Right. And if they were going through with this bargain, he’d be doing a whole lot more touching.</p><p>What’s one life versus the fate of your people? That had been the Council’s big sel ing speech to her. Sacrifice yourself. Save everyone else.</p><p>Go be food for the big, bad wolf...because he can save our asses.</p><p>“My name’s Morgan,” her voice came out huskier than she’d intended, but his hand was on her cheek, smoothing over the flesh, and she wanted to shiver. Don’t. She couldn’t show that weakness. His hands were hard, but his touch felt whisper-soft.</p><p>“Morgan LaBeaux.”</p><p>There was pride in the words because she was named after the first pureblood vampire ever to be born, Morganna La Fey.</p><p>The first, but not the last.</p><p>His gaze swept her face. “I can’t believe...they’d real y trade...you?”</p><p>She swal owed. In the end, it wasn’t about the Council. It wasn’t their lives that would be offered. “It’s my cal .” His hand slipped down her throat and his fingers pressed lightly over the pulse that raced beneath his touch.</p><p>Yes, her heart stil beat. She breathed. She wasn’t dead, despite what humans thought. Purebloods were born as vampires. They simply stopped aging around their twenty-fifth year. Stopped aging and developed a lust for blood.</p><p>The others...those who’d been brought over by the bite, wel , they did die, but only for a few moments. They came back, stronger than before, and their hearts beat again when they took their first breath of air as a vampire.</p><p>“So you’re wil ingly offering yourself to me?” The wolf asked, voice darker than before. The weight of his hand felt too heavy against her throat. Wolves were always so big, too big. In a second’s time, their claws could emerge, and they could rip apart their enemies. And when they went into a ful shift...</p><p>We need their strength. “Once you help us to defeat the demons, I’l marry you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The wolves and vampires would be irrevocably bound.</p><p>Any supernatural that wanted a piece of them would find an al iance that was unbreakable. Unbeatable.</p><p>Jace laughed. The sound was sinister and strangely sexy. This time, Morgan couldn’t stop her shiver, and she knew he felt it.</p><p>“Doesn’t work that way.” His head leaned toward her and his lips hovered over hers.</p><p>“You want the demons taken out, then you give me what I want first.”</p><p>What he wanted...</p><p>“Marry me, bond with me, and you’l have your own personal guard who’l tear apart anyone who comes near you.”</p><p>She licked her lips. “It’s...ah, not just about me.” She wasn’t doing this to save her own skin. “It’s about al the vampires in my nest. They al need protection. Your pack has to give to al —”</p><p>“You are my concern.” He shrugged. “But if they matter to you, then they can have pack protection. We’l take out the demons and leave a bloody trail to warn al others never to fuck with us again.”</p><p>Yes, he was good at that kind of trail.</p><p>Over the years, the vampires had become, wel , some said too civilized. They’d taken to drinking blood from handy little plastic bags. They married humans. They blended almost perfectly with society.</p><p>Because so many of them wanted to be human.</p><p>Morgan had wanted that, too. Then she saw how easily the humans died. Now she wanted to be strong. A fighter.</p><p>The vampires were fal ing too quickly to the demon horde. The wolves—they were lasting longer. Because they’re stronger now. If they were going to stop hel , then the vampires needed the wolves at their sides.</p><p>“Marry me...” Jace’s whisper.</p><p>She knew she’d do anything, but before she could speak, a hard thud shook the wal . Morgan jerked. “What is—”</p><p>He wrapped his hands around her shoulders and lifted her up so that she had to stare straight into her eyes. “Demons fol owed you here tonight.”</p><p>“No, that’s not possible, I was careful, I—”</p><p>“Now my pack is tearing them apart.”</p><p>If only. But, sadly, she’d discovered that it wasn’t simple to kil a demon. You had to sever its head, and cleaving through demon flesh wasn’t an easy task. While a demon’s flesh looked like a human’s, it was harder to penetrate than any armor she’d ever seen.</p><p>“Do I have your agreement? You wil marry me right away?”</p><p>Why did she like the rumble of his voice so much? Morgan nodded. Another thud shook the wal , and she was pretty sure she heard a scream. Or two.</p> <p>“Good.” A growl. Then the wolf did something she hadn’t expected. His mouth took hers. Her lips had parted in surprise, and his tongue thrust inside her mouth. He didn’t taste like a vampire or a like a human. She had experience with those types of men.</p><p>But Jace...</p><p>He tasted wild. Hot.</p><p>Her arms curled around his neck as she pul ed him closer.</p><p>A growl worked in his throat when she sucked his tongue. Oh, yes, she liked that.</p><p>Vampires had the wrong image. Cold, stiff. Unfeeling. She’d never been like that. She’d always wanted. Needed.</p><p>Maybe he can give me what I want.</p><p>Her nipples were hard, stabbing against his chest, and her sex began to moisten.</p><p>Wolves weren’t easy lovers, or so the stories said. No quick tumble in the darkness for them. Instead, sex that lasted for hours.</p><p>Hours.</p><p>The Council elder’s face had been sad when he’d said, “We hate for you to make this sacrifice...”</p><p>It didn’t feel like much of a sacrifice to her.</p><p>Just felt like white-hot lust.</p><p>Her fangs started to lengthen. What will his blood taste like?</p><p>She couldn’t wait to find out.</p><p>His hands were on her ass now, holding her up and against the hard bulge of his arousal. No missing that fierce length of flesh. The wolf was big al over. Yes.</p><p>Very slowly, and only after he tasted her once more, Jace lifted his head and lowered her to the ground. “Didn’t expect that.”</p><p>She could stil taste him.</p><p>“Guess vampires can feel more than hate for the wolves.”</p><p>Morgan pul ed in a deep breath. “And I guess wolves can lust for the bloodsuckers they claim to despise.”</p><p>He stared down at her, and she realized she didn’t hear any muffled voices from the bar any longer. No more thuds. No screams.</p><p>His hand took hers and his palm felt red-hot against the mark on her flesh. Wolves were so hot, when she’d known only the cold for so long.</p><p>“Come.”</p><p>Do it. Go. Don’t back down now. Just because she’d tasted the wolf and realized that control ing him might not be as easy as she’d planned, wel , that didn’t mean she could run away.</p><p>He opened the door. The smel of blood hit her. But it wasn’t the normal y sweet, tempting scent that cal ed to her kind.</p><p>Rancid. Brimstone. Hel .</p><p>Demons.</p><p>Their bodies lay on the floor. Their heads had been severed, and their eyes—as red as the hel they’d escaped—stared straight up at her. Two demons down...</p><p>“How?” She breathed the word in surprise. The vamps had taken hours to kil demons, while the wolves had decapitated these two in mere minutes.</p><p>The wolf shifter that Jace had cal ed Mike lifted his hand. His claws glinted. “We can slice through anything.” His gaze seemed to bore into her. “Anything. ” The unmistakable threat was in his eyes.</p><p>That wolf would be a problem.</p><p>She might just have to kil him soon.</p><p>Jace caught her hand and threaded his fingers through hers.</p><p>But the kil ing would have to wait. Because, ah, first, she’d have to marry her alpha wolf.</p><p>Chapter Two</p><p>Morgan liked to bite. In fact, she was very good with her teeth. But being bitten wasn’t so much her thing.</p><p>She stood in the middle of Howling Moon, congealing demon blood getting way too close to her boots, and knew that she’d have to offer her neck.</p><p>The wolves surrounded her. Jace held her hand in a deceptively light grip.</p><p>“This is Morgan LaBeaux.” Jace’s voice boomed out and every wolf there stil ed.</p><p>When an alpha talked, you damn wel listened.</p><p>Morgan’s racing heartbeat fil ed her ears. He kept staring right at her as he said,</p><p>“She’s my mate.”</p><p>“Oh, the fuck no!” The instant denial came from Mike. She’d expected that outburst.</p><p>What she hadn’t expected—</p><p>Jace tore away from her and in an instant, his claws sank into that wolf’s shoulder.</p><p>“Oh, the fuck, yes,” he snarled right back. “And if you can’t accept her...” He yanked out his claws as Mike stumbled back.</p><p>Wolves are brutal. Another Council warning.</p><p>“If you can’t accept her,” Jace continued, “then get out of my pack.”</p><p>Pain broke rough lines on Mike’s face. “A vampire? You’re tying to a bloodsucker—”</p><p>Now she wanted to claw him. The wolves kept acting like Jace was the one trading down. Dude. Vampire princess.</p><p>She toed the dead demon’s body. The blood had reached her boots, and it wouldn’t be coming out of the leather. “They’l destroy you.”</p><p>Now it was her voice that captured everyone’s attention.</p><p>Mike puffed out his bloody chest. “We did a good job of destroying them.”</p><p>Yes, they had. And she was impressed, but she wasn’t planning to show it. “You took out two...” Her gaze swept the room. “With twenty to two odds, I should hope you’d win the match.”</p><p>Jace lifted a brow and watched her.</p><p>She braced her legs and tried to look al kick-ass. “What are your plans when there are two thousand of them...and stil just twenty of you?”</p><p>“Did that bitch just say two thousand?”</p><p>“Two damn thousand?”</p><p>Shock coated the faces of the shifters. Even Mike looked nervous. Jace didn’t. He just kept watching her, and he kept his claws out.</p><p>“You’re being hunted,” she told them. “How many wolves have the demons taken out in the last few weeks?”</p><p>They didn’t answer, but she saw the swift glances that passed between the pack members.</p><p>“They’re also attacking us,” she said. “For once, the vampires and the werewolves share an enemy.” Now they were al focusing on her with narrowed eyes and tense faces. “If we don’t take these bastards out, believe me, they will destroy us. They’ve got the numbers on their side. They have the power...”</p><p>“So what?” Mike demanded. “An al iance?” He fired a fierce stare at Jace. “Is this just some truce ‘til we kick the ass of al —”</p><p>“It’s a mating,” Jace said, voice flat. “It’s forever.”</p><p>Until death. “A doorway opened between hel and earth, and the demons are slipping right through that door,” Morgan said. More of the hel spawn came through each day.</p><p>“So close the damn door!” Mike snapped.</p><p>Jace’s fingers stretched as if he were itching to plunge his claws back into the wolf.</p><p>Maybe he was.</p><p>“We wil ,” Jace said simply. “The wolves and the vampires wil send them back and close the door.”</p><p>They had to work together. In order for that doorway to shut, they’d both need to bleed. Only she’d be the one giving up the most blood.</p><p>And Jace would be the one to face hel .</p><p>Murmurs swept through the bar. The wolves final y seemed to realize just how serious this night was. A vampire wasn’t their prey. Instead, a vampire was becoming their alpha’s mate.</p><p>Jace came to her side again. When his hands—stil tipped with those deadly claws</p><p>—rose to her throat, Morgan didn’t flinch. He swept back her hair and his knuckles brushed over her skin.</p><p>The wolves closed in now, watching, and some—some were already shifting. Mike swore and turned away. He stomped for the door.</p><p>“Don’t be afraid,” Jace’s voice, right at her ear. She felt the whisper of his breath on her flesh.</p><p>“I’m not.” Her own voice was just as soft as his.</p><p>His claws skated down her neck. “Liar.”</p><p>Wolf senses. Could he real y smel her fear?</p><p>“Have you ever been bitten?” he asked.</p><p>So many eyes were on her. She’d known the bite would have to be in public. It was one of the pack rules. Claimings had to be public. Witnesses had to see the bite.</p><p>Witnesses—just like in human marriage ceremonies.</p><p>Because that’s what a marking was...marriage. When a male wolf bit his female in front of the pack, he claimed her.</p><p>I can do this.</p><p>It would just help if her knees weren’t shaking.</p><p>She gave him the truth, “No.” No one had ever bitten her.</p><p>“Good.” Too much satisfaction purred in the one word.</p><p>“Don’t forget,” her voice was way too breathless. She wasn’t actual y looking forward to this, was she? “I get my turn later.”</p><p>“I’m counting on it.”</p><p>Oh, damn.</p><p>She titled her head, arching her neck even as she closed her eyes. She wouldn’t look at the others as he did this. She would just close her eyes and pretend that—</p><p>That I’m not giving my life to a werewolf.</p><p>His lips touched her skin first. She’d expected the bite. The sharp sting of teeth.</p><p>Werewolves were supposed to be wild.</p><p>No better than animals. That’s what the Council said, that’s what—</p><p>His tongue licked her skin, and Morgan lost her breath. Her breasts tightened even as her body tensed.</p><p>She didn’t open her eyes. Don’t want to see them.</p><p>He sucked her skin, licked her, but didn’t bite, not yet. His arms surrounded her, his body sheltered her, and he made her wait.</p><p>Worse, the bastard made her want.</p><p>Because her skin was too sensitive, his lips too wickedly skil ed, and if a vampire had a sweet spot—okay, yes, they al did—it was the neck. Just a few licks there, and she was choking back a moan.</p><p>Then she felt the edge of his teeth on her skin.</p><p>“Do it,” she told him, desperate.</p><p>“You accept me?”</p><p>Morgan nodded.</p><p>“Say it, Morgan, I need the words. You have to say—”</p><p>“I accept you!”</p><p>His teeth sank into her. Not her neck, but the curve of her shoulder. The pain was whitehot, pulsing. Then pleasure whipped through her. A wave of pleasure so intense that she cried out and opened her eyes.</p><p>And saw a giant, white wolf leaping right at her.</p><p>Barely a bride, and already, the groom’s family was gunning for her. Jace lifted his head at her cry and he roared, “Mike!” even as he shoved her back. Then her husband jumped into the air. His bones crunched, popped, and fur broke over his skin.</p><p>The man vanished, and a giant black wolf attacked in mid-air. Morgan touched her shoulder and felt the wet warmth of her blood. The skin ached, but she knew the flesh was already healing.</p><p>Vamp healing power.</p><p>The two wolves were a twisting, snarling mass. Claws flew, razor-sharp teeth snapped. Blood matted their fur, and their growls fil ed the air.</p><p>She lunged forward, but a hard hand wrapped around her arm.</p><p>“Easy, there, cher. ” The man’s voice rol ed with a Cajun accent she’d once heard during Mardi Gras in New Orleans. “Don’t go gettin’ between wolves. If Mike wants a chal enge, then Jace wil give him one...”</p><p>As she watched, the other wolves circled and howled. Jace tore into the white wolf.</p><p>More blood. Her nose twitched at the smel .</p><p>Didn’t they know better than to fil a room with blood when a vampire was around? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her teeth began to burn as they stretched in her mouth. What would it be like? To have that fresh, wolf blood? Would it truly be as powerful as the Council said?</p><p>Jace went for the white wolf’s throat. His powerful jaws caught the flesh, caught, held...</p><p>Mike sagged beneath him, the fight gone. Surrender.</p> <p>Submission.</p><p>Jace tossed his head back. His howl fil ed the bar.</p><p>Then the black wolf turned and stared at her. His teeth were bloody. His eyes wild.</p><p>What have I done?</p><p>The Council was wrong. There was no way she’d ever be able to control him. The wolves were running around now, some human, some animal, and it was chaos. Jace transformed as he approached. Fur melted. Bones shifted. By the time he reached for her, he was a man.</p> <p>Even if his stare was stil the wild gaze of the wolf. He came to her, caught her hand, and said, “Mine.”</p><p>She knew that it was too late to run.</p><p>Mike raced away from the bar even as Jace’s howl fil ed his ears. Bastard. He’d hated that asshole for years and now Jace was pairing up with a vampire?</p><p>Another reason to hate the SOB.</p><p>Mike had shifted, transforming in order to heal. Jace had sliced him too deep. Even now, the blood spil ed down his neck.</p><p>“So sweet...”</p> <p>The whisper had Mike slowing. His gaze swept the dark shadows. A row of broken buildings waited on the left. Empty. Faded.</p><p>His nostrils flared, and he scented... bloodsucker.</p><p>Mike slapped a hand over his throat, and he began to back away. Normal y he wouldn’t run from a vamp, but...but he’d already gotten his ass handed to him once tonight. “Stay away from me!” He shouted.</p><p>Laughter floated in the air.</p><p>“No...” The voice was closer now. “I saw you...I watched it al .”</p><p>Mike spun around and came face-to-face with the vamp. Tal , as pale as the woman had been, but muscled.</p><p>And the vamp’s fangs were out.</p><p>“You were going to kil the female, weren’t you?”</p> <p>Talk about being screwed. He should have known the bitch hadn’t come in alone.</p><p>“No.” He could be honest here. Maybe it would help his cause. “I was going to kil him. ”</p><p>More laughter, and then the vampire closed in. Mike didn’t even have a chance to scream.</p><p>“This is...ah...your place?” Morgan paced in front of the fireplace. “It’s not quite what I was expecting.” Jace pul ed his gaze off her ass. The rush from the shift stil fueled his body. No, not just from the shift. From her.</p><p>He had her taste now. Knew the feel of her body. Knew the sound of pleasure on her lips. He wanted more.</p><p>“What did you expect?” His voice was rough. Always was. Like sandpaper when hers sounded like silk.</p><p>Morgan stopped her pacing. She slanted him a quick glance from beneath lowered lashes.</p><p>“A cage?” He tossed out.</p><p>Her smal jaw tensed. “And I suppose you never once wondered if I slept in a coffin?”</p><p>He laughed. “No, princess, I know better.” She just needed to stay out of sunlight because the light made her weak, almost human. Not because it set her skin on fire.</p><p>That was just a Hol ywood myth.</p><p>“And I know better, too.” Her voice came even softer than before. She turned to stare at the heavy bookshelves that lined his wal s. “But I did expect pin-up queens and at least one big screen TV.”</p><p>Yeah, wel , they were al on the other side of the house. Jace shrugged. Then he took off his t-shirt.</p><p>Her gazed immediately dipped to his chest. Her hand lifted and rubbed the curve of her shoulder, the tasty spot he’d sampled less than an hour before. He’d be sampling a whole lot more of her soon.</p><p>The fucking princess. He’d asked for her because, hel , yeah, he knew the power that she wielded in her blood. If he got enough of that vampire blood in him, he’d be near invincible.</p><p>He wanted that power. Would need it if he was going to stop the demons. But there was...</p><p>more.</p><p>He’d wanted her. Had, for a very, very long time. The lady didn’t even know how long he’d been watching her.</p><p>“I remember the first time I saw you.” He hadn’t meant to say the words, but they broke from him. How many nights had his vampire princess haunted his dreams?</p><p>Her eyes widened. “Wh-what?” There it was again. That smal stutter. The hesitation he hadn’t expected from her. He’d thought that the years would have made her harder. Perhaps they hadn’t.</p><p>Or perhaps she was just playing him. Time would tel .</p><p>“You stopped aging ten years ago.”</p><p>A slight inclination of her head. Freshmeat, or at least, that’s what the pack would have cal ed her.</p><p>Jace just thought of her as—</p><p>Mine.</p><p>“We’ve never met.” Now her voice wasn’t so hesitant, but her fingers were stil curled over the mark he’d put on her flesh.</p><p>“No, but I’ve watched you.” Before he’d taken over the pack, his job had been to monitor the vampires. To catalog their every move and report back to his alpha. He’d watched and seen a blond beauty gaze up at the sun with tears in her eyes. Her twenty-fifth birthday. The day she’d final y changed.</p><p>Lathan, the ex-alpha, had wanted the pureblood taken out. She was supposed to have been a message to the vamps. We’re taking over this town. Time for you to be our bitches. But Jace had seen her stare at that sun, and instead of hurting her, he’d torn his alpha apart.</p><p>Wolves couldn’t real y recognize their mates on sight. At least, they weren’t supposed to recognize them.</p><p>Mine.</p><p>“Jace?” He liked the way she said his name, though he would prefer hearing her scream it in pleasure to whispering it so quietly. Later. “You didn’t answer my question,”</p><p>she said with a lift of that stubborn chin.</p><p>He might as wel put his cards on the table. In this devil’s bargain, they only had each other. If he couldn’t trust her... then maybe I will be the one to kill her one day.</p><p>“A few years back, I was your guard dog.” He used the derogatory term deliberately. A faint furrow appeared between her brows.</p><p>“For seven months, I watched you. Day and night.” He’d even seen her drink her first batch of blood—and watched her vomit it out moments later.</p><p>She hadn’t wanted to be a monster, but fate had different plans for her. And him.</p><p>Morgan’s bedroom eyes widened. “When?”</p><p>“Right before your change.” His gaze swept over her. “Right before—”</p><p>“Right before you took over the pack,” she finished and her hand dropped. Now he was the one surprised. “Did your research on me, did you?”</p><p>“Yes.” Flat. “I know al about you. The lives you’ve taken—the vampires you’ve beheaded.”</p><p>Because once, that had been his job. Watch. Hunt. Kill.</p><p>Until a vampiress had shed tears of blood at sunset.</p><p>Not that he’d exactly become Mr. Nice Guy since that night. He just hadn’t kil ed her.</p><p>“You know, and stil you’re ready to fuck me.”</p><p>She kept her chin up even as her hands clenched into fists at her sides. “We don’t have to—to fuck for the bonding to take place. You drank from me, now I just need to drink from you.”Jace slowly shook his head as he stalked toward her. “You think you can drink me, and not want sex?” He understood vampires so wel . The reason most of them had stopped taking from live sources was because once they tasted blood</p><p>—ah, fresh from the vein—the bloodlust tended to overwhelm them.</p><p>Her gaze held his. “I can control myself.”</p><p>Interesting. His nostrils flared. She had control, but she was also aroused. From the idea of drinking his blood? Or just, from him?</p><p>He’d worried that a vampire female would be repulsed by him. Normal y, they went for class.</p><p>Not for a beast that howled at the moon. But this princess, his princess, was something different. He’d known that for years. He’d just had to bide his time and wait for her.</p><p>“You might have control,” he al owed, “but we wolves aren’t exactly known for that.”</p><p>“No.” Again, not pul ing her punches.</p><p>So he wouldn’t either. “And I’ve wanted to fuck you for ten years.”</p><p>Her lips parted, and she gave him a glimpse of those little fangs. “You—what?”</p><p>Why did he find her fangs sexy? “I don’t care if drinking me spikes your bloodlust. I don’t care how rough you get.” He wasn’t worried about some bruises and scratches when pleasure waited. “I can handle anything you’ve got,” he told her as his hand stroked down her arm. Such smooth, soft skin.</p><p>“Don’t be so sure, wolf.”</p><p>But he was. “So why are you doing this?” His hand deliberately brushed the side of her breast. Want a taste. “Why throw yourself to the wolves?”</p><p>“I’l be saving my people.” Her lips firmed. “Isn’t that enough?”</p><p>No.</p><p>Her lashes swept down but she didn’t back away as she said, “I mean, that’s why you’re doing it, right? You’re sacrificing yourself—mating to a bloodsucker—in order to save your pack.”</p><p>He didn’t speak, but Jace did begin undressing her.</p><p>“Wh-what are you—”</p><p>Her fast stutter almost made him smile. Would have, if he hadn’t been so hard and hungry for her. He couldn’t even draw in a breath without tasting her.</p><p>“It’s time to finish this.” They’d done the public ritual, and now they would bond. He could feel a new power fil ing his body. He’d drank from her only once, and already the change was happening. Soon he’d be infinitely stronger, faster. To stop the demons, he’d have to become more. So would she.</p><p>But first, they’d have to fuck.</p><p>Her hands caught his, stil ing him.</p><p>He stared down at their bodies. She looked so breakable, but wasn’t. Not even close. So why the hel did he feel the need to be gentle with her?</p><p>“Don’t worry,” he told her. “I won’t hurt you.”</p><p>Her long lashes swept up, and she gazed at him. The gold in her eyes seemed even brighter. “Oh, wolf...” She sighed and then her lips curled in a smile that punched right into his gut. “You’re the one who needs to worry about getting hurt.”</p><p>Then her hands were on him, pushing back, and he realized Morgan was very strong. The wolf inside growled.</p><p>Her fangs were out, and Jace knew what his lady was going to say even as her lips parted</p><p>—</p><p>“It’s my turn to bite.”</p><p>Chapter Three</p><p>They made it to the bedroom. Morgan had a fast impression of heavy furniture, thick curtains, and then—</p><p>Silk sheets. Black silk sheets.</p><p>The wolf had surprised her again.</p><p>She stared at him as the haze of need built within her. She wanted his blood. She needed it. And she wanted him. The lust for him wasn’t unexpected. The guy was freaking sexy. Jace was already naked. His chest flexed and rippled with muscles. His body was perfect. So strong. So dark. So...</p><p>Very aroused.</p><p>His cock stretched toward her, heavy and thick, and there was no doubt that he wanted her.</p><p>Not just a bloodsucker to him.</p><p>She ran her tongue over the edge of her fangs. “I need to confess—”</p><p>His gaze darkened.</p><p>“I, um, don’t have a lot of experience at this.” Most vampires she knew actual y didn’t. He didn’t move. But he did cal , “Bul shit.”</p><p>It must have been her boots. She’d thought they looked rather fuck-me. “Bloodlust and physical lust...they can combine too much. We don’t, ah, drink from sources.”</p><p>They weren’t supposed to, but the rules were changing.</p><p>“I know.”</p><p>She felt hunted. The back of her knees hit the bed. “So I don’t drink and—and—”</p><p>Fuck.</p><p>“With me, you wil .”</p><p>His hands sank into her hair and tipped her head back. Then his lips took hers in a kiss that stole her breath even as it heated her blood. The wolf knew how to kiss. Oh, damn, did he. His tongue thrust inside her mouth, and Morgan found her arms rising and wrapping around his line-backer shoulders.</p><p>A kiss shouldn’t sweep fire through her whole body, but his did. Her shirt and bra were long gone. His hands slipped down and pushed away her skirt. It slipped over her boots and hit the floor. Then his fingers caught her panties and the rip of fabric fil ed her ears.</p><p>Morgan pul ed back. What am I doing?</p><p>His glowing eyes stared down at her.</p><p>Her thighs hit the mattress, and she fel back onto the bed. She expected him to pounce on her, literal y. Instead, he caught one foot and lifted it up, then slowly, inch by inch, Jace pul ed off her leather boot.</p><p>His hands kneaded her flesh. Smoothed over her calf. Slipped up her thigh. Morgan tensed even as her fangs burned.</p><p>His hand eased back, and he reached for the other boot.</p><p>She couldn’t look away from him. Dark hair. Golden flesh. The boot came off, and his hand smoothed over her skin. He parted her thighs.</p><p>“So pretty...”</p><p>She was wet for him. Morgan wanted his blood so badly that she trembled and, even more, she wanted that hot, hard body of his against her. In her. He licked his lips.</p><p>“Who gets to taste first?”</p><p>Damn. She wasn’t supposed to have sex with him. The Council had been adamant about that. Drink him, yes, take his power, give him hers, but sex?</p><p>Forbidden.</p><p>But the Council wasn’t there, and for once, Morgan was going to take pleasure like other women did. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I do,” she said and reached for him.</p><p>His smile had her heartbeat kicking, but, to show him that she wasn’t like the mortal women he’d probably known before, Morgan twisted and shoved him, forcing him onto his back on the bed. Then she climbed on top of him, spreading her legs so that the aroused length of his cock just brushed her sex.</p><p>More, please.</p> <p>Her nails raked down his chest. Not enough to break the skin. No sense wasting blood. His smal nipples tightened beneath her touch. She leaned down and slid her tongue over the left nipple. He arched beneath her, and the head of his cock pushed against her core. She lifted her head. “Not yet.” Was that breathless, hungry voice real y hers?</p><p>His hands were on her hips, holding her tight. So much power. She’d had a handful of lovers—al human—in her life. They’d felt warm and alive but Jace was something al together different.</p><p>He wasn’t just warmth. He was a furnace, and the heat from his flesh warmed every inch of her.</p><p>“Don’t play too long,” came his warning to her.</p><p>A warning she ignored. She’d never played. Why not try now?</p> <p>She kissed her way up his body. Morgan knew she should have felt hesitant, nervous, and moments before, she had. But now she just needed.</p><p>She licked his neck and felt the wild drumming of his pulse beneath her mouth. A vampire’s bite wasn’t like a wolf’s. There was no pain, there never was, not unless the vampire decided to play rough.</p><p>No pain, and, when done right...pleasure.</p><p>She real y wanted to do this right for him.</p><p>His hands trailed up her body. Such big hands, with rough fingertips and a gentle touch. His hands curled around her breasts, and a moan slipped from her. His name.</p><p>Her nipples were tight, and when his fingers pushed over the hungry peaks, she closed her eyes.</p> <p>Her teeth pressed against his skin.</p><p>Her thighs shifted, spreading even more for him. She couldn’t ever remember being this aroused for another.</p><p>Not about duty. Not about the vampire nest.</p><p>Right then, it was just about a man and a woman.</p><p>“Take me in,” he whispered as his cock pushed up between her legs. Her body resisted because the wolf was so big. The head of his cock stretched her, but it didn’t hurt. It felt good, so good.</p><p>She pushed down, even as his hips thrust up, hard, harder . Morgan took him al in and her teeth sank deep into his neck. His blood flowed on her tongue, and his blood was as addictive as his kiss. She drank him in, drank—</p><p>Jace growled, and the room spun. No, he spun, pushing her beneath him while never taking that thick cock from her body. And she didn’t take her teeth from his neck.</p><p>No, no, she wanted more of his blood.</p> <p>More, Jace. More.</p><p>Images raced through her mind. A thousand flashes, like photos flying in a storm.</p><p>They hit her, rol ing through her mind as his memories became hers. Bonding.</p><p>She took more of his blood. Licked his throat.</p><p>He thrust deep. Harder. His fingers pushed between her legs. Found the center of her need and stroked her.</p><p>The images vanished. The only thing that remained—Jace.</p><p>Her mouth eased from his throat. She swiped her tongue over her lips. Stared up at him. His jaw was locked. His eyes glowed so brightly that it almost hurt to look into them. He’d obviously been waiting for her to look up, to see him.</p><p>“Now we finish,” he promised and drove deep into her.</p><p>Her legs wrapped around his hips. Her nails sank into his arms. She arched against him, pushing as hard as she could. He thrust inside, fil ing her, every inch so stretched and ful , and she loved it.</p><p>He withdrew, sliding nearly out of her eager sex, only to plunge back inside. Again.</p><p>Again.</p><p>The headboard slammed into the wal . The bed slats gave way with a groan, and the mattress tumbled onto the floor.</p><p>He kept thrusting. She held on. Wanted more blood. Wanted more of him. Pleasure had her sex clamping around him. The climax bore down on her, so close, so—</p><p>She bit him when she came.</p><p>He erupted inside of her, hot jets of semen that fil ed her.</p><p>And he held her tight. So tight that she wondered if he’d ever let her go. Then she realized her hands were clamped around his shoulders. Her nails deep in his skin.</p><p>Holding Jace just as tightly...</p><p>Because she didn’t want to let him go.</p><p>Morgan dreamed of Jace’s life that day. The images flew through her mind, one after the other. A young Jace, had to be barely thirteen, running through the woods. Falling.</p><p>Shifting. Screaming.</p><p>Changing.</p><p>Older, he strode into a vampire bar. When two vampires leapt at him, he struck out with his claws.</p><p>Blood covered the floor.</p><p>There was more blood. Always more. He hunted. He kil ed. A perfect weapon.</p><p>There were women. They passed in a flurry. Beds. Sex.</p><p>Jace. Aging. Growing.</p><p>Stronger, deadlier.</p><p>Not enough laughter in his life. Just death and violence.</p><p>Then...</p><p>Me.</p><p>Morgan saw herself in his memories, in the days that she already struggled to remember. Standing in the sunshine that last time, feeling normal. Human. He’d watched her. Seen her cry. Not human tears, because then, she’d been beyond that.</p><p>Tears of blood. The sign that her change was at hand.</p><p>“Kill the bitch. Teach them that no vampire is beyond our reach.”</p><p>An image of the pack’s ex-alpha rol ed through her mind. “Do the job. Rip out her throat.”</p><p>Jace stalked toward her. She stood on her balcony, staring up at the night. His claws were out.</p><p>Then she looked down—at him.</p><p>There were no tears this time.</p><p>Jace turned away.</p><p>But the blood didn’t stop. He’d gone back for the alpha. “You can’t take me, boy, you don’t even know how strong I—”</p><p>The alpha’s blood had stained Jace’s claws.</p><p>Morgan tried to shut out the memories. It was too much. She didn’t want to see anymore. No more death. It was al he knew.</p><p>Yet he hadn’t kil ed her .</p><p>As the images kept pushing forward, she realized that Jace had visited her again.</p><p>And again. She hadn’t known it, but he’d been there so many times. Not to kil .</p><p>To guard.</p><p>Jace watched her while she slept and wondered what memories she saw. He knew how the bite worked. Another reason the vamps had stopped drinking directly from humans was because they couldn’t stand the memory overload. When you drank from a live source, you saw memories.</p><p>What did the vampiress see?</p><p>He bent over the bed and wiped away the bloody tears that trekked from her eyes.</p><p>He’d always hated her tears.</p><p>You see me now, don’t you? The dead had piled at his feet over the years. If he had one talent in this world, it was kil ing.</p><p>It would be a talent that aided them when the battle with the demons came. But</p><p>...what would Morgan think of him when she woke?</p><p>“I’m not a fucking monster.” Liar, liar...and who’d know better than her? In his head now, always, there’d be no hiding from her.</p><p>She’d know it al and understand the obsession he carried. For her. He eased away from the bed. He didn’t want to look into her eyes with the memories between them.</p><p>Not yet.</p><p>Jace spun away and left the room.</p><p>He hurried down the hal and shoved open the front door. The afternoon sunlight hit him, bright and hot, the way it always was in Miami. The buzz of insects bled from the nearby swamp, droning on and on. When he jumped down the steps, his first in command, Louis, pushed away from his truck.</p><p>Jace had heard the other wolf drive up. He’d just taken his time about heading out.</p><p>“We got trouble,” Louis said, his Cajun accent rol ing easily on the words. “No one seen any sign of Mike. Nothin’ except his blood in an al ey.”</p><p>Jace’s brows snapped up. “Look, that asshole is just sleeping it off someplace, he’</p><p>s—”</p><p>“That al ey reeked of vamp, alpha.” Louis shook his head. “Not your pretty little vamp. Didn’t smel like sex and blood and flowers...”</p><p>Jace’s teeth snapped together. But, fuck, yeah, that was how she smel ed.</p><p>“More like hate, death, and...brimstone.”</p><p>Brimstone? “You saying demons were there, too?”</p><p>Louis’s shoulders rol ed. “I’m sayin’ we got us a missin’ wolf. And blood and vamps where they damn sure don’t need to be.”</p><p>In wolf territory.</p><p>He glanced back at the house.</p><p>Gravel crunched beneath Louis’s feet. “You gave that cher your blood?”</p><p>“I had to.” It was part of the deal. The vamps wanted a power boost by taking wolf blood. “I gave her mine, and I took hers.” Jace glanced down at his hands. With barely a thought, he had his claws springing out. “It worked just like we thought. Her blood in me...”</p><p>The rush was stil un-freaking-believable. “I can already feel the power.”</p><p>“You gonna get more?”</p><p>“I’l get as much as I can take.” His gaze held the other wolf’s. Louis nodded. “Wil it be enough?”</p><p>“It has to—”</p><p>The world exploded. The blast tossed Jace into the air, and he slammed into the front of Louis’s pickup.</p><p>It took him three seconds to realize it wasn’t the world that had actual y erupted. No, that giant bal of flames had come from his house.</p><p>Morgan.</p><p>The fire ripped up at the sky, twisting and turning.</p><p>Blood dripped down the side of Louis’s face. “What the hel is—”</p><p>Jace ran for the house.</p><p>“Jace! No!” Louis’s footsteps pounded after him.</p><p>He ran faster. Morgan was in the house. A vampire’s skin couldn’t stand the fire.</p><p>She’d die—</p><p>He grabbed the door handle and shoved. The door col apsed beneath his hand.</p><p>“Morgan!”</p><p>He bel owed her name and rushed inside.</p><p>And he tripped over her. Morgan was on the floor, her arm stretched toward the door. Stretched fucking toward him.</p><p>He grabbed her and hoisted her into his arms. The flames crackled and flared around him, licking out at his skin. He ignored the burn. Morgan’s head sagged against him, and her eyes didn’t open.</p><p>Jace held her tight and leapt back through that broken doorway. Smoke bil owed out behind him.</p><p>She barely seemed to breathe. Ash and soot covered her, and Jace could see the angry red blisters that lined her perfect skin.</p><p>Hurt. On his watch.</p><p>Not ever again.</p><p>Windows shattered behind him, and Jace hunched his shoulders, curling his body in to protect her. Glass flew into the air, and shards sank into his flesh. Rage grew within him with each step that he took away from the inferno. Jace didn’t ease his hold on Morgan, not until he’d settled behind Louis’s truck. Then he careful y lowered her onto the ground. Her eyes stil didn’t open.</p><p>“Oh, hel ...” Louis’s drawl. “She’s not...” The shifter’s voice cracked. “The cher ain’t alive, is she now?”</p><p>Jace put his hand over her heart and didn’t feel it beat.</p><p>Chapter Four</p><p>Blood flowed into her mouth, hot and rich, and she drank greedily. The blood brought memories. His memories. Not of death and hel this time, but of a wild run through the woods. The thril of the chase.</p><p>I’m hunting.</p><p>Morgan’s eyes cracked open. She wondered why she hurt. Every part of her body burned and ached and—</p><p>Oh, yes, she burned because she’d been on fire.</p><p>Jace pul ed his wrist away from her mouth. “Don’t ever do that to me again, got it?”</p><p>She was on the ground. No, not on the ground, but sitting on Jace’s lap. His blood was already sliding through her veins, healing her even in sunlight. She wasn’t naked anymore. Because she’d had to run through that fire naked. She’d woken in his room only because the fire licked at her skin. She’d leapt through the flames even as she screamed his name.</p><p>Now she wore his shirt. It smel ed of smoke and him. And her teeth were stil sharp, and she was pissed.</p><p>In a flash, she twisted around and pinned him against the ground. “What did you do?”</p><p>His twisted grin flashed. “Glad you’re feeling better.”</p><p>She felt rather like burned shit right then. “You tried to kil me.” The bastard had left her to the flames.</p><p>That wiped the grin right off his face. “The hel I did.”</p><p>But he hadn’t been there. “You left me when you knew I was weak.” Her hands dug into his wrists. She was aware of the other wolf shifter walking cautiously around her.</p><p>Smart wolf, he wasn’t coming too close, not yet. “You set me on fire.”</p><p>The Council had been right. She should have known better than to trust the alpha.</p><p>Not even married a ful day and he was already trying to kil her. Her teeth snapped together as she glared down at him. She’d actual y started to trust the wolf. How stupid was she?</p><p>“I saved you,” he threw at her and—and he wasn’t fighting her. He was just staring at her, eyes too bright, and...bleeding. Cuts and blisters covered his skin. Blisters, as if he’d been in the fire.</p><p>Her head snapped up. An ugly green pickup blocked her view of the house, but she could hear the crackle of the flames and the stench of the smoke burned her nose.</p><p>“I was out here with Louis when the fire started.” Jace’s voice hummed with quiet fury.</p><p>“Then I fucking raced in for you.”</p><p>“Then I fucking raced in for you.”</p><p>He’d...gone in there for her?</p><p>“I thought you were dead.” So much rage underscored his words. “So I made you drink. I knew my blood could help heal you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Not dead. But close.</p><p>She gazed at him. Her thighs hugged his hips just as they had last night. The memories were there, between them both.</p><p>“Uh, I hate to interrupt this would-be make-out scene...” The other wolf mumbled as he ran a hand over his face. “But I think we got us a real big problem.” Tension had tightened the faint lines on his handsome face.</p> <p>Morgan rose slowly. Her knees wanted to wobble but she forced herself to stand. A quick glance showed the blisters on her arms were almost gone.</p><p>Such powerful blood.</p><p>Jace rose and towered over her. He glanced back at his house, and she saw the muscle flex in his jaw. “Some asshole is going to pay.” He pointed at the blond wolf.</p><p>“Louis, get the pack.” Then he was gone. Running back toward the fire. No, real y, just... no.</p><p>Morgan leapt after him. “Jace, stop!”</p> <p>“Easy.” The other guy—Louis—had his arms around her. She head-butted him and kept going after Jace. But Jace wasn’t heading back into the flames. He raced around the house. Leaned toward the flames. Sniffed—</p><p>Got a scent.</p><p>He spun around and stared at her. His whole face seemed to just go blank.</p><p>“Something you need to tel me, princess?” He murmured, voice a silken threat.</p><p>The fire raged behind him. They were at the edge of the glades. No neighbors to see the flames and cal 9-1-1.</p><p>His chest was bare. His eyes bright. Sexy.</p> <p>Jace closed the distance between them and caught her hand. “Now’s the time. If you’ve been holding back, tel me.”</p><p>Holding back? Morgan shook her head.</p><p>His lips tightened. “So be it.”</p><p>What? Her head throbbed. The sun was too bright. The flames too hot, and, even with Jace’s blood, she was weak.</p><p>Almost human again.</p><p>Before she could speak, Jace had her. The guy moved in one of his quick lunges and caught her in his arms. The world spun, and she found herself hanging over his shoulder.</p><p>“Jace!” He ignored her yelp and marched for the truck.</p><p>Louis was already inside. Morgan slapped her hands against Jace’s rather fine ass. He didn’t stop marching. Didn’t even pause.</p> <p>“What are you doing?” Other than hauling her around like—</p><p>He yanked open the passenger door and tossed her into the truck. “The game just changed on us.”</p><p>Her hair fel over her eyes. Morgan shoved it back and frowned at him. “This isn’t a game.”</p><p>“No.”</p><p>The truck’s motor snarled to life.</p><p>“You know whose scent I caught al around that house?”</p><p>Louis pul ed out his phone and dialed quickly.</p><p>Morgan licked her lips. “Demon scent.” It made sense. If they knew she’d agreed to team up with Jace, then they’d come after her. She just hadn’t expected an attack so soon.</p><p>“Got a fire out on Mooreline Road,” Louis said into his phone. “Send the trucks.”</p><p>“Not demons.” Jace spared a glance back at his burning house. “Not this time.” His gaze came back to her. “You were almost burned alive by your own kind. It’s the vamps who came</p><p>—their stench was al around the house. They set the fucking place to blow with you inside it.”</p><p>When a wolf stormed a vampire stronghold, he damn wel stormed it. Louis drove the pickup right through the fancy electronic gate at the vampire compound. “Don’t do this!” Morgan ordered Jace, grabbing his arm. “It’s a mistake! They didn’t attack me!”</p><p>Yeah, they had. And they’d pay.</p><p>The other wolves in his pack flooded in behind them.</p><p>Attacking in the daylight gave them the advantage, and Jace was more than ready to kick some vampire ass.</p><p>He jumped out of the truck and barely held back his howl of fury. She hadn’t even seemed to be breathing. Oh, yeah, vamps were about to pay. Morgan hopped out right behind him. Dogs were barking, snarling. Figured the vamps would keep Dobermans as their attack dogs.</p><p>Jace turned his head and snarled at the dog. “Bite me,” he dared.</p><p>“He won’t,” Morgan said, voice soft and wan because she’d nearly died, “but if you don’t stand down, I wil .”</p><p>Then his vampiress put herself between him and the entrance to the vampire pit.</p><p>Not a pit, real y. More like a mil ion dol ar mansion. The vampires had to do everything with style.</p><p>“You’re choosing the wrong side,” he told her as his pack lined up behind him. But she shook her head even as he heard the soft echo of an alarm from inside the mansion. The vamps were coming...</p><p>“They didn’t do this.”</p><p>“Their scents were everywhere.”</p><p>The door opened behind her. He’d expected human guards. Instead, the vampires fil ed the doorway. Three men. Forever young. Pale like Morgan, but with wide shoulders and hard jaws.And eyes that burned with rage.</p><p>“What is the meaning of this, Morganna?” The first guy demanded, an old-school English accent dripping from the words.</p><p>“We’ve got a problem,” she said, not glancing back. “He thinks you tried to kil me today.”</p><p>Silence.</p><p>Morgan blinked and, this time, she did look back over her shoulder. “Tel him it’s not true, Devon,” she demanded. “Tel him you didn’t—”</p><p>“Try to burn her to ash while she was stil in my bed,” Jace finished, his claws stretching. It would be so easy to kil that bastard. One stroke from his claws, and the vampire’s head would hit the ground.</p><p>“We merely...tested,” Devon said quietly as he shrugged. “It was necessary.”</p><p>Morgan rocked on her heels, then spun around and caught the vamp bastard by his throat.</p><p>“Run that by me again.”</p><p>Devon blanched. “Ah, Morganna...”</p><p>“You tested me? With fire?”</p><p>He tried to talk, but no sound emerged from his lips.</p><p>“She’s startin’ to remind me of someone...” Louis murmured from beside Jace.</p><p>“Morgan?” Jace cal ed out.</p><p>Her hold tightened on the vampire.</p><p>“I don’t think he can speak,” Louis shouted, probably in what he thought would be a helping way.</p><p>Morgan’s hold eased a bit.</p><p>Oddly enough, the other two vampires didn’t move to restrain her. Smart of them, because if they’d touched her, Jace would have ripped them apart. They just waited.</p><p>Watched. One even glared at Devon Shire, Council-fuckingextraordinaire-member.</p><p>Jace had come across Devon before. Almost kil ed him twice. Third time will be the charm.</p><p>“You drank his blood.” Devon’s voice held a distinct wheeze now. “We had to see</p><p>...had to make sure it was making you stronger...”</p><p>“So you set me on fire?”</p><p>But Devon didn’t back down. “If you’re going to shut the doorway to hel , you have to be able to withstand the heat, Morganna. We have to test your skin, see how it’s holding up against the flames—”</p><p>She punched him, a hard right cut that took the vampire down.</p><p>“Looks like your strength’s improving, Morg,” one of the other vampire’s said, lips twitching.</p><p>Fuck this. “Kil them,” Jace ordered.</p><p>Morgan whirled around, eyes wide. “Wh-what?”</p><p>The wolves were already shifting.</p><p>“Come.” He held his hand to her. “No sense in you watching them get ripped apart.”</p><p>The smiling vampire lunged forward then. A tal bloodsucker, with pale green eyes and a sloping scar that wrapped around his chin. One made, not born, or he wouldn’t be sporting that scar.</p><p>The blond made the mistake of putting his body between Morgan and Jace. “We’re not your prey,” he snarled.</p><p>Morgan put her hand on his shoulder. “Paul...”</p><p>Fury pushed through Jace’s body. There was something between them, he could see it. Smell it.</p><p>Morgan’s blood, in the vampire. She’d made him.</p><p>Oh, the fuck, no.</p><p>His claws burst from his fingertips as he prepared to attack. The wind whipped around them, blowing hot and hard. Wait, hot?</p><p>He glanced up at the sky and saw the creatures coming. Flying toward them.</p><p>Fucking flying in daylight.</p><p>Demons.</p><p>“They are the ones we need to fight!” Devon screamed as he scrambled to his feet. “Not each other!”</p><p>This from the asshole who’d torched his place?</p><p>But then Devon surprised him. The guy grabbed Morgan and hauled her back toward the house. “You’re not strong enough yet. We can’t let them get you!”</p><p>Now the asshole was protecting her?</p><p>Jace’s men spun around, snarling at the new threat. A threat that smel ed of brimstone and death. The demons looked like humans, for the most part. Their faces appeared human, their bodies shaped like men. But they had claws that sprouted from their hands, claws even sharper than a wolf’s. Big and strong, demons had eyes that blazed as red as hel and skin that was twisted and marked with scars that sliced across their flesh. Demons could fly. Demons could control fire. And, most days, demons could kick ass. Not today.</p><p>His gaze met Morgan’s. A vampire in the sunlight. Even with his blood, how strong could she be?</p><p>He shoved back the one she’d cal ed Paul. “Get inside.”</p><p>Paul didn’t move. “We fight, we don’t flee, we—”</p><p>The demons hit the ground and came running. The wolves turned, holding their line, not attacking, not yet.</p><p>Not until Jace gave the word.</p><p>“I’m the one who gets to rip you apart,” Jace promised. “Not them.” Demons...</p><p>“Now get Morgan inside. ”</p><p>“Jace!”</p><p>He didn’t turn at her cry. He grabbed Louis, stopping his friend before he could change. The heavy metal door swung shut behind the vampires.</p><p>The demons were smiling, showing fangs as sharp as a vampire’s.</p><p>“Guard the door,” Jace ordered. “Nothing gets to her.” No one. Louis nodded.</p><p>“Send them back to hel ,” he told his men as his bones began to shift. The change didn’t even hurt, not anymore. Al he could think about now was the battle. “In pieces.”</p><p>The wolves attacked.</p><p>“They’re fighting for us,” Devon’s voice trembled. “They’re actual y honoring the agreement.” Morgan paced. She’d quickly changed once she’d entered the compound. No longer overexposed in Jace’s shirt, she now wore jeans, a t-shirt, and her boots. As she paced, the sounds of battle seemed to burn her ears. Howls. Screams. “We need to be out there!”</p><p>But Paul shook his head. “The demons came at us in the daylight. They knew we’d be weak.” The sun would set soon, just not soon enough for them.</p><p>“They didn’t know we’d have the wolves with us!” Devon was al but crowing. “The bastards can fight and kil each other off, and when night comes, we’l be stronger than them al .”She was tired of the Council leader’s bul shit. Jace had fed her twice. He had to be weak from that loss, and now he was out there, fighting, while she stayed safe inside?</p><p>No.</p><p>“What if I’d died this morning?” She’d never forget waking to that blaze. The bastard must have planted one of his bombs. She knew he’d taken out other enemies that way over the years.</p><p>Am I an enemy?</p><p>“It was merely a test, Morganna. Merely—”</p><p>More howls from the wolves and screams from the demons. A demon’s scream sounded like nails ripping down a chalkboard. “What if I’d died? Jace had to pul me from the fire. He could have left me there. I would have burned.”</p><p>Devon just stared back at her with his soul ess blue eyes. “Then we would have known the plan wasn’t working.”</p><p>The big plan. To mix the blood of a vampire and a werewolf. To create a being strong enough to shut the doorway to hel , a being who’d be able to survive the fires of hel long enough to make sure that doorway stayed closed. Forever.</p><p>A vampire couldn’t do it on her own. Fire kil ed vamps too easily. At least, it had before. But today, the fire hadn’t destroyed her. An inferno that should have kil ed her had only left her with blisters.</p><p>“You just need more blood from him,” Devon said with a nod. “More blood, and you’l be strong enough for the job.”</p><p>Paul had moved to peer through the series of spy holes located along the room’s perimeter. “Or he wil be.”</p><p>Now Devon final y showed emotion. Confusion. “What?”</p><p>Paul whistled. “That wolf is cutting right through the demons. Slashing every last one. Never seen anything like this...”</p><p>She shoved him aside and stared through the spy hole. Her gaze locked on the wolf, a wolf that was bigger than he had been last night. The giant black beast turned around and Jace’s bright stare flew past her as he snarled.</p><p>His teeth and claws were covered with blood.</p><p>“He’s not supposed to be that big,” Devon muttered. “I’ve seen him shift before, he’s not—” Devon broke off as he caught her arm and jerked her toward him. “You let him drink from you.”</p><p>Her shoulder seemed to burn, and she remembered his bite. “You know the rules of a werewolf mating. He had to drink.”</p><p>But Devon started shaking his head. “I didn’t realize...the bastard knew! ”His hands wrapped around her shoulders, and he hauled Morgan off her feet. “Don’t give him anymore blood.” Spittle flew from his mouth.</p><p>“What? Look, you know you don’t have to worry about me turning him. Werewolves can’t become vampires.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The transformation from human to vampire was brutal. The victim had to be near death, a heartbeat away from the afterlife. The vampire had to drain her prey and then force him to drink her own blood.</p><p>Only...werewolves had never transformed. Vamps had tried to change a few of them, centuries before, but it hadn’t worked. Their beasts were too strong to die. They couldn’t transform.</p><p>Devon had told her that. He’d been the one to “experiment” on those unlucky wolves in the past.</p> <p>Did Jace know? Did he realize that Devon had captured wolves over the centuries and sliced them apart to see how much pain they could take? To learn how fast they’d regenerate?</p><p>Know your enemy. One of Devon’s favorite phrases.</p><p>Asshole.</p><p>He’d ruled the vampires in this area for too long. But now he wasn’t the strongest vamp in the room.</p><p>I am.</p> <p>Devon didn’t even seem to see her as he said, “They can’t become like us...” His gaze stared at the past. “Fucking animals...should have seen it...didn’t think...” He spun around and his fist slammed into the wal . “They can become more.”</p><p>The screams stopped, but the howls didn’t. They grew louder. Wilder. The wolves had won. Vanquished the demons.</p><p>“More wil come,” Paul said and she knew he was right. The flood of demons wouldn’t stop, not until that doorway was blocked.</p><p>Time to shut that door. If a demon was left alive, they could force him to show them the entrance to hel .</p><p>“You can’t, Morg. You’re not strong enough,” Paul said. Ah, Paul, he knew her so wel . She glanced over at him. “Guess we’l see about that.”</p><p>He flinched and there was no missing the worry on his face.</p> <p>It had been three years since she’d turned him. He was the only human she’d ever turned. Sometimes, she wondered...did he wish that she’d just left him to die?</p><p>“You can’t let him drink from you again!” Devon was stil screeching as she marched away from him. “Morganna! Do you hear me? You can’t?”</p><p>She threw a hard glance back at him. “You forget yourself, Devon. You can no longer tel me what I can or cannot do.” She bared her teeth at him. “I’m not part of the vampire nest anymore.”</p><p>His lips parted.</p><p>“I’m wolf.” So shove that down your throat and choke on it.</p><p>“You don’t understand. I didn’t realize—he’l become more! ”</p><p>She yanked open the door and the scent of hel hit her. “He already is.” And he’s mine. Morgan strode into the sunlight. The big, black wolf stood in the middle of the carnage. When he saw her step out of the compound, his body tensed.</p><p>But the battle was over. His men were already shifting back to their human forms.</p> <p>He began to shift as wel .</p><p>And that was when the other two demons dropped from the sky behind him.</p><p>Demons...so tricky. So deceptive. They’d waited until he was weak. His attention divided. Because of me.</p><p>“No!” She screamed even as they slashed at Jace. Their claws sank into his back.</p><p>She moved faster than she’d ever moved in her life. She grabbed the first demon and twisted his head. The snap barely slowed her down. She turned for the other hel spawn</p><p>—</p><p>But Jace’s men had already ripped him apart.</p><p>She spun back around. Jace stood before her, naked, body heaving, blood pouring from him. Fear tightened her throat. “Jace?”</p><p>His eyes were blind, not seeming to see her at al . She stared down at his chest.</p><p>The demon’s fist and claws had ripped right through him, back to front, and, oh, no, please...</p><p>The demon had cut through his heart.</p><p>Chapter Five</p><p>Morgan caught Jace before he fel . A scream ripped from her as she held him as tightly as she could.</p><p>And she knew what she had to do.</p><p>She’d found Paul like this. He’d been beaten, bleeding out, dying in a dirty al ey al alone. He hadn’t been able to speak because a knife had been stuck in his throat. His lips had trembled and he’d mouthed, Help me.</p><p>She had. A stranger, and she’d given him forever.</p><p>She’d damn wel save the man she’d taken as husband.</p><p>She lowered Jace gently to the ground. The pack closed in around her, nearly blocking the light. Louis stood right beside her. She grabbed his hand before he could stop her. His claws were stil out, and she sliced them down the length of her throat.</p><p>“Cher, no, what—”</p><p>Blood dripped down her neck and wet her shirt. She leaned over Jace. His eyes were open. On her. “Drink from me.”</p><p>A slight flare of his pupils. She put her throat against his mouth. “Drink.”</p><p>His lips parted. His tongue licked her skin. The edge of his teeth scraped over her neck. Then he drank. Slowly at first. So slow.</p><p>After a tense moment, his hands rose and wrapped around her. He pul ed her closer, held her tighter.</p><p>Tighter.</p><p>She felt his canines expand and push into her skin. Morgan held her body stil . He needs this. His mouth worked on her flesh. Lips. Tongue. Teeth. He took.</p><p>“Stop!”</p><p>Devon’s scream. Over Jace’s shoulder, she saw the Council leader trying to shove his way through the pack.</p><p>They shoved him back.</p><p>“Morgan, no! He’ll destroy you! All of us!”</p><p>But Jace had saved them today. She closed her eyes. She’d begun to feel the heavy pul of the sunlight, like a weight upon her skin. Pressing against her. Devon stopped screaming.</p><p>Her fast heartbeat slowed. Her breath sighed out of her.</p><p>Stil Jace held her. So very tight.</p><p>He...he should have enough blood now. She brought her hands up and pushed against his chest.</p><p>He didn’t stop. Fear tightened her stomach.</p><p>Then Jace swiped his tongue over her throat and his growled whisper reached her ears,</p><p>“More.”</p><p>She wondered just how much more he would take.</p><p>Devon stumbled away from the wolves. Fucking animals. Any minute now, they might rip into him. He hadn’t forgotten the alpha’s order. The bastard had ordered his death as carelessly as he’d order dinner. Kill them.</p><p>When the alpha’s strength came back, Devon had no doubt that he’d give the same order once more.</p><p>The way the alpha was gulping Morganna’s blood, his strength would be back in seconds. Should have realized...so blind...</p><p>He rushed through the compound, winding down deep into its hidden tunnels.</p><p>Escape tunnels—because the vampires always had to be prepared.</p><p>He snaked through the tunnels, moving perfectly in the pitch blackness. To the left, to the right...</p><p>He punched in the combination to the door in front of him. The heavy lock opened with a hiss, and he hurried inside.</p><p>There wouldn’t be time to waste. Kil or be kil ed.</p><p>Once Jace finished off al the demons, there would be no stopping that alpha. He’d want total control of the area.</p><p>And Devon wasn’t about to bow down to an animal.</p><p>“Let me the fuck go!” The shout from his captive echoed in the lab. His lab. His playroom.</p><p>Devon grabbed a scalpel from the table. Its edge gleamed so perfectly in the light.</p><p>When he’d first started his experiments, Devon had always used his hands. Then he’d realized the others thought he enjoyed the work too much. Because I do.</p><p>So now he used the surgical instruments to make it look more...clinical. Still the same. They bleed. I smile.</p><p>No one was in the lab but his latest specimen. If Morganna knew that he hadn’t stopped the experiments...</p><p>Oh, wel , the bitch couldn’t stop him now. No one could.</p><p>He crossed to stand in front of the wolf. “You’re going to be very useful to me, Mike.” If Morganna’s strength had increased with a few swal ows of wolf’s blood, just how strong would he become if he drained a whole wolf?</p><p>Strong enough to fight off the alpha. Strong enough to rule. The wolf glared at Devon. “Go fuck yourself.”</p><p>Devon sliced across the wolf’s throat with his scalpel. Then he caught the flowing blood in a cup.</p><p>He wouldn’t dirty his teeth on the wolf’s flesh.</p><p>The wolf strained against his chains as his blood poured from his body. Devon smiled.</p><p>Jace’s men carried in the demon that Morgan had attacked as the wolves pushed inside the vampire stronghold. The guy’s head was twisted and hung at a sagging angle. Not for long, though. A broken neck wouldn’t kil a demon. But when I take that neck from his body...</p><p>Dead demon.</p><p>Jace had never been inside the vampire mansion before. He’d stalked outside plenty of times. Come kil ing close, but never actual y walked the hal owed hal s. But, yeah, it was as high-priced as he’d figured. Fancy furniture. Marble tiles. Big, glittering chandeliers. Money.</p><p>Class.</p><p>And...a blood fountain.</p><p>He turned away from the fountain and found Morgan staring at him. Even paler than before, but she stil met his gaze. Her lips weren’t red now. Instead, they were the lightest shade of pink, and the gold had faded from her eyes.</p><p>Took too much.</p><p>Her blood and the rush of power that came with it were addictive. He’d have to be more careful with her. Far more careful.</p><p>“How long?” Jace asked Louis.</p><p>Vampires lined one side of the room. Wolves the other. Jace stood in the middle.</p><p>Morgan...she waited next to the vamp he’d been itching to slay. The one who touched her far too much. Paul.</p><p>“Ten minutes. Maybe five.” Louis shrugged. “Could be sooner. You know they never stay out long.”</p><p>Not much time, but... He strode forward and took Morgan’s hand. When he touched her, he caught the deepening of her scent. Not with arousal.</p><p>Fear.</p><p>Took too much.</p><p>Louis had needed to pry her out of Jace’s arms. He clenched his teeth as pain ripped through him.</p><p>If Louis hadn’t stopped me... His breath rushed out.</p><p>Another debt I owe that wolf.</p><p>“We need to be alone.” The blood had dried on her throat. Her wounds were closed already, but dark shadows lined her eyes.</p><p>“No, wolf,” this came from the fool who would be her protector. “That’s the last thing you need.”</p><p>The wolves shifted, inching forward, and he could feel their aggression level spiking in the room.</p><p>Because his aggression level was damn wel spiking. “Don’t get between us again.”</p><p>But the vampire stepped forward. “I’m not afraid of—”</p><p>“Death?” Jace finished silkily. “You sure about that? Because one fine dark night, in an al ey that smel ed of blood and vomit, you sure seemed afraid to me.” Jace wasn’t exactly sure how it had happened. Vampires were the only ones who were supposed to be able to drink memories.</p><p>But when he’d taken Morgan’s blood moments before, he’d seen her life. Seen her transform this one—Paul—even as she cried and whispered her apologies. She hadn’t wanted to make him into a monster, but she hadn’t been able to let him die, not when he’d wanted to live.</p><p>“You asshole—” Paul lunged at Jace with bared fangs.</p><p>“Stop.” Morgan’s quiet voice. Her hand touched Paul’s shoulder. The vampire stil ed instantly.</p><p>Morgan tilted her head back and met Jace’s stare. “How do you know about that night?”</p><p>No point lying. Besides, he didn’t want to lie. Not to her. “I drank your memories, princess.”</p><p>Instant murmurs of disbelief came from the vampires. Paul shook his head. “No, no way, that can’t happen. Plenty of humans have tasted our blood and seen nothing. ”</p><p>“I’m not human.” Jace stated the obvious. “Those rules don’t apply to me.” And in their blood past, al those long centuries of hate that stood between the vampires and werewolves, wel , his kind hadn’t wanted to spend time tasting a vampire’s blood.</p><p>Ripping them apart. Beheading them.</p><p>Not sampling the blood supply.</p><p>“The game has changed now,” he said as the vampires and wolves eyed each other. He didn’t know if that was good or bad. Behind him, he heard the snap of bones.</p><p>Jace glanced back. That snap hadn’t come from one of his own shifting. The demon’s neck was popping back into place. Not much longer.</p><p>“Hold him,” he ordered Louis. “Don’t...start until I get back.”</p><p>Torture would come. Anything, everything that he had to do in order to make the demon talk.</p><p>Then he glanced back at Morgan. “You need me,” he told her.</p><p>“Why?” From Paul again. “Do you real y think she needs someone to drain her dry?”</p><p>The bastard was begging for a beating. Begging. But... Morgan cares for him.</p><p>“The way you did when she changed you? How many days did she sleep after that because you took too much? How many—”</p><p>“Enough!” Morgan’s shout froze them al . She looked like a breeze would topple her then, but her voice packed a punch of undeniable fury. “You.” She jabbed her finger at Paul.</p><p>“You were desperate, changing—you had to take my blood. I offered it to you.”</p><p>Paul smirked. Begging.</p><p>“And you.” She exhaled as she shook her head and focused on Jace. “What did you think I was going to do? Let you die in front of me?” Before he could answer, she ran a shaking hand over her neck. “You might be an alpha asshole, but you’re mine, and I wasn’t letting you go without a fight.”</p><p>“And I won’t let you go.” Ever. His hand lifted and rubbed lightly over the marks he’d left on her flesh. “Now you need me... let me help you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her tongue snaked out and licked over her lower lip. He knew she understood his meaning because her fangs started to grow.</p><p>“The battle’s coming. You have to be strong.” A strength she’d get from him. He eased back and offered his hand. “Come with me.”</p><p>But she was shaking her head. “This isn’t your place, wolf.”</p> <p>A stiffness fil ed his chest. Pain.</p><p>“It’s mine.” She grabbed his hand. “So you come with me.” Then she led him away from the vampires and wolves. Led him up a spiral staircase and into a room without windows. A room that smel ed of her.</p><p>Before the door closed, he had her in his arms.</p><p>Five minutes.</p><p>Not even that. Not now.</p> <p>His lips took hers. Jace thrust his tongue inside her mouth. She kissed him back with no hesitation, even though the scent of fear stil hovered on her skin. He stroked her with his tongue, caressed with his lips, but the scent remained. Jaw clenching, he lifted his head. “Stop.”</p><p>Her lashes rose, and she blinked at him. “Why?”</p><p>“Because you fear me.” He stalked away from her. It was either step away or pounce, and he wanted to show her that he could have restraint. It won’t last long.</p><p>They were in an apartment of sorts. A leather couch. A TV. Bookshelves. Then toward the right...a bed. A big, four-poster.</p><p>Morgan, in that bed...</p><p>An image too tempting to resist. Let the demon wait. The vamps and wolves could keep him...entertained.</p> <p>He reached for Morgan’s hand. Entwined his fingers with hers and led her to the bed. She sat down on the edge of the mattress and stared up at him. “I can’t figure you out, wolf.”</p><p>“You’ve tasted my life.” Now he truly knew what that meant. “How can I possibly have secrets from you?” He lowered onto his knees and positioned his body between her spread legs. Then Jace tilted his head and offered his throat. “Drink.” The ultimate pose of submission. For her, only her.</p><p>She’d nearly traded her life for his. Louis, we’ll name our first son after you</p><p>—because you fucking saved my ass.</p><p>If he’d gone too far, taken too much from her...</p><p>Her eyes seemed so wide as she gazed at him.</p><p>“Don’t fear me,” he’d meant the words as a plea but they came out sounding like an order. Dammit. He cleared his throat. “It won’t happen again. I give you my word it—”</p><p>“You were already pul ing back before Louis dislocated your shoulders.”</p> <p>He blinked.</p><p>“You kept your control. And the blood—it was freely given.”</p><p>She wasn’t drinking from him. Why the hel not?</p><p>Her hand slid down his shirt. Pressed against his heart. His chest was bare. After the shift and the fury, the wolves had dressed in their back up jeans, but most hadn’t bothered with shirts. Her touch seemed to burn right through his flesh.</p><p>She stared down at her hand. At his chest. “What separates the man from the beast?”</p><p>Morgan asked softly.</p><p>He forced his jaw to unlock. “There is no separation.”</p><p>Her hand dipped lower. Found the snap of his jeans. “When you’re a wolf,” her voice grew huskier, “do you stil have the mind of a man? Some stories say no. Others say yes.”</p><p>The zipper hissed down. “It’s...both.” Man and beast.</p><p>Her fingers curled around his aroused flesh. “How do you see me then? As prey?”</p><p>“No.” The wolf had only wanted to protect her. As did the man. Her thumb slid over the head of his arousal. “As what?” Her eyes held his.</p><p>“As everything.” Because that was what she’d become. Had it started that long ago night? Started with bloody tears and culminated when he’d taken her flesh?</p><p>Didn’t matter. To him, she was...al . Everything.</p><p>“Good answer,” she whispered as she leaned forward. “Very, very good.” Her fangs sank into him—not in his throat, but at the curve of his shoulder. The exact place he’d marked her for their wolf claiming. She was—she was claiming him . Pleasure exploded through Jace at her bite. White-hot, pulsing. Inside, his wolf howled even as Jace wrapped his arms around Morgan and held tight.</p><p>They tumbled back on the bed. Her mouth stayed on him. He shoved off her jeans.</p><p>She hadn’t bothered with underwear. Good. That made things so much easier. Her tongue swiped over the smal wound she’d made on his flesh. He shuddered against her. “Oh, damn...” His head rose, and he stared down at her. She was the most beautiful thing he’d ever seen in his life.</p><p>No way would he be heading into hel without having her once more. Jace thrust into her in one long, hard drive. Her gasp fil ed his ears, made him al the wilder, as her legs wrapped around him. Morgan arched her body and met him, thrust for thrust.</p><p>Faster, faster.</p><p>Their eyes held. Their breaths heaved out.</p><p>Her body was tight and slick, and Jace’s thin control slipped away with every sensual move of her body.</p><p>He took her mouth even as he took her body.</p><p>Nothing was as good as this.</p><p>Her sex clenched around him when she came, and he felt the ripples of her release al along the length of his cock. Stil he thrust. Deeper. As far as he could go—</p><p>“My turn,” Morgan whispered.</p><p>In the next instant, Jace was on his back, and she rose above him. Then she rode him, her movements as wild as his, and he knew, he knew he’d never find anyone else like her. He heaved up and took her breast in his mouth. The nipple was pink and sweet, and he scored her flesh with his teeth.</p><p>They both liked to bite.</p><p>This time, when she came, he erupted with her. Pleasure had him going nearly blind. He held onto her as tightly as he could.</p><p>The drumming of his heartbeat fil ed his ears. Morgan gasped his name, and he was pretty sure he’d shouted hers.</p><p>The pleasure faded slowly. The ravenous need met, they stared at each other.</p><p>Jace realized this moment was important, but damned if he knew what he should say to her.Morgan didn’t climb off him. She stayed there, and her pale skin seemed to shine.</p><p>From the pleasure? His blood?</p><p>“If we keep this up,” she final y said as her hands slid over his chest. “You could get me pregnant.”</p><p>That was the plan. Or it had been. To have a child with a vampire’s immortality and a wolf’s brutal strength. A child to rule them al .</p><p>But now...</p><p>Was that ever really the true plan? Or just an excuse he’d made to have her?</p><p>“Could you love a child that was part vampire?”</p><p>I already love her mother. I have for years. Instead of answering her, he asked,</p><p>“Could you ever love an animal?”</p><p>She blinked. Now her fingers rose and traced just under his jaw. “I don’t see an animal.”</p><p>The woman could break him.</p><p>Fuck, how had this become confession time? “Hel ’s waiting.” As much as he wanted to ignore the devil at the door, he couldn’t. Slowly, he eased away from her body. He rose, snagged his jeans, and dressed. His eyes couldn’t seem to stay off her. She climbed from the bed. Didn’t dress, but did grab his arm. “I’m not letting you go in alone.”</p><p>His body iced. “That wasn’t the deal.” He knew. He’d been the one to go to the Council and lay out the scheme. “I’m the one who goes in, who closes that bitch from the inside. You were the one who was supposed to—”</p><p>But she gave a sad shake of her head, interrupting him, and confessed, “I was the one who was supposed to betray you and make sure that the doorway closed with you trapped inside.”</p><p>Chapter Six</p><p>Sonofabitch. He’d wondered...and had known that the vampires gave in too easily to his demands. “Let me guess—Devon’s plan?”</p><p>“Devon hates wolves.” A faint shrug lifted her shoulders. “He told the others I would go in as an assassin. Fool you, take your blood, and get strong enough to close the door.”</p><p>His claws were out. “So why are you confessing to me? Seems like one fine plan.”</p><p>And he’d been such a blind fool. Wanting her, needing her so much, and she would have just—</p><p>“Because it was never my plan.” Her gaze locked on him. “But maybe those memories haven’t come to you yet.”</p><p>What? “I only saw you change Paul.” He’d seen it, like a living nightmare in his head. Her, running into that al ey. Finding the bloody mess that was Paul, with stab wounds al over his body and a knife shoved into his throat.</p><p>He’d wanted to live...</p><p>“When we find that doorway,” she told him, voice calm, “I am going in with you—and we’re both coming out. That’s the new deal.”</p><p>He swal owed. “Why?”</p><p>“Because I won’t let you face hel alone.” Now her expression changed. Softened.</p><p>“And if I need to, I’l haul your ass out myself. I just found you, wolf, and I’m not about to lose you.”His fingers slid under the thick weight of her hair as he tilted her head back.</p><p>“You won’t.” He kissed her. Long, hard, hot. Kissed her and wanted her again. Soon...</p><p>soon he’d have her forever.</p><p>If he managed to survive the night.</p><p>The vamps and the wolves hadn’t kil ed each other. Morgan thought that was a good sign. Wel , mostly good.</p><p>When she and Jace re-entered the great room, the wolves were stil lined up on the left, and the vamps were glaring on the right. The vamps seemed a bit cockier now, probably because they were gaining strength from the setting sun.</p><p>Two of the wolves held the now conscious demon. The guy’s face was broken and bloody, so it looked like the wolves had been enjoying some play time. Louis raised a brow. “Al better now?”</p><p>Jace growled at him.</p><p>But, actual y, yes, she was better. One hundred percent better. Power seemed to pulse in her veins. If this rush would come to her each time that she and Jace exchanged blood, then she’d make sure they exchanged every day for the rest of her life. Since she planned to spend al of her days and nights with him, an exchange wouldn’t be a hardship at al .</p><p>Her blood would enable him to live longer. Human mates who sipped from their vampire lovers could stay young and strong as long as they had that blood supply.</p><p>She’d make sure Jace fed wel and often.</p><p>“You’re feeding a dog?” The demon spat blood on the ground at Jace’s feet.</p><p>“Vampire, don’t you know better than to—”</p><p>Jace lunged and grabbed the demon around his throat. “I’m going to slice you open.”</p><p>The demon just laughed. “I’ve been in hell, asshole. You can’t do anything to me that hasn’t already been done.”</p><p>And Morgan hesitated. The demon had a point.</p><p>“We’l see.” Jace didn’t seem worried. “Once I slice off your hands and crack open your rib cage, we’l find out if you feel like talking then.”</p><p>But the demon shook his head. “Been there, done that. Why do you think we’re al coming out? This world...” His red eyes flew around the room. “It’s life. We’re coming, and we’re taking it over, and you can’t stop us.”</p><p>“We’l shut your damn door,” Jace promised, “and you’l stay in your cage.”</p><p>More laughter. “Not if you can’t find it.”</p><p>“You’l talk,” Jace promised. Then he glanced back at Morgan. “You don’t...want to see this.” But she read his eyes and understood. Don’t watch me do this. He would torture. He would push and push and push...because he wanted to save her. Save his people.</p><p>But sometimes, there was just too much darkness, too much of a price, to be paid for some actions.</p><p>“There’s another way.” A better way because her gut told her that the demon wasn’t bul shitting. He wouldn’t break. What can we do that hell hasn’t done?</p><p>Jace stil ed.</p><p>Morgan spared a swift glance for the vampires. Men. Women. Their gazes were determined, their bodies tense. They understood what she meant. They were ready.</p><p>She licked her lips and offered, “We can drink from him.”</p><p>The demon’s bel ow shook the mansion, and she knew that they had the bastard.</p><p>You won’t talk. Fine. “We don’t need you to talk,” she said as she crept closer to him.</p><p>“We just need you to bleed.”</p><p>Time to sample the demon’s memories.</p><p>Jace blocked her path. “This is a shitty plan.”</p><p>She smiled at him. “It’s a plan that wil work. You know we pul memories with the bite.”</p><p>“Yeah, but just what else wil happen when you bite him? You ever had demon blood?”</p><p>No. “Never had the pleasure,” she said and saw the demon tense.</p><p>“It could be poison. It could fry you from the inside out. It could—”</p><p>“I’d never had werewolf blood until I tasted you.”</p><p>That stopped him. Only for a moment. “Yeah, princess, but we al know that once you go wolf, you don’t go back.”</p><p>And there, when she shouldn’t have, when it was the wrong time and the wrong place, she laughed.</p><p>Jace froze. Then he squeezed his eyes shut. “Don’t do that.”</p><p>“Do what?” What was her wolf talking about now?</p><p>His eyes opened and a muscle flexed along his jaw. “You aren’t tasting him.” He pointed to the vamps behind them. “One of those assholes can do it. They can all do it.</p><p>But not you.”</p><p>He pul ed her close. “I don’t want you having memories of hel .” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He stil didn’t get it. “I don’t need you to protect me.” She motioned to the vampires.</p><p>They lined up. Al of them ready.</p><p>“Because they’ve got your back?” Anger roughed his voice.</p> <p>“No, because I’m a fucking vampire princess.” She bared her fangs. “And I’m riding high on my wolf’s blood.” Time for ass kicking. She pushed past Jace and grabbed the demon, wrenching him away from the wolves. “Remember me? I’m the vamp bitch who broke your neck.”</p><p>His red eyes bulged as she promised, “I’m also the one who’s going to drain you dry.”</p><p>Louis snapped his fingers together. “Now I know who she reminds me of...” His gaze flew to Jace. “You.”</p><p>Jace snarled.</p><p>“Come ahead, bitch,” the demon dared. “You think you’re strong? My blood wil burn you from the inside out.”</p> <p>“Promises, promises,” she whispered and moved as fast as Jace had, a blur. She grabbed the demon’s head and yanked it back. “Bleed for me.”</p><p>She sank her teeth into him.</p><p>His blood fil ed her mouth. Warm. Not burning. But bitter. So bitter. She drank and took the memories. Fire. Hel . Screams that never ended.</p><p>“Morgan.” Jace’s hands settled on her back.</p><p>She kept drinking.</p><p>A white light entered hel . Smal . Such a narrow opening. A man’s voice cal ed.</p> <p>Chanting. Serving up blood sacrifices. Trading lives because he wanted power.</p><p>“Stop!” The demon bel owed.</p><p>She drank more.</p><p>More.</p><p>The doorway opened. She saw the bastard who’d unlocked that door. Fucking asshole. Betrayal.</p><p>The door opened in her mind, and fire raced out, burning, burning...</p><p>Morgan jerked away, screaming, as smoke rose from her mouth.</p><p>The demon laughed. “Told you, b-bitch...you’l burn...”</p> <p>She could feel the blisters in her throat. But...but she was already healing. Jace’s blood.</p><p>She blew the smoke into the demon’s face. “Time for you to go back home.”</p><p>He flinched.</p><p>“Tel me you know where the doorway is,” Jace growled the words behind her. She held the demon’s red stare a moment longer, long enough to see the fear flare in his eyes, then she faced Jace. “I know.” But first she had another matter to take care of. A little matter of a blood betrayal.</p><p>“Good.” Jace pul ed her away. “Then it’s time to kil the bastard.”</p><p>The demon screamed in fury and surged against the wolves who’d grabbed him.</p><p>Morgan slipped back a few steps. She caught Paul’s stare and inclined her head toward the door.</p><p>The demon’s screams rose.</p><p>She swal owed back the taste of ash. “Where’s Devon?” She whispered to Paul.</p><p>Betrayal. She should have seen this coming. He’d always been such a power hungry asshole.</p><p>He hadn’t been testing her with that fire. He’d wanted to kil her. So she wouldn’t find out what he’d done.</p><p>You nearly killed us all.</p><p>Paul’s eyes narrowed. “What did you see?”</p><p>“Devon kil ing humans.” Not just kil ing. Torturing. Sacrificing. “He’s the one who opened the doorway.” It made sense, but she’d been too blind to see it before. Devon was over five hundred years old. He would know al the ancient legends and spel s. He would know how to raise demons, how to open a doorway.</p><p>And to get power, he’d done it.</p><p>Only the demons he’d let out hadn’t exactly been keen on obeying him. You can’t cage some beasts.</p><p>“Bastard.” Paul’s hands fisted. The demon wasn’t screaming anymore. Out of time.</p><p>“I haven’t seen him since the wolves came inside.”</p><p>“Because he’s running.” Dammit. “This is our mess to clean up.” Not for the wolves. Vampire business. “Get the others. Hunt him.” The order she’d never thought to give came from her as Morgan said, “Kil him.”</p><p>Paul nodded. He always fol owed her orders. Always.</p><p>Morgan rushed away from him, already heading to the winding tunnels that led beneath the house. Before she faced hel , she’d take care of her own nightmare. And she’d take ful control of her vampire nest.</p><p>Morgan raced down the stairs. The others would come soon, spreading out.</p><p>Searching. Rage fueled her blood. So many vampires had died at the hands of the demons. The demons hunted in heavy packs. Swooping in, preying when the vamps were weak— ripping us apart.</p><p>They’d tried to stop them for months. And Devon, he’d been the asshole to bring those monsters into the world.</p><p>She twisted to the left. Snaked down the tunnel to the right. The scent of blood hit her. Fresh blood.</p><p>Dammit, what had he done now?</p><p>A heavy metal door waited in front of her, open by a few precious inches. Open just enough to let the scent of blood spil out.</p><p>“Devon!” She cal ed out as she shoved at the door. “What are you—”</p><p>Inside, a pool of blood soaked the floor. And in the middle of that pool...the broken body of the werewolf who’d attacked Jace at Howling Moon.</p><p>Footsteps thudded behind her. “Morgan!”</p><p>Jace’s rumbling voice. She swal owed and glanced around the room. Blood-stained footprints led to the left, to an escape tunnel. One that opened in the heart of the swamp.</p><p>“Fuck!” Jace’s shoulders brushed hers.</p><p>Paul came in behind him and scanned the room. Disgust tightened his face. “Looks like Devon was stil experimenting.”</p><p>Right below them. Right damn below them. The other Council members had forbidden his work long ago. But the bastard must have liked his blood and pain too much. Jace’s nostrils flared. “He fucking slaughtered a wolf.” And that’s what it was—a slaughter. The wolf’s flesh was a pale white, and Morgan knew that Devon had drained Mike’s blood. A fresh kil . While they’d been upstairs, this wolf had been dying. Jace’s dark eyes locked on her.</p><p>She swal owed back the bile that rose in her throat. “ Jace, I-I didn’t know.” Like that would make it better. She should have known. Her nest. Her responsibility. It was al ...</p><p>on me.</p><p>“Look, I was coming to kil Devon, okay? He’s the one who opened the doorway for the demons. When I drank that demon’s blood, I saw him!”</p><p>Jace stared at the footprints, fol owing them with his eyes. His shoulders were tense, and she could nearly feel the fury roiling from him. “The vampires summoned the demons.”</p><p>Jace’s claws burst out. “The vampires have been capturing wolves...what other little secrets haven’t you told me, mate? ”</p><p>Oh, this wasn’t going to be good.</p><p>“Jace, let me explain, I—”</p><p>“Too late.” He grabbed her and put his claws at her throat. “Too late, princess. ”</p><p>Morgan knew she was staring at death.</p><p>“I want every single one of you bloodsucking assholes to get in that cage.” His head jerked toward the left. Toward the heavily barred cel that Devon had used to house vampire prisoners over the years.</p><p>Those bars were reinforced. Able to hold demons, wolves, and, yes, even vamps.</p><p>We won’t be able to get out.</p><p>“Move,” he ordered, “or I slice open her throat.”</p><p>Her blood chil ed at that threat.</p><p>Paul raised his chin. “You wouldn’t.”</p><p>Jace held her gaze. His stare seemed so cold. So...empty. Would he? “Get in the cel , Paul,” she told him quietly.</p><p>Jace’s jaw tensed.</p><p>Footsteps shuffled and snarls fil ed the air as the vamps went into their prison.</p><p>“They’re in!” Louis cal ed out.</p><p>Jace didn’t let her go. “What are you going to do?” She asked. “I’m the one who knows where the doorway is. You need me to—”</p><p>“Devon knows where the doorway is. I bet that bastard is running there right now.</p><p>How did you put it? High on wolf blood. He’l think he’s fucking invincible, and he’l go back.”</p><p>Maybe. Maybe not.</p><p>“Either way, I’ve got his scent.” Jace brought his head close to hers and those wicked claws didn’t move from her flesh. “I’m going to track him down and rip him apart.”</p><p>Because Devon had kil ed a wolf.</p><p>“He risked you. Tried to kil you.” His claws fel away. “The vamp wil burn by dawn.”</p><p>Wha—</p><p>Jace lifted her up, moved too fast—damn him—and put her in the cel . Then he swung the door shut and locked her inside.</p><p>She grabbed the bars. “You can’t leave us like this.”</p><p>His brows rose. “Watch me.” He paused, staring down at Mike’s lifeless form.</p><p>“Take care of him,” he ordered two of his men, and they immediately bent to pick up the body. Then Jace fol owed the bloody trail of footprints.</p><p>“Jace! Dammit, I wasn’t going to betray you.”</p><p>He didn’t stop, but she caught his growled, “I know.”</p><p>What? “Then why are you doing this? Why?”</p><p>One-by-one, the wolves exited the containment area. Jace was the last to leave.</p><p>His broad shoulders scraped the arching sides of the doorway. “I’l be back, Morgan.”</p><p>Her breath heaved in her chest.</p><p>“We’re not ending.” He spared her a glittering stare. “I’m not risking you, and I’m damn sure not taking the chance that the fire wil get to you.”</p><p>“Jace—”</p><p>But he was gone, and Morgan was trapped with an angry cel of vampires. Her knuckles whitened around the bars. Alpha asshole. He thought he could go out and take al the risks? While she what—stayed there and worried about him?</p><p>She wasn’t the kind of girl who stayed behind. Mostly because she wasn’t a girl.</p><p>“I knew he wouldn’t hurt you.” Paul’s cocky voice.</p><p>She’d known it, too. His claws had trembled and never so much as nicked her flesh.</p><p>“We real y going to let those wolves get al the glory?” He continued. “Because I’ve been wanting to give Devon a beating since I turned.”</p><p>She pul ed at the bars. Yes, they’d been reinforced, and normal y, she’d never be able to break them.</p><p>High on wolf blood.</p><p>The bars began to bend.</p><p>“Don’t worry,” she told Paul and the others. “Jace isn’t getting away from me.” And he sure wasn’t going into hel without her being there to pul her wolf right back out of the fire.</p><p>Chapter Seven</p><p>Jace and his pack chased Devon into the center of the Glades. The vamp had escaped by car, but instead of going back into the city, the guy had headed down the long, winding roads that led deeper into the growing darkness.</p><p>When the road ended, they found his car. Lights on. Doors open. Jace stared out at the night. The insects had stopped chirping when the wolves approached. They knew when danger stalked.</p><p>He inhaled, catching al the scents. Those that belonged, those that didn’t. Blood.</p><p>Brimstone.</p><p>Fuck.</p><p>“Your vamp’s gonna be real pissed at you once she gets out of that cage,” Louis warned him.</p><p>Tell me something I don’t know. But better her alive and pissed than dead and burned to ash.</p><p>He caught the whisper of sound in the air. His head tilted back as he stared at the rising moon. He could see the shapes before the blood moon. So many. Too many.</p><p>Outnumbered. The demons were coming.</p><p>“Shift!” They’d have to change quickly. “Take their heads—take out as many of them as you can.”</p><p>Then he leapt forward. The demons were coming because they were close to the doorway. Fuck that. Jace was slamming that door. Devon had run right back to this hole, and now Jace would kil him and stop the demons.</p><p>Endgame.</p><p>He shoved through the brush as the howls behind him fil ed the night.</p><p>Morgan had seen the doorway, the great gaping hole in the middle of the blackened earth. Devon had opened the door to hel —opened it on vampire land, and she hadn’t even realized it. The vamps spread out when they arrived at the battle. The snarls and growls of the wolves blended with the vicious cries of the demons. Blood bathed the ground.</p><p>“Don’t get any of their blood in you,” she warned, stil tasting ash. “And make sure you cover the wolves.”</p><p>Because the dead were already on the ground, and she didn’t want to lose anyone else. Demons flew from the air at her. “Go!” She shouted to the vampires. She lifted her gun. The vamps had taken the time to load up before they’d gone hunting. She aimed. Fired. The closest demon hit the ground. A wolf jumped on him and bit into his neck.More shots fired. The vamps knew what to do. Take the demons down. Make them weak. Let the wolves finish the kil .</p><p>She fired as she ran through the heaving bodies. No sense cal ing for Jace. She didn’t see him there. Didn’t see Devon either.</p><p>The twist in her gut told her where she’d find them both.</p><p>Deeper, deeper into the dark she went.</p><p>Her enhanced vision al owed her to see easily as she leapt over fal en trees and darted into the thick brush.</p><p>The crackle and hiss of fire reached her ears. So close.</p><p>The grass disappeared. The ground hardened beneath her feet.</p><p>Then she saw the broken skeletons. The remains of the sacrifices. So many. Far more than she’d ever imagined. Hundreds of skul s and spines. Broken bones tossed aside like garbage. She stared at the stark white graveyard as rage fil ed her. Devon.</p><p>She leapt over the bones. There— there. A sunken, sloping entrance on the ground. Smoke trickled from the thick hole and...she could hear the faintest echo of screams emanating from within the pit. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You always did let emotion rule you,” came Devon’s voice from the darkness.</p><p>Morgan spun around, and took a few quick steps away from the pit. “You did this.”</p><p>He shrugged.</p> <p>“They’ve been attacking us, Devon! Kil ing us! You were the Council leader, you had—”</p><p>“Fuck the Council.” He smiled, showing off his bloody fangs. “And fuck you.”</p><p>Her hands fisted.</p><p>“Vampires were always so busy hiding. Oh, no, mustn’t let the humans know we’re here.” He smirked at her. “Wrong. It’s time for them to know. Time for us to show the humans that their only purpose is to feed us. They’re prey. We’re fucking gods.”</p><p>She could only shake her head. “You bargained with the devil, you opened a doorway because—”</p> <p>“Because I wanted a war. Because the vampires needed to learn...it’s kil or be kil ed. We weren’t meant to hide. We’re meant to dominate.”</p><p>Bastard. “And so you sent the demons after your own kind? How is that us dominating?”</p><p>“I sent the demons after the weak. Those vampires who can’t survive don’t belong in this world.” His lips stil twisted in that sick grin as he said, “And it’s not like I can’t make more of our kind.”</p><p>More like him? No way. “You won’t be changing anyone. You won’t be kil ing anyone else.” Where was Jace? “This ends tonight.”</p><p>He laughed. “Funny. That’s exactly what your wolf said...”</p><p>A fist squeezed her heart.</p> <p>“Right before I kicked his ass into hel .”</p><p>The screams behind her seemed louder. Like more demons were fighting to get out.</p><p>“Sounds like they’re enjoying their new meal.” His fangs flashed in the dark. “That’s how it works, you see. For them to come out, I offer a trade. A life.”</p><p>That’s why there were so many bones. A skeleton for each demon he’d brought forth.</p><p>“They devour the flesh, then toss out the parts that are too hard.”</p><p>Not Jace. He wasn’t in that pit. “We’re closing that hole.”</p><p>Devon took a step toward her. “You don’t have that kind of power. You think you’re so fucking special.” Another step. “Just because you were born pureblood. You always thought you were better than me.”</p><p>“No, I didn’t.” But I do now. I’m not a psychotic asshole, so yes, that makes me better.</p> <p>“Do you know why I wanted you to marry the wolf?”</p><p>Wel , saving the vamp nest obviously wasn’t the reason. Morgan held her ground.</p><p>Hel waited behind her, and this bastard caged her in front.</p><p>“I needed you to get close to him,” Devon said. “I needed you to take his blood</p><p>...because I wanted to give the demons a special tribute.” He inclined his head. “You see, now that they’ve been kil ing, they’re developed a taste for wolf blood.”</p><p>“They’re not taking his blood!”</p><p>“But in order to close the deal with them, I had to prove how much I’d be wil ing to sacrifice.” His eyes narrowed. “With demons, it’s al about the sacrifice. You have to offer them something, or the lazy assholes won’t do a thing.”</p><p>“You’ve offered them humans—”</p><p>“Because I’m fucking tired of hiding in the shadows. The vampires wouldn’t take control, they were too scared of humans finding out the truth. But my demons— they’re not afraid of anything.”</p><p>The screams from the pit almost drowned out his words. “What are you sacrificing?”</p><p>Because, shit, this was a trap. For the wolves. For Jace. For—</p><p>“You.”</p><p>Then he lunged at her.</p><p>But Morgan was ready. She grabbed his arms, twisted, and tossed the traitor right over her shoulder. He hit the ground just feet away from the pit, and smoke bil owed out in a heavy burst.</p><p>He flew back to his feet. Smiled. “This wil be fun.” He licked his lips, tasting the blood that stained his mouth. “You’re the only pureblood around here. You’re the best sacrifice I can give them. I bet you’l be worth ten demons...”</p><p>He’d lost it. “And I bet it wil hurt when you fal into hel .”</p><p>That wiped the smile off his face. “Your wolf sure screamed when the demons took him.”</p><p>Dammit, that was the second time he’d said—her gaze darted to the pit. “Jace!”</p><p>Devon slammed into her, and they hit the earth. “Bitch, I’ve got wolf blood in me.</p><p>More than you. I drained that mutt.”</p><p>And he’d left Mike’s broken body behind. Another casualty.</p><p>Morgan kicked up, slamming her knee into his bal s. He jerked back. “You’ve got wolf blood,” she said, “but now you also have bal s in your throat.”</p><p>She jumped to her feet. “Jace!” Her scream broke through the night. He couldn’t be in that pit, he couldn’t...</p><p>Devon’s arms wrapped around her from behind. He squeezed so tight she lost her breath and her ribs burned...burned.</p><p>Snap.</p><p>Pain beat through her as her ribs broke.</p><p>“So tired of you...” Devon lifted her and carried her toward the pit. “Fucking a wolf</p><p>blending with humans...crying when you lost the light...”</p><p>She slammed her head back and heard the sweet crunch of bones when she broke his nose. Morgan clawed at his arms, slicing open his flesh as she fought him. His blood littered the ground as he took her to the pit.</p><p>“Let her go!”</p><p>Jace. His roar. Relief had her feeling light-headed. Or maybe that dizziness was from the pain.</p><p>Jace leapt forward. He was naked and blood poured from a gash on his cheeks.</p><p>His eyes glowed as he raised his claws and ran toward them.</p><p>Devon had her nearly over the pit. This was what she’d planned. To enter hel . To close the door from the inside out.</p><p>Only...wel , in the original plan, Jace had been the one to go through the doorway.</p><p>She was supposed to stay back and then pul him out.</p><p>I won’t sacrifice him.</p><p>The rules had indeed changed. Jace didn’t realize it. She did. If demons were al about sacrifice, then she’d give them a sacrifice al right.</p><p>But she wouldn’t give them Jace.</p><p>“Watch her burn, wolf!” Devon shouted. “Watch. Her. Burn!”</p><p>Morgan stopped fighting. Instead of slicing her nails against Devon, she twisted her hands and locked tight to him. Her gaze met Jace’s. He yel ed her name.</p><p>“Bring me back,” she whispered. Then Morgan heaved toward the pit, and she yanked Devon with her.</p><p>He tried to wrench back his arms, but she wouldn’t let go. His yel s fil ed her ears as he fought and twisted, but Morgan wouldn’t let go.</p><p>No more dead humans. No more tortured wolves. This was it.</p><p>They fel into the pit, and the screams from the demons drowned out her voice as she told them, “I’ve got a sacrifice for you, assholes...”</p><p>The fire burned, blasting at her skin and she refused to cry out. Even when the demons reached for her.</p><p>Jace’s heart stopped when Morgan jumped into that fiery pit. “No!” Not her. She wasn’t supposed to go in. Not. Her. He flew forward, and his body slammed into the ground even as his arms snaked into that hole in a desperate bid to grab her.</p><p>He’d moved fast, faster than he’d ever moved in his life, and when he shoved his hands into that hot furnace, he touched...</p><p>Flames.</p><p>The fire lanced his skin, but he didn’t let go. He could feel a body in the middle of that wild heat. He could smel the acrid scent of burning flesh.</p><p>Morgan.</p><p>He didn’t let go. He pul ed even as he felt another force tugging his prize back down.</p><p>“No! You can’t have her!” He yel ed as the fire licked him.</p><p>His upper body fel into the pit as he struggled.</p><p>“Fuck, Jace!” Louis’s yel from behind him. Then suddenly Jace felt other hands on his body, trying to haul him back.</p><p>But he wasn’t going back without Morgan“Keep him!” He roared the words in the fire.</p><p>“Choke on him—but give her to me!”</p><p>A breath of flames blew against him and blisters immediately covered his flesh.</p><p>“Give her to me!” He bel owed.</p><p>“Pull him up!” Louis snarled at the same instant. “Get him out of there, now!”</p><p>They yanked him back, but he didn’t let go of the fiery prize he held. Be Morgan. Be</p><p>He broke from the pit and fire raced along his body. Louis shoved at him and Jace fel to the ground. He rol ed, battling the flames on him and— on her. Sweet fuck, he’d pul ed her out.</p><p>The others immediately joined him and battled the flames that covered her flesh.</p><p>Red, swol en, every inch of her body had felt the kiss of the fire. Should have been me.</p><p>Her eyes weren’t open. “Morgan?” Now, he was afraid to touch her. He didn’t want to hurt her, and he knew his touch would. She was injured so badly, even a breath on her skin would hurt.</p><p>His touch would pain her, but his blood wouldn’t. Jace lifted his hand to his mouth and bit his wrist. He tore with his teeth and put his hand over her mouth. “Princess, please...”</p><p>The blood trickled into her mouth. Her lips moved the faintest bit against his skin.</p><p>“Take more.” She could take everything if she needed it.</p><p>“Alpha.” Louis’s quiet voice had his head lifting. His friend stared at him with a tense face. “You’re weak, too. Let me help you.”</p><p>Jace shook his head. “No, she’s—”</p><p>“I know she’s yours, but she’s also pack.” Louis offered his bleeding wrist. “If the blood of one wolf makes her strong, how fast do you think she’l heal when she drinks from six?”</p><p>And the others who’d survived the battle crowded behind him. Al had their wrists open. Al were ready to sacrifice for the vampire who’d seen hel .</p><p>As she fed from him, her lips like a whisper on his skin, Jace’s gaze tracked back to the pit. Only the entrance wasn’t there any longer. Dirt had fil ed in, total y blocking the gaping hole. The ground was blackened, cracked, but no smoke drifted into the air.</p><p>The doorway was closed.</p><p>He leaned close to her. “You did it,” he whispered. Her vampires were safe. The battle was over.</p><p>Now, his princess just had to survive.</p><p>Chapter Eight</p><p>The vampiress walked into the werewolf bar as if she owned the place. Since she was mated to the alpha, Jace figured that, wel , she pretty much did. Her skin was pale and perfect, not even a blister left from the fire that had nearly stolen her from him. Her lips were red, ful , and he’d soon feel them beneath his mouth. She was wearing a new pair of fuck-me boots that showed off the long length of her legs. And her eyes—they were on him.</p><p>When the others became aware of her, they stopped talking. Heads swiveled toward her. Toward him. The bar waited.</p><p>He didn’t move. Jace wanted to jump up, run to her, grab her, but he was also enjoying the sexy picture she made as she crossed the bar.</p><p>Morgan smiled at him, flashing fangs. “The Miami Vampire Council would like to official y extend its appreciation to you,” she said, her voice clear and her eyes bright.</p><p>“And if there is anything that the Council can do for the pack...” She stopped just a foot away from him. “You have only to ask,” Morgan finished, her voice softer.</p><p>She’d spent two days healing. Even with al the wolf blood, she’d had to battle to stay alive. He’d been by her side, determined to keep death away.</p><p>He’d succeeded.</p><p>When she’d woken, the vampires had made her the head of their Council. He knew she’d weeded out the vamps who’d been secretly working with Devon. The bastard hadn’t been implementing his plan alone.</p><p>She’d cut the head off the snake when she sent Devon to hel , and now Jace knew that she’d cut up the body, too.</p><p>Stil , he didn’t touch her, not yet. “Glad the Council approves,” he said, his own voice mild.Understanding flared in her eyes. She lifted her hand and put her palm against his chest.</p><p>“And you have my personal gratitude...” Her lips curved. “For pul ing my ass out of hel .”</p><p>He caught her hand. Pressed it harder against his chest. “Leaving you there wasn’t exactly an option for me.”</p><p>Jace saw the delicate movement of her throat as she swal owed.</p><p>“What was it like?” Louis cal ed out. “What did you see, cher ?”</p><p>She glanced back at him. “It was damn hot.”</p><p>Some of the wolves laughed.</p><p>“As for what I saw...” Morgan shook her head. “Some things are better not said.”</p><p>When she turned back to him, memories were in her eyes. While her body might have healed, Jace knew she’d carry the scars inside. Some memories couldn’t be forgotten.</p><p>“Is the gateway closed for good?” Because he didn’t want any more demons coming after her.</p><p>“Yes.” He stil held her hand. She didn’t pul away. She inched closer as she said, “It closed when the demons kil ed Devon. He was the sacrifice I gave to them. He opened the pit, so it only seemed fitting that he close it.”</p><p>Jace waited. He knew there was more.</p><p>“I made a deal while I burned.” Her lashes lowered as she stared at their hands.</p><p>His dark, hers so light. After a moment, she glanced back up at him. “I told those demon assholes that if they accepted Devon and shut the door, I wouldn’t send my wolf down to tear hel apart.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And he would have. If they’d kept her...</p><p>“When you yanked me out of their hands, they realized I was serious. You were ready for hel . But hel wasn’t ready for you.” Her hand fisted beneath his. “Besides, I don’t think the guy in charge down there real y liked for his demons to escape.”</p><p>No, Jace bet he hadn’t been eager to lose those bastards. “So it’s over,” he said.</p> <p>“No.” Now her body brushed against his. “The demons are gone, but things are far from over.” Her head tilted back. Her lips were inches from his. “In fact, I think you promised me that things would just be getting started...”</p><p>They would be.</p><p>“You locked me in a cage,” she told him, a faint frown pul ing between her eyes. He brought his hands up to curl around her shoulders. “But I also pul ed you out of hel .</p><p>Makes us even, doesn’t it?”</p><p>Her soft laughter put an ache in his chest.</p> <p>“I don’t know,” she told him, “I think that might put you ahead.”</p><p>His lips took hers because his control broke. The kiss was too rough, too wild, but that was his way.</p><p>And she kissed him back just as wildly and with just as much desperate need. He lifted his mouth from hers long enough to growl, “There’s no score between mates. You don’t owe me anything.” He wanted her out of the bar and naked beneath him.</p><p>“I owe you forever,” she told him as she rose onto her toes and kissed him again.</p><p>“And that’s what I’m giving you.”</p><p>Forever with his vampiress...it was the only thing he wanted.</p> <p>“You’re mine, wolf,” she told him. “And I’m not letting you go.”</p><p>Enough. He grabbed her and hoisted her high into his arms. The pack shouted and laughed as he passed them, but he didn’t slow down. He wanted her alone. Wanted in her.</p><p>Jace took her upstairs. Since his house had burned, he’d taken over Howling Moon. The apartment above the bar had a bed, and that was al he needed. He kicked the door shut behind them and lowered her in front of him. Morgan smiled at him.</p><p>“When are you going to say that you love me?”</p><p>He blinked. “But...you already know.” She had to know.</p><p>“A woman stil likes to hear the words.”</p><p>He yanked off his shirt and kicked off his boots. Then he reached for her. If she needed the words, he’d damn wel give them to her. He’d give her anything. “I love you.”</p><p>Her fangs glinted. “And I love you, wolf.”</p> <p>Enemies no more. Lovers.</p><p>Mates.</p><p>Forever.</p><p>They’d told the devil to screw off, and now they had eternity waiting. Sometimes, it was good to be an alpha wolf...</p><p>Very fucking good.</p><p>Enjoy paranormal romance? Then turn the page to check out Cynthia Eden’s sexy werewolf romance novel, NEVER CRY WOLF, available from Kensington Brava in July of 2011. Excerpt from NEVER CRY WOLF by Cynthia Eden (Kensington Brava, July 2011):</p><p>Lucas Simone definitely wouldn’t classify as handsome, but Sarah real y wasn’t the type to be swayed by a pretty face.</p><p>She was much more the I-need-a-freaking-badass-to-save-my-ass right then type.</p><p>“I should explain...” She began, clearing her throat.</p><p>“Yeah, you should.” An order.</p><p>Her eyes narrowed. “Uh, I think it’s important to note that I saved your hide back there.” Very, very important to note. In fact, she was wagering on the old wolf pack code to help her out. The I-Scratch-Your-Back, You-Protect-Mine code. He grunted. “I didn’t need saving, babe.”</p><p>“Yes, you did.” The wolf would stil be caged if it hadn’t been for her—and the folks she’d bribed. Using the last of my cash.</p><p>She needed shelter. Her growling stomach reminded her that she also needed food. And she desperately needed some serious muscle.</p><p>Her gaze dropped down to his chest.</p><p>Muscle, check.</p><p>“We haven’t had sex, lover.” He drew the last out, more like a growl instead of a word. Sarah couldn’t help it, she flushed. She felt her face heat and knew she had to be beat red. The curse of her fair skin. She always blushed too fast. “You were in jail.</p><p>They were penning a murder rap on you.” Facts that real y shouldn’t have to be pointed out to the ungrateful wolf. Come on. Where was her thank you?</p><p>“I remember every woman I’ve had sex with,” he continued as if she hadn’t spoken.</p><p>His eyes, hooded, swept over her, making her cheeks burn al the more. She’d dressed, deliberately provocative, before going down to the station. Her red blouse plunged to reveal the swel of her breasts. The short, black skirt revealed a long expanse of leg. Her sandals were smal , curved and designed more to be sexy than serviceable. He whistled slowly. “I don’t remember you.”</p><p>Right, and she didn’t buy for a minute that the guy remembered every woman he’d</p><p>—</p><p>“Some women like to take things slow. They like to kiss, they like to stroke. Others like to strip, to fuck, as fast as possible.” A pause as his eyes rose back to hers. “They like it rough because they like the rush of being with a monster.”</p><p>She swal owed and took a quick step back, unable to help herself because Lucas looked very, very threatening.</p><p>“Are you one of those women?” He moved forward, closing that distance. His hand lifted and traced her cheek. “Do you like the thril of walking on the wild side?”</p><p>Her heart was racing. Her knees were knocking again—wel , okay, they’d never stopped. She licked her lips and managed, “No.”</p><p>His nostrils flared and the grin that curved his lips was grim. “Liar.”</p><p>Oh, hel . Shifter senses. Some said their senses were acute enough to catch a lie.</p><p>Not to actual y smel a lie, but to hear the jerk of an increased heartbeat, to scent the sweat that broke through the skin at a lie.</p><p>“You’re turned on right now,” he told her, voice so rough that she almost shivered,</p><p>“just like you were when we kissed outside that damn cage.”</p><p>Now what was she supposed to say to that? Especial y since the guy was right?</p><p>His hand slid down her face and his fingers curled over her throat. His palm pushed against her pulse. He didn’t hurt her, not like he’d hurt the cop, but Sarah tensed, knowing just how dangerous he could be.</p><p>I saw the photos. He’s killed before. Without remorse. Fast, brutal. I know what he can do.</p><p>That’s why she had come to him.</p><p>When a girl was caught between hel and a hard place, she needed the devil to help her out. “Who are you?” He breathed the words against her. “Not some angel come to save me in my dark hour of need...”</p><p>Hardly. She managed to lift her chin. “Let go of me, and I’l tel you everything.”</p><p>Almost everything. Okay, not even almost, but at least the important parts. NEVER</p><p>CRY WOLF—Available July 2011 from Kensington Brava</p><p>And if you’re looking for a good romantic suspense, then keep reading for a preview of KILLER SECRETS by Katie Reus.</p><p>Available now.</p><p>Killer Secrets</p><p>Copyright © 2011 by Katie Reus</p><p>Eve Newman pressed her back up against one of the stone pil ars at the entrance to the Underwood’s long, winding driveway. She wasn’t exactly sure what she was doing here but for the tenth time in the last hour she regretted her decision to put any credence to that anonymous email. ‘Want the story of the year?</p><p>Underwood mansion. Nine o’clock. Tonight. Don’t trust anyone and don’t be seen.’</p><p>The cryptic message annoyed her. As one of the few journalists in the smal town of Hudson Creek, Texas, she’d had no choice but to fol ow up on the lead. She certainly wasn’t going to give the story to someone else.</p><p>Since she’d grown up here—and had attended a few high school parties at the mansion courtesy of Tara Underwood—she knew exactly where the security cameras were and how to avoid them. Squashing the twinge of guilt at using that knowledge against her friend’s parents, she peered around the pil ar. A bright ful moon hung high in the sky il uminating only one car. The District Attorney’s Mercedes. Made sense Richard Underwood would be home. She doubted he’d sent her the email because what could Richard be doing to warrant such a mysterious message?</p><p>Frowning, she glanced down the long street. The upscale neighborhood was quiet tonight. Stil she tucked her long hair into the thick knitted cap she’d brought and pul ed it down low on her head. Without it, her strawberry blonde hair would be like a beacon for anyone to see. Wearing al black and feeling like a thief, she gritted her teeth and sprinted toward the closest oak tree on the property. Using the darkness and shadows as her friend, she hurried toward the six foot wal surrounding the property. Her heart pounded wildly and her palms were clammy inside her gloves. She hadn’t even told her boss where she was going. But she wasn’t total y unprepared. Her Glock 33 was tucked into the back of her pants as a precaution.</p><p>As she crept down the length of the brick wal , the sound of a male voice shouting made her pause. She was right in line with the main house but the voice was farther away. Almost like it was outside, but too muted. The pool house.</p><p>Careful to dodge two of the security cameras, she moved fast until she was hunkered down by a couple of overgrown bushes. The lights from the pool house were on, but the blinds were shut. She could see two silhouettes moving around inside. The shapes were too blurry to make out whether the people were male or female.</p><p>After glancing around the backyard to make sure she hadn’t missed any more video cameras, she pul ed her cap down lower and began making her way across the grass. It was almost nine o’clock so maybe this meeting was what her anonymous email had been talking about. A man started shouting again and her curiosity surged higher. She couldn’t understand what he was saying but his tone was angry. As she started to move closer the very distinctive sound of gunshots erupted.</p><p>Pop. Pop. Pop. One shot right after another.</p><p>Then silence. Adrenaline surged through her like a raging river. And she was standing right in the middle of the yard like a freaking target. Not caring if any of the cameras caught her, she ran toward the cluster of bushes lining the pool house and jumped behind them. She needed to cal the cops, but hiding was her number one priority. Eve held her breath and when there were no other sounds she raised her head and tried to look in one of the windows. The blinds were drawn shut and she could barely see through the sliver between the edge of the blinds and the edge of the window. Immediately she spotted a pair of male dress shoes. Expensive shoes. From the angle it looked like they were attached to someone lying on the ground. Someone not moving. Slowly, she reached down to grab her cel phone out of her pocket. When she patted nothing, she inwardly cursed. Sure, she’d remembered her gun but she’d left her damn phone in her purse which was in her car a few blocks over. A lot of good that would do her now. If someone was dead or dying, she had to get help.</p><p>The sound of a door opening and then slamming shut made her duck back down into the bushes. She hoped her dark clothing would help conceal her. Even though she hated to move, she withdrew her gun. Her hand shook slightly but she’d spent countless hours on the range. When the time came, she knew she could use it if she had to. At the sound of footsteps running away, she inched above the foliage only to see the French door that led into the main house slam shut. A light went on in one of the rooms downstairs and then a few seconds later a light upstairs flipped on.</p><p>Taking a chance, she hurried from her hiding place and ran to the front of the pool house. Eve cringed as her boots thudded against the stone patio at the front of the smal structure but she couldn’t do anything about it.</p><p>Her time was limited.</p><p>Easing the door open with her shoulder, she kept her gun tight in her hands. Her gut roiled at the sight in front of her. Next to the splatters of blood on the slick tile floor, the pale yel ow wal s seemed garish and too bright. Right beside the bil iard table in the corner of the room, Al en freaking Martin lay on his back. His dark unblinking eyes were wide open, and a look of shock covered his handsome face. Her gut told her he was dead.</p><p>Eve hadn’t exactly liked the guy but, damn. She quickly peeked back out the door and when she saw no one was there, hurried over to the body. After spending months embedded with the troops in Afghanistan, she’d seen her share of dead bodies and she had a feeling he was gone, but she checked his pulse anyway.</p><p>Nothing.</p><p>Crimson flowed from the three gaping holes in his chest and was beginning to pool on the tile floor. The coppery scent of death fil ed her nostrils.</p><p>Instinctively she started to step back. She didn’t want to contaminate the crime scene and she real y didn’t want to leave any evidence behind. She had no business being here but she did need to cal the cops</p><p>—even if she didn’t have much faith in their abilities. Her car was blocks over and she couldn’t waste that much time. She just hoped Martin had a phone on him.</p><p>Avoiding the growing pool of blood, she felt the front of his jacket pocket until she found his cel . Once her fingers clasped around it she hurried back to the door. When she looked out she saw the light upstairs in the main house shut off.</p><p>Crap!</p><p>Whoever had done this was probably coming back. She just couldn’t wrap her mind around the fact that Richard Underwood had shot Al en Martin. Sure, Martin was sleazy, but Underwood was a good, honest DA. Or she’d thought he was. Now it looked like he might be a kil er. Hurrying back the way she’d come, she paused once she was outside the fenced yard to use Martin’s phone. She dialed 911.</p><p>As soon as the operator picked up she started whispering into the phone. “There’s a dead body at the Underwood mansion. 685 Kent Ave.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Ma’am, can you please repeat that address?”</p><p>“There’s a dead body in the pool house behind the Underwood mansion on Kent Avenue. Al en Martin has been shot three times in the chest and he’s not breathing.</p><p>Hurry!”</p> <p>“Ma’am, are you tel ing me that Al en Martin is dead in the DA’s pool house?” Eve doubted the operator was supposed to let her disbelief show, but in a smal town she’d have no doubt where the Underwood mansion was and exactly who owned it.</p><p>She sighed at the woman’s question. The dispatcher should already be contacting a patrol car. Another strike against the police department of Hudson Creek. They’d screwed up the prosecution of the man who’d kil ed her parents. Why not screw this up too?</p><p>“Yes, that’s what I’m tel ing you. Send someone now. The kil er is stil here.” It was hard to keep her voice a whisper when she wanted to shout at the operator.</p><p>“We’re sending a patrol over but I need to know who I’m speaking to.”</p><p>Not freaking likely.</p> <p>Instead of answering, Eve hung up. She couldn’t afford to say anything else. She’d trespassed on the property and admitting that to the sheriff would give him an excuse to waste hours interrogating her. As she glanced around she realized no one must have heard the shots because the street was deathly quiet. She desperately wanted to wait around and make sure the cops showed up but knew she couldn’t. If they found her here she’d be in a world of trouble. Hurrying, she continued her escape down the sidewalk. When the phone she’d taken started ringing, she jumped. The cal er ID</p><p>screen said restricted.</p><p>“Hey, I hear it,” a thick, accented male voice said from behind the fence of the Underwood’s place. Panic jumped in Eve’s chest. She pressed the end button, effectively silencing the cal as she started running down the sidewalk. Her boots thudded loudly but there was nothing she could do about it. She wanted to turn it off completely but didn’t have time to waste.</p><p>“Hey! Stop!” the same voice shouted behind her a few moments later. A sharp pop blasted through the air and the trunk of one of the trees lining the street splintered. The pop sounded again and Eve felt a gush of air rush past her face. Someone was shooting at her!</p><p>Taking a sharp right, she darted across the Hawkins’ lawn. Even though they had an incredible house their security was shit and she knew they had an opening in their wrought iron fence in the backyard. If she could just make it.</p><p>Her leg muscles strained and for the first time in years she was thankful for her daily jogging routine. Pumping her arms and legs, she cleared the edge of the house. A spotlight on the side of the house flipped on—likely motion sensors—but she didn’t pause.</p> <p>It almost felt as if someone was breathing down her neck, but she knew it was fear and adrenaline surging through her. Then she heard a muttered curse farther behind than before. At least they weren’t stil shooting. Probably because whoever it was didn’t want to draw more attention to themselves. She needed to make it to the opening and hoped no one saw her slip through. Her car was on the next street over. Her heart pounded that erratic tattoo against her chest as she dove over a cluster of bushes lining the back fence.</p><p>Blood rushed loudly in her ears as she began to slowly crawl toward the opening.</p><p>When the phone started ringing again, her chest tightened. They were trying to track her using the sound. She silenced it again then slid the back casing off. She’d only have a few seconds to do this. Sliding the SIM card out, she put it in her pocket then left the phone lying in the dirt. As she continued crawling, she pul ed her gun out. When she reached the smal gap in the fence she shimmied under it. Ignoring the dirt coating her hands and the underbrush caught in her cap and clothes, she shoved up and ran through the neighboring backyard.</p><p>After risking a brief glance behind her, she saw she wasn’t being fol owed. She al owed herself a smal measure of relief but didn’t stop running. Even if they were stil looking for her, they weren’t going to find her.</p><p>Unfortunately she couldn’t go home. She hadn’t recognized the voice but she couldn’t be sure whoever had been chasing her hadn’t identified her. That left one couldn’t be sure whoever had been chasing her hadn’t identified her. That left one place to go. Macklin wasn’t going to be happy to see her, but Mr. Tal , dark, and too-sexy-for-his-own-good would have to deal with it. He was one of the few people on the planet she would trust with her life.</p><p>Mac paused as he ran a towel over his damp hair. Then he heard the sound again. Someone was banging on his front door. Insistently. He glanced at the watch he’d left on his bathroom counter. It was almost ten. Normal y he’d be in bed by now and so would most of his men, but they’d had trouble with some of the cattle getting out after a section of one of his fences had been intentional y knocked down. By drug smugglers no doubt. They were getting worse in this area and he was fed up with it. Without bothering to put on clothes, he headed toward the front door. That’s when he heard the one voice that had the ability to make him go rock hard in seconds.</p><p>“Macklin Quinn, I know you’re in there! You better open this door right now!” Eve’s shouts were fol owed by three more bangs.</p><p>For such a petite woman she had a loud knock. Shaking his head, he jerked the door open.</p> <p>“Damn it, Mac...” She trailed off as she stared at him. Unabashedly her eyes tracked down his bare chest to the damp towel hanging on his hips.</p><p>Her peaches and cream complexion often gave away her emotions and now was no different. Those dark eyes of hers flared with momentary interest as they reached the top of his towel. When her gaze landed on his growing erection, her cheeks tinged an adorable pink and she quickly looked up. “Uh...do you have company?”</p><p>“No.” The only company he wanted was her. In his bed. But that wasn’t going to happen. So why was she here?</p><p>She sighed and visibly relaxed. “I need a place to stay tonight.”</p><p>Mac wouldn’t mind accommodating her but he knew her wel enough that she wasn’t looking to jump into his bed. If only. He frowned as he took in her appearance. “What the hel happened to you, Eve?” The question came out harsher than he intended. Her hair was hidden by a dark cap and she wore al black, like some sort of cat burglar. Dirt smudges covered her face and...were those leaves sticking out of her col ar?</p><p>She bit her bottom lip and eyed him nervously. “Aren’t you going to let me in?”</p><p>Sighing because he couldn’t say no to her, he stepped back. When he shut the door behind her she wrung her hands in front of her stomach. “I did something stupid tonight but I’m not going to tel you what it is if you’re going to give me a lecture.”</p><p>Oh, shit. If the stubborn woman was actual y admitting she’d done something stupid, he’d no doubt need a shot of whiskey. Stepping further into the foyer, he motioned with his hand. “Come on. Let’s go to my office.”</p><p>Once they reached his office she tugged the cap off her head and al those gorgeous strawberry blonde waves fel around her face and shoulders. He resisted the very real urge to reach over and run his hands through her hair. To cup her head tight, pul her close, and—</p><p>“Can’t you put on a shirt or something,” she muttered as she sat on the cushy chair across from his desk.</p><p>He stiffened at her words. Instinctively he rubbed a hand over his left side and al the hideous scarred skin. It didn’t hurt anymore and most days he forgot about it but now...he wished he had put on a shirt. He didn’t like her seeing this deformed side of him.</p><p>Before he could respond she continued. “Don’t get that hurt look on your face. You know I didn’t mean it because of your scars.”</p><p>“Then why’d you say it?”</p><p>Her cheeks flushed again as she found a spot on the wal behind him to stare at.</p><p>“Because I can’t think with you half naked.” The way she spoke through gritted teeth told him she meant it even if she didn’t want to admit it.</p><p>It shouldn’t please him, but it did. Probably too much. He bit back a grin because it would only annoy her. Eve was one of the few women he knew who didn’t focus on superficial stuff. And she’d been one of the few people who hadn’t acted like she felt sorry for him when he’d moved home injured, scarred and pissed off at the world. No, she’d told him to get over himself and be thankful he was alive.</p><p>“Stay put and don’t get into trouble for sixty seconds, okay?” Without waiting for a response he hurried to his room and tossed on a pair of faded jeans and a sweater.</p><p>He found her sitting in the same spot with that worried expression on her face. “What’s going on?”</p><p>“I just saw a murder,” she blurted. As she launched into a crazy story he was torn between strangling her and hugging her. When she final y finished she tucked a wayward curl behind her ear and stared at him with wide eyes.</p><p>“You real y think Richard Underwood kil ed Martin?” Al en Martin was one of the sleaziest men Mac knew. He owned five car dealerships around the immediate area and lived up to that greasy car salesman cliché. But that didn’t mean he deserved to be shot.</p><p>“I...I don’t know who kil ed him, but Richard’s car was outside the house. Whoever chased after me wasn’t him. That much I’m pretty sure of. The guy had an accent.”</p><p>“How do you know?”</p><p>“When he cal ed the phone—”</p><p>“That you took.” It was smart she’d taken it to cal the police, but stupid that she’d been there by herself in the first place.</p><p>She gritted her teeth. “Don’t interrupt. When he cal ed Martin’s phone he said ‘I hear it’ or something like that.”</p><p>“Then he was probably talking to someone.”</p><p>“Yeah, maybe.” Her eyes glazed over for a moment and he could practical y see the wheels turning in her head.</p><p>“What is it?”</p><p>Instantly she jerked out of her trance and cleared her throat. “Nothing. Can I stay here tonight? I don’t think whoever it was recognized me but just in case I’d feel safer here.”</p><p>“You need to cal Sheriff Marcel,” he said mildly, knowing it wouldn’t do a bit of difference in convincing her.</p><p>She shook her head. “No way. Those jerks don’t know what they’re doing. They’l probably think it was me or something.”</p><p>Mac bit back a sigh because he understood her anger. Her parents had been kil ed by a drunk driver and the current sheriff’s predecessor had botched the entire process. It had gone to trial but when they’d lost the blood test results with the other driver’s blood alcohol content, it had been over before it began. And it didn’t help that the attending officer had been a new recruit and had gotten so flustered on the stand, the defendant’s attorney had ripped him apart.</p><p>“You can’t lump Marcel and his guys in with...his predecessor.” Mac didn’t even like to say Frank Reed’s name. It only made pain flash in Eve’s eyes and seeing that was like someone stabbing him.</p><p>“I can do whatever I want,” she said, though she’d lost most of her steam.</p><p>“Besides, Marcel’s mad at me because he thinks I got in the way of his last investigation. I don’t want to give him more ammunition against me.”</p><p>“He’s pissed at you because you keep turning him down for dates.” How did she not know that?</p><p>Eve blinked twice then frowned at him. “He’s not serious.”</p><p>Mac snorted. Oh yes, the sheriff was. He’d been after Eve since she’d moved back to town a couple years ago. And he wasn’t the only one. It shouldn’t bother Mac. He had no claim on her. But damn if he didn’t want her for himself. Things between them would be too complicated though and he couldn’t travel down that road with her. “Fine, I’l place a cal to him tomorrow and—”</p><p>She jumped out of her seat. “No! I already have a plan and I don’t need your help.</p><p>Tomorrow I’m going to head to the station and act like I’m fol owing up on a lead about Al en Martin. I can’t accuse the DA of anything until I’m positive he’s involved in this.”</p><p>“You don’t think just showing up at the station is suspicious?”</p><p>Her lips pul ed into a thin line as she shook her head. “I’m a journalist. I’m always bugging the sheriff about stuff.”</p><p>Mac scrubbed a hand over his face. It took al his self-control not to cal the sheriff but in his gut he knew it wouldn’t do much good. She’d already cal ed the cops and if he told the sheriff what he knew, Eve could get in a lot of trouble. Not to mention it would break her trust. Not something he could do and live with himself. Standing, he pushed his chair back. “I’m beat so—”</p><p>“Sorry, I know I barged in on you. If you have a t-shirt or something I could borrow to sleep in I promise I’l stay out of your hair.”</p><p>His lower abdomen burned with need at the thought of her wearing something of his. Instead of responding—because he didn’t trust his voice—he grunted something incomprehensible and motioned for her to fol ow him.</p><p>Hating how tight his skin felt and the uncomfortable sensation coursing through him, he stalked down the hal to his room. The five bedroom house was big for just him and now he felt as if it were taking forever to make it across the house.</p><p>As he final y entered his room he cringed. A pile of dirty clothes lay in one corner and he’d tossed his dirty work clothes at the end of his unmade bed. Nice.</p><p>Behind him, Eve chuckled under her breath and muttered something about him being ‘such a guy’ </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>but he ignored it. He was definitely feeling like a guy right now. Being near her was making his brain short circuit and giving him a raging hard on. It was embarrassing that he couldn’t control himself. He shifted uncomfortably as he jerked open one of his dresser drawers and rummaged around until he found one of his old Marine Corps t-shirts. It was about a decade old and he’d gotten it when he’d first enlisted. Since that first year in he’d put on a lot of muscle so while it would stil be big, it wouldn’t completely swal ow her. Next he grabbed a pair of sweatpants that would definitely be too big but it was al he had.</p><p>When he handed the bundle of clothes to her, their fingers brushed and they both froze. An undeniable electric arc of energy sparked between them and made him almost jerk back. Staring into her dark eyes, he fought that familiar drowning sensation he experienced every single fucking time she was near. She made him feel like a randy teenager. Out of control and horny al the time. He could lose himself with her.</p><p>His brain struggled to think of something—anything—to say but she beat him to the punch. It vaguely registered that this was exactly why he avoided her. She mumbled</p> <p>‘thanks’ as she took the clothes but she stil didn’t make a move to leave. Just stared at him as if she wanted him to kiss her. Ten years ago it wouldn’t have surprised him, but it did now. She wasn’t a teenager anymore. She was a beautiful, grown woman and shouldn’t want anything to do with a roughneck like him.</p><p>But damn, did he ever want to fol ow through with this kiss.</p><p>More than kiss. He wanted to taste her, dominate her, make her forget anyone but him existed... The flare of lust in her eyes was too much.</p><p>Reaching out, he cupped her cheek. When he did, she sucked in a shaky breath but didn’t pul away. He wanted to tel her to go but the words wouldn’t form. And her skin was so soft and female. He rubbed the pad of his cal used thumb over her cheek.</p><p>Her eyes grew heavy-lidded for a moment. He could practical y feel the heat rol ing off her. Stepping forward slowly, he gave her time to back away as he closed the distance between them. But she didn’t.</p> <p>She met him halfway. Before he could react her hands slid up his chest and around his neck. He was so screwed. The thought rang in his head crystal clear. Once he kissed Eve he knew there’d be no going back for him.</p><p>As he leaned down, her mouth parted invitingly. When their lips touched he felt the reaction straight to his center. Her tongue stroked against his, playful y at first. But he didn’t want playful. Something primal burned inside him. He wanted to invade her senses. Make her feel the way he did every time he got close to her. He started to thread his fingers through her thick hair when she froze. With wide eyes, she pul ed back and out of his embrace. She swal owed hard and shook her head. “I can’t...we can’t...goodnight, Mac.” Before he could think of a response, she turned on her heel and hurried out of his room.</p><p>After she’d gone he realized he hadn’t shown her to a guestroom, but he knew she’d figure it out and pick one. If she didn’t, he hoped she’d crawl into bed with him.</p><p>He scrubbed a hand over his face at the thought. That was definitely wishful thinking.</p><p>The only thing he knew was that she wasn’t going to the sheriff’s by herself tomorrow. The woman could fight him al she wanted but after what she’d told him, he wasn’t letting her out of his sight. Eve had the ability to drive him insane more than anyone. He’d known her practical y his entire life and he’d been half in love with her for most of it. Things would never work out though. Too many complications and baggage.</p><p>She was too good for him. Way too good. Part of him was glad she’d realized it before they’d done something stupid tonight. He sure as hel hadn’t had the common sense to pul back. KILLER SECRETS by Katie Reus—Available now.</p>  </body></html>"]