["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cadre of Ten</p><p>The Cadre of Ten, the archangels who ruled the world in all the ways that mattered, met in an ancient keep deep in the Scottish Highlands. No one—human or vampire—would dare trespass on angelic territory, but even had they felt the need to give in to the suicidal urge, it would have proved impossible. The keep had been built by angels, wings a prerequisite for access.</p><p>Technology could’ve negated that advantage, but immortals didn’t survive eons by being left behind. The air above and around the keep was strictly controlled, both by a complex intrusion detection system and by units of highly trained angels. Today’s security had turned the sky into a cascade of wings—it wasn’t often that the ten most powerful beings in the world met in one place.</p><p>“Where is Uram?” Raphael asked, glancing at the incomplete semicircle of chairs.</p> <p>Michaela was the one who answered. “He had a situation in his territory that required immediate attention.” Her lips curved as she spoke, and she was beautiful, perhaps the most beautiful woman who had ever lived . . . if you didn’t look beneath the surface.</p><p>“She makes Uram her puppet.” It was a murmur so low that Raphael knew it had been meant for him alone.</p><p>Glancing at Lijuan, he shook his head. “He’s too powerful. She might control his cock, but nothing else.”</p><p>Lijuan smiled, and it was a smile that held nothing of humanity. The oldest of the archangels had long passed the age where she could even pretend at being mortal. Now, when Raphael looked at her, he saw only a strange darkness, a whisper of worlds beyond either mortal or immortal ken.</p><p>“And are we not important?” A pointed question from Neha, the archangel who ruled India and its surrounds.</p> <p>“Leave it, Neha,” Elijah said in that calm way of his. “We all know of Uram’s arrogance. If he chooses not to be here, then he forfeits the right to question our decisions.”</p><p>That soothed the Queen of Poisons. Astaad and Titus seemed not to care either way, but Charisemnon wasn’t so easily appeased. “He spits on the Cadre,” the archangel said, his aristocratic face drawn in sharply angry lines. “He may as well renounce his membership.”</p><p>“Don’t be stupid, Chari,” Michaela said, and the way she did it, the tone, made it clear she’d once had him in her bed. “An archangel doesn’t get invited to join the Cadre. We become Cadre when we become archangels.”</p><p>“She’s right.” Favashi spoke for the first time. The quietest of the archangels, she held sway over Persia, and was so good at remaining unnoticed that her enemies forgot about her. Which was why she ruled as they lay in their graves.</p><p>“Enough,” Raphael said. “We’re here for a reason. Let’s get to it so we can return to our respective territories.”</p><p>“Where is the mortal?” Neha asked.</p> <p>“Waiting outside. Illium flew him up from the lowlands.” Raphael didn’t ask Illium to bring their visitor inside. “We’re here because Simon, the mortal, is growing old. The American chapter of the Guild will need a new director within the next year.”</p><p>“So let them choose one.” Astaad shrugged. “What does it matter to us as long as they do their job?”</p><p>That job happened to be a critical one. Angels might Make vampires, but it was the Guild Hunters who ensured those vampires obeyed their hundred-year Contract. Humans signed the Contract easily enough, hungry for immortality. However, fulfilling the terms was another matter—a great many of the newly Made had changes of heart after a few paltry years of service.</p><p>And the angels, despite the myths created around their immortal beauty, were not agents of some heavenly entity. They were rulers and businessmen, practical and merciless. They did not like losing their investments. Hence, the Guild and its hunters.</p><p>“It matters,” Michaela said in a biting tone, “because the American and European branches of the Guild are the most powerful. If the next director can’t do his job, we face a rebellion.”</p><p>Raphael found her choice of words interesting. It betrayed something about the vampires under her tender care that they’d seize any chance of escape.</p><p>“I grow tired of this.” Titus stirred his muscular bulk, his skin gleaming blue-black. “Bring in the human and let us hear him.”</p><p>Agreeing, Raphael touched Illium’s mind. Send Simon in.</p> <p>The doors opened on the heels of his command and a tall man with the sinewy muscles of a street fighter or foot soldier walked in. His hair was white, his skin wrinkled, but his eyes, they sparkled bright blue. Illium pulled the doors shut the instant Simon cleared them, cloaking the room in lush privacy once more.</p><p>The retiring Guild Director met Raphael’s eyes and nodded once. “I am honored to be in the presence of the Cadre. It’s not a thing I ever thought to experience.”</p><p>Unsaid was the fact that most humans who came into contact with the Cadre ended up dead.</p><p>“Be seated.” Favashi waved to a chair placed at the open end of the semicircle.</p><p>The old warrior settled himself without any fuss, but Raphael had seen Simon in his prime. He knew the Guild Director was feeling the kiss of age. And yet, he was no old man, never would be. He was a man to be respected. Once, Raphael might’ve called such a man a friend, but that time had passed a thousand years ago. He’d learned too well that mortal lives blinked out with firefly quickness.</p><p>“You wish to retire your position?” Neha asked with regal elegance. She was one of the few who continued to keep a court—the Queen of Poisons might kill you, but you’d admire her refined grace even as you took your last agonizing breath.</p><p>Simon remained coolly composed under her regard. Being Guild Director for forty years had given him a confidence he hadn’t had as the young man Raphael had first seen take the reins. “I must,” he now said. “My hunters are happy for me to stay on, but a good director needs always consider the health of the Guild as a whole. That health flows from the top—the leader must be eminently capable of undertaking an active hunt if necessary.” A rueful smile. “I’m strong and I’m skilled, but I’m no longer as fast, or as willing to dance with death.”</p><p>“Honest words.” Titus nodded approvingly. He was most at ease among warriors and their kin—for though he might rule with brutal strength, he was as blunt as the hard line of his jaw. “It’s a strong general who can give up the reins of power.”</p><p>Simon acknowledged the compliment with a slight nod. “I’ll always be a hunter, and as is custom, I’ll remain available to the new director till my death. However, I have every faith in her ability to lead the Guild.”</p><p>“Her?” Charisemnon snorted. “A female?”</p><p>Michaela raised an eyebrow. “My respect for the Guild has suddenly increased a hundredfold.”</p><p>Simon didn’t allow himself to get drawn into the dialogue. “Sara Haziz is the best possible person to take my place for a number of reasons.”</p><p>Astaad settled his wings. “Tell us.”</p><p>“With respect,” Simon said quietly, “that is no concern of the Cadre’s.”</p><p>It was Titus who reacted first. “You think to defy us?”</p><p>“The Guild has always been neutral for a reason.” Simon’s spine remained unbending. “Our job is to retrieve vampires who break their Contracts. But through the ages, we’ve often found ourselves in the middle of wars between angels. We survive only because we are seen as neutral. If the Cadre takes too much of an interest, we lose that protection.”</p><p>“Pretty words,” Neha said.</p><p>Simon met her gaze. “That makes them no less true.”</p><p>“Is she capable?” Elijah asked. “This, we must know. If the American Guild falls, the ripple effect could be catastrophic.”</p><p>Vampires would go utterly free, Raphael thought. Some would slip softly into an ordinary life. But others, others would murder and kill. Because at heart, they were predators. Not so different from angels when all was said and done.</p><p>“Sara is more than capable,” Simon said. “She also has the loyalty of her fellow hunters—I’ve had a significant number of them come up to me this past year and suggest her name as a possible successor.”</p><p>“This Sara is your best hunter?” Astaad asked.</p><p>Simon shook his head. “But the best will never make a good director. She is hunter-born.”</p><p>Raphael made a note to find out her name. Unlike normal members of the Guild, the hunter-born came out of the womb with the ability to scent vampires. They were the best trackers in the world, the most relentless—bloodhounds tuned to one particular scent. “And Sara?” he asked. “Will she accept?”</p><p>Simon took a moment to think. “I have not a single doubt that Sara will make the right decision.”</p><p>Chapter One</p><p>Sara wasn’t used to feeling sorry for vampires. Her job, after all, was to bag, tag, and transport them back to their masters, the angels. She was no fan of indentured servitude but it wasn’t as if the angels hid the price of immortality. Anyone who wanted to get Made had to serve the angels for a hundred years. Non-negotiable.</p><p>You didn’t want to bow and scrape for a century, you didn’t sign the Contract. Simple. Running out on the Contract after the angels delivered their part of the bargain? That just made you a welsher. And nobody liked a welsher.</p><p>However, this guy had worse problems than being returned home to a pissed-off angel. “Can you talk?”</p><p>The vampire clamped a hand over his almost-decapitated neck and looked at her as if she were insane.</p><p>“Yeah, sorry.” She wondered how the hell he was still alive. Vampires weren’t true immortals—they could be killed by both humans and others of their kind. Cutting off the head was the most foolproof method, but the majority of people didn’t go that way—it wasn’t as if the vamps were going to stand still for it. Shooting out the heart worked, so long as you then cut off the head while they were down. Or fire. That did the job. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But Sara was a tracker. Her job was to retrieve, not kill. “You need blood?”</p><p>The vampire looked hopeful.</p><p>“Suck it in,” she said. “You’re not dead. Means you’re a strong one. You’ll last till I can get you home.”</p><p>“Dhooooo.”</p> <p>Ignoring the gurgled rejection, she crouched down to slide an arm around his back so she could drag him to his feet. She was only five feet three, and he was considerably taller. But she wasn’t bleeding out from her neck, and she worked out seven days a week. Grunting as she got him up, she began to walk him to the car. He resisted.</p><p>“Need a hand?” A deep, quiet voice, aged whiskey and smoldering embers.</p><p>She didn’t know that voice. Neither did she know the body that moved out of the shadows. Six feet plus of solid, muscled male. Heavy across the shoulders, thick in the thighs, but with the liquid grace of a trained fighter. One she wouldn’t want to be up against in a fight. And she’d taken down vampires twice her size. “Yeah,” she said. “Just help me get him to the car. It’s parked at the curb.”</p><p>The stranger all but picked up the vampire—who was starting to make vaguely understandable sounds—and dumped him in the backseat. “Control chip?”</p><p>She pulled her crossbow off her back and aimed it at the vamp. The poor guy scrambled back, pulling his feet completely into the vehicle. Rolling her eyes, she returned the crossbow to its previous position and withdrew a necklet from its spot hooked into the waistband of her black jeans, under her T-shirt. Reaching in, she paused. “Don’t try anything funny or I’ll shoot you for real.”</p> <p>Slumping, the vampire let her clamp the circle of metal around his rapidly healing neck. The science behind the device’s effect on vampiric biology was complex, but the results clear—the vampire was now constrained from acting without a direct order from Sara. Helpful didn’t begin to describe the control chip because even this injured, the vamp could probably rip off her head in two seconds flat.</p><p>Sara liked her head, thank you very much.</p><p>Crawling back out, she shut the door and looked up at the other hunter—and there was no doubt in her mind as to his vocation. “Sara.” She thrust out a hand.</p><p>He took it, but didn’t speak for a long time. She couldn’t bring herself to protest—something in those dark, dark green eyes held her in place. Power, she thought, there was an incredible sense of power in him. Then he spoke, and the decadent whiskey of his voice almost blinded her to his actual words.</p><p>“I’m Deacon. You’re much smaller than your reputation suggests.”</p><p>She wrenched back her hand. “Thanks. And don’t offer to help next time.”</p> <p>Most men would’ve walked off, egos dented. Deacon simply stood there, watching her with those intense eyes. “It wasn’t a criticism.”</p><p>Why the hell was she still here? “I have to deliver Rodney to his master.”</p><p>“You have a rep.” He stepped closer, his eyes drifting to the strap that bisected her body. “You and your crossbow.”</p><p>Was that amusement she saw in that oh-so-serious face? “Don’t knock it until you’ve tried it. My bolts are made to carry the same properties as the necklets—it keeps me out of harm’s way until the target’s safely chipped, and given their ability to heal, it hardly hurts.”</p><p>“Yet you had a necklet.”</p><p>She took off the crossbow. “Move.” This close, all she could see was Deacon, his chest a mile wide. Maybe she was a little affected, but hey, she had a pulse. He was sexy as hell. That changed nothing. She was a hunter. And he might be Guild, but he was also an unknown. “My best friend loves them.” She didn’t get why, but then Ellie didn’t get the crossbow, so they were even. However, Sara had promised to try the things, since Ellie had tried the crossbow on her last hunt. “I asked you to move.”</p><p>He finally shifted back a few inches. Enough that she could pull open the passenger door and drop the crossbow inside it. Rodney was almost completely healed, but he’d gotten blood all over the interior of the rental car. Damn. The Guild would cover the expenses, but she didn’t particularly want to ride around in that mess. “I have to deliver the package.”</p><p>“Let’s talk to him first.”</p> <p>She closed the passenger door. “And why would we do that?”</p><p>“Aren’t you curious about who cut him?” He had ridiculously long lashes, she thought. Dark and silky and completely unfair on a man.</p><p>“Probably some vampire hate group.” She frowned. “Morons. Never occurs to them that they’re attacking someone’s husband, father, or brother.”</p><p>He kept staring at her. “What?” She rubbed at her face, glad her dark skin tone hid her stupidly hot reaction to this stranger. But no harm in looking, right?</p><p>“They told me you had brown skin, brown eyes, black hair.”</p><p>That sounded about right. “Who’s ‘they’?”</p><p>“I’ll tell you after we talk to the vampire.”</p><p>“Carrot and stick?” She narrowed her eyes. “I’m not a rabbit.”</p><p>His lips curved up a little at the corners. “For the sake of camaraderie.” Reaching into his battered leather jacket, he pulled out his Guild ID.</p><p>Curious enough not to cut off her nose to spite her face, she jerked her head toward the car. “I’ll go into the front seat, take off the necklet.” Unfortunately—or fortunately, depending on your point of view—vampires couldn’t speak while chipped. “You get into the back and make sure he doesn’t—”</p><p>“I won’t fit in the car.”</p><p>She took him in. It was all she could do not to ask him to strip naked so she could lick him from head to toe. “Okay,” she said, stuffing her suddenly energetic hormones back into storage. “New plan. I’ll get him to lower the window, and you put your arm around his neck while we talk.”</p><p>And that was what they did. Rodney was more than happy to chat once Sara introduced herself.</p><p>“You like to shoot people.” He made it sound as if she were a maniac. “With a bow and arrow!”</p><p>“You’re behind the times—I switched to a crossbow last year.” It was faster, but she kinda missed her specially designed bow. Maybe she’d go back to it. “And it doesn’t even hurt.”</p><p>“Says you.”</p><p>She blinked. “How old are you?”</p><p>“I just turned three.” Vampires counted their age from the time of their Making.</p><p>Sara shook her head. “And you tried to run? Why the fuck would you do something so stupid?” His sire, Mr. Lacarre, was way past mad.</p><p>“I don’t know.” He shrugged. “Sounded like a good idea at the time.”</p><p>Clearly, they weren’t dealing with the sharpest knife in the drawer. “Oooookay.” Her eyes met Deacon’s. Not a ripple in their night-shadow green depths, but she could’ve sworn he was holding back laughter. Biting off her own smile, she returned her attention to Rodney. “Simple question.”</p><p>“Oh, good.” The vampire grinned, showing both fangs, something the old ones never ever did. “I don’t like hard things.”</p><p>“Who cut you, Rod?”</p><p>He swallowed and blinked rapidly. “Nobody.”</p><p>“So you tried to decapitate yourself?”</p><p>“Yeah.” He nodded, which meant Deacon was holding on very lightly. Not that it mattered. Sara had her crossbow as insurance.</p><p>“Rodney.” She put all the menace she was capable of in that single word. “Don’t lie to me.”</p><p>He blinked again and—oh my God—he was going to cry. Now she felt like a bully. “Come on, Rod. Why are you scared?”</p><p>“Because.”</p><p>“Because . . .” She thought about what would scare a vampire that bad. “Was it an angel?” If it had been his sire, she couldn’t do anything about it except report the bastard to the Vampire Protection Authority. However, it was also possible the attack had been orchestrated by one of Lacarre’s enemies, in which case the angel would take care of it himself.</p><p>“No.” Rodney sounded shocked enough to be telling the truth. “Of course not. The angels Make us. They don’t kill us.”</p><p>And the boy was living in la-la land. “So who else scares you that bad?” She caught Deacon’s eyes again at that moment and found her answer in their no longer amused depths. “A hunter.” Or someone Rodney had mistaken for a hunter. Because real hunters didn’t kill vampires.</p><p>Rodney started sniffling. “Please don’t hurt me. I didn’t do anything.”</p><p>“Hey.” Sara reached out and, ignoring his flinch, patted him on the shoulder. “I’m interested in collecting my retrieval fee. I only get half if you’re dead, so it doesn’t make sense for me to kill you.”</p><p>Rodney looked at her with hope a shiny gem in his eyes. “Really?”</p><p>“Yep.”</p><p>“What about—” Lowering his voice, he pointed at the arm around his neck.</p><p>Deacon spoke for the first time. “I’m her boyfriend. I do what she says.”</p><p>She stared at him, but Rodney apparently found the claim highly reassuring. “Yeah, you’re the boss,” he said to Sara. “I can tell. My Mindy, she likes to be the boss, too. She told me I should run away and you know, we could go on like a cruise.”</p><p>Sara pressed a her finger over his lips. “Focus, Rodney. Tell me about the hunter who cut you.”</p><p>“He said all you hunters hate vampires.” Rodney’s voice got very small. “I didn’t know that. I know it’s your job to track us, but I didn’t think you hated us.”</p><p>“We don’t.” Sara wanted to pat him on the head. Jesus. “He was just being mean.”</p><p>“You think so?”</p><p>“I know so. What else did he say?”</p><p>“That vampires were the scum of the earth, and that the angels were being polluted by our presence.” He made a face. “I don’t know how that could be true since the angels Make us.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Sara was so surprised by the sudden burst of sense that it took her a second to process it. “Yeah, that’s right. So he was lying. He say anything else?”</p><p>“No, he just got out his sword—”</p><p>Sword?</p> <p>“—and tried to cut off my head.” He sat back, recital finished.</p><p>“What did he look like?” Deacon asked.</p><p>Rodney jumped, as if he’d forgotten the danger at his back. “I couldn’t see. He was wearing a black mask, and black everything. But he was tall. And strong.”</p><p>That included half the hunters in the Guild. Sara tried to get more out of Rodney, but it was a bust. Neckleting him again, she drove to Lacarre’s, very aware of Deacon following on a big monster of a bike. He remained outside the gates while she went in to deliver Rodney.</p><p>Rodney’s master was waiting for him in the sitting area of his palatial home. “Go,” he ordered.</p> <p>Sara removed the necklet and put it on the table for Lacarre to return to the Guild as Rodney shuffled off like a penitent schoolboy. Snapping his cream-colored wings shut in anger, the angel picked up an envelope from the table. “A receipt confirming payment. I sent it through as soon as you called to say you had Rodney.”</p><p>Checking it quickly, she slid it into a pocket. “Thank you.”</p><p>“Ms. Haziz,” he said, scowling, “I’ll be frank with you. I never expected Rodney to attempt an escape. I’m not sure how to punish him.”</p><p>Sara wasn’t used to talking to angels for longer than it took to get the assignment. In most cases, she didn’t even see them then—they were way too important to consort with mere mortals. That’s what vampires were for. “You know a Mindy?”</p><p>Lacarre stilled. “Yes. She’s one of my most senior vampires.”</p><p>“Jealous type?”</p> <p>“Hmm, I see.” A nod. “I’ve been spending extra time with Rodney—he’s a child and I’m afraid he’ll get eaten up if I don’t teach him some skills.”</p><p>Sara wasn’t even going to ask how Rodney had gotten through the Candidate selection process. So many people wanted to be Made that it was anything but a slam dunk. “He’s no mastermind,” she said. “I think if you punish him too harshly, he’ll break.”</p><p>Mr. Lacarre nodded. “Very well, Guild Hunter. Thank you.” It was a dismissal.</p><p>Leaving Rodney with a master who was still irritated, albeit no longer furious, felt vaguely wrong. But the vampire had made his choice when he asked to be Made. Now he’d be somebody’s slave for the next ninety-seven years. As she walked out, her path crossed with that of a slender redhead. The woman was dressed in a daring scarlet suit that molded to her body like second skin. It made a statement.</p><p>She would’ve kept going but the redhead stopped her. “You brought Rodney back.”</p><p>Mindy. “It’s my job.”</p><p>The older vampire—much older from the sheer ease with which she faked humanity—all but gritted her teeth. “I didn’t expect him to survive this long—he can barely tie his shoe-laces.”</p><p>“How did he get Made?” Sara asked, unable to swallow her curiosity any longer.</p> <p>Mindy waved a hand. “He was fine bef—” She belatedly seemed to realize who she was talking to. “Good-bye, Guild Hunter.”</p><p>“Bye.” Interesting, Sara thought. Everyone knew—even if the knowledge had never actually been confirmed—that a tiny percentage of Candidates went insane after the transformation. This was the first time she’d seen an example of someone who’d been diminished instead.</p><p>Deacon wasn’t around when she got back into the rental car, but he’d found her again by the time she reached her hotel. She parked in the underground garage and got out to see him bringing that monster motorcycle to a stop beside her. “How did you get past security?”</p><p>He took off his helmet, unzipped his jacket, and swung off the bike. Gorgeous male muscle. Oh, so touchable. Something very tight in her stomach wound even tighter. Dear God, but the man was sex on legs.</p><p>Chapter Two</p><p>Taking a deep breath to wash away the rush of raw hunger, she headed for the elevators, weapons bag in hand. Experience told her management would get a little testy if she walked in wearing her crossbow. “So? Security?”</p><p>“It sucks.”</p><p>That was her estimation, too. “It was the most convenient location for this hunt.”</p><p>Being stuck in an elevator with the man was an exercise in frustration. His smell; soap and skin, heated up from within to create something uniquely Deacon—pure male with an edge of steel—wrapped around her like an aphrodisiac. Since she couldn’t not breathe, she was overdosing on it by the time the elevator kicked them out on the third floor. “Stay here.” She held up a hand. “I need to check your credentials.”</p><p>He leaned his back up against the wall opposite her door. “Say hi to Simon from me.”</p><p>Keeping an eye on him, she swiped her keycard and entered the room. It was fairly basic—a double bed beside a small chest of drawers, a table with just enough room for the hotel phone and maybe a laptop, a couple of chairs. Really, everything she needed while on a hunt. The call to Simon’s cell phone from her own went through without problems.</p><p>“Deacon,” she said the instant he picked up. “Who is he and why is he here?”</p><p>“Give me a description.”</p><p>She did. “So?”</p><p>“Yes, that’s Deacon. He’s on a job and it’s something I want you on as well—I assume you’ve completed the retrieval for Lacarre?”</p><p>“Yeah.” Intrigued by what he wasn’t saying, she put a hand on her hip. “What’s the job, and does it have anything to do with vampires getting their heads lopped off?”</p><p>“Deacon will explain. We need to sort this out fast.”</p><p>“Will do.” She paused. “Simon. The other thing . . .”</p><p>“It’s all right, Sara. The decision doesn’t have to be made today. Or even tomorrow.”</p><p>But Sara knew it did have to be made. “After this job. I’ll give you an answer.”</p><p>“I’ll wait for it.” A pause. “Sara, Deacon’s extremely dangerous. Be careful.”</p><p>“I’m pretty dangerous, too.” Hanging up after a few more words, she went to the door and pulled it open. The man in question was standing on the doorstep. Her eyes drifted down to the duffel that had materialized at his feet. “Whoa. You’re not staying here.”</p><p>“I have a lot to tell you. I’ll crash on the floor.”</p><p>Her streak of curiosity was a pain in the ass sometimes. “Yeah, you will.” Waving him in, she locked the door. “So, let me guess—we have to find and neutralize this psychopath pretending to be a hunter.” There’d been five murders in the past week and a half that she knew about. All vamps. All killed by decapitation.</p><p>Deacon dropped his bag on the floor beside hers and shrugged off his jacket to reveal a rough navy shirt that threw his eyes into even brighter relief. “I’m not so sure he’s pretending. I’ve been on his trail since the day after the second murder, and all signs point to a hunter.”</p><p>“I don’t believe you,” she said, remaining by the door, arms crossed.</p><p>Putting his jacket over the back of a chair, he pulled it out and grabbed a seat before bending down to unlace his boots. “Doesn’t mean it’s not the truth.”</p><p>“Hunters don’t go around killing innocent people.” It wasn’t what they were, what they did. There was honor in being a hunter. “We make sure vampires don’t get killed more often than they already do.” Legend had it that before the formation of the Guild, vampires who dared try an escape were simply executed upon discovery.</p><p>Having removed both boots and socks, Deacon stretched out his legs and tipped his chair back against the table, eyes intent. “Bill James.”</p><p>It was a punch to the gut, a fucking knife to the heart. “How do you know about that?” Nobody but the three hunters who’d gone after him—and Simon, of course—knew about Bill. To the others, he’d died a hero, been given a full Guild funeral.</p><p>Deacon continued to watch her with absolute, unwavering focus, a calm that made her wonder if the man ever let go. “My name is Deacon, but most people know me as the Slayer.”</p><p>She stared. He wasn’t joking. Fuck.</p><p>Pushing off the door, she walked very quietly to the bed and sat down on the edge. “I thought they made you up. Like the bogeyman.”</p><p>“The Guild recruits and trains some of the deadliest men and women in the world. We need a bogeyman.”</p><p>She shook her head. “Ellie’s never going to believe I met the Slayer.” It was a joke, the name. Taken off a television show. “The Guild really has a hunter whose job it is to hunt our own?”</p><p>“Only when necessary.” He didn’t speak again until she raised her head. “And you know it sometimes is necessary.”</p><p>“Bill was an aberration,” she said. “Something snapped in him.” The other hunter had taken to killing children, savaging them with an inhumanity that made her gorge rise even now.</p><p>“Hunting our own is a rare thing,” Deacon acknowledged. “But it happens. That’s why there’s always a Slayer in the Guild.”</p><p>“Why didn’t you track Bill?” Because it was Elena who’d had to kill the older hunter. Sara had been determined to do the gut-wrenching task—Bill was her friend, but he’d been Ellie’s mentor. But Bill had attacked her with a tire iron in an ambush none of them had seen coming. She’d been unconscious before she hit the ground. And her best friend had had to knife her mentor to death.</p><p>He looked at me as if I’d betrayed him, Ellie had said afterward, her face splattered with Bill’s lifeblood. I know he had to die, but I can’t stop thinking that he was right. His blood was so hot.</p><p>“Sheer bad luck,” Deacon said, dragging her back to the present. “The situation went critical so fast that I couldn’t get back in time—I was on the other side of the world.” He didn’t move, a predator at rest. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Hunting?”</p><p>“Business,” he said to her surprise. “The Slayer’s rarely called for. I’m a weapons maker by vocation.”</p><p>“Deacon? Wait a minute.” Pulling her bag across, she unzipped it and grabbed her crossbow. The familiar, stylized D stared up at her from the bottom of the stock. “This is your work?”</p> <p>A small nod. “I make tools for hunters.”</p><p>“You’re the best there is.” This crossbow had cost her a mint. As had the bow she adored. “And you slay in your spare time? Nice.” Shaking her head, she put the crossbow back into the bag. “How come I’ve never heard of you personally?”</p><p>“It’s not a good idea to be friends with the people you might one day have to kill.”</p><p>“A lonely life.” She hadn’t meant to be so blunt, but she couldn’t imagine that kind of an existence. She was no social butterfly—not yet, anyway—but she had a core group of friends who kept her sane and balanced.</p><p>“Slayers are chosen from the loners.” Raising his hands, he undid the first few buttons of his shirt. “Do you want the shower first?”</p> <p>She wanted to lick her lips, that’s what she wanted to do. The man’s skin stretched golden and strong over that muscular physique, and she could see dark curls of hair in the open triangle of his shirt. Her body tightened . . . expectant, ready.</p><p>Cold shower time.</p><p>“Thanks,” she said, getting up. “I’ll make it quick.”</p><p>Deacon just nodded as she grabbed her gear and hauled ass. The Slayer was delicious, no question about it, but she wasn’t in the market for a lover. Not when she was about to make the biggest decision of her life. A decision that might make her existence even lonelier than Deacon’s.</p><p>Male hunters were macho idiots—and she meant that in the best way—as a rule. Playing second fiddle didn’t come easily. And it didn’t get much more second fiddle than being the Guild Director’s man.</p><p>Deacon finally unclenched the hand he’d fisted the instant he sat down in the chair. Sara Haziz was not the woman he’d been led to expect. Simon had some explaining to do.</p> <p>“Brown skin, brown eyes, black hair, my ass,” he muttered under his breath. The woman was an erotic fantasy come to life. Small, curvy, perfect. Gleaming coffee-and-cream skin, hair that probably fell to her waist when released from that tight braid, and brown eyes so big they saw right through him.</p><p>This was not the woman Simon had described as his “sensible successor.” That made her sound about as interesting as shoe leather. It didn’t even hint at the power beneath the surface, the strength in that backbone. He’d met her only a couple of hours ago, and already he knew she could bust balls with the best of them.</p><p>The woman would make a perfect Guild Director.</p><p>Which meant he should keep his hands, and his thoughts, to himself. No sucking on sexy Sara’s neck. Or other parts of her body. The office of Guild Director was a necessarily public one. Deacon didn’t do public.</p><p>“But she’s not director yet.” He tapped a finger on one jean-covered thigh, his eye on the bed.</p><p>He wanted Sara. And he didn’t want lightly. But seducing her wasn’t on the agenda.</p><p>“Keep her safe. She won’t accept a bodyguard, but you can accomplish the same thing by keeping her with you on the hunt.”</p><p>“I work alone.”</p> <p>Simon’s face was granite. “Tough. She’s one of my best hunters—she won’t slow you down.”</p><p>“If she’s one of the best, why does she need babysitting?”</p><p>“Because the Cadre knows she’s my chosen successor. I wouldn’t put it past certain archangels to ‘test’ her.”</p><p>Deacon raised an eyebrow. “Were you tested?”</p><p>“They almost killed me.” Blunt words. “It’s tough to win against five old vamps on your own. I survived only because I happened to be with my wife at the time. Two pissed-off hunters against five vamps is much better odds.”</p><p>So here he sat, listening to water cascade in the bathroom as he fantasized about kissing a slow path down Sara’s body. It wasn’t doing anything to lessen his arousal. And if she walked out to find him hard as fucking stone, he knew damn well he’d be spending the night in the corridor outside.</p><p>That, he couldn’t chance—he had to keep her in sight. Simon had been very clear about that. If the archangels planned to test her, they’d do it when they thought her vulnerable. So he’d make sure she never was. Shoving a hand through his hair, he got up and checked the room. It was fairly secure. No outside windows—claustrophobic but safe, no entrances or exits aside from the door—which he jammed shut with a special tool of his own making, and no vents large enough for anything to get through.</p><p>By the time Sara exited the shower wrapped in a fluffy hotel robe, rubbing at her hair with a matching towel, he was confident enough of her safety to go have his own shower. A freezing one. “Christ.” He gritted his teeth and bore the onslaught. Pleasing his cock wasn’t as important as ensuring that the Guild went on.</p><p>He’d asked Simon about that. Why would the archangels potentially sabotage an organization that made their lives a hell of a lot easier?</p><p>“It’s a game,” Simon had said. “They need us, but they’ll never allow us to forget that they’re the more powerful. Attacking me, attacking Sara, isn’t about stopping the Guild—it’s about reminding us the Cadre is watching.”</p><p>Sara heard the water come on and quickly finished drying her hair before picking up her cell. She had no idea what time zone Ellie was in, but her best friend answered after a single ring.</p><p>“Sara,” she said, “do you know what a skill it is to wrap three-feet-tall porcelain vases so they don’t break in transit? And I did it! These gorgeous babies don’t have a scratch on them. Genius, thy name is Elena.”</p><p>“Do I even ask?”</p><p>“They were a gift.” Ellie sounded delighted. “They’ll look perfect in my living room. Or maybe one in the bedroom, one in the living room.”</p><p>Ellie’s preoccupation with her décor struck a familiar chord in Sara. Hunters made nests. It was a response to the fact that they spent so much time on the road, and in the gutter. Sara was worse than most—she loved her parents but they were feckless hippies at best. She’d gone to ten different schools by the time she was seven. A solid, stable home was as necessary to her as breathing. “Can’t wait to see them.”</p><p>“You sound funny.”</p><p>“I met the Slayer.”</p><p>A pause. “No shit.” The whistle was a long one. “Scary?”</p><p>“Oh yeah. Built like a tank.” If Deacon ever came after her, she’d have to make sure he never got within punching distance. A single hit with one of those big fists and her neck would snap. “Ellie, there’s a hunter going around killing vampires.”</p><p>“Fuck.” Elena’s voice changed, became darker. “You’re hunting him?”</p><p>“Yeah.”</p><p>“I’m in New York, landed a few hours ago. I can be on the next flight.”</p><p>Sara was already shaking her head. “I don’t know what’s going on yet.”</p><p>“You can’t go after him alone.”</p><p>“I’m not. Deacon’s with me.”</p><p>“The Slayer?” Her relief was open. “Good. Look, Sara, I’m hearing things.”</p><p>“What?”</p><p>“All of us know you’ve got Simon’s position anytime you want. But I had a conversation with a high-level vamp on the plane home and he knew your name.”</p><p>Simon had warned her of this. “The Cadre takes an interest in the next Guild Director.”</p><p>Elena’s silence was long. “I know you can’t run and hide from this, so I’ll just say—be damn careful. The archangels aren’t anything close to human. I wouldn’t want to be within ten feet of one.”</p><p>“I don’t think any of them will bother to personally check me out—probably send some of their vampires to have a look.” And she knew how to handle vampires.</p><p>“Lucky you have the Slayer with you. Serious manpower when you need it.” A faint pinging sound came over the line. “Gotta go. I think the takeout’s arrived.”</p><p>Hanging up, Sara stared at the phone. Yes, it was lucky, wasn’t it, that Deacon had shown himself to her when he spent most of his time in the shadows. And how very convenient that she’d been posted on a hunt to the very city where the serial killings were taking place. Eyes narrowed, she waited.</p><p>Chapter Three</p><p>Deacon walked out a couple of minutes later, dressed in nothing but a pair of jeans. Her hormones danced. Damn near did the foxtrot. She refused to join in. “Simon sent you.”</p><p>To his credit, he didn’t bother to deny it. “Two birds. One stone.” Grabbing a fresh T-shirt from his duffel, he pulled it over his head. “You know it’s the right decision.”</p><p>The fact that he sounded so coolly logical made her want to shoot him with the crossbow just to make a point. “The Guild Director can’t be seen as weak.”</p><p>“She also can’t be seen as stupid.” Intractable will in those midnight-forest eyes.</p><p>Putting down the cell she’d been squeezing half to death, she dug out a brush and began to pull it through her hair. “Tell me about the killer. Is there any chance it could be an impostor?”</p><p>He didn’t say anything for several seconds, as if not trusting her sudden capitulation. “Yes. But as of right now, I have three possibles—all hunters. We’ll visit them one by one.”</p><p>“Tonight?”</p><p>A small nod. “I figure we give it four hours, enough time for the killer to relax his guard.”</p><p>“Why didn’t you follow him after he hit Rodney?”</p><p>“There was no visible trail.”</p><p>She snorted. “And your job is to babysit me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Babysitting you isn’t what I want to do.” Quiet, intense words, stroking over her skin like living velvet. “But since taking you to bed is out of bounds, I’m stuck with babysitting.”</p><p>Heat exploded across her skin, a raw, dark fire. “What makes you think I’d let you within a foot of me?” Her voice held the rough edge of desire, but it could as easily have been anger.</p><p>“What makes you think I’d ask nice?”</p><p>“Try anything and I’ll cheerfully gut you with your own knife.”</p> <p>Deacon smiled. And it turned him from sexy to devastating. “This’ll be fun.”</p><p>But four hours of fitful sleep later, she was in no mood to play. Pulling on her gear before joining Deacon in the corridor, she adjusted her crossbow and set her jaw. “I don’t like the fact that we’re hunting one of our own.”</p><p>Silence.</p><p>She glanced at him as they walked down to the garage, and saw nothing. No expression. No emotion. No mercy. In that moment, he was the Slayer. “How many have you had to kill?”</p><p>“Five.”</p> <p>She blew out a breath at the single precise word, and opened the door to the stairs. No point in making hotel security crazy by being caught on the elevator cameras armed to the teeth. “Why you?”</p><p>“It has to be someone.”</p><p>She understood all about that. “I never wanted to be Guild Director.”</p><p>“That’s why you were chosen—you’ll do what the director is meant to do.”</p><p>“As opposed to?”</p><p>He exited first, and she knew it was a gesture of protection. Annoying, but on the scale of annoyances, minor.</p> <p>“You know about Paris. They had that director a few years ago who politicked himself into the position. Almost got all his hunters killed, he was so busy grandstanding.”</p><p>Sara nodded and headed to the bike, their chosen method of transport tonight. “I always wondered how that could’ve happened.” Hunters were a tough, forthright lot as a whole. Slick made them suspicious.</p><p>“Some people say he struck a deal with a powerful cabal of vampires, that they influenced the vote.”</p><p>Very old vampires were rumored to have mind-control abilities, and one of Sara’s more important qualifications for the position of Guild Director was that she had a natural immunity to all vampiric abilities. Like Ellie and the other hunter-born, she’d always been meant for the Guild. “I’m surprised he’s still alive.”</p><p>“Don’t be so sure—he hasn’t been seen since he was deposed.” Handing her a spare helmet, he watched as she put it on, then settled his own. “Can you hear me?”</p><p>She nodded, realizing the helmets were miked. “Where’re we going first?”</p><p>“Timothy Lee. He’s shorter than Rodney described, but Rod was traumatized. We can’t trust his recollection.”</p><p>She was about to reply when she suddenly knew they were no longer alone in the garage. Already straddling the bike behind Deacon, she looked across to the door they’d used to exit the stairs and saw a vampire. She had no need to ask if Deacon had made him, too—the Slayer had gone motionless the same instant she had.</p> <p>Meeting the vampire’s gaze, she felt the hairs on the back of her neck rise. He was an old one, his power so potent it thickened the air until she could barely breathe. When he didn’t say anything, she decided to remain silent, too. Deacon started the bike and backed out of the space. “Watch him,” he said into the mike.</p><p>As he turned the motorcycle, she twisted her head to keep the vamp in sight.</p><p>The tall, dark-haired male didn’t so much as blink as they drove out of the garage.</p><p>“Games,” she muttered. “They’re letting me know I’m being watched.”</p><p>“Testing your strength.”</p><p>“You know, I can see their point—can you imagine what would happen to the world if any of the major chapters had a weak director?”</p><p>“Paris,” Deacon said again.</p><p>She nodded, though he couldn’t see her. “What was his name—Jarvis?”</p><p>“Jervois.”</p><p>“Right.” Jervois’s weakness had led to a disorganized European Guild. Vampires had taken immediate advantage. Most had simply escaped, planning to lose themselves into the world. But a few . . . “Several vamps gave in to bloodlust. The news reports said the streets ran with blood.”</p><p>“They weren’t far wrong. Paris lost ten percent of its population within a month.”</p><p>Put in such finite terms, the horror of it was chilling. “Why didn’t the angels step in?” In her native New York, Raphael ran the show, and as far as Sara knew, no bloodlust-ridden vampire had ever set foot in the city. Since that was statistically impossible, obviously Raphael had taken care of any problems with such flawless efficiency no one had heard so much as a murmur.</p><p>“Word is”—Deacon’s voice turned cold—“Michaela decided the humans needed a lesson in humility.”</p><p>Michaela was one of the more visible archangels, a stunning beauty who enjoyed attention enough to pose for the human media on occasion. “I think that one,” Sara said, “would be happy to push us all back to a time where she’d be looked upon as a goddess.”</p><p>“There are a lot of people even now who see the angels as God’s messengers.”</p><p>“What about you?”</p><p>“Another species,” he said. “Maybe they’re what we’ll become sometime in the next million years.”</p><p>It was an interesting hypothesis. Sara didn’t know what she thought. Angels had been around since the earliest cave paintings. There were as many explanations for their existence as there were stars in the sky. And if the angels knew the truth, they weren’t telling. “So, why Timothy Lee?”</p><p>“He’s been in the city during every one of the murders, he’s capable of doing the job—”</p><p>“We’re all capable.”</p><p>“Yes. So that wouldn’t matter as much, but Timothy’s a very dedicated hunter. He sees it not as a job, but as a calling.”</p><p>“Is he hunter-born?” Having been best friends with Ellie for so many years, she knew that for those born with the ability to scent-track vampires, entering the Guild was less a choice than a compulsion.</p><p>“No. But he worships the hunter-born.”</p><p>“Not healthy, but not psychopathic either.”</p><p>Deacon nodded. “That’s why he’s one of three. The other two have their own little idiosyncrasies but all hunters are strange to some degree.”</p><p>“You’ve met Ashwini, haven’t you?”</p><p>She heard him choke. “Met isn’t quite the right word. She shot me the first time we came into contact.”</p><p>“Sounds about right.” She grinned, but it didn’t last long. “If it is one of these three, you’ll execute him?”</p><p>“Yes.”</p><p>“No police?”</p><p>“I’m authorized to do this. The law will never become involved.” A pause. “They’re glad we police ourselves. Hunters who turn bad have a way of upping the body count.”</p><p>“Like vampires.”</p><p>He didn’t say anything, but she felt his agreement in the tense stillness of his body. Eerily quiet, the night seemed to discourage further conversation, and they rode in silence until Deacon pulled over to the side of a still, dark street. “We’ll go on foot from here.”</p><p>Stowing her helmet alongside his, she followed him as he led her down the street and to a chain-link fence. She frowned. “This looks like a junkyard.”</p><p>“It is.”</p><p>Okay, that was truly odd. Hunters almost never lived in crappy places. They were paid very well for sticking their necks out chasing vampires who might just tear those necks off. “To each his own.”</p><p>“He has a hellhound.”</p><p>She thought she’d heard wrong. “Did you say hellhound?” Visions of red eyes pulsing in a miasma of sulfur danced through her head. Then the pitchforks started circling.</p><p>“Big, black thing, probably bite your hand off if you look at it wrong. Timothy calls it Lucifer’s Girl.” He took something from his pocket. “Tranquilizer dart.” Then he was gone, and if she hadn’t seen it, she’d never have guessed he could move that fast.</p><p>She stayed with him, both of them scrambling over the chain link to land with hunter silence on the other side. There was no bark, nothing to alert them they’d become prey—Lucifer’s Girl came out of the darkness like a raging whirlwind. Sara ducked instinctively, and the dog’s body jumped over hers . . . to meet the clearly rapid-acting tranquilizer in Deacon’s hand. Instead of allowing the dog to fall, Deacon caught its muscled weight and lowered it gently to the ground.</p><p>“You like her,” Sara said, incredulous.</p><p>Deacon stroked the dog’s heaving sides. “What’s not to like? She’s loyal, and she’s strong. If I have to execute Timothy, she’ll miss her master.”</p><p>“You’d adopt her, wouldn’t you?” She shook her head. “There go your chances of ever again getting a girl.”</p><p>He raised his head, looking at her in that intent way of his. “Not a fan?”</p><p>“She’s got nine-inch fangs.” Only a slight exaggeration. “A woman would have to love you an incredible amount to put up with that kind of competition.” She jerked her head toward the building on the other side of the mountain of scrap metal and God knew what else. “Yes?”</p><p>“Let’s go. Tranq will keep Lucy out for a while.”</p><p>Lucy?</p><p>They took their time finding a path through the junk, checking for booby traps in the process. When they finally reached the tumbledown shack that Timothy called home, it was to discover the place empty. A little breaking and entering later, they were inside, but saw nothing even close to a smoking gun. The fact that Tim wasn’t home meant nothing—hunters kept irregular hours as a rule.</p><p>She watched as Deacon took something from his pocket and placed it on the bottoms of all the shoes he could locate. “Transmitters,” he told her. “Battery life of about two days. So if there’s a kill in that period, and he wears a pair I’ve tagged, I’ll be able to trace his movements.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Who’s next on the list?”</p><p>He told her after they scaled the chain link—petting Lucy along the way, and waiting long enough to ensure that she was coming out of the tranq okay. “Next is Shah Mayur. Loner, does the job but doesn’t seem to have any contact with other hunters.”</p><p>“Like someone else I know.”</p> <p>Deacon ignored the comment as they straddled his bike and took off.</p><p>Grinning, she pressed herself to the heat of his back. “What put Shah on your radar?”</p><p>“He’s had five complaints filed against him by the VPA.”</p><p>The Vampire Protection Authority had been set up to stop cruelty and prejudice against vamps. They never won court cases—it was extremely hard to make a vampire look the victim when you had pictures of their blood-soaked kills—but they could kick up a serious stink. “What for?”</p><p>“Excessive violence against a vampire during retrieval.”</p> <p>“Hmm.” She thought about that. “Why don’t you sound more excited?”</p><p>“Because all five complaints came from the same vamp.”</p><p>Her own burgeoning excitement deflated. “Probably someone with an ax to grind.”</p><p>“Yeah, but we have to check him out.”</p><p>Shah Mayur lived in a much more ordinary home—in terms of its attractiveness to hunters. His apartment occupied the entire third floor of a freestanding town house.</p><p>Sara frowned. “Getting in’s going to be a problem.” Deacon had already told her there was no internal access, so they couldn’t break in downstairs—and the ladder that Shah used to get up and down was currently pulled up. That didn’t mean he was home. According to Deacon’s intel, it could be raised or lowered by remote. Shah wasn’t a trusting sort. But he was also supposed to be on a flight to Washington as of an hour ago. “Any ideas?”</p> <p>Deacon was staring up at the back wall when she turned to him. “Can you climb that?”</p><p>She followed his gaze to what looked like some kind of a water pipe, a reasonably substantial one. “Yeah.” The request surprised her. “I thought you were babysitting me.”</p><p>“We’re probably under surveillance,” he told her, voice matter-of-fact. “I can’t defang you completely.”</p><p>“That implies you could.” She shot him a sweet smile laced with bite. “We have to consider something else—if we are being watched, then the angels and high-level vamps have to know what we’re up to. I’m not going to deliver a hunter into their hands.” Angelic vengeance could be soul-destroyingly brutal.</p><p>Deacon looked into her face, unblinking. “That’s why we have to get to him first. We’ll deliver death with mercy.”</p><p>Giving a nod, she accepted the transmitters he held out and ran to the pipe. She was light enough—and more importantly, had enough muscle—that it was fairly simple to pull herself up. When she reached the window ledge, she found it an easy, wide perch. So close, it was tempting to push up the window and go in, but she took her time checking everything out.</p><p>Just as well, as it turned out.</p><p>Shah had rigged a garrote across the opening, at the exact height to cut anyone coming in. From the faint glitter, she guessed it was covered with crushed glass. Gruesome, but home security wasn’t a crime. Double-checking for any electrical wires that might be connected to an alarm, she glanced down at Deacon and signaled her intention to enter.</p> <p>He nodded once and signaled back. Two minutes.</p><p>Pushing up the window, she stepped in with care, avoiding the lethal stroke of the garrote by bending low. She found herself in what looked like the living room. It was dark. But not dark enough to hide the man sitting silently in the armchair.</p><p>Chapter Four</p><p>“I expected Deacon,” he said in a silky soft tone.</p><p>“Shah Mayur, I presume.”</p><p>“Sara Haziz.” A lilt of surprise. “Since when are you a Slayer?”</p><p>“Call it a sideline.” She noted the gun in his lap. “You’re prepared.”</p><p>“Didn’t want my head lopped off before I had a chance to explain that I’m not a homicidal killer.” This time, the tone was wry.</p><p>She liked him. Didn’t mean he wasn’t a murderer. “So if I leave?”</p><p>“I’m not going to shoot you. Tell Deacon I’ll meet you both outside.” A pause. “And Sara, it’s not good form for the future Guild Director to be breaking and entering.”</p><p>“Why does everyone act like it’s a done deal?” she muttered and backed out, keeping an eye on his hands the whole time. If necessary, she could jump—it would break a few bones, but it wouldn’t kill her. Not like a bullet would.</p><p>Whether Shah replied, she didn’t hear. It was far easier to go down the pipe than it had been to come up. “He’s heading down to talk.”</p><p>Deacon’s face went very quiet. Dangerous. “He’s not supposed to be here.”</p><p>“He knew you were coming. And he knows your name.”</p><p>That made him go even more still. Sara found herself fascinated. Did Deacon ever let himself go? Or was he this contained even in the most intimate of situations? It was tempting to kiss him and find out, but with the way he drew her, she knew she wouldn’t stop at a kiss.</p><p>The whisper of Shah’s ladder sliding to the ground was a welcome distraction. She waited as the other hunter descended, his gun nowhere in sight. Of course, that simply meant he was good at hiding his weaponry. Elena would approve, Sara thought. Her best friend usually had spikes secreted in her hair, and knives strapped to her thighs. That was just for starters.</p><p>“Hello, Deacon.” Shah turned out to be tall, dark, and very handsome, with shining black hair that swept his shoulders.</p><p>“I’m impressed.” Deacon subtly angled himself so he protected Sara.</p><p>She stopped herself from rolling her eyes and used the chance to retrieve her own gun from the small of her back. Then she moved out of Deacon’s night-shadow so she’d have a clear line of sight.</p><p>“Spying’s my thing. I work intel for the Guild.”</p><p>The Guild had an intel division? Sara wondered how many more secrets she’d learn as Guild Director. It was temptation indeed for a woman as curious as her. But was she willing to give up everything she was, give up the possibility of a family, children? Yes, there were men who’d be more than happy to sleep with the Guild Director, but they weren’t the kind of men she’d touch with a barge pole.</p><p>No, Deacon was her type. Cool, controlled, strong. And about as likely to sleep with the woman who’d effectively be his boss—if she accepted the directorship—as he was to start spouting jokes. Reining in her wandering thoughts, she met Shah’s gaze. “And we’re just supposed to believe you?”</p><p>Shah shrugged, giving her a secretive smile. “Or I could tell you all about the time you and Elena decided to try out the stripper pole at Maxie’s.”</p><p>How the fuck had he learned about that? She scowled. “If you work intel, why didn’t Simon clear you?”</p><p>“Deacon runs his ops independently.” He shrugged. “I could’ve played hard to get, but I figure you two are a good bet when it comes to keeping secrets. The future director and the Slayer. Who’re you going to tell?”</p><p>Deacon suddenly had his hand around Shah’s neck, a knife to his abdomen. “Take off your shirt.”</p><p>Shah blinked, hiding his surprise behind charm. “Didn’t know you swung that way.”</p><p>Deacon pushed the knife a little.</p><p>“Fine.” Unbuttoning the shirt with rapid fingers, Shah shrugged it off.</p><p>“Sara, check his body for marks of a struggle. One of the vamps put up a hell of a fight.”</p><p>Sara did a close inspection, but all she saw was smooth, unblemished skin. “He’s clean.”</p><p>Shah rubbed at his throat as Deacon let him go. “You could’ve asked nice.”</p><p>“And you could’ve stabbed him in the heart.” Sara snorted. “Drop the act. You’re about as helpless as a piranha.”</p><p>“Can’t blame a boy for trying.” He smiled, revealing dimples he no doubt used as a tool. “If you want my take, I’d put my money on Tim. Have you seen that dog of his? Probably made a deal with the devil and got that as insurance. Now the thing’s possessed him.”</p><p>Sara shook her head, noting the gleam of amusement in his eyes. “I don’t think you should throw stones—I saw the teddy bear on your couch.”</p><p>Interesting. A suave, sophisticated spy could go bright red under cinnamon-dusted skin. “It’s my nephew’s. And if you don’t need to manhandle me anymore, I’d like to go to sleep.” With that, he turned and left.</p><p>“He didn’t hit on you.” It was a quiet statement.</p><p>She pursed her lips. “And you felt the need to point that out, why?”</p><p>“Shah doesn’t have any close hunter friends, but he’s popular with the ladies. He hits on anything with breasts, but petite dark-haired women are especially his type.”</p><p>“Thank you for crushing my self-esteem under your boot.” Restraining the urge to kick him, she grabbed her helmet and thrust it on.</p><p>Deacon took his seat, putting on his own helmet before starting the engine. They were ten minutes from Shah’s home and cutting through a deserted parking lot when Deacon came to a halt. “Fight or run?”</p><p>She’d seen the vampires in the shadows. How many? Five, no, seven. Seven against two. “Run.” Stupidity wasn’t what had kept her alive this long.</p><p>It was only as Deacon was peeling out of the lot that she realized he’d left the choice up to her. It was . . . unexpected.</p><p>Their third stop of the night was a gay bar. Sara stared up at the bar’s name. “Inferno.” She turned to the silent man by her side. “Is it me or are we seeing a trend here?”</p><p>A quirk of his lips. It was sexier than a full-fledged smile from any other man. “I’m leading you into sin.”</p><p>She couldn’t help it. She laughed. “Obviously, suspect number three is gay. Right?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Marco Giardes.” He nodded up. “Lives above the bar.”</p><p>“Huh?”</p><p>“Owns the place. Bought it with an inheritance.”</p> <p>Sara shrugged. “Doesn’t bother me. Bother you?”</p><p>A bit of red stained his cheeks. Her mouth fell open. “What?”</p><p>He blew out a breath. “You’ll see.”</p><p>“We’re going in?”</p><p>“Yeah. He doesn’t know about me—unless he’s another spy. We’re just two hunters who heard about his place and decided to drop in.”</p> <p>Since hunters were known to do things like that to support each other, it was a perfectly believable cover. And despite the fact that it was close to four a.m., the bar was jumping. “Weapons?”</p><p>“No problem for hunters.”</p><p>“Then let’s go.”</p><p>They flashed their Guild IDs and got waved in by the heavily muscled bouncer . . . who gave Deacon a thorough going-over. Sara bit the insides of her cheeks when the big, tough Slayer shifted a little behind her.</p><p>The instant they entered the main floor, conversation stopped, then started in a huge rush. She was welcomed with smiles—there were several other women in the crowd—but the attention was most definitely on Deacon. So when he put his hand on her hip and pulled her up against him, she didn’t protest. “Poor baby,” she murmured. “They really like you.”</p><p>“It’s not funny.” She’d never heard a blush before.</p> <p>A beautiful male with the slinky body of a catwalk model strolled over. “What a shame,” he murmured, noting their body language. “I hope you’re taking good care of him.”</p><p>Sara patted Deacon’s hand where it curved over her hip. “The best.”</p><p>“Will you let him dance with us?”</p><p>Sara could feel Deacon’s horror in the absolute frozen lines of his body. It was tempting to tease, but . . . “He’s not much of a dancer.”</p><p>Giving another mournful sigh, the blond walked away. Unable to keep it in any longer, Sara turned and buried her face in Deacon’s chest as her body shook with laughter. His arms came around her, his lips at her ear. “We’re going to a girl bar on our next date.”</p><p>That simply made her laugh harder. Tears leaked out of her eyes. By the time she got it out of her system, the scent of Deacon was well and truly in her lungs. The man smelled delicious. A little bit of heat, a little bit of sweat, a whole lot of dangerous. Perfect.</p><p>Hands flat on that gorgeous chest of his, she looked up. “I guess they know a manly man when they see one.”</p><p>His lashes, long and beautiful, shaded his eyes, but she saw the glint in them. “What about you?”</p> <p>Her answer was interrupted by a discreet cough. She turned to find a man who could only be another hunter. His stance was easy in the way of someone who knew how to move in a fight, his eyes watchful . . . and at the moment, amused. “Welcome. I don’t believe we’ve met before.”</p><p>“Sara.” She stuck out her hand. “This is Deacon.”</p><p>“Sara Haziz?” The hunter’s smile turned dazzling. “I’m so delighted to meet you. I’ve heard of you, of course. Please, come in.” He glanced over his shoulder. “Pierre, prep a table.” Returning his attention to them, he gave a short nod. “I’m Marco. With the Guild but not for long.”</p><p>“Oh?”</p><p>He smiled again, displaying a row of gleaming white teeth. “I decided this bar is my true love after all.”</p><p>Not many hunters retired. But it wasn’t completely unheard of. “You won’t miss the thrill of the hunt?”</p><p>“It’s a young man’s game. I’m in my late thirties now, but don’t tell.”</p><p>Deacon finally broke his silence. “Your bar’s doing well—we heard about it on the hunter grapevine.”</p><p>“Some of my best customers are hunters,” Marco said, genuine pleasure in his voice. “They bring their girlfriends, mates, don’t blink an eye. I’m very glad to have been a part of that fraternity. Please, come. The drinks are on me.” With that, he turned and led them to a table on the edge of the dance floor.</p><p>They all took a seat and drinks were ordered. Sara noticed that Deacon barely touched his—whiskey, of course—and neither did Marco. She took a sip of her cocktail and made a true sound of pleasure. “This is sinfully good.”</p><p>“Yes, the bar’s becoming quite well-known for its cocktails.”</p><p>She smiled and they chitchated for several minutes. “Does this place have a ladies’ room?”</p><p>Marco grinned. “Of course. I can show you.”</p><p>“No, just point me in the right direction.” She leaned in close and whispered, “I need you to stay here and protect Deacon.”</p><p>Marco’s eyes twinkled. “The big ones want to pit themselves against him, and the pretty ones want to take him home and give him a whip.”</p><p>Deacon’s face remained expressionless, but his green eyes held a distinct warning. Laughing, she got into the act and stroked his cheek as she left. His stubble made her fingertips want to go exploring, but she strolled to the bathroom instead, getting several approving looks from the crowd.</p><p>It wasn’t her fault she got distracted by a conversation with another hunter and ended up at a door that didn’t lead to the toilets. Unfortunately, it was locked solid and coded with a touchpad. Hiding her disappointment, she made a point of asking for bathroom directions again and went in to use the facilities before returning to the table.</p><p>“Get lost?” Deacon asked before Marco could.</p><p>“Yeah.” She laughed. “Someone dragged me off to ask if you really were as hard as you looked.”</p><p>Deacon flushed. “Keep going.”</p><p>She knew it was another warning. But the byplay had the effect of disarming any suspicions Marco might’ve had. He laughed and said a few more words before getting up to go mingle.</p><p>Deacon didn’t look particularly happy, but waited to speak until they were on the bike heading back to the hotel. “You didn’t make it to his apartment.”</p><p>“No need.” She grinned. “He crosses his leg like guys do.”</p><p>Silence.</p><p>She took pity on him. “You know, one ankle over the knee, encroaching on other people’s space.”</p><p>“You got a transmitter on his shoe.”</p><p>“When I asked to go to the bathroom.” She felt exceedingly smug about that. “And that’s not even the best part—he was wearing solid hunter boots.” Increasing the odds that he’d use the same footwear if he decided to go out killing.</p><p>“My guess—the killer’s not going to move tonight. Not after Rodney.”</p><p>“Won’t he be frustrated by the fact that he failed?”</p><p>“Possible, but this guy’s not stupid. He does his homework, strikes only when he knows his prey will be vulnerable.”</p><p>“If you had more people, you could put watches on both Tim and Marco, and if necessary, Shah.”</p><p>“Ever tried following a hunter who doesn’t want to be followed?”</p><p>“Point taken.”</p><p>She thought of the three they’d visited. “Did you ask Simon to run background checks?”</p><p>“Might already have come through.”</p><p>He was right. He pulled out and turned on a PDA that looked as tough as he was as soon as they got back to the hotel—all three reports were waiting in his e-mail.</p><p>“Pretty standard stuff,” Sara said, as she lay flat on her back on the bed with the PDA in her hands. “Timothy had a hunt go bad, hasn’t been seen in public since, but we know he’s alive. Shah really is a spy. Doesn’t mean he isn’t a killer.”</p><p>“Gut instinct?”</p><p>“That if Shah was going to kill, he’d do it in a way no one would ever trace back to him.” She looked at the last page. “Marco is a solid hunter with a stable personal life—he’s playing happy families with a vampire, so he clearly likes them.”</p><p>“You ever been tempted?” The bed dipped as Deacon braced a knee on the bottom edge and looked down at her.</p><p>Chapter Five</p><p>Her mouth went dry.“Tempted?”</p><p>“To take up with a vamp?”</p><p>Oh. “Sure, they’re gorgeous.” But not real, not like Deacon. “Don’t tell me you don’t agree.”</p><p>“The whole bloodsucking thing’s kind of a turnoff.”</p><p>“Yeah, that trips me up, too. I don’t want my partner thinking of me as a midnight snack.” She switched off the PDA and laid it carefully on the small chest of drawers beside the bed. “Have you ever had a vamp feed on you?”</p><p>A shake of the head, his eyes lingering on her lips. “You?”</p><p>“Emergency feed,” she said, suddenly hot in the T-shirt and jeans that had been fine moments before. “The guy was so badly off, I had to do something.”</p><p>“Hurt?” Those night-shadow green eyes were drifting over the rise of her breasts, the dip of her stomach.</p><p>She breathed deep, saw him suck in his own breath at the movement of her chest. “Not as much as you’d expect. They have something in their saliva that takes the edge off.” Stretching out her legs, she raised her arms above her head. “And you know they can make it feel good if they want.”</p><p>He didn’t answer, his attention very much on her body as she relaxed from the stretch. Then he moved onto the bed, bracing himself above her using his forearms. “Yes?”</p><p>A simple question—one that made her pause and think. Hunters weren’t prudes, but Sara had never had a one-night stand. It simply wasn’t in her. Yet she’d wanted Deacon from the instant she’d seen him. And from the arousal he was making no effort to hide, she knew full well he wanted her, too.</p><p>But they weren’t just two hunters who’d met on the road. “Are you going to get all weird after?”</p><p>“Define weird.” He settled himself more firmly against her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She bit back a moan. The man was hot, hard, and more than ready. “I need you to follow orders if I become director.” Her former lovers wouldn’t hesitate, because she hadn’t been a candidate for the critically important position then. But now she was very much a candidate. “Are you going to expect special treatment?”</p><p>“I’m not in bed with the future director. I’m in bed with Sara.”</p><p>“That’s good enough for me.”</p> <p>It was tempting to rush, but she stroked her hands into his hair and tugged. The kiss was a punch to the system. Making a sound of sheer pleasure, she wrapped her arms around his neck, her legs around his waist. The man was big, solid all over. A wall of flesh and bone and muscle contained by granite will. She wanted to rub against him until she purred.</p><p>He bit her lower lip. She gasped in a breath and then it was happening again, the wild rush of sensation, the near-unbearable pleasure, the need to taste him deep. When the kiss broke this time, she nuzzled at his throat, kissing her way along the taut tendons of his neck. He smelled so damn good.</p><p>He tugged her back for another kiss, and somewhere in between, she realized his hand was on her bare back, under her T-shirt. She wanted more. Breaking the kiss, she let go of him and tugged at her T-shirt. Deacon rose off her enough that she could pull it over her head and off.</p><p>“Green?” He traced the scalloped lace of her bra with a single, teasing finger.</p><p>She began to unbutton his shirt even as he unhooked her bra. “It’s my favorite color.”</p> <p>“Lucky for me.” The last word was a groan as she flattened her hands on his chest. “Damn lucky.”</p><p>“Off,” she ordered.</p><p>Grunting, he rose to a kneeling position and slid off her bra before getting rid of the shirt. But he didn’t come back down straight away. Instead, he reached out to close one big hand over her breast. She cried out at the unexpectedly bold touch, her eyes clashing with his. Deep green, but no longer calm or unaffected.</p><p>It made the last of her inhibitions fall away, and when he bent his head to her breast, she thrust her hands into his hair and held on for the ride. The Slayer knew what he was doing. There were no hesitant caresses, no requests for more permission. He’d asked once, and she’d acquiesced. Now he took every advantage. Truth to tell, it was beyond erotic being with a man so sure of himself in bed. So sure . . . and so utterly involved. Now she knew the answer to her question—when Deacon lost control, he lost control.</p><p>God, could he get any sexier?</p><p>She wrapped her legs around his waist and kissed him wet and deep and open. “I think you should take off your pants.”</p> <p>Nuzzling his way down her neck to her pulse point, he reached down to hers instead. But rather than opening the jeans, he slid his hand under the waistband to cup her with bold familiarity. She arched into him, wanting more. “No teasing.”</p><p>A nip at the soft flesh of her breast. Shuddering, she thrust her hands into his hair and tugged. “Don’t you talk in bed?”</p><p>His response was to kiss his way down her breastbone, before sitting back up. Withdrawing his hand with obvious reluctance, he undid her jeans and pulled them off, along with her panties. A still, darkly sensual moment as he simply looked at her. Her body arched in silent invitation. Taking it, he bent down until his lips touched her ear . . . and whispered such wicked promises, such decadent requests, she thought she’d melt from the inside out.</p><p>“Okay, stop talking.” It was too much sensory input, too much pleasure. “Right now.”</p><p>He smiled and sat up, his gaze never leaving her face. The intimacy was blinding. Then one big hand spread on her thigh, thumb stroking the insanely sensitive inner surface. She cried out in the back of her throat . . . and twisted out of his hold to sit up on her knees.</p><p>A flicker of surprise, followed by a smile, slow and sure. “Fast and sleek, and pretty.” He bent to run his lips along her neck as she pulled out his belt and threw it to the floor, then started on the buttons on his fly. “Mmm.” A sound of pure male appreciation.</p><p>Pushing his pants down just enough, she closed her hands around him. His big frame shook. “Sara.” And then he was pressing her onto her back, tugging off her hands and sliding into her in one solid push.</p><p>Her entire body arched up off the bed. Wow, she thought, seconds before her sanity fractured, Deacon was built exactly in proportion.</p> <p>Body tingling from the aftereffects of the best orgasm of her life, Sara stared at the hotel ceiling. “I knew we had chemistry, but that was unnatural.”</p><p>The arm across her waist squeezed a little. “I live to please.”</p><p>Sexy, uninhibited as hell when you got past the control, and he had a sense of humor. “I don’t suppose you’re in the market for a long-term relationship?”</p><p>She’d expected shocked silence, but he answered straight away. “I wouldn’t make a very good lover for the director.”</p><p>“Don’t like the spotlight, do you.” It wasn’t a question, because she knew the answer. And part of her wished she didn’t. Because she liked Deacon, more than liked him. Each time he revealed some new facet of his personality, she found it complemented hers on the deepest level. There was promise here. And it wasn’t just about sex. “Don’t you ever get lonely?”</p><p>“Being alone’s never been a problem for me.” His fingers played over the curve of her hip. “You’re going to accept, aren’t you?”</p><p>“Yes.” She’d always known it would come to this. “The Guild is important. It needs to have someone at the reins who cares enough to make sure it remains strong, that hunters are protected from vampires and angels both.”</p><p>“What about the hunting?”</p><p>She stroked her hand along his forearm. “I’ll miss it. But . . . not as much as some. My best friend, Ellie, she’d go stir-crazy within a week.”</p><p>“Elena Deveraux? Hunter-born?”</p><p>“You’ve met her?” She turned to him. Face relaxed with pleasure, hair all mussed, and green eyes lazy, he looked like a big cat sprawled beside her. A big, dangerous cat.</p><p>“Heard about her,” he said. “They call her the best.”</p><p>“She is.” Sara was damn proud of Ellie, considered her more sister than friend. “I worry about her.”</p><p>“You worry about all hunters.”</p><p>And it was true. She did. “I guess I was meant to be director.” Her sense of responsibility was part of who she was. She could no more walk away and leave the Guild in weaker hands than she could force Deacon to change his lifestyle to accommodate hers. “How did you end up the Slayer?”</p><p>“The Guild keeps an eye on possibles. I was approached by the last Slayer and offered the position.”</p><p>He’d accepted, Sara knew, for the same reason she would. “Someone has to do the job.” But it was also a calling of sorts—she knew she’d love being director, that it would challenge and excite her in ways normal hunting couldn’t hope to match.</p><p>“And that someone might as well be the best.”</p><p>She smiled and shifted to face him fully, his hand on her hip, her own under her head. “Have you ever met an archangel?” The tiny hairs on her arms rose at the very idea.</p><p>“No. But you probably will.”</p><p>She gave in to the shivers. “I hope it’s not for a long, long time.” Angels she could deal with, but archangels were a whole different story. They simply didn’t think like human beings in any way, shape, or form.</p><p>Deacon’s lips curved. “I think you’ll handle it when the time comes.” Reaching out, he brushed her hair off her face.</p><p>The tenderness of the gesture did her in. Again, she felt that promise. That tug that this could be so much more. “Right now I just want to handle you.” And she did.</p><p>An hour later, and despite her lack of sleep, she couldn’t turn off, too revved up by pleasure. Deacon could do amazing things with his tongue, she thought, happily buzzed. Maybe the en dorphins lit up the right areas of her brain because she sat bolt upright and leaned over to pick up the PDA.</p><p>“What?” Deacon asked, one arm heavy around her waist.</p><p>She turned it on and checked. “Argh, it’s not here.” Returning the PDA to its previous position, she slumped back onto the bed.</p><p>“What?”</p><p>“A picture of Marco’s boyfriend.” She made a sound of frustration. “Look, we’ve been looking at this like it’s some hate-crime thing, but what if it’s a normal crazy who’s using that to throw us off the scent?”</p><p>Deacon pushed his hair off his face and raised an eyebrow. “Explain ‘normal crazy.’”</p><p>“Maybe the boyfriend dumped Marco. Maybe Marco went batshit. And now maybe he’s out cutting up vampires who look like his beloved.”</p><p>Deacon frowned. “The victims don’t fit a type—they’ve been blond, dark-haired, black, white.”</p><p>She blew out a breath. “It seemed like a good idea.”</p><p>“It might still be a good idea.” His hand went quiet on her skin. “No physical similarities, but they were all known to fraternize with humans more than usual.”</p><p>“That tracks,” she said, feeling herself on the edge of understanding. “I found Rodney through his human friends. He can’t let go.”</p><p>“Two of the victims had human lovers.”</p><p>“Not a biggie,” she said. “Human-vampire pairings are fairly common, especially with the younger vamps.”</p><p>“Yeah, but it’s a distinct pattern when you put it together with the other stuff.” Pushing off the sheet, he got out of bed.</p><p>Lord have mercy.</p><p>She stared unashamedly as he went to his jacket and grabbed a small black device. “This thing tracks the transmitters via GPS. I set it to beep if any of them moved, but just in case . . . No, they’re all where we put them. The transmitters anyway.”</p><p>“I’m worried about Tim,” she murmured, wondering whether Deacon would mind if she used her teeth on that firm, muscled flesh of his. “No one’s seen him for days. If he’s not the killer . . .” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Yeah. But someone’s feeding Lucy—else she’d have been weaker.”</p><p>“Point.” She pulled the sheet over her head. “I can’t think with you naked. Get dressed.”</p><p>The chuckle was rich, unexpected, and so damn gorgeous, she almost jumped him again.</p> <p>“Now. That’s an order from the future Guild Director.”</p><p>“Whose naked toes I want to bite.”</p><p>She curled said toes and continued to grin. “Hurry up.”</p><p>Still chuckling, he seemed to be obeying. “How about a quick shower? We’re sweaty.”</p><p>“That shower is tiny.” But she lowered the sheet.</p> <p>His expression dared her.</p><p>She was such a sucker, she thought, getting up and sauntering off. But she got the last word . . . by driving him certifiably crazy while he was trapped in that steamy glass enclosure.</p><p>Chapter Six</p><p>It was seven a.m. when they set out again—sleepless, but amped up on happy hormones as Sara liked to think of them, and armed to the teeth. It was obvious the vampires shadowing her were building up to something—no reason to give them an easy target.</p><p>The streets were still winter-dark when they rode out, the fog curling over the houses like a whispered caress. Even the junkyard looked dreamy and somehow softer in the muted light.</p><p>“Let’s take the front route today,” she suggested. “I’ll say I’m here to check up on him on orders from Simon.”</p> <p>Deacon nodded and pulled the bike to a stop in front of the padlocked gate. “Lucy should be here any moment.”</p><p>But though they waited, Deacon’s favorite hellhound didn’t appear. A bad feeling bloomed in the pit of Sara’s stomach. “Wait.” Getting off, she picked the lock and waved Deacon through. It was tempting to leave the gate open for an easy exit, but she didn’t want Lucy escaping and terrorizing the neighborhood—and maybe getting terrorized herself if she couldn’t find her way back home.</p><p>Gate locked, she got back on the bike and they roared their way to Tim’s house/shack—or as close as they could get considering the random piles of junk. There was a light on inside. “He’s home.” Taking off her helmet, she hooked it on one handlebar, while Deacon did the same with his on the other.</p><p>“I don’t like this.” The Slayer’s words were calm, his eyes intent as they made their way through a gap in the junk to emerge into a relatively open space near Tim’s home. “Something’s wrong.”</p><p>Her instincts agreed. “Let’s do a circle of the house, make sure things are—” She saw them then. The vampires. Crouched on wrecked cars, lounging between towers of metal, leaning against the side of Tim’s shack.</p><p>She knew there’d be no running this time. “We need to get inside the house.” It was the only defensible position. Her crossbow was already in her hands.</p><p>“They’ll be ready for that.” Deacon’s back met hers as they stood facing in opposite directions.</p><p>“Unless Tim’s barricaded himself inside.”</p> <p>Deacon said nothing, but she knew what he was doing. Listening. If Tim was alive and inside the house, he’d let them know. But it was Lucy they heard, a sudden set of sharp barks and then nothing. The vampire closest to Sara swore loud enough that the sound carried. “Damn devil dog ate half my leg.”</p><p>It was such an ordinary thing to say, but she knew he was in no way ordinary. Not only did he carry centuries of experience in his eyes, he moved like a man who knew how to use every shift to his advantage. But there were no weapons in his hands. The archangels were nothing if not fair. Of course, their concept of fair meant two hunters—possibly three—against what looked like fifteen vamps.</p><p>“Somebody upped the stakes,” she murmured under her breath.</p><p>“I don’t recognize any of them, even the old one. Means they belong to someone other than Raphael.”</p><p>She’d been thinking the same. “Good to know my own archangel isn’t trying to kill me.” She aimed the crossbow at the leader of the group. “Guess it’s time for target practice.”</p><p>The vampire smiled, polished and smooth. “I want but a sip, milady.” A voice that held echoes of gallantry and cruelty. “They say the Guild Director tastes sweet indeed.”</p><p>Since she doubted very much that Simon would’ve allowed anyone to munch on him, she took that with a grain of salt. “You so hard up for blood then?” She moved a little toward the house. Deacon moved with her.</p><p>The vampires kept their distance . . . for now.</p><p>“You wound me, petite guerrière.”</p><p>Little warrior? Sara almost shot him on principle. “You want to be chipped?”</p><p>“Lies, sweet lies.” He waved a finger. “You’re only allowed chip-embedded weapons on a hunt. If you use illegal copies on me, you can’t be Guild Director.”</p><p>Damn. She hadn’t expected the bluff to work, but his response meant he was smart. Smart plus old was not a good combination in a vampiric opponent. “I really will shoot you if you get any closer—and if I put a bolt through your heart, it’ll leave you helpless.”</p><p>The vampire spread his hands. “Alas, I have my orders. My master does not see how a human female could run a guild of warriors.”</p><p>“There are female archangels.” She felt Deacon’s body tense, ready itself for battle.</p><p>“Ah, but you’re not an archangel.” And then he moved.</p><p>So did Sara and Deacon. It was as if they’d been doing this for years. Shooting the crossbow as she ran sideways, she skew ered the lead vamp in the shoulder—she’d been aiming for his head, damn it—and reloaded superfast using Deacon’s patented technology. Hunters loved his weapons for a reason. She’d shot five more bolts by the time they were blocked in again. But now they were within a three-second run of the house.</p><p>Deacon had stayed back to back with her the entire time, accommodating her smaller stride with an ease that told her exactly how good he was at combat. From the sounds she’d heard, he was using some kind of a gun but not anything that shot bullets. The vamps were too close for her to risk a check, but she didn’t think he’d been injured anywhere.</p><p>“Enough playing?” she asked the vampire who seemed to be the mouthpiece of the entire group.</p><p>The handsome man had already removed the bolt and now tossed it at her feet. “That was rather unladylike.”</p><p>“Well, you weren’t exactly gentlemanly in attacking me.” She could feel the edge of sunrise in the distance. Too bad the vamps wouldn’t crumble to dust at the first touch of the sun’s rays. Only in the movies were things so convenient. Some vampires did suffer from light sensitivity, but she bet every single one in this bunch was capable of walking around under noon-light itself.</p><p>“Ah,” the vampire said. “That is so. But you have a knight to protect you.”</p><p>“I don’t need a knight,” she said, knowing full well this was about more than physical strength alone. “I’m not a queen to hide behind my troops. I’m a general.”</p><p>The vampire’s expression grew strangely quiet. “Then I will stop being a gentleman.”</p><p>This time, she couldn’t reload fast enough. Dropping the crossbow, she started to fight with knives, nicking him in the throat, catching a second vampire with a kick to the gut. Behind her, Deacon was taking out vamps left, right, and center. But they were severely outnumbered. This was in no way a fair fight.</p><p>Whoever had orchestrated this wanted Sara to die. Why? She slashed a line across one vampire’s neck, and the blood that hit her was hot and fresh and nauseating. The vampire staggered back, hand clamped over his throat. She kept fighting, kicking and breaking knees. Something burned into her shoulder, and she stabbed a knife through the ear of the vamp who’d decided to turn her into a breakfast buffet.</p><p>Howling, the attacker fell away. Deacon growled then, and she’d never heard a more chilling sound. He took out three more coming at her, holding off two others on his own side as she grabbed the gun she’d tucked into her lower back. “Ready!” she yelled, and started firing to cover his reloading.</p><p>They were closer to the house. But not close enough. If Tim was in there, he was either injured, dead, or didn’t give a shit. Else he’d have been shooting as well. Which meant it was time for drastic measures. Simon had been very clear in his instructions.</p><p>“We walk a precarious line. The angels need us. But if we prove too powerful, they’ll cheerfully wipe us from existence. Hurt the vampires they send after you, but try not to kill. Because if you do, you become a threat, not an asset.”</p><p>Problem was, the vampires were healing from the nonfatal wounds only to continue their relentless—and openly deadly—assault. “Deacon?”</p><p>“Yes.” Agreement.</p><p>Even as her hand moved to retrieve the miniature flame-thrower strapped to her thigh, a knife hit the vampire in front of her, severing his carotid artery. As he choked on his own blood and fell away from the attack, another knife lodged in the eye of the vampire she’d hit with her first bolt.</p><p>Neither knife was Sara’s.</p><p>Then the shooting started.</p><p>Knives from the left. Gunshots from the right.</p><p>And a clear pathway to the house. It had been the best choice at the start, a place from where they could make a stand. But now the odds had changed. “You thinking what I’m thinking?”</p><p>“Fight.”</p><p>Smiling, she palmed a second gun from a shoulder holster and began firing two-handed.</p><p>Five minutes later, they had their backs to the house and the vampires were bloody and broken; caught between their guns and whoever was throwing knives—and other things—from the vicinity of the fence.</p><p>The head vamp raised his hands, palms out. “I yield.”</p><p>There was a collective groan from the other vampires—all still alive—as they collapsed onto the ground. Sara couldn’t believe it. “You think I’m just going to let that go?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The vamp smiled. “Politics is a most unkind mistress.”</p><p>“Should I expect any other visits from you?”</p><p>“No. The test has been passed.” He blinked, his injured eye healing at a phenomenal rate. “And the archangels have little interest in the inner workings of the Guild.”</p> <p>“So the whole trying-to-kill-me thing? What was that?”</p><p>“It had to be done.” Shrugging, he turned to his troops. “It’s time to go.”</p><p>Another five minutes and there wasn’t a single vampire to be seen in the cool dawn light of a winter morning. Sara finally lowered her weapons and glanced at Deacon. He was bloody, his jacket torn in several places, but it was the look in his eyes that rocked her to the core. He was pissed. “Goddamn it, Sara. I don’t like you being hurt.” And then he kissed her.</p><p>It was hot and wild and amazing . . . until Lucy began howling. And someone coughed.</p><p>Sara tore away from the kiss, gun raised—to see a tall woman with long white blonde hair pulled into a ponytail, her eyes frankly curious and her body plastered with knives. “So,” Ellie said, with a huge smile, “you and the Slayer, huh? I like.” She looked Deacon up and down, and whistled. “Best Friend Seal of Approval bestowed. With gold foil edging, even.”</p> <p>Grinning, Sara went to hug her. Elena shook her head. “I love you, Sara, but you’re all bloody with vampire.”</p><p>“Ugh.” Sara looked down at her soaked clothing. “I thought I told you to stay away.”</p><p>“Would you have done that?” Ellie raised an eyebrow. “Exactly.”</p><p>Giving up, Sara threw up her hands. “We need to check on Tim—the hunter inside.” She turned to Deacon. “Think we should send Ellie in? We wouldn’t want to get blood all over Tim’s floor.”</p><p>Deacon’s eyes gleamed. “Good idea.”</p><p>Elena glanced from one to the other. “Do I have ‘sucker’ written on my forehead? I don’t think so. I know all about Timothy’s demon fiend of a sidekick.”</p> <p>Despite his words, Deacon was already at the door. “Tim?”</p><p>“I’m okay,” came the groaning answer as Lucy went into a barking frenzy. “Luce, girl, down.” A few growls but the dog quieted.</p><p>“Cover me,” Deacon said and opened the door.</p><p>Sara was ready to shoot Lucy—to disable, not kill—but “the damn devil-eyed dog” was sitting attentively by the sprawled form of her master, grinning as if she wasn’t just waiting for a chance to bite off their faces. Tim had a gun in hand, a nasty bruise on the side of his face . . . and smelled like a distillery.</p><p>“Jesus, Tim,” Ellie muttered, waving a hand in front of her hunter-sensitive nose. “What, you took a beer bath?”</p><p>Tim winced. “Shh.”</p><p>“You’ve been on a bender?” Sara blew out an angry breath. “We thought you were dead.” Or a serial killer.</p><p>“Hey,” he muttered, “I got conscious long enough to shoot them, didn’t I? And I’m allowed to go on a bender after I find a vampire torn to pieces by a hate group—they even cut off his fingers one by one. How fucking noble.”</p> <p>Sara had had one of those cases, too. She’d baked nonstop for five days after. Her neighbors loved her. “Who’s been feeding Lucy?”</p><p>“Me, of course.” He gave her an indignant look. “As if I’d leave my baby without food.” He kissed that mangy black head. “She knows where her stash is. And I leave fresh water all over the place.”</p><p>“Tim,” Sara pushed, “this is important. Can you prove where you’ve been the past few days?”</p><p>He gave her an oddly clear look. “Hiding in a corner of Sal’s All-Night-All-the-Time bar. Matchbook’s on the table.”</p><p>Deacon called the number and confirmed Tim’s story. Happy at the news, but cognizant of the implications, Sara rubbed her face. “Ellie, can you make sure Tim detoxes and gets that bruise taken care of? Deacon and I have something to handle.”</p><p>“I’m fine,” Tim murmured and tried to stand. Only to fall flat on his butt. “Or maybe not.”</p><p>Elena nodded. “No sweat. You need a hand?”</p><p>It was Deacon who answered. “Stay close. If we need backup, we’ll call.”</p><p>“Gotcha.” Pulling “yummy” faces behind Deacon’s back as he walked out to make another call, Ellie gave Sara the thumbs-up.</p><p>It was impossible not to smile, but that smile was gone by the time she reached the bike and Deacon. “It has to be Marco. And if not, we’re in deep shit.” Because that meant they had an unknown crazy out there.</p><p>“I just checked with Simon. Shah left the city two hours ago, so if there’s another killing . . .” He shook his head. “We can’t wait for that. It’s time to play hardball with Marco.”</p><p>“You think you can break him?”</p><p>Deacon’s face was a grim mask. “Yeah.”</p><p>It should’ve scared her. It didn’t. Because she knew how to play hardball, too. “Let’s do it.” Getting on the bike, she took the helmet he held out. “After this is over, I want a shower in a really big bathroom.”</p><p>“I’ll get us the penthouse.”</p><p>“What makes you think you’ll be sharing it with me?”</p><p>“I live in hope.”</p><p>Oh, she definitely wanted to keep him, she thought, as they closed the gate behind themselves and headed out. Maybe there was a way to make it work? But she knew there wasn’t. She could hardly see Deacon in a tux at some “do.” And the Guild Director had to play politics. Nobody liked a powerful presence like the Guild in the city, but that wariness could be turned into respect and even welcome by a little subtle maneuvering.</p><p>A long time ago, the Guild had chosen the veil of secrecy. The end result had been a spate of Guild-burnings that had razed many a chapter building to the ground, killing a devastating number of hunters in the process. No one wanted a repeat of that.</p><p>Suddenly conscious that Deacon had dramatically reduced his speed, she twisted to peer around one muscular arm. “Oh, no fucking way.” Pulling off her helmet, she stood on the back of the bike, using Deacon’s shoulder for balance. “You yielded,” she told the vampire standing in the middle of the road. “This time, we’ll be aiming to kill.”</p><p>Chapter Seven</p><p>“Milady, you misunderstand me.” A serious expression. “I have need of the Guild’s services.”</p><p>Sara really didn’t feel like helping someone who’d tried to separate her head from her body not that long ago, but hunters existed for a reason. “Someone run out on a Contract?”</p><p>“No. One of your hunters has taken one of us captive. If you would please organize a rescue, we’d be most grateful.”</p><p>She squeezed Deacon’s shoulder. No way was this a coincidence. As she sat back down, Deacon maneuvered the bike to the side of the road. “Talk,” they both ordered at the same time.</p><p>“Silas,” the vampire said, shifting to stand on the sidewalk beside them, “had a relationship with the hunter. Unbeknownst to anyone, they went their separate ways two weeks ago.”</p><p>Around the time the killings started.</p><p>“The hunter’s name is Marco Giardes.” The vampire spread his hands. “I have no idea of what happened between the two of them. But I received a message from Silas a few minutes ago stating that Marco was holding him captive in the basement of his home.”</p><p>Sara wondered if Marco had guessed at her and Deacon’s true motives after all. Something had to have triggered this. “Did he say how long he’d been there?”</p><p>“Silas walked into the hunter’s bar an hour ago with his new inamorato.” He snorted. “He is young, thinks being a vampire makes him invincible.” A meaningful rub at the shoulder she’d wounded.</p><p>“Damn vampire wanted to rub Marco’s face in his new affair.” Sara almost felt sorry for Marco. Almost. Because if everything this vampire was saying was right, then Marco had gone out and killed five other men, none of whom had done anything to him. Not to mention how he’d terrified Rodney. “Do you have any other information?”</p><p>“Silas’s new lover is no more.” A shrug. “Silas got the message out before Marco realized he had a second cell phone. I’ve received no messages since, so the hunter has likely remedied that.”</p><p>Deacon stared at the vamp. “If you know where he is, why aren’t you mounting a rescue? You have a big enough group.”</p><p>A long pause. The vampire looked up, then down, lowered his voice. “Raphael was not pleased when he found out about the attack on Sara. We are not his people. He has forbidden us from doing anything in his territory except that which relates to our departure—even feeding.” A long, shuddering sigh. “We’re to leave on the first plane out of the country.”</p><p>“Silas is a tourist?” Sara asked, rapidly thinking through her options.</p><p>“Marco met him during a hunt. Silas came to be with him.” Another glance upward. “We would appeal to our archangel for help, but he doesn’t particularly care for Silas.”</p><p>Sara didn’t trust the vampire an inch, but she had a feeling he was telling the truth about Marco and Silas. There was a layer of concern in his voice that betrayed an obvious affection for the younger vampire. That wasn’t as weird as it sounded. Vampires had once been human, after all—it took a long time for the echoes to fade entirely.</p><p>“Fine.” She put her helmet back on. “I guess it’s time for the Guild to ride to the rescue.”</p><p>Deacon started the engine in silence and they headed off, leaving the vampire standing at the curb. “I think he was straight with us,” she said. “You?”</p><p>“It fits with what we know.” His voice was an intimate darkness in her ear. “Looks as if Raphael likes you.”</p><p>“I’ve never met him. Or even talked to him on the phone.” She drew in a deep breath. “I don’t think it has anything to do with me.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“No?”</p><p>“No.” She knew exactly where humans ranked in the scheme of things as far as archangels were concerned. Somewhere below ants. “It’s the fact that some other archangel tried to horn in on his territory. He’s pissed.” And when an archangel got pissed, things got brutal. “Did you hear what he did to that vampire in Times Square?”</p><p>A slow nod from Deacon. “Broke every bone in his body and left him there. As a warning. He was alive throughout, the poor bastard.”</p> <p>“So you see why I don’t ever want Raphael to take an interest in my welfare.”</p><p>Deacon didn’t say anything, but they both knew that as Guild Director, she’d have a much higher chance of attracting Raphael’s attention than an ordinary hunter. But still, how many times did an archangel contact any human directly? Sara had never heard of it. They ran everything from their towers.</p><p>Manhattan’s Archangel Tower dwarfed everything in the entire state. Sara had often sat in Ellie’s way-too-expensive apartment and watched the angels flying in and out. Their feet, she thought, likely never touched the earth. “You know, I think Ellie’s got a higher chance of meeting an archangel than I do.”</p><p>“Why?”</p><p>“Just a feeling.” A prickling across the back of her neck, a kiss of the “eye” her great-grandmother claimed to possess. “Think we should call her for backup?”</p> <p>“If Marco’s in there alone, we can take him. Let’s check things out first—I don’t want to panic him.” A pause. “Though it sounds like Silas is no prize.”</p><p>“Yeah. But Marco hurt Rodney, who’s about as dangerous as your average rabbit.” She hoped his master hadn’t been too hard on him. And that Mindy the Bitch had gotten her head torn off.</p><p>“We’re here.” He pulled over and parked. “The bar should be closed.”</p><p>Stowing the helmets, they headed to the bar . . . only to come to an abrupt halt when a little old lady on her way down from farther along the street stared at them and backed away very fast. Sara looked at Deacon, really looked. Big, sexy, loaded up with weapons . . . and stained rust red. “Oops.”</p><p>He smiled, slow and with a glint that said he was thinking about getting naked. With her. “We better wrap this up before the police arrive and all hell breaks loose.”</p><p>Nodding, she shoved aside the thought of soaping up his delicious body and picked up the pace. “How’re we getting into the basement?”</p> <p>Deacon raised an eyebrow. “We ask.”</p><p>“Wha—Oh, that’ll work. Two hunters, needing sanctuary and somewhere to clean up. I’m good with that.”</p><p>The door to the bar was locked shut, all the neon turned off. Deacon went to knock, but Sara grabbed his hand and pointed to the intercom hidden discreetly to the side. Pushing the button, she waited.</p><p>“Yes?” Marco’s voice. Sounding tired, but not the least bit aggressive.</p><p>“Marco, it’s Sara and Deacon. We need a place to clean up.”</p><p>“I can see that.” The door clicked open. “Come on through.”</p><p>They went in. Sara waited until the door had closed behind them to whisper, “Is it just me or does he sound way too normal?”</p><p>Deacon was frowning as well. “Either he’s one hell of a good actor or something else is up.”</p> <p>Marco stuck his head out the door that led up to his apartment. He whistled when he saw them. “Must’ve been some fight. The bathroom’s big enough for two.” A sharp grin that tried to hide exhaustion and failed.</p><p>Again, nothing weird about that if he hadn’t yet had a chance to go to bed.</p><p>Then she saw the mess that was the bar itself. Bottles shattered, blood on the floor, what looked like bullet holes in the walls. A second later, Marco stepped out from behind the door, and it became apparent he was sporting the beginnings of a serious black eye. “Do I dare ask?” She raised an eyebrow.</p><p>Marco thrust a hand through his hair. “Come on up and we’ll talk.”</p><p>“Now would be better,” Deacon said, unmoving.</p><p>The bar owner looked from one to the other and said, “Shit.” Sounding like his heart had just broken into a million pieces, he sat down on the last step, head in his hands. “He set me up. The bastard set me up.”</p><p>Sara was starting to get a headache. She’d come in here expecting to rescue a hurt vampire from an unhinged hunter, and found a shattered lover. “How about we take this from the top?” she suggested, staying out of attack range in case Marco actually was that good an actor. “Where’s Silas?”</p><p>“Locked in the basement.” Marco’s eyes were bleak when he glanced at them. “I needed time to get my shit together before I called the Guild.”</p><p>“And the man who was with him?”</p><p>Marco nodded at the bar. “Silas came up behind him and . . .” He stared at his hands. “I couldn’t believe it. But the blood, God, so much blood.”</p><p>Leaving Deacon to keep an eye on him, she pulled herself up onto the gleaming wooden surface and looked down. A vampire’s bright blue eyes stared up at her. She sucked in a breath. If she hadn’t been able to see that his head was no longer attached to his body, she’d have thought him alive. “Dead,” she confirmed to Deacon. “The question is, how did he get that way?”</p><p>“Silas,” Marco repeated dully. “He came in here, strutting like a damn peacock. I should’ve left him outside but I—” He swallowed, hand fisted, pain apparent in every taut tendon. “I thought maybe he’d come to apologize. I didn’t see the kid till after.”</p><p>“Apologize?” Sara had the sinking feeling they’d all been drawn into one seriously bad lover’s tiff.</p><p>“For cheating on me.” Marco finally looked her full in the face. “Here I was, being a putz. I gave my notice at the Guild, set up this place, all because he said he hated knowing I was putting my life on the line with every hunt. I even asked Simon to talk to some of the senior angels, see if we could maybe get the rest of Silas’s Contract transferred to an angel in the States so we wouldn’t have to keep going back and forth.”</p><p>“Here.” Sara grabbed a dented but still whole bottle of water and threw it at him. “Breathe.”</p><p>“I can’t.” He chugged the entire bottle, then threw it aside. “He was just using me. Wanted out of his Contract—his angel doesn’t like him. I could’ve swallowed that. Hell on the ego, but I’d have swallowed it. I loved him. But the whole time we were together, he was with . . . who the fuck knows. More than one guy.”</p><p>“Marco, that doesn’t make sense.” Sara folded her arms. “Why would he set you up if he was the one cheating?”</p><p>“’Cause I dumped him.” And in that moment, Sara saw the hunter Marco was. Hard, lethal, certainly very good at his job. “I told him to get out and stay out.”</p><p>“Which meant he lost any chance of getting his Contract transferred.” Deacon didn’t move from his position by the door. “It sounds good. But all the evidence points to a hunter.”</p><p>“He took my stuff. My weapons, clothes, one of the ceremonial swords I collect.” Marco ground his teeth together. “I feel so fucking stupid. I knew he didn’t handle rejection well, but I never thought he’d go around killing people just to get back at me.”</p><p>Sara glanced at Deacon. He shook his head in a slight negative. She agreed. Marco was very, very believable. But it was his word against this Silas’s. If they backed him, the vampires would take it badly—unless they had proof. In which case, Silas would disappear to face angelic justice. Hunters could kill, but only in exigent circumstances, or when they had an execution warrant. It made more sense for angels to deliver any necessary punishment—they were faster, stronger, and far more cruel than the vampires they Made.</p><p>“Security cameras,” she asked Marco. “Did you record the fight?”</p><p>“No.” Self-disgust marred the handsome lines of his face. “I turned them off when I realized it was him—didn’t want anyone seeing how much of a fool I’d been. At least I wasn’t stupid enough to leave my gun behind. Shot grazed his head, knocked him out.”</p><p>That explained how Marco had gotten the vamp into the basement. “We need to talk to Silas.” Sara stepped forward, expecting an argument.</p><p>Marco got up. “I’ll take you—let’s see what the bastard has to say.”</p><p>Letting him go on ahead, they followed with weapons drawn. Silas was pounding on the door by the time they got there.</p><p>“Help me!” More pounding. “Help! I can hear you!”</p><p>“Quiet.” Deacon’s voice cut through the pounding like a knife.</p><p>Sara took the lead. “How’d you end up locked in the basement?”</p><p>They got pretty much the same story as from Marco . . . but with the roles reversed. By the time it was over, Sara’s headache had turned into a thumping monster. How in hell were they going to fix this? The wrong move and a lot more blood would spill.</p><p>She looked to Deacon. “Got handcuffs?”</p><p>He handed her a thin plastic pair. “They’ll hold.” Marco lifted up his hands without question when she turned. Clicking the cuffs shut, she led him back upstairs, stashing him on the stairway that led up to his apartment . . . after blindfolding him and tying his feet together, then redoing the cuffs to lock him to the railing. Hunters were extremely resourceful when it came to survival.</p><p>“I won’t run,” Marco told her, a broken kind of pain in his voice that hurt her.</p><p>“For what it’s worth,” she said, “I believe you.” If she was going to be Guild Director, she had to learn to judge her people. “But we need proof.”</p><p>“He’s smart. Part of his charm.”</p><p>Silas hadn’t sounded particularly charming to Sara, but then, she wasn’t in love with him. Patting Marco on the shoulder, she walked out, pulling the door shut behind her. “Rodney,” she said to Deacon. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“That’s what I thought.”</p><p>“But even if he can tell their voices apart, how seriously is anyone going to take him?” She pulled out her cell phone. Hesitated.</p><p>“It’s a start.”</p> <p>As she waited for the phone to be answered, she found her eyes locked with Deacon’s. “I’m going to have to deal with messes like this all the time as director.”</p><p>A nod. “And you’ll care enough to find out the truth.” Bridging the distance between them, he touched her cheek. “We’re lucky to have you.”</p><p>The phone was picked up on the other end. “Yes?”</p><p>Sara dropped her head against Deacon’s chest at the sound of that voice. “Mindy, I need to speak to your master.”</p><p>“I got punished because you tattled.”</p> <p>Chapter Eight</p><p>Sara didn’t have time to engage in a pissing contest. “You should’ve been more careful.”</p><p>“Damn straight,” Mindy said. “I’m four hundred years old and I can’t get rid of the twerp. Not your fault. Hold on.”</p><p>Surprised, and glad something was going right, she took a deep breath as Lacarre’s cultured voice came on the line. “Hunter.” A demand for why she was calling, and permission to speak, all in one word.</p><p>She explained. “If we could borrow Rodney for a few minutes, it might help clear things up.”</p><p>“Since the victims included two of my own, I’d be very interested in learning the identity of the perpetrator. We’ll be there shortly.”</p> <p>Closing the phone, she hugged Deacon. “Think anyone would notice if I chucked it all in and ran screaming for the hills?”</p><p>Warm, strong hands rubbing over her back. “They might send the Slayer after you.”</p><p>“No flirting. Not now.”</p><p>“Later, then.” He didn’t stop the back rub. “I think this officially equals the oddest case of my career.”</p><p>“You and me both. I don’t know why I’m always surprised when vampires act as weird as ordinary humans. It’s not like they gain the wisdom of the ages with the transformation.” His heart beat strong and steady under her cheek. Solid. Calming. A woman could get used to that kind of an anchor.</p><p>They stood in silence for a long time, until Sara’s heart beat in rhythm with his. “Did you ever consider another career?” she asked in a low, private whisper, realizing she knew nothing of his past. It didn’t matter. It was the man he was today who fascinated her. “Aside from the Guild?”</p><p>“No.” A single word that held a wealth of history.</p><p>She didn’t push. “Me, either. I met my first hunter while I was living on a commune—don’t even ask—when I was ten. She was so smart and tough and practical. It was love at first sight.”</p> <p>His chuckle sounded a little raw. “I saw mine after a bloodlust-crazed vampire destroyed our entire neighborhood. The hunter found me standing over the vampire, chopping his head off with a meat cleaver.”</p><p>She squeezed him tight. “How old were you?”</p><p>“Eight.”</p><p>“It’s a wonder you’re not a psycho vampire-killer yourself.”</p><p>Somehow, it was the right thing to say. He laughed softly and all but folded himself around her, kissing her temple with a tenderness that shattered her remaining defenses like so much glass. “I decided I’d rather be one of the good guys. I don’t like tracking and executing my fellow hunters—every kill hurts like a bitch.”</p><p>And that, Sara suddenly knew, was why the last Slayer had chosen Deacon as his successor. The Slayer had to love the Guild with all his heart and soul. Every decision had to be made with the wrenching power of that love—Deacon would never execute a hunter without absolute, undeniable evidence. Otherwise, Marco would’ve been dead days ago.</p><p>Lifting up her head, she kissed his throat. “How do you feel about carrying on a secret affair with the Guild Director?” She couldn’t let him go. Not without a fight.</p><p>“I prefer the world know full well I consider a woman mine.” An uncompromising answer. “Secrets just come back to bite you in the ass.”</p><p>There went that possibility. Before she could come up with another, the front door vibrated under the force of an imperious knock. Lacarre had arrived. “Showtime.” Pulling away from Deacon, she walked over and let in both Lacarre and his entourage—Mindy, Rodney, and unexpectedly, the vampire who’d originally asked for their help. “Please come in.” She raised an eyebrow at the one who didn’t belong.</p><p>“We found him loitering,” Mindy said, waving a hand with insouciance that told them she couldn’t care less. “Lacarre decided he might be of help.”</p><p>The foreign vampire didn’t look especially pleased to have been dragged inside, but nobody said no to an angel.</p><p>“Where are the two men?” Lacarre asked, keeping his wings several inches off the floor so they wouldn’t drag on the sticky mess of glass, blood, and alcohol that coated the varnished surface.</p><p>“One’s behind there.” She nodded at the closed door that led up to Marco’s apartment. “And the other’s in the basement.”</p><p>Mindy stroked a hand down Deacon’s arm. “Do they look like this one?” It was a sultry invitation.</p><p>Deacon said nothing, just watched her with eyes gone so cold, even Sara felt the chill. Deacon did scary really, really well. Mindy dropped her hand as if it had been singed and returned to Lacarre’s side quick-fast. Rodney was already cowering behind the angel’s wings.</p><p>“You’d make a good vampire,” the angel said to Deacon. “I might actually trust the city wouldn’t fall apart if I left you in charge.”</p><p>“I prefer hunting.”</p><p>The angel nodded. “Pity. Rodney, you know what you have to do?”</p><p>Rodney bobbed his head so fast, it was as if it were on springs. “Yes, Master.” He looked childishly eager to please.</p><p>“Come on.” Keeping her voice gentle, Sara held out her hand. “I didn’t hurt you last time, did I?”</p><p>Rodney took a moment to think about that before coming over to close his fingers around her own. “They won’t be able to get me, will they?”</p><p>“No.” She patted his arm with her free hand. “All I want you to do is listen to their voices and tell me which one sounds like the man who hurt you.”</p><p>They went to Marco first, Lacarre and Mindy following. It made the hairs on the back of her neck rise to have a powerful angel and his bloodthirsty vampire floozy behind her—she was able to bear it only because Deacon was bringing up the rear, with Silas’s friend in front of him. “Marco.” She banged on the door. “I want you to threaten to cut off Rodney’s head.”</p><p>Rodney shot her a wide-eyed look. She whispered, “It’s just pretend.”</p><p>Marco began yelling a second later. Eyes wide, Rodney skittered away from the door and Sara felt her stomach fall. “Is it him?” she asked, after Marco went quiet.</p><p>Rodney was shivering. “No, but he’s scary.”</p><p>Lacarre wasn’t fond of the basement idea, but he came down with them. And when Silas refused to do as ordered, the angel whispered, “Or would you rather I come in for a private . . . talk?” Silky sweet, dark as chocolate, and sharp as a stiletto sliding between your ribs.</p><p>If Sara had ever had any delusions about trying to become a vampire, they would’ve died a quick death then and there. She never wanted to be under the control of anyone who could put that much cruelty, that much pain, into a single sentence.</p><p>Chastened, Silas made a wooden threat. About as scary as a teddy bear. Sara was about to order him to do it with more feeling when Rodney turned around and tried to run back up the stairs. Deacon caught him. “Shh.”</p><p>To Sara’s surprise, the vampire clung to him as a child would to its father. “It was him. He’s the bad man.”</p><p>Lacarre stared at the back of Rodney’s head, then at Sara. “Bring this Silas upstairs. I will hear from the hunter as to what happened.”</p><p>Sara had her crossbow at the ready, but it proved unnecessary. Tall, dark, and striking Silas, his clothes torn and bloody, followed them meek as a lamb. Leaving him in front of Lacarre and Mindy—with the foreign vamp skulking in the background—she released Marco and walked with him to the others.</p><p>Silas glared at his ex-lover. “You kill and put the blame on me.”</p><p>Marco ignored him, staring straight ahead as he recited what Sara believed to be the truth. Around the time that he got to his rejection of Silas, the out-of-town vampire gasped and said, “I believed you!”</p><p>“Be quiet!” Silas screamed.</p><p>Lacarre raised an eyebrow. “No. Continue.”</p><p>“He has done this before,” the foreign vampire said. “Three decades ago, when a human he’d been romancing left him for another vampire, he killed four of our own kind.”</p><p>Sara met his eye. “Were they men with strong ties to humanity?”</p><p>“Yes.” A trembling answer. “He told me the bloodlust had gotten hold of him. He was young . . . I protected him.” The clearly shaken vampire took a deep breath and turned his back on his former friend. “I no longer do.”</p><p>Silas screamed and jumped up as if to attack, but Deacon brought him down with a single chop to the throat. The vamp went down like a tree. Marco flinched but didn’t turn even then.</p><p>“As I said,” Lacarre murmured,“it’s a great pity you don’t wish to be Made. If you ever change your mind, let me know.”</p><p>Deacon’s smile was faint. “No offense, but I like being my own master.”</p><p>“I’d tempt you with beauties like Mindy, but it seems you’ve made your choice.” He walked over to Silas’s unconscious body. “The Guild has the right to demand restitution and proffer punishment. What is your will?” A question aimed solely at Sara. As if she were already director.</p><p>Sara glanced at Marco, saw the struggle on his face and knew there could be only one answer. “Mercy,” she said. “Execute him with mercy.” For they all knew that Silas wouldn’t be allowed to live. “No torture, no pain.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Lacarre shook his head. “So human.”</p><p>She knew it wasn’t a compliment. “It’s a flaw I can live with.” She never wanted to become anything close to what Lacarre was—so cold, even when he looked at her with such apparent interest.</p><p>“So be it.” Walking over to Silas, he bent and gathered the vampire in his arms with effortless strength. “It will be done as you asked.”</p> <p>As he walked away, Mindy and the others trailing behind the wide sweep of his cream-colored wings, Sara saw Deacon put a hand on Marco’s shoulder. A single squeeze. Words whispered so low that she couldn’t hear what was said. But when Deacon moved back to her side, Marco no longer looked like he was dying a slow, painful death. Oh, he was hurting plenty, but there was also a glimmer of stubborn will, the kind that made humans into hunters.</p><p>He turned to Sara. “I’m withdrawing my resignation from the Guild. I thought . . . I hoped, but I can’t stay here anymore.”</p><p>“I’ll make sure Simon knows.”</p><p>“Not necessary, is it, Sara?” he said quietly. “So long as you do.”</p><p>Sara said good-bye to Deacon outside the hotel six hours later. He had his gear and she had hers. Ellie was waiting for her in a clean rental car, ready to start the drive to New York. One last road trip before she became bogged down in the myriad responsibilities that came along with running one of the most powerful and influential chapters of the Guild.</p> <p>“The next year’s going to be brutal,” she said to Deacon as he sat sideways on his bike, his legs stretched out in front of him, and his arms folded. “Just as well you said no—I probably couldn’t carry on a secret affair even if I tried.” She should’ve laughed then, but she couldn’t find any laughter inside her.</p><p>He didn’t do anything sappy. He was Deacon. He stood, put his hand behind her neck, and kissed the breath out of her. Then he kissed her again. “I have some things to do. And you have a directorship waiting for you.”</p><p>She nodded, the whiskey and midnight taste of him in her mouth. “Yeah.”</p><p>“You better go. Ellie’s waiting.”</p><p>Squeezing him tight once more, she turned and walked away. He was right to do it this way. Whatever they had, the sweet, shining promise she could still see hovering on the horizon, it deserved to be left whole, instead of being crushed under the weight of unmet expectations.</p><p>“Drive,” she said to Ellie the instant the door closed behind her.</p> <p>Ellie took one look at her and didn’t say a word. In fact, neither of them spoke until they’d crossed the state line. Then Ellie glanced over and said, “I liked him.”</p><p>The unadorned remark splintered every one of Sara’s defenses.</p><p>Dropping her head into her hands, she cried. Ellie pulled over to the side of the wide-open road and held her while she sobbed. Her best friend didn’t insult either of them by spouting bullshit platitudes. Instead, she said, “You know, Deacon didn’t strike me as the kind of man who lets go of things that matter.”</p><p>Sara smiled, knowing her face was a blotchy mess. “Can you see him in a tux?” Her stomach tightened at the idea.</p><p>“Let me get the visual. Okay, I have it.” Elena sighed. “Oh, baby, I could lick him up in a tux.”</p><p>“Hey. Mine.” It was a growl.</p><p>Ellie grinned. “I have a pulse. He’s hot.”</p><p>“You’re an idiot.” One who’d made her smile, if only for an instant. “I can just picture him shaking hands and playing Guild politics. Not.”</p> <p>“So?” Ellie shrugged. “The Guild Director has to do all that stuff. Who says her lover has to be anything but a big, scary, silent son of a bitch?”</p><p>It was tempting to agree, to hold on to hope, but Sara shook her head. “I have to be realistic. The man’s a complete loner. It’s why he’s the Slayer.” Dragging in a shaky breath, she sat back up and said, “Take us to New York. I have a job to do.”</p><p>Strong words, but her fingers found their way into a pocket, skating over the tiny serrated sawblade hidden within. It was Deacon’s. The man had some really interesting weapons—like a gun that fired these spinning circular babies instead of bullets. It was what he’d been using out in Tim’s junkyard. That made her wonder how Lucy was doing.</p><p>A tiny smile tugged at her lips—who knew her favorite memory of Deacon would be of him cuddling a vicious hellhound of a dog?</p><p>Chapter Nine</p><p>Two months later, Sara stared at her reflection—the woman who looked back at her appeared both poised and quintessen tially elegant in a strapless black sheath. Her hair had been styled in a sophisticated bun at the back of her head, her new bangs swept to the side with an elegance she’d never have been able to achieve in the field, and her face made up with skill that highlighted her cheekbones, brought out her eyes. “I feel like a fraud.”</p><p>Simon chuckled and walked to stand behind her. “But you look precisely what you are—a powerful, beautiful woman.” His eyes dropped to her necklace. “Good choice.”</p><p>It was that shiny serrated blade. Deacon’s blade. She’d had it strung on a silver chain. “Thanks.”</p><p>“Some of the people you meet tonight will try to sneer at you. There are a few who see hunters as nothing more than jumped-up hired help.”</p><p>“Oh, like Mrs. Abernathy?” she said, tone dry as she named the society matron whose party she was about to attend. “She asked me if I’d like some help with ‘appropriate clothing, dear.’”</p><p>“Exactly.” Simon squeezed her shoulders. “Here’s some advice—anytime one of those ‘blue bloods’ tries to bring you down, remember that you deal with angels every day. Most of them would pee their pants at the thought.”</p><p>She choked. “Simon!”</p><p>“It’s true.” He shrugged. “And someday, you might even deal with a member of the Cadre. No matter how important they think they are, most humans will never come within touching distance of an archangel.”</p><p>“I’d probably pee my pants then, too,” she muttered.</p><p>“No, you won’t.” Unexpectedly serious words. “As for the upper-crust vampires, remember, we hunt them. Not the other way around.”</p><p>Sara nodded and blew out a breath. “I wish we didn’t have to do this crap.”</p><p>“Angels might scare us, but hunters scare most other people—including a lot of vampires. Reassure them. Convince them we’re civilized.”</p><p>“What a con.” She grinned.</p><p>Simon grinned back, but it wasn’t his face she wanted to see beside hers in the mirror. “Okay, I’m ready.” This was her first solo outing as Guild-Director-in-training. The transition would be complete by year’s end.</p><p>“Go get ’em.”</p><p>The party didn’t bore her silly. It was the last sign—had she needed one—that she was the right person for the job. Ellie would’ve shot at least five people by now. Sara smiled and parried another nosy question while soaking up the relentless flow of gossip. It was all intelligence. Hunters needed to know a lot of things—like who a vampire might run to, or which individuals might sympathize with the angels to the extent of going vigilante.</p><p>Of course, to all outward appearances, she was simply mingling—just another well-dressed female among dozens of others. Mrs. Abernathy had beamed at her when she arrived. “Probably surprised I didn’t turn up in blood-soaked leathers,” she muttered into her champagne flute during a moment’s respite on the balcony.</p><p>“Would’ve worked for me.”</p><p>The smile that cracked her face was surely idiotic, but she didn’t turn. “Is it the leathers you like or the body in them?”</p><p>“You got me.” Warm breath against her nape, hands on her hips. “But I could get used to this dress.”</p><p>“Hey, eyes up.” She put the champagne flute on the waist-high wall that surrounded the balcony. “No scoping the cleavage.”</p><p>“Can’t help it.” He turned her with a stroking caress.</p><p>And the air rushed out of her.</p><p>“Oh, man.” She leaned back and twirled a finger.</p><p>Of course Deacon didn’t give her a fashion show. He flicked at her sideswept bangs instead. “I like it.”</p><p>“Ransom said it makes me look like I have raccoon eyes.”</p><p>“Ransom has hair like a girl.”</p><p>She grinned. “That’s what I said.” Throwing her arms around his neck, she kissed him with wild abandon, and it felt way beyond good. So she did it again. “The debutantes are going to wet their panties over you.”</p><p>He looked horrified.</p><p>“Don’t worry.” She pressed a kiss to his jaw. “I’ll scare them away.”</p><p>Deacon caused such a stir she thought they might have a Chanel No. 5-scented stampede in the ballroom. She also thought it’d make him turn and run. That he’d come . . . well, hell, it had stolen her heart right out of her chest. But she didn’t expect him to stand at her side with quiet focus, as if the attention didn’t even register.</p><p>A few of the men tried to use his presence to ignore her—male chauvinist pigs—but Deacon deflected the ball back at her so smoothly, the others never knew what hit them. Sexy, dangerous, smart, and he knew how to deal with dunderheads without making a scene. She was so keeping him. And stabbing a knife into the heart of any debutante/trophy-wife-wannabe who came within sniffing distance.</p><p>“I expect,” he whispered in her ear during a rare minute of privacy, “large amounts of sexual favors for being this good.”</p><p>Her lips twitched. “Done.”</p><p>And she was. Done over thoroughly.</p><p>By the time they reached the apartment, she was burning up for him. They didn’t make it to the bed the first time. Her pretty, slinky dress ended up in shreds at her feet as Deacon took her against the door, his mouth fused with hers. She came with a hard rush that had her clutching at his white dress shirt with desperate hands. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The second time was slower, sweeter.</p><p>Afterward, they lay side by side, face to face. It was an indescribably intimate way to be, and she hardly dared speak for fear of breaking the moment. “There goes your secret identity. As of tomorrow, you’re going to be in gossip columns from here to Timbuktu.”</p><p>He nipped at her upper lip. “I bought the tux.”</p> <p>She blinked. “You bought the tux.” Bubbles of happiness burst into life inside her, rich and golden. “More cost-effective than renting one if you plan to use it a lot.”</p><p>“That’s what the guy at the store said.” Shifting closer, he stroked his hand over the sweep of her back, his skin a little rough and all perfect. “But . . .”</p><p>“No buts.” She kissed him. “I’m too happy right now.”</p><p>A smile against her lips. “This ‘but’ you have to deal with, Ms. Guild Director.” Light words. Serious tone.</p><p>She met his gaze. “What is it?”</p> <p>“I have to resign as the Slayer.”</p><p>“Oh. Yes, of course.” As of tonight, he was too well-known, and more importantly, by staying with her, he’d get to know too many hunters . . . make too many friends. “We’ll find a replacem—”</p><p>“That’s what I was doing. I have a candidate for you.”</p><p>Nodding, Sara stroked her fingers over the square line of his jaw. “I can’t be your boss.” It was a solemn realization. “I need to be your lover.”</p><p>Deacon reached out to draw a circle around the spot where her necklace had rested before he’d taken it off. “I figured I’d go totally independent with the weapons.”</p><p>“That works.” The tightness in her chest eased. “Kind of seems one-sided though. You’re giving up everything.”</p> <p>“I get you.” A simple statement that meant more than she could ever articulate.</p><p>She swallowed the knot of emotion in her throat. “I talked to Tim a week ago.”</p><p>Deacon frowned. “Tim?”</p><p>“Lucy’s pregnant.”</p><p>The frown turned into a slow, spreading smile. “Really?”</p><p>“Yes, really.” She threw a leg over his and snuggled close. “He’s going to keep one of the pups for me. I was going to call it Deacon.”</p><p>He started laughing, and it was infectious. She buried her face in his neck and gave in.</p><p>The puppy was black as pitch, with big brown eyes and feet so big he promised to become a monster like his mom. Since it would’ve been a little confusing to have two Deacons in the house, they decided to call him Slayer.</p>  </body></html>"]