["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>There were times in a man’s life that remained indelibly imprinted on his brain for one reason or another. Events that threw open the window to a dark, shadowed corner of his soul and revealed truths he’d search for within himself all his life.</p><p>That day had come for John Calvin Walker Jr.</p><p>He’d awakened that morning with the knowledge that life no longer held challenge. He had a job that he was too successful at in his father’s law firm. His fiancée was the perfect socialite, an exquisite hostess, and also considered one of Boston’s most beautiful and successful female lawyers. She was about as emotional, compassionate, and passionate as a lump of clay, though.</p> <p>According to his fiancée, he needed to find a hobby to replace his overly sexed inclinations. This coming from the woman who had spent the better part of the first month they were together exhausting him in his bed.</p><p>The passion had waned, slowly at first, until now, six months later, she thought he needed a hobby instead.</p><p>His life had gone to hell. Or perhaps, he was only now realizing that his life could be so much more. What, he hadn’t decided yet. How to deal with the complications, he hadn’t decided yet. One thing was certain, the restlessness inside him was growing to the point that it was becoming an ache.</p><p>As he sat across from her at her favorite Italian restaurant and pretended to listen to her quiet rant where one of his charity projects was concerned, he realized something was changing within him.</p><p>Accepting it was another matter. Dealing with it would be harder. As she talked, he flicked his waiter a look. He was a good man, John thought, he’d waited on John enough to know what that look meant. Within minutes there was a glass of whisky sitting unobtrusively at his elbow despite Marlena’s disapproving look.</p> <p>She didn’t like the whisky he drank. She didn’t like the friends he associated with, and he was beginning to wonder if she liked anything about him other than the Walker name and the fortune his father had built over three decades. That fortune, added to the centuries old Evanworth inheritance from his mother, Brianna’s, side of the family, made John an impressive catch, and he knew it.</p><p>It had nothing to do with him, personally, and John was beginning to suspect that where Marlena was concerned, it was the fortune rather than the man that appealed to her.</p><p>“I believe we should be going now,” Marlena announced as he finished a second whisky.</p><p>She glanced around the restaurant, directing her attention to a table of giggling young women celebrating a recent engagement of one of their friends.</p><p>Marlena looked at them as though something didn’t quite smell right. “We’re going to have to find another restaurant, darling. This one is beginning to accept a less than desirable crowd.”</p><p>John looked around. “It looks like the normal one to me.” He shrugged.</p> <p>The young women at the nearby table were regulars, just not together in a group often.</p><p>He swore he saw the same faces every night they ate there.</p><p>“As though you pay any attention.” Her delicate nose lifted disdainfully. The narrow lines of it were sharp, too sharp, almost giving her the appearance of a rodent.</p><p>John narrowed his eyes. He’d been out of town for a few weeks; had she had a nose job in that time? He couldn’t remember it being that narrow before.</p><p>Nodding to the waiter, he indicated that they were finished, knowing his card on file would be charged an exorbitant amount within minutes.</p><p>As they moved through the luxurious lobby, his hand settled at his fiancée’s back. A second later his jaw clenched and his hand fell away as he felt her stiffen.</p><p>As passionate as ice. Hell. And maybe that second whisky hadn’t been a good idea, because his temper was beginning to brew.</p><p>“Oh dear, don’t look, darling, but that hussy Sierra is here.” There was an edge of anger in her tone. “And isn’t that your friend Gerard?”</p> <p>John felt his jaw tighten at the sight of Sierra Lucas, slender, almost fey in appearance, with her long, thick curls cascading down her back.</p><p>The white silk dress she wore showed her curvy figure to advantage. Her full, pert breasts were obviously unbound and as tempting as hell. As he watched, tiny nipples hardened noticeably at the same rate his cock thickened. Damn, he’d known her all her life. This reaction to her was becoming irritating.</p><p>He really should have foregone that second whisky.</p><p>“John.” Gerard’s smile was as cool as always as his gaze flicked to Marlena. “I haven’t seen you in a while. Is this your lovely fiancée I hear so much about?”</p><p>John stepped forward. In the three months he and Marlena had been engaged, he had yet to introduce her to the friend that would serve as his best man.</p><p>And then Sierra opened her mouth. “You should know, Gerard, since she’s the same woman I saw leaving your brownstone every morning for the past two weeks.”</p><p>It was then John saw the raging hurt and anger in Sierra’s slate gray eyes as she glared at Marlena and Gerard while stepping back slowly.</p><p>John’s eyes narrowed, his gut tightening in suspicion. “What did you just say, Sierra?”</p><p>The one thing that hit him faster than even the words was the fact that neither Marlena nor Gerard was denying it. Guilt flickered in both their eyes instead.</p><p>“My God, that little tramp has nerve,” Marlena finally muttered. “Where is her keeper?”</p><p>Gerard was watching John, though. It was a damned good thing, John thought, because he wasn’t certain himself of his reaction. Was that an edge of relief mixed with the sudden anger that his best friend and his fiancée had been lying to him? Lying. Cheating him as though he were too damned stupid to eventually catch on to it?</p><p>“Why were you at Gerard’s house?” he asked. “You told me you didn’t know him.”</p><p>“Really, John, these things aren’t discussed in public.” Her cold blue eyes narrowed on him. “Your roots are showing, dearest. A marriage such as ours doesn’t necessitate such answers.”</p><p>A marriage such as theirs? Where the hell had that come from and what made her think their marriage would be any different than any other couple’s?</p><p>“The hell it doesn’t.” He was aware of the looks nearby diners were giving them. The subtle hunger as they smelled the juicy gossip getting ready to roll. “If you’re fucking my best friend, then it’s as good a time as any to discuss it.”</p><p>Marlena’s eyes widened.</p><p>“Hell, John,” Gerard muttered, looking around in embarrassment. “Business arrangements don’t include jealousy.”</p><p>“Business arrangements?” Fury was beginning to envelop him.</p><p>“Well, surely you didn’t think it was a love match,” Marlena drawled. “Your money, my family. That does not a passionate affair make.”</p><p>Her family? Her father didn’t have shit compared to his in financial success. Did she honestly believe the Genoa name held an advantage to him?</p><p>“John.” And there was Sierra, sliding in close, her tiny hand settling on his arm. “This is the wrong place to fight. You don’t want witnesses when you kill them, right?”</p><p>He almost laughed. Hell, he was almost amused as he stared down at her somber little face. “I have a good lawyer,” he promised her in a loud whisper. “And diminished capacity goes a long way.”</p><p>Lifting his gaze, he watched as Marlena and Gerard both stepped back. “What’s wrong, Gerry, buddy? You don’t have as much money as I do?”</p><p>Gerard winced; they both knew he didn’t.</p><p>“Fuck both of you,” he growled. “You can mail the ring back, keep it, or flush it, who the fuck cares. Now I know why I hesitated to give you the heirloom Mother has. You don’t fucking deserve it.”</p><p>Marlena gasped in outrage, and her lips parted to deliver what he was certain would be a scathing retort when he turned his back on her and walked away.</p><p>“Go home, Sierra. You did your good deed for the day,” he snarled down at her as he hailed a cab then jerked the door open as one pulled in beside him.</p><p>“John.” Her hand was on his arm again. Her nipples were pressing tight and hard against her dress. Hell, there were days he wished she wasn’t his father’s goddaughter. It made it damned hard to give her the fucking he’d wanted to give her since he’d learned just how easily she could be had.</p><p>“I’ll deal with you later, you little troublemaker,” he snapped as she jerked her hand back. “Until then, stay the hell out of my way.”</p><p>“You had a right to know, and she had no right to an opportunity to lie to you.” She bit her lip, anger and conviction shining in her eyes, along with her tears.</p><p>“I’m not so easy to lie to,” he informed her sharply. “Fuck it, Sierra. Go play with your little artist boyfriends and leave me the hell alone.”</p><p>Sliding into the cab, he slammed the door, the sight of her pale, serious little face in his periphery as the cab pulled away. Giving the driver the address to his penthouse, John sat back in the seat and closed his eyes briefly.</p><p>Hell. He should have known she was cheating on him. He should have known the entire relationship was nothing more than a sham. In the year and a half they’d been together, not once had he felt what he knew he should have felt from Marlena. There had been no depth, no passion. He’d convinced himself that would change once they married. He should have known when his mother gave the news of his engagement such a cool reception that something was wrong.</p><p>When he walked into his penthouse half an hour later, he went directly to the bar. He’d been doing that more and more lately, he thought. Heading straight to the bar the minute he walked in the door.</p><p>He’d been doing it for the past three months.</p><p>What had ever convinced him that marrying Marlena was a good idea?</p><p>Oh yeah. She was cool. Calm. She demanded very little from him and gave even less.</p><p>He went for the whisky.</p><p>Sometimes, a man just needed a little false courage to make the decisions he had known for years were coming.</p><p>That was why he had asked Marlena to marry him. One last-ditch effort to conform to the life he had been born into, the society that was part of his birthright.</p><p>His mother’s family had been an integral part of Boston society for more than two hundred years. His last name might be Walker, but it was his mother’s Boston Brahmin side that had assured him carte blanche in the world he lived in.</p><p>It was a world he was leaving.</p><p>He accepted what he had sensed for a while now. He may have been born into this world, but it was one he found himself unable to accept now.</p><p>It was time to go.</p><p>Whisky burned its way to his stomach as he inhaled through the slow, blooming heat.</p><p>Hell, he had no right to come down on Sierra as he had. She was damned protective, and it wasn’t as though he hadn’t watched out for her in similar ways when he caught her lovers cheating on her in the past.</p><p>He’d always watched out for her, especially when she was involved with people he didn’t particularly approve of.</p><p>He downed another shot of the expensive liquor.</p><p>It was his own damned fault.</p><p>He’d had enough reservations about asking Marlena to marry him that he hadn’t asked his mother for the heirloom engagement ring to give her. He should have known when he hadn’t given her that damned ring that something was wrong.</p><p>A marriage of convenience. His money for her name. As though his family needed her fucking name. His mother’s patrician line opened doors for him that the so-called revered Genoa name would never open.</p><p>As he tossed back another shot, a key scraped in the door and it opened slowly.</p><p>Son of a bitch, she just didn’t give up, did she?</p><p>Marlena stepped into the foyer, her nose lifted with haughty arrogance.</p><p>She had definitely had a nose job and he hadn’t even cared enough to notice before.</p><p>“We need to discuss this.” Hip cocked, that nose tilted, model thin and superior. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“When did you get the nose job?” He narrowed his eyes.</p><p>Surprise shifted in her pale blue eyes. “Months ago.”</p><p>He shrugged. “We don’t have shit to talk about. Get your things and get out or I can have them delivered to you tomorrow.”</p><p>“Really, John, you act as though you had no clue as to what was going on.” She sniffed coolly. “You should have known. As perverted as you are, do you really believe any decent woman of class is going to want anything more than the bankroll backing you?”</p><p>He let his gaze drift slowly down and back up her reed-thin body. “You made a lousy whore then.”</p><p>Her lips thinned as she pulled the engagement ring from her finger and laid it calmly on the antique table next to her. “Very well, then, if that’s how you feel. Once you sober up, you’ll call.”</p><p>“Don’t bet your nose on it,” he grunted. “Get the hell out of here, Marlena, before I say something I’ll regret.”</p><p>“No doubt you will,” she sighed. “Really, John, you should do something about those nasty roots showing. Just because you come from hick stock doesn’t mean you have to live down to the name.”</p><p>“Beats living down to yours,” he informed her caustically. “Have fun with Gerard. Maybe he’ll like the ice-queen act.”</p><p>Her lips curled. “He didn’t have the ice queen, darling. I was there for fun. You were the responsibility.”</p><p>“Lucky him,” he drawled. “Now go ruin his perfect little life instead.”</p><p>Her tinkling laughter grated on his nerves as she turned and walked out the way she’d come. Damn. As relieved as he was that the engagement was over, the taste of betrayal was still thick in his mouth. His best fucking friend and fiancée. How classic was that? The cliché was enough to drag a mocking snort from him.</p><p>He stared at the whisky then poured another drink.</p><p>He’d no more than shot that one back when, son of a bitch, the door opened again. He was seriously going to have to collect the keys he had given to the penthouse. This was getting out of control.</p><p>The place was fucking Grand Central Station tonight, and he’d just about had his fill of it.</p><p>And there she was.</p><p>Imp.</p><p>The little demon sprite.</p><p>The torment of his life.</p><p>Too fucking young, but getting a head start on experience.</p><p>She’d been running with a promiscuous set of friends for years. Friends that had no problem bragging about the privileges she allowed.</p><p>He didn’t blame her for them. Hell, she was a beautiful woman. She was almost family. That was the problem. She was “almost” family. That tormented him, because he was damned for wanting exactly what she had gifted those other men with. He wanted that and more. So much more that he kept as far away from her as possible.</p> <p>He didn’t hold it against her. Hell, he’d done worse in his sexual past, but it burned in his gut like a sore because he wasn’t one of the lucky ones. How fucking brutal was that?</p><p>“Go home, Sierra.” He was too drunk for this. He’d had his life nicely planned out, and as much as he felt relief that the engagement was over, still, it had been his plan, and she’d fucked it up. And he was just drunk enough that his logic capabilities weren’t at their strongest.</p><p>“I don’t want you to hate me.” She was braver than Marlena. She actually stepped into the main room and faced him boldly.</p><p>With her hard nipples.</p><p>With her lush lips and hungry slate gray eyes.</p><p>“Why the hell did you have to make it your business?” He growled.</p><p>The same reason he would have made it his business, of course. It was happening, it was wrong, and they were friends. Close. They hungered for each other, and they both fought it.</p><p>“Because I care about you,” she whispered. “You’re my friend, John. When Gerard asked me to the restaurant, I knew what he was doing because your mother had told me you and Marlena were supposed to be there tonight. They were going to stand and lie to your face. They were rubbing your nose in it, and I hated that.”</p><p>Her hands were clasped tightly together, sincerity and that damned hunger flickering in her eyes.</p><p>“Bullshit,” he snapped. “You’re not my fucking friend, Sierra. Friends gloat later, they don’t give a fuck if you make a mistake while you’re making it.”</p><p>He should know. Other than possibly Sierra, it was the only type of friend he’d ever had.</p><p>Her lips thinned. He liked the lush look better.</p><p>“Then marry her already,” she charged back in anger. “If you’re so pissed at me, get down on your knees and beg her back. I’m sure she’ll be more than happy to watch you beg.”</p><p>“Fuck you, Sierra!” And only God knew how bad he wanted to fuck her.</p><p>His cock was pounding, hard and desperate. She always affected him like this, and now the alcohol was only intensifying it. He never drank around Sierra for a reason. It totally screwed with his self-control.</p><p>“Why did you even fucking care?” He couldn’t get it out of his mind. No one else would have told him, and he knew Gerard. Gerard hadn’t hidden it from anyone but John. And of all his so-called “friends,” only Sierra had dared to reveal the truth in a manner neither Marlena nor Gerard could deny it.</p><p>“Because I care about you, dummy,” she burst out in exasperation. “Do I have to beat that into your head?”</p><p>It was more. He’d seen it in her eyes at the restaurant and he saw it now.</p><p>He saw something he didn’t want to see. It went beyond a sensual awareness or hunger for him. It went beyond what he had wanted to see in the past.</p><p>“You’re jealous,” he accused her softly, the truth slapping him in the face. “You think you’re in love with me? Have you lost your mind, Sierra?”</p><p>Incredulity echoed in his voice even as it pulsed through his mind. He hadn’t seen it before. Why hadn’t he seen that emotion in her eyes before?</p><p>“I did that a long time ago.” Her voice was husky now, her eyes glittering with dampness. With tears. Fuck, she was not going to cry on him.</p><p>“Don’t you dare cry.” He moved to her, jerking her against him.</p><p>Big mistake, but there she was, against him. So fucking young and too damned tiny. And he was hungry for her. That hunger had pulsed inside him for too long, burned in his gut and tormented him. He didn’t want this, not with Sierra. With the only person in his life that he had counted on as a friend.</p><p>“I didn’t want this with you,” he snarled down at her. She was too soft for what he wanted and he knew it. Too vulnerable, even if she was experienced enough for it. But he was drunk. He was hard for her. And he’d fought it for too damned long.</p><p>“Why?” The vulnerability in that single word struck at his heart. As though he had just broken all her dreams, all her hopes. “Why not me, John?”</p><p>“Because damn you, I didn’t want to hurt you.”</p><p>He didn’t give her a chance to retort. His head lowered, his lips taking hers quickly, parting the lush curves as he slid one hand into the riotous curls that surrounded her face and gripped the soft strands to hold her to him.</p><p>The silken curls wrapped around his fingers as though hugging him to her. Like living strands of heat, they caressed his flesh, stroked it.</p><p>The taste of her, the adrenaline and hunger coursing through his veins, only made him drunker. Drunk on her. He’d known touching her would be hazardous, and how right he had been.</p><p>Growling at the surge of lust tearing through him, he dropped the empty glass to the floor and gripped the slender strap of her dress to drag it over her arm. It would only go so far. He couldn’t find the zipper. It wasn’t at her back. He didn’t want to look for it.</p><p>The sound of the material rending didn’t faze him; what it did do was give him entrance to the bodice of her dress and the swollen curves of her breasts, the tight, hard nipples topping them.</p><p>“John?” Pleasure and confusion filled her voice now. “Oh, God, John, what are you doing?”</p><p>What the hell did she think he was doing? Giving them both what they were hungering for.</p><p>His lips slid down her neck, moving for those tight little berries. The feel of them against his tongue sent a groan tearing from his chest.</p><p>Sucking one into his mouth, he laved it with his tongue and loved it with his mouth as he lowered his hand again, this time to his trousers.</p><p>If he didn’t release his cock, he was going to go insane. It pressed against the zipper of his pants, demanding to be set free. Like a ravenous beast, it throbbed and pulsed at the confinement, silently demanding attention.</p><p>Demanding her mouth, her fingers, the lush, hot folds of her wet pussy. He groaned at the thought of fucking her. Of pumping inside her, deep, hard, feeling the snug tissue rippling over his dick.</p><p>As he released her nipple, his lips pulled back.</p><p>His hand tightened in her hair as his gaze centered on her lips and he pressed her downward.</p><p>God, he wanted her mouth on his dick. Her tongue licking over the bulbous crest, her lips covering it, her mouth sucking him inside.</p><p>He wanted it with a hunger he had never wanted anything with before. He’d lost all reason, all logic. Objectivity was simply a thing of the past. Nothing existed now but getting his cock in her mouth.</p><p>Sierra lost her breath at the silent demand in his face, his gaze, as he tugged her lower. She knew what he wanted. With one hand he gripped her fingers and dragged them to the heavy length of his cock as it speared from the opening of his trousers. Long, thick, the heavy crest dark and flushed. It throbbed, glistened with dampness, and caused her mouth to water at the thought of the taste of him. Her fingers wouldn’t wrap around the width of the pulsing flesh, like silk over iron, it heated her palm and made her ache for the feel of it.</p><p>She could feel her pussy growing wetter, hotter. The ache between her thighs, her hardened clit, pulsed with the need for touch in ways it had never done before.</p><p>“I’ve dreamed of you sucking my dick,” he groaned as she went slowly to her knees in front of him. “Nights of it, Sierra. So many nights spent sweating at the thought of having you.”</p><p>He had no idea what he was doing to her—he couldn’t. He had no clue she had never done this before; all he had were the rumors he believed of her wild ways. Rumors she knew he believed because he teased her over it. Always gently, always with affection but always with a glimmer of some darker emotion in his eyes.</p><p>He believed them though. How surprised would he be when he learned she was a virgin?</p><p>Kneeling in front of him, her fingers caressing his hard flesh, she swallowed tightly, fighting to keep her mind clear enough to please him. She wanted to go hungry on him though. She wanted to lose the overwhelming need to simply devour him.</p><p>“Give it to me, Sierra,” he demanded, his violet-blue eyes darker, glittering with intoxicated lust.</p><p>His lips were fuller, his face flushed beneath his darkened flesh, his eyes glittering. She had never seen such need, such arousal in a man before. It should frighten her, but this was John. This was the man she had ached for since she’d been old enough to realize what aching was.</p><p>She was shaking at the sight of the thick, demanding crest, her chest tightening with excitement and fear. She’d never, ever touched a man like this before. Could she actually do it?</p><p>Leaning forward, she touched the tip with her tongue, licking over the dampness that collected on the wide head. The salty, stormy taste of him exploded against her tongue, and she swore she was becoming as drunk as he was.</p><p>Her fingers caressed the thick shaft, and she rubbed her tongue over the head as she fought past her fear and inexperience. She wanted to memorize this moment in time. Every taste, every feeling, every sensation.</p><p>“Damn you, Sierra, suck me. Let me fuck your mouth before I die for it.”</p><p>Her lips parted for him, a moan slipping from her throat as he filled her mouth, sliding slowly inside to burn against her tongue. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She moaned again. Her lips tightening as she began sucking the iron-hard flesh, excitement and hunger rising inside her until she didn’t know herself any longer.</p><p>That hunger was loose now. She had no way to control it, no way to hold back the needs suddenly filling her, flooding her entire body.</p><p>She wanted this. She wanted him, until she felt as though she were dying for it.</p><p>“Ah, yes,” he groaned, pleasure filling his voice, his hands sliding into her hair as his hips began to move. “So fucking hot. I knew your mouth would be sweet and hot. Those pretty lips feel like silk.”</p><p>His fingers tightened in her hair as his cock began to shuttle back and forth between her lips, deep into her mouth, nearly to her throat, as she struggled to accept the heavy length.</p><p>“Relax, Sierra,” he grated, his voice harsh with lust. “Breathe easy, sweetheart. Take me deeper. Let me have you.”</p><p>She’d read about it. She’d even watched it. She could do this. This one time, with this man that she loved above all others. Breathing in through her nose, she struggled to take the wide crest to her throat, sucking on it, her tongue rubbing against the underside as he groaned in approval.</p><p>“Hell, yes.” She could hear the pleasure in his voice as the strokes in her mouth lightened, became shallower. “Look at me, Sierra.”</p><p>She struggled to stare up at him, her eyes tearing as his erection passed slowly through her lips this time. Pleasure pulsed through her veins, flooded her body. She was the woman she had always wanted to be. She was his woman. For this moment, this hunger, she was his woman.</p><p>“So fucking pretty,” he groaned. “I’ve dreamed of this, baby. Dreamed of fucking you. Watching your mouth take me. Feeling that wicked little tongue rubbing my cock.”</p><p>And she was rubbing against it, licking it. He tasted of midnight and man, and the effect on her senses was devastating.</p><p>As his gaze locked with hers, he reached down, gripped her hand as it clenched against his hard thigh, and moved her fingers to the taut sac between his thighs.</p><p>“Touch me there,” he demanded, his voice rough with hunger. “Let me feel your soft fingers, Sierra. Give me what I need.”</p><p>Her fingers trembled as she cupped the weight of his testicles before caressing them tentatively. She couldn’t believe this was happening. Finally, after so many years. But she knew it couldn’t last. She knew when morning came, whatever lapse he was having in self-control would be quickly repaired. John was nothing if not controlled. He had a plan for his life, and she had always sensed it. A plan that had never included her. Come morning, he would remember that plan. But Sierra would always have tonight.</p><p>She couldn’t help herself. She was desperate for him. So desperate that she wanted to create as many memories as possible.</p><p>Stroking the tight flesh she cupped, Sierra sucked at his erection, pulled back, and let her lips trail down the hard shaft as her tongue flickered against it. She moved lower, staring up at him, watching his violet-blue eyes darken further as her tongue began to lash lightly at his balls.</p><p>A harsh, tortured groan tore from his lips as he gripped her hair, lifted her head, and pushed his cock between her lips once more. Fucking her mouth harder, his strokes short and tight, he looked like a conqueror above her.</p><p>“I’m going to come,” he groaned. “Ah, hell, baby, give me your sweet mouth. Take my dick, Sierra. Suck it baby. Sweet and deep . . .” He fucked deeper, shuddered.</p><p>The feel of his cock throbbing, flexing, warned her. At first, the warning wasn’t clear, until his fingers tightened in her hair, then the heat and stormy taste of his semen erupting in the back of her mouth sent her senses clawing for each sensation.</p><p>The jetting spurts were hot against her tongue. His voice was harsh, low, as he growled her name when she swallowed the lush taste of him.</p><p>She wanted to relish it, to relive each second in time as it happened, but John was moving. Pulling back from her, he lifted her, pushed her against the couch, and went to his knees between her thighs.</p><p>Before she could react or even think to stop him, her dress was at her hips and his hands had torn her panties from her body. He didn’t hesitate once her flesh was revealed. His lips went straight to the sensitive, violently responsive flesh between her thighs.</p> <p>Then he kissed her there. An intimate, hot kiss against the folds of her pussy, his tongue lashing at her clit, the wet velvet feel of him firing every nerve ending in her body. Lush, vibrant pinpoints of incredible sensation raked along her flesh, arching her body and drawing a strangled cry from her throat.</p><p>She’d never thought she could have this.</p><p>She’d never believed John would ever touch her like this.</p><p>It was nothing like she had ever imagined it would be. She’d fantasized, she’d dreamed of this with John, but she had never in her wildest imagination known how good it would be. That it would rain sensation over every part of her body. She felt flush from her toes to the top of her head. She felt as though a fire was being stoked in her very womb.</p><p>Pleasure seared every nerve ending he touched. Riotous frissons of heat tore through her body. His lips and tongue caressed, licked, kissed. His tongue rubbed around her clit, stroking and caressing with silken hunger as it destroyed her balance and left her spiraling out of control.</p><p>She had to hold on to him. Sinking her fingers into his hair as he pushed her thighs farther apart, Sierra wanted to scream out his name. There was no breath to cry out, let alone to scream. There was barely enough oxygen to sustain her as pleasure rushed through her system like a fiery windstorm.</p><p>His tongue was wicked, destructive. His fingers pulled the folds of flesh apart as his tongue licked and stroked, blazing a path of ecstasy through her system as she strained to get closer.</p><p>His tongue flickered over her opening, a rumbling growl vibrating against her flesh as she cried out in pleasure.</p><p>“No. Don’t stop.” She gripped his hair as his head lifted, only to release him as he forced himself back.</p><p>“Is this what you want, Sierra?” His hand gripped his cock, tucking it against the swollen, wet folds of flesh as he stared back at her.</p><p>“Please.” She was shaking, the need was so great now.</p><p>“Please what, sugar? Please fuck you like the beautiful little troublemaker you are?” His words slurred just slightly, whether from the drink or the lust she wasn’t certain.</p><p>“Why, baby?” he whispered as he pressed closer. “Why are you even here?” There was a tortured, hollowed sound to his voice.</p><p>Sierra shook her head. “I love you, John. I’ve always loved you.”</p><p>His hips bucked, driving him inside her, the sharp burst of heat, pleasure, pain, washing through her at his entrance drawing a cry from her lips as he settled against her.</p><p>His head fell to her shoulder.</p><p>At first, Sierra wasn’t certain why. He hadn’t penetrated her fully, just enough to draw that sharp cry, to tear aside the veil of virginity she had possessed. Now, he was silent.</p><p>Because he had passed out.</p><p>Sierra blinked up at the ceiling, fighting to just breathe through the incredible emotional burst of pain that flooded her.</p><p>He had passed out. As though this moment in time meant so little, that he didn’t even struggle to stay sober enough to keep awake.</p><p>Tears spilled from her eyes as she stared up at the ceiling, a sob tearing from her chest.</p><p>“Shhh, baby,” he mumbled against her neck. “S’kay.”</p><p>He settled closer, his hips shifting, dragging his cock from her a second before the lightest snore fell from his lips.</p><p>Silent sobs shook her body as she managed to wiggle from beneath him, then she struggled to get him on the couch. Pulling his handkerchief from his jacket, she quickly cleaned the smear of blood from him, then cleaned herself before dropping the square of linen on the floor next to the couch, wondering if he would even connect the smears of blood to this night.</p><p>She had dreamed of this night. Dreamed of him finally wanting her, and perhaps it served her right that it had ended as it had.</p><p>Kneeling next to the couch, she brushed his hair back from his forehead, the light brown strands thick, not overly long, but framing his face devilishly.</p><p>He was her personal heartbreak. For as long as she could remember, the love she had felt for him had driven her to impossible lengths to gain his attention. It had driven her here, to a night she knew would haunt her forever.</p><p>“I’d rather have you hate me than have you marry that bitch,” she whispered painfully as she wiped at her tears.</p><p>And he probably would hate her when he awoke. When reality surfaced and he realized the lengths she had gone to in ensuring his engagement was broken.</p><p>She wondered, though, if he would remember her arrival here, or the brief time he had touched her as a woman, rather than the troublemaker he had always called her.</p><p>Forcing herself to her feet, she left the penthouse, locked the door on the way out, and told herself, this was over.</p><p>No more.</p><p>Loving John Walker was a dead-end street, and Sierra needed more than brick walls to bang her head against.</p><p>It was time to go on without those girlhood dreams.</p><p>It was time to go on without her heart.</p><p>ONE</p><p>ONE YEAR LATER</p><p>John C. Walker Jr., son of the formidable John Calvin Walker, had finally come home. He could feel the knowledge sinking inside him, filling all but one part of his soul and reaffirming a decision that had been made on a rainy Boston night a year before.</p><p>Standing on the upper deck of the Nauti Dreams as it coasted slowly down Lake Cumberland, he drew in a deep, relaxing breath and felt something slowly relax inside him further. Some inner tension, a deep-seated longing that had finally come to rest.</p><p>His father had left Kentucky years before, long before John had been born, and wiped the dust of the Kentucky mountains off his feet. Unfortunately, as his father liked to claim, some of it had managed to adhere to his children.</p><p>One of his daughters, as well as his only son, had retreated back to Kentucky.</p><p>The mountains rose around him like comforting arms, nestling him within a strong, nurturing embrace. A whisper of a breeze rustled through the trees and over his sweat-dampened shoulders, while the strong heated rays of the sun further bronzed his once pale flesh.</p><p>He felt stronger here, more in charge. He felt as though, for the first time in thirty-two years, he was finally himself.</p><p>The sun had bleached his thick, light brown hair almost blond, darkened his flesh, and put small lines at the corners of his eyes. The hard, physical labor of helping his sister and her husband build their home, and rebuild the bar that had been burned down by an arsonist the year before, had honed his muscles and sculpted his body.</p><p>He’d been in good shape before, but now, he felt at his peak. He felt invigorated and alive.</p><p>The houseboat he’d bought from the Mackay Marina was perfect. A floating home that suited the need to push away conformity and embrace that vein of gypsy wildness his father had always scowled over. It gave him peace. Or at least a large measure of the peace he had been searching for.</p><p>For the first time in his life, John Walker was close to finding satisfaction. If there was one little niggling worry that continued to prod at him, then he fought to ignore it. Nothing was perfect. No life was completely serene, but he was as close as he had ever been to it.</p><p>If dreams haunted him of one woman, a night he wasn’t so certain of, and a pleasure so perfect it couldn’t be real, then he tried to push it behind him.</p><p>Other than that night, that woman, he’d finally found a place he belonged.</p><p>Now, he understood why his sister had fought her family’s insistence that she return to Boston when the people of this county had turned on her for a brief time. Why the gypsy in her had rebelled and returned to where the mountains nurtured that spark of rebel fire inside her.</p><p>He understood things now that he had never grasped before, and the regrets that had once filled his life began to fade away.</p><p>All but one.</p><p>Shaking his head, he refused to allow himself to touch that thought again. He was beneath the sun, the water lapping at the boat as it coasted gently along the channel. Above, an eagle soared and called out to its mate while a coyote watched him suspiciously from the far bank. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Deer grazed in a small clearing close to the water across from the coyote, as though taunting it with its inability to reach them in time for a meal. It reminded him of the woman he refused to think of, and the months he had spent attempting to chase her down.</p><p>The sounds of nature enclosed him. The traffic, squawking, blaring horns, and raised voices of the city were blocked by distance and by his own determination to put it behind him.</p><p>He’d found friends here in the past year. He’d found purpose. And he’d finally figured out the sister he’d never understood before.</p> <p>Rolling his head, he let the breeze caress his neck as his eyes narrowed, his hands confident on the wheel of the large craft as he maneuvered it along the lake.</p><p>He wasn’t John Calvin Walker Sr.’s son here. Here, he was that damned Walker boy, and that suited him fine. He had family here that understood the mountains, brewed their own liquor, and laughed when he choked on it.</p><p>Mountain parties, barbeques, and pig roasts. And he was loving every minute of it.</p><p>Hell, he was more than loving it, he was reveling in it.</p><p>He worked when he wanted to, took the legal cases that interested him, and the rest of the time he worked with a nonprofit group that built homes for the poor and looked after the elderly. And he let the mountains embrace him.</p> <p>The only thing he couldn’t run away from, though, was the damned cell phone he couldn’t seem to throw away, no matter how many times he tried.</p><p>The bastard insisted on getting excellent reception, even here, deep within the forested land rising around him. Proof of it was the insistent beeping at his hip.</p><p>Glaring at the water stretching out before him, he pulled the phone from his pocket, scowled at the number on the display, and against his better judgment, accepted the call.</p><p>“No, I’m not bored yet,” he told his father as he brought the phone to his ear.</p><p>A second of silence greeted him.</p><p>“Of course you’re not,” his father’s cultured voice drawled sarcastically. “There’s rarely time to be bored when you’re pretending to be the luckless playboy of Lake Cumberland. The novelty hasn’t quite had a chance to wear off, has it?”</p> <p>“Not yet,” John agreed happily. “Do you know what I’m doing right now?”</p><p>“Do I want to know?” his father asked warily.</p><p>“I’m maneuvering my houseboat down the lake. I’m sweating like a pig and grinning from ear to ear. When was the last time you did that, Pop?”</p><p>“You don’t want to know,” John Sr. growled warningly. “When are you returning home?”</p><p>“I told you, I am home,” he retorted. “If you called to argue with me again, then you’re wasting your time and I have better things to do.”</p><p>He could almost see his father, an older version of himself, his lips thinning, his eyes narrowing in irritation at his son’s refusal to return home.</p><p>This was home to John, and he couldn’t see that changing anytime soon.</p><p>“You sound like your sister.” Anger throbbed in his father’s voice. “You’d think after what she went through in that damned county, she would have left before that sheriff managed to tie her to him. What are you doing, John? Why are you doing it? How many times do I have to tell you what’s coming? Those people will turn on you as fast as they accepted you.”</p> <p>John shook his head. The hell his parents had faced here had been the fault of the individuals who had kept a hold on the county, not the people itself. The few had ruined much for the many, for too many years.</p><p>They were gone now, but John understood his father’s hatred for them, and his distrust of the county. He understood it, but he refused to return to what his life had been before.</p><p>Here, he had a sense of purpose. There, he’d had nothing but his family. A damned good family, he admitted, but there had been nothing to anchor him, nothing to ease that restless hunger that tormented him.</p><p>“How’s Mom?” he asked, rather than arguing again. He always tried to stem the flood of anger that rose between them each time they talked.</p><p>His father sighed heavily. “She misses her children. This wasn’t what she wanted, John. She raised her children with love and now you’re all deserting her.”</p><p>In other words, his mother was doing what she always did, refusing to step into the middle of the arguments that waged between John Sr. and his children.</p><p>Not that the older Walker didn’t love his children. He did. Too much sometimes. He could never understand that he couldn’t shelter them from life, no matter how hard he tried. That he couldn’t force them to live the life he’d attempted to create for them.</p><p>It was the same fight they’d had when John had joined the Marines just out of high school. The argument they had when John had gone into criminal law rather than corporate law as his father had done.</p><p>The argument they had had when John had told his father he was asking Marlena Genoa to marry him.</p><p>“Tell her I love her,” John said.</p><p>“Sure you do,” his father grunted. “That’s why you’re cruising down a damned lake rather than having dinner with her today.”</p><p>It was Sunday. Every Sunday it was dinner at home, no matter what, that was, as long as the particular child was in town.</p><p>“I’m sure Candace and her children are keeping her busy.”</p><p>Candace Salyers was his sister, the oldest of the Walker siblings. Married, with three beautiful kids and a doting husband, Candace had a life she thrived on. She swore she couldn’t exist outside of Boston, and abhorred anything even remotely “country.”</p><p>Silence filled the line again, this time longer.</p><p>“Fine, if you insist on bumming in Kentucky a little longer, then you can do me a favor,” his father finally growled, his tone darker now, assuring John that whatever was coming was serious.</p><p>He waited, knowing it would take a moment for his father to perfect his pitch.</p><p>“It’s Sierra, John. She’s in trouble.”</p><p>John froze.</p><p>He didn’t want to hear her name, he didn’t want to talk about her, hell, he refused to think about her. She had made the decision to run from him, not the other way around.</p><p>“Last week, someone broke into the house and attacked her. She was hurt, John. Hurt bad enough that for a few days we wondered if she was going to come out of it.”</p><p>Shock resounded through him. John stood perfectly still, fighting to take in the information, to control the rage tearing through him, threatening to release itself with such a wave of violence that for the first time in his life, John frightened himself.</p><p>“What did they do to her?” Fury pulsed through him now.</p><p>His father breathed out roughly as John waited. And waited. It seemed to take forever for his father to speak.</p><p>“She was nearly raped. Bruised severely and strangled. She would have been killed, but her new roommate arrived and scared him off. The girl was terrified. After the guy escaped through the bedroom window, she was certain Sierra was dead.”</p><p>Every muscle in John’s body tightened. Rage began to burn in his gut as he imagined the petite, fragile young woman being strangled, attacked.</p><p>A wave of possessiveness tore through him, a distant thought that someone had dared to hurt what belonged to him tearing through him.</p><p>“You didn’t call me,” he snarled. “Why?”</p><p>For a moment, his father was silent before he answered heavily.</p><p>“Because I knew something bad had gone on between you two before you left. I didn’t know if you wanted to be involved, John. I wanted to wait. But I need to get her out of town until I figure out why she was attacked. It doesn’t make sense. Hell, Sierra’s temperamental, but she doesn’t poke her nose in dangerous stuff. And it’s rare for a damned decorator to make the kind of enemies that attempt to kill you in the middle of the night. I have a bad feeling about this, John. I want her safe while my investigators check it out.”</p><p>Someone had tried to harm Sierra. It was almost too much for John to attempt to take in. He couldn’t believe anyone would dare touch her. It was common knowledge that she was all but family to the Walker and Evanworth families. And John Walker Sr. had established that he took care of his own decades before.</p><p>John himself had always been incredibly protective of her as well. And Sierra simply didn’t get into that type of trouble. She was nosy as hell, but only where her friends were concerned. She didn’t tolerate bullshit well, and liars even less, but still, that didn’t necessarily place her in harms way. “Serial attack?” he asked, wondering if perhaps Boston had acquired yet another serial rapist.</p><p>“Not that my investigators have dug up,” his father shot that idea out of the water. “Don’t worry, I’ll find the bastard, John. But she needs to get out of Boston. Like I said, my gut is rolling on this one. I don’t think it’s over and I don’t think she’s safe.”</p><p>Which meant she wasn’t. His father’s gut was notoriously right when it came to warning the man that something was wrong. It was a warning his son knew to heed. If he said Sierra was in trouble, then there wasn’t a doubt in John’s mind that Sierra was in serious trouble. Sultry, innocent, determined. She had seen to the breakup of his engagement when she’d caught his fiancée cheating. She had looked out after him, and despite her refusal to speak to him after that night, he would make damned certain he protected her now.</p><p>“What does she think about this? She’s not exactly speaking to me at the moment.” Not that he cared what she thought. If he had to go to Boston and force her into his protection then that was exactly what he would do.</p><p>“You’re the only choice,” John Sr. barked. “Dammit it John, she cried for you in the hospital. She was beaten, bloody, bruised to hell and back, and out of her mind with fear. When I got there, she was begging for you. They called me because they couldn’t find you.”</p><p>His teeth clenched, his fingers wrapped so tight around the controls of the houseboat that he wondered he hadn’t broken the column. Pure, almost mindless fury surged through his brain at the knowledge that he hadn’t been there for her.</p><p>“I’m not asking what went on with you, Marlena, and Sierra,” his father sighed. “I never asked. I figured if you wanted to talk, you’d come to me or your mother. But whatever happened, whatever Sierra did, she did because she felt it was right.”</p><p>She had done it because she had believed herself to be in love with him. John knew the reasons why. He didn’t fault her for it now, but he had faulted her for it then.</p><p>“Does she know you’re asking me?” he repeated roughly.</p><p>“Not yet.” His father’s tone was filled with sudden weariness. “She’s terrified, John. She won’t leave the house, and your mother and I have to head to Europe next week. Sierra won’t let me hire a bodyguard, and she’s threatening to run. She’s my goddaughter. I can’t let anything happen to her.”</p><p>John stared around him, his jaw clenching at the thought that Sierra was threatening to run rather than coming to him. Damn her. She’d refused to see him after that night, wouldn’t talk to him. She’d went so far as to leave town for months. He’d taken the message and left her alone, hoping time would heal whatever he may have said to her.</p><p>That night was a little sketchy. He’d been pissed, he remembered that clearly. Just as he remembered kissing her. After that, things were a little hazy and mixed with fantasy more than reality.</p><p>“Do I need to drive in to pick her up?” he finally asked. And he would. There wasn’t a chance in hell he was going to allow her to face more danger without him at her side.</p><p>“As much as I want to see you, I advise against that,” his father stated. “I’ll have her brought to you. Candace and her husband and kids are taking the family jet to the West Coast tomorrow. An unscheduled stop will be made at the Hickley landing strip. It’s private and Raymond Hickley will make damned sure no one knows they landed there. I’ll call you back with the details.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>John rubbed at the bridge of his nose as he grimaced. “Yeah, I’ll be waiting.”</p><p>Waiting wasn’t what he did best. His preference would be to go after her, but he understood that having her slipped aboard the family jet and deposited secretly in Kentucky would be far better.</p><p>“John, your leaving destroyed her,” his father suddenly stated. “She cried for weeks. Whatever you did to her before you left, don’t do again. Please. I hate seeing your mother cry, and she made her cry.”</p> <p>Then Sierra shouldn’t have run. And that was exactly what she had done. She wouldn’t answer his calls, she wouldn’t answer the door when he went to her apartment, and she was never where she was supposed to be.</p><p>She had run from him until he had stopped chasing her and chased what little chance he had of peace instead.</p><p>John shook his head. “Later, Dad.”</p><p>Disconnecting the call, he carefully maneuvered the huge houseboat around and back toward the marina. If he knew his father, it would only be a matter of hours before he called back, before he had the details worked out and Sierra prepared to leave.</p><p>If Candace was leaving early, as she normally did when she and her husband flew to California to spend time with his family, then he would be at the Hickley Dairy Farm before the sun rose, hours before his day normally began.</p> <p>This was exactly what he didn’t need. Peace had been a long time coming, the serenity he’d found here was hard won, and now, that last niggling barrier to complete contentment was rearing its innocent, gorgeous head. And it had the potential of destroying his peace, just as the potential of completing it existed.</p><p>Sierra.</p><p>TWO</p><p>Sierra was silent as the jet landed, her heart racing, a sense of panic nearly overwhelming her at the realization that a year of running was over.</p><p>“I want to go home,” she whispered.</p><p>She’d made a mistake. It was the worst mistake she could have made.</p> <p>Lifting her head, she stared back at Candace. She saw John’s eyes in the other woman’s gaze. That beautiful violet-blue, though the features were softer, feminine, and gentle with compassion.</p><p>“Do you want to die, Sierra?” It wasn’t the first time Candace had asked her that question.</p><p>It wasn’t the first time Sierra had mentioned going home.</p><p>“The pilot is preparing to land,” Thomas, Candace’s husband, said softly.</p><p>He’d opened his home to her, just as Candace’s father had. They had taken her in, watched over her, and provided the medical care she had needed.</p><p>Thomas was one of the senior attorneys at Walker, Delmar, and Farley Legal Associates. He was quiet, calm, a bastion of strength.</p><p>“Hickley radioed,” the pilot announced. “We have five minutes on the ground. Contact is waiting to accept delivery.”</p><p>She was the delivery.</p> <p>Sierra wanted to cover her face and hide. She wanted to find a way to simply disappear and forget that any of this was happening. To convince herself that the last year was nothing more than a nightmare.</p><p>How had she let her life come to this?</p><p>By running from John. By being a coward. That was how it had come to this. There was a part of her that wondered if she hadn’t run, if she had faced John, if she would have even been in her apartment at the time? She’d moved from the more secure building the Walkers owned interest in months before to the apartment closer to her office.</p><p>She’d taken the apartment she had because it was in the same building as John’s penthouse suite. To be closer to him. What a mistake that had been.</p><p>She felt the jet dip, a smooth stroke of metal through air as it began to descend.</p><p>“He’s angry at me,” she whispered as she stared back at Candace. “He hates me, Candace. After what I did, I don’t blame him.”</p><p>She’d destroyed his engagement. He’d been furious over that, despite the circumstances. Only in hindsight had she realized how she must have humiliated him. In public. She should have found another way. She shouldn’t have allowed her anger to rule her.</p><p>“Sweetie, John doesn’t hate you,” the other woman promised. “He could never hate you. He may be angry, but he gets over the anger if you face him. You should have faced him rather than running.”</p><p>She didn’t need anyone to tell her that now. She had actually known it at the time, but she had been too hurt, too raw, to do anything else.</p><p>He’d passed out on her even as he took her virginity. In all the messages he’d left on her cell phone not once, not even once had he mentioned what they had shared. As though he didn’t remember it, hadn’t seen the handkerchief she had used to clean them both.</p><p>No, each message had contained references to Marlena, Gerard, and the fact that Sierra wasn’t answering her calls. Not a single message had been tender. Not once had he implied that he wanted to speak to her over anything other than the breakup of his engagement.</p><p>And nothing had changed. The thought of facing John now terrified her, just as it had the year before.</p><p>“We’re landing, Sierra.” Thomas’s broad hand covered hers where it lay on the armrest of the leather seat. “Remember. Don’t back down. Stare him in the eye and stand strong.”</p><p>“He’s not an animal, Thomas.” Candace’s amused chiding brought a smile to her husband’s face.</p><p>“Sweetheart, all men are animals. Feed us, pet us, and use a firm hand, and we’ll worship at your feet.”</p><p>Thomas worshipped at his wife’s feet, but it was clear Candace cherished him just as deeply.</p><p>“Don’t put up with his temper, Sierra,” Candace advised her softly. “And remember, at the very heart of it all, John would never harm you. You are truly important to him, or he wouldn’t have spent so many months chasing after you.” A twinkle in her eye indicated that perhaps he had chased after her for reasons other than the ones he had.</p><p>They simply didn’t know the truth.</p><p>But it didn’t matter. John Walker Sr. had made it clear that the only way to protect her was to send her here, where no one would suspect he would send her.</p><p>His hatred of Kentucky was well known. His hatred of its people went even deeper.</p><p>The wheels of the plane touched down, the slight jolt doing nothing to cover the little whimper that fell from her lips.</p><p>She wanted to cry, but did she have any tears left? She’d shed them all when John had left Boston. When she had realized that what she had done had forced him from his home, and took him from her forever.</p><p>As the plane rolled to a stop, Thomas rose and unclipped her seat belt and helped her from her seat.</p><p>The copilot opened the door and lowered the steps while Candace and Thomas flanked her.</p><p>Lights blazed up at her from a vehicle as a dark, shadowed shape materialized. There was no mistaking that form. Strong, bold, and broad. He was the living personification of every dream and fantasy she had ever harbored.</p><p>“Come on, brat.” Thomas lifted her in his arms rather than allowing her to walk down the steps.</p><p>He’d done that two other times. He’d carried her from the hospital, and he’d carried her into John Sr.’s home hours afterward.</p><p>Like her father had always carried her.</p><p>And then he was moving down the steps, growing steadily closer to the silent form standing below.</p><p>Sierra thought he would set her on her feet once he reached the bottom. She hoped he would. She was certain he would. But men were conspiring against her in this lifetime.</p><p>Instead, he handed her to the tall, coldly silent male waiting for them.</p><p>“Take care of our girl, John,” Thomas ordered lightly. “And remember, she bruises damned easy.”</p><p>Sierra winced, but she didn’t speak. She didn’t stare up at the man that fate had conspired to throw her back with. She stared straight ahead, all too aware of the bruises that still covered parts of her body, and the knowledge that she rather doubted John Walker Jr. would really give a damn.</p><p>She’d had a chance to think about it. He wasn’t stupid. He hadn’t been stupid a year ago. He had known what Marlena was and he had asked her to marry him anyway. She should have thought of that before she had furiously decided to reveal their duplicity.</p><p>She had struck at his pride by throwing it in both of their faces. He had wanted that marriage of convenience or he wouldn’t have put that ring on the other woman’s finger.</p><p>Still refusing to speak to him, Sierra remained stiff in his arms as he turned to the vehicle and moved to the passenger side. Thomas opened the door and a few seconds later John was setting her carefully on the luxurious leather seat of the SUV.</p><p>Stepping back, he closed the door and turned to his brother-in-law. And God, she wished she could hear that conversation.</p><p>“I just have a few minutes,” Thomas told him. “She’s still showing a lot of bruising. Her throat, breasts, and thighs. Candace says it still looks like hell. She had pain pills in her luggage but she won’t take them until she goes to bed, and she wakes up often screaming with nightmares. She screams for you, you know?”</p><p>John only barely managed to control his flinch. He hadn’t been there for her, when he should have been. The regret of that would likely haunt the rest of his life.</p><p>“Did he send the doctor’s report?” John asked, knowing how thorough his father normally was.</p><p>“Everything is in the leather briefcase. The pilot is unloading her luggage now.” He nodded to the plane. “X-rays, everything is there. Your father wants you to take her to Dr. Landry in Somerset and tell him the situation. He can be convinced not to contact the doctors in Boston and he’ll take care of her.”</p><p>John nodded. “I know him.”</p><p>Landry was old, but he was a damned good doctor. He was also part of a very small network of undercover Homeland agents positioned in the area and under the guidance of a special undercover agent who was supposed to be retired from the Office of Homeland Security.</p><p>“Good. Time for me to go.” Thomas nodded to the pilot waving him back. “Take good care of her. She’s fragile, John, no matter how tough she acts.” He clapped John on the shoulder before loping back to the plane and disappearing inside.</p><p>John, joined by the owner of the airstrip, ran to the bags and hauled them back to the Denali quickly as the Learjet began to taxi to its takeoff point.</p><p>The lights flared back on, and within less than a minute the small jet was airborne once again.</p><p>“Let’s load ’em up,” John called to the owner of the Dairy Farm whose private strip was often used for covert landings.</p><p>Raymond Hickley was one of those former friends John Walker Sr. rarely spoke of. Men who had helped him when he was younger, and were still there for him now that his children were in the county.</p><p>At fifty-five, still fit, and as redneck as they came, Raymond was proud to say he’d served his country without ever stepping off his farm.</p><p>John pulled open the back of the Denali and stored the luggage. He loaded the leather briefcase last, setting it to the side to ensure the x-rays it contained didn’t become bent.</p><p>“Dawg called while you were talking to your friend,” Raymond told him quietly after they loaded the luggage and the door was firmly closed. “He and his cousins and uncle will be at the houseboat this afternoon. He said don’t make them come looking for you. You should have known Dawg would glimpse that Lear landing and know whose it was. He’s smart like that.” The other man grinned at the warning he was relaying.</p><p>John grimaced. Just what he needed, a plague of Mackays descending on them.</p><p>At least they were waiting until afternoon. Enough time for him to get Sierra settled in and hopefully to catch a few hours’ sleep.</p><p>Opening the driver’s side door, he stepped into the vehicle, started it, then turned and stared at the too quiet young woman beside him.</p><p>“Well, lollipop.” He grinned at the nickname that suddenly snapped into his mind. The perverted reasoning behind it had his dick becoming instantly hard. “Looks like your running days are over, doesn’t it?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He glanced at her, relaxing now, a sense of sudden balance invading that. That last measure of restlessness was easing now. He had Sierra back. Come what may, for the moment, she was his.</p><p>Her lips thinned. “It’s nice to see you again, too, John.”</p><p>She stared straight ahead, like the perfect little mannequin despite the edge of nerves in her voice. She better be nervous, because he was damned upset that she had run as she had. If she had stayed, if she had faced him, she would have been here with him rather than in an apartment without protection when a rapist came looking for her.</p> <p>She likely wouldn’t admit it. Yet.</p><p>“I bet it is.” He grinned.</p><p>This might end up being fun. Hell, yes, he was going to make damned certain it was going to be fun. She had a whole lot of time to make up to him, he decided. A whole lot of pleasure to fit into a very short amount of time if he knew his father. And if there was one person he knew well, it was John Sr.</p><p>Maneuvering the Denali to the now empty airstrip, he hit the gas and raced down the clearing to the farm road at the end of the strip.</p><p>“Don’t worry, you’re going to have lots of fun,” he promised her. “I intend to make certain of it.”</p> <p>He could have sworn resignation pulled at her expression before it cleared once again.</p><p>She was quiet again. Too damned quiet. This wasn’t the Sierra he knew. She wasn’t quiet. She was either laughing or she was raging. There was rarely an in-between. Happy or angry, that was his Sierra. But this Sierra was a stranger. A woman who wasn’t even bothering to pretend to be the little troublemaker he had known all her life.</p><p>That was okay, though. Give him just another hour or so, and he was confident that the Sierra he knew would once again appear. He was going to make sure of it. If knew how to do anything, then he knew how to piss his Sierra off.</p><p>John’s father had told her that John was now living on a houseboat, but Sierra hadn’t exactly known what to expect when they pulled into the small Mackay Marina.</p><p>The houseboats there ranged in sizes, colors, and names, spreading out to the larger, almost home-sized crafts at the end of the docks.</p><p>“I can walk,” she informed him as he opened the passenger side and reached in for her. “There’s nothing wrong with my legs or my ability to move.”</p> <p>It hurt though. Walking for more than short distances could leave her breathless with the pain that shot through her bruised ribs.</p><p>“Nothing but the bruises that went bone deep, you mean?” he grunted as he lifted her in his arms anyway. “Don’t argue with me, lollipop. The walk to the Nauti Dreams is a long one and you’re not used to the shifting of the floating docks yet.”</p><p>He picked her up out of the seat, turned, bumped his shoulder into the door to close it, then hit the remote lock.</p><p>He did it all so seamlessly, with such male grace and effortless ease that Sierra nearly sighed in envy. No man should be able to move so smoothly. She was already at such a disadvantage with him, he didn’t have to make things worse.</p><p>“The bruises are getting better,” she muttered defensively, even though she knew they were still extreme.</p><p>“I’m sure they are.” The comment didn’t do much to stem the rising nervousness building inside her.</p><p>There were times over the years that she had sworn she knew John better than she should, and she knew he was angry right now. She could see it in the hard set of his jaw when she glanced up at his face, the glitter in his violet-blue eyes.</p><p>Those eyes should give him a feminine appearance, but they did more to maximize his masculinity instead.</p> <p>God, he’d changed so much. He wasn’t just darker, his hair lighter. His muscles were harder, his chest broader. She was beginning to wonder if he was even the same man she had known in Boston.</p><p>“Here we are.” He stepped confidently from the floating walkway to the deck of a two-story houseboat whose side was emblazoned with the words NAUTI WET DREAMS. The play on words would have had her eyes rolling if she weren’t so damned tired.</p><p>The sliding glass door swung open easily and John stepped inside to the dim, cool recess of the craft. Moving several steps to a large sectional couch, he set her down easily before staring down at her for long moments.</p><p>“Stay put,” he told her, his voice rougher than she remembered. “I’ll bring your luggage in then we’ll see about getting you some breakfast.”</p><p>“I don’t need breakfast.” She needed to sleep. Between preparing to leave, the stress, and the early morning flight, she was exhausted.</p><p>“You’ll eat it anyway,” he informed her, arrogance fairly oozing from his pores. “I’ll be right back.”</p><p>He would be right back, which meant she had very little time to shore up her defenses, and to hopefully find a way to keep her heart from being broken. Again.</p><p>THREE</p><p>John didn’t walk back to the Denali, he stomped. His heavy work boots pounded against the floating docks as he made his way back to dry land and the marina parking lot.</p><p>Her throat was still bruised. He could see the marks against her pale flesh.</p><p>His fists clenched at his side as he fought to breathe through the agonizing fury. It tore at his insides with a force that made him want to howl. Son of a bitch. He’d kill the bastard responsible if he ever had the chance.</p><p>She was tiny, so fucking petite. He could span her waist with his hands and likely have room left over. Large, marbled gray eyes stared back at the world with an innocence that made him wonder, considering the crowd she used to run with when she was younger and the rumors he heard, if his fantasy dreams of that night with her might be more reality than wishful dreaming. That long swath of blue-black ringlets that fell from her head only made her look more endearing, more fragile. So fragile he couldn’t believe the bastard that bruised her hadn’t managed to break her.</p><p>Sierra wasn’t a woman who could be handled with anything less than gentleness. A hard wind bruised her tender white skin, everyone who knew her, knew that. She often joked that she couldn’t walk through a room without marring her skin.</p><p>And it always hurt. She would pout if she bumped against something, rub the offended flesh, and glare at it as though the weakness irritated her.</p><p>She was strong-willed as hell though, so he’d always thought it evened out. She would stand up to anyone, nose to nose, and had on occasion, out argued even John’s father. That wasn’t easy to do.</p><p>John couldn’t handle the emotions rising inside him at the moment, the thought of the attempt that had been made to hurt her. To destroy her. The pure anger. The need to go to his knees before her and kiss every inch of bruised flesh, to beg for her forgiveness for not being there to protect her. The need to demand explanations, to beg that she stay, to simply hold her, was tearing him apart.</p><p>He’d never had so many emotions surging through him. For a man that prided himself on his control, he was growing close to losing it. Because despite the bruises, he wanted her. He wanted to touch her, kiss her from head to toe, show her all the gentleness he could find within himself, and he wanted to fuck her until they were both screaming from the pleasure.</p><p>She was too damned young, he kept telling himself. Her gentle twenty-four was a far cry from his thirty-two. But she was his.</p><p>The thought implanted itself in his brain and he refused to let it go. Sierra was his.</p><p>“Hey, John.” The sound of Rowdy Mackay’s voice calling out had him pausing, his jaw clenching before he turned back to the other man before stepping from the dock to the parking lot.</p><p>Rowdy loped from the entrance of the marina to the parking area, his eyes hidden behind dark sunglasses but John knew the other man was likely processing every telltale emotion John couldn’t keep from his face.</p><p>“Hey, man, you were out early this morning,” Rowdy stated as he pulled up to him.</p><p>“I was,” John agreed as he continued to the SUV.</p><p>“Dawg said he saw your rig out at Hickley’s, meeting an unscheduled landing. You have problems?”</p><p>There it was. The Mackays weren’t just notoriously nosy, but also notoriously protective of their friends. And they considered John and his sister Rogue, friends.</p><p>It wouldn’t do any good to keep the truth from the other man; John knew him. Dawg was likely already running the Lear’s call numbers, ownership, and flight plan.</p><p>Stepping to the SUV, he leaned against it wearily and gave the other man the information he knew Rowdy would come up with eventually.</p><p>Besides, letting the Mackay cousins in on the truth would provide Sierra with an added layer of protection.</p><p>As he explained the situation, Rowdy drew the sunglasses from his eyes, his gaze narrowing, lips thinning as tiny sparks of anger filled his sea green eyes.</p><p>The information would hit too close to home for Rowdy. His wife had suffered at the hands of a stalker, a man they had trusted. One who had nearly raped Kelly while Rowdy was in the Marines.</p><p>John knew the other man still blamed himself for being away, for not protecting her.</p><p>Just as John blamed himself now because he hadn’t been there to protect Sierra.</p><p>What the fuck was happening to the world, he wondered. A woman wasn’t safe, no matter where she went, no matter what she did. There were simply too many men determined to prey upon them.</p><p>“How close did the bastard come to raping her?” Rowdy’s voice edged with latent violence.</p><p>“Her roommate frightened him off before he actually raped her. Her thighs, breasts, and neck are bruised extensively. I can see her neck . . .” He turned away, his jaw tightening as the guilt threatened to eat him alive. “Hell, Rowdy, I shouldn’t have left. God her neck . . .” He swallowed tightly. “That bastard nearly killed her.”</p><p>“Hindsight, bro,” Rowdy sighed. “That guilt will always follow you. You have to find a way to cover it, to bury it, or you’ll never live with it. And make damned sure it never happens again.”</p><p>Livid pain gleamed in Rowdy’s deep green eyes as John turned back to him.</p><p>“Kelly doesn’t sleep well if I’m not there with her, at least in the house at night,” he stated, his voice rough. “I never forget how close I came to losing her, and I never forget how important her and our child are to me.”</p><p>“Dad did his best to ensure no one knows where she is,” he informed the other man. “We’re hoping that gives him the time to figure out who attacked her. But like Dad, I have this feeling . . .”</p><p>And it was in his gut. The first time he had ever had the feeling his father described. The sensation of a phantom blade across his gut.</p><p>John stared out over the marina, his gaze moving instinctively to the houseboat where Sierra was awaiting him.</p><p>“She’s still in danger, then.” Rowdy nodded. “You have it bad man, if you can sense that. The only woman that ever triggered that response in me was Kelly. She keeps me breathing. Be damned careful, because if she leaves you, I don’t imagine breathing would be easy.”</p><p>No, it wouldn’t be. He didn’t have to wait to know that. He could already sense it. He’d already experienced the feeling a year before when he’d left town, walked out of her life. Now that he was back, he realized exactly how hard breathing had been without her.</p><p>He’d always known, in part, how important she was to him, but until that hazy night a year before, until she ran from him, he hadn’t realized how deep that importance ran.</p><p>“Let’s get this luggage to the Dreams,” the other man finally stated. “I’d say you can expect the family to descend on her soon, so save time somewhere, somehow while you’re convincing her to stay.” The snicker in Rowdy’s voice assured John that the fact that John was dying to touch her wasn’t lost on him.</p><p>Sierra hadn’t packed much. There were two suitcases, the briefcase, and a small box that he knew held all the family pictures she owned.</p><p>Sierra didn’t own much; since her father’s bankruptcy and death, there hadn’t been much for her to own. Getting back on her feet had been hard, and Sierra was a saver rather than a spender. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The small amount of furniture she owned was in storage, overseen by John’s father. The rest of her belongings had been packed and sent to her, as though John Sr. knew his son wasn’t going to allow her to leave easily.</p><p>And he wouldn’t.</p><p>Stepping back into the living area of the houseboat, he quirked his lips at the sight of her sleeping, stretched out on the couch. The second Rowdy stepped inside, she was awake.</p> <p>Just that quickly she sat up, eyes wide, a hint of fear and pain glowing in the marbled gray depths until she caught sight of John once again.</p><p>“Sierra Lucas, Rowdy Mackay,” he introduced the two of them as he carried his half of the luggage to the steps leading to the master suite on the upper level.</p><p>“Ma’am.” Rowdy nodded as he passed her. “Just excuse me, John decided he needed a pack mule this morning.”</p><p>Laughter echoed in the other man’s voice as he followed John and they moved upstairs with the luggage.</p><p>Rowdy sat the luggage by the bed and turned to John. In the other man’s eyes Rowdy saw all the demons that had haunted him when he realized Kelly had been hurt while he was away from her.</p> <p>He saw the torment and knew the agony his friend was feeling.</p><p>“Damn, she’s fucking tiny,” Rowdy hissed, anger flaring inside him. “She’s even smaller than Kelly, John. How the hell did she survive an attacker?”</p><p>“Sheer stubbornness,” John sighed as he shook his head and placed the items he carried on the floor. “Hell, Rowdy, I haven’t slept since Dad told me about it. The nightmares will haunt me.”</p><p>And they would, Rowdy knew that. There was no way for a man to ever go back once he realized he’d left his woman unprotected, and she had been harmed.</p><p>John had marked that woman for his own before he left Boston. A man who had left something important behind just had an air of loss around him. It was an air John no longer possessed. What he possessed instead was the pain of knowledge, the awareness that he hadn’t kept her from harm.</p><p>“You sleep better when she’s with you.” He slept better now that Kelly was in his arms than he had his entire life. “But I saw her eyes, bro. She doesn’t seem as smitten quite yet.”</p> <p>John would have his work cut out for him. Rowdy had seen the look she gave John. She was angry. There was a glitter of stubbornness, of pure feminine determination to make this as hard as possible on the other man.</p><p>Whatever had happened before John moved to Lake Cumberland, it had to do with this woman. And she wasn’t in the least happy with him over it.</p><p>Once he couldn’t see the bruises on the girl’s throat, then Rowdy was certain he would find John’s predicament amusing.</p><p>“I’ll get out of here and let you take care of this then.” Rowdy nodded. “I’ll let the others know what’s going on and we’ll see what we can do to catch the bastard if he’s stupid enough to try to follow her.”</p><p>God help any man that tried to hurt Sierra Lucas where John Walker or one of the Mackays could get hold of him. Nothing but death awaited such stupidity.</p><p>As they returned downstairs, Sierra was still sitting on the couch, but watching the stairs warily.</p><p>“Later, Rowdy.” John all but ordered him off the houseboat. He couldn’t bear seeing that fear in her eyes for so much as a second longer.</p><p>“Catch you later, John, and remember what I told you.” Rowdy paused at the glass sliding door. “The family will be around soon. Babies and all.” With that, he slid open the door, stepped outside, and headed back to the marina.</p> <p>“What was that all about?” she asked as he moved into the kitchen.</p><p>“That means to expect the Mackay horde to descend upon us at any time,” he grunted. “Rowdy’s parents, cousins, their wives and babies. It’s worse than Thanksgiving dinner at the grandparents’ house.” And she knew exactly what those were like, since she had attended enough of them.</p><p>“You didn’t make friends that easily in Boston,” she said softly. “I guess I thought you were playing hermit here in Kentucky as well.”</p><p>“Only when they let me.” John watched her intently, debating on breakfast or hauling her straight to bed. She looked exhausted. “What time did you get up this morning for the flight?”</p><p>She shrugged. “I didn’t sleep well, so I was up in plenty of time.”</p><p>Meaning nightmares had kept her awake.</p><p>John’s jaw clenched. Breakfast, then bed.</p><p>“Why did you agree to this, John?” she finally asked as he pulled eggs from the fridge. “I’m not your responsibility, you know.”</p><p>Not his responsibility? Fuck that. She belonged to him, she just didn’t know it yet. That made her fully his responsibility whether she wanted to admit it or not.</p><p>“We’ll discuss that later, Sierra.”</p><p>“I don’t want to discuss it later. I want to discuss it now.” She rose to her feet and he noticed the small wince she almost hid.</p><p>His lips quirked. He could hear the nervousness in her voice, but he could also detect the knowledge in it. She knew exactly what he wanted from her.</p><p>“Lollipop, now isn’t the time.”</p><p>“And why are you calling me that horrendous name?” Exasperation filled her voice.</p><p>This time, he couldn’t stop the grin that curled at his lips.</p><p>“Lollipop? Because you’re so damned sweet to lick and suck on. And I think I developed an addiction that night, lollipop. I want more. A whole lot more.”</p><p>The statement stopped Sierra in her tracks as she began to stalk across the room to him. She swore every erogenous zone in her body jumped into hyperdrive, and every spark of anger he could have possibly ignited flared inside her as well.</p><p>He spoke as though he remembered it. As though it possibly meant something to him? She doubted very seriously he had a clue.</p><p>“How would you know? You passed out.”</p><p>“Right between the sweetest thighs I think I’ve ever had surrounding my face.” He grinned rakishly. “I remember that part, baby, just before passing out. Licking the sweetest, hottest little pussy I think I’ve ever had my mouth on.”</p><p>So that was the last thing he remembered? Asshole. He didn’t even remember kneeling between her thighs, taking her, then passing out.</p><p>“So you think I’m just going to be your little plaything while I’m here?”</p><p>The idea actually had its merits. Of a limited variety anyway. She could feel her breasts swelling, her thighs tightening, her pussy flushing and dampening.</p><p>Her clit was so sensitive now she wondered if she could come as she stepped closer to the kitchen.</p><p>Being John’s plaything would introduce her to a world of supreme pleasure, unfortunately, it would also include a world of heartache unlike anything she wanted to deal with.</p><p>Her heart had already been broken, she preferred that the parts still intact, stayed that way.</p><p>“I could handle that,” he agreed as though the thought had never occurred to him.</p><p>“Oh, I bet you could.” Her arms crossed her breasts despite the tenderness there. “Too bad it’s not going to happen.”</p><p>And to that, he laughed. The rich, dark male sound ricocheted up her spine and sent shivers of anticipated pleasure racing through her body. She knew that sound. Sexy, filled with intent. But she had never heard it turned on her before now.</p><p>“Sweet Sierra,” he sighed as though with relish. “You think you can sleep in my bed night after night, put up with me holding you, touching you, and still deny me?”</p><p>“I’m not sleeping in your bed.” The very thought of it was more dangerous than she wanted to contemplate.</p><p>“Sorry, but that’s exactly where you’re sleeping.” A pan slid on the stove, and as though they were discussing nothing more than the weather, he began making breakfast. Enough breakfast to feed an army.</p><p>Sierra could only stare back at him in shock. Unfortunately, she knew John too well, and she knew that tone of voice. Finding an argument against him wasn’t going to be easy.</p><p>“You think only weeks after that attack that I want any man in my bed?” The words popped out of her mouth before she could stop them.</p><p>For a second, she could feel the fear tearing through her, but only for a second, quite simply because she knew John was the last man in the world that would ever harm her.</p><p>It wouldn’t matter how angry he was with her, it wouldn’t matter what she had done. He would never harm her.</p><p>“No, I don’t think you want any man at all,” he agreed much too easily. “But I’m not just any man, lollipop, I’m the man you actually want.”</p><p>The sheer audacity, the supreme confidence, in his voice had her lips parting in momentary, complete surprise. The problem with that surprise was the fact that he was right. Of all the men in the world, John was the one she would never stop wanting, the one she would never stop aching for. The one she would never fear would hurt her physically.</p><p>She watched silently as he scrambled eggs and made toast, trying to come up with an effective argument. One that would ensure he would stay out of the bed with her, one that would aid her in keeping secret the sheer depth of hunger that arose in her where he was concerned.</p><p>God help her if he actually touched her while he was sober. If he didn’t pass out and forget all the important parts. She didn’t know if she could bear allowing him to possess her, to know what he was taking from her, only to send her on her way when this was finished.</p><p>“You overrate yourself.” And that had to be the lousiest comeback that she could have let slip past her lips.</p><p>It was met with a small, confident grin. “We’ll find out later,” he promised her. “Once I have you in my bed and I see how deep those bruises are, how much loving you can take. But be prepared, Sierra, you’re sharing my bed, and I’ll touch you when I want to, when I need to. You might have run before, but I think we both know your running days are over here.”</p><p>Her running days were over?</p><p>Did he even have a clue how hard it was to stay away from him? How she had cried each time she had ignored his messages, how she had grieved when he had left Boston.</p><p>Damn him. He had broken her heart that night and had no idea what he had done to her. Just as he had no idea that he had taken her innocence a second before he passed out on top of her.</p><p>The bastard!</p><p>But she couldn’t deny him, either.</p><p>She knew damned good and well that she wouldn’t make it an hour in the bed with him without giving in to the needs he aroused in her.</p><p>Oh, a perverse, angry part of her wanted to. She wanted to throw his offer back in his face and show him exactly how easily she could refuse him. The problem was, as angry as he made her, as much as he hurt her, she didn’t want to refuse him. Her body didn’t want to refuse him.</p><p>She remembered the pleasure just as vividly as she remembered the heartache, and she wanted more. More pleasure. More touch. More of those lethal kisses, and that would require more of the pain as well.</p><p>Could she hold on to what was left of her heart and still give in to him?</p><p>There wasn’t a chance. He would destroy her and she was going to let him do it.</p><p>“You didn’t do enough to me while you were in Boston, did you, John?” she asked him softly. “You didn’t hurt me enough, right?”</p><p>“What did I do to you, Sierra?” Confusion crossed his face, filled his eyes. “I kissed you, I touched you. We nearly had sex and then you ran off. You didn’t give me much of a chance after that to do anything.”</p><p>“And I don’t intend to give you a chance to do anything now,” she warned him, despite the fact that she could barely breathe for the erotic implications running through her mind. “I can sleep just fine on the couch.”</p><p>Damn him. Every nerve ending in her body was rioting at the thought of him touching her, finally finishing what he had begun that night a year ago. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>But she had learned something that night, something about herself at least. She had learned that she wanted more from John than his kisses, his touches. Once, she had thought it would be enough, if that was all she could have. It wouldn’t be, though. He would rip her heart from her chest, leaving her lost and alone. As lost and alone as she had been when she learned he had left Boston.</p><p>No, she wanted John’s heart.</p><p>“Couch won’t do, baby.” He was shaking his head as he fixed breakfast, his broad back to her.</p> <p>John had been lean, metro muscular rather than bulky. He had been strong before, but as she watched him move, watched the muscles in his back and shoulders shift, she realized his body had changed more than she had once suspected.</p><p>Those muscles were now tight, hard, powerful. She wondered what it would feel like if she ran her hands over them, dug her nails into them.</p><p>“You’re making my dick hard staring at me like that,” he stated without turning around.</p><p>Sierra almost lost her breath at the husky, controlled lust in his voice.</p><p>“What makes you think you’re worth looking at, dummy,” she snapped out angrily.</p> <p>He chuckled and the sound went straight to her thighs, tightened them, then zipped to her womb with a blast of heat. Damn him, she could feel her juices flooding her pussy, her inner muscles tightening, clenching in hunger.</p><p>“I can feel you looking at me. I’ve always been able to feel you looking at me.” By the sound of his voice, it wasn’t an admission he particularly liked.</p><p>“It’s called killing looks,” she informed him as she moved to the bar to watch him more closely. “Most of the time I slap you upside the head with something.”</p><p>He flashed her a grin. A charming, rakish grin that had the butterflies in her stomach doing cartwheels in arousal.</p><p>“That doesn’t explain why it’s always felt like a very intimate stroke, now does it, darlin’? Personally, I think you’ve wanted to be in my bed for years.”</p><p>He knew she had.</p> <p>John turned back to the stove for the simple reason that if he kept looking at her, breakfast would burn and his dick would likely rip right through his jeans.</p><p>He should have realized years ago what was going on with her, but he hadn’t. Just as he should have realized what was going on with him.</p><p>Half the time he’d either been angry with her, or perplexed by the fact that she affected him. He’d done everything to excuse his arousal around her, from the very convincing lie that she was simply a pretty woman and he was too damned sexual, as most of his lovers accused him of being.</p><p>The fact of the matter was, he’d wanted her. She’d been a part of his life since she was little, so admitting it hadn’t been easy. Until the night his pretty little Sierra had rescued him from a life in a frozen marriage with Marlena, he hadn’t wanted to face exactly what she had been doing to him since she hit the tender age of eighteen.</p><p>“Personally, I think bumming around in the mountains has rotted what little brains you had left in your head,” she snapped back.</p><p>He didn’t have to look at her to realize her gray eyes were lit with equal parts anger and arousal. Hell, he could hear it in her voice, he could feel it flaming in the air around them.</p><p>He glanced back at her anyway, and hell, he should have kept his eyes on the food. His gaze was drawn instantly to the small imprint of her nipples beneath her blouse.</p><p>She wasn’t wearing a bra.</p> <p>He’d realized that earlier, and it made sense that she wasn’t. If the bruises were as bad as he’d learned, and he had no doubt they were, then a bra would have been extremely painful.</p><p>Without a bra, he could see his effect on her, though, and the thought of getting her nipples in his mouth again had his cock throbbing in response.</p><p>He could feel the sweat beading on his forehead as he jerked his gaze back to the bacon frying and almost cursed before flipping it quickly.</p><p>Yep, she was going to make him burn her breakfast, and he didn’t want to do that. She needed a good meal and plenty of sleep.</p><p>“Don’t you have drugs to take before you eat?” he asked, changing the subject quickly.</p><p>“I don’t like taking them.” There was a mutinous tone to her voice. “They make me dopey.”</p><p>“They make you heal, now take them.” He wasn’t arguing with her where her health was concerned. “Dad has a doctor lined up for you, he’s a good man. He’ll be here tomorrow afternoon. You can discuss the prescription with him. Until then, take the medicine.”</p><p>He laid the bacon out on a plate, slid the skillet back, and turned to look at her.</p><p>Her arms were crossed over her breasts, her eyes narrowed.</p><p>“You can’t make me,” she informed him, her chin tilted stubbornly.</p><p>John sighed at that. “Do you really want this fight, Sierra? Over something as important as your health? Take the pills, or I won’t let up. I’ll harass. I’ll bitch. I’ll call Rowdy, and his dad and stepmother will come to the boat, and trust me, Ray can be a bigger mother hen than Dad is. If that doesn’t work, then I’ll call Rowdy’s cousins and wives in. They’ll bring the babies, and won’t let you hold them. They’ll frown, they’ll advise . . .”</p><p>“Stop already!” Her hands went in the air as she turned, stalked to her purse, and pulled out the bottle as he grabbed water from the fridge and set it on the bar for her after opening it.</p><p>She was too sore to stomp back, but she tried. She did take her medication, though, glaring at him every second. He could see so much in her expressive face, emotions and needs that infuriated and drew him. Infuriated him because he should have seen them all along.</p><p>“I’ll make you pay for this,” she warned him furiously. “See if I don’t.”</p><p>“As long as you’re healthy enough to attempt it.” He shrugged with a grin. “Then you have my permission to try.”</p><p>“Try to knock some sense in your head,” she muttered as she sat down gingerly on one of the bar stools. “You’re a pain in the ass, John.”</p><p>“Not yet,” he promised, and the thought of that sweet ass nearly took his breath. “But I will be. I promise, lollipop. I will be.”</p><p>FOUR</p><p>Breakfast was eaten in a strained silence. Sierra could almost feel the clock ticking, the knowledge that once the meal was finished, she wouldn’t be able to fight his insistence that she go to bed.</p><p>She was so tired, and the medication only made the weariness sink deeper inside her.</p><p>The doctor had warned her that she needed to sleep as often as possible, to rest and recuperate. Whoever had attacked her, for whatever reason, had been strong. Strong enough that the blows to her thighs as she fought him had gone incredibly deep, not to mention the hold that had left the prints of his fingers in her flesh.</p><p>Her breasts were still so tender she couldn’t bear a bra, and her ribs ached. She hadn’t simply been groped roughly, she’d been struck, gloved fists striking her body as she fought and screamed.</p><p>Forcing the memory back wasn’t easy. The pain medication made it harder to do. It was one of the reasons she hated taking it.</p><p>“Come on, you’re falling asleep where you’re sitting,” John announced as he rose from his chair and collected her dishes. “You need to rest.”</p><p>It was the middle of the morning and she would probably end up sleeping the day away. She hated doing that. The sun was bright, it was warm and clear, and the breeze off the water was invigorating. She would have loved to be able to lie out on the upper deck and soak up the healing rays of the sun.</p><p>“Come on, darlin’.” Sierra’s chest clenched at the gentle sound of his voice as he moved to her chair as though he were going to carry her again.</p><p>“I wish everyone would just stop trying to tote me around like a damned newborn.” Rising from the chair gingerly, she took a deep breath and would have glared at him if her eyes didn’t feel so heavy. “I’m sore, not broken.”</p><p>She hated feeling helpless, and she couldn’t afford to be in his arms again. Being in his arms meant feeling the strength of them, the warmth of them, and remembering too clearly what she had almost had.</p><p>“You worry me with your stubbornness, Sierra,” he growled, but he didn’t try to pick her up. Instead he stayed close until she moved for the couch. “Try to lie down on that couch, and I’m going to carry you straight up those stairs anyway. I told you. You’re sleeping with me.”</p><p>He hadn’t had a nickel’s worth of sleep since his father had called the day before. He’d lain awake most of the night imagining the horror she must have felt the night she was attacked. It had kept him from sleeping, kept him from enjoying the peace of the summer night.</p><p>He wanted her in his arms. Hell, he’d nearly driven to Boston and simply picked her up rather than waiting for his sister to deliver her.</p><p>“I’m calling your father,” she muttered, but she turned and headed for the stairs. “I’m going to tell him you’ve turned into a bully.”</p><p>“He’ll understand completely,” he assured her, his lips almost twitching at the little feminine snort of displeasure that she gave him.</p><p>She made it up the stairs, but by time she walked into the luxurious bedroom, it was obvious she was more exhausted than before.</p><p>“Strip.” He could see her intent to lie down in that bed fully clothed.</p><p>Moving to the larger-than-king-sized bed, he pulled back the comforter and sheets then turned and looked at her once again.</p><p>She was staring at him with wounded gray eyes.</p><p>“Why, John?” she sighed. “What does it matter?”</p><p>“Because some bastard dared to abuse what I consider mine,” he snarled, surprising himself with the vehemence in his tone. “I want to see what he did, Sierra. I want to know so that when I get my hands on him, I’ll know exactly what I owe him.”</p><p>Sierra stared back at him, some hidden, previously unknown part of her soul beginning to relax. She had known John would never hurt her. He would never let anyone else hurt her, but now it seemed something deeper inside her recognized that as well.</p><p>Licking her lips, she gripped the hem of her T-shirt and tried not to wince as she drew it over her head. She wore no bra, nothing to hide the bruises that still marked her flesh.</p><p>Her flesh marked easily; it always had. And bruises remained for what seemed like forever on her skin. Two weeks, and the black and blue marks still looked almost fresh.</p><p>She ignored John, refusing to look into his face as she toed her sneakers from her feet and then slid her jeans from her hips and down her legs.</p><p>She wore panties, but the soft, pale cream silk was little protection.</p><p>“Someone’s going to die.”</p><p>The sound of his voice had her gaze jerking to his face. Violet-blue eyes were raging with fury, his expression dark, forbidding, as Sierra felt tears come to her eyes.</p><p>“I fought,” she whispered, suddenly shaking, her voice trembling. “You always told me to fight, John. I fought . . .” She’d fought as hard as she could. She’d screamed, she’d ignored the pain. All she could think was that a stranger was trying to steal from her one of the most vital choices she could make.</p><p>“My God! Baby.” A few steps and he was in front of her, lifting her into his arms despite the fact that she had asked him not to carry her.</p><p>He had lifted her, only to lay her carefully on the bed before sitting beside her, his hands gently lifting her arms until they were stretched above her head.</p><p>John could feel a burning agony tearing through him. He should have never left Boston. Not so soon. He should have forced her to see him, found a way past her stubbornness. He should have been there to protect her.</p><p>With the backs of his fingers, he stroked down the underside of her arms and the purple marks that led to her full, hard-tipped breasts. Harsh finger marks marred her flesh, but her nipples, so sweet and tight and hard, were the same tender pink, unbruised and tempting as hell. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Below her breasts were fainter bruises, where she’d been struck, though the blows hadn’t connected as hard as he knew they were meant to. He could tell by the placement that the son of a bitch had been trying to damage her ribs.</p><p>Lower, along her rounded thighs, was heavier bruising. Finger marks, thumb imprints.</p><p>He parted her thighs gently, trying to ignore the dampness he could see against the silk of her panties. Trying real fucking hard to ignore the fact that there were no curls beneath the silk.</p><p>He hadn’t remembered that for some reason. He’d had his mouth on her pussy, licking it like a starving man devouring a treat, but he hadn’t remembered that there had been no curls there.</p><p>Drawing in a hard, deep breath, he slid his fingers beneath the band of her panties before he lifted his eyes to hers. “Let me take them off, Sierra.”</p><p>Her hips rose. Hazy sensuality filled her gaze now, flushed her face. Pert lips parted, a lazy pink tongue licked over them with a slow, damp stroke as he drew the silk from her body.</p><p>“God, I’ve dreamed about this for a fucking year,” he whispered.</p><p>For far longer than a year. He’d dreamed before and refused to allow himself to acknowledge those dreams.</p><p>“John, touch me.” The plea went straight to his cock.</p><p>Why the hell did he keep hearing innocence in her voice, seeing it in her eyes? When he stared into the slate gray depths, he saw a woman who had no idea the pleasure her body could experience, the heights arousal could take her.</p><p>His gaze went down her body once again, a groan tearing from his throat at the sight of the honeyed glaze glistening on the folds of her pussy. Her clit, a sweet pink little pearl, peeked from between those folds, tempting his lips, his tongue.</p><p>“You don’t know what you do to a man,” he growled as he moved closer, leaning over her until his lips could brush against hers. “You make me hungry, lollipop.”</p><p>A slow smile curled the lips beneath his. “Your lollipop?”</p><p>Hell! He wasn’t going to survive this. The low, sleepy sensuality in her face and voice was more than he could bear.</p><p>“My lollipop.” And he’d be damned if he let another man have a taste of it now.</p><p>His lips lowered against hers more firmly, his tongue licking at the seam of her lips until they parted for him, until her tongue came out to meet his and a low, feminine groan met his kiss.</p><p>God, he remembered her kiss. Of all the things he remembered from that alcohol-hazed memory of nearly having it, it was the taste of her kiss. Like the sweetest innocence.</p><p>How the hell did she manage it? She’d dated more men than he could name over the years. There was no way that innocence was as pure as it seemed.</p><p>He’d be damned if he cared, though. Hell, he wasn’t exactly a virgin himself and he didn’t expect to ever encounter one. He didn’t give a damn. From here on out, she would belong solely to him, though; he’d ensure it.</p><p>Threading his fingers into the thick, blue-black curls that framed her face, John held her in place and deepened the kiss. His tongue sank into her mouth, touched hers, and felt her lips close on it with a sensual grip. She suckled at his tongue with lazy enjoyment, causing his dick to clench and tighten at the memory of her lips sucking him there as well.</p><p>Damn, she was making him hot. He should have turned the AC up before bringing her to the bedroom.</p><p>The sweet brush of her nipples seared through the material of his T-shirt as she arched against him. Full, swollen breasts were cushioned against his chest, and the heat of them rushed through his body like a narcotic.</p> <p>He couldn’t think of anything better than releasing his dick and sinking balls deep inside the tight, slick depths of her pussy.</p><p>For just a second, for one flash of imagery, he could have sworn he’d done so before. Felt her, so fucking tight he thought he’d die from it. Then it was gone, remnants of dreams he’d had over the years. Fantasies he hadn’t been able to help.</p><p>Tearing his lips from hers, John set about giving her pleasure. Simply pleasure. No pressure. This time wasn’t for him, it was for his Sierra.</p><p>She’d been hurt, bruised, almost broken. He wanted to wipe that memory from her mind. Wipe it and replace it with sweet pleasure, with satisfaction. He wanted her to know gentleness, to know the heated arousal, the warmth of sexual fulfillment.</p><p>She was exhausted, worn, but he knew she didn’t sleep well. That was something he intended to help her with this morning.</p><p>Sierra barely restrained the cry that would have torn from her lips as John’s lips moved down her throat to the rise of her breasts. Her entire body was sensitized, but strangely, she couldn’t feel the pain.</p><p>There was no pain.</p><p>There was only John’s touch, the feel of his lips and tongue stroking their way to a nipple as it rose hard and tight for his lips.</p><p>“Don’t tease me, John,” she moaned, arching closer to his lips, desperate to feel them enclosing her nipple.</p><p>“You’ve teased me,” he whispered, pure sex filling his voice. “For a year, Sierra, the thought of your touch has teased me to near insanity.”</p><p>His head lowered, the feel of his tongue licking around the sensitive, hard tip of one nipple, stole her breath. The damp warmth stroked sensations through the flesh that sent her senses spinning.</p><p>Slow, deliberate licks, each one avoiding the nipple, stroking around it, teasing her so unbearably that her hands slid into his hair to hold him to her.</p><p>Which was more destructive? she wondered. Those lazy licks, or if he actually took her nipple into his mouth?</p><p>She had no idea of the answer to that question, but she wanted to know it.</p><p>Before she could voice the demand, the plea, his lips covered the tender peak, sucking inside his mouth as the nerve endings began to riot chaotically.</p><p>Sierra could feel her nipples becoming impossibly harder. The tender tip he held between his lips throbbed and ached, ecstasy spiking through it and slicing to her womb as he sucked it harder.</p><p>Rubbing his tongue against it a murmured growl of approval rumbled in his chest as she arched, trying to get closer, fighting to press deeper into his mouth.</p><p>The feel of his shoulders, the muscles shifting and bunching beneath her hands, had her nails digging into the flesh as his tongue licked over nipple again.</p><p>The suction of his mouth combined with the lash of his tongue against the nerve-ridden tip had a cry tearing from her lips. He sucked her harder now, deeper, his tongue whipping over the sensitive tip with such destructive pleasure that she felt her senses rushing out of control.</p><p>Her hips arched, her thighs opening wider as she pressed the wet, aching heat of the enflamed folds against the hard strength of his thigh and rode it in pleasure.</p><p>He had to know how desperate she was for his touch now. How desperate she had always been. There was no disguising it at this point. No matter how much she wished she could fight against it, it was still overwhelming.</p><p>“John,” she panted his name as his hand slid from her waist to her bare thigh. “What are you trying to do to me?”</p><p>She was so wet she could feel her juices collecting thick and heavy on the bare folds of her pussy as he moved back, holding her still with one hand as the other caressed and stroked. His fingers stroked along her thigh, growing closer as his lips moved to her other nipple, enclosing it in the heat of his mouth as she arched and allowed her thighs to fall wider apart. She needed his fingers closer to her aching flesh, to the pulsing heat of her clit.</p><p>As his lips drew on her nipple, his fingers found the delicate knot of tissue, surrounded it, and oh so delicately began to milk the little kernel.</p><p>Sierra’s eyes widened. Her thighs tightened until she could feel the muscles straining, trembling. She could feel the orgasm rising inside her. She could feel it pulsing, pounding through her senses, riding a wave filled with heat and desperation.</p><p>What the hell was he doing to her?</p><p>She strained, trying to lift closer as he milked her clit with slow, firm strokes. Strokes that edged pleasure-pain, that had her body straining in pleasure.</p><p>“John . . .” she panted his name, her head thrashing in desperation.</p><p>Sierra could feel her juices easing from the flesh between her thighs, a thick, heavy dew, coating the intimate folds, preparing her flesh for a penetration she felt as though she were dying for.</p><p>Lifting his head slowly, John stared back at Sierra’s dazed features. He licked one nipple, then the other, feeling her shudder in response as he continued the delicate plumping of her swollen clit.</p><p>She was so fucking close to orgasm. So close he could nearly taste it spilling to his lips.</p><p>“I remember tasting you that night, Sierra,” he groaned as he began kissing his way down her torso, loving the sweet-salty taste of the perspiration lying on her skin. “The feel of my tongue inside your pussy, feeling how snug and hot you are. I swear, the taste of you haunts me.”</p><p>She jerked in his grip, hips arching, nails pricking his shoulders as his lips neared the silken, flushed, glazed mound of her pussy.</p><p>Damn. He was going to enjoy this. He was going to make sure she enjoyed it.</p><p>This was his sweet. His treat.</p><p>His tongue slipped inside the narrow slit, and in one long, slow lick he swore he became drunk on her. The taste of her exploded against his tongue like spicy honey, like addictive, sensual nectar.</p><p>Sierra felt a rage of heat rush through her pussy. His tongue licked, lapped slow and easy, circling her clit gently, too gently. She strained against him, needing a firmer touch, more heat to trigger the explosion she was reaching so desperately for.</p><p>Knees rising, heels digging into the mattress, she ground the intimate folds against his lips, her fingers twining into his hair, and she fought to breathe. Heat rushed around her, perspiration dampened her flesh, making her body almost as slick as the folds John caressed so intimately.</p><p>His tongue was wicked, destructive. Licking around her clit one last time, he moved lower, his fingers parting her bare folds and moving ever closer to the aching center of her pussy.</p><p>“Yes,” she whispered. “Oh God, John, please . . .”</p><p>Her head thrashed against the mattress and still he gave her no mercy. He licked against the entrance, increasing the dampness moving from her vagina to his eager tongue.</p><p>Her hips moved, rotating against his lips as she gasped, reaching, fighting for that explosion of pleasure that she knew he could give her.</p><p>It had been so long.</p><p>So many dark, lonely months with nothing but the memory of his touch, nothing but the memory of his pleasure.</p><p>Sierra could feel desperation rising inside her. Pleasure burned through her body, tore through her senses.</p><p>“Damn you, let me come already!” The cry was ragged, pleading, demanding.</p><p>John tensed between her thighs, his hand clamping on her upper legs, drawing them farther apart a second before his tongue plunged into the liquid hot, clenching depths of her pussy.</p><p>Almost. Almost.</p><p>Sensation washed over her like a tidal wave. Sierra held her breath, fighting to ride that sensual edge as his tongue began to move inside her. Thrusting, plunging, fucking into the slickened depths as Sierra began to writhe beneath him. She couldn’t lie still. She had to orgasm. If she didn’t, she wouldn’t, couldn’t, survive it.</p><p>Crying out his name, she felt his tongue ease from her, his lips moving, covering her clit and sucking it into his mouth again. He drew on it, his tongue lashed around it, until the explosion that rocked her drew a strangled, ecstatic scream from her lips.</p><p>Her fingers tightened in his hair. Her thighs locked around his head, and as he sucked her deeper, two fingers pressed inside the spasming depths of her pussy and threw her higher.</p><p>She felt him fucking her with his fingers, plunging them inside her, pleasure and pain rushing through her, drawing muted screams of pleasure, tightened her body, lashing her senses with pure, absolute rapture until she swore she exploded into fragments.</p><p>She was pulsing, flames slowly easing, throbbing through her body as she felt his lips and tongue easing, stroking now rather than ravishing. Caressing rather than devouring until Sierra felt her senses slowly darkening. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Exhaustion raced through her with almost the same force of her orgasm. Before she knew it, it overwhelmed her, sucked her in a deep, dreamless void and forced her to sleep, to rest, to finally escape the loss that had been haunting her. The loss of the man who now held her once again.</p><p>FIVE</p><p>Sierra drifted awake slowly that evening, a sense of lazy contentment radiating through her at the feel of warmth along her back and the hard, male arm lying across her hips.</p> <p>She was on her side, her back tucked against his chest, the heavy width of his cock rising thick and heavy along the seam of her buttocks.</p><p>Full consciousness hadn’t taken hold yet, and she knew it. The feeling of adventurous sensuality was like a glow, bright and hot, heating her womb and sensitizing her flesh.</p><p>She was hungry for him. She hadn’t had enough. She had years and years of need to make up for, and very little time to do it in. She expected John’s father to call at any time to inform them that he knew who had attacked her and that he was in custody.</p><p>She was lying in his arms on borrowed time.</p><p>She should make the most of that time. She could be angry with him later. She could remember later all the reasons why she wasn’t supposed to be in his arms. But for this moment, she could be the woman she always wanted to be with him. A woman who knew what she wanted. The woman that could take him, love him, bind herself to his heart.</p> <p>It made sense.</p><p>Stretching, she rubbed against the hard length tucked against her buttocks, her breath catching as his fingers flattened against her abdomen and moved slowly to a full, sensitive breast.</p><p>His fingers cupped, his thumb stroked against her nipple, and when she laid her head back against his shoulder, turning her face up to him, his lips covered hers.</p><p>The lazy hunger built, moving through her like the low flames of a fire rapidly heating out of control.</p><p>The embers were blazing, the flames licking over her flesh, turning her into the sensualist she had always known she would be in his arms.</p><p>“I won’t be easy,” he groaned as he nipped at her lips. “Do you hear me, Sierra? This stops right now, or taking you won’t be done as gently as this first time should be.”</p> <p>“Hmm, it’s not the first time anyway,” she reminded him sleepily as she shifted against him, her thighs parting as she felt his cock nudge against her.</p><p>“The first time with me,” he growled.</p><p>“You don’t remember so well,” she whispered before her back arched and another cry left her lips.</p><p>The wide crest was parting her, stretching the entrance, pressing inside to complete the destructive possession he had begun a year before.</p><p>He wouldn’t stop this time, she assured herself as she felt him lift her leg and ease it back, over his. It opened her farther, allowing the hard flesh of his erection to penetrate deeper.</p><p>Holding on to his wrist, Sierra felt the low burn become a hard, controlled flame. Her hips shifted as she pressed back, her breathing rough, uneven as she felt him beginning to move inside her.</p><p>The entrance was a slow, rocking glide that penetrated her farther with each inward thrust of his hips. Each retreat had her crying out into the hungry kisses he took from her lips.</p><p>Tongues twined, fervent tastes became raging hunger as each second, each slow thrust buried him deeper, stretched her farther.</p> <p>Her fingers dug into his wrist as the fiery agony-ecstasy of the penetration razed through her senses like wildfire now.</p><p>“Damn, you’re fucking tight.” Tearing his lips from hers, he moved his hand from her breast to the hard kernel of her clit.</p><p>There, his fingers circled, stroked, and built the flames raging beneath her flesh.</p><p>“John.” She stretched against him, opening herself farther and taking more. More until she could feel her pussy burning with the invasion as her clit began to pound in an agonizing need for release.</p><p>Pushing back against him again, she felt the heavy thrust against her, inside her, and froze in shock. He was buried inside her now, fully, his balls pressing against her as she felt his cock throbbing inside her.</p><p>The fingers of one hand clenched into the sheets beneath them. She didn’t know whether to back farther against him, stroking him deeper inside her, or to thrust her clit closer against his fingers.</p><p>“Sierra, I can’t do it this easy,” he groaned.</p><p>“This is easy?” she panted. There was nothing easy about this. She was so full, stretched to the point that the burning of her flesh blended with the pleasure, creating a conflagration of sensations that threatened to drive her insane.</p><p>“Ah, hell.” He pulled back, thrust.</p><p>Sierra jerked and arched, her body suddenly so hungry for the pleasure-pain of that hard penetration that she was shaking in reaction.</p><p>He moved, pushing her farther to her stomach as he came over her, arms braced at her shoulders, his knees bracketing her hips as he began to move. It was then she knew what he meant by easy. By being unable to be easy.</p><p>She felt his sweat drip to her shoulder and looked up at him, seeing the wild violet-blue eyes, the narrowed gaze, the lust that burned in his face.</p><p>And he was moving.</p><p>Sierra began to shudder as sensation after sensation began to rage through her body. She was dying beneath him now.</p><p>“More.” She couldn’t hold back the plea, the demand for more.</p><p>Her hips lifted closer, her knees digging into the mattress as she fought for the more that she needed, hungered for.</p><p>“John, so good,” she moaned, feeling drunk on the sensations racing through her body, just under her flesh, tearing through her womb.</p><p>Behind her, his lips settled to her shoulder, taking sharp little kisses as his hips lunged inside her, thrusting hard and deep, filling her until she felt ready to burst from the pleasure.</p><p>Every inch of her body was primed for orgasm now. The stroke of his cock inside her, rasping against tender, untouched nerve endings and sensitized tissue, was too much.</p><p>She felt as though she were dying of pleasure beneath him.</p><p>“Better than the dreams,” he groaned. “Fucking you is so damned good, Sierra. So fucking good.”</p><p>The thrusts became harder, filling her as she felt the muscles he was invading clench tighter on his cock until they were both groaning, breathing harsh, desperate as she felt her orgasm rising, burning closer, tightening through her until the explosion ripped through her body and her senses.</p><p>Shaking beneath him, Sierra fought to hold on to him as he thrust inside her, pushing deep and hard until he jerked free and she felt his release burn against her rear as he gave a hard, heavy groan of pleasure.</p><p>She hadn’t even thought of birth control. She hadn’t considered the fact that he hadn’t donned a condom and she wasn’t on anything herself. There was no need to be. John hadn’t been in Boston; there hadn’t been a chance of him touching her.</p><p>“Sierra.” He whispered her name against her shoulder as he kissed it gently, giving one last shudder above her as the spurts of semen against her flesh eased. “Sweet God, baby. You’ve killed me.”</p><p>He collapsed behind her, pulling her close against him as he fought to catch his breath.</p><p>“Hmmm,” she murmured. She didn’t have the breath nor the intelligence to form a response at the moment.</p><p>All she could do was feel. Feel the warmth that suffused her, the satiation that filled her.</p><p>“Did I hurt you?” There was an edge of concern in his voice now.</p><p>Sierra managed to shake her head. “Killed me.”</p><p>“Killed you, huh?” Amused now.</p><p>She imagined his expressions with each tonal change. She knew him, she realized. Knew that with his amusement, his gaze would sparkle with laughter; with his anger, it would gleam with fire. Concern was a furrow above his brows; sympathy was somberness that gave his expression a look of heavy emotion.</p><p>Did he know her so well? she wondered.</p><p>Of course he didn’t.</p><p>“You’re thinking too hard, Sierra,” he drawled lazily. “I can feel your mind working, going over things, dissecting them. Let it just flow, baby.” Another kiss to her shoulder and she was frowning at the wall across the room.</p><p>“Is that your new philosophy, John?” she asked warily. “Worry about it tomorrow?”</p><p>He chuckled at that. “Not hardly. But there’s no sense in thinking something to the ground that hasn’t firmly established itself yet, either. Just be easy, lollipop. Things will work themselves out how they should, no matter how you worry over them.”</p><p>“Hell of a way to live,” she sighed, moving away from him despite the obvious reluctance as he allowed her to leave his arms.</p><p>“A better way to live.”</p><p>She looked back at him, seeing his obvious unconcern over his nakedness as he watched her from the bed. For her part, she jerked the sheet that had fallen to the floor and wrapped it around her naked body.</p><p>She felt more in control, less vulnerable with at least partial covering.</p><p>“How can it be a better way to live, John?” she asked. “Perhaps I need to figure out how to defend myself against you. You’re going to destroy me before this is over.”</p><p>He frowned back at her. “Because we had sex? Has your heart been broken every time you’ve gone to bed with a man?”</p><p>“Pretty much,” she snapped back, her lips thinning. After all, she hadn’t had a lover before John.</p><p>He shook his head. “Bobby Worthington was pretty heart-broken himself, if I remember. Said you walked right out of his bed and never looked back.”</p><p>Bobby Worthington, she almost laughed at the thought, but the seriousness in his expression forestalled the amusement. She’d be damned. He believed the gossip and rumors? All along, he had believed it every time one of those bastards had sworn she had slept with him.</p><p>“Tell me, John, would you ever admit that a woman simply walked away from you?” she questioned him caustically. “Think about it. Bobby had more ego than good sense, and evidently it’s simply a male trait, because you don’t appear to be any smarter at the moment.”</p><p>She shook her head as he frowned back at her, his gaze narrowed as though he were deciding whether or not to believe her.</p><p>“I need a shower.” She wasn’t defending herself against this, and she sure as hell wasn’t going to cry again. What she would do was exactly what he said she shouldn’t. Figure out how to keep her heart from being broken.</p><p>He rose lazily from the bed. “Shower’s through there.” He pointed to a door off the side. “I’ll lay your bags on the bed, you can unpack into the extra dresser.” He pointed to a low set of drawers built into the wall of the bedroom. “I’ll order dinner in. Tonight, we have some things to figure out, plans to make, then we’ll go from there.”</p><p>“I can’t imagine what kind of plans you might need to make.” She shrugged as she headed to the shower. “Your father will have this figured out soon, then I’ll be going home. No big deal.”</p><p>No big deal?</p><p>John watched as she moved into the shower, the door snapping closed behind her.</p><p>She was angry.</p><p>The look on her face when he’d mentioned Bobby. There had been such an edge of disillusionment there, as though she couldn’t believe he’d mentioned that.</p><p>What the hell was going on with her?</p><p>She’d been as tight as a virgin, but he knew for damned sure that she was no virgin. So close to it that she may as well have been, a part of him argued.</p><p>And what had she said? That he hadn’t remembered that night correctly.</p><p>The hell he hadn’t. He’d passed out right between her thighs, the taste of her sweet pussy still on his lips. There was no way he would have forgotten taking her.</p><p>Hell, Sierra had always confused him, though. She never came right out and said anything. She kept things to herself, whether pleasure or pain, and rarely shared them. Getting information out of her was often like pulling teeth.</p><p>There was information that was going to have to come, though. There had to be a reason why she was attacked. His father had ruled out a serial rapist, there were no attacks that matched the MO, and there was no reason to believe it was anything other than personal. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Who would want to hurt her?</p><p>That was what John intended to find out, and then he intended to do something about it.</p><p>SIX</p> <p>Getting her to talk that night didn’t work out as John had hoped. Once they had dinner, Sierra drifted off to sleep on the couch while John called his father and discussed the investigation into the attack.</p><p>There was no new information.</p><p>John paced the upper deck of the Nauti Wet Dreams, frustration eating at him as he tried to piece together the information he did have. Which wasn’t much.</p><p>The assailant had obviously been male. The roommate who had burst into the bedroom that night hadn’t seen hair color or eye color, but judged his approximate height to be around six feet. It could have been anyone.</p><p>As John stood at the railing, a beer in hand, the sound of slow, even footsteps making their way down the dock drew his attention.</p> <p>Watching, he almost groaned in irritation. Most people groaned in irritation when Timothy Cranston made his appearance, though.</p><p>The rabid little Leprechaun, the Mackay cousins called him. A former Homeland Security special agent who had retired to Somerset after the completion of an investigation that revealed a domestic terrorist organization in the area.</p><p>He paused at the front of the boat.</p><p>“I’m up here, Cranston,” John called out, the night and the water carrying his voice clearly to the other man.</p><p>“Ahh, the elusive John Walker Junior.” The amusement in the other man’s tone was just the wrong side of grating.</p><p>He moved across the deck to the spiral staircase that led to the sundeck of the houseboat.</p> <p>“Too bad I’m not a little better at the elusive part,” John grunted. “What the hell do you want?”</p><p>Cranston stepped onto the deck, a quiet grin on his face as John leaned against the rail and glared back at him.</p><p>“The Walkers have quite a history in this area,” Timothy mused as he walked across the deck to the portable fridge and removed a beer.</p><p>John watched as he uncapped it and took a long drink, wondering what the ex-special agent was doing here.</p><p>“Calculating” and “manipulating” were two of the kinder terms used to refer to Cranston.</p><p>Turning back to him, Cranston moved closer, opting to sit in one of the deck chairs across from where John stood.</p><p>“I won’t ask again,” John stated with far more patience than he felt.</p><p>Cranston only chuckled. “The Mackay boys use that same tone with me, John. It doesn’t help them any more than it’s going to help you.”</p> <p>No doubt. The little fucker was going to get himself killed one of these days. From what John understood, he was far too prone to fuck with too many people’s lives.</p><p>“You have a problem,” Cranston finally stated.</p><p>“And you’re one of them,” John pointed out.</p><p>To which Cranston’s low laugh filtered through the night.</p><p>“This could be true,” the other man agreed, nodding. “But honestly, JW, I could easily become your best friend.”</p><p>“Not if you keep calling me JW.”</p><p>He might just have to kill the little bastard himself if he kept that up.</p><p>“That’s what most people in these parts call you, you know,” Timothy informed him. “Especially those who knew your father.”</p><p>John restrained a sigh. Too many people in this area remembered his father before he moved to Boston. Or perhaps escaped to Boston would be a better way of describing it.</p><p>“Cut the shit, Cranston.” John shook his head wearily. “Why are you here?”</p><p>“Because someone was in town today asking some very pointed questions about John Walker Junior. Someone obviously not from the area.”</p><p>John froze. No one but his parents and sisters knew where he was, and there was no reason for anyone he knew to have followed him to Somerset, Kentucky.</p><p>“Who was he?”</p><p>“She.” Cranston grinned. “The intrepid investigator claimed to be your fiancée.”</p><p>John stared back at him in silent shock.</p><p>“I don’t have a fiancée,” he answered the other man.</p><p>Cranston tipped the beer back, finished it, then set the bottle on the floor of the deck.</p><p>“She didn’t seem much like a lady,” Cranston remarked. “Strange, I can’t imagine you hooking up with such a woman, even for a short time.”</p><p>John remained silent, refusing to answer the subtle question.</p><p>Cranston stared back, just as silent.</p><p>John couldn’t imagine Marlena in Somerset, Kentucky, for any reason. There had to be a mistake. But Cranston wasn’t a man that made mistakes.</p><p>“Strange, in the year you’ve been here, no one has questioned your arrival, nor followed you. It struck me as rather funny that this woman arrived only hours after you met your sister’s plane on Hickley’s private airstrip and collected a passenger.”</p><p>John crossed his arms over his chest and restrained the heavy curse hovering on his lips. Hell, he didn’t need this.</p><p>“What business is it of yours if someone claiming to be my fiancée is in town?” John tilted his head and stared back at the other man.</p><p>“Well, normally, I really wouldn’t care,” Cranston assured him. “But the last name Genoa tipped me off. Were you aware your ex-fiancée and her family were suspected of being involved with one of the largest crime families in the nation?”</p><p>Fuck!</p><p>John rubbed at the bridge of his nose and couldn’t imagine why he wasn’t surprised.</p><p>“No, Cranston, I had no idea.”</p><p>Cranston nodded in reply. “I had your family investigated rather heavily once I met your sister.” He grinned at some memory. “She’s a hell of a woman, but I had a job to do at the time. Of course, this was before your engagement. The thing I learned was that the Walker family was incredibly loyal, not to mention patriotic. When I learned you were engaged to the Genoa woman, I was rather surprised.”</p><p>“It didn’t last too long,” John pointed out mockingly.</p><p>“Because Sierra saved your sorry ass,” Cranston grunted. “There were agents with the Office of Homeland Security at the restaurant that night who had Ms. Genoa under surveillance. The reports were fairly precise. Once I checked further into it, I learned that Ms. Lucas had been instrumental not in just breaking up your engagement but also in stopping a much-needed infusion of financial prosperity into the Genoa family, which would have boosted them back into the good graces of their extended family. Walker capital would have been used to launder some rather dirty money.”</p><p>John could only shake his head. “Cranston, what makes you think that even criminals can’t marry for love?”</p><p>“Of course they can.” Cranston stared back at him as though surprised. “They just don’t normally survive it. Which works out for all us hardworking law enforcement officials.”</p><p>“I should have taken my uncle up on his offer to move to California,” John breathed out roughly, though he knew he could have never done so. Hell, he loved Somerset, especially on the days he didn’t have to deal with Cranston.</p><p>He was learning things tonight he didn’t really want to know. Things he really didn’t give a damn about.</p><p>“Marlena is no longer a part of my life, Cranston,” John pointed out.</p><p>“That explains why she was in town then, correct?” Cranston’s smile was benign, almost innocent.</p><p>No, that didn’t explain anything.</p><p>“She did leave this afternoon,” Timothy went on to say. “But not before, as I understand it, she made a trip here, to the marina.”</p><p>Thank God, Sierra had slept the afternoon away, and John was certain there was no way Marlena could have gotten the information that Sierra was there. No one knew she was there but the Mackays, and they wouldn’t tell anyone, he was certain of that.</p><p>“What’s going on, John?” Cranston asked then, his tone completely serious. “There’s reports from Boston that Ms. Lucas was attacked after you left town, nearly raped, beaten. She disappeared after being taken in by your family, and now a member of the Genoa family is here, looking for you. After a year? Tell me, boy, do you believe in coincidence of that sort?”</p><p>Hell no, he didn’t, but it couldn’t be anything else, could it?</p><p>“You think Marlena was behind Sierra’s attack?”</p><p>“Personally, I wouldn’t put it past her to have made the attack,” Cranston grunted. “But Ms. Lucas seems certain her attacker was male. My point is, your ex-fiancée is here, after a year, within hours of Ms. Lucas’s arrival. With her connections, finding your friend wouldn’t have been hard, John. Find you, they find Sierra. A ten-year-old could have figured that one out.”</p><p>“And why the hell does this even concern you?” John asked even as he let the information turn over in his mind and considered the possibilities. “Why are you involved in this, Cranston?”</p><p>The other man breathed out heavily. “It’s damned hard to retire, John. I see things. That was always my strength in Homeland Security. I could take coincidences and pin them together, and I could see the links when there didn’t appear to be any.” He stared back at John soberly. “My gut’s rioting here. It has been ever since I recognized Marlena Genoa walking into the Mackay Café in town and learned who she was asking for. Her arrival here isn’t a good thing.”</p><p>And John couldn’t defend her. He couldn’t protest. He couldn’t defend her and try to claim Marlena wasn’t capable of being involved in something as sinister as the attack on Sierra. He knew Marlena’s vindictiveness. If he added that to her possible criminal connections . . .</p><p>“Why come here herself if she has all these connections?” John asked Cranston, frowning as he tried to make the pieces of the puzzle fit in his mind.</p><p>“As I said, her family has lost financially, which lowered their cache within the family. Her marriage to you would have fixed that by providing a way to either launder money, or to embezzle funds to finance smaller investments for the family. Either way, her family could have moved back into the working stream. She’s doing her own dirty work because she has no choice. If she’s like other members of her family, then she’s after revenge now. The other girl is winning.”</p><p>John snorted at that. “This isn’t fucking high school, Cranston.”</p><p>“No, it’s real life, and where the hell do you think games like this begin, if not in school? These women learn from preschool how to manipulate and play payback. Don’t imagine life doesn’t often imitate those school yard games.”</p><p>Making it fit in his head wasn’t so easy, though. Marlena wasn’t above social revenge, but staging an attack against Sierra?</p><p>“So you’re saying Marlena arranged the attack to get back at Sierra for informing me of her affair with Gerard? Why wait for a year after I break off the engagement then?”</p><p>“I’m saying my gut is burning,” Timothy growled. “I see her, hear her questioning people about you and any guests you might have living with you, and things start adding up in my head. And I’m a nosy bastard, John. Nosy and damned particular about things like this. Somerset is my home now, and I look after what’s mine. That means you and that innocent little girl you now have sleeping in your boat. From what I’ve learned, she’s a damned fine woman. Women are to be protected, JW, and that’s our job. That’s a job I take damned seriously.”</p><p>He’d heard Cranston had taken Pulaski County as his own, and he was driving both Sheriff Mayes as well as Somerset’s Chief of Police, Alex Jansen, crazy with his interference. Crazy, because he was invariably right. And invariably, Cranston’s issues always revolved around women.</p><p>John pushed his fingers through his hair wearily. “If this is what is actually going on, then what’s the threat level I’m looking at?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cranston tapped his fingers against the arm of his chair. “The Genoa family is cash poor, but there are still a few favors they can draw on. Not many, mind you, and contract killings cost money. I’d say if she doesn’t try to do something herself, then the person working with her will owe her a personal favor of sorts. My advice is to keep Ms. Lucas out of sight, and if you come in contact with Ms. Genoa, see how hard you can piss her off. Women are women, my friend, and many of them will always give themselves away in anger.”</p><p>John shook his head. Marlena was cool; hell, she was cold as ice. Getting her to crack wouldn’t be that easy.</p><p>“There’s no chance she’ll simply give up,” John mused aloud.</p> <p>“Not a Genoa,” Timothy grunted. “She’s here to do the footwork, then whoever’s helping her will strike. We need to find out who’s helping her, why, and put a stop to it.”</p><p>“And we do this how?” John asked curiously.</p><p>“I’ve always found a Glock works really well.” He sounded way too serious, and John found the idea much too appealing.</p><p>“I like the idea, but I think if we both want to stay out of prison, we come up with another idea.”</p><p>Timothy chuckled as he rose from his seat. “I knew I’d like you, JW.”</p> <p>“Keep calling me JW and I’ll kill you for sure,” John warned him.</p><p>Timothy only gave another short laugh. “Since we can’t kill them, we’re going to have to prove conspiracy and intent. That will be harder. We have help, though. The Mackay boys are looking for a little excitement. Marriage suits them, but I think they miss the adrenaline a little bit, too. I have a former agent or two in the area. We’ll work on them. Sit tight a day or so and I’ll see what I can come up with.”</p><p>John’s brows rose. Strangely, he couldn’t remember asking Cranston to handle this for him. But he knew the things he had heard about the former special agent. He’d let the little Leprechaun do his thing for the time being. John had a woman to protect. His woman, and learning about Sierra was more important than hunting up Marlena.</p><p>“How do you intend to handle it, Cranston?” Curiosity was getting the best of him.</p><p>“By doing what I do best.” Cranston’s smile was innocent, amused, and frankly terrifying. “By doing what I do best.”</p><p>By manipulating anyone and everyone involved or who could be involved, John thought. That was what Cranston did best. That was a damned scary proposition if even half of what John had heard about him was correct.</p> <p>“Cranston, you’re retired, and you’re still trying to protect the world?” John would have been amused if he wasn’t fully aware of exactly how dedicated Timothy Cranston had always been to justice.</p><p>The former agent paused and stared out into the darkened lake for long moments before speaking. “I had a daughter once.” He spoke low, his voice filled with a haunted, aching loss. “I had a wife, and you know, they loved me.” He turned back to John. “I’m rumpled, a smart ass, and when I met my wife, God knew I was fast on my way to becoming an alcoholic, but she saved me. And my daughter made me realize the reason for my existence. When she was born, my wife made me swear that no matter what happened, I’d never let myself sink again.” He shook his head as he took a deep breath. “Monsters took my ladies from me, John. Men who had no respect for the law or even humanity. I swore to my beautiful wife I’d never get drunk again, but I didn’t swear I wouldn’t wipe as many of the monsters as possible out of existence. That’s what I live for. That’s all I live for. Because if I kill myself, then I don’t have a chance of meeting my ladies in Heaven, now do I?”</p><p>With that, Cranston turned and moved to the stairs.</p><p>“That’s why you’re here,” John said before he left. “That’s why you stay in Somerset, because the Mackays are family now, aren’t they?”</p><p>He shook his head. “No. I’m here because a Mackay married an agent that so reminded me of my daughter that I couldn’t help but love her as one. I stay here because there’s work to be done here, and because the Mackays allow me to be a part of their lives. Without them, I don’t know if I could keep that promise to my wife once the Department cut me loose. That’s why I’m here.”</p><p>For a man as rumpled, lazy, and clumsy looking as Timothy Cranston, he moved with a silence John could only envy as he left the houseboat, and left John with more to ponder than what he felt he actually needed.</p><p>He wondered if the Mackays were aware of the reason why Timothy Cranston had settled in Somerset. They were tolerant of him for the most part; they liked the rabid, calculating little bastard, there was no doubt. But John had a feeling they had no idea the true reason why the other man was still here, poking his nose in their lives and calling himself “Unca Timmy” to their children as he slid their parents mocking looks.</p><p>And now it seemed Cranston wanted to adopt him and Sierra as well.</p> <p>Shaking his head with a rueful laugh, John turned to make his way back to the interior of the houseboat when a movement on the bank caught his eye. It was subtle, a gleam of metal where there shouldn’t be. A small dot of light, almost like that of a pair of night-vision binoculars. It was just there for a second, though, and then it was gone.</p><p>A trick of the light? He’d seen it before over the past months and that was the explanation he had given himself. What if it was something more?</p><p>Moving to the steps, John descended them quickly until he was once again in the living area of the houseboat.</p><p>Sierra was still sleeping peacefully in the bed, her thick, heavy lashes cushioned against her upper cheek, the long, thick strands of black curls falling around her face and shoulders. She looked like an angel. So damned innocent, and so sexy at the same time.</p><p>The oversized T-shirt and shorts she wore gave her a girlish appearance, and that innocence. He grimaced, a flash of something flitting through his mind as he frowned. Rising between her thighs, fitting himself to her?</p><p>He shook his head. The fantasy of that first night, the night he had nearly had her, still tormented him. There was no figuring it out quite yet, though.</p><p>Locking the doors and pulling the drapes, he moved to the back of the houseboat and the small office he used the guest bedroom for. There, he edged the side of the curtain aside and watched the bank closely.</p><p>Shadows shifted and moved as his gaze narrowed. That tingle at the back of his neck that he’d acquired as a Marine kicked in.</p><p>There was definitely someone there, definitely a threat. And it had been there far longer than Sierra’s arrival. Only tonight had that knowledge that it could become a threat begin to tingle at his nape.</p><p>Because Sierra was there.</p><p>He pulled his cell phone from his hip and hit speed dial.</p><p>“Dawg.” Dawg Mackay answered on the first ring.</p><p>“I have eyes on me,” he said quietly.</p><p>“Where?” Dawg was instantly alert.</p><p>“At the rear, at the nine o’ clock position. Meet me there in the morning.”</p><p>“Fuck morning,” Dawg growled. “I’ll call the others, we’ll be there within minutes.”</p><p>“And they’ll be gone,” John guessed. “I have a situation here, Dawg. Just catching whoever or whatever watches won’t fix it. But we can use them.”</p><p>There was a long moment of silence. “I’ll call Cranston.”</p><p>“Cranston just left but call him. Slip in tomorrow morning separately. Let’s do it all at once, or Sierra will never be safe.”</p><p>And nothing mattered but her safety.</p><p>SEVEN</p><p>Sierra awoke to strong arms holding her, the warmth of</p><p>John behind her, his head resting against the top of hers, his legs entwined with hers.</p><p>It was definitely unusual. She had never slept with a man before John, and she was almost frightened at how easy it was becoming to get used to it.</p><p>Not once had she awakened wondering who was behind her, or terrified that the nightmares were returning. Not once had she felt uncomfortable, or that she shouldn’t be here. Unfortunately, a part of her felt as though she were at home.</p><p>She turned slowly, trying not to awaken him, but wanting to see his face.</p><p>The laugh lines at the side of his eyes hadn’t been there before he left Boston. Come to think of it, it had been years since she had truly seen John happy, until now. He laughed now. Amusement and fun gleamed in his eyes as it had so long ago. Before he had gone to the Marines. Before he had returned from blood and death.</p><p>As she had noticed before, he was stronger, tighter, broader. He was, on the outside, the man she had always known existed on the inside.</p><p>Lifting her hand, using only the tips of her fingers, she slowly pushed back a long, thick strand of hair that had fallen over his face.</p><p>He looked more arrogant than ever before, she thought in amusement, and John Walker Jr. had arrogance in abundance before he ever left Boston. He was more relaxed here, though, less austere and critical. He was the man who had stolen her heart years ago as a young girl.</p><p>As she watched him, the hunger for him rose. It was a natural extension of any thought of John. That need that filtered through her body, heated her flesh, and left her aching for him. She felt it in her breasts, in her erect nipples. That sensitivity that only arose whenever John was present, whenever she thought of him.</p><p>The heat that built there worked its way lower as well. It heated her clit, burned in her pussy, and clenched in her womb. From there, she felt the sensitivity working beneath her flesh, filling her with a hunger for him that she knew would never be completely sated.</p><p>She trailed her fingers from his hair, to a broad, muscled shoulder. Lightly. She kept her touch light, wanting to feel the subtle heat and texture of his flesh rather than the well-honed iron beneath.</p><p>She had always loved his body, but she loved it even more now. It was a rich, golden bronze. It was heated, pulsing, and hard like living iron beneath.</p><p>As her fingers roamed over his shoulder, his lashes drifted open. Sleepy violet eyes stared back at her for a second before he turned slowly to his back.</p><p>An invitation. An invitation to touch as she pleasured, to pleasure as she wanted. He was giving her carte blanche to his body and her senses exploded with chaotic hunger at the realization.</p><p>Moving over him, she couldn’t help but ache for his kiss now. A kiss she could measure, control, relish. Her lips lowered to his, brushed against them, and her entire body clenched in need as they responded beneath her.</p><p>The kiss flamed, but rather than blazing out of control, it only began to burn brighter, hotter, while maintaining the need for a slow, easy caress.</p><p>Lips stroked, tongues licked, tasted, and built the desire rising between them.</p><p>Touching him was like being in the center of a firestorm, protected, yet awash with the heat. It was like drawing in that heat, filling her soul with it.</p><p>The taste of him infused her senses, his kisses growing hungrier as she felt the need rioting inside her.</p><p>Dragging her lips back from his, Sierra drew them down the rough flesh of his neck as her hands stroked his hard abs. She nipped and licked, tasted and enjoyed him as she had never enjoyed anything in her life.</p><p>She felt as though she were becoming drunk on him. Each taste of him was more intoxicating than the last. When his hands threaded into her hair, his body arching against her, the knowledge she was bringing him pleasure amped her own arousal.</p><p>Her nails scraped along his thighs, feeling them tighten beneath her touch as her lips trailed down his abs. She knew where she was going, she knew what she wanted.</p><p>His control was shot. John could feel the last threads of restraint beginning to slip through his fingertips despite the battle to hold on to it.</p><p>He’d seen Sierra’s face, her expression as she began kissing her way down his body. She wasn’t just pleasuring him, hell, she was finding pleasure in each touch she was giving him. He’d never seen that expression on a woman’s face before. He’d never known of a time that a woman had actually known pleasure just from touching him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The only way to hold on to that control was simply to watch her, even though he knew that was the fastest way to lose his control.</p><p>Swollen lips sipped from the flesh of his abdomen as her nails pricked at his thighs. A delicate pink tongue lapped at the flesh just a breath above the rigid head of his cock as it rose from between his thighs.</p><p>Damn, he wanted her. Needed her. But even more, he wanted to watch her face, watch her pleasure.</p><p>As her adventurous little tongue licked over the wide, throbbing crest and stole his breath, he watched her eyes darken, her face flushing further. Electric pleasure zipped through his body, sizzling up his spine as his hands tightened in her hair.</p><p>Hell, this was torture. It was the worst torture he had ever allowed himself to endure.</p><p>Her hot little tongue lapped at the head of his dick before her lips parted and drew it, but only momentarily, into the heated depths of her mouth.</p><p>As she released him, a tight grimace pulled at his lips as his fingers tightened further in her hair.</p><p>“You’re killing me,” he groaned.</p><p>A low, light moan vibrated against his shaft as she licked her way lower, then back to the tight head.</p><p>When her lips drew him inside her mouth once again, he swore he nearly lost his mind. She sucked him deep instantly, as though the need for his taste overwhelmed her.</p><p>Her fingers cupped his balls timidly, but that hesitancy was sexier than the touch of the most experienced woman who had ever been there. The pleasure of it, the sensations, the sight of her face, her lips surrounding his cock, was exquisite. Hell, the pleasure went so far beyond just the physical sensation of it that he wondered if he could ever make sense of it.</p><p>“Damn, Sierra, you’re making me crazy.” His fingers tightened in her hair once again, holding her in place for just a second as his hips arched slowly.</p><p>Then she smacked him.</p><p>John jerked back, blinked at the sting in his abs, and her little hand still pressed to it as her head jerked up.</p><p>“This is my treat.” The look in her eyes was determined, fierce, and hungry.</p><p>John stared back at her, his eyes narrowing.</p><p>“I woke up first,” she informed him. “I started this. So leave me alone to have my fun.”</p><p>Carefully, he laid his hands on the bed, palms down to allow his fingers to curl into the sheets when the pressure became too great.</p><p>Sierra proceeded to make him insane.</p><p>Her lips and tongue moved over the head of his cock like a hungry sensualist, taking him as he fought to keep his hips from arching, tried to keep from thrusting deeper.</p><p>Ah hell. She was going to destroy him.</p><p>Her fingers played with his balls, weighed them, stroked them as her lips and tongue wreaked havoc on his dick, and there was nothing he could do to ease the torture, the pressure. She refused to let him.</p> <p>This was her turn, but his turn would come. As he watched her, watched the dampness of her mouth as it lifted from his dick, watched her lips redden, her eyes glaze with hunger, he promised himself he would drive her just as crazy, very soon. In ways she couldn’t imagine.</p><p>Slowly, with exquisite relish, her lips lifted from his straining cock as she stared back at him with drowsy eyes.</p><p>“I’ve dreamed of this,” she whispered as she moved back up his body. “Dreamed of every second of this.”</p><p>“Payback’s hell,” he groaned.</p><p>She smiled a sexy, siren’s smile as long black curls cascaded around her body. Easing up his body like a sleek little cat, satin skin brushing against him, the heat of her pussy glancing his hard shaft until she was straddling him, she blew his mind with her sensuality.</p><p>“In your arms, payback would be paradise,” she assured him, hips shifting, the heat of her pussy nudging at the wide head of his cock.</p><p>“Ah, hell.” He was going to lose himself in this, he could feel it. Hell, no other woman had ever taken him like this, had ever loved him like this.</p><p>Pleasure tore through his body as she shifted again, the blazing heat of her intimate flesh beginning to enfold his erection, tender muscles working over the head as she moved, taking him by slow increments.</p><p>A firestorm of sensations overtook his body. His balls were tortured with the effort to hold back, his cock straining.</p><p>“Where’s the condoms?” she whispered as she eased up again. “Oh God, John, I don’t know if I can pull off you in time.”</p><p>Her body was shuddering as his hands moved, trembling for the drawer of the nightstand. He’d found one earlier. A single fucking rubber, and he knew damned good and well one would never be enough.</p><p>Tearing the package open as she lifted, he rolled the latex quickly down his cock, then gripped her hips and waited. It was like waiting for death and birth, and his patience was wearing thin.</p><p>But hers was as well.</p><p>She eased down.</p><p>She fucking destroyed him.</p><p>His dick jerked, throbbed, sweat popped out on his brow, and a thousand fingers of sensation began to race over his flesh.</p><p>He couldn’t handle it.</p><p>Bucking beneath her, he drove in deeper, expecting that very feminine smack once again. Instead, she cried out in pleasure, the sound wrapping around him and driving him harder.</p><p>Tightening his hands on her hips, he fucked her deeper, feeling her press down on him hard and fast as he surged upward. She kept up with him. Thrust for thrust, her pussy milking his cock as he stretched the inner walls until they created a snug, intimate little embrace around the desperately hard shaft.</p><p>He wanted to fuck her forever, but first he had to hold on long enough to simply feel her coming around him. He couldn’t forever, despite the agony at the thought of losing the pleasure enveloping him now.</p><p>What she did to him should be illegal.</p><p>Rising, she sat astride him, that small sexy little curl of her lips going straight to his balls. He swore he wouldn’t last another thirty seconds.</p><p>Then she moved.</p><p>“Fuck, Sierra,” he groaned, his neck arching as she began to ride him with a smooth thrusting motion of her hips that he knew neither of them would survive for long.</p><p>His hands slid to her buttocks, gripping the rounded globes and guiding her motions, entranced by the fact that she wasn’t adept at this, simply adventurous. And that was all the more arousing.</p><p>They moved against each other, their thrust and parry escalating in seconds. Watching her face, he knew the moment her release began. The way her eyes dazed at the same time her thrusts became jerky. The way her pussy began to ripple and tighten, the smooth, heated flow of additional juices, and then the ragged, tormented cry that tore from her lips.</p><p>She was there, coming around him, falling against his chest as he continued to thrust inside her, to take her, to fuck her past the last ecstatic shudder before he gave in to his own release.</p><p>A release that felt as though it was pouring from his soul. Arching hard and deep and inside her, he heard her name slip past his lips, felt his body shake, tremble, and then the harsh, electrifying pulses of sensation as they began to tear rapidly through his body.</p><p>And just as he feared.</p><p>He lost himself in her.</p><p>EIGHT</p><p>She was tearing him apart. John watched as Sierra dressed an hour later, her gray eyes pensive, too somber as she stared in the mirror over the dresser and carefully smoothed moisturizer over her face.</p><p>There was that edge of fear in her eyes that he hated seeing, the same edge he saw in her gaze as he carefully tracked the healing bruises against her flesh before allowing her to leave the bed.</p><p>Long, black curls rippled down her back, the thick strands gleaming like silk against her pale skin. He wanted to get her on the upper deck, naked, slicked with sunscreen, and basking beneath the summer sun.</p><p>The sun was a healing balm; it would heat her pretty flesh, darken it, and give her a look even more exotic than what she had now. First, he would have to move the houseboat for the day, though. He had one of the far docks, one of the most private, but it wasn’t private enough to keep preying eyes from watching her naked body.</p><p>He hadn’t told her they were being watched. It wasn’t something he was looking forward to telling her. She’d come here for safety, and the thought that the danger she had faced in Boston had followed her here made him homicidal.</p><p>“We’re having company soon,” he told her as she drew a pair of light, cotton pants over her legs.</p><p>She paused as she picked up a dark blue T-shirt.</p><p>“What kind of company?” she asked carefully.</p><p>“This morning, some friends of mine and their children,” he told her. “Rowdy’s cousins, wives, and infants. Rogue’s not back from her honeymoon yet so just the Mackays. It’s like a madhouse when they all get together, so be prepared. Their wives are hellions, their children are adorable little angels, and they’ll pump you for information, brag on their husbands, and decide who and where to begin matchmaking. So don’t let them know we’re sleeping together. It’ll give them something to wonder about.” He grinned with a wink in her direction. There was no way to hide the fact that he was sleeping with her. He’d kissed her lovely neck just a little too hard earlier, leaving the faintest red mark that he considered a stamp of supreme ownership.</p><p>Sierra rolled her eyes. “Dummy. As if they’ll believe that one.”</p><p>At least she was calling him “dummy” again. The playful little insult had always assured him that he was in her good graces and once again the love of her life.</p><p>He’d missed that, he realized. As he realized only just now how the playful little name had always made him feel. Sierra didn’t call anyone else “dummy.” As completely immature as it sounded, even to himself, John had to admit it gave him a bit of hope.</p><p>Hell, he had no intention of letting her leave him. She was his. He just had to convince her of that, and of the fact that it didn’t matter to him how many men she had been with before him.</p><p>He almost frowned at that thought as some part of his mind flashed back to that drunken night and the too hazy memory of pressing inside her.</p><p>Wishful thinking? He was starting to wonder about that.</p><p>“So how long are your friends staying?” she asked, drawing him out of his musings.</p><p>“An hour or so.” Pushing his fingers through his damp hair to tidy it, he watched as she drew a wide-toothed comb through hers. “The doctor will be here to check you out later this afternoon. While he’s here, explain the problem with the medication. He should give you something that doesn’t make you so drowsy.”</p><p>Sierra faced him as she arched her brow mockingly. “When did you get so bossy, John? You’re starting to sound like my father.”</p><p>He didn’t like that. Sierra almost grinned at the dark look he flashed her.</p><p>“Don’t get sassy, lollipop, or I might have to retaliate by talking to the doctor myself.”</p><p>“Go ahead.” Shrugging in unconcern, Sierra laid the comb on the dresser and faced him fully. “If you’re going to treat me like a child, then you may as well do it fully. Since when did you begin believing that I couldn’t take care of the simplest things by myself?”</p><p>Was that surprise in his deep, brilliant violet-blue gaze?</p><p>“I thought no such thing, Sierra.” His voice was quiet, sincere, sending a flare of remorse racing through her. “I was concerned. No more. But if you don’t take care of it, then you’ll be proving your own point. Won’t you?”</p><p>Damn him. The remorse chilled quickly enough in the face of his arrogance.</p><p>“Okay, lollipop, you have about ten minutes to finish dressing and bring your perky little ass downstairs if you want to meet the babies. Trust me, they’re well worth being on time for.”</p><p>With that, he left the bedroom and moved quickly down the stairs, leaving Sierra to stare after him in confusion. He was too playful, she decided. John had always had a nice sense of humor, but she swore the man he was now was joking more often than he was serious.</p><p>This playfulness was going to drive her insane, though, because she had no idea how to handle it, or how to handle him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She finished dressing quickly, as he advised, wondering at the Mackay family that John seemed to have made friends with so quickly.</p><p>He hadn’t been a man that made friends easily before. She had seen when she met Rowdy that John was close to these people, though.</p><p>His sister, Candace, said that John had found his roots. That he had finally found a place where he felt he belonged. Sierra wanted to see that place. She wanted to meet those people.</p> <p>Moving down the staircase moments later, she could hear the murmur of conversation, the sweet, melodic gurgle of infants. Not just one, she saw as she stepped into the kitchen area and looked into the living space, but four. Four approximately twelve-month-old toddlers with thick, thick black hair and varying shades of devilish green eyes. And all four turned to stare at her, just as their protective mothers and fathers did.</p><p>What a very interesting group. The women were so diverse at first glance, ranging in height, hair color, as well as expression. Of the four men, only one didn’t have black hair, but he looked just as hard, just as arrogant, as the other three.</p><p>“Sierra.” John’s voice held an odd tone, one she had never heard when he spoke her name before. “Come, meet my friends.”</p><p>The introductions were made easily as John placed his hand firmly at her lower back and led her into the thick of the group to the empty recliner that faced the sectional couch where Chaya, Kelly, and Christa Mackay sat with Janey Jansen. Janey was a Mackay before she married Somerset’s Chief of Police, Alex Jansen, the man who stood beside his wife’s seat, his gray eyes watching Sierra curiously as the Mackay cousins watched her with varying degrees of curiosity and, strangely, acceptance.</p><p>It was the tiniest of the four babes who drew her attention, though. Barely walking, her spring green dress flaring around her fragile body, she toddled over and offered Sierra a bite of a baby biscuit that she held in her hand.</p> <p>The biscuit was well gnawed, gooey at the tip, and the smile the little girl aimed up at her stole her heart.</p><p>“Do you have goodies, sweetheart?” Sierra whispered as she leaned close, her arms crossed on her knees as the little girl chortled up at her. “I bet it tastes very good.”</p><p>It was offered again, this time more solemnly.</p><p>With a grin, Sierra leaned close, pretended to take a bite, then grabbed a quick little kiss from a chubby cheek.</p><p>And the child was well satisfied. She laughed, held on to Sierra’s knee, and turned back to her mother as though she had just undertaken a miraculous feat and jabbered a string of unintelligible words with lots of “ma-ma” mixed in.</p><p>“And that little charmer is Janey and Alex’s, Erin Jansen. She’s the baby of the family. Behind her is Natches and Chaya’s daughter, Bliss.” Bliss looked back at her solemnly, as though she were considering every nuance of the moment before she went back to the toy she was playing with. “In the yellow dress is Dawg and Christa’s little tomboy, Laken.” The baby playing with the little toy truck. Sierra couldn’t help but grin. “And the lazy one over there sleeping is Rowdy and Kelly’s, Annette.” Rosy cheeks, black hair, and a perfect little baby face, Annette was snoozing through all the commotion from a padded spot at her mother’s feet. “And here’s Faisal and Timothy Cranston. Faisal is Natches and Chaya’s adopted son, and Timothy is the pest no one can seem to get rid of.”</p> <p>Sierra smiled back at the young man of Middle Eastern heritage, who looked perhaps twenty-three or -four years old, but it was Timothy Cranston that held her gaze the longest.</p><p>He looked rumpled, his thinning hair mussed, his brown eyes somber and intense yet shaded with a hint of mockery. He was older, she guessed late forties, and the lines at his mouth, forehead, and lips bespoke a man who had known far too much grief.</p><p>“Mr. Cranston, it’s nice to meet you.” He reminded her of her father.</p><p>Timothy’s head tipped to the side as a small smile played about his lips. Stepping carefully over babies, diaper bags, and toys, he offered his hand.</p><p>The handshake was gentle, his gaze respectful.</p><p>“John’s mentioned you a time or two,” he stated. “He didn’t tell us how pretty you are.”</p><p>Erin jabbered again in excitement before Sierra could reply, her arms reaching up as her animated little face creased into one huge smile.</p><p>“And there’s my girl.” Cranston’s voice softened, became filled with emotion as he picked the little girl up off her feet and cuddled her against his chest. “Unca Timmy missed you, sweetie.”</p> <p>Unca Timmy?</p><p>Sierra looked around and saw the looks the others were giving him.</p><p>“You’d have to know Cranston to understand,” John chuckled. “You’ll figure it out.”</p><p>She rather doubted it, but she let the memories soak in rather than fighting them. The women were a friendly bunch, talking easily about far more than babies. The conversations shifted until she found herself locked into a lively political debate as she noticed John and the others slipping out to the deck then up the outside staircase.</p><p>“Ignore them,” Kelly, her blue eyes shimmering with laughter, advised her. “They always escape when we all get together.”</p><p>“Unless there’s food involved.” Chaya rolled her expressive, dark gray eyes as Christa laughed over the comment.</p><p>“John says he’s known you most of your life,” Chaya commented. “He’s told us your favorite food, favorite drink, favorite movie, and how you came by those bruises. Tell me, Ms. Lucas, are you using our John for safety then running out on him, or do you have something more permanent in mind?”</p><p>Sierra blinked back at her. The woman looked like an interrogator now rather than a mother, a friend, or a wife.</p><p>“Perhaps that’s a question you should ask John,” she stated as she stared back at the other woman directly. “Funny, the only proposal I’ve ever heard come from his lips was for another woman.”</p><p>“And I understand you took care of that one right quickly,” Chaya pointed out as the other women looked on in amusement.</p><p>“She was cheating on him.” Sierra narrowed her eyes at the other woman. “Do you have a problem with me, Mrs. Mackay?”</p><p>“Only if you intend on breaking John’s heart,” Chaya informed her.</p><p>“Then, we may all have a problem with that,” Kelly chimed in.</p><p>“And if he breaks mine instead?” she asked. “Excuse me, ladies, but I truly don’t think you have anything to worry about where John’s concerned. He’s a really big boy, and trust me, he takes care of himself very well.”</p><p>She wondered at these new friends of John’s even as she wondered if anyone had cared when he had broken her heart.</p><p>“We would care if your heart was broken as well, Sierra,” Christa stated then, drawing Sierra’s attention. “We know John, though. We know how he’s spoken of you over the past year, and we know you’re important to him. Forgive us for being protective.”</p><p>Sierra stared back at her and for a moment wished she had friends such as these four women. Women who might have understood, who might have supported her those months when losing John had hurt so much.</p><p>“I have no designs on your friend,” she told them all clearly. “He’s the one that left Boston, not me. Now, I think it might be a rather good idea if we change the subject.”</p><p>John eased away from the open doorway and glanced back at the men who had followed him down from the top deck, intending to move to the office by the quickest route of straight through the room.</p><p>Instead, he turned, moved quickly to the side of the houseboat, and made his way to the back.</p><p>Son of a bitch, he’d heard the pain in her voice and he hated it, just as he was certain the others had heard as well. He was coming to the conclusion that something more than he remembered had definitely happened that night in Boston when she had come to his apartment.</p><p>He knew Sierra. He knew her like he had never known another woman, and he knew a simple case of him passing out on her wouldn’t have produced this result.</p><p>“Boy, you have something to fix with that girl,” Timothy muttered as John pushed open the glass sliding doors off the back deck.</p><p>“Let it go, Cranston,” he ordered.</p><p>“We’re going to back him this time, John,” Dawg stated, his deep voice quiet, intense. “That girl sounded as lost as a whipped puppy, and you know that’s not going over real well.”</p><p>The four men behind him were protective, especially of women. As John understood it, they always had been, even during their wild, often lascivious pasts.</p><p>“Let’s concentrate on finding out who the hell is trying to kill her, then I can concentrate on making damned sure I don’t lose her,” he growled as he turned back to the other six. “Can you give me that much?”</p><p>They stared back at him with varying degrees of suspicion.</p><p>“We’ll give you that time, JW,” Cranston drawled. “And if she runs back to Boston in tears, then we’ll see just how hard we can kick your damned ass.”</p><p>John didn’t doubt that in the least.</p><p>“Here’s what we have,” Dawg stepped in. “There were definitely prints on the shoreline, though someone tried to brush them out. By the position our watcher was sitting in, they were watching your boat, and they were there for a while. One set of prints, definitely male, I’d say about a size ten maybe eleven, it was hard to be sure with the deliberate attempt to erase them.”</p><p>“Ms. Genoa is still in town as well,” Timothy informed him. “She was going into the Mackay Café for lunch as I headed here.”</p><p>“She’s been there every day for the past four days,” Faisal broke in, his tone hushed. “She asks questions about John Walker and if he has a lover, who his friends are, though many simply shrug, and others tell her to ask him herself.” Faisal was likely one of those “others” if his mocking smile was anything to go by.</p><p>“No one knows you have anyone on the boat with you, that I can tell,” Rowdy told him. “There’s no gossip about it at the marina. Most people here really don’t give a damn, but I doubt they’d lie if asked, if they have seen her.”</p><p>John shook his head. “She’s been inside so far. The doctor should be here later this afternoon to check her out, then maybe it would be a good idea to pull out for a while.”</p><p>“Not yet.” Natches shook his head then. “Dawg and Christa are keeping Bliss for me tonight, Chaya and I are going to do a little midnight hunting. Just keep her inside, keep the curtains pulled, and we’ll do the rest.”</p><p>“I hate this.” He pushed his fingers restlessly through his hair. “I want to catch the bastard myself, but damn if I want to leave her alone long enough to do it.”</p><p>He would trust the other men to look after her at any time, but he knew Sierra would start asking questions if they did. And he didn’t want the fight that would come with it. He had a very bad feeling she would head straight back to Boston if she knew the trouble had followed her there.</p><p>“Let us take care of this, John,” Natches stated, his voice hard. “If things start to look dangerous, we’ll reassess then. Right now, we’re just watching. Agreed?”</p><p>At any other time, John would have never trusted that statement from a wild-assed Mackay, but he knew since they’d found the women who held their hearts, each of them was more careful.</p><p>He nodded slowly.</p><p>“And while we’re all watching your back, why not see what you can do to hold on to that girl,” Dawg ordered him in a slow, lazy drawl. “She suits you, John. She suits you real good.”</p><p>And she did. That was something John knew all too well. Sierra suited him far too much.</p><p>NINE</p><p>She had always suited him.</p><p>John watched Sierra with the wives and children of the friends who were more like brothers to him. He’d always fought that knowledge, and now, he simply couldn’t understand why. He’d wasted so many years of his life running from the one woman he knew now was meant to be his world, and he didn’t even know why. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A bachelor’s self-preservation perhaps. It was damned hard to acknowledge that a woman can strip your soul down to its base level, but she could rebuild it as well.</p><p>As the boat emptied of the chaotic Mackay clan and friends, John acknowledged the things he hadn’t wanted to face before the night Sierra had forced the breakup of his engagement to Marlena.</p><p>He almost grinned at the thought. She had no idea that she’d done him a great favor that night, and it had taken him a while to realize it, too, he admitted.</p> <p>It hadn’t been the loss of Marlena that had affected him so severely, though. It had been the realization that Sierra would risk their friendship, risk everything basically, to save him from a marriage doomed to failure.</p><p>He had known that night. That unacknowledged part of himself he had hidden from for so long had known that not just his bachelor days were over, but his heart was caught. And it was caught by a tiny bit of a woman who had been a part of his life for as long as she had been alive.</p><p>Securing the houseboat, doors locked, drapes drawn closed, he made his way to the bedroom, where Sierra had already retired.</p><p>Stepping into the large, open room, he was caught by the quiet pain in her face as she sat in the recliner next to the wide, securely draped windows, and stared at the dark material.</p><p>“If I weren’t here, you’d have the curtains back and the windows open,” she said softly. “The breeze from the lake would drift inside and you’d be at peace.”</p> <p>“I’m at peace now, Sierra. It’s not open windows or a breeze that brings that peace, baby. It’s what’s inside a man or a woman’s soul.”</p><p>And how the hell had he ever realized that?</p><p>“You’ll never move back to Boston, will you?” she whispered, her gray eyes lifting, her somber expression filled with a particular sadness. “When this is finished, you’ll stay here. This is your home now.”</p><p>“It’s my home now,” he agreed as he moved across the room and took a seat in the chair that sat facing her. “But I’ll visit.”</p><p>Her lips tightened as a small, almost hidden flinch crossed her expression.</p><p>“I never truly thought you’d stay away forever,” she said. “I thought you’d come back. That one day, someone would tell me you had moved back into your penthouse, that you were back in the office. That you were home.” She rubbed at the fingernails of one hand with the pads of the fingers of the other. “That’s not going to happen, is it?”</p> <p>He shook his head slowly. “I’d never be happy there again, Sierra,” he told her. “I was never happy there before, I just didn’t know it. You were never happy there, either.”</p><p>She looked up at him in surprise. “It’s home, John. I was raised there.”</p><p>“Were you happy there, Sierra?” He leaned closer. “Do you have friends there?” He placed his fingers over her lips as she started to protest. “Who did you go to when I left? Who did you go to, Sierra, when I passed out on you just after penetrating you?”</p><p>She paled.</p><p>John had suspected, but he hadn’t wanted to admit he’d been such a complete fucking fool.</p><p>He cupped her face gently. “I was completely drunk.”</p><p>She swallowed tightly and the distress in her pretty eyes tore at his heart.</p><p>Pushing the wild blue-back ringlets back from her face, John saw the indecision, the fears.</p> <p>“What did I do to you that night, Sierra?” he asked gently. “Did I hurt you?”</p><p>“Physically?” Her lips thinned. “No, John, you didn’t hurt me.”</p><p>But he didn’t remember, and she wondered if he would even believe she had been a virgin.</p><p>She didn’t want to talk to him right now. There was too much inside her, too many emotions she didn’t want to deal with tonight.</p><p>“Why are you keeping all the curtains closed?” She changed the subject, stared around the room then back at John as she fought the questions in his eyes.</p><p>“Perhaps I’d prefer no one sees or hears the pleasure I give you.” His lips curled in amusement.</p><p>Shaking her head, she stared around again. “We don’t have sex twenty-four-seven, John.”</p><p>She wanted the truth. She sensed it, she could feel it, just as she sensed the fact that he had disappeared with his friends that afternoon for a reason.</p><p>He watched her thoughtfully for several long moments as Sierra wondered if he would continue to try to lie to her.</p><p>“I think the boat is being watched. I want to keep you hidden for a few more days until we figure out exactly who is watching and why.”</p><p>The knowledge, though she expected it, was still a shock to her. She stared back at him, fighting the sense of impending panic trying to rise inside her.</p><p>Someone was watching the boat, and had been only since her arrival.</p><p>“It wasn’t just a random crime, was it?”</p><p>The attack had been planned. That meant someone specifically wanted to hurt her.</p><p>“This is my fault, Sierra,” he said quietly. “I’m sorry.”</p><p>“Your fault.” She shook her head in confusion. “How can this be your fault?”</p><p>“I think you were targeted because of me. Someone wanted to get back at me.”</p><p>She blinked at him. Get back at him?</p><p>“Who would want to get back at you?” She shook her head in confusion. “And why use me? John, do you realize how little sense that makes?”</p><p>She couldn’t imagine any reason why anyone would think she could be used to strike back at John.</p><p>For a moment, she watched the banked fury in John’s gaze and realized he wasn’t joking. He meant what he was saying.</p><p>“John, that’s insane.” She shook her head at the thought of it. “There’s no reason anyone would believe I could be used against you.”</p><p>“Except Marlena.”</p><p>Marlena? “But a man attacked me.”</p><p>“A man I suspect she hired or was associated with,” he stated. “Your attack has been investigated by a former agent of the Department of Homeland Security as well as Father. What was learned is that Marlena is connected to an organized crime family, Sierra. A very distant relation, but one all the same. Her marriage to me would have allowed her the chance to move up in that family. A renowned attorney, the Walker money, the backing of a highly respectable law firm. She was banking on that marriage for more than one reason.”</p><p>There had always been rumors that the Genoa family was related to organized crime, but it had never been proven.</p><p>“Her father never seemed like a criminal,” she whispered.</p><p>John’s lips twisted with an edge of rueful amusement. “James Genoa is as honest as the day can be long, Sierra. That doesn’t mean the rest of the family is, and it doesn’t mean that Marlena isn’t determined to recover the status she had before her father’s losses several years before.”</p><p>What the hell was going on?</p><p>Rising to her feet, Sierra paced across the room, staring at the draped windows, feeling closed in, feeling that same anger rising inside her as she realized that, once again, Marlena was winning. She had won the first time when she managed to get John’s ring on her finger, the second time when John had taken Sierra and hadn’t even remembered it.</p><p>She was winning now. She was winning because Sierra wouldn’t have the chance to gain his heart. By the time this was over, he would be eager to rid himself of the trouble she brought to his life.</p><p>“Wonderful.” Mockery filled her, surprising even herself with the depth of it. “Just what the hell I needed—Marlena Genoa screwing up my damned summer.” She almost laughed. She would have laughed, but even mockery could fire enough amusement for that. “You know, John, for as long as I’ve known her, she’s been a pain in my ass!”</p><p>John stared back at Sierra in surprise. This wasn’t exactly the response he’d expected. And he’d be damned if he’d ever seen Sierra quite this angry. Or this strong.</p><p>There was no fear, there were no tears.</p><p>“I thought it was a random crime.” She threw her hands up as she turned back to him. “I couldn’t imagine what I had done, or why it was happening to me. I couldn’t figure it out. I couldn’t figure out how I had been careless enough to allow myself to be targeted, you know?”</p><p>He tilted his head and stared back at her curiously.</p><p>“Random crime doesn’t exactly happen that way, Sierra,” he pointed out, trying to hide his amusement.</p><p>Here was his Sierra. Angry, yes, but that fire, that flame of stubborn determination, was back in her eyes. And there was something more.</p><p>Her hands were propped on her shapely hips. “To me, it would,” she snapped back at him. “I’m careful. I rarely talk to strangers. I stick to what’s safe. Haven’t I always stuck to what was safe? Admit it.”</p><p>“Oh, I admit that.” He nodded. And it was the truth. Sierra was perhaps one of the most cautious people he knew, outside of her questionable choices in sex partners. As she said, she rarely took chances.</p><p>“She was cheating on you. She was marrying you for your money and whatever the hell she needed to get into some stupid crime family, and she was using your so-called best friend to screw you over, and she thinks I should pay for this?”</p><p>His brows lifted. “You always were one to catch on rather fast,” he pointed out, holding back a chuckle.</p><p>Her eyes narrowed on him.</p><p>“How many men do you think I’ve been with, John?” she asked then.</p><p>The question surprised him.</p><p>“What does it matter?” It wasn’t something he wanted to think about. He didn’t give a damn how many men she had been with, and he didn’t want to know.</p><p>“I deserve an answer to that question.”</p><p>“At least three,” he snapped back. “You weren’t exactly trying to hide it when you were with Bobby Worthington. Jack Marsden, Martin Kincade. And if there were more, I don’t want to know about it.”</p><p>Sierra glared back at him. “Wrong.”</p><p>“What the hell do you mean, wrong?” Damn her, she made him crazy. She could make him see red faster than any other woman in his life.</p><p>“Figure it out, dummy,” she snapped back at him. “Because I’m not explaining it.”</p><p>She wasn’t explaining anything to anyone anymore. Bobby had started out as a friend until he told everyone he had slept with her. The other two had been close, she admitted. There had been a chance of a relationship with them, until for one reason or another, seeing John again had interfered in it. Reminded her of what she wanted, who she wanted, and she had broken it off.</p><p>Now she was paying for what she hadn’t done.</p><p>Well, she wasn’t paying for it, except for the fact that John would never believe she had been a virgin that night.</p><p>Damn Marlena Genoa. She had managed to completely fuck Sierra’s life up and she hadn’t even really tried until now.</p><p>John’s arms crossed over his broad chest.</p><p>“You know, Sierra, I remember why you make me crazy,” he growled. “You have to be one of the most stubborn women I’ve ever met.”</p><p>“I’m not one of anything,” she informed him heatedly. “Trust me, John, I am the most stubborn woman you’ll ever meet, you’ve just never pissed me off enough to prove it until now.”</p><p>“Hell, Sierra.” He couldn’t blame her. His own decisions had slashed back on her with a vengeance. “I can’t even blame you for being pissed.”</p><p>“And of course, you think it’s because that cow Marlena might have hired someone to attack me.” The complete disgust in her voice surprised him. “John, sometimes you’re such a man that it’s completely infuriating.”</p><p>“What the fuck!” He couldn’t hold back an incredulous laugh at this point. “What the hell else could you be pissed over? Sierra, dammit, if I’d had any idea you’d be hurt . . .” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Her hand slashed up, the flat of her palm held out to him so decisively that he simply shut up. Hell, his mother used that signal for complete silence. It was almost impossible to disobey.</p><p>“This has nothing to do with the attack and everything to do with something you wouldn’t know if it slapped you right upside the face,” she informed him, the haughtiness in her voice having what he imagined was the completely opposite effect of what she was going for.</p><p>Because he wasn’t in the least chided. Hell now, his dick was straight up, as hard as iron, and throbbing with a force he’d never experienced before.</p> <p>The need to possess her, to have her, to stoke that wild, brilliant light in those dark gray eyes was suddenly almost impossible to resist.</p><p>This effect she had on him was only growing stronger with no peak in sight. Each day, each hour, each moment he was with her, and he only wanted her more.</p><p>“I’d know a lot of things without being slapped upside the face with it, lollipop.”</p><p>Sierra caught the rakish sound of his voice, the carnal glimmer of hunger in those wild violet-blue eyes, and felt the defiance brewing inside her rising.</p><p>It had something to do with his complete arrogance. Never had John shown this side of himself so clearly. It was normally subtle, normally less blatant. Normally less challenging.</p> <p>Now, it seemed to fill the entire room, making it hard to breathe, hard to think of anything but the man, the hunger, and the need to claim him.</p><p>She was sure he thought he was claiming her. There was a male superiority about him that had the potential to set her teeth on edge.</p><p>“And what do you think you know?” she snapped back. “Trust me, John, when it comes to me, there’s so little you know that it’s not even funny.”</p><p>“I know you love me. I know you’ve loved me most of your life and you’ll always love me. That I know for a fact.”</p><p>Sierra froze. She could feel something crashing inside her, cracking through her heart. He knew that, and yet, he’d left her?</p><p>“How long have you known?” Her breath stilled in her chest. There didn’t seem to be enough oxygen left in the room to fill her lungs.</p> <p>“Hell.” He breathed out roughly as he stared back at her, his fingers plowing through the overly long strands of his hair. “This isn’t where I meant this to go, Sierra. This is my fucking fault, and I’m sorry as hell.”</p><p>She shook her head. “I don’t want your apology. You didn’t tell Marlena to make that decision and you didn’t ask her to screw around on you. I want to know how long you’ve known that I’m in love with you.”</p><p>She had loved him all her life; that was no less than the truth. He was her first love, and no matter how this worked out, no doubt John would be her only love. He would be an incredibly hard act to follow for any man.</p><p>His gaze seemed to sharpen before he shook his head again. “I knew the first night you were here and you gave yourself to me, despite the bruises, despite being attacked. I know you, Sierra, you wouldn’t have done that without a trust that goes with love.”</p><p>“According to you, I’ll fuck anything in pants anyway,” she burst out. “How did that tell you any damned thing?”</p><p>Fury flashed through John. Stalking to her, he caught her upper arms, jerked her to him, and glared into the challenge of her furious gray eyes.</p><p>“I’ve never said that,” he gritted out between teeth clenched in fury. “I never suggested anything so vile of you, Sierra.”</p><p>“You may as well,” she cried back. “You believed every man who ever claimed to have been in my bed. As far as I’m concerned, you may as well call me a whore outright.”</p> <p>“Sierra, you all but lived with those three men.” He was going to pull his own hair out as soon as he fucked the defiance out of her tempting little body. “And what the hell does it matter if you did? Do you think I hold it against you?”</p><p>She tried to jerk out of his grip. Not fucking happening. He’d been damned if he was going to let her roll right over him this time. Her temper had always infuriated him even as it fascinated him, but this time, she wasn’t even coming close to winning this argument.</p><p>“Do I think you what?” She was incensed and completely gorgeous. “You really think I’d give a damn if you did? No, jack-ass, my problem is the fact that I didn’t sleep with them.”</p><p>The words were out of her mouth before Sierra could stop them or call them back, causing her to follow up with a quick, “I had better taste in men.”</p><p>His brows lifted. That look on his face was completely irritating.</p><p>“Baby, I really don’t care who you slept with before me.” Pulling her closer, he glared down at her in determination. “Who you sleep with now is all that matters to me.”</p><p>How the hell had she managed to turn this around? Where had it gone so impossibly crazy?</p><p>Sierra, John admitted. She made him crazy. So crazy that rather than arguing with her further, he decided that the best way to convince her exactly how possessive he could be was to show her.</p><p>His lips covered hers as his head bent, his arms surrounding her and pulling her closer against his harder, broader form. God, she felt like living silk and satin against him. Like the most perfect bit of passion he had ever had in his arms.</p><p>Sweetly curved lips parted beneath his, a temptress’s tongue licked at his, drawing him inside the heat of her mouth, daring him to possess her.</p><p>She made him feel alive. Even more than the mountains around him, she filled him with that extra something his soul hungered for. That sense of peace he had never truly known until he had her in his arms.</p><p>Just as he had never known the true measure of his own sexual and emotional hunger for her until now. She was a perfect fit for his life, against his body, in his bed.</p><p>She wasn’t timid. He would run right over a timid woman. She was fiery, passionate, and she was his. She could say what she wanted, she could think what she wanted, she belonged to him, and John intended to claim each and every ounce of the hunger he could feel inside her.</p><p>“Feel this,” he snarled as his head lifted. “What I’ve fought for as long as you’ve been an adult, Sierra. Feel what I fought without knowing what the hunger inside my own fucking soul actually was. Do you think I’d ever, for so much as a second, question anything or any man that came before me?”</p><p>Her fingers clenched in his hair as some ragged emotion tore through her gaze. “Feel me, John, and see if I give a damn.”</p><p>She jerked his head down, her tongue licked over his lips, and the challenge coupled with the lust, the emotion, and the pure fiery heat consumed him.</p><p>It consumed them both.</p><p>TEN</p><p>She definitely gave a damn.</p><p>Anger, hurt, and determination rose inside her like a chaotic storm she had no chance of holding back.</p><p>A part of her wondered if she could blame him for his perceptions, while another part yelled, “Hell, yes,” she could blame him. He had taken her virginity. He had been the first and he had been too damned drunk to remember it.</p><p>He remembered everything but that, and perhaps that was what pissed her off. That anger only seemed to feed the hunger, though. There was something about being touched by John that was unlike any other sensation she knew, any sensation she had ever imagined before him.</p><p>She’d experimented before, but no kiss had ever been like this. Long and devouring, lips and tongues meeting, mating, starving for more touch, for more taste.</p><p>She should have more pride, she told herself.</p><p>Another part argued, what did pride have to do with this pleasure?</p><p>Arching into his arms, her arms twined around his neck, her fingers pushing into his hair to hold on tight as he swept her from her feet and moved quickly to the bed with her.</p><p>Her back met the mattress as he came over her, his fingers hooking in the band of her light pants and pulling them from her hips, pushing them down her legs as she pushed her sandals from her feet.</p><p>Her own hands were busy. Pushing his T-shirt to his shoulders, he jerked back from their kiss long enough to strip it and her own shirt from their bodies before he was kissing her once again.</p><p>His kisses were wild.</p><p>She loved them.</p><p>Running her hands along his upper back, the feel of his muscles flexing beneath her palms sent a shaft of pure heat racing to her womb, to her pussy.</p><p>Her thighs tightened on the heavy leg insinuated between hers, her hips lifting, falling, pressing into the hard muscle as it caressed the flaming bud of her clit through the silk of her panties.</p><p>“You always make me feel as though I’m burning alive.” She couldn’t hold the words back as his lips parted from hers, moving along her jawline with stinging little kisses as she writhed in pleasure, rubbing her nipples against his harder chest.</p><p>“God, Sierra.” He paused above her, his gaze locking with hers. “You’re like a flame yourself. So fucking hot and sweet.”</p><p>Her neck arched for his lips before her head turned, her lips moving to his shoulder, nipping at the hard flesh as she fought to taste just as much of him as he touched of her.</p><p>She could feel the complete hunger brewing inside him, feel the tension tightening his muscles as it burned through her.</p><p>Before she could do more than gasp, he was rising, coming to his knees as he straddled her waist, his cock sliding between her breasts as he pushed them together to create a snug enclosure for the raging, burning flesh.</p><p>Sierra’s head lowered. Tucking her chin against her chest, she covered the very tip with her lips, licking at it with her tongue.</p><p>She hadn’t expected this. She knew he was wild sexually; if he had heard lies about her, then she had heard nothing less than blow-by-blow dissections of his sexual exploits from the lovers he had left behind. As though they thought by telling her, they could somehow make themselves feel better that they had lost him.</p><p>“Damn, your pretty lips.” He pressed her breasts farther together, slid the head of his cock deeper between her lips, and groaned as she sucked it firmly.</p><p>The taste of him was like cinnamon and a mountain breeze. The slight salty male taste of pre-come met her lips. The essence of him exploded against her tongue, filled her senses, and amped the raging hunger higher than before.</p><p>“How fucking pretty,” he groaned. “Do you know what it does to me, Sierra, to see those pretty lips wrapped around my dick?”</p><p>She knew what the feel of it was doing to her. Sensuality, sexuality steamed around her, through her, until she felt as though she were burning alive.</p><p>His hips moved, the feel of his cock tunneling between her breasts, the head fucking into her mouth, and she could feel her juices flowing freely between her thighs.</p><p>The turn-on value was out the roof. Sierra’s stomach clenched tight as her tongue stroked over the tip of his cock, her lips parting over the wide head. She was starving for the taste of him, dying for the touch of him.</p><p>“Sierra, sweet baby.” He pulled back before she could stop him, her back rising from the bed as she fought to taste him once again.</p><p>Moving down her body again, his lips went to her nipples, sucking them into his mouth, tonguing them, drawing at the tight, hardened buds and exciting the already sensitive nerve endings.</p><p>She needed this. She needed him.</p><p>His lips moved lower, calloused palms pushing her thighs apart as his tongue swiped through the narrow slit of her pussy. Electricity sizzled through her body. Pleasure raced through every nerve ending until she arched against his mouth, fighting for more sensation, for more touch.</p><p>“I want your tongue,” she moaned. “Inside me, John. I want your tongue inside me.”</p><p>She wanted it all. She wanted every touch.</p><p>“John!” She cried out his name, her fists clenching in the sheets beneath her body as his tongue drove inside her.</p><p>Once buried in the sensitive channel of her pussy, he licked, slowly. His tongue flickered against tissue so sensitive it was nearly painful as she arched her hips, trying to drive his tongue deeper. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The licking strokes against the tender walls had her hips writhing against him. Each devastating thrust burned brighter inside her, pushing her higher.</p><p>John pushed her legs back, spreading them farther, lifting her pussy higher to allow his tongue to fuck inside her deeper, harder.</p><p>Sierra could feel her orgasm rising, brewing in her womb, tightening through her body. She was dying. She needed more—deeper, tighter. Her pussy tightened around his tongue reflexively as the strokes became harder.</p><p>“Don’t stop!” she cried out in protest as his head suddenly rose.</p><p>He knelt between her thighs, draped her legs over the tops of his, gripped his cock, and pressed it against the clenching opening of her pussy.</p><p>John stared down at the darkening of Sierra’s gray eyes, the innocent pleasure, the flush and uninhibited response, and for a second, the briefest moment, he remembered that night. Kneeling between her thighs, and then it was gone.</p><p>It was washed away by the heat of her juices touching the head of his cock, her pussy milking at it, attempting to draw it inside.</p><p>John pressed closer, his teeth clenching as his gaze lowered to where he was taking her, slowly. He wanted to take her slowly, wanted to feel every nuance of the pleasure racing through his body.</p><p>John felt the fist-tight heat enveloping him, felt her muscles caressing each particle of flesh as he pressed inside her.</p><p>Her hips arched to him, taking each inch with hungry desperation as her cries echoed around him.</p><p>He remembered this.</p><p>John shook his head, sweat dampening his body now as memory and reality began to converge.</p><p>His hips jerked, driving his cock deeper as pleasure locked around the hardened shaft. It felt as though a million pinpoints of electric sensation were attacking the portion of his cock buried inside her.</p><p>His hand clenched on her hips as he fought to take her slow, easy.</p><p>“Never needed like I need you,” she cried beneath him. “John, never known anything like this.”</p><p>A growl tore from his lips. “Sweet baby. I didn’t know pleasure like this existed. Sweetest, tightest little pussy.”</p><p>He slammed in deeper, almost burying himself to the hilt as he fought to breathe, fought to keep his come from spilling inside her.</p><p>He had condoms now. He’d made certain to have Dawg bring a box. But he’d already taken her bare, he already knew the pleasure of having her naked, and being sheathed. And sweet heaven, this was so much better.</p><p>Pulling back, he thrust deep and hard inside her once again, burying in deep and hard and snarling with the extremity of the pleasure.</p><p>“Sierra, fuck,” he groaned. He couldn’t do this. Reaching across the bed, he snagged one of the condoms from the bedside table and fought to pull back.</p><p>It took all he could do to pull back, to release her.</p><p>“John.” Her hand touched his. “It’s not the same.”</p> <p>Innocence. Pure sweet love and innocence filled her face as she stared back at him, her breathless words striking his soul with the force of a fist.</p><p>“I won’t let you go, Sierra,” he snarled possessively. “Do you understand me? If you become pregnant, I will never let you go.”</p><p>“Do you want to let me go, John?”</p><p>“Hell no.”</p><p>One hard stroke and he was buried inside her once again. Deep. He could feel her womb pressing against the tip of his cock. Delicate, tight flesh milked at his dick, stroked it, sucked at it.</p><p>John knew he couldn’t hold back. He was dying to thrust into her with all the speed and strength he possessed. The hunger raging so deep, so hot, inside overwhelmed him.</p><p>Sierra threw her head back against the pillow as he began moving inside her, thrusting into her pussy, separating the tender muscles with hard strokes of pleasure-pain and sizzling heat.</p><p>Her hips lifted, her heels digging into the mattress as she moved into each thrust, feeling him fuck her with the same desperation she could feel tearing through herself.</p><p>Each pounding thrust threw her higher, raced through her, until her orgasm slammed through her system with such force that she was trying to scream his name as it ruptured inside her.</p><p>At the same time, she felt his release overtake him as well. Each hard spurt of his semen inside her burned, fiery blasts that extended her release, threw her higher, exploding through her body with a force that had stars exploding before her eyes.</p><p>Shudders wracked her body as he came over her, pulling her tight against him as his hips continued to rotate, thrust, sink his cock inside her, his semen spurting inside her until finally they both collapsed against the bed in exhaustion.</p><p>He held her.</p><p>Sierra was aware of the fact that John wasn’t letting her go. His body covered hers, sheltered her.</p><p>His cock was still buried inside her, the feel of him still trying to catch his breath matched her own.</p><p>There was something . . . Sierra let her fingers curl at the nape of his neck, stroking his hair. There was something different this time, as though emotions held in check by both of them were slipping free without their volition.</p><p>“I fought this,” he whispered at her ear. “I fought it, because I looked at you, Sierra, and saw all the ways I could never make you happy then. All the ways I’d end up destroying us both because you were so sweet, your emotions so tender. And I felt so hard inside.”</p><p>Her eyes closed as hope and need began to build inside her.</p><p>“I made excuses.” He kissed the shell of her ear. “I tried to tell myself we were friends. That you were as close as a sister, but all the while, I knew better.”</p><p>Her breathing hitched at the admission.</p><p>“I hated who I was, and every time I saw you, heard your laughter, saw your smile, glimpsed that core of pure sweet love inside you, you shamed me.”</p><p>His head rose then.</p><p>Sierra promised herself she wasn’t going to cry. She wouldn’t cry.</p><p>“I left Boston to give you time,” he finally admitted, those violet-blue eyes nearly glowing in his sun-darkened face. “I would have been back. I was afraid of what had happened that night, that perhaps I had hurt you, said something cruel out of my own stupidity. But I would have never let you go completely. Do you understand me? I would have been back soon. And I would have caught up with you.”</p><p>“I wouldn’t have run again,” she admitted, fighting those tears. “I missed you, John. I missed you until a part of my soul was withering away without you.”</p><p>“And there was no peace inside mine,” he confessed. “Because you weren’t here, baby. You weren’t in my arms.”</p><p>“How fucking sickeningly sweet. I’m going to puke.”</p><p>John froze at the sound of the feminine voice behind them. He felt Sierra still, felt the fear that suddenly transformed the relaxed, sated curves of her body.</p><p>Moving quickly, he jerked around, keeping Sierra close behind him as he faced Marlena and the weapon she held in her hand, aimed directly at his head.</p><p>Marlena smiled. “How careless John. Just because you lock the doors and set an alarm doesn’t mean it can’t be broken. When you have the right friends, you can acquire the most amazing little toys to access damned near anything you want.”</p><p>Meaning those friends had given her the state-of-the-art electronics it would have required to get past his locks and security.</p><p>That gave him a chance, because it also meant the Mackays had been sent a silent alarm warning them of the break-in. He just had to hold out until they arrived.</p><p>“You figured it out, didn’t you, John?” Marlena sneered, her once pretty features twisted with such vile jealousy and greed that for a moment John wondered how he had ever believed the woman attractive. “That’s okay. You’re the only one. You and Miss Goody Two-shoes behind you. Bitch.”</p><p>“Marlena, you’re making a very big mistake,” he warned her.</p><p>“No, darling, you made the mistake the night you fucked that little whore in Boston.” She smiled with icy intent. “Because I simply can’t let that little slut win. I won’t let her get away with all the plans she destroyed. Which means now, both of you simply must die.”</p><p>ELEVEN</p><p>Sierra stared back at the impeccably dressed Marlena Genoa and wondered exactly how such insanity could have been missed. Was it detectable in the genetic strand perhaps? Scientists should create a test for it to ensure that such children are carefully overseen and raised to control their own reckless impulses.</p><p>Then again, insanity born of greed, a lust for power, and overconfidence likely wasn’t truly part of the human genome. Too bad, because the world would have benefited had Marlena’s madness been detected.</p><p>Sierra stared over John’s shoulder with the faintest feeling of morbid curiosity, wondering what Marlena was actually going to do with that gun in her hand.</p><p>“Have you lost your mind, Marlena?” John’s tone seemed entirely too controlled for the situation. Yet Sierra knew this tone of voice. It had a hard, icy edge that concealed pure fury. He was in control. He was planning. And God help the person he was planning against.</p><p>Unfortunately that person seemed to have the upper hand for the moment. The gun she was holding trumped any amount of unarmed fury that John might possess.</p><p>Fortunately for them both, Sierra was rather confident of the fact that John was saner, and therefore, possibly had a much better chance of coming out of this. She just hoped he could pull both of them out of it alive.</p><p>“Really, John, did you truly believe I’d give up so easily?” Marlena propped a slender, graceful hand on a silk-clad hip, her nails tapping against the material of her white slacks as her gaze narrowed on him. “You know, I really thought you’d come to your senses, return home, and realize what an incredibly stupid mistake you had made. The advantages of marrying me were by far better than becoming some Kentucky hick bumming on a lake with his little whore. And a virgin to boot?” She laughed as Sierra flinched. “I returned to the penthouse, bitch, and found the bloodstained handkerchief.” She glanced at John again. “You never even knew did you?”</p><p>“I’ve always known.” The answer shocked Sierra. Was he saying that only to throw Marlena off, or did he truly remember?</p><p>Marlena shook her head. “What a mistake.”</p><p>John’s shoulders were tense beneath Sierra’s hands. Whatever he was planning, he would move quickly, she thought. She dug her nails into his flesh. If he moved, Marlena would shoot. Sierra could see it in her eyes.</p><p>“And what mistake would that be?” The deceptive laziness in his tone was actually frightening.</p><p>“Leaving me, of course, especially for that little twit you’ve been screwing nonstop for the past few days. Are you two related to rabbits by chance?” There was genuine confusion in her voice. “Really, John, it’s disgusting how often the two of you have been fucking. It’s rather nasty, if you ask me.”</p><p>The disgust in her voice, in her expression, proved she actually believed her opinion. The woman couldn’t have a truly sensual bone in her body. Making love with John was like flying.</p><p>“I don’t remember asking her,” Sierra pointed out, unable to keep her mouth shut at this point. “And since when does she find sex disgusting?”</p><p>Wow. This woman had been in John’s bed and she hadn’t even enjoyed sex? She and John were going to have to discuss this later.</p><p>Marlena narrowed her gaze as her lips curled into a sneer. “Still such a stupid little virgin. Sex for its own sake is a waste of time and energy,” she snapped. “The two of you have been wasting both, no doubt.” The gun lifted. “But since you have so little time left, what does it really matter?”</p><p>Sierra didn’t think John’s shoulders could tense further, but they did just that. They felt like iron or steel as she clenched her fingers around him.</p><p>“What do you think that gun is going to accomplish, Marlena?” John asked then. “Killing us? It will get you nothing but a fucking prison sentence. If you live long enough, that is.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Deadly, uncompromising, it was a warning Sierra would have definitely heeded if she were in the other girl’s shoes.</p><p>Marlena’s answer was another classic sneer.</p><p>“I would have never been forced into this decision if you had just returned to Boston and resumed the engagement as you were supposed to do. You could have fucked your little bunny all you wanted to then and I would have been all for it. All I needed was your ring and your influence, darling.”</p> <p>“As long as you and your little crime family had their greedy fingers in my bank account you mean?” John growled.</p><p>Surprise glittered in Marlena’s eyes. “You think it was your money I wanted?” A light laugh left her lips. “Darling, it wasn’t that. It was your prestige, your law firm, it was your sterling reputation and your ability to save the worst of the criminals from their own crimes. My family needed your legal abilities, not your money.”</p><p>John stared back at his ex-fiancée in shock. He couldn’t believe the words coming out of her mouth.</p><p>“What the hell makes you or your family think I would have ever defended them? What the hell makes you think you’re going to fix the problem by threatening us?”</p><p>“I’m not simply going to threaten you, I’m going to kill you, John,” Marlena promised him. “I made a lot of promises to my family, and there are very few ways to make up for the fact that I couldn’t deliver. Killing you is one of them.”</p> <p>John stared back at her silently for long moments. “You’re telling me they demanded you kill me?”</p><p>She rolled her eyes. “I’m telling you I broke a promise and now I have to prove my loyalty to them in another way. This is the only way I have of doing so. There are very few entrances into this world, John. And if getting what I want means I have to bloody my hands a bit, then so be it.”</p><p>“And that’s all life means to you?” he asked her, suddenly realizing that her apparent lack of emotion truly went clear to the soul.</p><p>The realization didn’t surprise him, though he imagined it should have. After all, he had been engaged to her, and hadn’t known the true measure of the woman she was.</p><p>Marlena shook her head at his question. “I didn’t say I would enjoy killing you, John.” She glanced back at Sierra. “Though I believe I will truly enjoy killing your little sex bunny. I think I want to hurt her first though. Hurt her in ways she can’t even imagine for daring to attempt to take what was mine.”</p><p>The hell she would.</p> <p>As though Marlena weren’t holding a gun, John reached over, snagged his pants from the floor, and making certain he was between Marlena’s gun and Sierra, pulled them on and zipped up.</p><p>“Do you think you can keep sheltering her, John?” Marlena asked curiously. “Once I put a hole in your heart, I will have a clear shot to your little whore.”</p><p>Marlena peeked around John’s shoulder and smiled back at Sierra.</p><p>Sierra hadn’t moved. She sat with the sheet pulled to her breasts, simply watching Marlena. There was a strange glint to her gaze, a darkening of those marbled gray eyes that warned John she was up to something.</p><p>He just prayed it was something that wouldn’t get her killed.</p><p>Turning his gaze back to Marlena, he stared at the gun once again. She was too far away from him to jump her. He wouldn’t have a chance of getting to her before she fired.</p><p>“John, I know you so well,” Marlena murmured. “Well enough that we’re going to take your little houseboat from the docks and go down the lake a bit. I’d hate to have anyone see me leaving once I’ve completed this little task.”</p><p>He shook his head. “I’m not going to cooperate with this, Marlena. You’re not going to kill anyone.”</p> <p>Her smile was condescending. “Don’t test me, John. I know your guilt complex. I was going to be nice and kill you first, but if you keep pushing, then I’ll kill your little whore first and make you watch.”</p><p>John’s jaw clenched. He was growing sick of hearing Sierra referred to as a whore.</p><p>Marlena laughed. “I can see how irritated you’re becoming, lover.”</p><p>John shook his head again. “Not irritated, Marlena, confused perhaps. What makes you think I’m going to allow you to do any of this?”</p><p>He was perhaps two feet closer. Not nearly enough.</p><p>From his periphery he glimpsed Sierra moving. She pulled his robe from the headboard, slid to the edge of the mattress, and began putting it on slowly, drawing Marlena’s gaze.</p><p>Marlena laughed. A light, amused sound. “Do you truly think I’m here alone, John?”</p><p>Fuck. He had hoped she was there alone. He had prayed she was.</p><p>As Sierra tied the belt of the robe around her waist, another figure moved up the stairs. John wasn’t surprised. He’d be damned if anything could surprise him at this point.</p><p>Gerard. He wanted to disbelieve the fact that his former friend was actually there, but he couldn’t quite do it.</p><p>“You’re taking too long,” Gerard snapped at Marlena. “I’ve untied the boat and we’re ready to move out. Bring them downstairs.”</p><p>John stared at the other man, gauging the icy, merciless intent in his face, and John knew there was the possibility he and Sierra were really fucked now.</p><p>“Why, Gerard?” That part made very little sense.</p><p>Gerard glanced back at him coolly. “Who do you think chose you for Marlena to go after? Who do you think is her backer in the organization, John? Her reputation wasn’t the only one damaged here. The only way to fix this is to get rid of you.” He glanced at Sierra. “And your troublemaking little bitch.”</p><p>Where Marlena had appeared almost playful, Gerard was deadly serious.</p><p>“See, none of this makes sense,” John pointed out. “You should have been smart enough to know that even if I had married her, I would have never let her use me.”</p><p>“You would have once she had a child,” Gerard informed him. “As you said, I know you, John. And I know your weaknesses.”</p><p>Yes, he did. John would have protected his child, but never by allowing himself to be manipulated. He would have found a way to resolve any threat. But how the hell was he supposed to resolve this one?</p><p>“Let’s go.” Gerard stepped back and motioned to the stairs. “The security on the controls requires a passcode that my electronics hasn’t cracked yet and I’m growing impatient. You’re going to input the code or Sierra’s going to die right in front of your eyes.” He smiled. “And I know about the fake codes on these boats, John. Push those numbers in, and you’ll regret it.”</p><p>But Gerard didn’t know about Natches Mackay and his little paranoias. Paranoias that had caused the other man to tinker a bit with the security he’d had installed.</p><p>Waiting for Sierra, John kept her close to his side as they moved to the stairs, his hand at her waist tightening, warning her to caution.</p><p>Moving to the living area, John walked across the floor to the console that sat off the sitting area with its old-fashioned ship wheel, controls, and monitors.</p><p>He placed Sierra in front of him and started praying.</p><p>Turning the key, the monitor flashed the demand for the passcode and John punched in the code that would immediately alert the Mackay family that the need for help was now dire. But if they hadn’t arrived yet, there was a chance they were too far away to arrive at all.</p><p>It also slowed down the motor, which chugged sluggishly.</p><p>“What’s the problem?” Gerard’s voice vibrated with anger now. “Don’t play games with me, John.”</p><p>“It’s not a game, Gerard,” John snapped back. “You should have done your homework. I haven’t had this boat out of the marina but twice this summer for a reason.”</p><p>That reason being that he’d been helping the Mackays on various projects, but no one should know that. And if he knew Gerard, the man hadn’t done his homework. That was normal for him, come to think of it.</p><p>Turning the motor over again, he played it out as long as possible, pushing buttons, staring at the monitors in confusion. It wasn’t going to last much longer. Where the hell was the cavalry when he needed them?</p><p>In front of him, Sierra’s hand covered his as he laid it comfortingly against her hip and moved it lower with a subtle nudge. Then lower.</p><p>John barely held back his response to the feel of the gun in the pocket. He hadn’t forgotten about it, it was simply that he normally kept the weapon on the bottom shelf of the bed table.</p><p>He hadn’t been able to get to it himself because Marlena had been watching so closely. But John had been shielding Sierra as she moved from the bed and evidently she had managed to slip it from the shelf.</p><p>His resourceful little Sierra.</p><p>He fiddled with the key, tapped a monitor, pushed his hand into the pocket of Sierra’s robe, and gripped the gun.</p><p>He would only have a second.</p><p>He had to find a way to take out Gerard, and hopefully to disarm Marlena in no more than a second or two.</p><p>That first moment of surprise would be the only chance he had.</p><p>“I’m going to need to check the electronics,” he sighed, glancing back to Gerard.</p><p>“And that would be where?” Gerard asked icily.</p><p>“Below the controls.” John nodded to the small door at the bottom of the console.</p><p>“Move back.” Gerard waved the gun at him.</p><p>John and Sierra did as he said as Marlena moved closer, her weapon pointing toward them, her gaze hardening.</p><p>“Please don’t try anything, John,” she warned him quietly.</p><p>Gerard knelt, worked the panel loose, and John moved.</p><p>As he did, mayhem suddenly exploded through the boat.</p><p>The long, wide window at the side of the console shattered as a hard male form launched itself into the room. The front door burst in and John jumped for Gerard.</p><p>He had almost moved too late. Gerard was coming up with the weapon when John jerked hold of him and slammed his head into the console as the gun went off.</p><p>John felt the bullet tear along his bicep, the fiery blaze of pain shocking him for a moment, giving Gerard the opening he needed to come back.</p><p>Another gun fired.</p><p>Gerard stared at John in shock, in surprise, as a bloom of red began to stain across the perfectly pressed white silk shirt he wore.</p><p>In the distance, he heard Marlena screaming in denial as Dawg Mackay quickly restrained her. She was fighting him tooth and nail, screeching when Sierra walked up to her and smacked her full handed across the face with enough force to immediately shut her up.</p><p>Gerard fell to the floor of the boat, his gaze sightless. Marlena shut up, thankfully, and Sierra turned back to John.</p><p>“It’s over now,” she said softly, those gray eyes so filled with pain that his heart broke for her.</p><p>TWELVE</p><p>Sierra felt John lift her in his arms and move to the couch where he sat down with her, holding her close against him, breathing deep and hard as Dawg Mackay pushed a restrained Marlena into a chair on the other side of the room.</p><p>“How fucking romantic,” she snarled. “You’re so weak, Sierra. So stupid. Do you truly believe fucking him is going to hold him to you?”</p><p>She didn’t. She had always known better. It wasn’t fucking him that would hold him to her.</p><p>“Loving him will be enough.”</p><p>Marlena laughed at that.</p><p>“Shut the fuck up, Marlena.” John’s voice held a vein of weariness. “Your little games are over, and I’ve simply had enough of your mouth for the moment.”</p><p>“You stupid country hick,” she cried out. “You could have had everything with me.”</p><p>“He could have had nothing.” Sierra pulled herself from John’s grip, stood, and glared at the other woman in rising fury. “You’ve destroyed Gerard, yourself, and now you actually believe you would have done anything but destroy John?” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You moralistic little bitch,” Marlena screamed as the Mackays and Timothy Cranston stared at her in loathing and pity. “You’re as ignorant as he is. He fucked you and passed out, he didn’t even remember he’d had you.” She laughed as Sierra flinched. “You’re such a stupid little whore.”</p><p>“I remembered.”</p><p>Sierra whirled around, staring back at him in surprise as his arms came around her.</p><p>There were too many witnesses she thought. He was lying to help her save face, nothing more.</p> <p>“I remembered,” he swore, staring down at her as she fought to believe him. “I was drunk as hell, baby, it just took time, but nothing that important, nothing that special to me could have been forgotten for long.”</p><p>His fingers touched the single tear that fell from her eye as those behind her were forgotten. Nothing existed but John. Nothing existed but the fact that he was holding her, that he was there, that he loved her. And that he remembered.</p><p>“You’ll regret it,” Marlena suddenly laughed behind her. “Love wears off, trust me, I know.” The bitterness in her voice was self-explanatory.</p><p>Turning back to her Sierra stared back at Marlena with true pity. Nothing could have hurt worse in Sierra’s life than losing John forever, but never would she have destroyed herself to get back at him.</p><p>“True love doesn’t wear off,” she told Marlena. “It doesn’t strike back, and it keeps the heart warm, even when it wants to forget, when it wants to stop hurting. You never loved anyone but yourself.”</p> <p>The sound of sirens outside, the rush of officers nearing the boat drew her attention. It was over. The danger was gone. If John asked her to leave, if he decided their time ended with the summer, then she would face it with no regrets.</p><p>It would break her heart. It would destroy her. But the love she felt for him would never allow her to harm him or to strike back at him.</p><p>Marlena stilled as the officers came through the shattered door. Her gaze flashed with fear before she turned to John with a twisted smile.</p><p>“I’ll never see prison,” she whispered.</p><p>“I’m afraid you will,” he promised her.</p><p>She shook her head. “They won’t let me live long enough.”</p> <p>John watched, almost smiling as Timothy Cranston stepped forward. Calculated interest filled his expression. “We could discuss that, Ms. Genoa,” he stated with such false innocence that the men in the room couldn’t help but chuckle. “We can discuss that in depth.”</p><p>ONE MONTH LATER</p><p>Sierra watched, a small smile on her face as the Walker clan, including John’s sister, Rogue, and her husband, Sheriff Zeke Mayes, filled the huge backyard of Dawg Mackay’s two-story ranch house. The Walkers weren’t the only ones there. The entire Mackay clan, including Faisal, Natches’s adopted son, the four precocious toddlers, and Timothy Cranston’s lady friend, as well as a young woman he called his adopted daughter, mingled around the tables of food and the pool, and lounged in the comfortable patio furniture set out.</p><p>It was a true barbeque. This was no catered affair. Sierra had been at the house for the past two days. Sierra, Rogue, Kelly, Christa, Janey, and Chaya had helped the men prepare for what they called a family reunion.</p><p>She’d never been to a family reunion, and she had to admit, she was rather enjoying this one.</p><p>John Calvin Walker Sr., “Calvin” to everyone here but his wife, watched the children, his two grandchildren as well as the Mackays’ toddlers with a small smile as he sipped the clear, homemade liquor Dawg had supplied him with.</p><p>Sierra had never seen him in jeans until today. Even Brianna Walker wore jeans, a smile, and a ponytail. She looked as though she had come from the same mountains her husband had been born in.</p><p>“It’s about time you managed to snag John’s heart.” Rogue moved up to her, brushing back her long red-gold hair, her gaze affectionate and filled with warmth as she gave Sierra a quick hug. “I swear, I thought my big brother was a goner when he gave Marlena that ring.”</p> <p>“John was too smart for her.” A satisfied smile curled Sierra’s lips.</p><p>She’d learned to live for the moment. She didn’t ask for promises, she never hinted for any from John. It was enough to have each day as it came. To store each memory, each touch, each kiss, just in case he asked her to leave.</p><p>“He was indeed,” Rogue agreed. “You love him terribly, don’t you, Sierra?”</p><p>She and Rogue had always been friends. No one could have missed her more than Sierra had when she had left Boston so long ago.</p><p>“With all my heart,” Sierra agreed.</p><p>“He loves you,” Rogue told her then.</p><p>Sierra nodded. He told her often that he loved her. He held her, even when she had nightmares, drew her into every facet of his life, and gave her a sense of contentment that she had never known.</p><p>But he asked for nothing. No commitment, no nothing. And the time was coming that she had to make a decision. She had a career to return to, a job; she couldn’t live off John, and she wouldn’t live off him. But she couldn’t make the final move without an invitation, without some sort of commitment from him.</p><p>“It’s so great to see you together.” Rogue hugged her again. “And I’m so looking forward to having you here. You can help decorate the new house.”</p><p>Sierra kept her answer vague and once again pushed back the unsettling thought that perhaps John didn’t want her to stay. Maybe he hadn’t asked for a commitment because he didn’t want one.</p><p>“Ah, I see my honey calling me.” Rogue moved away, drawing Sierra’s gaze to Zeke Mayes as he motioned to his wife.</p><p>John was moving across the lawn as the music blaring from the speakers at the side of the house quieted and everyone turned to her.</p><p>“Hey, lollipop,” John whispered in her ear as he kissed her cheek. “Ready to have some fun?”</p><p>“With you?” She laughed back. “You’re always fun, dummy.”</p><p>“I’m about to become more fun.”</p><p>He knelt in front of her as he caught her left hand.</p><p>Sierra stood in shock, her heart suddenly hammering against her chest, throbbing in her throat as she stared down at him.</p><p>“You enrich me, Sierra Lucas,” he suddenly announced. “You break the rules, you made my heart full, and you bring me a peace I only dreamed of having.”</p><p>Oh God.</p><p>She couldn’t cry.</p><p>She stared down at him, barely daring to breathe as he held her hand in his and lifted his free hand.</p><p>“Sierra Lucas, I’ve requested the approval of your godfather for your hand in marriage. And I now ask you, the other half of me, the one woman that completes me.” A ring slid on her finger. “Will you marry me?”</p><p>She stared at the ring in awe. A single diamond surrounded by deep, violet-blue sapphires. It was the heirloom engagement ring John Walker had purchased when he made his first million. A legacy for his wife to pass on to their son’s wife.</p><p>The antique ring had been fashioned in the sixteen hundreds, the burnished gold rich with age and priceless sentiment, and it now sat on her finger.</p><p>“Don’t leave me cold, Sierra,” John whispered as he stared up at her. “Don’t let me ever have to exist without you again.”</p><p>She could feel the eyes watching them, and she didn’t care.</p><p>She could feel the men’s amusement, the women’s interest, and none of it mattered.</p><p>“I love you,” he stated. “With my heart, my soul. Forever.”</p><p>Her lips trembled as a tear fell from her eye.</p><p>“Yes.”</p><p>He didn’t give her time to say anything more.</p><p>He was on his feet, she was in his arms, and he was twirling her around as the sunlight glinted blue off the diamond, and struck fire to the sapphires as she curled her arms around his neck and buried her head against his shoulders.</p><p>And the tears fell then.</p><p>Happy tears. Tears of joy, of love, of all the hopes and all the dreams she had ever harbored inside her.</p><p>They all existed here, in this man’s arms, in the fiery love he gave and the sense of belonging.</p><p>She was adrift no more.</p><p>“I love you.” Her arms tightened around his neck. “So much, John. I love you so much.”</p><p>He sat her gently on her feet, framed her face with his hands, and let his lips touch hers. “Until the day after forever, Sierra. I’ll love you until the day after forever.”</p><p>And that was all that mattered.</p><p>Her lips parted beneath his as his tongue licked against them and he gave her another of those naughty kisses she loved so much. Deep, powerful, filled with love, arousal, heat, and a promise.</p><p>A promise to love her until the day after forever. </p> </body></html>"]