["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>PROLOGUE</p><p>Reyes, once an immortal warrior for the gods, now possessed by the demon of Pain and living in Budapest, entered his bedroom. He was drenched in sweat and panting from the force of his workout. Because he could not experience pleasure without physical suffering, the burn in his muscles had excited him.</p><p>As always, his gaze sought out his woman and he palmed the blade they preferred to use during their loveplay. She was sitting at the edge of their big bed, lovely features drawn tight as she studied the canvas in front of her. A canvas she’d propped on an easel and lowered so that she had a direct view. Blond hair fell to her shoulders in wild disarray, as if she’d tangled her fingers through the thick mass multiple times, and she was chewing on her bottom lip.Sex could wait. She was troubled, and he would be unable to think of anything else until he’d solved this dilemma for her. So he sheathed the blade.</p><p>“Something wrong, angel?”</p> <p>Her eyes lifted and landed on him, worry in their emerald depths. She offered him a small smile. “I’m not sure.”</p><p>“Well, why don’t I help you figure it out?” Anything that bothered her, he would dispatch. No hesitation. For her happiness, he would do anything, kill anyone.</p><p>“I would like that, thank you.”</p><p>“Shall I shower before I join you?”</p><p>“No. I like you just how you are.”</p> <p>Darling woman. But he didn’t like the thought of dirtying her pretty clothes. He quickly grabbed a towel from the bathroom and rubbed himself dry. Only then did he settle behind his woman, his legs encasing hers, his arms wrapping around her waist. Breathing deeply of her wild storm scent, he rested his chin in the hollow of her neck and followed the direction of her gaze.</p><p>What he saw surprised him.</p><p>It shouldn’t have. Her paintings were always vivid. As the All-Seeing Eye, an oracle of the gods and one of their most cherished aides, she could peer into heaven and hell. And did, every night, though she had no control over what she witnessed. Past, present, future, it didn’t matter. Every morning, she painted what she’d seen.</p><p>This one was of a man. A warrior, clearly. With that muscle mass, he had to be. A gold collar circled his neck, cinching tight. He was on his knees, legs spread. His arms rested on his thighs, palms raised. His dark head was thrown back, and he was roaring up at a domed ceiling. In pain, perhaps. Maybe even fury. There was blood smeared all over his chest, seeping from multiple wounds. Wounds that looked as if his skin had been carved away.</p><p>“Who is he?” Reyes asked.</p><p>“I don’t know. I’ve never seen him before.”</p> <p>Then they would reason this out as best they were able. “Was he from heaven or hell?”</p><p>“Heaven. Definitely. I think he’s in Cronus’s throne room.”</p><p>A god, then? A few months ago, Titans had overthrown the Greeks and seized control of the divine throne. So, if this man was in Cronus’s throne room, chained up, hurt, and Cronus was leader of the Titans, that must mean the warrior was a Greek. A slave who had been punished, perhaps?</p><p>“You saw only this image?” Reyes asked. “Not what got him to this point?”</p><p>“Correct,” Danika said with a nod. “I heard him scream, though. It was...” She shuddered, and his arms squeezed her in comfort. “I felt so sorry for him. Never have I heard so much rage and helplessness.”</p><p>“We can summon Cronus.” Cronus wasn’t too fond of Reyes and his fellow Lords of the Underworld—the very men who had opened Pandora’s box, unleashing the evil from inside. The men who had then been cursed to carry that evil inside themselves. But the god king hated their enemy, the Hunters, more, because Danika had seen Galen, the leader of the Hunters, chop off Cronus’s head in a vision. Now the god king was determined to kill Galen before Galen could kill him. Even if that meant soliciting the aid of the Lords. “We can ask him if he knows this man.”</p><p>A moment passed while Danika pondered his suggestion. Finally, she sighed, nodded. “Yes. I’d like that.” Then she surprised him by turning to him and offering the sweetest smile he’d ever seen. Well, all of her smiles were that way. “But it’s too early in the morning to summon anyone, and besides, I think you had other things on your mind when you entered the room. Why don’t you tell me about them?” she suggested huskily.</p><p>He was rock hard in seconds—that’s what she did to him. “That would be my pleasure, angel.”</p> <p>She pushed him to his back, smile widening. “And mine.”</p><p>CHAPTER ONE</p><p>“Be still, Nike. You’re only making this worse for yourself.” Atlas, Titan god of Strength, stared down at the bane of his existence. Nike, Greek goddess of Strength. His godly counterpart. His enemy. And an all-around grade-A bitch.</p><p>Two of his best men held her arms and two held her legs. They should have been able to pin her without incident. She was collared, after all, and that collar prevented her from using any of her immortal powers. Even her legendary strength—strength that was not on par with his, thank you. But never had a female been more stubborn—or more determined to fell him. She continually struggled against their hold, punching, kicking and biting like a cornered animal.“I will kill you for this,” she growled at him.</p><p>“Why? I’m not doing anything to you that you didn’t once have done to me.” Motions clipped, Atlas tore his shirt over his head and tossed it aside, revealing his chest, the ropes of his stomach. There, in the center, in big black letters spanning from one tiny brown nipple to the other, was her name, spelled out for all the world to see. N.I.K.E.</p><p>She’d branded him, reduced him to her property.</p><p>Had he deserved it? Maybe. Once, he’d been a prisoner in this bleak realm. In Tartarus, a divine dungeon. He’d been a god overthrown and locked away, forgotten, no better than rubbish. He’d wanted out, and he had been willing to do anything to see it done. Anything. So he had seduced Nike, one of his guards, using her feelings for him against her.</p><p>Though she would deny it now, she truly had fallen a little in love with him. The proof: she’d arranged his escape, a crime punishable by death. Yet she’d been willing to risk it. For him. Only, just before she could remove his collar, allowing him to flash himself away—moving from one place to another with only a thought—she discovered that he had also seduced several other female guards. Why rely on one to get the job done when four could serve him better?</p><p>He’d counted on the fact that none of the Greek females would want their affair with an enslaved Titan known. He’d counted on their silence.</p><p>What he should have done was count on their jealousy.</p><p>Nike had realized she’d been used, that his emotions had never really been engaged. Rather than throw him back into his cell and pretend he did not exist, rather than have him beaten, she’d had him held down and marked permanently.</p><p>For years he’d dreamed of returning the favor. Sometimes he thought the desire was the only thing that kept him sane as he wiled away century after century in this hellhole. Alone, darkness his only companion.</p><p>Imagine his delight when the prison walls began to crack. When the defenses began to crumble. When their collars fell away. It had taken a while, but he and his brethren had finally managed to work their way free. They’d attacked the Greeks, brutally and without mercy.</p><p>In a matter of days, they had won.</p><p>The Greeks were defeated and now locked exactly where they’d locked the Titans. Atlas had volunteered to oversee the realm and had thankfully been placed in charge. Finally, his day of vengeance had arrived. Nike would forever bear his mark.</p><p>“You should be grateful you’re alive,” he told her.</p><p>“Fuck you.”</p><p>He smiled slowly, evilly. “You’ve done that, remember?”</p><p>Her struggles increased. Increased so viciously she was soon panting and sweating right alongside his men.</p><p>“Flip her over,” he ordered them. No mercy. Atlas didn’t have the patience to wait until she tired. “I’ll just keep tattooing until my name is clear enough to satisfy me.”</p><p>With a frustrated, infuriated screech, she finally stilled. She knew he spoke true. He always spoke true. Threats were not something he wasted his breath uttering. Only promises.</p><p>“That’s a good girl.” Atlas strode forward and ripped the cloth from her back. The skin was tanned, smooth. Flawless. Once, he’d caressed this back. Once, he’d kissed and licked it. And yes, being with her had been more satisfying than being with any of the others, but he would not be ruled by his dick and release her before branding her, all in the hopes that he could get her into bed again. He would do this.</p><p>“That’s not what I did to you,” Nike rasped. “I didn’t mark your back.”</p><p>“You would rather I brand your lovely breasts?”</p><p>At that, she held her tongue.</p><p>Good. He didn’t want to mar her chest. Her breasts were a work of art, surely the world’s finest creation. “No need to thank me,” he muttered. He held out his hand and someone slapped the needed supplies in his palm. “At least you won’t have to look at my name every day of your too-long life.” As he had to do.</p><p>“Don’t do this,” she suddenly cried. “Please. Don’t.” She turned her head and there were tears in her brown eyes.</p><p>She wasn’t a beautiful woman. Could barely be called pretty. Her nose was a little too long, and her cheeks a little too sharp. She had ordinary brown hair cut to hit her too-wide shoulders, and the body of a warrior. But there was something about her that had always drawn him.</p><p>He rolled his eyes. “Dry the fake tears, Nike.” And he knew they were fake. She wasn’t prone to displays of emotion. “They don’t affect me and they certainly don’t become you.”</p><p>Instantly her eyelids narrowed, the tears miraculously gone. “Fine. But I will make you regret this. I vow it.”</p><p>“I’m looking forward to your attempts.” Truth. Sparring with her had always excited him.</p><p>Without a single beat of hesitation, he pressed the ink gun just below her shoulder blade. His grip was steady as he etched the outline of the first letter. A. Not once did she flinch. Not once did she act as if she felt a single ounce of pain. He knew it hurt, though. Oh, did he know. To permanently mark an immortal, ambrosia had to be mixed into the colored liquid and that ambrosia burned like acid. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She remained silent as he finished each of the outlines. Silent, still, as he filled in the letters. When he finished, he sat back on his haunches and surveyed his work: A.T.L.A.S.</p><p>He expected satisfaction to overtake him, so long had he waited for this moment. It didn’t. He expected relief to overwhelm him; vengeance had been achieved. It didn’t. What he didn’t expect was a white-hot sweep of possessiveness, but that’s exactly what he experienced.</p><p>Nike now belonged to him. Forever. And all the world would know it.</p> <p>CHAPTER TWO</p><p>Nike paced the confines of her cell. A cell she shared with several others. Knowing her temper as intimately as they did, they were careful to stay out of her way. Still. Roommates sucked. She could feel their eyes boring into her robe-clad back, as if they could see the name now branded there.</p><p>If they dared say a single word about it...There hadn’t been enough cells to contain all of the Greeks, so they’d been crammed into each chamber in groups. Male, female, it hadn’t mattered. Maybe the Titans hadn’t cared about the mixing of the sexes, or maybe they’d done it to increase the torment of each prisoner. The latter was probably the case. Husbands had not been paired with wives and friend had not been paired with friend. No, rival had been paired with rival.</p><p>For her, that rival was Erebos, the minor god of darkness. Once, Erebos had treated her like a queen. Once, she’d really liked him. Had even considered marrying him. But then she’d fallen in love with Atlas—that womanizing, lying bastard Atlas—so she’d cut Erebos loose. Then she’d discovered that Atlas had never really wanted her, that Atlas had only been using her. Love had quickly morphed into rage.</p><p>The rage, though, had eventually cooled. She’d forgotten him. For the most part. Now, with his name decorating her back, she hated him with every fiber of her being.</p> <p>Maybe—maybe—she’d overreacted when she’d done the same to him. Branded him forever. Impulsiveness had always been her downfall, after all. For years, she’d even regretted her decision. Not that she would ever admit such a thing to him. Regret was not what she felt now, however.</p><p>She hadn’t lied to him. She would kill him for this.</p><p>First, she would have to find a way to remove the stupid collar around her neck. As long as she wore it, she was powerless. Second, she would have to find a way to escape this realm.</p><p>The first, in theory, should have been easy. Yet she’d already tried clawing and beating at it, and had even attempted to melt it from her neck. All she’d done was cut her skin, bruise her tender flesh and singe her hair off. The second, in theory and reality, seemed impossible.</p><p>Her gaze circled her surroundings. After the Titans escaped, they’d reinforced everything. How, she didn’t know. The prison was supposedly bound to Tartarus, the Greek god of Confinement who’d once kept guard over the Titans, and when he’d begun to weaken for no apparent reason, the realm had weakened, as well. Everything in it became structurally unsound. But now, Tartarus was missing. The Titans didn’t have him and no one knew where he was. There was no reason the realm should be as strong as it was in his absence.</p><p>The walls and floor were comprised of godly stone, something only special godly tools—tools she didn’t have—could break through, and yet, even without Tartarus’s presence, there was not a crack in sight.</p> <p>The thick silver bars that allowed a glimpse of the guard’s station below had been constructed by Hephaistos, and only Hephaistos could melt such a metal. Unfortunately, he resided somewhere else. As with Tartarus, no one knew where. Still, without Tartarus, she should have been able to bend that metal. She couldn’t; she’d already tried.</p><p>“Could you settle the hell down?” Erebos grumbled from one of the cots. From his dark hair to his dark skin, from his handsome features to his strong body, he was the picture of unhappy male, all of that unhappiness pointed at her. “We’re trying to plan an escape here.”</p><p>They were always planning an escape.</p><p>“Besides,” he continued, “your ugly face is giving me a headache.”</p><p>“Go suck yourself,” she replied. Though she’d been the one to hurt him all those centuries ago—unintentionally—he’d repaid her a thousand times over. Purposefully. Not emotionally, but physically. He liked nothing better than to “accidentally” trip her, bump into her and send her flying, as well as to eat what little portion of food was meant for her before she could fight her way to the front of the line, starving her. If she hadn’t been wearing the collar, he never would have been able to do those things. She would have been too strong. Another reason to despise her captivity.</p><p>“Sucking myself would probably elicit better results than when you did it,” he retorted.</p><p>The handful of gods and goddesses around him snickered.</p><p>“Whatever,” she said, as if the taunt didn’t bother her. Except, her cheeks did flush. She was the epitome of strength—or she was supposed to be—and she’d always been more mannish than feminine. That was why Atlas’s attention had so surprised and delighted her. That gorgeous man could have won anyone, yet he’d chosen her. Or so she’d thought. And she’d fallen for his act because he’d somehow made her feel like a delicate, beautiful woman.</p> <p>Just then, Atlas strode into the guard’s station. She didn’t have to see him to know. She felt him. Always she felt his heat. When her gaze found him, she discovered that he had his arm wrapped around a leggy blonde. A blonde who cuddled herself into his side as if she belonged there—and had rested there many times before.</p><p>The thought angered Nike. It shouldn’t have; she despised Atlas with all of her being and didn’t care who he slept with. Didn’t care who he pleasured. And yes, he would have pleasured the blonde with those talented hands and seeking lips. He was an amazing lover whose touch still haunted Nike’s dreams. But there it was. Anger.</p><p>She didn’t mean to, but found herself striding to the bars and gripping them for a better, closer look at him. Three other guards stood around him, all talking and laughing. While prisoners wore white, guards wore black, and he wore that darkness well. It was the perfect complement to his dark, chopped hair and sea-colored eyes.</p><p>His face had been chiseled by a master artist, everything about him perfectly proportioned. His eyes were the perfect distance apart, his nose the perfect length, his cheeks the perfect sharpness, his lips the perfect shape and color and his chin a perfect, stubborn square.</p><p>She should have known he was playing her the moment he’d turned those dangerous eyes on her and they lit with “interest.” Men just didn’t look at her like that. Not even Erebos had, and he had loved her.</p><p>“Bastard,” she muttered, the curse for both the men in her past.</p><p>As if he heard her, Atlas lifted his gaze. The moment their eyes met, she wanted to release the bars. She wanted to step away, out of sight. But she didn’t allow herself that luxury. That would have been cowardly, and this man had seen her weak one too many times.</p><p>Just to taunt him, and hopefully make him feel as out of control as he always made her feel, she allowed her attention to fall to his chest, exactly where her name rested. She smiled smugly before raising her gaze and arching a brow. Score. A muscle ticked in his jaw.</p><p>What does your lover think of your mark? she wanted to shout. What does the blonde think of my name on your body?</p><p>He jerked the stupid blonde deeper into his side and, without breaking eye contact with Nike, planted a lush, wet kiss on her mouth. Of course, she reacted as any other woman would have. She wrapped her arms around him and held on for dear life. As Nike well knew, that man could make a woman come with the expertise of his kiss.</p><p>Nike’s anger intensified. Had she been able, she would have stomped down there and ripped them apart. Then she would have killed them both. Not because she wanted Atlas for herself—she didn’t—but because he was clearly using yet another woman. Passion did not glow from his expression. Only determination did.</p><p>Nike would be doing the female population a favor by snuffing him out.</p><p>“Erebos,” she called. “Come here. I want to kiss you.”</p><p>“What?” he gasped out, his shock clear.</p><p>“Do you want a kiss or not? Get over here. Quickly.”</p><p>There was a rustling of clothing behind her and then her former lover was beside her. He was a prisoner, and sex was a rarity. He would take what he could get, even from someone he loathed. That much she knew.</p><p>Nike turned to him; he was already leaning down. Like the blonde, she wrapped her arms around her companion’s neck and held on tight. Only, she didn’t enjoy the kiss, familiar as it was. Erebos’s taste was too...what? Different from Atlas’s, she realized, and that ratcheted her anger another notch. No man should have that much power over her.</p><p>Still. She let Erebos continue. Atlas needed to realize that she no longer desired him. He needed to realize that he would never, never play her emotions again. She was not an idealistic little girl anymore. He’d made sure of that.</p><p>CHAPTER THREE</p><p>Rage. Absolute rage filled Atlas. He released his companion—he couldn’t recall her name—and she gasped in protest at the abruptness of his actions. He didn’t bother explaining what he was about as he stomped away from her. The rage continued to spread as he climbed the stairs that led to the prisoner’s cages and to the cell holding Nike.</p><p>His name was on her back. How dare she allow another man to put his lips on her?When he reached his destination, he raised his arm, and the sensor he’d had embedded in his wrist caused the bars to slide open. Several prisoners were seated against the far wall. Rapturous longing colored their faces as they watched the minor god of Darkness and the goddess of Strength clean each other’s tonsils. So absorbed were they, in fact, that they didn’t rush Atlas and try to escape. Or maybe that had something to do with the pain they would feel if they did so. He had only to press a button, and their collars would ravage their brains.</p><p>Nike moaned, as if she really liked what was being done to her. Red flickered through Atlas’s vision. How. Dare. She. Teeth grinding, he grabbed Nike by the collar of her robe and jerked her into the hard line of his body, away from Erebos. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A gasp escaped her. Unlike when the blonde had gasped, he did not remain unaffected. He wanted to swallow the sound—and do something, anything, to cause Nike to make it again.</p><p>What’s wrong with me?</p><p>“Hey,” Erebos snapped, foolishly reaching for her to finish what had been started. “We were busy.”</p> <p>Scowling, Atlas kicked him in the chest. The smaller man flew backward, slamming into his fellow prisoners. He jumped to his feet to attack, saw who had rendered the blow and stilled, nostrils flaring.</p><p>“Touch her again,” Atlas said, “and I’ll remove your collar—right along with your head.”</p><p>The god paled, perhaps even whimpered. “She wasn’t worth it, anyway.”</p><p>Atlas might kill him for his words, as well.</p><p>“What the hell do you think you’re doing?” Nike demanded, suddenly coming to life and drawing his attention. She whirled on him, glaring up at him. “I can sleep with whoever I want. And hey, I might even pick one of your friends.”</p> <p>Despite her heated words, she wasn’t breathless as she would have been if Atlas had been the one kissing her, and her cheeks weren’t flushed. Her nipples weren’t even hard. Finally, something cooled the hottest flames of his rage.</p><p>“Just zip your mouth.” He latched on to Nike’s upper arm and dragged her out of the cell with him. Automatically, the bars closed behind him.</p><p>“What the hell do you think you’re doing?” she said again, tugging against his hold. She’d never been one to obey him.</p><p>“What the hell did you think you were doing?” he countered. When he reached the bottom of the steps, he stopped. The blonde, who just happened to be the goddess of memory—damn it, what was her name? Mini? No, but close. M and M? Minisong? Closer. Mnemosyne. Yes, that was it—Mnemosyne, as well as the three other warriors chosen to guard Tartarus today, were gaping at him.</p><p>“What?” he snapped. At least Nike stopped resisting him. She stilled at his side, attention darting from him to the others, the others to him.</p><p>“You can’t just remove a prisoner,” Hyperion, god of light, said. He was a handsome man, though as pale as his title suggested, and Nike had better not be eyeing him as a possible bedmate.</p> <p>“I’m not removing her,” Atlas replied stiffly. “I’m relocating her.” To a cell of her own, where no one could put their dirty, disgusting lips on her. Where no one could put their roving hands on her body. There was nothing sexual about this decision, either. He simply didn’t want her experiencing any type of pleasure. She didn’t deserve it.</p><p>“Why?” Mnemosyne regarded him curiously, not a single thread of upset or jealously in her expression.</p><p>Why? he wondered himself. She’d been eager to date him for months, summoning him constantly. Last night, she’d even shown up at his home naked.</p><p>She was beautiful, yes, and he’d almost given in and slept with her. His body had been worked into a frenzy after what had transpired with Nike, and he’d been desperate for release. But before he sealed the deal, he’d sent the determined goddess away. He’d felt too guilty to continue. As if he were cheating on Nike. Which was ridiculous. The only relationship he had with Nike was one of hate.</p><p>Besides, who wanted to spend time with a female who would never forget your mistakes? A female who would remember your every transgression? Not him. Yet he’d flashed to Mnemosyne’s home this morning and asked her to spend the day with him, just so he could bring her to the prison this morning. He’d been strangely jubilant at the thought of parading her in front of Nike.</p><p>So again, he wondered why Mnemosyne did not feel as if Nike were a threat. Though most females didn’t, he knew. He’d heard them talk. Nike was too tall, too muscled, they said. She was too hard, and too coarse. But those were the things that had first sparked his interest in her. She could handle his strength. She gave as good as she got. She would never wither under his glare. She would never run from his anger. She would always face him head-on. And he liked that. A lot. No other female he’d ever encountered had that kind of courage.</p><p>And she was pretty, he thought. Yes, only yesterday he’d thought her barely so, but, just now, that seemed wrong on every level. Only a short while ago, when he’d first walked into the prison, he’d felt her gaze on him and had looked up. For a second, only a second, her defenses had been lowered. She hadn’t known he’d been watching her, so she hadn’t guarded her expression. An expression that had been soft, wistful, her eyes luminous. The sight of her had heated his blood as if he’d been caught on fire.</p><p>That still didn’t mean he desired her, his enemy. The fact that his name was spelled across her back was simply playing havoc with his mind, his sense of possession, he was sure.</p> <p>“Well,” Mnemosyne prompted.</p><p>“Yeah,” Nike said. “We’re waiting for an answer.”</p><p>To what? Oh, yeah. Why was he moving her. He raised his chin, refusing to look down at her. Not that he would have had to look far. At six foot, she was nearly as tall as he was. “I don’t need a reason. I’m responsible for this prison and everyone in it. Therefore, if I want to move you, I can.”</p><p>The last was meant for the Titans. They would do well not to question him.</p><p>Without another word, he dragged Nike away. Where should he take her? To his office, he decided. At the moment, there wasn’t an empty cell in the entire realm.</p><p>“You’re lucky I don’t have that bastard slain,” he said when he was sure the others couldn’t hear him.</p><p>She didn’t have to ask who “that bastard” was. “What for?”</p><p>For touching what’s mine. “He didn’t have permission to consort with you.” Atlas snaked a corner, and there at the end of the hallway was his door.</p><p>“Consort with me?” She laughed without humor. “Oh, wait. I get it. You can screw anyone you want, but I can’t.”</p><p>Good. They were on the same page. “That’s right.” He pushed his way inside and finally released her. His hands itched to return to her, but he kept them at his sides. Rather than settle behind his desk, he faced her, placing them nose to nose. “You are to suffer in solitude.” Gods, she smelled good. Like passion. Pure, white-hot passion.</p><p>“As if. I have more fun with myself, anyway.”</p><p>The image those words evoked nearly sent him to his knees. He should back away. Before he did something stupid.</p><p>Her eyes narrowed. “You haven’t changed, you know. You’re as much of an ass now as you were years ago.”</p><p>“However,” he continued, as if she hadn’t just insulted him. Stupid, be damned. She was here, and they were alone. “If you need to be kissed, I’ll take care of it.”</p><p>CHAPTER FOUR</p><p>There was no time to protest. In less than it took to blink, Nike found herself smashed into the wall, Atlas pressing against her, solid chest to soft breasts, his hands pinning her temples, his mouth slamming into hers. His tongue thrust deep, without warning, forcing its way past her teeth.</p><p>She could have bitten him. Wanted to bite him, actually, and not in affection. She wanted to draw blood, pain. Instead, her body became his slave, as if centuries of hatred hadn’t passed, and she welcomed him inside. She wound her arms around him and arched into his erection. Erection? Oh, yes. He was hard. Hard and long and thick.His taste was decadent, wild and burning, like dark spices. His muscles were tensed under her palms. Up she moved them, until her fingers were tangled in his hair. The short spikes abraded deliciously, causing her to shiver.</p><p>Touch me, she wanted to shout. It had been so long, so damned long, since she’d experienced this. Oh, she’d been with other men since giving herself so foolishly to Atlas, because she’d been searching for something as intense as what they had shared. But each experience had left her hollow, unsatisfied. And then she had been captured—by Atlas himself—and unceremoniously stuffed into this prison.</p><p>With the lack of privacy, there’d been no opportunities to find companionship. Not that she would have wanted to or had even tried. No one drew her anymore. No one but Atlas, damn him.</p><p>Yes, damn him. Him. The man who had held her down only yesterday and etched his name into her flesh. What was she doing, allowing this? He would think she still cared for him. He would think she still pined for him, dreamed of him...craved him. That might be true, curse it, but she would never allow him to know it.</p><p>Panting, she tore her mouth away. “I don’t want you,” she lied. “Let me go. Now.”</p><p>A low growl erupted from his throat. “I don’t want you, either.” Once, twice, he rubbed his shaft against her. “But I’m not letting you go.”</p><p>Tremors slid the length of her spine. Sweet heaven. He’d hit her sweet spot, and sensation rocketed through her. Then one of his hands lowered and cupped her breast, and her knees almost buckled.</p><p>“Why?” The word was a mere whimper. And why was she allowing him the choice? Why wasn’t she ripping away from him? You are Strength. Act like it.</p><p>“Why won’t I let you go?” He rolled her hardened nipple between his fingers.</p><p>That was why she remained as she was, she thought, dazed. The pleasure was building, flowing through her veins, burning her up, recreating her into a new being. Someone who lived for satisfaction alone. Someone who didn’t care that the one responsible for her desire was an enemy.</p><p>“Yes.”</p><p>“I just...I...” Those fingers tightened, stinging her a little. “Just shut up and kiss me again.”</p><p>Their mouths met again, and this time she rose on her tiptoes to meet him. She couldn’t stop herself. As their tongues clashed and warred, he cupped her ass and lifted her feet off the floor. Forcing him to hold her weight would have been fun, but not nearly as pleasurable as winding her legs around his waist and pressing her needy core against his shaft.</p><p>With her braced against the wall, he was able to tunnel both of his hands under her robe. Their bodies were too close together for him to reach her slick center, where she wanted him most, but having his hands on her cheeks, skin against skin, was almost as welcome. He was hotter than she remembered. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>His lips left hers, but before she could moan her disappointment, he was kissing and licking his way down her neck.</p><p>“Yes,” she gasped. “Yes. Like that.”</p><p>“More?” His nose nuzzled the golden slave collar as if it were a trinket rather than a device that could kill her. For once, she even liked the collar.</p> <p>“Yes.” More. At the moment, that was the only word she was capable of. Unless...did he think to make her beg?</p><p>Fury suddenly blended with desire. Well, she would show him. She would beg for nothing. Not even this. Especially this. Not for him.</p><p>“Then more you shall have,” he said, shocking her. He tugged the fabric of her robe down, revealing her breasts. Air hissed through his teeth. “So lovely. So perfect.” His tongue flicked out and circled the nipple he’d pinched just a short while ago. “So mine.”</p><p>Her head fell back, and her nails scratched at his back. So good. The heat...the wetness...the—“Yes!” The suction. He was sucking at her so forcefully, her stomach muscles were quivering. “Atlas,” she groaned. “Don’t stop.” A command, not a plea.</p><p>“I won’t. I can’t.” He straightened, his narrowed gaze suddenly pinning her in place far more effectively than his body. “I want you. All of you.”</p> <p>She struggled to regain her breath. Her senses. “You mean sex?” Yes, yes, yes. Here, now.</p><p>A clipped nod was the only answer she received. She opened her mouth to reply, but somehow found the strength to stop herself. She drank in the sight of him—a sight that delighted her almost as much as it angered her. Angered? Why? His nostrils were flared, his lips pulled tight. He looked as if he barely had himself under control.</p><p>Did he want her that badly? she wondered. Or was he merely that good an actor?</p><p>Yes, she mused darkly. He was that good an actor. And that was where the anger sprang from. He’d looked at her like that once before, the last time they’d had sex. That look had been the catalyst to her decision to free him, despite the consequences to herself. Consequences that could have resulted in a death sentence. But, she’d thought, he truly loves me with the same intensity that I love him. She’d thought anything worth the risk of freeing him. Of possibly being with him for eternity.</p><p>How they would have managed that, she hadn’t known. But she’d wanted to try. He had not.</p><p>Thank the gods she’d encountered one of the members of his skank parade mere minutes after escorting him from the building and into the clouds outside, where he would have been able to flash. He’d still had his collar on—she hadn’t wanted to remove it until they’d bypassed every single guard. That way, everyone who saw them walking together would have assumed she was simply moving a prisoner.</p> <p>But outside, they’d been seen. No one could flash out of or into the prison itself, so everyone had to walk through the front door. Aergia, the goddess of laziness, of all things, had decided to come to work early, surprise, surprise—just to be with Atlas again. She’d stopped Nike to question where he was being taken.</p><p>I’m taunting him with what he can never have again, Nike had claimed.</p><p>The goddess had frowned. Well, take him to my office when you’re done.</p><p>Why?</p><p>The frown became a slow, sensual smile. So I can dish my brand of...punishment to him.</p><p>Dread had sparked inside her. And how do you punish him?</p><p>How do you think? But don’t worry. I’ll leave him begging for more. I always do.</p><p>Atlas had tried to run then, mowing right over them both, but with his collar still in place, he hadn’t gotten far. Nike had locked him back up and, suspicious, questioned all the female guards. Nearly every single one of them had had a go at him. And he’d told them all the same thing: You are beautiful. I want to spend my life with you. All I need is my freedom, and I will be your slave for eternity.</p> <p>So, have sex with him again? “Hell, no.”</p><p>“You want me,” he snapped. His grip tightened on her, his fingers digging deep, bruising. “I know you do.”</p><p>Just like that, she knew what this little make-out session was about. He planned to sleep with her, make her fall in love with him all over again, and then dump her. He’d grind up her pride, spit it out and stomp all over it. All to punish her, she was sure, for daring to tattoo him as she had. Marking her with his name clearly wasn’t enough.</p><p>“Wanting you dead and wanting your body aren’t the same things.” With a sugar-sweet grin, she patted his cheek. “And I can promise you that while I do want the first, I was only teasing you about the second.” Now who was playing who? “So...if we’re done here...?”</p><p>He ran his tongue over his teeth. His arms fell away from her, and he stepped back. She nearly collapsed, but managed to shift her legs and absorb her own weight.</p><p>“We’re done,” he said, his tone clipped. “We are definitely done.”</p><p>CHAPTER FIVE</p><p>Atlas had to empty a cell of its seven occupants and place those gods and goddesses within other, already cramped cells to make a place for Nike. The time and effort was worth it, though. He couldn’t tolerate the thought of her with that bastard, Erebos, doing the same things to him that she’d once done to Atlas.</p><p>Not. Going. To. Happen.And maybe, perhaps, there was a slight chance it had nothing to do with punishing her and everything to do with the pleasure he’d earlier denied. In her arms, he’d come alive. That had happened last time, too, but he’d written it off as prisoner insanity. Now, he couldn’t write it off. He wasn’t a prisoner; he was a warden. He’d come alive, and he needed more. Of her, only her. Yet she claimed she’d merely been playing him.</p><p>He wanted that to be a lie more than he wanted to take his next breath. Which he didn’t understand. She was doomed to spend eternity hidden away, which meant they could not have any kind of life together. Not even if he freed her. He would then be locked away or put to death.</p><p>For a week, Atlas lamented his plight and pondered what to do. All the while, he stayed away from Nike’s new cell. That didn’t stop him from thinking about her, however. What was she doing? Did she think of him? Did she dream of him and that shattering kiss?</p><p>He did. Every time he closed his eyes, he saw the passion glowing from her face. A face that was exquisite. From barely passable, to pretty, to exquisite, all in a week’s time. He shook his head in wonder. But she deserved the praise. Her lashes were long and as rich as black velvet. Velvet that framed sensual chocolate eyes. Her cheeks were smooth, perfect for caressing, and her lush, red lips were sweeter than ambrosia. And all that strength...his shaft filled and lengthened just remembering it. She’d gripped and scratched him with savage abandon. He still bore the marks.</p><p>They definitely weren’t done. Not even close. He had to experience that again.</p><p>Finally, he could stand the separation no longer. Thankfully, his shift was over. A shift that had consisted of walking the prison halls, watching the prisoners inside their cells and ensuring everyone remained calm.</p><p>That should have bored him. After all, he was a warrior. But bore him it didn’t. And that should have irritated him. After all, he’d spent countless centuries in this place and had sworn never to return once he’d escaped. But again, irritation was not what he felt. He’d wanted this job to be close to Nike. To have his vengeance, he’d once told himself. Now, he wasn’t so sure. Today, and all week really, he’d walked the halls invigorated, knowing all he had to do to catch sight of her was turn a corner.</p><p>He hadn’t allowed himself to do so. Until now. Finally, he would see her.</p><p>The moment she came into view, his blood heated, blistering. His breath followed suit, flaming his lungs to ash. She sat atop her cot, arms gripping the rail, knees drawn up while she leaned slightly forward. Her hair was finger-combed to perfection, and her eyes were narrowed, shielding her irises and the emotion banked there, but at least he could see the shadows her lashes cast over her cheeks. Shadows he might trace with a fingertip.</p><p>Oh, yes. She was exquisite.</p><p>“Where’s your girlfriend?” Her voice was smooth as silk. Just beneath that silk, however, he thought he caught a tendril of fury.</p><p>Was she mad that he’d come? Or mad that he’d stayed away so long?</p><p>“I don’t have a girlfriend.”</p><p>She shrugged. “Too bad for you that whores never commit.”</p><p>He knew he was the whore that she spoke of, and popped his jaw. But he deserved that, he supposed. “I did what I had to do to escape, Nike. That doesn’t mean I didn’t feel—” No. Oh, no. He would not go down that road. He hadn’t wanted to feel anything for her, but he had. That hadn’t stopped him from using her, so she’d never like what he had to say about the matter. “I’m sure you’d do anything to escape, as well.”</p><p>Her expression darkened, but she did not refute his words. “So, did you come to free me?”</p><p>“Hardly.”</p><p>“Then why are you here? We have nothing more to say to each other.”</p><p>Because you’re all I think about anymore. He never should have marked her.</p><p>This might have been avoided. Or not. He might have slept with others all those years ago because he’d been desperate to flee this place, but it had been her face he’d imagined when he’d done so.</p><p>Without looking away from her, he leaned back against the bar behind him and crossed his arms over his chest. “There’s plenty to say. About the kiss.”</p><p>She yawned, patting her beautiful mouth. A mouth he wanted all over his body. “I’d rather sleep.”</p><p>So. She still wanted him to think she had been unaffected. Part of him believed it. An insecure part of him that had never really known how to deal with her, his equal in every way. Yes, even strength, though he often liked to deny it. The other part of him, the masculine part, knew she had liked everything he’d done. She’d shouted his name, for gods’ sake, and he hadn’t even made her climax.</p><p>“You’re saying you don’t want me?” he asked as silkily as she had. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Not even a little.”</p><p>“Really?” He rested his fingers at the waist of his pants, twisting the button, and her eyes followed the movement. His cock was already hard, already straining, rising over the top. Moisture glistened there. “Not even a tiny, tiny bit?”</p><p>She gulped. “N-no.” The word was croaked. “But you are. Tiny, that is.”</p> <p>Liar. She did. She wanted him. And he was huge, thank you very much. The sense of possessiveness returned, all the more intense because it was joined by satisfaction. “I’ll have you yet, Nike. That I promise you.”</p><p>“Just...go away,” she said, suddenly sounding almost...dejected. She eased to her side, then rolled to her back, facing away from him. “We’re done with each other. Remember?”</p><p>Wrong move. Seeing her back, even covered by that baggy robe, reminded him of what he’d done and that set fire to his blood anew. Whatever he had to do, he was going to have this woman.</p><p>“I guess we’ll find out,” he told her before walking away.</p><p>CHAPTER SIX</p> <p>Atlas pushed past the double doors that led into Cronus’s throne room. Armed guards, immortal warriors Cronus himself had created, were stationed along the edges of the walls. Each held a spear, and swords swung from the sheaths at their waists. They stood at attention, waiting for an order or a threat. They would spring into action for both.</p><p>Of course, there were also warriors lining both sides of the purple lamb’s fleece carpet that led to the bejeweled dais, crowding Atlas as he made his way forward. His weapons had already been removed, but they were taking no chances, eyeing his every movement with distrust.He wondered if, when she had been a free woman, Nike had ever been summoned to this room, albeit to meet with Zeus, her king. And if she had, had it been for a reward or a punishment?</p><p>Stop thinking about her. Concentrate on Cronus. He’s wily, that one. The god king was not the same man he’d been before his incarceration. The thousands of years inside Tartarus had changed him; he was harder, harsher. Utterly unforgiving. Any weakness, he pounced upon.</p><p>Nowadays, Cronus refused to stay in the heavens without an army to shield him. But then, a man at war with his own wife couldn’t be too careful. Especially when that wife was a queen with powerful abilities and allies of her own. A wife who—</p><p>Dizziness spun through Atlas’s head, fragmenting his thoughts, and he frowned. Frowned but didn’t stop until he reached the end of the fleece. He kept his attention, foggy as it was, fixed on Cronus.</p><p>The king was seated atop a throne of solid gold. Dark strands were threaded through his silver hair, and his beard had thinned since the last time Atlas had seen him. Some of the age lines had even disappeared from his weathered features. He wore a long white robe, much like the prisoners of Tartarus. Why? He’d often wondered.</p> <p>Only two explanations made any sense. He’d worn the garment for centuries and now felt most comfortable in it. Or he did not want to forget what he’d once been—and could be again if he weren’t careful. Atlas had been more than happy to shed his own robe. Would Nike do the same, if ever she gained her freedom? Not that she would.</p><p>You’re thinking about her again.</p><p>A woman stood beside the throne. She possessed one of the plainest faces Atlas had ever seen, and had pale, freckled skin. She was reed thin, with dark, curling hair and delicate shoulders. Power did not hum from her. Rather, she seemed...insubstantial. Ethereal, as he imagined a ghost might look. There, but see-through. There, but wavering. Her eyes were shadowy, vacant, as if no one was home.</p><p>When she reached up and brushed a lock of hair from her brow, he could only gape. The elegance of the movement was awe inspiring. More graceful than a dancer, more delicate than a butterfly wing. Someone was indeed home, she just didn’t care about what was happening around her.</p><p>Atlas pulled his attention from the female and studied the chamber. There were thousands of chandeliers overhead, each dripping with glistening teardrops. Multihued glitter sparkled in the air. Odd, he thought, head tilting to the side for a better view. That air was even sweetly scented with...He inhaled deeply. Ambrosia. Ah. Now he understood the dizziness and the glitter. Dried ambrosia was being pumped through the room. To keep him docile?</p><p>“Atlas, god of Strength,” Cronus said with a nod of greeting, drawing him from his musings.</p><p>Atlas bowed, as was proper. “My king. It’s an honor to have this audience with you.”</p><p>Cronus leaned forward, silver eyes bright with anxiety. “All is well in Tartarus, yes?”</p> <p>“Most assuredly.”</p><p>Relief instantly replaced the anxiety. “Why, then, did you request this meeting?”</p><p>There was no one who hated the Greeks more than this man, this Titan sovereign, and with very good reason. They’d stripped him of his power, humiliated him in front of his people. Even Nike had been a participant.</p><p>Just tell him. Get this over with. “I want to remove a woman from the prison and set her up—”</p><p>“Stop. Stop there.” Scowling, Cronus raised a hand. “There will be no removing anyone from Tartarus. It is too dangerous.”</p><p>He’d expected that answer. However, he persevered. “Perhaps the reward is worth the danger. I would keep her locked inside my home, Majesty. I would never remove her collar—” well, except to whisk her to his home, for she couldn’t be flashed out of Tartarus with it on, but he would recollar her the moment they reached their destination “—and she would be my personal slave. I would ensure her misery.” His first lie of the day, but probably not his last. He only wanted to give Nike pleasure.</p><p>Had he forgiven her for what she’d done to him? He wasn’t sure. All he knew was that he no longer wanted to kill her when he thought about it. He would tire of her eventually, and he looked forward to the day. Until then, this was his only recourse.</p><p>The king ran his tongue over his teeth. “Of which her do you speak?”</p><p>“Nike. Greek goddess of Strength.” He did not allow a single bit of affection to lace his tone.</p><p>The king’s eyes widened. “The one who...” Now those eyes dropped to Atlas’s chest, where his shirt covered his tattoos.</p><p>“Yes. The very one.” Hear my anger, only my anger. Except, what she’d done no longer angered him. The marks were as much a part of him now as his were a part of her.</p><p>“Interesting.” Cronus leaned back in the throne, the picture of contemplation. “Do you not think she is being made to suffer enough inside Tartarus?”</p><p>Time for his second lie. “No. I do not.” In truth, as dejected as she’d sounded at their last meeting, the goddess was suffering. And he didn’t like it.</p><p>“And what will you do to increase her suffering?”</p><p>“Much as she hates me—” desires me, he added inside his head, so that he wouldn’t reveal the depths of irritation thoughts of her possible loathing elicited “—she will take particular displeasure in cleaning my home, preparing my food and warming my bed.”</p><p>The king smiled up at the ghostly girl. “What you’d like to do to your Paris, eh, my Sienna? Make him your slave.”</p><p>Her expression never changed. She offered no response, either.</p><p>Paris who? Atlas wondered, and then shrugged. He didn’t care. Nike was his only concern at the moment.</p><p>“My king?” Atlas prompted. “I lack only your permission to begin Nike’s torment. My determination is unparalleled.”</p><p>Cronus faced him once again, his smile falling away. A minute passed in silence, then another. Then the king sighed. “I’m afraid my answer has to be no. While I like the thought of Nike’s anguish intensified at your hands, I’m unwilling to risk the removal of her collar, even for the few seconds required to flash her. She is Strength, and were she to somehow escape you and free her brethren, another heavenly war would erupt. I cannot afford to have my attention divided now. Well, not any more than it already is. I find I spend most of my time observing the Lords of the Underworld.”</p><p>The Lords of the Underworld? Who were they? Didn’t matter, really. As he’d spoken, Atlas’s own sense of dejection had bloomed. He wanted to stalk up that dais, grab the king and shake him. How dare his request be denied? How dare his desires be discarded? Instead, he said, “Very well, my king. I thank you for your time,” and pivoted on his heel. He strode from the chamber before he did something foolish, as he had done with Nike in his office. Only, his goal would not be climaxing.</p><p>He’d already decided that nothing would keep him from claiming Nike. Now he realized that not even this would do so. The king’s will be damned. He would have his woman, just as he wanted.</p><p>CHAPTER SEVEN</p><p>“Come with me.”</p><p>Nike’s heart raced at the sound of that deep voice. Hesitant, she rolled over on her cot. Sure enough. Her skin tingled when her gaze found Atlas. Gorgeous as ever, he stood at the bars—bars that were now open. His hand was extended, and he was waving her over. There was fury in his too-tight expression.What had she done this time?</p><p>She’d tried to ignore him. She’d tried to pretend that she felt nothing for him. Anything to stop the madness. But gods, she couldn’t stop thinking about their kiss. She couldn’t stop wishing she’d allowed him to take her all the way. That she’d have experienced everything before being taken back to nothing.</p><p>So what if he would have tired of her afterward? So what if he would have been smug about her capitulation? So what if he found someone else and paraded her before Nike? For a few blessed hours—who was she kidding?—for a few blessed minutes, because it wasn’t as if either one of them would last beyond that, she would have known the joy of being with him again. Of simply feeling, giving, taking, sharing...loving.</p><p>Have all the rest, common sense piped up, but deny the love.</p><p>That would be my pleasure. But I have to get him to offer me the rest first.</p><p>“Come,” he repeated.</p><p>What did he have planned?</p><p>Slowly she sat up. Her hair was in desperate need of a brush, and gods, the rest of her needed a shower. How long since she’d had one? Prisoners were given a bowl of water each day and that was it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why?”</p><p>A muscle ticked in his jaw. “Do you want to spend a few hours outside the prison or not?”</p><p>Wait. What? Leave Tartarus? She was on her feet before her brain could process what she was doing. Her knees almost buckled, she’d spent so much time prone, bored, but she managed to stay upright. She even reached out and twined their fingers together. The heat of his skin should not have shocked her, but it did. The calluses should not have ignited a fire in her blood, but they did.</p> <p>“You’re taking me outside?”</p><p>“Yes. But do not say a word when we reach the guard’s station. Understand?”</p><p>“Yes.” This could be a trick. A trick to build up her hopes only to dash them cruelly, but she didn’t care. If there was a chance, slight though it was, that he would actually stay true to his word, she would do anything he asked.</p><p>Without a word, he led her from the cell and down the hall. Other prisoners spotted her and gasped. Some began to murmur amongst themselves, gossiping as they’d once enjoyed doing in the heavens. Some gripped their bars and simply watched her through wistful eyes.</p><p>Erebos even shouted, “Hey, where are you going with her now?”</p> <p>Atlas ignored him, and Nike followed suit. A sense of urgency pounded through her. If Atlas did this, took her outside, even for a few hours...Why would he do such a thing?</p><p>“Did you get permission for this?” she asked. “And we’re not at the guard’s station yet, so it’s okay that I’m talking.”</p><p>“No. I didn’t get permission.” His words were curt, clearly meant to end the conversation.</p><p>As if she’d ever done what was expected of her. “Then why are you—”</p><p>“Just be quiet.”</p><p>“Or what?”</p> <p>“Or I’ll shut you up my favorite way.”</p><p>Her mouth fell open. Did he mean he’d shut her up with a kiss? Or by pushing a button on her collar and shooting painful lances through her brain? It was fifty-fifty, she thought. His proclamation had the desired results, however. She was too busy pondering his meaning to talk.</p><p>In the guard’s station, two Titans were laughingly making bets about the prisoners. They looked up at Atlas and nodded politely in greeting—only to freeze when they spotted her. As promised, she remained quiet.</p><p>“She try to escape?” one demanded, obviously ready to beat her for doing so.</p><p>“No. But I’m taking her out for a bit,” Atlas replied.</p><p>“Why?” the other gasped out. “There’s nothing out there.”</p><p>“I plan to taunt her with what she cannot have.”</p><p>The very words she’d once offered Aergia, the goddess of laziness. He’d remembered.</p> <p>Still the guard persisted. “Has this been cleared with—”</p><p>“I’m in charge of this prison and the people inside it. Now shut up and do your job.” With that, Atlas ushered her out of the building and into the daylight. No one else tried to stop him.</p><p>As the first ray hit her skin, she jerked free of his hold and stopped, simply basking in the moment. Clouds. Sun. She closed her eyes, head thrown back, arms splayed. The warmth, followed by a cooling breeze...the brightness—her skin soaked them up greedily. Oh, how she’d missed them. She would have loved to have seen temples and golden streets and people, as well, but she would take what she could get without complaint.</p><p>Strong arms suddenly banded around her. “You’re beautiful,” Atlas whispered, his nose nuzzling her ear, practically purring. “Do you know that?”</p><p>“I know what I look like.” Her lashes fluttered open. Her heart was hammering against her ribs, and she couldn’t have stopped herself from flattening her hands on his chest to save her life. His own heart was racing, she realized with astonishment. Was he...could he be as affected by her as she was by him? The clouds enveloped him, creating a dream haze. “And beautiful is not a word that describes me.”</p><p>His head lifted, and he gazed down at her. Tenderness softened his expression, and she thought he’d never been more appealing. “Then you don’t see yourself as I do.”</p><p>How did he see her? As much as he hated her—but did he hate her still? How could he, when he’d just escorted her to paradise?—she would have guessed he pictured her with horns, fangs and a tail.</p><p>She cleared her throat, too afraid to ask. “Why did you do this for me?” A much easier question, with an answer that probably wouldn’t destroy what little was left of her feminine pride.</p><p>“I have my reasons,” was all he said. “Now, as much as I’d love to stay in this exact spot with you, we only have a short amount of time. Do you want to spend it here or eating the food I’ve prepared, as well as bathing? I know those are the two things I missed most during my tenure here.”</p><p>“Eat...eating. Bathing.” Was this really happening? Or was she merely dreaming about him again? Nothing else explained this change in him, in her situation.</p><p>He kissed the tip of her nose. “Then food and a bath you shall have. Come. Since I can’t flash you outside of this realm, and there are no homes, inns or shops here, I’ve set up camp a mile north, out of view of the prison.”</p><p>Dreaming, surely. Perhaps a trick, as she’d first supposed. But she allowed him to lead her through the clouds without protest.</p><p>CHAPTER EIGHT</p><p>By the time they reached the camp he’d set up, Atlas was hard and aching. Nike had been pressed against his side the entire mile, her female scent in his nose, her heat radiating into his body.</p><p>When she spied the tent he’d erected, she gasped. Wide brown eyes flicked up to him with wonder before she raced forward, not slowing as she barreled through the front flap. He heard another gasp.Grinning, Atlas followed her inside. He liked this softer side of her. She stood in the center, twirling, clearly trying to take everything in at once. He’d spread furs on the floor and had even carted a small round table here and piled it high with her favorite foods. There was a porcelain tub already filled with steaming water, rose petals floating on the surface.</p><p>Never let it be said that the Titan god of Strength did not know how to romance a woman.</p><p>Nike’s hand fluttered over her heart, her gaze glued to the plate of strawberries and Feta. “How did you know I liked those?”</p><p>Because he’d always been hyperaware of her every action. He’d watched her from his cell while she’d eaten them with her friends and he’d fumed that he was not the one with her, basking in her good humor. That was not something he’d admit to, however.</p><p>“Good guess,” he finally said.</p><p>She peered down at the rug and kicked out her bare, dirty foot. “I don’t understand why you’re doing this, Atlas.”</p><p>“That makes two of us,” he replied gruffly.</p><p>“But—”</p><p>“Just enjoy it, Nike. It’s all I can give you.”</p><p>Her lashes fluttered up, and her gaze pinned him. “But why would you want to give me anything?”</p><p>“Stop analyzing my reasons. This isn’t a ploy or a punishment, I promise you. And the food is not poisoned, if that’s what you’re thinking.” He closed the distance between them, placed his hands on her shoulders and urged her to the table.</p><p>There, they ate in silence. The rapture on her face, rapture that increased with every bite, delighted him. The wine she savored sip by sip, moaning with every swallow.</p><p>Bringing her here was worth the risk of Cronus’s wrath, he thought.</p><p>Although Cronus had merely ordered him to keep her in Tartarus. Which he had done. The clouds around the prison were part of the realm. So technically he had not broken any rules. Cronus, though, being Cronus, would not see it that way.</p><p>Still, Atlas couldn’t regret it. He had never seen this joyful, eager side of the Greek goddess, and he found that he liked it just as much as he liked everything else about her. Which was way more than he should have.</p><p>When every crumb had been consumed, she turned her attention to the bath. “That’s for me?” Utter longing radiated from her, yet she didn’t move toward it.</p><p>“Yes. But I can’t leave you. You know that, right?”</p><p>She chewed on her bottom lip and nodded. “What you’re saying is, I can bathe with you watching or not at all.”</p><p>“Exactly.”</p><p>He expected her to fight him on that. Hell, she could have refused outright. What he did not expect was for her to push to her feet and discard her robe without hesitation. At the sight of her nakedness, he hissed in a breath. Already he’d thought her exquisite...but now, now...holy gods. She was the finest creature the gods had ever produced.</p><p>Her skin, so golden and smooth, covered lean muscle and succulent curves. Her breasts were soft, perfect for his hands, and her nipples were as pretty a pink as he remembered. His mouth watered for them.</p><p>She walked to the tub and stepped inside. Her ass, her back...his name. He was on his feet before he realized what he’d done. He wanted to kiss those tattoos, something she would probably fight him over. He wouldn’t apologize for having given them to her, though. Hell, no. He liked them too much.</p><p>Nike pivoted slowly, and her gaze met his as she sank into the water. There was no hiding the desire he felt—it consumed him, ate him up and left him as bare as she was. Her expression, however, was blank.</p><p>Slowly, she worked the bar of soap he’d brought her over her entire body. She seemed completely unabashed as the suds danced over her, sliding down those magnificent breasts and hiding beneath the rose petals. She washed her hair, too, and soon the locks were dripping down her face and shoulders.</p><p>With every move she made, he inched a little closer to her. He just couldn’t help himself. Finally she finished and stood. Another feast for his eyes. All those curves he craved more than anything else in the world were now wet. He wanted to lick away every drop.</p><p>“What are you thinking about?” she asked. Her voice was as devoid of emotion as her expression.</p><p>“I need you,” he managed to croak past the lump in his throat. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Finally. A reaction. Relief and desire, such intense desire, claimed her, and she grinned a siren’s smile. “Then have me you shall.”</p><p>They were a mimic of his earlier words, and completely unexpected. But, as he’d told her earlier, there was no good reason to analyze a change of heart. Not in either of them. Not now. He had the distance between them defeated a split second later. Had his arms wrapped around her, jerking her into him, a second after that. Their lips met in a wild tangle, their tongues seeking, rolling together. On and on the kiss continued, drowning him in all that she was.</p><p>He hated to stop, even for a moment, but he had to remove his clothes. If he didn’t experience skin-to-skin contact soon, he was going to ignite into flames. Panting, he tore away his shirt, his boots, then his pants.</p> <p>He pulled her back into his embrace. Finally. Blessedly. Skin to skin. Both of them groaned at the headiness. Her nipples rubbed against his chest, his tattoos, while their lower bodies thrust together. Then she was bending down, tracing those letters with her tongue—and gods, he had never been happier that he had them.</p><p>After she’d traced the last one, she kissed her way down his stomach. She dropped to her knees.</p><p>Was she going to...please, please, please...but she didn’t like him enough to do it. Did she? “What are you—”</p><p>She sucked his cock deep into her mouth.</p><p>His head fell back, and he roared. All that wet heat was ecstasy, surely the first he’d ever truly known, for nothing had ever felt this damned good. Up and down she moved, allowing him to hit the back of her throat.</p> <p>“Gods! Don’t make me come.”</p><p>She laughed, pulled off and licked his sac. “When have I ever listened to you?”</p><p>“Vixen.” With a growl, he dropped to his knees, as well. She could taste his seed. Later. More than anything, even more of that ecstasy, he wanted inside her, and he didn’t want to have to wait for it. “Spread your legs for me.”</p><p>The moment she obeyed, he had two fingers buried deep. More wet heat. And to his delight...“You’re ready for me.” Never had he been more proud that he’d brought a female to this point.</p><p>She trembled, had to grip his shoulders to remain upright. “I’m ready for you every damn time I see you.”</p><p>And she didn’t like it, he could tell from her tone, but he could only bask in the admission. “It’s the same for me.”</p> <p>At first, she blinked, as if she couldn’t allow herself to believe him. So vulnerable she appeared, so—dare he wish?—hopeful. Then she placed a sweet kiss on his lips and breathed him in. “Don’t say things like that,” she whispered.</p><p>“Why not? I spoke true.”</p><p>“Because they a-affect me.”</p><p>Headier words had never been spoken. “Let’s finish this before I combust, sweetheart.”</p><p>“Please.”</p><p>He was sweating, panting, as he settled back on his ass, reached out and cupped hers. He jerked her onto his lap, forcing her to wrap her thighs around his waist. As her hands tangled in his hair, he lifted her, placing her eager core at the tip of his erection.</p><p>“Ready?” he asked hoarsely. This was it. The moment he felt he’d been waiting forever for.</p><p>“Ready.”</p> <p>He thrust up and she pushed down, and then he was all the way in, surrounded by the very thing he had defied his king, his sovereign, to possess. It was better than he remembered, better than he could have imagined. He couldn’t pause, couldn’t give her time to adjust. Over and over he pushed in, pulled out, too overwhelmed by pleasure to do anything but ride out the storm. Perhaps it was the same for her. Her nails scored his back, and her moans rang in his ears.</p><p>Gods, he was close. On fire. Burning. Desperate. He reached between their bodies and pressed his thumb against his new favorite place.</p><p>“Atlas,” she shouted, her inner walls suddenly milking him.</p><p>She was climaxing, lost to all that he was, and the thought drove him over the last bit of the edge, as well. He jetted inside her, lost to all that she was, the most intense orgasm of his life claiming him.</p><p>Together, they fell backward, onto the softness of the fur. He kept his arms around her, unwilling to let her go. Now...always?</p><p>Yes, always, he thought, and his eyes widened. He wanted her always. Wanted more of this. Had to have more of this. When he’d forgiven her completely, he didn’t know. When he’d softened, he didn’t know, either. He only knew that she’d become an important part of his life. Perhaps she always had been; he’d just been too foolish to realize it.</p><p>What the hell was he going to do? They could be together each night after his shift, but they’d never have privacy, and her pride would soon chafe at his amorous attentions, all while he refused to set her free. It would have been the same for him when the situation had been reversed. Besides, she was too precious to hurt in that way. But the problem was, he couldn’t be without her. He’d proven that already.</p><p>Damn, he thought next, suddenly sick to his stomach. Damn!</p><p>CHAPTER NINE</p><p>She loved him, Nike thought. Again. I’m hopeless.</p><p>He’d just...he’d been so amazing. He’d whisked her away, given her everything she’d craved: food, water and his body. Gods, had he given her that delectable body. She’d savored every moment. Savored his taste, his touch, the feel of him pounding inside her.Four days had since passed, but she craved more. Always she craved more. She’d spent the time locked inside her cell, pacing, trying to think of ways for them to be together. If he still wanted her, that is. Atlas had come by at least once a day to make sure she was properly fed and that her basin of water was filled, but he’d never said a word to her. Actually, they hadn’t spoken since leaving the tent.</p><p>At the time, she’d felt too raw, too exposed. She’d feared her feelings for him had been shining in her eyes, so they most assuredly would have seeped from her voice. He was everything she’d ever wanted in a mate. His strength matched hers. She would never have to worry about hurting him. He was witty and charming. He was a protector, a warrior. He was deliciously vengeful, she knew firsthand.</p><p>She smiled, wishing she could reach between her shoulder blades and feel his name. She was certain the letters would be as hot as the man himself. But...</p><p>Why hadn’t he spoken to her?</p><p>Why didn’t you speak to him?</p><p>Because she hadn’t known what to say. Did he still want her? Did he feel anything for her? How would she react if he didn’t, which was most likely the case? Part of her wanted to take anything he would give her. The other part of her knew her pride wouldn’t allow her to do such a thing. But there at the end, when they’d returned to Tartarus and he’d closed the bars to her cell, she had thought she’d glimpsed regret. Regret that he had to seal her inside. Regret that they couldn’t spend more time together—in bed and out.</p><p>Nike tugged at her collar and screeched. Damn this. She was the epitome of strength, yet was as helpless as a babe. How could she win a man’s heart when she couldn’t even win her own freedom?</p><p>Atlas heard a screech of frustration and knew immediately who had uttered it. Nike. His Nike. His beautiful Nike. He’d deliberated about what to do, how they could be together, for four days. Well, the time for thinking was over, it seemed. She was close to her breaking point. She’d tasted freedom; being sequestered now had to be a thousand times worse than before.</p><p>He hated that she was locked up, and he knew they could never be together while she was. He also knew they could not be together if he released her. She would most likely run, and he would most definitely be punished.</p><p>Maybe she loved him, maybe she didn’t. Maybe she’d stay with him. Or try to. She liked him and was attracted to him, he would go so far as to say. After everything that had transpired between them, she wouldn’t have slept with him otherwise. But love? He wasn’t sure.</p><p>And it didn’t matter, really. He loved her. Perhaps he always had. He’d never felt so strongly about a woman. He’d never wanted to spend his every waking minute with someone before, had never wanted to cuddle someone into his side for every sleeping minute. He’d never wanted to eat every meal together. To talk and laugh about their days. To spar, verbally and physically. But he did with her.</p><p>And since they couldn’t be together, no matter what way things panned out, there was only one thing to do.</p><p>He pounded up the stairs and to her cell. She was banging a fist into the wall, plumes of dust forming around her. The sight of her nearly undid him. He wanted to kiss her, put his fingers all over her, sink inside her. Harden your heart. Do what is needed. His hand was shaking as he lifted the sensor.</p><p>She heard the slid of the bars and turned. A gasp parted her beautiful lips. Without a word, he held out his palm.</p><p>“What—”</p><p>“Just take it.”</p><p>She frowned as she accepted.</p><p>Still silent, he pulled her along the same path he had just taken. The same path they’d taken those four days ago. No one tried to stop him this time. In fact, as he passed the guard’s station, the two gods on duty rolled their eyes.</p><p>Outside, with the clouds all around him, he whirled on Nike. He still wanted to kiss her, but knew that if he did so, he would not be able to let her go. And he had to let her go.</p><p>“Atlas,” she said with a seductive grin. She tried to wrap her arms around his neck. “Another outing? I’m glad.”</p><p>He shook his head and placed his fingers on the designated indentions in the collar. Cool metal met his touch. Then he leaned down and fit his lips over the center.</p><p>Her grin fell away. A tremor moved through her. “Wh-what are you doing?”</p><p>“Be still.” He drew in a deep breath, held it...held it...and then slowly released it. As that breath slithered through the inside of the collar, the metal loosened...finally splitting down the center and tumbling to the ground.</p><p>Eyes wide, she reached up, felt her bare neck. “I don’t understand what’s happening,” she said. They were the same words she’d spoken before. He hadn’t had an answer then. He did now. He loved her, but he could never tell her that. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Go,” he said. “Flash somewhere. Maybe earth. And whatever you do, stay hidden. Do you understand me?”</p><p>“Atlas...no.” She shook her head violently, even fisted his shirt. “No, I can’t. When they discover I’m gone for good, and they will, you’ll be charged with a crime. You’ll be locked away, placed with the Greeks who hate you. Or, if you’re lucky, you’ll be killed.”</p><p>She felt, he realized, both amazed and saddened. She cared for him, which meant she would suffer without him. If anything, that only increased his determination to save her. She did not deserve a life behind bars.</p> <p>He forced his expression to harden. Forced himself to jerk away from her. “I can’t stand to look at you anymore. I’ve had you, and now I’m bored with you.”</p><p>Her arms dropped to her sides as if weighed down by rocks, but she quickly pulled them around her middle. “Then keep me locked up and stay away from me. You don’t want to do this.”</p><p>Still willing to give up her freedom to be near him? Damn her. He fell a little more in love with her. “Go! I can’t stand the sight of you anymore. Don’t you get it? You make me sick, Nike.”</p><p>“Shut up.” Tears filled her eyes. Real godsdamned tears. “You don’t mean that. You can’t mean that.” The last was whispered brokenly.</p><p>His heart constricted painfully. Do it. Finish it. “I’d rather be killed or locked away than look at you another moment. Because every time I look at you, I’m reminded of what we did and I—I want to vomit. I was using you, wanting to punish you, but I took things too far. Even for me.” Hating himself, he turned away from her. “So do us both a favor and go.”</p> <p>For a long while, she didn’t speak. He knew she didn’t flash away, either, for he heard no rustle of clothing. But then, he did hear a whimper. A sob. More of those tears must be falling.</p><p>Gods, he couldn’t do it. He couldn’t send her away like this. He spun, meaning to grab on to her and tell her the truth, to force her to listen. To make her leave another way. But she was gone before their eyes could meet and his hands encountered only air.</p><p>“You insolent fool!”</p><p>Atlas peered up at the fuming Cronus. Not like he could do anything else. His wrists were chained to poles, forcing him to remain on his knees. The very collar he’d removed from Nike was now wrapped around his own neck.</p><p>He’d known this would happen, but he hadn’t cared. He still didn’t. Nike was free, and that was all that mattered.</p><p>“Have you nothing to say for yourself?”</p> <p>“No.”</p><p>“One Greek can raise an army. That army can attack us. Ruin us. I told you that, and still you defied me.”</p><p>“Nike won’t do that,” he said confidently. He trusted her to disappear. Even as angry as she had to be with him, she would not endanger herself to save people she had never truly liked.</p><p>Cronus slammed his fist against the arm of his throne, ever the petulant child. “You can’t know that! You aren’t my All-Seeing Eye.”</p><p>Atlas arched a brow, refusing to be cowed. “Would you risk being imprisoned again to help your fellow Titans? I may not be able to see all the secrets of the heavens and hell, yet I know you would not.”</p><p>The king had no response to that, but that didn’t stop him from growling. “You disobeyed a direct order, and you will be punished.”</p><p>“I understand.” He offered the statement without hesitation. It was the truth. He understood that the god king had to make an example out of him. Otherwise, others would see him as weak. They would disobey him as Atlas had.</p><p>“I think you actually do.” Some of Cronus’s fury abated. “Only this morning I saw a portrait of you. A portrait painted by my Eye. With it, she showed me exactly how to punish you.” The king smiled evilly and looked to the ghostlike girl still standing at his side. “You know what to do, sweet Sienna.”</p> <p>Sienna strode forward, a knife appearing in her hand. She stopped in front of Atlas and dropped to her knees, placing them eye to eye. So this was it, he thought. The end. As an immortal, he’d never thought to reach this point. Still. He found he only regretted that he hadn’t had more time with Nike, that he hadn’t gotten the chance to apologize for his harsh words the last time they were together and that he would never have the chance to confess his love.</p><p>With absolutely no emotion on her face, the girl dug the tip of the blade into his wrist and cut out his sensor, rather than chop off his head. That’s when he realized Cronus meant to lock him away rather than kill him. Good. More time to think about Nike and what could have been.</p><p>But then Sienna moved the blade to his chest and pressed, slicing. It stung, but that was not what made him struggle against her ministrations. No, it was the fact that she began carving Nike’s name from his chest. He roared loud and long, fighting for all he was worth. Guards were called over and hard hands settled over him, pressing him down, holding him steady. Still he fought, but in the end, they managed to remove all four letters.</p><p>As they walked away from him, he glanced down at himself through burning, watery eyes. Blood poured down his chest and four open wounds stared up at him, the muscles torn, the skin completely gone. He might have hated that brand at one point in his life, but he’d grown to love it as much as the woman who’d given it to him. More than that, it had been the last remaining evidence of her presence.</p><p>His hands fisted, and his back straightened. Blood and sweat mingled, stinging further. Another roar burst from his lips, and he tossed it to the domed ceiling. He didn’t stop until his throat was shredded from the strain.</p><p>“Are you quite finished?” Cronus asked him.</p><p>His gaze fell to the dais, narrowing. “I will destroy you for this,” his vowed brokenly. “One day you will die by my hand.”</p><p>“Not likely. Take him to Tartarus,” the king told his guards, unconcerned. “Where he will rot for all eternity.”</p><p>CHAPTER TEN</p><p>It took her two days, but Nike finally located Atlas’s home, a sprawling estate in Olympus. The amount of wealth he’d needed to acquire such a place astonished her. But then, she supposed he’d considered every cent worth it. After living in a tiny cell for thousands of years, he’d most likely wanted every bit of space he could get. And every amenity.</p><p>There was a swimming pool, more than thirty bedrooms, two winding, marble staircases and four fireplaces, and all the walls were comprised of solid gold. None of that interested her, however. Only his bedroom did.There, she discovered more about the man who had sent her on her way. A man who would not have risked this just to avoid her face, as he’d claimed. A man who would not have risked his life for anything other than love.</p><p>He owned a huge bed and had covered it with black silk sheets. The walls were painted with murals of the sun and sky, and the furniture smelled of rich mahogany. There were multiple bookcases, each filled with leather-bound books. Beaded pillows were strategically placed along the floor. Places for him to lounge and read, she supposed.</p><p>What held her attention, however, was the portrait hanging above the hearth. A portrait of her.</p><p>He must have commissioned it after their time inside that tent, for she was reclined in a porcelain tub, bubbles sliding over her shoulder and chest, her hair soaked. She would have looked as plain and masculine as always, except he’d had the artist add a sensual light to her dark eyes and a come-and-get-me curve to her lips.</p><p>Finally she knew how he saw her. As someone beautiful. Worthy.</p><p>Only a man in love would do such a thing. Only a man in love would keep such a thing in such a prominent place. Only a man in love would want to see a woman’s portrait every night before he fell asleep, then wake up looking at it.</p><p>Oh, yes. He loved her.</p><p>There, outside of Tartarus, she’d thought, hoped, that he did so, but she had let his words scrape against her already low self-esteem. How could so beautiful and sensual a man want her? she’d wondered. But he did. He loved her. Proof: he’d risked everything for her.</p><p>She could do no less for him.</p><p>Nike strode through the bedroom, knowing her lover would have a weapons case stashed somewhere—and knowing exactly what to do with it.</p><p>Atlas was not given a cell of his own—not at first. Still bleeding and frantic, fighting, he had been thrust into a cell with Erebos. Of course, that’s who had been chosen as his cell mate, he’d thought, rage filling him. A male who had once thought to claim his Nike. A male who had then stolen food from her, pushed her around and called her terrible names.</p><p>Atlas had seen it happen on numerous occasions. He hadn’t done anything about it then, telling himself she deserved what she got, but he’d wanted to. And there was no better time than now.</p><p>Even with his strength corralled by the collar and half his blood dried to his chest, even with his still-seeping wounds splitting open with every move he made, Atlas managed to defeat Erebos in record time. He punched, he kicked, he did not play fair, kneeing the god in the balls while he was down. In the end, a broken, bloody Erebos lay crying on the dirty floor, right alongside everyone who had tried to save him.</p><p>That’s when Atlas was moved to the empty cell Nike had occupied. He stretched out on the cot, simply breathing in her lingering essence. His sweet, sweet Nike. He would have to spend eternity without her. Without even her brand. Once again, he roared.</p><p>What was she doing now? If she sought solace in the arms of another man, even in the years to come, he would tear this prison apart stone by stone and kill the bastard. As if. You sent her on her way to do just that. You want her happy.</p><p>“What’s all the racket? Seriously.”</p><p>Gods, he was hearing her voice now. Locked up two days, and he was already headed into insanity.</p><p>His bars rattled, slid open. He rolled to his side, determined to send whoever it was away. When he caught sight of his beloved Nike, he blinked. Oh, yes, he was indeed going insane. She stood before him, draped in a black leather bra top and black leather pants. Her hair was slicked back in a smooth ponytail. Blood splattered her cheeks. Never had she looked more beautiful. Her strength was there for all to see. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Well?” she said, clearly impatient. “Aren’t you going to say anything?”</p><p>Slowly he sat up. He didn’t want this moment to end. Didn’t want to lose sight of her. “I missed you. So much.”</p><p>“And I wanted an apology. I much prefer this.” She grinned, practically beaming. “I missed you, too, but we’ll have to catch up later.” Her gaze fell to his chest, and she gaped in astonishment. Then she growled. “Did the god king cut my name off you?”</p> <p>“Yes.”</p><p>She was holding a knife, he saw, and her knuckles bleached of color. “I. Will. Kill. Him.”</p><p>“Already promised to do so.”</p><p>“We’ll do it together, then. After we get out of here.” Her attention flicked behind her, urgent, before returning to him. “Come on. We have to go before someone realizes what I’ve done.”</p><p>“Just let me look at you. Just let me enjoy this moment. Let me apologize for what I said to you. You said you wanted an apology, yes? I didn’t mean it, not a word I said that last day, but I—”</p> <p>She closed the distance between them and slapped him. Hard. The blow knocked him back against the cot and caused stars to wink over his vision.</p><p>Once more, he blinked at her. “You hit me.”</p><p>“Yeah, and I’ll do it again if you don’t get your ass in gear.”</p><p>“You’re real.”</p><p>“Yes.”</p><p>“But you’re real.” He sat up, saying the words but not truly absorbing them. This couldn’t be happening.</p> <p>She dropped to her knees. “Again, yes.” Just as he’d once done to her, she placed her fingers over his collar and blew into the center. As the metal softened, he finally understood what his brain had been trying to tell him. Nike was here. She was really here. And she was saving his life.</p><p>With a scowl, he jumped to his feet. “I told you to go to earth, damn it.”</p><p>“Okay, not the reaction I expected.” She stood and pressed a swift kiss to his lips. “Good thing I never listen to you. Now let’s go. I’ve already taken out the guards below. And no, I didn’t kill your friends. Just made them wish they were dead.” As she spoke, she latched on to his hand and dragged him out of the cell. “Cronus could realize what’s going down at any moment and appear, and then we’ll both be in trouble. As long as we’re here, we’re easy pickings.”</p><p>True. Nike was a fugitive now; he wanted her out of this prison, out of this realm, as soon as possible. “You risked your life to save me, you fool.”</p><p>“Well, you risked your life to save me.”</p><p>Down the stairs they pounded and, sure enough, all three of the guards were flat on their faces, motionless. “But you were free. You had what you wanted.”</p><p>“Not everything,” she threw over her shoulder.</p><p>Okay, wow. She’d just admitted she wanted him more than freedom. Atlas couldn’t help himself. He gave a tug, propelling her backward, into his arms. “I love you,” he finally proclaimed, and mashed their lips together. His tongue thrust deep, tasting, demanding.</p> <p>She only allowed the kiss for a few seconds, her hands fisting his hair and taking everything he had to give, before she pulled away, panting. “I love you, too. But let’s get the hell out of here. I need your pretty head connected to your body.”</p><p>Once again, they surged forward. Still, he almost couldn’t believe this was happening. It was too much like a dream. “I’m going to spend the rest of eternity making up for what I did to you.”</p><p>“Good. I think I’ll like seeing you grovel. But just for the record, I love my tattoo and I know why you said those nasty things. Sure, I would have found a better way to get you to safety, but then, I’m smarter than you are, so really, I can’t blame you.”</p><p>He laughed. Gods, he loved this woman. “Vixen.”</p><p>“Your vixen.”</p><p>“Mine. Always. You’ll mark me again just as soon as my skin heals.”</p><p>“Already planned on it.”</p><p>Good. He wouldn’t feel complete until she did. “So where are we going to live?” he asked. “We can’t stay in the heavens.”</p><p>“You ordered me to hide on earth. I thought we could do so—together. Though I hate that you have to give up your amazing house.”</p><p>“You’ve been there?” He found he really liked the thought of her there, surrounded by his things, breathing in his essence.</p><p>“I, well, I broke in.”</p><p>A laugh boomed from him. There was no woman more perfect for him. He would have done the same thing. “The only thing I’ll miss from that house is the portrait of you. But now I have the real thing.” He placed a swift kiss on her lips. “Back to our new living arrangements. There are other gods out there, Greeks like you, who are in hiding. Cronus has never been able to find them. That means there are places he can’t see.”</p><p>“Maybe we’ll find them and join them. We are Strength, after all. We can succeed where he has failed.”</p><p>“In the meantime, we might even try to find the Lords of the Underworld. Cronus mentioned being distracted by them, whoever they are. If they are his enemies, they might be good friends for us to have.”</p><p>Her eyes widened. “I know of whom you speak. They were Zeus’s immortal warriors long ago, but now they house the demons once locked inside Pandora’s box. Cronus will have his hands tied for a long, long time. They would be very good friends to have.”</p><p>They reached the door and burst outside, all without incident. Clouds instantly enveloped them, the sun shining brightly. Nike whirled and threw herself in his arms, placing nips and kisses all over his face.</p><p>“We did it. Now take us somewhere. Anywhere. As long as we can be together.”</p><p>“I love you,” he said again, then did exactly as his woman had ordered. </p> </body></html>"]