["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I</p><p>Today is my eighteenth birthday. Tomorrow I swear off love.</p><p>It’s absurd. I’ve never kissed a girl, never asked anyone out. I’ve never slipped my arm around a waist, hoping for encouragement to let it stay. I’ve never danced entangled in another’s limbs, never flirted in a hallway or teased someone and walked away.</p><p>And yet tomorrow, when I give up love, everything will change. I’ll still be Ander—blond and pale, immune to illness, able to blend into any background—but I won’t be me anymore. I won’t be what I am today.</p> <p>Because for as long as I have known Eureka, my love for her has defined me. And though she knows nothing of my existence, I’ve known her all my life. My secret dies in the woods tonight, along with a thousand smaller passions. The Passage is what matters, not the life I’ll lose.</p><p>A knock on my door startles me. My uncle doesn’t wait, enters my dark room.</p><p>“Are you packed?” Albion closes the blinds above my bed, erasing the knife made of moonlight that was splitting my chest in two.</p><p>Albion makes a room feel cold. Like all my relatives, his movements make no sound. He has no scent. His voice is clear but somehow never disturbs the silence. Only his shape and his effect on the temperature tell me that I’m not dreaming. I pull my blanket higher.</p><p>In the twin bed across the room, my uncle Critias stretches stiffly and sits up. His naked body is muscular, strong. He looks younger than Albion, though both of them are thousands of years old.</p> <p>Albion looks at him. “He isn’t packed yet, is he?”</p><p>“Are you packed?” Critias asks me.</p><p>“I’m packed.” I glance at the backpack I’ve been filling slowly for months. It’s only one night in the woods, but I will take my entire childhood with me. Then I will leave it there.</p><p>“Get up, then. Get going,” Albion says.</p><p>On a slanted plank between his bed and the wall, Critias begins his hundred push-ups.</p><p>“Happy birthday,” he tells me, lifting into number thirteen.</p> <p>The Passage is a walk in the woods. You go in a boy; you come out a man. Every member of my family goes through this ritual on the night we turn eighteen. When I complete the Passage I’ll be a Seedbearer, like the aunts and uncles who raised me. I’ll know the secrets that have always swirled around me, vapors I’ve been forbidden to inhale. I’ll begin to live forever.</p><p>My dog, Shiloh, sleeps at the foot of my bed. When I rise he nudges me with his damp nose. I rub the spotted crown of his head. “I’ll miss you, too.”</p><p>“Shiloh’s going with you,” Critias says, his voice slightly muffled as he drags a sweater down his torso in the dark.</p><p>For a moment, I’m elated. Then I remember the rules. “Why is he coming with me?”</p><p>Critias slides a broken silver watch onto his arm. “You know why.”</p><p>I close my eyes in pain.</p><p>“Stop it,” Critias snaps. And he’s my kindest relative. “I’ll be waiting in the car.”</p><p>I enter the darkened kitchen, where my aunts Starling and Chora are debating which brand of rattrap is best. Starling is willowy and frail. Chora is shorter, stout. Their faces, like my uncles’, are easy to forget.</p> <p>We never turn on the lights. We keep the blinds drawn all the time. We live on the northwest corner of Lafayette in an abandoned farmhouse on the edge of an overgrown wheat field. You can’t see our house from the road. No one knows we live here.</p><p>“I made the cake.” Starling points to a foil-capped clump on the table. Someone’s taped a box of candles to it.</p><p>“Are you hungry?” Chora asks. Alligator sausage hisses in a frying pan behind her.</p><p>“No.” I don’t want to have to put down and pick back up my heavy backpack. It feels like it’s cutting lashes into my shoulders.</p><p>“Best to get on the road.” Starling stuffs a canvas satchel into my backpack, adding to my load. “Sleeping bag. Sandwiches. Insect repellent. Fire starter.”</p><p>“And the cake.” Chora hands it to me like a quarterback.</p><p>As they eye me I wonder if they’re thinking of their own Passages, centuries ago. What private agonies did they forsake? What passions did they know when they were on the other side?</p><p>“See you tomorrow,” they say in unison.</p><p>The car has been running for half an hour. Exhaust blossoms in the inky air as Critias waits in the driver’s seat. I know from his serene expression that he is listening to screaming AM talk radio. Shiloh sticks close beside me through the front door, thrilled to be included. I drop my backpack and my cake into the trunk.</p><p>Inside the car it’s close and warm. Shiloh licks the window. A gray sun edges over the cypresses behind our house, and I think of the time I ran away from home. I was eight and Albion had just told me the reason I was being forced to watch Eureka.</p><p>One day you will be the one to stop her, and the world will credit you for its salvation. Forever.</p><p>I remember how sick I felt. I knew I had to flee that destiny, but I only made it into the indifferent arms of an ancient cypress tree at the edge of our yard. I stayed there an eternal evening, my unfed imagination powerless to think of anywhere else to go.</p><p>As my family searched for me, I heard Starling say, “What if he left us, like the last one?”</p><p>“He is not like the last one,” came Albion’s calm reply.</p><p>He was right. I climbed down for dinner. They never told me who “the last one” was, and I knew better than to ask.</p><p>A tap on my window startles me. Critias turns down the radio and I roll down the window. Albion’s face appears in the cold square of darkness. He hands me a large, sturdy envelope. I’ve never received a birthday card before. I slip my thumb under the flap but stop when Albion slaps me across the cheek. I inhale sharply. A sea of red washes over my eyes.</p><p>“Open it tomorrow. Inside there are things you know but do not think you know.” Albion looks at Shiloh. “First thing you do, get rid of the dog.”</p><p>I swallow and don’t look at anyone.</p><p>Critias puts the car in drive.</p><p>“This is not a game, Ander,” Albion says, as if I have ever played one.</p><p>The drive to Kisatchie will take two hours. I’ve camped there twice but never alone. I’m considering running away a second time, when Critias takes a wrong turn.</p><p>“You missed the ramp,” I tell him.</p><p>Critias looks straight ahead. “I want to show you something.”</p><p>He drives downtown through short streets and turns into the parking lot of the Pancake Barn. I know why we’re here.</p><p>Because she is here.</p><p>Eureka sits at a window booth with her mother. She’s so lovely I can’t breathe. Her sweater and her hair are golden. Her eyes are alive with the story she’s telling. Her hands never rest when she speaks. Her mother, Diana, catches Eureka’s orange juice just before it spills.</p><p>Eureka’s funny. Laughing, Diana, puts up her hand, begging for a chance to swallow. I can’t resist tilting my head a little, entranced as a wild bird.</p><p>A waitress delivers a can of whipped cream. Eureka swirls a white tower onto her pancakes. I’ve seen her do this many times, like an angel building a cloud above an island. I wonder if clouds taste like whipped cream to angels. Eureka licks her fork.</p><p>She waves at someone by the door, then jumps up from the table. A brown-haired boy approaches. Brooks. I feel sweat on my temples as she embraces him and slides to make room for him in the booth. Brooks picks up her fork as if it also belongs to him. I want to kill him.</p><p>“Tell me what you see,” Critias says.</p><p>Radiance.</p><p>Meaning.</p><p>“Danger,” I say.</p><p>Critias nods. “Your work with the girl will feel different when you return.”</p><p>Never, I think, hoping my uncle might be right. Unrequited love is the deepest misery I have ever known. Maybe the Passage will free me. Or maybe, I fear, I will climb above all desire for pleasure—every intense emotion in every sphere of my life—and yet will not find the strength to slow down my love for her.</p><p>Critias moistens his lips. “No, ‘feel’ is the wrong word. It will simply be different.”</p><p>“But my being is so full of feeling.”</p><p>Critias starts the car again. “You will understand tomorrow.”</p><p>II</p><p>Night falls early, sealing off another day. Eureka sits in my mind like a patch of sun in winter. Every now and then, the way she looked this morning diverts me from the burden I carry.</p><p>In the gray-brown dusk Shiloh leads me along the snaking bayou, beyond the oaks’ canopy, into a quiet, starry night. I am surprised to be surprised by the spreading darkness.</p><p>Shiloh shakes out his fur. He looks at me. Which way?</p><p>I don’t know where we are. My vision adjusts and I notice a stand of trees around a small, flat clearing. It’s as good a place as any to make camp. Though everything is wet, I begin to gather wood. The air is brittle, as if I could snap it into pieces and make an arsenal of knives.</p><p>In my mind I see Eureka, back at the restaurant. Her head falling back, eyes squeezed shut, her mouth wide open. What made her laugh like that? Maybe she was laughing because it was the last time I would love her. Maybe she was laughing at me and everything I’ve done.</p><p>I curse Critias as I drop wet wood onto the wet earth. Did my uncle know I would consume Eureka’s image until she consumed me, until I disappeared into the darkness like a dwindling match? Only now do I hear the drilling sound of a nearby woodpecker, the slosh of the bayou below.</p><p>I can’t remember anyone ever speaking frankly about what happens on the Passage. But I’ve always known what’s expected of me: a renunciation of pleasure, of memories I hold dear, of anything or anyone whose appeal borders on dependence. Tomorrow, when I appear before my family to prove that I’m completely free, they’ll open the Seedbearers’ secrets to me. They will have nothing more to hide.</p><p>Critias gave me a map that marks the spot where I’m supposed to meet them. It’s twenty miles from where he dropped me off. Why am I rushing toward them? I wonder. I’ve always told myself I want to escape.</p><p>“The idiots in this town,” Albion has said at the dinner table. “They tell each other, ‘Wish upon a star, be an idiot, chase your dreams.’ ”</p><p>How would I even begin to chase my dreams? I have no more idea of where I could go now than I did when I was eight.</p><p>In the darkness I remember the fire starter Chora gave me. I toss the artificial log on the wet wood and light the yellow wrapper. The paper lights, but the wood doesn’t catch. I rub my hands together, angry at the cold, until I remember once seeing Albion whisper a breath into a reluctant fire. “Wind is the Seedbearer’s to wield,” he said.</p><p>Softly, I blow into the flame.</p><p>The orange tendril dances from one wet log to another. I have made an impossible fire. I laugh, which inspires a great burst of flames. Shiloh leaps around the conflagration, delighted that something has made me happy, that something is making him warm.</p><p>I’ve never felt at liberty to test this kind of power—either normal people are nearby or there’s an elder at my side who is more expert than I think I will ever be. For the first time, I allow myself to feel alone, inhaling, exhaling, manipulating the fire with my breath as if it were a burner on a stove. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I leave the fire roaring and open a can of beans. I set it on a stone near the flames. Shiloh cozies up to me, curling his body around my leg. He sighs and rests his chin on my lap. I scratch his head and remember that I’ll never spend another night with him.</p><p>I draw my leg from under him. He nuzzles into me again. Something dark is rising in me. I want him gone. I want to forget I ever loved him. The urge is so strong I begin to shake. I give Shiloh the beans to make myself disgusted by the way he eats. He devours them sloppily, licks the can for a while, then turns to me.</p><p>“Okay.” I swallow the familiar “buddy” before it has a chance to fully form in my throat. “Time to go.”</p><p>Shiloh rises to his haunches and sits at my feet. His spine is erect, his eyes alert. His ears are cocked because the tone of my voice suggests a command.</p> <p>It’s time for me to do this, but I don’t know what this is.</p><p>“Go on.” I point into the black woods.</p><p>Shiloh stares at me with wide brown eyes. After a moment, he lies down. His paw finds its way onto my knee.</p><p>I push it off and stand up.</p><p>“Get out of here.” I wave my hands, scaring him. “You’re not my dog now. I’m not your owner. You’re on your own.” I pause. “You’re free.”</p> <p>He whimpers, gets up and strides in a small circle, then sits down again.</p><p>“I said go.” I lift my foot as if to kick him. He doesn’t flinch. He waits for a moment, then begins to lick my trembling fingers. The darkness that was rising dissipates. I wonder if my family knew how hard it would be to leave him. I wonder if they mean for me to kill him to stop him from following me.</p><p>“Fine,” I tell him. “One more night.”</p><p>We assume our earlier positions, my legs extended toward the fire, Shiloh sprawled across my knees. I reach for my backpack and unzip it.</p><p>I look inside at the worn blue blanket I slept with when I was young, the baseball I taught myself to catch on endless afternoons alone in our backyard. There’s a heavy photo album one of my aunts must have made. I haven’t seen it before, though I’m the only one in the pictures.</p><p>Pictures of me as a baby, a toddler, a little boy—always alone. No one ever taught me to smile, so I’m not smiling in any of the photos. They end abruptly, dwarfed by blank pages where more life should be.</p> <p>I pull out the primers with which I learned to read and write. A deck of cards with naked women on them; a BB gun I used to shoot at doves, robins, squirrels. I find the only CD I’ve ever owned—a burned copy of Bunk Johnson from the free bin at a garage sale. I listened to it once in Critias’s car when my aunts and uncles were asleep.</p><p>I’m supposed to care about these things.</p><p>I toss my childhood into the fire, I watch the sparks kick up. I inhale the smell of burning plastic and feel nothing.</p><p>What worries me are the items I’ve hidden in the bottom of the bag. I’d be beaten, or worse, if the others found them, especially after the Passage. I have to let them go, tonight.</p><p>I pull out Eureka’s racing bib from a 10K she won last summer. When she unpinned it from her jersey at the finish line, it caught the wind and glided toward me. I tucked it into my pocket before anyone could see. It was warm from her body and it was mine. The safety pins are still on it. Number 102.</p><p>I find the receipt from the gas station where I dared to stand behind her in line, some of her hair tucked into the back of her t-shirt, some of it spilling out along her shoulder blade. My heart raced as I slid the receipt from the counter into my pocket, avoiding the cashier’s eyes.</p><p>West Lafayette Stop-N-Go. Cashier: Macy. Time: 1:34 p.m. Apple Mentos. $1.03.</p><p>I pull out a T-shirt that reads The Faith Healers. They’re a band from Eureka’s high school. I found the shirt at the Salvation Army—a wife-beater someone wrote the places and dates of local shows on with a permanent marker. I stole it so I could wear it in front of her. I never have. I see now how ridiculous my fantasies were that the shirt might spark a conversation:</p> <p>Hey, I love that band.</p><p>Really? Me too!</p><p>Did the shirt shrink in the dryer or something?</p><p>No, I just like wearing wife-beaters two sizes too small.</p><p>These are the three things I own related to the girl I love. I hold them against my chest, then fling them into the fire. The receipt vanishes; the bib curls into flames. The shirt becomes ash. My love for her remains.</p><p>There’s one last thing in my bag. It’s replaceable and irreplaceable. There are millions like it but none of them like this. My worn copy of The Great Gatsby is the only book I can stand to read.</p><p>The book is how I know I love Eureka. When I read it I find words for what she does to me. And when I close it I always feel the awful ache upon reentering the world.</p><p>Albion’s baffling words return: He is not like the last one.</p><p>Who?</p><p>I burn Gatsby slowly, feeding him page by page into the fire. I recite the book’s last words as they burn:</p><p>“So we beat on, boats against the current, borne back ceaselessly into the past.”</p><p>I’m expected to initiate an endless future, free from small concerns like aging, like death. But I see only blank and disappearing pages. I see a past I don’t understand swirling wordlessly around her.</p><p>The fire dwindles. It’s cold and dark and I have failed. If I could have surrendered my love for her, the rest would have melted easily away. But she is a tree whose roots embrace the center of my being. There is no uprooting her. She holds down everything else, making it impossible not to love.</p><p>I remember the cake. I unwrap the foil and shake the candles out of the box. I plunge the candles into the cake and light them, staring until their flames lick the icing. I fill my lungs with air and blow with all my might, wishing for my family not to see instantly that my Passage was a lie.</p><p>The force of my breath startles me. It smothers the campfire, blows branches off the surrounding trees. I send a bald cypress stump tumbling down into the bayou with a swampy splash.</p><p>Giving up in darkness, I pull close the dog that won’t leave, and fall asleep.</p><p>III</p><p>It is nighttime and I am standing in a desert, surrounded by dunes a hundred feet high.</p><p>An enormous bird soars above, silhouetted against the moon. I hear soft footsteps in the sand behind me.</p><p>I turn and see her. Though she is very far away, I hear the rustling of her clothes, feel the weight of her body on the sand.</p><p>As she draws closer, her face begins to change. Lines deepen around her eyes, gray comes into her hair. She was seventeen a moment ago; now she looks seventy.</p><p>By the time she is in front of me, she is stooped and frail. I recognize her easily as my Eureka, though she is close to death. She opens her mouth to speak.</p><p>Ashes pour out in an endless stream.</p><p>I awake. Three crows sail the pink sky above my opening eyes. My body is stiff and it takes a moment to recall where I am. The campsite looks like it’s been trashed by something bigger than a boy blowing out candles. Black logs lie scattered across slick leaves.</p><p>I roll over in time to see a raccoon run away with the last remnant of my cake.</p><p>Sometimes I look at people and wonder if they’re afraid to die. My family speaks of age with pity and disdain: The elderly are weak, sick, pathetic. My aunts and uncles look away from old men with walkers and women in wheelchairs, as if no one should have to endure such shameful spectacles.</p><p>I wonder if those old people would make the bargain I was supposed to make last night: Stop feeling and you get to live forever. Would Eureka?</p><p>Shiloh stirs and sighs beside me, dreaming of chasing something. He smells more like home than anything in that sad farmhouse I will return to without him. I lay my head next to his and we stare into each other’s eyes. He has to go because my heart has to go. And soon—the meeting place is a full day’s hike away. My family is always on time.</p><p>I feel around in the pack Starling gave me and find two peanut butter and jelly sandwiches, a bag of chips, two bottles of soda, and another can of beans. Anything will taste of nothing, go down bitter, but a sandwich at least will give me energy. I force one down and feed the beans to Shiloh. We eat slowly, watching the sun rise, listening to the gentle waving of the bayou.</p><p>I reach into my coat pocket and feel something stiff, remembering the sting of Albion’s palm across my cheek as I tear open the envelope.</p><p>It’s not one card—it’s three.</p><p>Each is twice the size of a playing card and several times as sturdy. The cards are hand-painted and brightly colored. They look old and well made. On the back they share the same design: against a metallic silver background a blue figure holds a spear pointed downward. It’s the original Seedbearer insignia, symbolic of my family’s most important pledge: Keep the enemy below the sea.</p><p>I lay the cards faceup in a row on my sleeping bag. On the first card, two triangles back to back—one a deep ocean blue, one the pastel mix of an early-morning sky—form a single triangle. In the center of that triangle, the number six is painted in dark, glittery blue.</p><p>Things you know but do not think you know, Albion said.</p><p>Chora begins her cooking every night by sprinkling six grains of salt into a pan. Albion meditates six times a day. Without knowing why, I’ve always thought of the number six as my lucky number. It has an unarticulated power in my family, like an open secret that determines everything.</p><p>The next card features a black crown at the top and a black tombstone at the bottom. In the center, thick, curving lines resemble an ocean wave. One line curls upward on the right side; another dips down on the left, connecting the crown to the tombstone. Tombstones usually stand for death, but what about the crown?</p><p>My gaze drifts to the remains of the fire. I realize that the wavelike image on the card symbolizes wind—Seedbearer wind created from breath.</p><p>Wind is the source of the Seedbearers’ power—that’s the connection to the crown. But I don’t know about the tombstone. The need to understand grips me, and for the first time, I know for certain that I will meet my family tonight. I won’t simply run away. I will ask them these questions then. That’s why Albion gave me the envelope. He knew I’d need to know the truth.</p><p>On to the last card: the point of a red, twin-lobed heart shape pricks an anatomically accurate depiction of a human heart. Half of the human heart is red; the other half is the sickly gray of rancid meat. Blood drips from the human heart.</p><p>My family has always made it clear that love drains life. It’s a mantra muttered often in my home. I’ve heard Starling say it to a sunset, Albion say it about a tragic story he overheard. Once, Critias said it under his breath while looking straight at me. It’s a warning, a weaning. I’ll be expected now to say it to myself, like an adult.</p><p>“Love drains life,” I whisper, wondering how much life there is left to drain.</p><p>Without love, I’ll be strong and supple, eighteen forever. Every time I let love or passion creep into my soul, I will age a little more. Acts of extreme detachment—such as abandoning Shiloh—reverse the aging process. This explains why my aunts and uncles range from hundreds to thousands of years old. They failed at completely shutting off emotion at eighteen, but they’ve learned to temper and offset it so that none of them looks older than fifty. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I test myself. I think of Eureka’s laughter in the restaurant window. The thought brings me to my knees. I touch my face, certain I’ll find wrinkles. Am I older? I don’t feel anything but the desire to see her, touch her—</p><p>They’re going to know. They’ll smell weakness on me. They’ll see the signs of aging. I must do something, take control.</p><p>Shiloh. I love everything about him. He’ll expose my failure unless I get rid of him now. He rises when I stand, puts his front paws on my chest.</p><p>“You’re easy to love,” I tell him. “Someone else will do a better job than me.”</p> <p>He barks and I don’t scratch his head the way I want to. I slip the cards into the envelope and back into my pocket. I pace the clearing and remember something I’ve seen my aunts do with stray cats.</p><p>I have a strength that I’m forgetting. I can use it to help Shiloh. I study his face, memorizing every inch.</p><p>When I inhale, I aim my breath at Shiloh’s heart. Instantly, he rises off the ground. He whines but doesn’t struggle. His eyes are locked on mine as he wobbles, unbalanced and clumsy, in the air. I’m not sure what to do with him. My breath feels the weight of him and my lungs strain under the effort. If I send him straight in one direction, no matter how far away, he’ll find me again. I have to disorient him first.</p><p>I focus my breath and spin him like a top. He whimpers, his tail tucked between his legs. He makes the sounds he makes when he’s sick.</p><p>I empty my lungs into a long curving line. Shiloh tumbles over the barren treetops, a strange angel, his paws paddling the air. I send him west, toward the edge of the woods and a girl I saw yesterday playing with a hula hoop in a yard just off the street.</p> <p>Though I can’t see him anymore, I take care to focus and set him down gently. Now he’s out of my control. I meant to give him one last breath to start him trotting toward the little girl’s yard, but it’s too late.</p><p>We’re both on our own.</p><p>I roll up my sleeping bag and start the long walk back to my family.</p><p>IV</p><p>When I arrive they are waiting, sitting around a perfect campfire. They’re drinking nettle tea from small tin mugs. The night is black and frigid.</p><p>Though they don’t acknowledge my presence, they must sense me, because slowly and in unison they begin to clap. I feel their breath focus in on me as the power of their shared inhalation lifts me off the ground.</p> <p>I hover ten, then twenty feet above the campfire and try not to think of Shiloh. The exaltation is undeserved, out of place. My family stands and applauds. The unprecedented joy on their faces renders them indistinguishable in the firelight. In their eyes glistens a pride I’ve never seen before.</p><p>I watch my shadow on the ground beside the fire. The control of my aunts’ and uncles’ breaths is infinitely more precise than mine. I envy and hate them.</p><p>They exhale and lower me softly to the ground. My boots touch earth and the weight of my body returns. My eyelids are too heavy for me to look at anyone.</p><p>Albion motions for the others to sit down and comes to stand beside me. He and I are the same height, but tonight he towers over me.</p><p>“Your Passage was successful,” he says.</p><p>It is not a question.</p><p>“You feel lighter now,” he tells me. “Freer.”</p><p>I am heavier, enslaved.</p> <p>“You are confident of your role and identity in the universe.”</p><p>I’ve never been more lost or alone.</p><p>“You have questions.”</p><p>Now I meet his eyes. “Yes.”</p><p>“Take your time. You may ask anything. Our secrets are yours.”</p><p>I set my backpack down. It sags with gloomy lightness. I reach inside my coat and pull out the first card, which I lay on the ground before the fire.</p><p>“I want to know the significance of the number six.”</p><p>Albion nods. “When our forefather—”</p><p>“Leander,” I say. I’m named after him. He’s the original Seedbearer, the ancestor from whom we all descend.</p><p>“—when Leander escaped the confines of Atlantis,” Albion continues, “he made landfall in the Waking World and sired six children with six women. These children are the original six Seedbearers. They found each other after Leander’s death and vowed to carry the lessons of Atlantis into perpetuity. From that moment on, there have always been six living Seedbearers, and there must always be six living Seedbearers. It is essential to our strength.”</p><p>I look at him, then across the fire at my two aunts and two uncles. Chora, Starling, Critias, Albion ... and me. That’s only five. “Someone is missing,” I say.</p><p>I expect them to mock me or change the subject, but things are different than they were yesterday.</p><p>“His name is Solon.” Albion’s jaw tightens. “He is a disgrace and was banished.”</p><p>So this is the last one Albion said I am not like.</p><p>“What did he do?” I ask.</p><p>“It was what he would not do that exiled him,” Chora says.</p><p>Albion waves her off. “He went through the same Passage that you completed, that all of us completed. But Solon could never truly free himself. A passion enslaved him, and probably still does.”</p><p>My face reddens. “Where is he now?”</p><p>Albion looks far to the west, as if his gaze could see across an ocean. “Do not fear him; he is no threat. His is a meaningless life, but he must live it to ensure our meaningful ones. Do you understand?”</p><p>“I think so.” In the hazy way I have come to understand so much about my family, I have a sense of how each Seedbearer is linked inextricably to the others. Our breath connects us. We live as one organism—which means that we die as one, as well. “If one of us dies—”</p><p>Albion nods. “All of us die.”</p><p>“How long has Solon been gone?” I ask.</p><p>“We have lived almost seventy-five years without him. His punishment is permanent, his exile absolute.”</p><p>“But he won’t die?”</p><p>My aunts laugh their cruel laughs.</p><p>“He does not have the means,” Albion says. “Do you understand?”</p><p>My hands are stiff when I draw the second card from the envelope. My aunts and uncles nod as I place it on the ground. The black crown and the tombstone look ghostly in the dancing firelight.</p><p>“Yes,” Albion says. “Power and death derive from breath.”</p><p>I wait for him to continue.</p><p>“Many times you have seen us employ the Zephyr—the name for the power of our collective breath. It is our weapon and our shield. It can influence the tides, the weather. It is a power unmatched in this world. You have it in you, too.” He raises an eyebrow. “You may have experimented with it?”</p><p>I repress thoughts of Shiloh. “I have.”</p><p>“You will improve. The Zephyr derived from Leander. It intertwines our lives. It is also our weakness. Only one substance can kill us, but a single breath of it is death. This poison is a rare strain of the plant known as artemisia. It killed Leander and each of the eleven Seedbearers who have died—always voluntarily, always in the first moment of a new and stronger Seedbearer’s life.”</p><p>“Is that how my mother died?” I ask.</p><p>My family’s shared glances answer yes, but I can’t let myself care. “Where do you get artemisia?”</p><p>“We possess the only remaining quantity in the Waking World,” says Chora. He holds up a small metal chest. I’ve seen it before. It is one of five orichalcum relics salvaged before the flood. As her fingers trace the clasp, Albion walks over to her and places his hands on hers.</p><p>“Simply know that it is here, Ander, and well protected. Your life is never in danger as long as this chest remains with us.”</p><p>“If it’s so deadly, why not destroy it?” I say. “Why do we keep it?”</p><p>“We keep it to help one Seedbearer pass out of this world when a new and stronger one enters—like you. We keep it because we may perhaps one day be forced to choose death over life. But enough poisonous talk. There is another card.”</p><p>I place the last card next to the others. It looks faded, as if its red pigment rubbed off in my pocket.</p><p>Albion waits.</p><p>“Love drains life,” I whisper.</p><p>My family leans forward, watching me.</p><p>“Love is important,” Albion says. “Love brought you up to be a man. Love versed you in loss and sorrow, which leads to strength, which is detachment from these self-imposed vulnerabilities. Yes, love has served you well. But listen closely, Ander: love is child’s play. To assume your place among your people, you must prove you can grow out of love, and shed it like a snake loses its skin. Only then can you live forever, like us.”</p><p>“You may slip from time to time.” Starling, raises her frail shoulders. “It is only natural. But soon you will be a master. You will observe the passing parade of life for ages to come. You will understand far more than any mortal. You will recognize patterns and cycles that the greatest geniuses among them never can.”</p><p>“It’s astonishing, how their little life spans keep them sprinting on their various hamster wheels,” Critias says. His eyes close halfway in revulsion, so that only the whites are visible.</p><p>Albion studies me. “You should already sense a difference.”</p><p>I can’t be so unusual—but can the rest of them be this skilled at lying? Or is it that they’ve simply forgotten what it’s like to feel? Are they hypocrites, or insane? I take comfort in thinking of Solon, the exiled uncle I’ve never heard about before tonight. Did his failure look anything like mine?</p><p>“When Solon failed,” I ask, “why didn’t you replace him with a new Seedbearer, the way I replaced my mother when she died? Why didn’t you kill him instead of exiling him?”</p><p>“You tell me,” Albion replies.</p><p>I think; then I know. “He is too strong.”</p><p>My family closes in a tight circle around me.</p><p>“Prove to us you’ve changed,” Chora says. She looks at Starling, who steps forward holding something wrapped in foil. When she pulls the foil back, steam rises and a wonderful aroma fills the air. Keeping her eyes on my lips, Starling dips a spoon into the dark dish and says, “Open.”</p><p>I close my mouth around the spoon. The substance is sweet, buttery, crisp, and warm. Something deep and strong takes hold of me. The food is so delicious I can barely swallow.</p><p>Suddenly, I remember Starling feeding me this dish on cold mornings of my childhood. I remember her soft cooing as she wiped the corners of my mouth.</p><p>Blueberry cobbler. The words fill me with a mighty nostalgia.</p><p>But I must stifle everything I feel.</p><p>“What do you think?” Starling’s eyes betray none of the compassion I remember. This is the test. Years ago they planted this memory inside me. They fed me cobbler and feigned love, and now they want to know if I can conquer the only memory of comfort and safety I have.</p><p>“What is it?” I ask as blandly as I can.</p><p>“Leftovers,” Chora says slowly. “We thought you might be hungry.”</p><p>“We’d like you to listen to something.” Albion nods at Critias, who presses Play on an old tape recorder. The quiet night bursts into music. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Let All Mortal Flesh Keep Silence.” Critias used to take me to St. John’s to listen to Eureka sing. This song often made the worshippers in the pews around me cry. It is unspeakably beautiful, and I can make out twelve-year-old Eureka’s voice perfectly, hear how her words are affected by her braces. I want to swoon, to fall down to the ground and scream.</p><p>“Tell us what you feel,” Albion says.</p><p>Eureka’s voice is so steady. I’m about to lose it. It takes all my strength to adopt a monotone. “I’m very tired. Is it a lullaby?”</p><p>I do not want to know the person I sound like.</p> <p>“You’re doing fine,” Albion says. “You’re nearly done. We want to show you one more thing.”</p><p>I know what he’s holding before he turns the photograph around. I try to look at it without seeing it. It’s a close-up of Eureka smiling on a beach. She’s wearing an orange tank top and her hair has been lightened by the sun. Her eyes are more alive than mine will ever be.</p><p>It’s obvious I’ve failed. I will never give her up, never grow out of love. Why can’t my family see that love is the start and end of me?</p><p>“Well, Ander?” Albion says. “Tell us what comes to mind.”</p><p>“Demise,” I nearly choke.</p> <p>Around me, my family smiles.</p><p>“Indeed, she has it coming,” Chora says. “We accept that you are ready.”</p><p>“Are you ready, Ander?” my aunts and uncles ask in unison.</p><p>“Yes,” I gasp.</p><p>“Good.” Albion claps my shoulder, radiating emptiness into me. “It is time to kill Eureka.”</p><p>If you enjoyed this special TEARDROP story, look for Lauren Kate’s new series, TEARDROP, the epic saga of Eureka Boudreaux, a seventeen-year-old girl whose tears have the power to raise the lost continent of Atlantis.</p> <p>Here’s a sneak peek at the first novel in the series.</p><p>Excerpt copyright © 2013 by Lauren Kate. All rights reserved. Published in the United States by Delacorte Press, an imprint of Random House Children’s Books, a division of Random House LLC, New York.</p><p>1</p><p>EUREKA</p><p>In the stillness of the small beige waiting room, Eureka’s bad ear rang. She massaged it—a habit since the accident, which had left her half deaf. It didn’t help. Across the room, a doorknob turned. Then a woman with a gauzy white blouse, olive-green skirt, and very fine, upswept blond hair appeared in the lamplit space.</p><p>“Eureka?” Her low voice competed with the burbling of a fish tank that featured a neon plastic scuba diver buried to his knees in sand but showed no sign of containing fish.</p><p>Eureka looked around the vacant lobby, wishing to invoke some other, invisible Eureka to take her place for the hour.</p><p>“I’m Dr. Landry. Please come in.”</p> <p>Since Dad’s remarriage four years ago, Eureka had survived an armada of therapists. A life ruled by three adults who couldn’t agree on anything proved far messier than one ruled by just two. Dad had doubted the first analyst, an old-school Freudian, almost as much as Mom had hated the second, a heavy-lidded psychiatrist who doled out numbness in pills. Then Rhoda, Dad’s new wife, came onto the scene, game to try the school counselor, and the acupuncturist, and the anger manager. But Eureka had put her foot down at the patronizing family therapist, in whose office Dad had never felt less like family. She’d actually half liked the last shrink, who’d touted a faraway Swiss boarding school—until her mother caught wind of it and threatened to take Dad to court.</p><p>Eureka noted her new therapist’s taupe leather slip-ons. She’d sat on the couch across from many similar pairs of shoes. Female doctors did this little trick: they slipped off their flats at the beginning of a session, slid their feet back into them to signal the end. They all must have read the same dull article about the Shoe Method being gentler on the patient than simply saying time was up.</p><p>The office was purposefully calming: a long maroon leather couch against the shuttered window, two upholstered chairs opposite a coffee table with a bowl of those coffee gold-wrapped candies, a rug stitched with different-colored footprints. A plug-in air freshener made everything smell like cinnamon, which Eureka did not mind. Landry sat in one of the chairs. Eureka tossed her bag on the floor with a loud thump—honors textbooks were bricks—then slid down low on the couch.</p><p>“Nice place,” she said. “You should get one of those swinging pendulums with the silver balls. My last doctor had one. Maybe a water cooler with the hot and cold taps.”</p><p>“If you’d like some water, there’s a pitcher by the sink. I’d be happy to—”</p><p>“Never mind.” Eureka had already let slip more words than she’d intended to speak the whole hour. She was nervous. She took a breath and reerected her walls. She reminded herself she was a Stoic.</p><p>One of Landry’s feet freed itself from its taupe flat, then used its stockinged toe to loosen the other shoe’s heel, revealing maroon toenails. With both feet tucked under her thighs, Landry propped her chin in her palm. “What brings you here today?”</p><p>When Eureka was trapped in a bad situation, her mind fled to wild destinations she didn’t try to avoid. She imagined a motorcade cruising through a ticker-tape parade in the center of New Iberia, stylishly escorting her to therapy.</p><p>But Landry looked sensible, interested in the reality from which Eureka yearned to escape. Eureka’s red Jeep had brought her here. The seventeen-mile stretch of road between this office and her high school had brought her here—and every second ticked toward another minute during which she wasn’t back at school warming up for that afternoon’s cross-country meet. Bad luck had brought her here.</p><p>Or was it the letter from Acadia Vermilion Hospital, stating that because of her recently attempted suicide, therapy was not optional but mandatory?</p><p>Suicide. The word sounded more violent than the attempt had been. The night before she was supposed to start her senior year, Eureka had simply opened the window and let the gauzy white curtains billow toward her as she lay down in her bed. She’d tried to think of one bright thing about her future, but her mind had only rolled backward, toward lost moments of joy that could never be again. She couldn’t live in the past, so she decided she couldn’t live. She turned up her iPod. She swallowed the remainder of the oxycodone pills Dad had in the medicine cabinet for the pain from the fused disc in his spine.</p><p>Eight, maybe nine pills; she didn’t count them as they tumbled down her throat. She thought of her mother. She thought of Mary, mother of God, who she’d been raised to believe prayed for everyone at the hour of death. Eureka knew the Catholic teachings about suicide, but she believed in Mary, whose mercy was vast, who might understand that Eureka had lost so much there was nothing to do but surrender.</p><p>She woke up in a cold ER, strapped to a gurney and gagging on the tube of a stomach pump. She heard Dad and Rhoda fighting in the hallway while a nurse forced her to drink awful liquid charcoal to bind to the poisons they couldn’t purge from her system.</p><p>Because she didn’t know the language that would have gotten her out sooner—“I want to live,” “I won’t try that again”—Eureka spent two weeks in the psychiatric ward. She would never forget the absurdity of jumping rope next to the huge schizophrenic woman during calisthenics, of eating oatmeal with the college kid who hadn’t slit his wrists deep enough, who spat in the orderlies’ faces when they tried to give him pills. Somehow, sixteen days later, Eureka was trudging into morning Mass before first period at Evangeline Catholic High, where Belle Pogue, a sophomore from Opelousas, stopped her at the chapel door with “You must feel blessed to be alive.”</p><p>Eureka had glared into Belle’s pale eyes, causing the girl to gasp, make the sign of the cross, and scuttle to the farthest pew. In the six weeks she’d been back at Evangeline, Eureka had stopped counting how many friends she’d lost.</p><p>Dr. Landry cleared her throat.</p><p>Eureka stared up at the drop-panel ceiling. “You know why I’m here.”</p><p>“I’d love to hear you put it into words.”</p><p>“My father’s wife.”</p><p>“You’re having problems with your stepmother?”</p><p>“Rhoda makes the appointments. That’s why I’m here.”</p><p>Eureka’s therapy had become one of Dad’s wife’s causes. First it was to deal with the divorce, then to grieve her mother’s death, now to unpack the suicide attempt. Without Diana, there was no one to intercede on Eureka’s behalf, to make a call and fire a quack. Eureka imagined herself still stuck in sessions with Dr. Landry at the age of eighty-five, no less screwed up than she was today.</p><p>“I know losing your mother has been hard,” Landry said. “How are you feeling?”</p><p>Eureka fixed on the word losing, as if she and Diana had been separated in a crowd and they’d soon reunite, clasp hands, saunter toward the nearest dockside restaurant for fried clams, and carry on as if they’d never been apart.</p><p>That morning, across the breakfast table, Rhoda had sent Eureka a text: Dr. Landry. 3 p.m. There was a hyperlink to send the appointment to her phone’s calendar. When Eureka clicked on the office address, a pin on the map marked the Main Street location in New Iberia.</p><p>“New Iberia?” Her voice cracked.</p><p>Rhoda swallowed some vile-looking green juice. “Thought you’d like that.”</p><p>New Iberia was the town where Eureka had been born, had grown up. It was the place she still called home, where she’d lived with her parents for the unshattered portion of her life, until they split and her mom moved away and Dad’s confident stride began to resemble a shuffle, like that of the blue claw crabs at Victor’s, where he used to be the chef.</p><p>That was right around Katrina, and Rita came close behind. Eureka’s old house was still there—she’d heard another family lived in it now—but after the hurricanes, Dad hadn’t wanted to put in the time or emotion to repair it. So they’d moved to Lafayette, fifteen miles and thirty light-years from home. Dad got a job as a line cook at Prejean’s, which was bigger and far less romantic than Victor’s. Eureka changed schools, which sucked. Before Eureka knew that Dad was even over her mom, the two of them were moving into a big house on Shady Circle. It belonged to a bossy lady named Rhoda. She was pregnant. Eureka’s new bedroom was down the hall from a nursery-in-progress.</p><p>So, no, Rhoda, Eureka did not like that this new therapist lived way out in New Iberia. How was she supposed to drive all the way to the appointment and make it back in time for her meet?</p><p>The meet was important, not only because Evangeline was racing their rival, Manor High. Today was the day Eureka had promised Coach she’d make her decision about whether to stay on the team.</p><p>Before Diana died, Eureka had been named senior captain. After the accident, when she was physically strong enough, friends had begged her to run a few summer scrimmages. But the one run she’d gone to had made her want to scream. Underclassmen held out cups of water drenched in pity. Coach chalked up Eureka’s slow speed to the casts binding her wrists. It was a lie. Her heart wasn’t in the race anymore. It wasn’t with the team. Her heart was in the ocean with Diana. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After the pills, Coach had brought balloons, which looked absurd in the sterile psych-ward room. Eureka hadn’t even been allowed to keep them after visiting hours ended.</p><p>“I quit,” Eureka told her. She was embarrassed to be seen with her wrists and ankles bound to her bed. “Tell Cat she can have my locker.”</p><p>Coach’s sad smile suggested that after a suicide attempt, a girl’s decisions weighed less, like bodies on the moon. “I ran my way through two divorces and a sister’s battle with cancer,” Coach said. “I’m not saying this just because you’re the fastest kid on my team. I’m saying this because maybe running is the therapy you need. When you’re feeling better, come see me. We’ll talk about that locker.”</p><p>Eureka didn’t know why she’d agreed. Maybe she didn’t want to let another person down. She’d promised to try to be back in shape by the race against Manor today, to give it one more shot. She used to love to run. She used to love the team. But that was all before.</p> <p>“Eureka,” Dr. Landry prompted. “Can you tell me something you remember about the day of the accident?”</p><p>Eureka studied the blank canvas of the ceiling, as if it might paint her a clue. She remembered so little about the accident there was no point opening her mouth. A mirror hung on the far wall of the office. Eureka rose and stood before it.</p><p>“What do you see?” Landry asked.</p><p>Traces of the girl she’d been before: same small, open-car-door ears she tucked her hair behind, same dark blue eyes like Dad’s, same eyebrows that ran wild if she didn’t tame them daily—it was all still there. And yet, just before this appointment, two women Diana’s age had passed her in the parking lot, whispering, “Her own mother wouldn’t recognize her.”</p><p>It was an expression, like a lot of things New Iberia said about Eureka: She could argue with the wall in China and win. Couldn’t carry a tune in a bucket covered in glue. Runs faster than a stomped-on pissant at the Olympics. The trouble with expressions was how easily they rolled off the tongue. Those women weren’t thinking about the reality of Diana, who would know her daughter anywhere, anytime, no matter the circumstances.</p> <p>Thirteen years of Catholic school had told Eureka that Diana was looking down from Heaven and recognizing her now. She wouldn’t mind the ripped Joshua Tree T-shirt under her daughter’s school cardigan, the chewed nails, or the hole in the left big toe of her houndstooth canvas shoes. But she might be pissed about the hair.</p><p>In the four months since the accident, Eureka’s hair had gone from virgin dirty-blond to siren red (her mother’s natural shade) to peroxide white (her beauty-salon-owning aunt Maureen’s idea) to raven black (which finally seemed to fit) and was now growing out in an interesting ombré shag. Eureka tried to smile at her reflection, but her face looked strange, like the comedy mask that had hung on her drama class wall last year.</p><p>“Tell me about your most recent positive memory,” Landry said.</p><p>Eureka sank back onto the couch. It must have been that day. It must have been the Jelly Roll Morton CD on the stereo and her mother’s awful pitch harmonizing with her awful pitch as they drove with the windows down along a bridge they’d never cross. She remembered laughing at a funny lyric as they approached the middle of the bridge. She remembered seeing the rusted white sign whizz by—MILE MARKER FOUR.</p><p>Then: Oblivion. A gaping black hole until she awoke in a Miami hospital with a lacerated scalp, a burst left eardrum that would never fully heal, a twisted ankle, two severely broken wrists, a thousand bruises—</p><p>And no mother.</p> <p>Dad had been sitting at the edge of her bed. He cried when she came to, which made his eyes even bluer. Rhoda handed him tissues. Eureka’s four-year-old half siblings, William and Claire, clasped small, soft fingers around the parts of her hands not enclosed in casts. She’d smelled the twins even before she opened her eyes, before she knew anyone was there or that she was alive. They smelled like they always did: Ivory soap and starry nights.</p><p>Rhoda’s voice was steady when she leaned over the bed and promoted her red glasses to the top of her head. “You’ve been in an accident. You’re going to be fine.”</p><p>They told her about the rogue wave that rose like a myth out of the ocean and swept her mother’s Chrysler from the bridge. They told her about scientists searching the water for a meteor that might have caused the wave. They told her about the construction workers, asked whether Eureka knew how or why their car was the only one allowed to cross the bridge. Rhoda mentioned suing the county, but Dad had motioned Let it go. They asked Eureka about her miraculous survival. They waited for her to fill in the blanks about how she’d ended up on the shore alone.</p><p>When she couldn’t, they told her about her mother.</p><p>She didn’t listen, didn’t really hear any of it. She was grateful that the tinnitus in her ear drowned out most sounds. Sometimes she still liked that the accident had left her half-deaf. She’d stared at William’s soft face, then at Claire’s, thinking it would help. But they looked afraid of her, and that hurt more than her broken bones. So she stared past them all, relaxed her gaze on the off-white wall, and left it there for the next nine days. She always told the nurses that her pain level was seven out of ten on their chart, ensuring she’d get more morphine.</p><p>“You might be feeling like the world is a very unfair place,” Landry tried.</p><p>Was Eureka still in this room with this patronizing woman paid to misunderstand her? That was unfair. She pictured Landry’s broken-in taupe shoes rising magically from the carpet, hovering in the air and spinning like minute and hour hands on a clock until time was up and Eureka could speed back to her meet.</p><p>“Cries for help like yours often result from feeling misunderstood.”</p> <p>“Cry for help” was shrink-speak for “suicide attempt.” It wasn’t a cry for help. Before Diana died, Eureka thought the world was an incredibly exciting place. Her mother was an adventure. She noticed things on an average walk most people would pass by a thousand times. She laughed louder and more often than anyone Eureka ever knew—and there were times that had embarrassed Eureka, but these days she found she missed her mother’s laughter above everything else.</p><p>Together they had been to Egypt, Turkey, and India, on a boat tour through the Galápagos Islands, all as part of Diana’s archaeological work. Once, when Eureka went to visit her mother on a dig in northern Greece, they missed the last bus out of Trikala and thought they were stuck for the night—until fourteen-year-old Eureka hailed an olive oil truck and they hitchhiked back to Athens. She remembered her mother’s arm around her as they sat in the back of the truck among the pungent, leaky vats of olive oil, her low voice murmuring: “You could find your way out of a foxhole in Siberia, girl. You’re one hell of a traveling companion.” It was Eureka’s favorite compliment. She thought of it often when she was in a situation she needed to get out of.</p><p>“I’m trying to connect with you, Eureka,” Dr. Landry said. “People closest to you are trying to connect with you. I asked your stepmother and your father to jot down some words to describe the change in you.” She reached for a marbled notebook on the end table next to her chair. “Would you like to hear them?”</p><p>“Sure.” Eureka shrugged. “Pin the tail on the donkey.”</p><p>“Your stepmother—”</p><p>“Rhoda.”</p><p>“Rhoda called you ‘chilly.’ She said the rest of the family engages in ‘eggshell walking’ around you, that you’re ‘reclusive and impatient’ with your half siblings.”</p><p>Eureka flinched. “I am not ...” Reclusive—who cared? But impatient with the twins? Was that true? Or was it another one of Rhoda’s tricks?</p><p>“What about Dad? Let me guess—‘distant,’ ‘morose’?”</p><p>Landry turned a notebook page. “Your father describes you as, yes, ‘distant,’ ‘stoic,’ ‘a tough nut to crack.’ ”</p><p>“Being stoic isn’t a bad thing.” Since she’d learned about Greek Stoicism, Eureka had aspired to keep her emotions in check. She liked the idea of freedom gained through taking control of her feelings, holding them so that only she could see them, like a hand of cards. In a universe without Rhodas and Dr. Landrys, Dad’s calling her “stoic” might have been a compliment. He was stoic, too.</p><p>But that tough-nut phrase bothered her. “What kind of suicidal nut wants to be cracked?” she muttered.</p><p>Landry lowered the book. “Are you having further thoughts of suicide?”</p><p>“I was referring to the nuts,” Eureka said, exasperated. “I was putting myself in opposition to a nut who ... Never mind.” But it was too late. She’d let the s-word slip, which was like saying “bomb” on a plane. Warning lights would be flashing inside Landry.</p><p>Of course Eureka still thought about suicide. And yeah, she’d pondered other methods, knowing mostly that she couldn’t try drowning—not after Diana. She’d once seen a show about how the lungs fill with blood before drowning victims die. Sometimes she talked about suicide with her friend Brooks, who was the only person she could trust not to judge her, not to report back to Dad or worse. He’d sat on muted conference call when she’d called this hotline a few times. He made her promise she would talk to him whenever she thought about it, so they talked a lot.</p><p>But she was still here, wasn’t she? The urge to leave this world wasn’t as crippling as it had been when Eureka swallowed those pills. Lethargy and apathy had replaced her drive to die.</p><p>“Did Dad happen to mention I’ve always been that way?” she asked.</p><p>Landry set her notebook on the table. “Always?”</p><p>Now Eureka looked away. Maybe not always. Of course not always. Things had been sunny for a while. But when she was ten, her parents split up. You didn’t just find the sun after that.</p><p>“Any chance you could dash out a Xanax prescription?” Eureka’s left eardrum was ringing again. “Otherwise this seems to be a waste of time.”</p><p>“You don’t need drugs. You need to open up, not bury this tragedy. Your stepmother says you won’t talk to her or your father. You’ve shown no interest in conversing with me. What about your friends at school?”</p><p>“Cat,” Eureka said automatically. “And Brooks.” She talked to them. If either of them had been sitting in Landry’s seat, Eureka might even have been laughing right now.</p><p>“Good.” Dr. Landry meant: Finally. “How would they describe you since the accident?”</p><p>“Cat’s captain of the cross-country team,” Eureka said, thinking of the wildly mixed emotions on her friend’s face when Eureka said she was quitting, leaving the captain position open. “She’d say I’ve gotten slow.”</p><p>Cat would be on the field with the team right now. She was great at running them through their drills, but she wasn’t brilliant at pep talks—and the team needed pep to face Manor. Eureka glanced at her watch. If she dashed back as soon as this was over, she might make it to school in time. That was what she wanted, right? </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When she looked up, Landry’s brow was furrowed. “That would be a pretty harsh thing to say to a girl who’s grieving the loss of a mother, don’t you think?”</p><p>Eureka shrugged. If Landry had a sense of humor, if she knew Cat, she would get it. Her friend was joking, most of the time. It was fine. They’d known each other forever.</p><p>“What about ... Brooke?”</p><p>“Brooks,” Eureka said. She’d known him forever, too. He was a better listener than any of the shrinks Rhoda and Dad wasted their money on.</p> <p>“Is Brooks a he?” The notebook returned and Landry scribbled something. “Are the two of you just friends?”</p><p>“Why does that matter?” Eureka snapped. Once upon an accident she and Brooks had dated—fifth grade. But they were kids. And she was a wreck about her parents splitting up and—</p><p>“Divorce often provokes behavior in children that makes it difficult for them to pursue their own romantic relationships.”</p><p>“We were ten. It didn’t work out because I wanted to go swimming when he wanted to ride bikes. How did we even start talking about this?”</p><p>“You tell me. Perhaps you can talk to Brooks about your loss. He seems to be someone you could care deeply about, if you would give yourself permission to feel.”</p> <p>Eureka rolled her eyes. “Put your shoes back on, Doc.” She grabbed her bag and rose from the couch. “I’ve gotta run.”</p><p>Run from this session. Run back to school. Run through the woods until she was so tired she didn’t ache. Maybe even run back to the team she used to love. Coach had been right about one thing: when Eureka was low, running helped.</p><p>“I’ll see you next Tuesday?” Landry called. But by then the therapist was talking to a closing door.</p><p>2</p><p>OBJECTS IN MOTION</p><p>Jogging through the potholed parking lot, Eureka pressed her key chain remote to unlock Magda, her car, and slid into the driver’s seat. Yellow warblers harmonized in a beech tree overhead; Eureka knew their song by heart. The day was warm and windy, but parking under the tree’s long arms had kept Magda’s interior cool.</p> <p>Magda was a red Jeep Cherokee, a hand-me-down from Rhoda. It was too new and too red to suit Eureka. With the windows rolled up, you couldn’t hear anything outside, and this made Eureka imagine she was driving a tomb. Cat had insisted they name the car Magda, so at least the Jeep would be good for a laugh. It wasn’t nearly as cool as Dad’s powder-blue Lincoln Continental, in which Eureka had learned to drive, but at least it had a killer stereo.</p><p>She plugged in her phone and cranked up the online school radio station KBEU. They played the best songs by the best local and indie bands every weekday after school. Last year, Eureka had DJ’d for the station; she’d had a show called Bored on the Bayou on Tuesday afternoons. They’d held the slot for her this year, but she hadn’t wanted it anymore. The girl who’d spun old zydeco jams and recent mash-ups was someone she could barely remember, let alone try to be again.</p><p>Rolling down all four windows and the sunroof, Eureka peeled out of the lot to the tune of “It’s Not Fair” by the Faith Healers, a band formed by some kids from school. She had all the lyrics memorized. The loopy bass line propelled her legs faster through her sprints and had been the reason she dug up her grandfather’s old guitar. She’d taught herself a few chords but hadn’t touched the guitar since the spring. She couldn’t imagine the music she’d make now that Diana was dead. The guitar sat gathering dust in the corner of her bedroom under the small painting of Saint Catherine of Siena, which Eureka had lifted from her grandmother Sugar’s house after she died. No one knew where Sugar got the icon. For as long as Eureka could remember, the painting of the patron saint of protection from fire had hung over her grandmother’s mantel.</p><p>Her fingers rapped on the steering wheel. Landry didn’t know what she was talking about. Eureka felt things, things like ... annoyed that she’d just wasted another hour in another drab therapy room.</p><p>There were other things: Cold fear whenever she drove over even the shortest bridge. Debilitating sadness when she lay sleepless in bed. A heaviness in her bones whose source she had to trace anew each morning when her phone’s alarm sounded. Shame that she’d survived and Diana hadn’t. Fury that something so absurd had taken her mother away.</p><p>Futility at seeking vengeance on a wave.</p><p>Inevitably, when she allowed herself to follow her sad mind’s wanderings, Eureka ended up at futility. Futility annoyed her. So she veered away, focused on things she could control—like getting back to campus and the decision awaiting her.</p><p>Even Cat didn’t know Eureka might show up today. The 12K used to be Eureka’s best event. Her teammates moaned about it, but to Eureka, sinking into the hypnotic zone of a long run was rejuvenating. A sliver of Eureka wanted to race the Manor kids, and a sliver was more of her than had wanted to do anything other than sleep for months.</p> <p>She would never give Landry the satisfaction, but Eureka did feel utterly misunderstood. People didn’t know what to do with a dead mother, much less her living, suicidal daughter. Their robotic back pats and shoulder squeezes made Eureka squirrelly. She couldn’t fathom the insensitivity required to say to someone, “God must have missed your mother in Heaven” or “This might make you a better person.”</p><p>This clique of girls at school who’d never acknowledged her before drove by her mailbox after Diana died to drop off a cross-stitched friendship bracelet with little crosses on it. At first, when Eureka ran into them in town bare-wristed, she’d avoided their eyes. But after she’d tried to kill herself, that wasn’t a problem anymore. The girls looked away first. Pity had its limits.</p><p>Even Cat had only recently stopped tearing up when she saw Eureka. She’d blow her nose and laugh and say, “I don’t even like my mom, and I’d lose it if I lost her.”</p><p>Eureka had lost it. But because she didn’t fall apart and cry, didn’t lunge into the arms of anyone who tried to hug her or cover herself with handmade bracelets, did people think she wasn’t grieving?</p><p>She grieved every day, all the time, with every atom of her body.</p><p>You could find your way out of a foxhole in Siberia, girl. Diana’s voice found her as she passed Hebert’s whitewashed Bait Shack and turned left onto the gravel road lined by tall stalks of sugarcane. The land on either side of this three-mile stretch of road between New Iberia and Lafayette was some of the prettiest in three parishes: huge live oak trees carving out blue sky, high fields dotted with wild periwinkles in the spring, a lone flat-roofed trailer on stilts about a quarter of a mile back from the road. Diana used to love this part of the drive to Lafayette. She called it “the last gasp of country before civilization.”</p><p>Eureka hadn’t been on this road since before Diana died. She’d turned here so casually, not thinking it would hurt, but suddenly she couldn’t breathe. Every day some new pain found her, stabbed her, as if grief were the foxhole she would see no way out of until she died.</p><p>She almost stopped the car to get out and run. When she was running, she didn’t think. Her mind cleared, oak trees’ arms embraced her with their fuzzy Spanish moss, and she was just feet pounding, legs burning, heart beating, arms pumping, blending into trails until she became something far away.</p><p>She thought of the meet. Maybe she could channel desperation into something useful. If she could just make it back to school in time ...</p><p>The week before, the last of the heavy casts she’d had to wear on her shattered wrists (the right one had been broken so severely it had to be reset three times) had finally been sawed off. She’d hated wearing the thing and couldn’t wait to see it shredded. But last week, when the orthopedist tossed the cast in the trash and pronounced her healed, it sounded like a joke.</p><p>As Eureka pulled up to a four-way stop sign on the empty road, bay branches bent in an arc over the sunroof. She pushed the green sleeve of her school cardigan up. She turned her right wrist over a few times, studying her forearm. The skin was as pale as the petal of a magnolia. Her right arm’s circumference seemed to have shrunk to half the size of her left. It looked freakish. It made Eureka ashamed. Then she became ashamed of her shame. She was alive; her mother wasn’t—</p><p>Tires screeched behind her. A hard bump split her lips open in a yelp of shock as Magda lurched forward. Eureka’s foot ground against the brake. The airbag bloomed like a jellyfish. The force of the rough fabric stung her cheeks and nose. Her head snapped against the headrest. She gasped, the wind knocked out of her, as every muscle in her body clenched. The din of crunching metal made the music on the stereo sound eerily new. Eureka listened to it for a moment, hearing the lyric “always not fair” before she realized she’d been hit.</p><p>Her eyes shot open and she jerked at the door handle, forgetting she had her seat belt on. When she lifted her foot off the brake, the car rolled forward until she jerked it into park. She turned Magda off. Her hands flailed under the deflating airbag. She was desperate to free herself.</p><p>A shadow fell across her body, giving her the strangest sense of déjà vu. Someone was outside the car, looking in.</p><p>She looked up—</p><p>“You,” she whispered involuntarily.</p><p>She had never seen the boy before. His skin was as pale as her uncasted arm, but his eyes were turquoise, like the ocean in Miami, and this made her think of Diana. She sensed sadness in their depths, like shadows in the sea. His hair was blond, not too short, a little wavy at the top. She could tell there were plenty of muscles under his white button-down. Straight nose, square jaw, full lips—the kid looked like Paul Newman from Diana’s favorite movie, Hud, except he was so pale.</p><p>“You could help me!” she heard herself shout at the stranger. He was the hottest guy she’d ever yelled at. He might have been the hottest guy she’d ever seen. Her exclamation made him jump, then reach around the open door just as her fingers finally found the seat belt. She tumbled gracelessly out of the car and landed in the middle of the dusty road on her hands and knees. She groaned. Her nose and cheeks stung from the airbag burn. Her right wrist throbbed.</p><p>The boy crouched down to help her. His eyes were startlingly blue.</p><p>“Never mind.” She stood up and dusted off her skirt. She rolled her neck, which hurt, though it was nothing compared to the shape she’d been in after the other accident. She looked at the white truck that had hit her. She looked at the boy.</p><p>“What is wrong with you?” she shouted. “Stop sign!”</p><p>“Sorry.” His voice was soft and mellow. She wasn’t sure he sounded sorry.</p><p>“Did you even try to stop?”</p><p>“I didn’t see—”</p><p>“Didn’t see the large red car directly in front of you?” She spun around to examine Magda. When she saw the damage, she cursed so the whole parish could hear.</p><p>The rear end looked like a zydeco accordion, caved in up to the backseat, where her license plate was now wedged. The back window was shattered; shards hung from its perimeter like ugly icicles. The back tires were twisted sideways. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She took a breath, remembering that the car was Rhoda’s status symbol anyway, not something she’d loved. Magda was screwed, no question about it. But what did Eureka do now?</p><p>Thirty minutes until the meet. Still ten miles from school. If she didn’t show up, Coach would think Eureka was blowing her off.</p><p>“I need your insurance information,” she called, finally remembering the line Dad had drilled into her months before she got her license.</p><p>“Insurance?” The boy shook his head and shrugged.</p> <p>She kicked a tire on his truck. It was old, probably from the early eighties, and she might have thought it was cool if it hadn’t just crushed her car. Its hood had sprung open, but the truck wasn’t even scratched.</p><p>“Unbelievable.” She glared at the guy. “Your car’s not wrecked at all.”</p><p>“Whaddya expect? It’s a Chevy,” the boy said in an affected bayou accent, quoting a truly annoying commercial for the truck that had aired throughout Eureka’s childhood. It was another thing people said that meant nothing.</p><p>He forced a laugh, studied her face. Eureka knew she turned red when she was angry. Brooks called it the Bayou Blaze.</p><p>“What do I expect?” She approached the boy. “I expect to be able to get in a car without having my life threatened. I expect the people on the road around me to have some rudimentary sense of traffic laws. I expect the dude who rear-ends me not to act so smug.”</p> <p>She had brought the storm too close, she realized. By now their bodies were inches apart and she had to tilt her neck back, which hurt, to look him in those blue eyes. He was a half a foot taller than Eureka, and she was a tall five eight.</p><p>“But I guess I expected too much. Your dumb ass doesn’t even have insurance.”</p><p>They were still standing really close for no reason other than Eureka had thought the boy would retreat. He didn’t. His breath tickled her forehead. He tilted his head to the side, watching her closely, studying her harder than she studied for tests. He blinked a few times, and then, very slowly, he smiled.</p><p>As the smile deepened across his face, something fluttered inside Eureka. Against her will, she yearned to smile back. It made no sense. He was smiling at her like they were old friends, the way she and Brooks might snicker if one of them hit the other’s car. But Eureka and this kid were total strangers. And yet, by the time his broad smile slid into a soft, intimate chuckle, the edges of Eureka’s lips had twitched upward, too.</p><p>“What are you smiling at?” She meant to scold him, but it came out like a laugh, which astonished her, then made her mad. She turned away. “Forget it. Don’t talk. My stepmonster is going to kill me.”</p><p>“It wasn’t your fault.” The boy beamed like he’d just won the Nobel Prize for Rednecks. “You didn’t ask for this.”</p> <p>“Nobody does,” she muttered.</p><p>“You were stopped at a stop sign. I hit you. Your monster will understand.”</p><p>“You’ve obviously never had the pleasure of Rhoda.”</p><p>“Tell her I’ll take care of your car.”</p><p>She ignored him, walking back to the Jeep to grab her backpack and pry her phone out of its holster on the dashboard. She’d call Dad first. She pressed speed dial number two. Speed dial one still called Diana’s cell. Eureka couldn’t bear to change it.</p><p>No surprise, Dad’s phone rang and rang. After his long lunch shift was over, but before he got to leave the restaurant, he had to prep about three million pounds of boiled seafood, so his hands were probably coated with shrimp antennae.</p><p>“I promise you,” the boy was saying in the background, “it’s going to be okay. I’ll make it up to you. Look, my name is—”</p><p>“Shhh.” She held up a hand, spinning away from him to stand at the edge of the sugarcane field. “You lost me at ‘It’s a Chevy.’ ”</p> <p>“I’m sorry.” He followed her, his shoes crunching on the thick stalks of cane near the road. “Let me explain—”</p><p>Eureka scrolled through her contacts to pull up Rhoda’s number. She rarely called Dad’s wife, but now she didn’t have a choice. The phone rang six times before it went to Rhoda’s endless voice mail greeting. “The one time I actually want her to pick up!”</p><p>She dialed Dad again, and again. She tried Rhoda twice more before stuffing her phone in her pocket. She watched the sun sinking into the treetops. Her teammates would be dressed out for the race by now. Coach would be eyeing the parking lot for Eureka’s car. Her right wrist still throbbed. She clenched her eyes in pain as she clutched it to her chest. She was stranded. She began to shake.</p><p>Find your way out of a foxhole, girl.</p><p>Diana’s voice sounded so close it made Eureka lightheaded. Goose bumps rose on her arms and something burned at the back of her throat. When she opened her eyes, the boy was standing right in front of her. He gazed at her with guileless concern, the way she watched the twins when one of them was really sick.</p><p>“Don’t,” the boy said.</p><p>“Don’t what?” Her voice quavered just as unannounced tears gathered in the corners of her eyes. They were so foreign, clouding her perfect vision.</p><p>The sky rumbled, reverberating inside Eureka the way the biggest thunderstorms did. Dark clouds rolled across the trees, sealing the sky with a green-gray storm. Eureka braced for a downpour.</p><p>A single tear spilled from the corner of her left eye and was about to trickle down her cheek. But before it did—</p><p>The boy raised his index finger, reached toward her, and caught the tear on his fingertip. Very slowly, as if he held something precious, he carried the salty drop away from her, toward his own face. He pressed it into the corner of his right eye. Then he blinked and it was gone.</p><p>“There, now,” he whispered. “No more tears.” </p> </body></html>"]