["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>HE old-fashioned bell jingled over the doorway, and a gust of Tchill wind swept through Lawson’s Bookshoppe. It was July.</p><p>Greta shivered, knowing who it was even as her eyes remained focused on the counter she was cleaning. She took a deep breath and let it out slowly.</p><p>“Anthony. We’re closing up early.”</p> <p>“We? You look quite alone. Where’s your little redheaded friend? What’s her name? Charlotte?” The vampire licked his lips.</p><p>“You know very well what her name is.”</p><p>She was beginning to regret sending Charlee home early. The other clerk may have been only human, but Anthony Burgess often struck when people were alone and vulnerable. He’d always seemed amused when Charlee stood up to him, not knowing he could relieve her of her blood in seconds.</p><p>Greta focused on the counter as the Formica gave under the pressure of her hand. She met his eyes and tucked a strand of short dark hair behind her ear, grateful her kind couldn’t be enthralled.</p><p>He wore the standard vampire uniform of basic black, his blond hair pulled back in a low ponytail. A long leather coat flowed out behind him as he strode toward her. All he needed now was menacing background music. Something dark and brooding.</p> <p>Anthony removed a soft-covered book from the rack beside the checkout without looking at the title and placed it on the counter.</p><p>His crystal blue eyes glowed and locked with Greta’s dark brown.</p><p>He inhaled deeply, not bothering to mask his enjoyment of her scent.</p><p>“When are you going to stop teasing me and let me have a taste?” He stared pointedly at her neck. “Coming up on twenty-eight aren’t you? Special year. Moon’s nearly full.” Greta’s hand shook as she passed the scanner over the book’s bar code. Therians, known to the mortals as Weres, celebrated their birthday not on the anniversary of their birth, but on the full moon closest to it. Twenty-eight wasn’t a number to inspire ooohs and aaahs among the human set, but for a shapeshifter, the twenty-eighth birthday was bigger than the human twenty-one. It was a good drinking age for vamps anyway.</p><p>She took his money, made the change, and slipped the book into the opaque green shopping bag. Her eyes widened when she glimpsed the title. “You just bought a book on menstruation, Anthony. Were you aware?”</p><p>He shrugged and smiled, revealing the barest hint of fang. “I like blood.” He scooped the bag up, gave her one last meaningful look, then drifted out of the store.</p> <p>Greta locked the door behind him and pressed her forehead against the cool wood. She could do with fewer bloodsucking patrons; they’d increased in number since the last full moon. With her birth moon coming up, she might as well have a neon all you can eat sign posted in the window.</p><p>It was thirty minutes before she gathered the nerve to venture into the parking lot.</p><p>Most of the lights in the lot had burned out, and no one had bothered replacing them. With only one human employee and few after dark human patrons, it was deemed an unnecessary expense.</p><p>The residents of Cary Town might not realize what was out there, but they were shy of the dark all the same.</p><p>Greta’s boots clicked loudly on the asphalt, making stealth a physical impossibility. She might as well shout to the vamps from a megaphone. Fresh meat, right here. Come and get it boys.</p><p>If Anthony or any of his ilk were lurking, they didn’t take the bait. Nothing black-clad or fanged emerged from the shadows.</p><p>Anthony had gone home, or hunting, or whatever it was he did at night. For all she knew, he hung out at the all night grocery store scaring stock boys.</p><p>When she got home, her orange tabby was perched on the stoop, waiting to be let in.</p> <p>“Hello, Mink.” She bent to scratch the kitty behind her ears and went inside, stopping in the hallway where the answering machine light blinked.</p><p>“This is your mother. I need to see you. Be discreet.” Click.</p><p>Jaden was more abrupt than usual. Be discreet. Translation: be in fur.</p><p>Something was going down at the Lawson estate. She glanced at the hall clock, 9:45, plenty of time for a shower.</p><p>It wasn’t until Greta shut off the water that she remembered she hadn’t done laundry. Shit. No towels. She closed her eyes and focused as images flowed over her mind. Milk, mice, open fields, birds, blades of grass, hunting, moon. Her senses heightened as she allowed the memories to bring forth the change. The room shrank and swirled around her. Her spirit jolted from her body, hovered for a moment, then was pulled back into her new compact form.</p><p>She stretched all the way down to the pads of her paws, then shook herself and licked her black fur down flat. There was going to be a hairball situation if she didn’t do laundry soon. She hopped onto the pedestal sink, admiring herself in the mirror. She loved fur. It was so slimming.</p><p>While Greta preened, Mink sauntered into the room and hissed.</p><p>Greta hissed back. The house cat liked the therian fine in her human form but became agitated whenever she shifted. Tough. It was Greta’s apartment. When Mink could turn into a human and get a job, then she’d have a vote. Greta’s poufy black tail curled under Mink’s chin as she drifted past the tabby.</p><p>Simon’s silver Lexus stood parked like a sentinel in her mother’s driveway. It wasn’t unusual for the tribe leader to be at the Lawson home, but seeing the car after the odd phone message made the hairs on the back of Greta’s neck stand up.</p><p>She slipped through the plastic flap in the kitchen door and kept to the corners, slinking under the dilapidated furniture. Her nose twitched and she began to salivate as she caught the scent of a mouse. She forced herself to ignore it and edged closer to the family room where Simon and her mother spoke in the hushed tones usually reserved for church and funerals.</p><p>“We don’t have to do this. Those are the old ways; surely we’re beyond that now.”</p><p>Simon allowed his hand to trail over Jaden’s ass. “You knew this was coming. Greta was marked for sacrifice the moment she came into the world in her fur. I told you not to get attached.” On hearing her name, Greta scooted further under the chair.</p><p>Therians were born in human form and died in their fur, not the other way around. Everybody knew that.</p><p>She’d read legends about therians born in their fur and having extra powers, but she’d always thought they were just stories.</p><p>Surely she would have noticed if she’d developed more power suddenly.</p><p>Her mother’s voice rose, taking on a more desperate tone. “I thought you’d change your mind. I thought if you loved me, you wouldn’t take her. I should have followed my instincts and sent her far from here when she was still a baby.” Simon laughed. “The border patrol would never have let you cross. They’re loyal to me. We have one shot and I won’t have you ruining it for the tribe, not like her mother tried to.” Greta didn’t have time to process the revelation that her mother wasn’t her mother because Simon’s cell phone started pounding out a sappy eighties ballad. How he listened to that shit and maintained an interest in the opposite sex remained one of the tribe’s greatest mysteries.</p><p>“I have to take this,” Simon said, retreating to the far end of the room.</p><p>Greta followed Jaden to the kitchen and waited while the older woman scribbled something on a slip of paper, rolled it up, and stuck it in Greta’s mouth.</p><p>“Did you get all that?”</p><p>“Mrraar,” she said around the paper.</p><p>“Go to this place. It’s the only person in the city who can keep you safe.”</p><p>Simon’s voice grew louder as he approached the kitchen. Before he could see her, Greta leaped off the table and scurried out the cat door.</p><p>Humans had been busy the past several decades tearing down walls that trapped people in their homelands. The preternaturals, meanwhile, had been engaged in building them up. Normally it didn’t bother her so much; but now she could palpably feel the invisible cage that kept her locked inside the walls of the city, making her world feel claustrophobic, where before it had been a cocoon of perceived safety.</p><p>There was one person she was close to who wasn’t a member of the tribe. She ran three blocks, scratched on Charlee’s door, and nearly jumped out of her fur when the dog barked. A tiny redheaded woman mumbled a few warnings to the dog and flipped on the porch light.</p><p>Greta tried to look unassuming and adorable. “Mrarrr.”</p><p>“Awwww, aren’t you the cutest!”</p><p>Score.</p><p>Charlee bent to scoop Greta up and shooed the dog out of the house. “Go play, Sammy.”</p><p>The Irish setter ignored her, choosing instead to lick Greta as he normally did, not noticing she was a cat now. Charlee’s brows drew up in confusion. She swatted him on his haunches until he ran off down the dirt road, tail wagging.</p><p>“Stupid dog. Doesn’t know he’s supposed to hate cats. That could be good news for you, sugar plum.” Once inside, Greta sprang from Charlee’s arms and bolted for the bathroom. She was thankful for the flimsy door as she slammed it shut with the full weight of her feline body. She hopped up on the counter and pressed the push button lock with her paw, then dropped gracefully to the floor.</p><p>Charlee jiggled the knob on the other side. “Well, I’ll be damned. Honey, how’d you lock yourself in?” In. Out. In. Out. Think of something calming. Waves lapping the shore, rolling green meadows. Moments later Greta was curled naked on the floor. She spit the roll of paper out of her mouth. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Printed in Jaden’s cramped script, was an address in the city.</p><p>And a name. Dayne Wickham.</p><p>For a second, Greta couldn’t breathe and thought she might shift back. It had to be a mistake. Jaden couldn’t mean for her to go to him. Dayne Wickham was notorious. He wasn’t just a magic user. He was a sorcerer. People still talked about the night he’d massacred more than half the tribe.</p><p>There was a soft knock on the door. “I don’t know how you managed to lock yourself in there kitty, but I’ve got tools and I’m going to get you out. Okay?”</p> <p>Greta wrapped a bathrobe around herself and opened the door.</p><p>Charlee fell back, her eyes wide, tools spread around her in a fan.</p><p>She must have found a sale. Or else she was dating a contractor.</p><p>“So, yeah, I’m a cat and I need to borrow some clothes.” She hoped she wouldn’t have to do the whole transformation all over just to prove it. Surely, cat goes in, human comes out was enough evidence. Especially with no windows or other exits in the bathroom.</p><p>Charlee gawked up at her. “What are you?”</p> <p>“A therian.”</p><p>“A whatian?”</p><p>Greta sighed and used the term she hated. “Werecat.”</p><p>“You can turn into a cat? Seriously? How? When? Have you always done it? Did you get bitten by another werecat? What else is real? Can you turn back into a cat now? Do you have other superpowers?”</p><p>“Charlee . . . ” she said with as much patience as she could muster.</p><p>By this time Charlee had managed to stand and was prowling around her, looking as if there might be an instruction manual printed somewhere on Greta’s body.</p> <p>“Clothes,” Greta said, trying to bring her friend back to the issue at hand.</p><p>“Sure. Clothes. No problem, but show me the werecat thing.” Charlee moved to the bedroom, Greta trailing behind her.</p><p>“Listen, I can’t imagine how I would feel if the tables were turned, but I don’t have time for show-and-tell right now. You’ll be safer the less you know. They’ll use a spell to track me, so I need to be somewhere with strong wards. I just need some clothes to last me a few days.”</p><p>“Spells are real too? So then . . . witches . . . and . . . ”</p><p>“Charlee!”</p><p>“Oh, right. Sure. Borrow whatever you want; I’ll pack you a bag.”</p><p>Greta pulled on a pair of jeans and T-shirt from the floor. Her face scrunched up in distaste at the outfits her friend was throwing into the bag. Charlee believed in dressing sexy like it was a religion.</p><p>It was a little more than Greta personally wanted to show off, but it was better than nudity.</p> <p>“Are you sure this is all I can do to help? I could go on the lam with you.”</p><p>Greta hid a smile. She wished she could take her up on her offer, and for a moment a fantasy of Thelma and Louise-ing it through Cary Town caught her imagination. But Charlee wasn’t prepared to deal with what was out there, and Greta couldn’t protect her.</p><p>She watched as her friend tossed some makeup and a couple of trashy romance novels into the bag. Only Charlee would think running for your life was the time to read romance and wear lipstick. Greta decided she should have told her friend about her double life long ago. If not for the ridiculous loyalty she’d felt for the tribe that now intended to strap her down to a stone altar, she probably would have.</p><p>Chapter Two</p><p>AYNE Wickham sat hunched over his computer. His pos-Dture showed his age even as his face and physique refused to. He brushed a clump of dark hair out of his eyes and stared at the twitchy screen in front of him. Technology was a beautiful thing. He’d found a most reliable supplier of were-blood on the Internet.</p><p>Theriantype.com had a cross-referencing index matching the correct were-blood type to specific rituals. It was almost enough to make a sorcerer pack all his musty old books into storage and move everything to the computer. Almost.</p><p>He’d met Alistair Cranze on a magic user’s message board. The wizard had recommended the site, and for the past year Dayne hadn’t had any trouble. He couldn’t remember how he’d managed to get by before. Werecat was considered the most magical of all were-blood types. And for this working, even more so.</p><p>The mythology claiming a witch’s familiar to be a cat was rooted somewhat in fact. Werecats without a tribe had sought witches, wizards, and occasionally a sorcerer or two. They’d traded blood for shelter for centuries.</p><p>Things were different now. These days, Weres in need of cash donated anonymously to one of the blood banks, and various magic users just ordered what they needed from occult shopkeepers or online. It was much cleaner this way.</p><p>Weres could be more trouble than they were worth. Most magic users had learned that the hard way, as there seemed to be a certain level of idiotic stubbornness that came with the territory of wielding magic.</p><p>Dayne rolled his mouse over the send button and clicked, then leaned back in his chair, interlacing his fingers behind his head. He smiled as the animated GIF wand waved, and purple digital glitter sprinkled over his computer desktop, indicating his order was being processed. The site was on the cheesy side, but a reliable company was a reliable company, cutesy bells and whistles notwithstanding.</p><p>There was one thing about the white lighters. You could trust them. They lived their entire lives according to a mission of goodness and honesty. It made Dayne want to hurl, but with few exceptions, they wouldn’t betray you.</p><p>He’d just shut down the computer when a rap sounded on the front door. No one knocked on his door anymore. Primarily because he was known as the city’s darkest evil and everyone was too scared to try to overthrow him. The postman had long ago learned the wisdom of quietly leaving packages by the door. Dayne didn’t know what the fuss had been about. The man’s hair had regrown in a mere matter of months.</p><p>“Just a moment, please.”</p><p>Whoever was calling after midnight could only be bringing trouble with them. For a while, after what was later called: the tribal massacre, the lone hero had darkened his door, convinced Dayne was up to something nefarious and had to be taken down. Or another Cary Town villain decided to rise to infamy and needed Dayne out of the way to do it.</p><p>He’d eventually managed the right formula on the wards, and most steered clear, deciding it wasn’t worth it. It had been quiet for the past decade. Either the wards were working or he’d been deemed irrelevant. Either way was fine by him.</p><p>The wards dropped as Dayne opened the door to reveal a diminutive black cat with bright golden eyes sitting primly on the middle of his front stoop. She blinked up at him full of rehearsed pet store innocence, her tail wrapped around her tiny paws.</p><p>“Mrarrr.”</p><p>“You must be kidding me. I don’t take in strays.” Dayne slammed the door. Did the werecat think he couldn’t sense the magic crackling around her? Was she that naive? Perhaps a junior wizard still under apprenticeship would have been fooled, but not someone with his level of experience.</p><p>He drained the last dregs of coffee from the mug in the microwave. There was a second knock.</p><p>“Oh, for God’s sake.” He was going to zap the little miscreant halfway across town and let the preternatural border patrol sort out the pieces.</p><p>Dayne opened the door this time with a spell ready on his lips, but stopped short. She was breathtaking, not that this was uncommon in a Were. They tended to have a certain magnetism.</p><p>She had short dark hair, and she was leggy . . . a personal weakness of his.</p><p>Black leather pants encased her legs as if they’d been stitched onto her. It seemed only magic could have gotten those pants on and would be required to get them off again. A red silky top plunged to reveal ample but not overpowering cleavage. The werecat had a large duffel bag slung over one shoulder and balanced against her hip as if she’d planned to move in.</p><p>He held up a hand before little Dayne could cause him to do something colossally stupid. “The wardrobe change doesn’t alter my position, princess.”</p><p>“I thought you’d be old,” she said, wrinkling her nose.</p><p>He gave her points for not stammering that opening line. “What leads you to believe I’m not?”</p><p>“I need help.”</p><p>Well, she got right down to it, didn’t she? Such a Red Riding Hood. It was intoxicating. In a different mood, with a different species, he might have let her into his lair.</p><p>“Not interested. Try the Salvation Army.” The brunette wedged one high-heeled boot inside the door.</p><p>“Please. I’ll be killed. The tribe plans to sacrifice me.” Desperate, frightened eyes.</p><p>“And somehow I can’t work up any feeling on that topic. Good-bye now.”</p><p>“Wait! You can use my blood.”</p><p>Dayne arched a brow. Not quite as naive as she appeared.</p><p>“I get my were-blood online. I have no use for you.” In truth, he could think of many uses for her, none of which required the promise of her potent magical blood.</p><p>The phone rang, preventing little Dayne from taking over. “If you’ll excuse me.”</p><p>Appearance-wise Dayne had been nothing like she’d expected.</p><p>She’d expected an old man with long robes and a beard, dark beady eyes, and a sinister thin mouth. A beak-like nose and long age-gnarled fingers would finish the look. Dayne was none of these things. For one thing, he’d been wearing blue jeans and a T-shirt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>For another, he’d been hot, debonair even. Except for the evil.</p><p>Despite the danger he exuded, Greta turned the doorknob and slipped into the cottage.</p><p>“Don’t do this to me, Mick. You know I need this blood.” Dayne stood at the other end of the room making a pot of coffee, his back to her. A cordless phone was pressed between his ear and shoulder.</p><p>Greta dropped the duffel bag on the floor without a sound and tuned her amplified hearing in to listen to his phone call. The other man’s voice trembled over the phone.</p> <p>“I . . . I . . . understand that sir, but we have a f . . . firm policy of only delivering to those who follow our code of ethics and it’s been b . . . brought to my attention that you . . . don’t.”</p><p>“I’m very unhappy about this. It was Alistair wasn’t it? That little shit was my bestest best friend until he found out I wasn’t out saving the world every night.”</p><p>“Please, Sir, I’m just doing what my boss told me. He said to tell you it’s a conflict of interests to continue delivering your ship-ments.”</p><p>“I see. Well, don’t think I won’t be reporting you to the Board of Magical Merchants for discrimination. There are laws against this sort of thing.”</p><p>Greta heard Mick’s sigh of relief over the phone. Someone like Dayne Wickham reporting him to a board of magical anything was minor, the equivalent of an angry shopper threatening never to return.</p> <p>Dayne stabbed his finger against the button to end the call, then flung the phone across the room. Greta froze. His back was still to her when he spoke.</p><p>“I thought I told you to leave. Or was my dismissal not clear enough? Perhaps it would help if I spelled it out with catnip.” He turned to face her. “Or I could carve the message.” His glance shifted to a gleaming silver ritual knife balanced precariously on the edge of the desk. Silver wouldn’t kill her necessarily, but it burned like hell and was much harder to heal.</p><p>Dayne blazed across the floor and grabbed Greta by the wrist, hauling her back to the entryway. “Have you any idea the danger you put yourself in when you trespass on a sorcerer’s property?</p><p>Shall I enlighten you?”</p><p>Greta wrenched herself free of his grip. “You don’t have a supplier now. I’ll give you the blood you need if you’ll let me stay until after the full moon. I won’t cause any trouble.” She wasn’t sure why she was still asking to stay. He’d just made a not so subtle hint about using her skin as a carving block. Hiding in a hollowed-out tree for the next several nights was sounding like a more sane option than remaining with the unhinged sorcerer.</p><p>Dayne had crossed his arms over his chest, his stance wide, and to the human eye, relaxed. But Greta could smell the tendrils of controlled anger coming off him. She’d always been able to smell emotion, but the scent seemed sharper now.</p> <p>“They send one of you, all pretty and in distress, and I’m supposed to fall all over myself trying to protect you? Let’s get one thing clear. I’m the bad guy. I don’t rescue fair maidens.” Greta flushed at the pretty part, glossing right over the bad guy part.</p><p>He muttered something in Latin with his arm outstretched, and for a moment Greta thought she was about to die. Instead, the cordless phone floated from behind him to his waiting hand. His eyes remained trained on her as he punched the numbers into the phone.</p><p>“Clarissa, I’m sorry to wake you love, but I was wondering if you might be persuaded to set aside a pint of werecat blood for me.</p><p>I need it by the full moon.”</p><p>“Mr. Wickham, um hi,” a sleepy voice on the other end answered. “No, it’s okay. You’re our best customer. We actually don’t have any therian cat blood in stock. We can get some, but it’ll take six weeks; our supplier’s backed up. You could try a local therian.”</p><p>“Meow,” Greta said, still in human form.</p><p>“I see. Well, thank you anyway.” Dayne clicked off the phone and glared at Greta, as if she’d somehow personally gummed up the works.</p><p>“So, then I can stay?”</p> <p>“I’ll have to erect stronger wards. Please keep in mind, you are here for my convenience due to inventory troubles. I’m not your knight in shining armor. I don’t care about your personal problems.</p><p>And if you wander from the protection of this house, I will not be lured into the trap to save you. I don’t get involved with Weres.”</p><p>“Therians,” Greta said, returning his glare.</p><p>“If I were you, I would remember that although I would like to do this ritual this full moon, there are infinite full moons available to me. You might not be so lucky. I’ll be in my study gathering supplies for the wards.”</p><p>His footsteps receded down the hallway, and Greta made a face.</p><p>Finally alone, she took in her surroundings.</p><p>She’d expected a medieval-looking castle equipped with a full dungeon, or some austere mansion. His home was neither. It was . . . cozy, though larger than the average cottage. The fireplace crackled with dying embers that had recently warmed something in a small iron cauldron.</p><p>The main room was lined with dark oak bookshelves and rows upon rows of books. The walls were stone but emitted a sense of warmth, the direct opposite of Dayne.</p><p>Maybe it was a timeshare.</p><p>Greta suppressed a giggle as she tried to imagine Dayne Wickham, the hapless victim of a timeshare scheme. It would explain his sour demeanor.</p><p>Two windows on either side of the fireplace were open with long lightweight crimson drapes hanging in front of them. A storm was brewing. As the wind howled outside, the curtains were sucked into the screen, then puffed back out as if the wall itself were breathing. Greta was still staring at the windows, mesmerized by the sensation of the house breathing, when Dayne returned.</p><p>“Come with me. I’ll need some of your blood, since you seem to be in a donating mood.”</p><p>Her eyes drifted back to the knife on the table.</p><p>“If I were going to harm you, I would have already done so. I grow very quickly bored with the practice of building trust in others only to crush it at the last possible moment. Unlike some species.”</p><p>Greta flinched at the look he gave her. But when he turned, she followed. The dwelling went deeper than it appeared from the outside, and it occurred to her that the floor was sloping downward as they worked their way to an underground part of the house.</p><p>The hairs on the back of her arm stood at attention as the passageway narrowed until it was only big enough for two people.</p><p>Then it began to spiral more steeply down, and the smooth slope became stairs. It was such a gradual transition, she wasn’t sure if it was the architecture itself, or magic.</p><p>At the bottom of the stairs was a large stone room with shelves of books lining the walls, as well as potions, pots, wands, and grisly items in cloudy jars. Cobwebs had grown over much of the area.</p><p>There were a couple of unlit torches on the wall, though the room’s illumination came from a dome light in the ceiling. A steel cage stood in the back, its purpose most likely not on the up-and-up.</p><p>Greta shivered. So much for Dayne not having a dungeon.</p><p>Chapter Three</p><p>E had to admit, she was a good little actress. Almost as Hgood as Jaden had been. The werecat stood at the bottom of the stairs barely inside the cavernous room where he performed his more complicated rituals. Her arms were wrapped tightly around her, a protective barrier against him, no doubt.</p><p>He didn’t want to be paranoid, but he wondered if the tribe had been responsible for his were-blood supply being cut off. The timing was too coincidental for his liking. There had been rumblings that the tribe leader was getting more powerful these days. Could Simon know Dayne planned to act against him on the next full moon?</p><p>It had been thirty years since Dayne’s last encounter with Cary Town’s werecat tribe. He’d nearly died thinking he was saving Jaden’s life, only to be led into a trap. If he hadn’t fortified himself with so much magic, he would’ve been killed.</p><p>He’d gotten lucky. Shapeshifters, though made of magic, didn’t know how to wield it. He’d taken out most of the tribe and managed to escape, sustaining several injuries, including a few to his pride.</p><p>Now they were sending this little number to lure him away.</p><p>Didn’t they have any new material? Dayne’s eyes drifted to the cage in the back corner. One never knew when one might need such a contraption. He ran his hand idly over the bit of stubble growing on his chin as he contemplated the cage. He should lock her up until the ritual, use her blood, then throw her out.</p><p>If anything, such an act would send a message to the tribe that Dayne Wickham was not to be fucked with. He was suddenly glad he was acting against Simon now, rather than later. He’d put it off far too long. For whatever inane reason, Jaden loved Simon. It had taken years for Dayne’s love for her to diminish to the point that he could dispatch her lover without guilt.</p><p>He considered taking the Were’s blood now and getting rid of her. Except, even he wouldn’t stoop to that level of dishonor. It had nothing to do with anything the tribe may plan to do to the girl.</p><p>“Are you cold?” he asked. Dammit.</p><p>She shook her head.</p><p>Eventually, a pouty-lipped woman, like this one, was going to get him killed. Prudence would dictate he wait for another full moon, but the effects of the spell wouldn’t be nearly so strong at any other time. Simon was ready to end this now, and Dayne might not get another chance. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Sit.” He motioned to a painted white circle in the middle of the floor.</p><p>She bit her bottom lip and slowly moved into the center of the circle.</p><p>“Are you having second thoughts about being here?” She nodded.</p><p>“Good.”</p> <p>Dayne crossed to the far wall and selected a large and well-worn book from the uppermost shelf. He took a small needle from the desk drawer nearest the bookcase and opened the book to the correct page.</p><p>He pricked her finger, ignoring her indignant cry, and squeezed several drops of blood into the center of the circle. When he released her hand to say the incantation, she sucked on her finger.</p><p>It took every ounce of willpower for his eyes not to linger on her pretty little mouth.</p><p>He focused more intently on chanting.</p><p>When he closed the book, the werecat stood and placed her hands on her hips. “I didn’t want to come to you for help. You were my only choice. You’re the strongest magic user in the city, and we dislike the same people. I don’t know what your problem is, but I don’t want to die. My moth . . . Jaden gave me your address. I was in cat form so I couldn’t exactly ask questions but . . . ” Before she could finish the sentence, she was lying on her back, Dayne’s hand wrapped around her throat. He stopped squeezing when he registered the look in her eyes. She’d clearly forgotten she was stronger than he was. Something he could use.</p> <p>“Who did you say sent you?” He poured menace into his voice, intent on keeping her on edge and pressing his advantage.</p><p>“Jaden . . . I . . . Please . . . ” Greta’s fingernails dug into his arms in panic.</p><p>He released her. “Forgive me. I have trust issues.”</p><p>“Yeah, no shit.” Greta shot back to her feet, the slight crouch of her body showed she was ready for him. She rubbed her throat.</p><p>“Did I hurt you?”</p><p>“You scared me. I almost shifted.”</p> <p>“Is that a bad thing?”</p><p>“I can’t fight worth a damn in my fur.” She crossed her arms defensively over her chest.</p><p>“I’m sorry.”</p><p>Her face flushed in anger. “Are you? Because the way it looks to me, we both have a problem and we both have a solution. You need blood; I have blood. I need protection; you have protection.</p><p>This doesn’t seem all that complicated to me. Does it seem complicated to you?”</p><p>Dayne crossed his arms over his chest. “I have ground rules, Were.”</p><p>“Fine. I have a ground rule too.”</p><p>One brow rose. “Oh? Do tell.”</p> <p>While it was indeed true that she could kick his ass without blinking if he suddenly developed laryngitis, he would wager he could chant faster than she could drop kick him. Not every spell required books and herbs, candles or circles, or any of the million and one accoutrements the magical set swore by.</p><p>“Don’t call me Were. If you’re really that old, you know that’s offensive. Whatever your therian issue is, put it aside, I’m not whoever did you wrong. I would prefer to be called by my name if that wouldn’t be too much trouble.”</p><p>He cocked his head to the side and studied her. She alternated so quickly between timid and smart-mouthed, he thought he might be dealing with a multiple personality. It wouldn’t be the first time in his long existence. Dayne’s mouth curved in a genuinely amused smile before he caught himself and returned to his former cold expression. “Very well, and your name?”</p><p>“Greta.”</p><p>“Is that your only rule, Greta?”</p><p>She nodded, the wind going out of her sails as she returned to being the frightened kitty. He wondered if she was aware of these highly irregular mood swings.</p><p>“My rules are as follows: You will not leave this house until after the full moon. If your tribe truly plans to sacrifice you, the wards will keep you safe as long as you remain inside. If you leave, you will not be allowed back in. Since I can’t keep an eye on you 24/7, when I can’t watch you you’ll be locked in the guest room.</p><p>For my own personal safety, of course.”</p><p>She stood perfectly still for a moment, the tension radiating off her body as she clenched and unclenched her hands at her sides.</p><p>“I won’t let you lock me up.” She’d said it calmly, her tone completely even, but she turned and ran up the stairs. Moments later, the front door slammed.</p><p>He shook his head and sighed. The spell hadn’t lied. He had. He hadn’t needed her blood to strengthen the wards. The wards were fine as they were, barring his bad habit of voluntarily opening the door without looking through the peephole first. He’d needed her blood for a truth spell.</p><p>The light that had glowed around her immediately after he’d finished the incantation should have left no doubt to her honest need. Though again, he wasn’t running a charity service. So why he should feel the need to help random Weres in distress like some sort of magical halfway house, he couldn’t be sure.</p><p>He’d felt the fear pouring off her and conceded no one was that good an actress. He’d watched her eyes flash between brown and yellow as she’d tried to stop from shifting. Still, he wouldn’t put it past Jaden to be using her.</p><p>Dayne shrugged. It was no longer his problem. Let someone else handle it. He wasn’t going to become a hero; they didn’t normally survive long.</p><p>He climbed the stairs and found Greta’s abandoned bag beside the front door. Rifling through it, he found makeup, clothes, and a few tacky books with shirtless men and women with heaving bosoms.</p><p>He crossed back to the computer, loaded the web browser, and typed, “Sacrifice,” “Therian” into the search box. Several sites popped up, most about werecats. This breed liked their sacrifice.</p><p>Dayne clicked the link that looked most helpful. The screen filled with morbid drawings of beautiful women, sometimes men, chained down to stone slabs, blood being drained from them into a type of moat around the altar as the others shifted into their animal form.</p><p>The images showcased a type of twisted sadism that most reserved for those not of their kind. Further down the page were photographs. One in particular caught his attention.</p><p>The woman’s hair was longer than Greta’s, but the same shiny dark brown. Otherwise, she resembled her enough that Dayne could almost see Greta on the slab instead. He scrolled the mouse over the arrow to leave the page.</p><p>A warmth prickled over his senses. The kitty was still in the house. He should have been angry, but after the photos what he felt was relief that she was still safely ensconced in his well-warded fortress. Somewhere. Cats were experts at hiding. If he’d been a human without magic running through his veins, he might never have known.</p><p>And now she was terrified of him. Had he worked the evil persona so strongly that he’d become so? He wasn’t all fluffy goodness and light, but he hadn’t thought he’d sunk to mustache-twirling levels of evil.</p><p>He focused on the bookcase, causing one of the books to fly off the shelf into his hand. He flipped to the appropriate passage and whispered the incantation necessary to lock all the doors and windows, then he allowed the book to fly back to its place.</p><p>He needed to get out and socialize more. Even ten years ago, Dayne never would have made a speech like the one he’d made in the basement about locking her up. It sounded like it had come out of Evil for Dummies. A less insane sorcerer would lock up the books he didn’t want her in, not lock her up. Or perhaps a sorcerer would lock her up.</p><p>He started down the hallway, his footfalls light and measured.</p><p>“Here, kitty kitty.”</p><p>Chapter Four</p><p>RETA huddled under Dayne’s bed, her fur pressed flat Gagainst the wall. She’d barely maintained her form in the basement. Now she was too keyed up to shift back and climb out the window. Footsteps thudded and stopped with heavy finality just outside the door.</p><p>Please don’t find me. Please don’t find me. Her heart beat erratically in her tiny chest, in tempo to her silent pleas. She wondered if a cat could hyperventilate. If it had been Simon outside the door, he would have heard her panting and it would have been all over.</p><p>She tried to stay focused on the plan. Of course, Dayne would return to his room. That was the point. He’d finally go to sleep and she could slip out and eat something, then keep out of sight until after the full moon.</p><p>After all, what kind of idiot hides in the bedroom of the bad guy? It was probably a bad question given her current circumstances, but it had seemed halfway brilliant at the time she’d thought of it.</p><p>She couldn’t be sure why she’d slammed the door earlier without first going through it, except that Dayne was her only hope.</p><p>Without magic to cloak her, she was at the mercy of the tribe.</p><p>And no one else in Cary Town was strong enough to counteract the magic of the few witches in the tribe’s employ. If Jaden thought Dayne was her only chance, then he was.</p><p>The bed dipped above her and the bedsprings creaked as Dayne laid back and sighed. “You can come out now. I’m not going to hurt you.”</p><p>Yeah right. She remained hidden, though she was sure he could use magic to bring her out. She couldn’t be that difficult to levitate at house cat weight.</p><p>“Greta . . . ”</p><p>The bed creaked again as his weight lifted, then his eyes were level with hers. He held out a hand. She hissed.</p><p>“I’m not having a conversation like this,” he said, his voice sounding so reasonable she almost trusted him. “You have to come out eventually.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She wished she could ask him to back away so she could come out on her own, but her cat-shaped mouth wouldn’t form human words, and it seemed unlikely he was fluent in the subtle nuance of the meow. When she’d finally edged out, he picked her up. She reacted.</p><p>“Ow!” Dayne howled, dropped her, and cradled his bleeding arm. “Fuck!”</p><p>Greta scrambled onto the bed and burrowed underneath the pillow, her little black face poking out at him. Her eyes widened at the long bright bloody trails she’d left. Didn’t Dayne know anything about cats? It wasn’t like she could shut that instinct off.</p><p>She inched out from under the pillow, arched her back, and hissed. She expected to see anger in his eyes, instead she saw . . . guilt? She settled on top of the feather pillow and wrapped her tail around her as Dayne disappeared into the bathroom. When he returned, his arm was bandaged. She could smell the hydrogen peroxide he’d used to disinfect the cuts as if he’d been wounded on a battlefield instead of a few cat scratches. Men could be such babies.</p> <p>“I don’t like blood,” he said.</p><p>“Mrarr?” Greta cocked her head to the side. He’d taken her blood not an hour ago. He didn’t seem to have a problem then.</p><p>“My own blood. I have no trouble with the blood of others.” Those calmly spoken words should have had her fleeing back under the bed to the safety she’d just left, but she remained frozen in place. She would have felt better if she could shift back to a form she could fight in. But she couldn’t, not with him there.</p><p>“If I sit next to you, are you going to claw me again?” She shook her head, and Dayne settled beside her.</p><p>“I apologize for my earlier behavior. I was nearly killed because of Jaden many years ago. So I have a hard time trusting Weres.</p> <p>Especially Weres from your tribe.”</p><p>Greta growled.</p><p>“Therians,” he corrected. “However, at this point I don’t believe you’re lying to me. Ordinarily I wouldn’t get involved, but you’re right. I need your blood. This is how it used to be done. None of this ordering blood off the Internet nonsense. Magic shouldn’t be so sanitary. It has no right to be.”</p><p>He’d started absently stroking Greta’s fur, a soothing rhythmic motion from the tips of her ears to the end of her tail. It was causing an inappropriate response, and before she could stop herself, she’d shifted.</p><p>Dayne turned as fur changed to soft flesh under his hand. Greta was lying on her side, her legs curled into her, trying to cover her nudity. It was a strange and oddly endearing quirk for a Were.</p><p>Usually they flaunted whatever they had to flaunt, in their skin or in their fur.</p> <p>“Could you go get me some clothes out of my bag? Please?”</p><p>“Of course.”</p><p>As he made his way down the hall, a visual came unbidden of those beautiful legs on his shoulders, and Greta moaning and writhing beneath him. He had to shake himself physically to loosen the thoughts from his mind.</p><p>If she’d been a dog, no pun intended, he might not have had such a problem. His resolve with her would be melted way before the moon reached fullness. And if history was choosing to repeat itself, by the time he needed her blood he’d contract a full-blown case of stupid. Dayne retrieved a pair of faded blue jeans and a T-shirt, which barely qualified as clothing.</p><p>He returned and tossed them to her, then looked away. He heard her catch the garments and bit the inside of his cheek as he listened to the fabric slide over her skin.</p><p>“Okay,” she said.</p><p>Dayne turned. Clothing did nothing to help the situation. The jeans hugged the curves of her hips too enticingly, and the shirt was cropped to reveal a small expanse of golden stomach. Without a bra, her nipples protruded through the thin pink material.</p><p>For a moment, neither of them spoke.</p> <p>“The gardens are warded as well,” Dayne said, looking for anything to say so he could stop looking at her nipples. His eyes darted up to catch hers as she nodded. Her cheeks were flushed. Who knew a werecat could blush? Jaden had been shameless.</p><p>“Will you be sleeping in the guest room?”</p><p>“Are you going to lock me up?” Her eyebrows rose in challenge as the pink faded from her cheeks.</p><p>“I shouldn’t have said that. I’m not used to being around people. I’m sorry.”</p><p>This was an understatement and a testament to how much the tiny creature unnerved him. Once he’d had time to think, he’d realized how extreme it was. All the dangerous books required extensive magical knowledge to decipher. It wasn’t as if she could cast a curse on him or destroy any of the wards he’d built.</p><p>“We’re going to have to try to trust each other.” He watched her lips draw into a tight line at the hypocritical comment, but she nodded again.</p><p>He wondered if she felt the room charge as he did. He wanted to shove the jeans past her hips and bend her over the bathroom counter. He wanted her in his bed.</p><p>“I’m hungry,” Greta said, interrupting his fantasy.</p><p>Dayne’s hand, of its own accord, reached out and brushed a strand of hair off her face as she passed him. She flinched.</p><p>“Sorry,” he said.</p><p>“You’ve said that a lot today.”</p><p>He didn’t know why he’d touched her. He had no right. There were no strong wizards or good witches she could go to in the city.</p><p>She must have been very desperate and afraid to come to him, and he hadn’t done anything to put that fear to rest.</p><p>He followed her down the narrow hallway. A picture on the wall of his uncle Arthur reflected oddly in the domed hallway lighting. The photograph showed Arthur with a disapproving look on his stern features. The camera had never captured him without that look, not once in his 443 years of life. Nevertheless, Dayne felt the old man stood in judgment of him now beyond the grave, how far Dayne’s humanity had slipped in recent decades.</p><p>Greta moved ahead of him with an animal grace, each step precise. It was difficult to understand how normal humans couldn’t sense what she was. Dayne could feel the magic pulsing off her, just as intoxicating as the last time he’d felt it thirty years before with Jaden.</p><p>It called to him, begged him to take a taste of that raw natural power, that elusive something trained magic users just didn’t have.</p><p>A sorcerer, witch, or wizard just knew how to manipulate the magic around them; shapeshifters were made of magic.</p><p>He kept to the corners of the room, doing an old trick he’d learned in his apprenticeship days to make himself fade into the background. It wasn’t full invisibility, more like unobtrusiveness.</p><p>He wasn’t sure of its effectiveness on a shapeshifter, but at least it would keep his presence from spooking her further.</p><p>He had to restrain himself as Greta took the milk from the fridge and drank it straight from the carton. At first, the restraint was because she was no doubt spreading germs all over the container.</p><p>Then it became about something else as he felt himself grow hard.</p><p>A few drops of the creamy white liquid dribbled around the sides of the carton and down her chin and long neck. She arched back, and some of the liquid dripped down to dampen her shirt.</p><p>She moved on to a steak Dayne had planned to grill for dinner the next day. He couldn’t bring himself to protest as he watched her carefully unwrap the meat and make a show of eating it. A woman eating raw meat wasn’t generally a turn-on. It was the kind of thing seen in a traveling freak show, but somehow the werecat managed to make an act that emphasized bloody death into the most erotic teasing.</p><p>When she’d finished, she dumped the empty meat tray in the garbage and stretched her arms languidly over her head. She paused by the door on her way out of the kitchen. “Goodnight, Dayne,” she practically purred.</p><p>He shed the useless glamour. “Nice kitties don’t tease.”</p><p>“I never said I was a nice kitty. Nice sorcerers don’t stalk.”</p><p>“There are no nice sorcerers.”</p><p>He frowned as the confidence slipped off her face like a mask.</p><p>She turned and scurried off to the guest room without a backward glance, the spell she’d woven broken.</p><p>He didn’t know what kind of game she was playing, but he was disappointed to be the winner.</p><p>Chapter Five</p><p>VER the days that followed, a routine and tentative truce Oformed. Dayne stopped threatening Greta and tried to stop suspecting her of trying to destroy him. Mostly he suspected Jaden. He’d once allowed Jaden’s musical laughter and shapely ass to cause him to lose sight of everything he’d learned as a sorcerer, something he was in danger of doing again now with Greta.</p><p>Jaden had been beneficial in her way. The slaughter in the tribe’s sacred space had ensured the reputation he now enjoyed. It was a reputation he’d cultivated and cared for like a garden full of delicate seedlings. The consolation prize for losing the girl.</p><p>Overall, it had significantly reduced the hassle in his life. Now everything was “Yes, Mr. Wickham,” “No, Mr. Wickham,” “Please don’t kill me, Mr. Wickham.” That suited him fine.</p><p>Whatever Jaden’s plan now, Greta at least believed she needed to be saved. And he needed blood. What was it they said about a gift horse?</p><p>He’d made a trip to the grocery store, stocking enough to feed an army. Weres had quite the metabolism. She could pack it away, but where she put it all, he had no idea. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>It wasn’t just raw meat and milk she liked. She ate cooked meat and vegetables, if baked potatoes counted as a vegetable. He was certain the nutritional value of the average baked potato was so low they should have their own food group called “nutritionally deficient starches.”</p><p>Dayne could watch her eat raw meat with no trouble, but when she dug into a baked potato loaded with butter and sour cream, he got squeamish. She’d requested an unnatural amount of chocolate, popcorn, and ice cream, along with every werewolf film ever made.</p><p>She’d insisted that if she was going to be stuck in the house, she needed entertainment.</p><p>When Dayne questioned her, she’d said, “Hey, I don’t blame them for portraying the wolves that way. All the bad press is their fault.” Then she’d started on another tub of popcorn.</p> <p>The next day he’d caught her in the basement rolling some of his herbs in rolling paper and smoking them. Then he realized it was catnip.</p><p>He’d wanted to be angry. He had a few spells he needed that for and the good stuff was expensive, but she’d rolled around on the stone floor giggling like a maniac. They’d had the briefest of moments when he was sure he could have gotten her into bed with no trouble, but he’d let the moment pass.</p><p>Dayne lounged in a wingback chair in the den. He did most of his guilty pleasure reading here, though there were books all over the house crammed onto every bookcase and stacked on most available surfaces.</p><p>There were spell books, of course, but also books on science and history, as well as several books on gardening. He had an impressive garden encased in a stone wall. Climbing vines and roses created a magical effect over trellises, gates, and the garden wall itself. Dayne had spent many hours the past few days watching Greta in her cat form running around the garden chasing things.</p><p>Then he’d grown hard as he’d watched her shift and sunbathe nude, still cursing the missed catnip opportunity. She must not have realized he had a window with a view. It was easy to lose track of the possible peepholes when the garden felt so remote from everything else. It had been designed that way, though he couldn’t have foretold the current benefit he was getting from it.</p> <p>The first time she'd sunbathed nude, he'd thought she was teasing him as she had with the milk and meat, but her manner was different. Unaffected. She was graceful and sultry as before, but there was an innocence that had been missing from her earlier purposeful seduction, and one he had a hard time admitting turned him on even more than the show she’d put on to entice him. He still hadn’t managed to determine what that had been about. Greta wasn’t a seductress; it wasn’t her style.</p><p>Something was off, he just couldn’t figure out what.</p><p>He got up to check the window again. He was a dirty old man for peeping at her, though he couldn’t very well warn Greta of the window now. It would only embarrass her and create an uneasiness he didn’t want to see in her again.</p><p>Satisfied with the rationalization and disappointed to find no naked Greta outside, he went back to his chair and horror novel.</p><p>Three pages into chapter thirteen, he looked up startled to see Greta standing in the doorway with an odd glint in her eyes.</p><p>He could hear her purring from his chair. She leaned with one arm over her head to support herself, her body so relaxed and loose it looked like liquid in suspended animation. Her eyes were dilated, her lips parted.</p> <p>Damn. Dayne knew this. Her lips were parted so she could breathe in the pheromones on the air around her. She was in heat.</p><p>She’d found him by scent and she wasn’t going to be refused.</p><p>She slunk into the room, and it was then he noticed she was wearing one of his T-shirts and nothing else. The shirt grazed the tops of her thighs. Her nipples formed points in the fabric, making her arousal evident, in the event he’d missed it before.</p><p>She’d only come with a few outfits in the small duffel bag, all of them in the laundry at the moment. She stalked him, and he couldn’t move. For the first time since they’d met, he was her prey.</p><p>Dayne had been insane if he’d thought she was dangerous to him before, back when danger was a cute theory. She let out a soft breathy sigh, and the book slipped from his hands to the floor. She bent beside the chair to pick it up, her ass raised delectably in the air. Sweet mother of God, she wasn’t wearing panties.</p><p>Dayne ran a hand over her bare ass. Greta shivered and turned toward him, straightening with the grace of a preternatural dancer.</p><p>He felt pinned to the chair by a force stronger than those he usually wielded, as she arched back and peeled the shirt from her body, tossing it to the floor.</p><p>“Touch me.” Her voice was throaty. Whoever or whatever this was, it wasn’t her.</p> <p>“I think it’s a bad idea.” Why the hell was he growing a conscience now?</p><p>“I have to sleep with someone now,” Greta said. “If you don't do it, I’ll have to find someone who will.” She made her way back toward the door, her exit as much a seduction as her entrance.</p><p>Like hell, she was. “You aren’t going anywhere. You promised your blood to me, and I will collect.”</p><p>She didn’t seem bothered that he’d reduced her to nothing more than a magical blood donor. She stood in front of him, gloriously naked and pulsing with desire, her body vibrating with the purrs he knew were more from painful need than contentedness.</p><p>“Please,” she said, rubbing her breasts against him. The action was so feline she may as well have been in her fur.</p><p>Dayne gripped her by the shoulders. “How much of you is still in there? Because I promise if you regret this afterward and think you’re running off, I will lock you in the cage downstairs. I’m not having your heat cycle screw this up.”</p><p>She wasn’t phased by the threat, too lost in elevated hormones.</p><p>“Don’t you want me?” She pouted prettily and then turned in his arms, her ass grinding against his erection. “Mmmmm I see that you do.” She glanced over her shoulder. “Well?” Dayne’s hands had slid of their own accord around to her front, running smoothly over her belly and up to her exposed breasts.</p><p>“Are you coherent enough to talk to me?” He was in the process of losing his own powers of coherence.</p><p>“Don’t wanna talk. Wanna fuck.”</p><p>He gripped her by the shoulders again and shook her. “How long does this last and how often does it happen?”</p><p>“Depends.”</p><p>“On what?”</p><p>“Exposure to eligible mates.” She moaned. “Don’t stop touching.”</p><p>“You can’t possibly live like this.” He found it hard to believe Weres were running amuck having heat cycles and getting anything done in the real world.</p><p>“I take a pill. They’re in my apartment.” She sped the pace of her grinding.</p><p>“Like birth control?” If she didn’t stop that, he wasn’t going to be able to continue the conversation. Not verbally anyway.</p><p>“Sort of. Stops the cycle. Mutes it so I can function. Please fuck me now. Talk after.”</p><p>“I’ll go get your prescription.”</p><p>“Too late, won’t help once it’s started. Have to get them after.” Against his better judgment, Dayne picked her up and carried her to his bedroom. What was he going to do? Have her rolling around all over him until the full moon? He was supposed to be evil. He was well within his rights at this point. With all he’d heard about the tortures of heat without fulfillment, he was providing a service.</p><p>When they reached the bedroom, Dayne set her firmly on her feet and brushed a strand of hair from her face. She leaned into his touch. He jerked his hand away, remembering the same gesture from a few days before. This wasn’t her.</p><p>“Please.” Greta’s breath came out in labored pants.</p><p>“Oh fuck it, I’m the bad guy.”</p><p>He pushed her until the backs of her legs hit the bed. Her knees bent, and she laid back, spreading her legs wide for his perusal, her earlier shyness gone. He leaned down to kiss her.</p><p>“Please,” she whimpered.</p><p>The kitty didn’t want foreplay. Dayne shrugged and shucked his clothes. He tossed them blindly to the corner and took in the feast in front of him. Her fingernails transformed into sharp, razored points.</p><p>“Scoot back up on the bed.”</p><p>“Please.”</p><p>“Scoot back up on the bed or I’ll leave you here to handle this yourself.” He knew she couldn’t.</p><p>She obeyed him; she probably would have walked through fire at this point. If he were more sadistic, he might have tested that theory. Instead, he went to the adjacent room, came back with rope, and tied her wrists to the bars.</p><p>“For my protection from those nasty claws of yours,” he said, pointing to the healing marks on his forearm. There was no betrayal in her eyes, only raw lust as she spread her legs wider.</p><p>Tears streamed down her face.</p><p>“Please, Dayne.”</p><p>He chuckled. Superpowers or no, she could do nothing but submit when the heat took over.</p><p>Dayne slid inside her and felt one thing. Possession. This belonged to him. He felt it in the same primal way he felt magic when he’d followed the proper formulas. Whatever she thought this was, she was going to be in his bed for a good long time if he had anything to say about it.</p><p>A symphony of emotion played over her face as her more restrained counterpart fought for control. Fear, confusion, desperation, need, and finally surrender, as that part of her lost. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She lurched off the bed as her orgasm took her, and he joined her.</p><p>Then it was over, and her face telegraphed equal parts shame and fear. Greta turned away, staring at the wallpaper as if trying to imprint the pattern on her memory.</p><p>Dayne untied her and she wrapped herself in the bedspread.</p><p>“God, what you must think,” she finally said. She’d been making an effort to keep her crying quiet, but it flowed out of her voice when she spoke.</p> <p>“I’m thinking, for a quickie, that was fucking amazing. And that I’m probably done with my own species. To hell with playing it safe.”</p><p>He smiled at her when she turned back to him and kissed the dampness from her face.</p><p>“It’s worse than a vampire’s need for blood,” she said.</p><p>Another odd quirk. Most Weres reveled in their sexual power and slept with anything they could get their hands on. It was the one reason he’d trusted Jaden. When she’d come to his bed when she wasn’t in heat, he’d believed her feeling for him was genuine.</p><p>Now he knew what it had really been about. Control.</p> <p>Her face was tense, no doubt waiting for him to say something cruel.</p><p>“Are you okay now?” He sat on the bed beside her, for his part unconcerned with his nudity, as he stroked her back through the bedspread.</p><p>“Yes. I’m sorry about that.”</p><p>“Believe me, there is nothing for you to be sorry about. I’m evil remember? Your petty heat cycle doesn’t intimidate me.” She laughed a little. “It won’t happen again if you can get my pills.” Greta frowned then, lines appearing in the middle of her forehead. “I’m sure my apartment is being watched.”</p><p>“I can get in undetected. Will you be okay if I leave you?”</p><p>“Yes, go.”</p> <p>The fridge door stood open as Greta debated the benefits of left-over spaghetti versus peanut butter and jelly. She finally decided on chicken nuggets from the freezer.</p><p>Over the past few days she’d slowly come to trust she was safe here. The longer she was exposed to Dayne’s magical signature, the more she knew the world was shown a very different Dayne Wickham than the reality. Now her unease and fear were back.</p><p>“Stupid, Greta,” she said aloud. After the display in the kitchen, she should have known the heat cycle was close. It had been too long since she’d let it go that far without the drugs that suppressed it.</p><p>Dayne returned as she finished the nuggets, carrying her pills and something else.</p><p>“Mrarr.”</p><p>“Mink!”</p><p>“You are perverse,” he said.</p><p>It was only her paranoia that made Greta think he was referencing their previous joining.</p> <p>He pointed at the cat. “I spent fifteen minutes trying to talk to her and get her to shift, because I was convinced a therian wouldn’t have a pet of the same species they changed into. I’ve never heard of such a thing. Then I realized I didn’t feel any magic coming off her, just the residue in your apartment, so I brought her along.” Mink was rubbing her cheek against Greta’s hand and purring.</p><p>“I forgot all about her because of everything,” Greta said. “She could have starved.”</p><p>“Not likely. She chewed her way through the cat food bag. She could have lived off it for a month. Here.” He handed Greta the prescription bottle.</p><p>“Thank you.” She popped the pill, washing it down with milk, and sank back into the chair.</p><p>Dayne sat across from her, his eyes serious. “I want us to talk.” Chapter Six</p><p>think we should talk about the ritual.”</p><p>“IGreta let out a breath she didn’t know she’d been holding.</p><p>She’d expected condemnation, perhaps a scarlet letter magically emblazoned across her body.</p><p>Fortunately, Dayne wasn’t the Puritan she seemed to be. He’d handled the heat fiasco with a surprising amount of grace and now he just wanted to get back to the business at hand. She straightened in her chair.</p><p>She hadn’t asked for details about the ritual. Dayne could be planning to destroy the world and she’d probably let him use her blood if it would save her hide. Maybe she was a coward, but she wanted to live. She preferred not to know the gory details in case it presented her with a moral dilemma.</p><p>“What about it?” She ran a finger through the remaining honey mustard sauce on the plate and licked it from her finger. His eyes darkened with lust and she put her hands in her lap.</p><p>What was wrong with her? She’d just taken a pill. Could she not do anything without making it look like an invitation? She bit her lip, as her eyes roved over his body. Dayne was fully clothed, wearing jeans and a T-shirt featuring an obscure grunge band from the nineties.</p><p>No matter what he was wearing, she couldn’t stop seeing the sharply defined muscles she knew were hidden underneath. The memory of their earlier coupling ran wild through her mind, becoming clearer each time she replayed it. And she’d replayed it about fifteen times now. Her cheeks flushed, and she looked away.</p><p>“Why do you think they want you? Why does it have to be you and not someone else?”</p><p>“Oh, that ritual. It’s because I was born a kitten. But I didn’t know it until the other day when I overheard plans for the sacrifice.</p><p>I mean, how would I know? Not like I’d remember.”</p><p>“Explain.”</p><p>“Therians are born in human form and die in animal form.</p><p>Legends got that backward, or at least about the dying part. We don’t go back to human form when we die. We go into animal form trying to survive. It’s the way we heal.</p><p>“It’s rare to be able to shift before age five or six. Even then, it’s more normal to start shifting around eight. For centuries, my people have believed our powers come from the gods. So when the gods bless someone as a proper sacrifice, meaning they allow them to be born in their fur, they must be sacrificed on the first full moon of their twenty-eighth year when their power is strongest. But I always thought it was a myth.”</p><p>“I see.”</p><p>Greta tried to keep the hurt off her face that he wasn’t outraged on her behalf, or sweeping her up into his arms. The heat was screwing with her emotions. “Is that all you needed to know?”</p><p>“For now.”</p><p>Greta got up and rinsed her plate in the sink. “I’m going to bed then.”</p><p>The sex hadn’t meant anything. It was the stupid heat. She couldn’t expect him to be in love with her, and it wasn’t like she was in love with him either. She needed to get a grip.</p><p>It was after midnight and Dayne was propped against the headboard of his bed making notations for the ritual. It made sense now why the drawings and photographs had been in human form.</p><p>They sought a full reversal of the natural order. It was poetic in its way, if not morbid in its poetry. If she’d been born in cat form, her blood was more potent than most.</p><p>The kind of power released from blood like that on such a ritually significant date . . . He could see why therians believed it caused the gods to bless them. That much overflow with the right ritual, her essence was bound to be absorbed. Whether they were aware of it or not, they weren’t so much keeping in the good graces of the gods as they were stealing her power. If he’d wanted to live up to his reputation, he should be bottling her blood and selling it on the black market.</p><p>From a practical standpoint, it meant he’d need less blood than he would from a normal therian on just any full moon. Without that crucial knowledge, he could have had a magical boo-boo of pyrotechnic proportions.</p><p>His personal grimoire was propped open on his lap. He was penciling in the amount of blood he’d need, when he heard an unearthly howl. Moments later, a bundle of black fur shot across his floor and into the bed. She’d burrowed halfway under the covers before he could get to her.</p><p>“Greta, calm down.”</p><p>Her fur stood on end, and she was digging her claws into his 800 thread count sheets, digging clear into the mattress. She looked past him, seeing something that wasn’t there. Then a pitiful crying meow tore through her throat. His chest tightened, and a rush of compassion overwhelmed him for the frightened animal.</p><p>“Greta, look at me. You had a nightmare. There’s nothing here.” The part of her that could understand human speech had obviously receded, drawn back into the cat-shaped shell. Dayne gently stroked down her back, speaking soothing nonsense.</p><p>Gradually, the tiny talons receded back into her paws and her fur laid flat. His fingers smoothed over her until a rumbling purr started and this time he watched as she transformed back to her human form.</p><p>Their eyes met as he continued his ministrations over her silken skin. She rolled over onto her back, stretching her arms over her head as his fingers played over her breasts. He watched her reaction, half expecting her to pull away or recover her earlier modesty.</p><p>She let out a soft sigh; her eyes glazed over. He replaced his hand with his mouth, licking and teasing over the nipple of one breast as his hand moved farther south to pet her sex.</p><p>“Dayne,” she panted.</p><p>He released her breast to give her his full attention. “Yes?”</p><p>“I don’t know if we should.”</p><p>A finger dipped inside her, and she bucked off the bed. A purr emanated from her chest as she whimpered and pushed against his hand, urging his finger deeper. He withdrew it.</p><p>“Well, if you don’t think we should.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He smiled down at her and watched the angry spark flare in her eyes, then die away as she caught his grin and realized he didn’t intend to kick her out of his bed.</p><p>He chuckled and moved down her body to swipe his tongue over the flesh where his hand had been. She moaned and dug her hands into the sheets. He wondered if between her cat side and her human side if there would be any sheets left by the time he was finished with her.</p><p>Greta was in Dayne’s bed, wrapped in his arms for the second time that night. She wished she could stop the contented purring.</p><p>The pills had stalled the immediate need of the heat, but the adrenaline from her fear had caused her to weaken when his hands were on her.</p> <p>His fingers stroked through her hair and trailed down her back as she arched into his touch. Like most cats, she was never able to get enough.</p><p>“Do you want to tell me about the nightmare?” Greta stiffened. She’d forgotten the dream. She hadn’t been human enough to retain the memories. Already in her cat form and in such a primal panic, all sense of humanity had left her. She wasn’t usually so disconnected from her human thoughts, even in her fur. If she’d remembered the details of what had gotten her so scared in the first place, she wouldn’t have run into Dayne’s room.</p><p>She shuddered as the dream came rushing back in its full Technicolor ugliness.</p><p>“I just dreamed about the sacrifice. They took me and were draining my blood out. I was dying. That’s all.” She couldn’t tell him she’d dreamed he’d stood there and let it happen, that he’d been in on it from the beginning.</p><p>She’d run to him thinking he would protect her, but the tribe had sent her to him to ensure she’d be at the ritual. In the dream, Dayne was the one who made the cuts down her skin and smiled as the blood ran out.</p> <p>She hadn’t smelled any evil on him, not once she’d gotten past the persona he was trying to live up to. But then sorcerers could mask their scent with magic. Jaden had taught her that. She pulled out of his arms and reached for the shirt she’d dropped on the floor before their first coupling.</p><p>“I think I’m going back to my room,” she said, unable to make eye contact. She couldn’t let him see her fear.</p><p>“Are you sure? Maybe you should sleep here, in case you dream again.”</p><p>Greta was already edging toward the door when she looked up at him.</p><p>Dayne’s eyes narrowed. “You’re right; perhaps you should sleep in your own room. You’re only here a few more days.” It wasn’t as if she’d said she wanted a relationship. She hadn’t even implied it. The first time she’d been in heat, and the second he’d initiated. He had some ego. Or was his comment because he knew she’d be dead? Greta crossed back to her room and crawled in under the covers with Mink. This time she slept with her door locked.</p><p>Dayne sighed. It wasn’t necessary to overreact like that. Her wanting to sleep across the hall didn’t mean she was using him.</p> <p>The truth spell he’d cast wasn’t for short-term use. He could have done that without her blood. He’d instead wanted something longer lasting, an insurance policy to protect his interests in the event that he got too soft-hearted toward her and started doing all his thinking with little Dayne.</p><p>Her aura had turned dark when he’d asked her about the dream. She was holding something back. He could make her tell him, but then he was back to being classed as a monster. He didn’t like the way it made him feel when he was the source of her fear.</p><p>He liked even less that he cared so much what this particular therian thought, period. It would be best if she slept in her own room. If he didn’t get attached, neither Greta nor Jaden could lure him into another trap.</p><p>Chapter Seven</p><p>RETA perched on a kitchen barstool with a plate of bacon Gand scrambled eggs covered in maple syrup. Her long tanned legs were crossed, flip-flops dangling off her feet. Mink stood on the counter eating off the side of her plate.</p><p>“That’s disgusting,” Dayne said. She wasn’t sure if he was referring to her habit of eating maple syrup on her eggs, or sharing food with the cat. Mink hopped off the counter and fled to the other side of the room.</p><p>Dayne poured a glass of juice and took a packet of instant muffin mix from the cabinet. Greta tensed as he brushed past her to retrieve a bowl, muffin tin, milk, and a measuring cup. He took a chocolate cookie out of the cookie jar and chomped on it as he worked. A stubborn crumb stayed on the corner of his mouth, and Greta wanted to lick it off.</p><p>She was slowly losing her mind. He was dangerous. Probably.</p> <p>He was part of the ritual. Maybe. She wasn’t sure anymore. In the daylight it didn’t seem possible he’d do that to her. Two nights before she’d dreamed purple clowns were chasing her down an alley made of Swiss cheese. Some dreams were just dreams.</p><p>“Is something wrong?” Dayne preheated the oven and was engaged in pouring the batter into the muffin tin.</p><p>“Why are you doing that?”</p><p>“Doing what?”</p><p>She gestured to the batter. “Can’t you just zap them?”</p><p>“Only an amateur magic user uses a spell for such a petty thing.” He sounded like he was reciting from a textbook.</p><p>Greta spun on the bar stool, first one way, then the other. Something she hadn’t done since she was a kid at Simon’s house. She wanted blueberry muffins. It was getting close to the full moon and she was still hungry. But Dayne made her skin itch, and the kitchen was suddenly too hot and confining.</p><p>Her eyes cut to the doorway to see Mink slipping out of the room. In a minute, the cat would be back, whining to be let out.</p><p>Greta left her plate on the counter and, without a word, followed after her.</p><p>Dayne took the blueberry muffins from the oven and dropped the tray. Dammit. Was he developing some type of mental retardation? She’d deflected his question about what was wrong by asking why he didn’t use magic to make muffins. She had a point there.</p><p>And since when did he start eating instant blueberry muffins and chocolate cookies? Her poor eating habits were beginning to rub off on him. He never should have sprung for the cookie jar. All those simple carbs.</p><p>He was going to have to resort to magic to stay in shape if he kept eating like this. Only two more days, then she was on her own and he was back to the regimented diet. He plucked one of the muffins from the tray and ate it anyway, then went to look for her.</p><p>Whatever was causing her anxiety needed to be resolved, at least reduced. Otherwise, it could affect the ritual.</p><p>He found her in the garden.</p><p>“Greta . . . ”</p><p>She shrieked and covered herself with one of his bright fluffy beach towels. Dayne looked away, his hand over his eyes.</p><p>“Sorry,” he muttered.</p><p>“Give me a second. Okay. I’m decent.”</p><p>She hadn’t been kidding about a second. She could put clothing on as fast as most people could take it off. Dayne wondered if she was holding out on him about her magical abilities.</p><p>As to her decency, that was a matter of perspective. “You avoided my question earlier in the kitchen.”</p><p>“Oh?” She sat on the ground and picked a daisy, tearing the petals off one by one. Her eyes followed each petal as it fell onto her shorts, and the warm breeze carried it away.</p><p>“I asked you if something was wrong.”</p><p>She looked up at him, her eyes guileless. “Wrong? No. Why would something be wrong?”</p><p>Dayne felt his face darken at the same time Greta’s aura did.</p><p>“You’re lying.”</p><p>She shrugged and picked another daisy. He felt the tension roll over her as her eyes flashed to gold and then back to brown so fast it could have been a trick of the light.</p><p>He sat on the grass a few feet away and uprooted a daisy, starting on the same mindless ritual Greta was focused on. When she looked up at him, her shoulders relaxed.</p><p>He sighed. “What are you afraid of? You know they can’t get to you, not even in the garden. You’ve been safe here the entire time, and the clock is running out. You’re useless to them after tomorrow night.”</p><p>He reached out and settled a hand on her knee. “Are you afraid of me?”</p><p>Greta’s wide eyes rose to his. “No.”</p><p>“Is it because of the way I behaved when you first got here? Or anything we’ve done since then?”</p><p>“No. I’m not afraid of you.”</p><p>He watched as her eyes drifted to his hand, then away, then back again, but she didn’t ask him to remove it. He laid his other hand against her cheek.</p><p>“You really are safe with me.”</p><p>She rubbed her cheek against his palm and scooted to close the distance between them. Her mouth latched onto his. He returned the kiss; his hand settled on the back of her neck holding her firmly in place while his tongue explored.</p><p>In the next moment, she’d scrambled off him.</p><p>“Greta, what?” He touched a finger to his lips.</p><p>“I don’t need to be starting something up with someone who may or may not be evil.”</p><p>“Who said we were starting anything up?” Her face flushed. “I’m sorry, I forgot.”</p><p>“Forgot what?” He didn’t know what she was apologizing for until he saw the signs of the heat.</p><p>“I was supposed to take it after breakfast. And then you came in and distracted me.”</p><p>“It’s all right. I understand this. I don’t think badly of you. Let me help you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She held a warning finger out to him as she struggled to her feet. “You stay the hell away from me.”</p><p>He edged nearer. “You are afraid of me.” Greta didn’t trust herself to speak. She needed him now. Her body sought his. After the first day, he’d been nothing but kind to her. Never raising his voice, never grabbing or threatening her.</p><p>He’d gone shopping for her; he’d done everything right. Dreams were often a jumbled mixture of all the things people experience, desire, and fear. It made sense Dayne would get jumbled in too.</p><p>She had no illusions he wanted to keep her around, and she didn’t want to sleep with him again if it was going to be just another meaningless ritual biology had set up as a physical act with no feeling. If she was going to be physical with someone, she wanted the feelings that came with it. She wanted him to care.</p> <p>“I’m not afraid of you.”</p><p>He cocked his head to the side looking past her, and she wondered what had caused the confused expression to come to his face.</p><p>“You’re conflicted,” he said after a moment.</p><p>“I’m not conflicted. I just want control of my own damn body.” Her voice quivered more than she liked. She darted behind a row of hedges and passed through the gate before detouring to her room. She shut and locked the door.</p><p>Moments later there was a quiet knock.</p> <p>Greta’s need flowed through her. It thrashed about like a live wire demanding satisfaction. The arousal was so strong it was becoming painful. A rumbling purr started in her chest, trying to soothe it away. She needed him inside her now.</p><p>“Greta, let me help you. You can’t make it until tomorrow,” Dayne said reasonably from the other side of the door.</p><p>She sat on the edge of the bed, her nails digging into the sheets, rending long tears in them. Dayne didn’t seem conflicted at all.</p><p>Greta was glad at least one of them wasn’t suffering from that problem.</p><p>“I don’t want to frighten you. I don’t want to open the door with magic. But I’m not sure I can stay out here and listen to you howl like that.”</p><p>She hadn’t realized she’d been making vocalizations. Sounds that could be either pleasure or pain. At this point, even she couldn’t decipher the tangled web of sensations running through her. She left the bed without conscious thought and crawled to the door. Her fingernails dug into the wood as she pressed her ear to the flat panel listening to him while he spoke soft words of reassurance. She panted as she breathed in his scent.</p> <p>Greta ripped the clothes from her body. The room was becoming too hot. She couldn’t think. A horrible sound tore from her throat.</p><p>“I’m coming through the door if you don’t open it.”</p><p>She wanted him to. Anything so she wouldn’t have to make the choice to throw herself at him. Let him be the one on a conquest, not her.</p><p>“Greta.”</p><p>She couldn’t form a thought that would translate itself into a sentence. The only words that wanted to work their way through her brain were, “Please fuck me now.” She knew he was more than willing to oblige. All she had to do was move a few inches, and unlock the door. One tiny little turn.</p><p>Her hand reached out, and she pulled it away, biting her bottom lip.</p><p>“I’m counting down, and then I’m opening the door. Ten . . .</p><p>nine . . . eight . . . seven . . . six . . . five . . . ” She unlocked the door.</p> <p>“ . . . four . . . three . . . two . . . ” She opened the door.</p><p>Dayne’s clothes had already been stripped off. She wanted to say he’d been presumptuous, but large words like presumptuous couldn’t be processed in her near feral state. She pounced on him and wrapped her legs around his waist.</p><p>He walked them backward to the bed. “I’m never buying Egyptian cotton sheets again.”</p><p>“Please,” she breathed. They both knew she wasn’t asking for sheets.</p><p>Chapter Eight</p><p>RETA’S eyes shot open. Her heart palpitated wildly, Gthrumming through her chest. Blood pounded in her ears.</p><p>Dayne’s arm was slung over her hip, hugging her naked body loosely against him. Why hadn’t she shifted? She’d had the dream again, this time more vivid than before. Yet, despite her fear, she’d held onto her human form.</p><p>She wanted to stay wrapped in Dayne’s warmth forever, but she forced herself to move. He was the face of her death; there were no doubts now. Getting the same dream twice wasn’t something she could ignore. It was prophetic. Dayne was the one holding the ritual knife that spilled her blood.</p><p>She twisted and shimmied out from under him. His arm fell with a sharp oomph much louder than it should have been. Was her hearing getting better?</p><p>He rolled to his other side with a grunt, and Greta eased out of the bed. She grabbed her duffel bag from the corner, and made her way to the kitchen for her pills.</p><p>She didn’t need crazy lust while trying to survive. It had already inconvenienced her twice. Now her heart hurt to leave the man she kept finding herself in bed with. Stupid fucking heat cycle. Her body and heart were convinced he was the guy for her, but her brain knew better.</p><p>She felt a pang of regret at breaking her agreement, then her brain kicked back in as she remembered his plan had been to get her blood at the full moon. And to kill her doing it. No, she didn’t feel bad leaving. Besides, she’d slept with him. To men of Dayne’s reputation that was probably considered payment in full.</p><p>She wondered how he’d struck the deal with her tribe. Jaden wouldn’t send her to a sorcerer if she cared about her. Duh, Greta.</p><p>And the story Dayne had concocted about Jaden betraying him?</p><p>Way to shine the light away. Gullible. It wasn’t a lesson she’d be forgetting anytime soon. Assuming she survived her birth moon.</p><p>She crept to the kitchen, wincing when the hardwood floor creaked beneath her feet. She stopped and held her breath as she waited to see if it would wake Dayne. The house remained silent with only the ticking of the clock over the fireplace mantle breaking the stillness.</p><p>“Mrarrr.”</p><p>She jumped as Mink padded in, weaving her body between Greta’s legs. “Shhh! Do you want him to wake up and come in here?”</p><p>“Mrarrr?”</p><p>Greta smiled sadly down at the orange tabby. She’d have to leave Mink behind. Covert ops were clearly lost on the talkative cat.</p><p>She rummaged in the fridge until she found a slice of ham and dropped it on the floor, hoping it would shut the cat up. She poured herself a glass of water, gulped down a pill, then slipped the prescription into her pocket and took one last look around.</p><p>Tears teased the corners of her eyes. She wished Dayne hadn’t turned out to be evil. She could have imagined living here with him in his quiet cottage in the woods. It felt comfortable, like home.</p><p>“Where do you think you’re going?”</p><p>Her hand had been on the knob. So close. “Nowhere. Outside for some air.”</p><p>“The garden is protected; the front stoop is not. You know it’s not safe out there.”</p><p>She turned toward him, and her mouth went dry. He was dressed in navy silk lounging pants and no shirt. He had the kind of body college students sketched in art classes everywhere. So warm and beautiful. And he and Greta fit together perfectly, in the carnal way. She wanted to run into his arms. Her knowledge of his betrayal wasn’t enough for a body that still trusted him.</p><p>“It’s not safe in here either,” she said after a beat.</p><p>Dayne incanted something in Latin, and Greta felt the magic swirl up as the deadbolt turned. She pressed herself against the door as if somehow it would bend to her will and unlock. This was normally when she shifted. The edges of wildness intruded on her senses, but even stronger was her own will pressing back, for once choosing not to change.</p><p>“Please,” she whispered as he moved closer. “You don’t have to kill me. Whatever you need my blood for, you can have it. You know that.”</p><p>His brows drew together. “What are you talking about?”</p><p>She wondered which would be faster, her enhanced strength, or his magic.</p><p>He embraced her, then pulled back to look into her eyes. “I’m not going to hurt you. What exactly is going on in that head of yours?”</p><p>“Stop lying to me!” Greta shoved him with all her strength, and he went flying back, confirming her theory that he was only human with a few fancy language upgrades.</p><p>He opened his mouth to even the odds, and she flew at him, punching and clawing. With one last burst of energy, Greta slammed his head against the wall. Dayne crumbled to the floor, and the door lock fell open, withdrawing its simple magic now that the spell caster was unconscious.</p><p>She ran into the night, her eyes adjusted, and she fought the urge to shift. No fur. No paws. The trees were coming toward her too fast. She’d never run like this on two legs before, but her reflexes came to her rescue, causing her to zigzag through the woods without even a branch snagging her top.</p><p>When she’d put a few miles between herself and Dayne, she slowed her pace. Time to strategize. Think. The tribe wouldn’t be looking for her; they’d just expect Dayne had her, keeping her safe until it was time for the sacrifice.</p><p>She wasn’t sure how long he’d stay unconscious. She might be able to make it out of the city and take shelter with a wizard. Unlike sorcerers, wizards could be trusted. Too bad there weren’t any within Cary Town city limits. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Before, she wouldn’t have considered involving a human; it was too risky. But she’d run out of options. At the main road, she hailed a taxi.</p><p>“633 Oak Circle.”</p><p>The driver gave her an appreciative once-over. Greta smiled, glad she’d remembered her pill. Though the heat would have to be pretty bad for this guy to inspire her lust. He had a scruffy beard and was wearing flannel, for God’s sake. Mother Nature could only take one so far.</p><p>“Here we are,” he said unnecessarily when they pulled up to Charlee’s house.</p> <p>“Thanks. Could you wait while I go get some money?”</p><p>“You tryin’ to stiff me, sweetheart?” His voice held a touch of menace and some darker violent part of Greta itched to do damage.</p><p>Instead, she took a breath to steady herself.</p><p>“Just. Wait.”</p><p>“Fine, but if you aren’t out in five minutes, I’m comin’ after you.”</p> <p>Greta’s eyes glowed golden, and she hissed. She didn’t have time for this crap.</p><p>His hands shot up in surrender. “Take all the time you need, baby.”</p><p>Greta knocked for a full two minutes before a bleary-eyed Charlee opened the door, her red curly hair askew.</p><p>“What’s wrong?”</p><p>“I need money for the cab first.”</p><p>Charlee went and got her purse. When the taxi rolled away, she asked again.</p> <p>“I need you to smuggle me out of the city.” Confusion marred Charlee’s face. “Huh? Just drive away.”</p><p>“I can’t. I know this is going to sound weird, but you were on board with the cat thing and the sorcerer thing.”</p><p>“Didn’t that work out?” Charlee tied the belt around her bathrobe and led Greta inside.</p><p>“It was just a way to keep me in a holding cell, so no one in the tribe against this could warn me or help me escape.”</p><p>“So tell me again why you can’t just drive out of the city.”</p><p>“You know the toll booths on all the major exit roads?” Charlee nodded.</p><p>“Preternatural border guards.”</p><p>“Why not just take the back roads? There aren’t any tolls there.”</p> <p>“There are wards to keep therians from crossing. The toll roads exist because there are exemptions. And some species can pass at will, like vampires. Therians have to have permission to leave and when they do, they can go through the toll roads and present paperwork.”</p><p>“Why therians?”</p><p>Greta sighed. “I can appreciate your curiosity, but I don’t have time to get into therian politics right now.” Ten minutes later she was in the trunk, blankets wrapped tightly around her, with an opening in the top to breathe through.</p><p>The blankets served to dampen her magical signature. With any luck, the guards wouldn’t sense it.</p><p>Charlee’s gray Honda Civic rolled to a stop.</p><p>The tollbooth guy’s voice rumbled just outside, asking to see ID.</p><p>Greta tried to remain calm. It could be a routine check, though she had no idea why the preternatural border patrol would do something so obviously sinister if they weren’t sure they had someone trying to cross the border. If it was a false alarm they’d have to call in a vampire to do a memory wipe, and vamps hated being bothered during their prime hunting hours.</p><p>“Charlotte Devlin?” The guard asked.</p><p>“Y . . . yes?”</p><p>“If you wouldn’t mind, we’d like you to open the trunk.” Shit. Greta began frantically clawing through the layers of fabric.</p><p>“You aren’t authorized to search this vehicle.” Love her heart, Charlee thought she was still operating in a human world with democratic rules.</p><p>“You won’t remember about your rights being ignored in the morning,” he said. “Now open the trunk before this has to get ugly.”</p><p>Greta heard the key turn in the lock; the trunk was flung open.</p><p>She was poised and ready to jump. Her claws dug into the guard’s cheek as she leaped off him. He yelped and cursed into his walkie-talkie for backup.</p><p>She was panting as she ran, desperate to put as much distance between herself and whoever the guard was calling, unsure which road might lead her to some temporary haven of safety. Finally, she spotted an open window. Someone without air conditioning had left their window open a few inches, only a screen protecting them from burglars. She wondered how such people didn’t end up in ditches and on the six o’clock news.</p><p>Greta ripped the screen with her claws and hopped inside. She crept into a bedroom to search through the closet, careful not to wake the middle-aged woman snoring loudly in the bed. Greta’s nose wrinkled in distaste at the clothes she had to choose from. The woman was twice her size and had a large collection of dresses with big flowers printed on them. The colors were bright and spanned the entire spectrum of the rainbow. She sighed and put one on.</p><p>Sticking to the shadows, she crept outside and paused in an alley behind a dumpster to catch her breath. A gloved hand covered her mouth. She struggled, but it was one of the tribe, someone stronger than her.</p><p>“Don’t scream,” Simon whispered. Greta’s eyes widened as they caught something bright and silvery reflected in the streetlight. A hypodermic needle poised over the vein in her throat. Then the world went away.</p><p>Chapter Nine</p><p>AYNE woke to a pounding he was sure was coming from Dthe inside of his skull until he opened his eyes and realized it was the door. His fingertips skimmed over the bump Greta had left. Jesus Christ, she’d gone insane on him. He couldn’t figure out why she’d thought he planned to kill her. Surely, the last activity they’d been engaged in together wouldn’t lead her to that conclusion.</p><p>He crossed the room in three strides and threw the door open.</p><p>His expression changed from hope to anger. “You’re taking your life in your own hands by being here. You’re lucky I didn’t kill you that night.”</p><p>The ward on the door dissolved, and Jaden glided past him into the house. She was dressed for a night on the town in a long backless black gown with a slit up one side, and strappy black heels that in another time and place would have made his mouth water in anticipation.</p><p>“You never could have killed me.”</p><p>Dayne wrapped his hand around her throat. “Care to make a wager?”</p><p>Jaden pushed him off her with ease and rolled her eyes. “As fun as this is, I’m not here to rekindle our old affair. Greta got captured.”</p><p>“This is so unbelievably transparent. My IQ might have dropped several points the first time you rolled in playing the temptress, but I’ve grown as a person since then.” Jaden smirked. “I’m sure.”</p><p>“I think she’s perfectly safe. And if she isn’t, what do I care?”</p><p>“What, indeed.” She shrugged and stretched out on Dayne’s couch. “It’s your call. But she’ll be sacrificed as soon as the sun sets.”</p><p>Dayne was momentarily stunned by the sunlight streaming through the windows. He shook his head and pointed at the door.</p><p>“Leave.”</p><p>“I know you care for her. Help me.”</p><p>He was annoyed by how well she could still read him. “Why would you give her my address in the first place?” Jaden looked at the ground, the confident facade falling around her feet. “Because I knew you could keep her safe.”</p><p>“You didn’t think sending her here might endanger her?”</p><p>“It’s not in your nature to harm an innocent. You know you never felt that way about me.”</p><p>One side of Dayne’s mouth inched up in a grin. “Because you weren’t, in fact, an innocent.”</p><p>“True enough.” Jaden withdrew a thin lady’s cigarette out of a red leather pouch and placed it between her lips. Her eyes remained on his as she lit the tip and inhaled the nicotine.</p><p>Playing the seductress had become her full-time role, Dayne mused. She didn’t seem aware she was doing it. Or if she was, she was barking up the wrong tree. She’d folded her legs up underneath her, and now she unfolded them, crossing them primly, allowing one thigh to peek out of the dress.</p><p>Goddammit. He was going to let Jaden lead him into a trap again.</p><p>This time he was killing her. The shapeshifter was far too dangerous to be left alive.</p><p>“Very well,” Dayne said, finally. “I’m sure Greta shed some fur around the house.” He’d need it for the spell to find her. “And Jaden, if this is a double-cross like the last time, you die. Don’t expect old sentiments to keep you safe. If you’re fucking with me this is your last chance to leave quietly.” Jaden was already looking for cat fur.</p><p>“Wakey. Wakey.”</p><p>Greta opened her eyes to see Simon grinning down at her. She was in a steel cage, with barely enough room to turn around. Her wrists were tied in front of her with coarse rope.</p><p>She looked down to find herself dressed in a flowing white gown, right out of a Cleopatra movie. She would have felt somewhat ridiculous if it weren’t for the mind numbing fear.</p><p>Even with her new level of control, she should have shifted by now. But she knew she’d never shift again. Greta mourned the loss of the grass and the hunt and the stars that used to blur overhead as she ran. She felt sluggish as the drugs flowed through her veins, dampening everything. Her keen sense of smell, vision, hearing, her ability to scent emotions. It was all gone. She felt . . . human. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She’d spent a great deal of time passing for human, spending more time with them than her own tribe. Trying to blend. She no longer wanted to blend; she just wanted her powers back. A tear slid down her cheek.</p><p>“Oh, don’t cry. You won’t be pretty for the sacrifice. No one wants running mascara in a sacrifice. Least of all, me.”</p><p>“The gods won’t honor this.”</p><p>Simon laughed, less a villain laugh and more a that’s the funniest joke I’ve heard in ages laugh. “You’re adorably naive, Greta. There are no gods.”</p> <p>“Then, why?”</p><p>“I want Dayne dead. I’ve been studying magic for ages. Your power will allow me to defeat him. Then I can run this town with no threat of challenge.”</p><p>“Except for the wolves.” They were notoriously hard to keep in line.</p><p>He waved a hand in dismissal, “The wolves will be dealt with.” A sick feeling lodged in her stomach. “I thought Dayne was involved with the ritual.”</p><p>Again Simon laughed. “I think he played that rep of his a little too well. You couldn’t even trust your own senses. I sent you the dreams. ”</p> <p>She knew Simon and Jaden had tried to be subtle about their love affair while Greta was growing up. But they hadn't been subtle enough. She’d grown up thinking of him as her step dad.</p><p>If Jaden had once slept with Dayne to lure him into a trap set by Simon and the tribe, she could see where he might never let that drop. Even if it had been his idea. She’d been born soon enough after; she’d become the new plan. She didn’t have to ask if Simon had killed her real mother.</p><p>“If you do this, it’ll make you insane. We can’t wield magic like they can. What’s the point of having power if you lose your mind?” Greta said.</p><p>“Maybe. Maybe I’m already there. Slowly draining the blood out of my daughter doesn’t sound like rational behavior to me, does it you?”</p><p>She looked stricken. “You can’t be my father.” An image of Darth Vader burst into her head. At any other time, it would have been funny.</p><p>“I’d submit to a DNA test, but I’m sure you can appreciate the time crunch I’m on. Jaden couldn’t reproduce and I wanted an heir.</p> <p>I figured it was tit for tat as these things go anyway. I wanted a boy, but you more than made up for it.”</p><p>“I don’t believe you.”</p><p>“No? Then how would I know the circumstances of your birth?”</p><p>“I’ll tell the rest of the tribe what you’re doing. They won’t participate in this stupid vendetta against Dayne.” Simon sighed and shook his head in fatherly disapproval. “You should feel privileged to give your life to make the tribe strong.</p><p>Now be a good kitty, and open up.”</p><p>He reached through the bars to shove a gag into her mouth, snapping the leather straps closed behind her head. He stepped back to admire his handiwork.</p><p>“Now only we know our secret.” Simon held an index finger up to his lips and smiled.</p><p>“Mmhmmhhmpphr.” Greta’s scream was muffled behind the gag. She struggled against the ropes.</p> <p>“It’s time.”</p><p>Simon picked up the handle attached to the base and rolled the cage to the door. The wheels squeaked under her. One was uneven, and she lost her equilibrium as Simon increased the pace. She knew he felt the moon rising.</p><p>Greta no longer could. Suddenly, losing the feel of the moon was all she could think about. The way her skin always felt warm when the moon rose, as if it were sunlight.</p><p>The fluorescent lights blinked on and off as the cage bumped down the nondescript hallways until finally they reached a door with a red exit sign over it. The sign flickered with a little electric buzz, and Greta realized it was Simon. Power already rolled off him, competing with the electricity for dominance.</p><p>Behind the warehouse was an open field surrounded by trees. In the middle of the clearing a large ritual circle had been formed with wooden logs. The small tribe stood reverently outside the circle, wearing identical long black cloaks. Beneath the cloaks, Greta knew they were all naked. This was what they wore when they shifted together.</p><p>The tribe was just twelve members strong now. In the glory days, it had been well over thirty. Jaden wasn’t among them.</p><p>A crude concrete slab stood in the center of the circle. It had been built for the occasion with large steel chains bolted into it.</p><p>Simon rolled the cage to just outside the circle and produced a key from his pocket.</p><p>Another therian appeared out of the darkness to help. As if Greta could fight one of them with only human strength. How could humans stand to be so weak?</p><p>She struggled against them as they half dragged, half carried her to the stone slab, so much like the one in her dream. Except, she’d dreamed of the wrong executioner. She tried screaming again. Simon was a lost cause, but maybe the other therian.</p><p>His name was Benjamin. She’d grown up with him; they’d played together. He wouldn’t do this to her. Surely, he had to see this was wrong. The gods didn’t deserve worship if they wanted this. Her eyes pleaded with Benjamin, but he looked away as he took a knife from his pocket and cut the ropes off her wrists.</p><p>They hauled her onto the stone slab, and the wind rushed out of her as the last possibility of escape was ripped away with the locking of the chains. It was so loud it was as if her preternatural senses had come flooding back in a rush of self-preservation. But then the sudden sense clarity faded back to the dull, drugged feeling, and another tear rolled down her cheek.</p><p>Benjamin stood stiffly to the side, still averting his eyes from her. If what was left of the tribe banded together, they could take Simon out. But none of them was brave enough to face down their bully. No one was stepping forward to save her.</p><p>Four therians came up around the outside edges of the circle, each holding a flaming torch to light the wood that formed the ritual space.</p><p>Greta’s world narrowed, alone inside the circle of flames with Simon. The members of the tribe shifted and horrifying howls, like cats in heat, lifted up into the night. She could see their glowing eyes through the flames as they prowled around the edges of the circle, keeping up those horrible half-growls, half-meows.</p><p>Simon stood at the foot of the slab, holding the golden ritual knife up to the sky. The knife had been used in full moon rituals her whole life. Consecrated, sacred, and blessed, about to be defamed by the unholy spilling of her blood for a power-crazed Were.</p><p>“Bless this sacrifice and increase my territory,” Simon said, with the knife raised in a mockery of sanctity.</p><p>He made long shallow cuts in her flesh. She wasn’t sure what had been in the syringe, but whatever it was numbed the pain.</p><p>How long would it take? How long before she felt her life slip away like in the dream? All at once, the howling stopped as one by one the therians worked to reclaim their human forms.</p><p>Naked men and women struggled and scuffled outside the circle of flames like grotesque shadow puppets. Greta watched the bodies drop, and then one solitary therian stood still in fur, golden cat eyes staring through the flames, before backing up and taking a running leap over the wall of fire. Her claws dug into Simon’s back as she growled.</p><p>It took a second for Greta to realize it was Jaden. Simon grabbed her and tossed her out of the circle. The next shape that came barreling through the fire was human.</p><p>Chapter Ten</p><p>HE two combatants rolled on the ground, grappling like high Tschool wrestlers. Either Greta was having hallucinations of what she wished would happen in her last moments, or Dayne had done something to enhance his strength. The two men rolled toward the flames, then away again. Simon caught fire, and they rolled together to dampen it.</p><p>Suddenly, Dayne flew back. Simon’s hand was held out in front of him, and green energy crackled from his fingertips. He wiped a bloody nose with his other hand.</p><p>Dayne’s lip was cut, but he chuckled. “Learned a few tricks since our last meeting?”</p><p>“Coming to save the girl, Dayne? You really are pathetic. You should trade up for some shiny armor. I could give you mine if you’d like. It’s just collecting rust at my house.”</p><p>“I’m here for my blood. That’s all.”</p><p>Simon shrugged. “Well there’s plenty of it.” He gestured toward Greta. She’d become listless, no longer struggling, as the blood flowed out of her into the moat around the altar. She was using all her energy and focus just to remain conscious and aware. The voices around her sounded like they were under water.</p><p>“Well? Aren’t you going to take it?” Simon asked.</p><p>“You know it doesn’t work that way. Another ritual is already in place.”</p><p>“I’m going to have to ask you to leave my circle,” Simon said.</p><p>“If you stay, you might get some of the power, and then I won’t have an unfair advantage later when I come to kill you.” Dayne threw a handful of herbs at Simon and raised his arms.</p><p>He shouted an incantation that caused a band of light to wrap around Simon, effectively binding him.</p><p>“You can’t save her,” Simon said. “She can’t shift forms to heal.</p><p>By the time the drugs are out of her system it’ll be too late.” Dayne raised his arms again and looked up, shouting an invocation. The sky opened, and rain poured down. Greta closed her eyes against the downpour and shivered, her teeth clattering. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Great plan there, hero. She can die of a chill and blood loss,” Simon taunted from the bubble that trapped him. His inability to move didn’t extend to his lips.</p><p>“I should have used more sage,” Dayne mumbled as Simon kept babbling. “It’s safe now,” Dayne said when the fire had died.</p><p>Simon struggled within the magic that trapped him. “Who are you talking to?”</p><p>Anthony entered the circle, an unmistakable leer on his face as he looked hungrily at Greta. He wore his basic black, but his blond hair flowed loose around his face, which was caked in blood.</p> <p>“Looks like I get a taste after all.”</p><p>It looked like he’d had plenty of tastes already.</p><p>Simon laughed. “Oh, this is a great plan. Vampires are entirely untrustworthy. He’ll take too much.”</p><p>“Shut the hell up!” Dayne said. He turned to Anthony. “Do it.” Dayne went to one side of the altar and threaded his fingers through Greta’s. “He’s not going to hurt you. I could have whipped up a potion to counteract the drugs, but there wasn’t time. It’s clumsy, but he can siphon the poison out of your bloodstream.” Anthony knelt on the other side of Greta and gripped her chin, turning her head to the side. His breathing deepened, obviously aroused by the sight of her half-naked and bleeding. He licked a long trail up the side of her neck, and she shivered.</p><p>Dayne’s grip tightened on her hand. “Just get on with it.” Anthony chuckled and sank his fangs into Greta’s throat. She gritted her teeth, expecting pain, but what she felt instead was intense and unexpected pleasure. He took gentle tugs, and some delirious part of her thought maybe she should have taken him up on his offer before tonight.</p> <p>“Okay, that’s enough,” she said as the strength in her voice returned. She struggled, but he growled and continued to drink.</p><p>The drugs didn’t seem to affect his strength as they had hers.</p><p>Dayne grabbed him by the scruff of the neck and pulled him off her. Anthony was laughing, driven half-mad from the power of her blood. He gave a howl of pure pleasure that could have rivaled that of any therian and ran off into the woods to hunt.</p><p>She felt the change come over her as the moon warmed her skin.</p><p>The chains clanked against the stone altar, and her paws easily slipped out of them. She could feel her body mending itself, healing the damage she couldn’t have taken for much longer in her human form.</p><p>“What do you want to do with him?” Dayne gestured to Simon.</p> <p>Greta shifted back and quickly slipped the white gown over her head. The cuts on her body were already healed. She’d been strong enough to shift and strong enough to heal, but Simon had success-fully drained some of her power into him. She felt revulsion at the kindred feeling flowing between them as they shared not only blood now, but power.</p><p>“We can’t let him live,” Dayne said. His eyes were intense, imploring her to understand.</p><p>“No, we can’t. Help me.” She dug into Simon’s pocket for the key and unlocked the chains bolted to the altar. The two of them worked quickly to restrain the tribe’s fallen leader.</p><p>Greta bent to retrieve the ritual knife. Her human eyes locked with Jaden’s cat eyes. Jaden looked from Simon to Greta, then back to Simon. Then she turned and ran off into the woods following the path Anthony had taken.</p><p>“I’ll do it,” Dayne said, holding out his hand for the knife.</p><p>Greta’s hand shook, and she gripped it more firmly. “No. It has to be me.”</p><p>Simon couldn’t continue living, and she wouldn’t let him die a quick death with her power coiled inside him. It wasn’t fair for him to take that to his grave. She bit her lip as she pressed the blade into Simon’s flesh. She took no joy in the act. There was nothing to be gained from orphaning herself but closure.</p><p>Simon screamed, thrashed, and begged, much less stoic even than she’d been. Greta forced herself to look away. She was tempted to snap his neck and end it, but she pressed on, unwilling to let him take any small victory to the afterlife.</p> <p>It was still raining when the life slipped from her father. Dayne draped his coat over her shoulders and took her back to the cottage.</p><p>She looked so lost. She’d kept insisting he do the ritual. He should have told her no, but he knew she sought atonement for the blood she’d spilt. Or perhaps she still thought he planned something villainous and wanted to complete her induction into evil.</p><p>He didn’t have the heart to tell her he didn’t need her blood anymore with Simon dead. He took it anyway, draining about a tablespoon’s worth into a small clear vial. He opened a book, chanted, and felt the magic flare up and disperse.</p><p>He’d performed a spell to help the flowers in the garden grow better. With her blood, it was going to be quite the botanical extravaganza. She’d like it at least. He was deeply grateful for magical languages. It was the only thing preserving an ounce of his reputation.</p><p>The first thing Greta said after the magic faded was, “What about Charlee? She tried to help me cross the border.”</p><p>“She’s fine. Anthony wiped her memory last night.” They stood staring at each other, and then she flung herself at him, raining kisses over his neck, forcing her tongue into his mouth. Her hands wandered down his back and over his ass, and her eyes glittered with need.</p><p>“Damn woman, how many days does this go on?”</p><p>“Couple of weeks sometimes. Was in a cage. No pills.”</p><p>She reluctantly pushed herself away from him. Dayne could see the cogs turning furiously in her brain as she realized she didn’t have to stay with him; he wasn’t her only option. She turned to leave.</p><p>“You’re not going anywhere.” Dayne felt the possessiveness curl around him as he grabbed her hand and moved it back to his backside where she’d been kneading his flesh and practically dry humping him moments before. “Let’s go upstairs.”</p><p>“You really don’t have to do this.”</p><p>“Let’s go upstairs,” he repeated. He wasn’t sure what could be going through Greta’s mind to make her think sleeping with her was a chore. He knew how she felt about the cycle, and he was sorry she hadn’t taken her pill in time. He should have thought of it before they’d started the ritual.</p><p>Gift horse.</p><p>He scooped her up and carried her up the winding staircase.</p><p>“Your room or mine?”</p><p>“Yours,” she murmured against his neck.</p><p>Dayne took her upstairs and made love to her.</p><p>Greta woke to birds chirping outside the window and a distinct desire to shift and go chase after them. She felt sore from the previous night’s fight and . . . other events.</p><p>Her pills were on the nightstand with a bottle of water. She swallowed one down.</p><p>Dayne’s back was to her and he was curled in a ball like a large, old, and well-preserved squirrel. She wanted to curl her body around his and go back to sleep; let him wake her later. But she couldn’t. She was sure she’d been a nice diversion, but he’d only agreed to let her stay until after the full moon, and she wasn’t about to show her naiveté by hoping for more. She was twenty-eight, not eighteen. It wasn’t as if he’d professed undying love.</p><p>Dayne’s hand closed over her wrist. “Good kitties don’t run away,” his sleep-filled voice rumbled.</p><p>Greta gave him a questioning look.</p><p>“Stay.”</p><p>“I thought you said just until after the moon?” Practically every sexual encounter they’d had had amounted to pity sex. She couldn’t handle further pity or possible rejection.</p><p>She’d become stupidly attached to him.</p><p>“You might need me to keep you safe,” he hedged.</p><p>Greta bristled and jerked her arm away. “I can take care of myself. I don’t need your goodwill. Thanks anyway.” Dayne chuckled and let his hand come to rest lightly on her thigh. “Yes, I saw that in action last night when you were tied down to an altar like the star of a B movie, complete with heaving bosom.”</p><p>“I was not heaving. And anyway, you just came to rescue me because you needed my blood. What was the spell for anyway?” She hoped it wasn’t for something world-ending.</p><p>“Oh, please. It was a huge hassle rescuing you. If I just needed blood, I could have taken one of the morbidly rubbernecking gawkers standing on the sidelines in the woods. Please stay.”</p><p>“I don’t need a man.”</p><p>He scooted up behind her and trailed kisses over the back of her neck. “Didn’t say you did. But I’m a very old man, and I now know the joys of having a pet around the house. Though in hindsight, seeing how well you listen, I should have gotten a dog.” Greta smacked him on the arm. Dayne pulled her back and flipped them so he was straddling her. He planted a long, slow kiss on her lips. “Now, stay. You took your pill, right?”</p><p>“Yes?”</p><p>“Good. I’d like to make love again without you thinking I’m doing it out of some twisted mercy. If you want me without the heat interfering, that is.”</p><p>His hands started to stroke over her flesh and she relaxed and allowed her legs to fall open. A contented purr began to rumble through her chest. This was how Greta became kept.</p><p>Scroll to the next page for more info about upcoming releases. </p> </body></html>"]