["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Prologue</p><p>“Well Brother, you’ve certainly been busy the last several years,” George Anderson said.</p><p>“I don’t know what you mean,” Joseph replied but not without a twinkle in his bright blue eyes.</p><p>“We both know your meddling is what led to all those grandkids of yours,” George said a bit grumpily.</p> <p>“Well, if you hadn’t been all hell bent on going off to see the world, then maybe you would have a bunch of your own grandkids,” Joseph said to his brother.</p><p>“I came to you for help. Those kids of mine are never going to settle down and you have obviously had great success. Please help me with my own stubborn brood?” George asked.</p><p>Joseph had grown tired of waiting on his sons to find brides and give him grandkids, so he’d took matters into his own hands and found good mates for the boys. They were still clueless to his sneaky ways. All three of his sons got married within a few years-time, and now he was a happy grandfather. He felt sorry for his brother, knowing he was feeling the same sense of emptiness he’d felt a few years ago.</p><p>“Nothing would give me more pleasure than to help you,” Joseph said, making George relax.</p><p>“I know with your help I’ll be bouncing my own grandkids on my knees in no time. Life has been hard for me since I lost my beautiful Amelia,” George said.</p> <p>When George lost his wife of forty years, it sent him off to explore the world. He’d been unable to stay in the home he’d shared with her for most of his life. They’d married at sixteen years of age and he didn’t know how to live without her.</p><p>“Are you doing any better?” Joseph asked. He couldn’t imagine losing his Katherine. She was the light of his world. Without his wife and kids, life wouldn’t be worth living.</p><p>“I take it a day at a time. If I had some grandkids to distract me it would make it easier. Since their mother’s passing, the kids have become distant, with each other, and with me. I’m afraid if something doesn’t change soon, we’ll break apart,” George said with suspiciously glossy eyes.</p><p>Joseph got them each a drink, giving his brother time to compose himself. He poured them each a shot of bourbon before coming back to the chairs by the fire, where they were sitting.</p><p>“Why don’t you stay with me, here? You can look for a place and relocate to Seattle. I think what you need is a fresh start. I know we can get your kids to follow. We’ll fix this George, trust me,” Joseph offered.</p><p>George looked at Joseph, considering his offer. He’d lived in Chicago his entire adult life and it was a bit frightening to think of moving, but change may be a good thing for him. Chicago was filled with depressing memories of his late wife.</p> <p>“You know what, Joseph? I think I’ll go ahead and do that. You still have a guest house, right?” he asked.</p><p>“You’re more than welcome to stay there for as long as you like, or you could stay in the main house. There’s far too much space in this big old house,” Joseph told him.</p><p>“This is your home with Katherine, I’d much rather stay in the guest house until I find a place - it shouldn’t take me long. Now, what plans do you have for those kids of mine?” he asked.</p><p>“Tell me everything about my niece and nephews. The more I know about them, the more likely I’m going to find matches good enough they won’t be able to resist,” Joseph said. The two brothers sat by the fire until the early hours of morning making plans. By the time they’d finished talking Joseph knew what he was going to do with his eldest nephew Trenton.</p><p>“Ah, it really does feel good to be matchmaking again. I was kind of sad for it to end with Mark,” Joseph said with a smug look on his face. “But, don’t you dare let on to Katherine or I’ll be sharing the guest house with you.”</p><p>The two brothers had a good laugh, before finally heading to bed. Joseph was eagerly anticipating the months to come. He wouldn’t mind the patter of great nephews and nieces running around the house, alongside his grandkids.</p><p>Chapter One</p><p>“Your father is on line one, Mr. Anderson,” said his assistant over the intercom. Trenton sighed. He hadn’t spoken to his father in months and couldn’t understand what he’d need.</p> <p>“Thank you, I have it,” he replied. He took a moment to clear his thoughts before picking up the phone. He knew he’d need his wits in full before taking the call.</p><p>“Hello Father, what can I do for you?” he asked coldly.</p><p>“Is that any way to talk to your father?” he asked. Trenton could hear the hurt through the phone line and he cringed. His mother had been the glue holding their family together and since she’d passed he’d hardly spoken to his father or siblings. He didn’t know if he even remembered how to anymore. They used to be close but had all withdrawn when their mother passed. They had to protect their hearts from the unbearable pain, somehow. She would be so disappointed in them.</p><p>“Dad, we’ve barely spoken in the last five years. Why change anything, now?” Trenton asked.</p><p>“I can see this is going to be harder than I imagined. I’ll just get to the point, then. I’ve moved the corporate headquarters to Seattle. The paperwork went through today. If you still want to run the company you’ll have to relocate. You have thirty days to make your decision - before your offices will no longer be available to you in Chicago,” George said.</p><p>Trenton sat at his desk in shock. He’d never been made speechless before, but his father’s words actually left him without words. The line was silent for several moments, while neither of them said anything.</p><p>“Why would you do that?” Trenton finally asked with rage in his voice. How dare his father try and control him. He’d run the corporation on his own for the past five years, when his father retired abruptly. The fact his father still had enough control to be able to move the offices had never been a factor, as he’d been a silent owner.</p><p>Trenton tripled profits during his reign as president and the corporation was worth billions of dollars. Many lives depended on them to make a living. He didn’t see what his father had to gain by moving the corporate offices. Most of their business was done internationally and their home office wasn’t significant, but Trenton had grown up in Chicago and had no desire to leave.</p><p>“It was time for a change. I’ve let our family drift apart, but I’m done with that. I’m still the head of this family and this is what I’ve decided. I know you well, son, and I know the second we get off the phone you’ll be calling your attorneys to see if you can put a stop to this. I’ll try and save you some time - the answer will be no. I may be silent in the corporation but I still have certain rights and if you read through the paperwork, one of those rights is to have the corporate offices wherever I choose, so long as I give the current President a month’s notice. So, here’s your notice. If you check with your assistant, a fax has been sent, laying out the move and the new building. I’ll see you next month,” George said. He disconnected the call and left Trenton sitting with the phone pressed to his ear, seething in rage.</p><p>“Andrea, get in here, now!” he shouted into his intercom. His assistant came running into the room, looking a bit frazzled. She had the paperwork from his father in her hand, knowing he’d want it. She laid it on his desk and stood back for him to read. “You can leave,” he dismissed her. She quickly exited.</p><p>He knew he could be a hard-nosed boss at times, but he felt he was fair. If his employees did their job well, they had nothing to fear. He just didn’t tolerate errors or slacking, so if they messed up, there were no second chances.</p><p>Trenton spent the rest of his afternoon confirming what his father said. It looked like the old man was right. There was no way he could stop the move. He had enough of his own money that he could tell his father to go to hell, and just start over - but he didn’t run the corporation for the paycheck, he did it because it had been in his family for longer than he’d been alive and he had a lot of pride in it.</p><p>He hung his head in a rare moment of weakness. He knew he couldn’t quit. He knew he’d be playing right into his father’s hands, but he’d move with the corporate offices. He also knew that meant a lot of new staff and a hell of a lot of headaches.</p><p>He went home, drank a double scotch, then pulled out his phone. He had to call his siblings, which he hadn’t done in over a year. Each of them worked in different areas for the corporation and they were going to be just as pissed at their father as him.</p><p>His father may be getting him to move across the country but he wasn’t going to get the happy family reunion he was hoping for. Trenton was enraged and he was going to let his father know it.</p><p>“Are you sure we’ve done the right thing?” George asked Joseph.</p><p>“I’m sure. The first step in this process is getting the kids together, again. We can’t very well match them up if they aren’t here, can we?” Joseph asked.</p><p>“Trenton’s been distant in the last several years, but I’ve never heard him speak to me so coldly, before. I know losing their mother was hard for all of us, but I should’ve never let us grow this far apart. I can’t believe this is the same boy who used to worship the ground I walked on,” George said with sadness.</p><p>“I guarantee you, Brother, by this time next year, you and your boy will be together again, and things will be back to normal. I can’t say I’ve gone through what you’re going through but nothing brings family together more than other family members in their face. They used to be close to their cousins and we’ll all have that bond again. Just you wait and trust me,” Joseph reassured him.</p><p>“I’ve always trusted you,” George said.</p><p>“Well that’s because I’m much older and wiser,” Joseph said, while puffing out his chest.</p><p>“You’re exactly three minutes older, so don’t give me that, again,” George said with a laugh.</p><p>“Hey, those three minutes gave me a world of knowledge.”</p><p>“Yeah, I think it gave you a world of arrogance - just like your eldest nephew,” George said. He could feel things were going to work out. His family was at the beginning of truly mending.</p><p>“He did what?” Max yelled into the phone, causing Trenton to hold the piece away from his ear.</p><p>“He said it was time for a change so he’s moved the home offices to Seattle. We now have twenty-seven days before the official opening in Washington,” Trenton repeated.</p><p>“You have got to be kidding me. Can we stop this? He’s obviously gone insane,” Max said, but there wasn’t much oomph in his voice. They both knew there was nothing wrong with their father’s mental capabilities.</p><p>“I already checked every which way to Sunday and there’s nothing we can do. I was sorely tempted to tell call his bluff, and leave the corporation,” Trenton threatened. Max knew there was no way that would happen - just like he knew the same of his siblings.</p><p>They’d been inseparable at one time, but through their grieving over the loss of their mother they’d gone their separate ways. But, they each had a love of the corporation in common, even if they were involved in a variety of different areas. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Looks like we’re moving to the beautiful North West, then,” Max said. He was angry, but not nearly as much as his brother. He traveled so much for work that he wasn’t home enough to be very upset. Besides, he hadn’t spent time with his cousins in years and he missed them.</p><p>He’d never admit it to his father, though. The old man was getting his way, and he didn’t need to know Max wasn’t upset about it.</p><p>“Yeah, I can hardly wait,” Trenton said sarcastically.</p><p>“Have you called Bree and Austin yet?” Max asked.</p> <p>“No, I called you first and figured we could each take one of the others,” he answered.</p><p>“Sounds like a plan - I’ll call Austin,” Max quickly said with laughter in his voice.</p><p>“Gee, thanks,” Trenton replied. He knew the call to his sister, Brianna, was going to be long-winded. His sister was stubborn and independent and didn’t like to be told what to do. He smiled, though, when he thought about what she was going to say to their father. George was in for an earful as soon as Bree got off the phone with Trenton.</p><p>Trenton sat back, feeling better after talking to his brother. He and Max had been close in the past and he missed speaking with him. Trenton may not have realized it but his father’s plan was already working. It had brought the siblings closer, even if it was in uniting them against him.</p><p>Jennifer yelled at her computer screen and then looked around with guilt. She hated computers and wished they’d never been invented. They were the worst possible creation and she was ready to chuck hers out the window. She’d taken classes and spent hours on end to learn basic computer skills because it was impossible to have any kind of decent job without knowing how to run one of the blasted machines.</p> <p>The temp company she worked for had given her the position at the Anderson Corporate Offices and she’d been there for two months. It was a dream-come-true job and she hoped it would turn into a permanent position, because everyone knew employees of the Anderson’s were loyal through and through. The Anderson’s were great to their employee’s, paid better wages than other corporations, offered great benefits, and were exceptionally family friendly.</p><p>She remained seated, arguing with her computer, grateful no one came by and heard her because she was sure she sounded like an insane woman. By the time her lunch break came around she was about ready to cry. Her boss had slowly been adding more work, and she was sure it was a test, and if it was - she was failing miserably.</p><p>“Ms. Stellar, can you please go up to the top floor. The boss wants to talk to you,” a voice asked over her intercom.</p><p>“Yes, I was getting ready for lunch break so I can head right up,” she answered. Jennifer broke out in a cold sweat. She was going to lose her job, there was no other reason for her to be called up to the main offices. She’d never heard of anyone getting called up to Lucas Anderson’s office. He was the President of the company and though she saw him regularly, walking around the floors, he never called someone in her type of position to the corporate offices.</p><p>She didn’t understand why he’d fire her personally, though. Normally, the guy in charge of her division would do that. She pushed the elevator button and waited nervously. She knew the computer projects had been a test, and her failure was unacceptable. She wasn’t too proud to beg. She’d study day and night if that’s what it took, because it wasn’t only herself she had to think about.</p><p>“Are you sure she’s the one?” George asked Joseph.</p> <p>“Oh yes, I’m one hundred percent sure. I always take time to know who’s working here. Lucas took over as President years ago but I still like to handle personnel packages. I take a lot of pride knowing we offer more than other corporations. I especially check into temp employee’s to deem whether or not they’ll make a good fit for a permanent position. Jennifer is absolutely terrible when it comes to computers, but she’s incredibly bright, eager, and willing to work hard,” Joseph answered.</p><p>“How does that make her wife material, though?” George asked.</p><p>“Ah, you must let me finish,” Joseph said. “She came to us through my favorite temp agency, and I did some research on her. She lost her sister six months ago to a drunk driver, which is especially tragic because her sister and brother-in-law had a child, who is four years old. It looks as if Jennifer has no other family, as her grandparents and parents have passed away.”</p><p>“Where is the kid?”</p><p>“Jennifer has been raising her since the accident, and I’m sure it’s not easy for her. The little girl attends the on-site child care center, here,” Joseph answered.</p><p>“Oh, this could mean an instant grandchild,” George said in delight.</p><p>“I knew you’d be happy about that. She’s a spit-fire and too adorable for words. I’ve grown quite attached, since I spend a lot of time down there with her. My grandkids come in sometimes so they can play,” Joseph told him.</p><p>“Ms. Stellar is here,” the secretary told them over the intercom.</p> <p>“Send her straight in,” Joseph replied. Both men sat back and waited for Jennifer. When she opened the door they could see the fear in her face, though she was doing a great job of trying to hide it. She looked surprised to see Joseph and George there, instead of Lucas.</p><p>“Hello Mr. Anderson, they said you needed to see me.”</p><p>“Yes, thank you for coming, Ms. Stellar. Go ahead and have a seat,” Joseph told her. “This is my brother, George Anderson. He’s moving his corporate offices to Seattle and in need of a variety of new staff. One of those positions is for executive administrator to the President and we would like to know if you might be interested. There would be a significant pay raise and added benefits.”</p><p>Jennifer couldn’t believe what she was hearing. She thought she was losing her job and they weren’t only offering her a permanent position but a better one at that. She wanted to shout yes, but her conscious would never allow her to leave out her shortcomings.</p><p>“I’m honored you would think of me. Yes, I’d be more than happy to accept the position, but I have to be honest with you. I’m struggling with the computer system I’ve been using. I can type about a hundred words a minute and do all basic computer functions, but the more complicated requests are giving me trouble. Please know, I’m more than willing to spend every spare minute I have to learn, though,” she told them eagerly.</p><p>“Well, the great news is you won’t have to deal with any programs you’re currently using. You’ll be typing a lot, and attending meetings, plus there’s some travel involved,” George told her.</p><p>Jennifer got excited and then deflated, again. How could she travel? She had no one to watch Molly, and besides that, she couldn’t take off for extended periods of time and leave her behind. Molly had already lost her parents and she was only recently getting over not seeing her mom and dad.</p><p>“We know you’ve recently taken on responsibility of your niece and we’re sorry about your loss. We have excellent programs here offering child care,” Joseph said as if he could read her mind.</p><p>“How much would I have to be away?”</p><p>“On average, about three to five days a month,” George said. That wasn’t too bad, Jennifer reasoned. She’d be able to provide much better for her niece with the new position. She’d have money to buy the items she needed, as well as be able to afford to take her places, spending quality time together.</p><p>“I’ll take it,” she said with enthusiasm.</p><p>“That’s great. You’ll start next week, so for now you’ll get a little time off - paid of course,” George told her.</p><p>“Oh, I forgot to ask where the new offices are?” she questioned.</p><p>“They’re going to be here. We’ve just purchased the building next door and will connect the buildings by creating a sky-walkway. Until construction is finished, they’ll be using the twenty-second through twenty-fourth floors. You’ll be stationed on the twenty-fourth so you can still use the daycare center, here,” Joseph said.</p><p>“Oh, that’s wonderful,” Jennifer told both men and quickly made her exit.</p><p>Jennifer took the elevator down to her floor and slowly walked into her office. She looked around in wonder. She’d gone up there dreading the worst and walked away feeling better than she had in six months.</p><p>“Congratulations, Ms. Stellar. I’m happy you received a promotion,” her boss approached, sounding sincere.</p><p>“Thank you, Mr. Barry.”</p><p>“I’ve enjoyed working with you, and we will miss having you as part of our team. If you want to place your possessions in boxes and label them, I can have them delivered to your new office. You don’t have to worry about packing them home and back again,” he offered.</p><p>“That would be great, thank you.”</p><p>“No problem, when you’re finished you can take the rest of the day off. Joseph told me the position is in effect immediately and he’s already sent in for a temp,” he said before leaving.</p><p>Jennifer hadn’t brought too many personal items to work and it didn’t take long to put her belongings in boxes. She was excited to pick up her niece early. With the beautiful weather, she’d be able to surprise Molly with an afternoon at the park.</p><p>Jennifer sat on a bench, watching Molly play on the slide with a couple other kids. Molly had only just started sleeping through the night. Her poor niece had nightmares for months and Jennifer knew it was because she had abandonment issues, as any child would when their parents suddenly disappeared. Molly still had circles under her eyes, but not nearly as bad as they’d been a few months ago.</p><p>“Heads up,” someone yelled. Just as Jennifer turned in the direction of the voice, she felt a pain in her neck and looked down in amazement at the frisbee lying next to her.</p><p>She brought her hand up and was surprised to feel a bit of blood. Whoever had thrown the thing, must have really chucked it.</p><p>“I’m sorry about that. Are you okay?” a man asked. She looked up and lost her breath. Holy cow, the guy was stunning. She somehow couldn’t get any words past her closed throat. She never had trouble talking with attractive men, and she hadn’t had that gut wrenching, stop-you-in-your-tracks response to a man since she was a teenager.</p><p>His dark, short hair, was messy around his flushed cheeks. He had beads of sweat dripping off of his forehead and the most piercing blue eyes she’d ever looked into. Her gaze followed a bead of sweat to his naked chest and her heart started beating far too fast. The man had to be a model, with his defined chest, and washboard abs. His arm muscles looked as if he was flexing, though they were completely relaxed. She followed his abs to his low-riding, athletic pants before noticing her eyes had moved to an area she shouldn’t be looking at.</p><p>She jerked her head back up to look at his face again and watched as a cocky grin spread across his features in a knowing way. He stood by silently as she ogled him. She stiffened her shoulders, irritated she’d been so immediately mesmerized by him. She hated to be another typical female, who thought only looks mattered. He was most likely some really stupid jock, who thought with a different head than the one on top of his shoulders. She realized she’d never answered him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m fine - I’m just glad you didn’t hit any of the children,” she stated and turned away acting as if he wasn’t there.</p><p>Trenton stared at the back of the striking, dark-haired stranger in a bit of shock. He was certainly used to the appraising look she’d given him, but not the suddenly dismissive attitude that followed. He was also not used to the immediate attraction he felt toward her. She was not his typical type.</p><p>She couldn’t have been much over five feet in height, and her dark brown hair and stunning green eyes were the opposite of the long-legged blondes with bigger chests than brains he normally went for. He could play with them and then walk away without anyone getting hurt over it.</p><p>He never picked up a woman in the park, as they were the commitment, till-death-do-us-part type and he would never take a trip down the aisle. He should count his blessings she was clearly not interested in him, but he’d hurt her, and couldn’t leave until he knew she’d be okay.</p> <p>“Let me see your neck, okay?” he asked, as he bent next to her and moved her hair out of his way. He was relieved to only see a small cut, nothing needing stitches. He was shocked the feel of her hair was like silk and he suddenly had images of it spread out on his pillow.</p><p>Jennifer sucked in another breath as his hand touched her skin. She about jumped out of the seat at the small movement of his fingers brushing against her neck. She passed it off as being overly tired.</p><p>“I’m fine, really,” she said, needing him to remove his hands, since it was doing funny things to her stomach. She didn’t have time for a man in her life, but if she did it wouldn’t be with a man like the guy before her. It would be with a regular king of guy who didn’t stop women in their tracks.</p><p>“Wow, Trenton, you’re only in town for a day and you’re already attacking unsuspecting women,” another guy said as he jogged up to them. Jennifer glanced at him and then her head whipped back around as she realized it was Lucas Anderson. She’d never seen him wearing anything but an expensive, tailored suit, and she could see why his wife was head-over-heels for him. Lucas was stunning, but while the man, Trenton, she guessed, made her stomach stir, Lucas did nothing physical for her. She figured it was because she knew he was married - plus she’d met his wife, who was a really sweet woman.</p><p>“Well, you know how it is, any excuse to meet a sexy lady,” Trenton answered and Jennifer felt her mouth drop open. No one ever referred to her as sexy, and she hated to admit his words made her glow a bit.</p> <p>“You look familiar, and before you think that’s some cheesy line, it’s not. You really do look familiar,” Lucas said. She had to clear her throat before she was able to speak clearly.</p><p>“I work for you, Mr. Anderson, or well I did until my promotion today. My name is Jennifer,” she finally responded.</p><p>“That’s right, I’m sorry. I’m so used to seeing everyone in the offices that out in a park setting throws me off,” he told her with a heart-stopping grin.</p><p>“No problem, it took me a moment to recognize you, as well,” she said with a genuine smile. He was an easy man to talk to, making her feel comfortable, unlike his companion.</p><p>“Hey, quit flirting - you’re a married man,” Trenton growled at Lucas. Jennifer felt her face flame in embarrassment.</p><p>“I...I wasn’t flirting. I think your wife is wonderful,” she stammered and sent a glare toward Trenton.</p> <p>“Ignore him, Jennifer. He’s just jealous because you obviously have better taste than to talk to an ogre like him,” Lucas said with the same friendly smile. She was thankful for his words, because her embarrassment eased.</p><p>“Whatever, Lucas. You’re lucky you’re a married man, or I’d prove to you later all the ladies wouldn’t even know you existed when we walked into a room together,” Trenton said.</p><p>Jennifer watched the two of them rib each other and knew beyond a shadow of a doubt all the women in any room would be tripping over themselves to get to either of them. She was grateful she was too busy for relationships or she may have stood in line with them.</p><p>“I am sorry about hitting you with the Frisbee. Why don’t you give me your number so I can call and make sure you’re okay, later,” Trenton said with the most seductive smile she’d ever witnessed. She had to call on some will-power to deny him.</p><p>“I’ll be fine, I promise. I’ve to leave, so you both have a great time,” she said, blowing him off. She got up and walked to the other side of the playground, collected her niece, and quickly departed. She was angry with the heat she felt in her cheeks, and the way he’d made her stomach quiver. She had zero time for men and though a part of her wished she could’ve flirted back, she knew she’d done the right thing. Besides, she’d never see him again, anyway.</p><p>Trenton watched her walk away in a bit of shock. He’d never before been turned down by a female. He wasn’t sure he liked the feeling. He usually had women stuffing their numbers in any available pocket he had, and yet the little spit-fire of a woman he found both breathtaking and irritating at the same time, completely ignored him and walked away without so much as a backward glance.</p><p>“Oh, you just got burned badly, Cousin. I guess Seattle women have better taste than those in Chicago.”</p><p>“She has me intrigued. I’d have to chase her down, but luckily she works for your company so I’ll be able to find her,” Trenton said, relishing her reaction when he did come in contact with her again.</p> <p>“She said she was promoted and no longer worked for me. Heck, we didn’t get her last name to even be able to find her,” Lucas said.</p><p>“Oh, I’ll find her alright. It’s been a long time since a woman has peaked my interest like that,” Trenton said. Lucas looked at his cousin with a huge grin. He knew that look well, as he and his brothers had all fought tooth and nail to hold onto their bachelorhood, only to end up chasing down their wives. His cousin was on the prowl, and Lucas almost felt sympathy for the mysterious Jennifer.</p><p>“Okay, well enough mooning over the girl, we’re supposed to be having fun. You have to be back to work soon enough and we haven’t spent nearly enough time together the last several years,” Lucas told him. Trenton agreed, and they got back into their game. But the mysterious Jennifer stayed on his mind and Lucas kicked his butt all over the field. He was grateful when his brother Max showed up to help him out.</p><p>Chapter Two</p><p>Jennifer was filled with nervous excitement as she rode the elevator to the twenty-fourth floor. She had loved the week off with her niece. It had been good for both of them. Molly was finally figuring out Jennifer wasn’t going to leave her. They had looked through family albums for the first time since her mom and dad passed, and Molly looked at them with smiles, instead of tears.</p><p>They were making good progress and Jennifer knew before long they’d help each other heal. She’d forever miss her sister, just as she knew Molly would miss her mom, but the two of them had each other and that was their new focus. It was something giving them hope. Family was the most important thing, and as long as they could stay together, everything would work out.</p><p>The bell on the elevator chimed and she stepped onto the unfamiliar floor. She approached the reception desk, looking around in awe. She would’ve thought there’d be boxes everywhere, but it looked as if the area had been set up for years.</p><p>“Hello, I’m Jennifer Stellar, the new executive assistant for Mr. Anderson. I’m not sure where my office is,” she said to the lady behind the desk.</p><p>“It’s so nice to finally meet you, Jennifer. I hope you don’t mind me calling you by your first name. Our boss has always allowed us to be somewhat informal. My name is Nancy, and I came with Mr. Anderson from Chicago. Let me show you to your office,” the woman said.</p><p>“Informal is always good, so I don’t mind. It’s very nice to meet you, too, Nancy,” Jennifer said. Nancy led her around the corner and opened a door. Jennifer loved the space. “It’s beautiful,” she sighed.</p><p>“If you need to make any changes, I’m sure Mr. Anderson would be fine with that. He likes his employees to be comfortable, as we’re all here a lot,” Nancy told her.</p><p>“This is a lovely office. I’m sure I won’t need to change a thing.”</p><p>“I’ll leave you to get settled in. Let’s do lunch together later this week to get better acquainted,” Nancy said, and with Jennifer’s encouraging nod, she left.</p><p>Jennifer walked around the large room and over to the enormous windows to look at the view. It was breathtaking and she was delighted at the sight of the famous Space Needle building. She finally pulled herself away from the view, and sat. Her seat was plush, and it molded to the contours of her body, applying pressure where needed. A giggle escaped before she could stop it. She grinned and spun her chair in a circle, letting out her inner child.</p><p>Trenton walked through the connecting doors to the sound of a giggle, then stopped in his tracks. Spinning in a chair, only a few feet from him was the girl from the park. Her face was lit up with joy and she was so stunning he had to fight the urge not to yank her from the chair and crush his lips on hers.</p><p>He was glad she hadn’t yet noticed him. It gave him time to control his features. Once he had himself under control he cleared his throat to alert her of his presence, then waited until she turned. He was thinking this was going to be quite entertaining.</p><p>Jennifer turned at the sound and stared in horror. Her feet were still off the ground and her chair spun around again, before she managed to pull herself together enough to put her feet down and stop the spinning chair. She stared at the man before her, not knowing what to say. What was he doing in her doorway?</p><p>Her mouth dropped open as she started putting two and two together. He’d been at the park with Lucas Anderson and they had similar features. They must be related in some way. Did he work for the company? Was she going to have to see him on a daily basis?</p><p>“Wh...what are you doing here?” she asked, not really wanting to hear his answer.</p><p>“I’m at work, and what are you doing here?” he returned.</p><p>“I...I just started today,” she stuttered. She wanted to know where he worked, but didn’t think she’d be able to get the words out.</p><p>“And what is your position?” he asked with a smile.</p><p>“I’m the executive assistant for the president,” she stated with a confident smile. She was feeling better now that the shock was wearing off. Her words came out as a challenge. She was proud of her new position.</p><p>“Really, and have you met him, yet?” he asked, trying to sound surprised, like she was getting one over on him.</p><p>“Yes, at the interview. George Anderson is an amazing man, and I’m proud and excited to be working for him,” she said. She’d instantly liked both George and Joseph Anderson. She’d always been comfortable with older people, as they seemed much less judgmental.</p><p>“George isn’t the president,” he stated, popping her bubble. Her brows puckered and she looked at him like he was insane. He had to be trying to deceive her. George was the one who had interviewed her. She tried to remember her interview, word for word, but she couldn’t remember him actually saying he was the president. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Of course he is,” she said, but not as confident.</p><p>“Believe me, I know he isn’t. He retired years ago, and though he’s still the majority owner in the corporation, he’s more of a silent partner, dealing more with personnel situations and behind the scenes issues,” he told her.</p><p>Trenton found he was enjoying her confusion, and watched as she tried to work out what he was saying. She still hadn’t put all the pieces together. He was thrilled to find the spitfire from the park was his assistant. He found himself glad to be in Seattle. He was with his cousins, who he loved, he’d spoken with his siblings more over the last month than in the last several years, and he was intrigued by a woman. Things were looking up for him.</p><p>“Well, then who am I working for?” she asked, perplexed. He walked over and leaned against her desk, giving her a confident look. He raised his brows and waited for it to sink in. “That can’t be,” she barely managed to whisper when it started to sink it. He answered her with a huge Cheshire cat smile and watched as her eyes widened and her face paled. He was worried for a moment she may faint.</p> <p>He had to hand it to her, though, because she pulled herself together quickly, and much to his relief, her color returned. Her expression changed from shock to defiance and he had to fight back his smile. He found she was going to be a challenge and he’d never been able to resist a challenge.</p><p>“I guess I should formally introduce myself, Jennifer. I’m Trenton Anderson, President of Anderson United Corporation,” he said, as he held out his hand. He was curious to see if she’d take it, or shy away. He hadn’t seen her back down yet, and found he’d be disappointed if she did.</p><p>“Nice to officially meet you, Mr. Anderson. As you know, I’m Jennifer Stellar, and I’m looking forward to working here,” she said as she took his hand. She felt the electricity from his touch shoot up her arm, and hoped he didn’t notice the shiver traveling through her body. She’d have to get control over herself because there was no way she’d allow herself to be attracted to her boss.</p><p>“We’re not formal in the executive offices. You may call me Trenton,” he said, holding her hand for too long to be considered appropriate.</p><p>“I prefer to keep things at work completely professional, Mr. Anderson,” she said, pulling her hand from his and breaking eye contact. Trenton was determined to break her defenses down, but he had plenty of time to do it.</p> <p>“That’ll be fine for now, but you’ll become more comfortable,” he said, knowingly. Jennifer stepped away. She needed to put some distance between them, and pull herself together.</p><p>“I’m perfectly comfortable, but I prefer to keep things at work professional. That way, no lines are crossed that shouldn’t be,” she said a bit haughtily. He looked amused by her prim and proper manner.</p><p>“Are you always so argumentative? It may not work well for you when you aren’t trying to please your boss,” he told her with an almost wicked smile. She sucked in her breath at his veiled threat, before she narrowed her eyes. She wasn’t a weak woman and if he thought he could make her shake in fear, or cave to his arrogant demands, he had a whole new thing coming.</p><p>“Believe me, I’ve never had any trouble making my previous bosses happy,” she said, with just enough of a double meaning to make his eyes narrow. She turned away from him for a moment to hide her expression. Let him think what he wanted about that statement.</p><p>Trenton stood in stunned silence. He couldn’t tell if she was bluffing or not, but she may not be the innocent girl he’d first thought her to be. If she was a woman of the world, then he could take her guilt free. That idea didn’t please him like it should’ve.</p><p>“Well, Jennifer, I’m certainly not feeling too satisfied right now,” Trenton finally told her. She looked at him in shock for a few moments. She was surprised he would call her bluff. She wasn’t willing to play the game with him, anymore.</p> <p>“We should get to work,” she finally told him. He raised his brows at her, again. “I just don’t want to waste the corporation’s time by sitting around, doing nothing,” she said as if talking to him was a complete waste of her time.</p><p>“Of course, you’re right,” he told her and his tone was all business. She was surprised by the complete change to his voice. He went from warm and flirty, to cold businessman in a matter of seconds. She was grateful he’d finally taken the hint and backed off, but felt a bit of loss at the same time. She was beginning to not understand herself.</p><p>The rest of the afternoon Trenton was completely professional, and Jennifer got so caught up in her work that the time flew by. She was surprised when Nancy came into her office and told her their day was over. She gathered up her things quickly, and went down the elevator with Nancy, before she headed to the childcare center. Molly’s face lit up when she walked in the room, which filled her heart with joy.</p><p>“Did you have fun, today?” Jennifer asked.</p><p>“Yes, Tassia and Katie were here and I love playing with them. We had a tea party with real tea and chocolates and we even got to wear pretty hats,” Molly said to her in a rush of words.</p><p>“That sounds great, Molly. I’m glad you had fun playing with your friends,” she told her, happy her niece was showing signs of happiness, again. It had been too long since Molly had allowed herself to be happy and no four year old should be depressed.</p><p>“Excuse me, you must be Jennifer?” someone asked before she exited the building.</p><p>“Yes, how can I help you?”</p> <p>“My name is Emily Anderson, and our girls have become quite close over the past few months. Tassia is having a birthday party this weekend, and I’d like to invite Molly over for a sleepover. I’d love to have you come, as well, and stay for the activities so you can know where she is, but we really would love to have her over,” Emily said.</p><p>Jennifer’s first reaction was to say no. Molly hadn’t stayed the night with anyone since the accident and she wanted to keep holding her tightly, but she also knew she’d have to be gone for a few days at a time with her new position, and it would be a good idea to see how Molly would do away from home for one night.</p><p>“I’d love to bring her over for the party, but we’ll wait and see about her staying the night,” Jennifer agreed.</p><p>“I’m glad to hear that, I can’t wait until the weekend,” Emily said.</p><p>“If you want to give me directions to your place, and what time, we’ll be there.”</p><p>The two women exchanged phone numbers and addresses and then Jennifer left the building, feeling good about her day. It had started out a bit rocky, finding out her boss was the far-too-sexy-for-her-comfort man in the park, but she’d have to get over her attraction, because it couldn’t lead anywhere.</p><p>Relationships, or even casual sex, came and went, but a good job and friendships were rare to find and you didn’t let those go. Sleeping with her boss, no matter how devastatingly gorgeous he was, would be a huge mistake she’d regret the rest of her life.</p><p>“Are you ready to head home, little girl?” she asked Molly, while tickling her tummy.</p><p>“Yes, can we have pizza for dinner?” Molly asked between giggles.</p><p>“I would say tonight is a perfect night for pizza. It’s been a day worth celebrating,” she told Molly, which earned her many kisses and smiles. She walked toward her car with a smile on her face and a dance in her step.</p><p>Trenton wasn’t in nearly as good a mood as Jennifer. He’d forced himself to stay away from her most of the day. He was both thrilled to have found her so soon and to have her working for him, yet at the same time thinking the fates weren’t on his side.</p><p>He knew there was no way he was going to be able to keep his hands off her. He was far to attracted to the delicate woman. He couldn’t remember wanting to take a woman into his arms so badly, and her attitude was a challenge he didn’t want to resist. He hadn’t been challenged by a woman, ever.</p><p>He should transfer her to another division so he could pursue her guilt free, but he wanted her close to him. He was unwilling to transfer her, at least for the moment. He wasn’t a teenager, who couldn’t control himself and he wouldn’t make her do anything she didn’t want to, but he wasn’t above seduction. He smiled at the thought.</p><p>“You’re obviously a million miles away, boy,” his father said, startling him out of his thoughts. He turned in surprise at the interruption. No one was ever able to sneak up on him, and he hadn’t noticed his father entering his office.</p><p>“Hello, Father - what are you doing here?” he asked, managing to control his features and tone.</p><p>“I wanted to see how you’re settling in,” George said. Trenton didn’t miss the look of hurt in his father’s eyes. He tried to block it out, but still felt guilty for being so disrespectful.</p><p>“I’d much rather be in Chicago, but it’s efficient.”</p><p>“I know you’ll appreciate the move before too long. It will be nice for you and your siblings to be around your cousins, again.”</p><p>“There won’t be a lot of time for socializing, as moving a corporation home office takes a lot of work,” Trenton said, not wanting to make things easy on his father.</p><p>“There’s always time for family. I messed up after your mother passed, and I’m trying to make it right,” George said, being honest with his son. “Can we please let go of the hard feelings?”</p><p>“A lot has happened,” Trenton said but not so sure in the face of his father’s grief.</p><p>“I know, and I’m sorry I fell apart. I loved your mother so much and it ripped me apart to lose her. I know I closed all of you out, but I’m trying to make it right. I hope you’ll forgive an old man for being heartbroken. I’ll leave you alone for now, but wanted to tell you your cousin Mark’s having a birthday party for his daughter this weekend. I’d love to see you there,” George said. He patted Trenton on the back, then headed out the door.</p><p>Trenton looked out the window and inhaled. He’d been too hard on his father and maybe it was time for a second chance for all of them. He’d have to give it time, and see how it worked out. His father used to be his hero. He realized he blamed his dad for his mom’s death. He knew logically his dad couldn’t have prevented the death from happening, but his heart had hurt so badly he’d needed someone to blame.</p><p>He was also realizing he couldn’t continue to punish his father for something out of his control. Seeing the pain in his dad’s eyes hurt him. Trenton shook his head, trying to clear the depressing thoughts.</p><p>He gathered his belongings and headed out. He wasn’t in the mood to be alone so he called his brother, who luckily was in town, and they met for a beer and some talking. It lifted his spirits up.</p><p>“How are you settling in the rainy city of Seattle?” Max asked.</p><p>“It’s not as bad as I thought it would be, but there’s no way I’m admitting that to the old man,” Trenton said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Am I detecting you’ve already met some local ladies?” Max teased him with a waggle of his brows.</p><p>“Well, there’s a smorgasbord of women to be feasted upon,” he said, but his mind was only on one particular woman.</p><p>“Yeah, but I sure wish our father would’ve gotten the idea to move somewhere warm like California or Florida. The women wear far less clothes there,” Max said with a laugh.</p><p>“I agree,” Trenton said, but without his usual emphasis. He was starting to feel empty escorting different women every night. He was thinking a longer relationship may be interesting, especially if the woman didn’t bore him. He had a feeling Jennifer wasn’t boring.</p> <p>“Where did you go?” Max asked.</p><p>“Sorry, it was a long day at the office. When are you taking off?”</p><p>“I need to go up to Alaska next month. I’ll be up there off and on over the next year. We finished that facility and you know I like to check on things first hand. Seattle feels like the freaking tropics compared to the weather up there.”</p><p>“You can always make snow angels,” Trenton laughed.</p><p>“No thank you, not when it’s like fifty degrees below freezing on the average day. I’m amazed at how many people actually want to spend months on end up there,” Max said.</p> <p>“You know how scientists are, they don’t need another person around, just a microscope,” Trenton said.</p><p>“Hey, I majored in biology for my bachelor’s so no need to be dissing. Besides, you know the smart girls tend to repress a lot, and when they let go, they really let go,” Max said with a leer.</p><p>“Sounds as if you may have intimate knowledge of that,” Trenton teased.</p><p>“I’m stuck in some pretty remote locations at times,” Max said.</p><p>The two of them continued to banter about their choice in companions, and without even realizing they were doing it, reverted back to the easy camaraderie of years ago.</p><p>Chapter Three</p> <p>Jennifer pulled up to the large home, feeling awed. It was quite a ways outside of the Seattle city limits and she’d almost got lost a few times on her drive. Coming down the long driveway, she almost turned around, thinking she had to have taken a wrong turn.</p><p>She finally made it to the home and sat in her car, feeling intimidated. Her little Honda, which was a perfectly good car, seemed like it was completely out of place when surrounded by the other luxury vehicles.</p><p>Molly was bouncing in her seat, waiting for Jennifer to get her out of the car. Her niece’s shout finally snapped her out of her stunned silence and she slowly climbed from the vehicle. She shook off her nervousness, feeling ridiculous for being intimidated.</p><p>“Auntie, I want out,” her niece shouted, losing patience at being stuck in her booster seat for so long.</p><p>“I’m sorry, baby,” she offered and quickly unstrapped her. Molly tried to take off up the stairs, but Jennifer grabbed ahold of her hand and walked slowly to the top of the steps and rang the doorbell.</p><p>“Good afternoon,” a woman said. “You must be here for the party, go straight through the house and out the back door.”</p><p>“Thank you,” Jennifer replied and had to jog to keep up with Molly as she took off in the direction of the back yard.</p><p>“You made it. I’m so glad,” Emily said, as they stepped through the doorway.</p> <p>“Thank you for inviting us,” Jennifer told her.</p><p>“I adore Molly, she’s a great kid. I forgot to tell you to bring a swim suit for her but we have plenty of extra swim attire. If you don’t mind, she can get changed with Tassia and get in the pool with the other kids,” Emily said.</p><p>“That sounds great. Do you have extra life jackets?”</p><p>“Yes, of course we do - also the guys are taking turns, two at a time, being life-guards so there isn’t any chance the kids can get hurt,” Emily reassured her. “I have extra swimsuits for adults, too, so why don’t you change as well. It’s a very rare, warm day, and if you don’t want to brave the pool with the kids, you can enjoy the hot tub.”</p><p>“Thank you, that sounds nice,” Jennifer said. She quickly changed and it didn’t take long for her to start enjoying the party. She’d never before met such a wealthy family who were so down to earth.</p><p>“I hope you’re enjoying yourself,” George said as she sat down to eat something.</p><p>“I’m having a wonderful time. I can’t believe how many people are here,” she told him.</p><p>“I’ve missed being here. Family is so important. I lost my wife a few years ago, and disappeared for a while, but it feels good to be home, again,” he told her.</p><p>“I’m sorry about your loss. I didn’t know,” Jennifer told him, feeling empathy.</p><p>“It’s been several years, and while I’ll always miss her, I’m moving on now, but thank you. How’s the job treating you?”</p><p>“It’s wonderful. I keep so busy during each day that it’s time to leave before I know it. I don’t like jobs where you sit around, watching the clock.”</p><p>“Well, that’s great. I know you’ll continue to do well. I’m going to hunt down some food and find my brother, now,” he said before squeezing through the crowd.</p><p>Jennifer visited with several people and then got too warm and decided to take a swim. She dove into the water and came up against what felt like a brick wall. It knocked the breath out of her, and she would’ve sunk back into the water if strong arms hadn’t grasped her and pulled her up.</p><p>“Thank you,” she choked. She realized she was staring at a very sexy male chest. It was hard, defined, and had water dripping down it, and she was afraid she recognized it. Her eyes slowly traveled up the tanned skin until they reached the eyes of her boss. Seeing his incredible body was one thing, but touching it wasn’t good for her blood pressure.</p><p>She felt a tightening in her stomach, unlike anything she’d ever experienced before, and there was an instant ache in her very core. She realized she was in lust with Trenton. She was motionless for a few moments as she watched his eyes dilate and his head start bending forward. She came to her senses just in time and pushed against him. She couldn’t kiss her boss, especially in front of his entire family, in a swimming pool, where her body was barely covered.</p><p>His eyes narrowed at her rejection, and then she watched, fascinated, as he seemed to put shutters in place, not allowing a single thought to show in his expression.</p><p>“It looks as if you’re enjoying yourself, Jennifer,” he said, and the sound of his rough voice sent a shiver down her spine.</p><p>“It’s Ms. Stellar, and I am, thank you,” she corrected him before swimming away. She couldn’t stare at his body any longer - it was sending her own into overdrive.</p><p>He quickly caught up with her and pulled her back into his arms. She gasped at him, but couldn’t seem to pull her gaze away. She was losing an internal battle to keep fighting the attraction to him.</p><p>“You’re at a family gathering, don’t you think the formality’s a little excessive,” he growled.</p><p>“No, I don’t, Mr. Anderson,” she emphasized. “Now, if you’ll release me, I was getting ready to get out of the pool.” They glared at each other for several moments, while Jennifer held her breath. She was afraid of her own reaction if he were to actually kiss her, because what he did to her body with a simple touch, or look, was enough to start boiling the water around her. She couldn’t imagine what would happen if their lips actually connected.</p><p>“I will for now, but eventually you’ll quit running from me. There’s obviously something between us, and I’m very interested in exploring it.” He released her and she swam a few feet away to the ladder. Her distance made her feel much braver, so she turned and gave him a dismissive glance.</p><p>“I have no idea what you’re talking about, because you’re not my type. Now, I’d appreciate it if you would keep your hands and thoughts to yourself,” she said. His eyes narrowed and he lunged toward her. Jennifer didn’t stick around for him to call her bluff. She quickly jumped from the pool, grabbed a towel, and found a group of people to hide among.</p><p>“I know you’re a guest here, but would you mind helping me with some snacks for the kids. It’s almost time for their movie marathon?” Emily asked.</p><p>“I’d love to help you,” Jennifer told her eagerly. She’d do anything to avoid running into Trenton again, because the man was too lethal for her own good. The women walked into the kitchen, where two ladies were already working.</p><p>“Jennifer, these are my sisters-in-law, Amy and Jessica, and girls, this is Jennifer. She’s working for Trenton,” Emily introduced everyone.</p><p>“I’ve seen you in the offices before. It’s great to officially meet you,” Amy said with warmth.</p><p>“You too, this party has been amazing. I’ve barely even seen Molly, she’s having such a great time,” Jennifer replied.</p><p>“Trust me, she won’t even know you exist as long as all the kids are playing together. They tend to have too much fun together,” Jessica said with a warm smile. The four women spent an hour preparing a myriad of goodies for the kids and getting it set up in the den.</p><p>“Well, I guess I’ll go ahead and leave now,” Jennifer said. Molly was more than happy to stay over and there was no need for her to hang around any longer.</p><p>“Oh, you can’t leave yet. Now that the kids are settled down, it’s time for grown-up fun. My husband just lit a bonfire and we have drinks and snacks set out,” Emily said. She didn’t give Jennifer a chance to protest, she just grabbed her arm and led her outside.</p><p>It was just starting to get dark and she noticed several people had departed while they were in the house. There was still a large group of people around, but not nearly what it had been earlier. She didn’t spot Trenton anywhere. She was both relieved and, yet, disappointed. She knew she couldn’t get involved with him, but she couldn’t deny he made her feel things no one else had ever made her feel.</p><p>Trenton watched as Jennifer came back out of the house and he let out the breath he hadn’t realized he was holding. He was determined to get her alone that evening, and was grateful she hadn’t gone home. She wasn’t going to throw down a challenge and then run away, without giving him a chance to respond to it.</p><p>When women constantly threw themselves at you, it was refreshing to finally be the one to do the chasing. He slowly took a swig of his beer and watched the women get situated by the fire.</p><p>The party had thinned out, and it was mainly just family left. With the children in the house, the dark setting was intimate and perfect for seduction. He started to slowly make his way toward the group, satisfied there was an empty space next to Jennifer.</p><p>“Where have you been, Trenton? We thought you’d snuck out,” Mark said as Trenton sat. He noticed Jennifer’s body instantly tense, and had to fight down the urge to scoot even closer to her.</p><p>“I went for a walk, and checked out some of your horses, they’re beautiful,” he replied. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Mark beamed with pride. He loved his horses, and anyone who complimented them ended up number one in his book. As the family continued to visit and laugh together, Trenton was relieved that Jennifer started to relax. Each time she innocently brushed against him was like fire through his veins.</p><p>As the night continued, he figured out why she was relaxing, and he groaned in frustration. She’d consumed too much alcohol, and there was no way he could do anything with her in that state. He wanted her fully aware of what they were doing the first time he took her to his bed and not have it blamed on either of them being drunk.</p><p>“I’m having such a great time with you all, but I’m exhausted. I’m going to call it a night,” Jennifer said, trying to hide the huge yawn.</p><p>“Thank you for coming over. We have a full morning of activities planned so don’t worry about getting Molly until early evening, tomorrow,” Mark said.</p> <p>Jennifer stood up and was surprised by the unsteadiness in her legs. She hadn’t realized she’d consumed so much alcohol. The only thing that saved her from falling over was an arm, which snaked around her waist. She looked up at Trenton and tried to pull away, but he wasn’t budging.</p><p>She liked the feel of his arm around her, and suddenly grinned at him with a blinding smile. She watched in fascination, as his eyes narrowed and he sucked in a deep breath.</p><p>“Don’t tempt me, woman. I’m doing the right thing,” he muttered while leading her around the side of the house. It was so dark, she was grateful to have him guiding her.</p><p>“I’m really tired,” she said with a huge yawn.</p><p>“I’ll get you home and then bring you back out here tomorrow for your car,” he told her. She was buzzed enough she didn’t even think to argue. She simply followed him, in what seemed like an endless walk and then let him help her into the car.</p> <p>He quickly came around to his side and before she knew it they were driving down the road. She couldn’t keep her eyes off her boss. The man was even sexier in the glow from the dashboard light, even though she tried not to notice.</p><p>“You smell so good,” she purred. Trenton glanced away from the road to stare at her in shock. The look on his face made her giggle and it took her several moments to stop. “Well, you do,” she finally managed to get past her trembling lips.</p><p>Trenton’s gut was clenching with the amount of control it was taking to keep his hands to himself. He wanted the woman, badly, and she was his for the taking. He was really damning his scruples at the moment, as the hem on her skirt slid indecently high on her luscious white thighs.</p><p>His pants were extremely tight, and his heart was pounding. She may have said he smelled good, but in the small space of his car her scent was driving him insane. He didn’t know how he managed to keep the vehicle on the road.</p><p>“I think about sex a lot since meeting you,” she slurred. The car actually swerved before he got it back under control. He turned his head and glared at her, which sent her into another bout of giggles. He pressed his foot down on the gas, needing to get out of the vehicle before he did something really stupid, like pulling over and taking her right there, on the side of the road.</p><p>“You’re very lucky I’m an honorable man,” he growled. He finally made it to his place and started having second thoughts. He didn’t want to leave her alone at her place in her current condition, but he was going to have a hell of a time sleeping, knowing she was under his roof.</p> <p>He climbed out of his car and came around to the passenger side, then groaned as he realized she was passed out cold. He looked skyward, praying for the strength he was going to need to make it through the next few hours.</p><p>“Jennifer, we’re here, wake up,” he said while shaking her shoulders. She didn’t budge. He tried again before giving up. He reached in and pulled her into his arms. She weighed hardly anything at all. As soon as he pulled her against his chest, she snuggled in deeper and sighed.</p><p>Trenton literally shook with the restraint it was taking him to not throw her on his bed and take her. Sweat was beading on his forehead, and neck and his teeth were clenched tight. He tried not to breathe in her scent, but couldn’t avoid it. The feel and smell of her was making him hard and he had a difficult time walking up the stairs.</p><p>He laid her on the bed and she still didn’t budge. He took off her shoes and knew that was as far as his endurance would allow him to go. He wasn’t even attempting to take any of her clothes off.</p><p>Trenton watched Jennifer for a few moments, admiring how beautiful she was, especially with her guard down. She snuggled deeper into his bed and he groaned. The sight of her silken hair spread out on his pillow was making him reconsider his reasons for walking away. With a sigh, he turned and walked out. He headed straight for the bathroom and climbed in the shower. He stayed in there until the water was an icy deluge, causing his lips to turn blue. Then he crawled out, shaking all over, and quickly threw on some sweats.</p><p>He walked back into his room, telling himself he should find another place to sleep, but she was so tempting, lying in his bed. He knew they couldn’t make love in her current condition, but there was nothing wrong with feeling her body pressed against his. If he could get past the hardening of his body, then maybe he’d actually sleep.</p><p>He climbed in next to Jennifer and then groaned as she immediately sought him out. She turned into him, wrapping her leg over his and flinging her arm around his waist, only inches away from his straining erection.</p><p>Her head was pressed into his shoulder and he could feel her hot breath on his naked skin. He knew he should’ve worn a shirt, but hell, he’d put on sweats, when he normally slept in the nude. As it was, the sweats felt like sandpaper against his straining member.</p> <p>Jennifer sighed in her sleep and wiggled a little closer before she finally settled down. Trenton was afraid to move an inch. He wanted to flip her over so badly it was making his entire body break out in a sweat, even after the frigid shower.</p><p>After about fifteen minutes of lying next to her, he finally relaxed and felt his eyes grow heavy. Her body heat was rushing through him and the feel of her pressed against him was more pleasurable than he’d ever admit. He wrapped his arm around her and finally let go.</p><p>Jennifer was having the best dream of her life. She hoped she didn’t wake. Her life had been filled with so much stress and she deserved to be selfish for a little while. In her dream, she was with Trenton and he was everything she’d imagined, and more.</p><p>“You’re so beautiful. I can’t resist you,” he whispers to her.</p><p>“Yes, please,” she begs him. His hands come around her body and she feels her shirt being removed. The cool air touches her aching breasts and her dark pink nipples tighten to hardened peaks. She needs him to touch her there, to relieve the aching.</p><p>Finally, his hands come up to cup her breasts, his thumbs rubbing over the aching peaks, and she moans out loud at the exquisite pleasure. She arches her back into the air, pushing herself up, higher against him. She needs more but can’t figure out what that is.</p><p>He presses his hips against hers and she can feel the length of his erection pressing against her aching core. Her only thought is that there are too many clothes between them. She needs to feel them pressed together, skin against skin, with nothing between them.</p><p>“Please, Trenton, please,” she begs again. She needs him so much she feels she’ll die if he doesn’t hurry and take her. She can be wanton all she wants, it’s a dream after all. She’s had several dreams about her boss, but none have seemed so real. It feels as if his hands are all over her body.</p><p>“I can’t stop,” he growls, which makes her smile. She in no way wants him to stop doing anything. She feels as if she’ll fall apart right there in her dream if he pulls away. She feels him peeling the last of their clothes away, the final barriers keeping his skin from hers. She groans loudly as she finally feels his naked body pressing into hers.</p><p>“Now, I need you now,” she groans. He’s lying on top of her and she can feel his erection pressing against her wet heat. She’s so hot for him and wants him inside of her. His hands are gripping her head, and finally he brings his mouth to hers.</p><p>He kisses her so deeply, she doesn’t know how the sheets don’t catch flame underneath them. She can’t ever remember having such a vivid dream. She feels so alive, so good. She needs him inside of her.</p><p>He moves his head down her throat and chest and then takes one of her aching buds into his mouth, gently sucking on it. The pull of his mouth on her sensitive peak, sends a shock wave down her body, straight to her slick heat. More, she wants more.</p><p>As if he can sense her urgency, he moves back up her body and takes her mouth once more. He reaches his hand down and slips a finger inside her body, feeling that she is more than prepared for his entrance. He groans into her mouth at the warmth and wetness coming from her.</p><p>“Open your eyes. I want to look into them when I take you,” he gasps as the head of his erection is poised at her entrance. She feels pain as she waits for him to thrust forward. He’s so close, yet much too far away. She didn’t want to open her eyes. If she opened them then the dream would end and she’d wake up, aching and alone. She shakes her head no and pulls him closer locking their lips together, again. He’s unable to resist her urgency and in one thrust he’s buried deep inside her body.</p><p>Jennifer’s eyes snapped open at the shock of their bodies connected. Several things happened in the next seconds. She couldn’t stop what was happening, even if she could’ve gained the will power to do so.</p><p>First and foremost she knew she wasn’t dreaming, but actually making love to Trenton, the man she’d hungered for from the moment she’d first laid eyes on him, and secondly she was making love for the first time, ever, and it hurt enough to wake her. The pain was fading as pleasure quickly took its place.</p><p>Trenton could feel the tightness in her body and felt the flinch of pain from her as his large erection broke through her barrier. He was ashamed he could be so stupid and careless. She was gripping him tightly and though he may actually die he knew he had to pull out of her. He was wrong, so very wrong, for taking her that way and he had to make it up to her.</p><p>He started to pull back, when she suddenly gripped him hard with her arms and wrapped her legs around his back. She arched her hips and wiggled underneath him. He knew he’d go straight to hell, but he couldn’t find it in him to care.</p><p>He started moving his hips slowly in and out of her body, taking his time, feeling her stretch to accommodate him. His body was quivering from the amount of control it took to slowly slide along her slick passage. She was so tight, wet, and hot, and she fit around him like a glove. Her wetness made them easily slide together, like they’d been created solely for each other.</p><p>She cried out as he pushed deeply inside her, their bodies pressed together, tightly. He looked into her eyes, rounded in pleasure. The sight of her pink lips, moist and barely parted, sent tremors through his gut. Her peaked nipples were rubbing against his chest, the friction making him shake. She was stunning, and she was completely his, as no other man could claim. He moved his head down, and swiped his tongue along her lower lip, loving her sweet taste. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She pulled on his neck, bringing him closer, turning the kiss from slow and sensual, to hot and passionate. He lost his last bit of control, and gripped her hips, tightly.</p><p>He started thrusting in and out of her, fast. He gripped her hip with one hand, keeping her tightly against him. He used his other hand to hold her neck so he could continue to kiss her long and deep, with no risk of them separating.</p><p>He pounded in and out of her soft flesh, needing her more than he’d ever needed any woman. She suddenly threw her head back, ripping their lips apart, as her entire body tensed against him. She cried out, as sweat beaded from her brow. He felt her soft core grip him in convulsions and he completely lost his mind.</p><p>He slammed into her a few more times and let out his own cry as an earth shattering release shook him from head to toe. He pumped into her tight body, thinking there would never be an end to the pleasure.</p><p>They both slumped into the bed as the orgasms finally dwindled. He was so exhausted, from the intense love-making, he barely had the energy to roll off the top of her. He managed to do so and pulled her into his arms. He quickly fell back into a deep sleep.</p><p>Jennifer knew she should disentangle herself from Trenton. She knew what they’d done was wrong. She just couldn’t figure out exactly why. She was so tired she couldn’t keep her eyes open. She decided to rest them for a few moments and then she’d get up and figure out exactly where she was.</p><p>Chapter Four</p><p>Jennifer woke up and couldn’t move. She was in a panic for a moment, wondering what could possibly be pinning her down. She slowly opened her eyes and found herself staring straight at Trenton, who was eyeing her with a huge smile.</p><p>“Good morning,” he sexily mumbled.</p><p>“What’s going on?” she asked, trying to pull free.</p><p>“We’re waking up after a very satisfying night,” he said as he pressed his body into hers. She felt his obvious arousal. She immediately pulled away, though she wanted to press up closer.</p><p>“I didn’t want to do this,” she said and he released her.</p><p>“You sure weren’t fighting me a few hours ago,” he said as his eyes narrowed. His hands on her back were making her lose her train of thought. She had to stay strong and not forget who he was - let alone who she was.</p><p>“I thought it was a dream,” she mumbled and her face turned bright red.</p><p>“So you dream of me often?” he asked.</p><p>“I need to get up, please let go,” she gasped. He brought his lips to hers and kissed her gently, melting her will-power to non-existent. He then released her and she slowly scooted away. It wasn’t an easy thing to do.</p><p>“Can you please turn?” she asked. She needed to get out of the bed, but in no way wanted him to watch her walk away, naked.</p><p>“Not on your life,” he told her. He sat up in the bed, the blanket riding dangerously low on his stomach. She could see the sexy trail of hair disappearing beneath the blanket. She could also see his obvious arousal pushing to get free of the blankets.</p><p>She stayed for several moments, clutching the blanket tightly to her chest. She looked around the room and saw her clothing scattered on the floor. She couldn’t take the blankets because then he’d be sitting in the nude, and she didn’t think she’d have the will-power not to jump him.</p><p>With her head held high she finally climbed from the bed, grabbed her clothes as quickly as possible and slipped into the bathroom. She could feel the aching in her body from the use of muscles she’d never used before. She felt wetness between her thighs, giving proof of what she’d done in the middle of the night.</p><p>She looked into the mirror and was surprised by some slight bruising in a few spots on her body. She couldn’t believe she’d slept with her boss. She’d always thought women like that were tramps, and now she’d joined their ranks.</p><p>She saw the inviting shower and decided she couldn’t dress without jumping in there first. She cringed as she spotted the evidence of her virginity wash away. She hoped he hadn’t noticed. How do you explain remaining a virgin so long? She’d wanted her first time to mean something, and then the years just quickly faded, and soon she didn’t even think about it.</p><p>She started thinking about it a lot once she’d met Trenton. She shook her head to clear the thoughts. She couldn’t do anything about it, so there was no need to dwell on something she couldn’t change. She told herself she’d take a quick shower, but as the luxury jets sprayed down on her sore body she forgot about quickness and just enjoyed the massaging water.</p> <p>Jennifer didn’t know how long she stayed in there, but she never lost hot water and finally climbed from the oversized stall, feeling somewhat better. The heat had eased the achiness in her muscles and she felt clean once again. She hated to put on her dirty clothes, but she had no choice.</p><p>She decided she’d walk out of the bathroom with as much dignity as she could muster, and insist on calling a cab. She didn’t want to spend any more time than she needed to with her boss. It would be best to simply get away as soon as possible so they could go back to a regular working environment.</p><p>Of course, that was going to be difficult considering she’d never before seen a boss, or any co-workers for that matter, naked. She’d never writhed underneath any of them in pleasure. Just thinking about the lovemaking caused her to get wet again. Her traitorous body still wanted Trenton, even though her mind knew it wasn’t going to happen.</p><p>She walked back into the bedroom, grateful he was out of the bed. She stared at the rumpled bedding and felt her cheeks heat again. She couldn’t believe she’d ever thought, even for a moment, that their love-making had been a dream.</p><p>She’d never felt the kind of heat he’d brought her a few hours earlier in one of her dreams. Even thinking of how she’d felt had her ready to do it all over again. Her nipples pebbled and her core grew hot and pulsing. She decided to get out of there.</p><p>She walked out the door and found herself in a large hallway. She saw it ended to her left so she turned to her right and followed it around a corner. She found a huge staircase and began her decent, where she found herself in a large foyer. She smelled coffee and walked in that direction.</p><p>When she caught a whiff of bacon, her stomach growled. She looked around, grateful there was no one about. She was starving, but she’d get food later. She needed to find a phone and get the heck out of there.</p><p>She stepped through a door and found an elderly woman standing over a stove. There was bacon, eggs, potatoes and a few other things cooking. Jennifer’s stomach rumbled so loud the woman turned with a smile.</p><p>“Sounds as if you’re hungry,” she said. She began piling food on a plate and set it on the breakfast bar in front of Jennifer, and she lost all her resolve. A few extra minutes in the house couldn’t possibly hurt, and she didn’t believe in wasting food, so she may as well eat. Then she could do the walk of shame from the home.</p><p>“Thank you,” she said and dug into the plate as if she hadn’t eaten in months, versus the night before. “This is so good,” she mumbled in between bites. The woman must have added some special spices because it wasn’t ordinary potatoes and eggs. The bacon was thick and crisp, just the way she liked and the biscuits practically melted in her mouth. Before she knew it, her plate was empty and she was groaning with an overfull belly.</p><p>“I’m being so rude. My name is Jennifer and thank you so much for the food, it was spectacular,” Jennifer finally said.</p><p>“You haven’t been rude at all. I’m Sandy, and it’s very nice to have someone enjoy my cooking. I tire of skinny little girls barely picking at what I prepare,” the woman said. Jennifer knew she wasn’t a typical female. She didn’t care if she put on an extra pound or two once in a while because she worked hard and exercised often and she knew it would fade eventually. She refused to become a typical size zero, socialite.</p><p>“Well, it was delicious and I only wish I could stuff some more in, but then none of it would stay down,” Jennifer told her with a laugh. “Can you direct me to a phone, please?”</p><p>“There’s one in the den, which is the first door on your left,” Sandy told her.</p><p>“Thank you, it was great to meet you, Sandy, you’re an exceptional cook,” Jennifer told her before she headed toward the den. She had no idea Trenton was around the corner and heard the whole conversation.</p><p>“What do you need a phone for?” he asked, causing her to drop the phone and nearly jump a mile in the air. Her heart was pounding as she turned to glare at him.</p><p>“I’m calling a cab,” she finally said and turned to the phone again and began dialing information. She was outraged when Trenton grabbed the phone from her hand and hung it back up. “What do you think you’re doing?” she snapped.</p><p>“You don’t need a cab. I told you last night I’d take you back out to the ranch for your car,” he told her.</p><p>“I don’t wish to ride with you, so if you’ll kindly hand me back the phone, I’ll arrange my own transportation,” she told him in her most haughty voice.</p><p>“You’ll ride with me. Now, quit acting as if you’re some kind of victim. You gave as good as you got and I don’t recall you telling me no last night,” he snapped.</p><p>“I’m not acting like a victim, but I need to be very clear when I say it was a one-time thing. I have zero desire of hooking up with my boss or jumping on your lap every time you crook your finger,” she snapped back.</p><p>They both glared at each other, standing mere inches apart, both fighting anger, passion, and a need to grab the other.</p><p>“I can get sex any time I want. I don’t need to chase some woman who obviously plays hard to get. So don’t worry about me jumping you at the offices,” he finally snapped. Jennifer felt like she’d been slapped across the face.</p><p>She knew he was a sexy male. Most women would be proud to be on his arm, but she wasn’t most women. She decided to ignore his statement. She didn’t like the tightening in her gut at the thought of him with another woman right after he’d been with her.</p><p>“I’m done with this conversation,” she said and then turned to stomp out of the room. She figured hell with the phone call - she’d walk to the nearest pay phone. It wasn’t worth standing with him and fighting her own emotions, too.</p><p>She heard him give a strangled sound about one second before she felt his hand grab her arm. He spun her around, slamming her body into his. He was breathing heavily and his eyes were shooting daggers at her.</p><p>“You’re such a frustrating woman. You don’t care how much it hurts you, as long as you get the last word in, you’ll jump from a cliff, just so the other person doesn’t have a chance to reply. You’ll learn quickly I’m not an ordinary guy, and I don’t take orders well, plus I really love a challenge,” he said, his lips only half an inch from her own.</p><p>She could feel the heat of his body and that half inch may as well have been a mile. She wanted him beyond anything. She was shaking with need and by the triumph in his eyes he could tell exactly how she felt. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The triumph quickly faded, though, and he closed the gap, giving them both what they wanted. His lips were not slow and seductive, they were urgent and filled with need. She responded with a passion that would’ve shocked her if she could think straight.</p><p>Trenton released her just as quickly as he’d grabbed her and took several steps back. They were both breathing heavily as they stared at each other across the room. Neither of them was willing to back down.</p><p>“Let’s go, I’ll take you to your car,” he finally said, then grabbed her arm and led her to the garage. Jennifer thought about fighting him, but decided not to. His expression was a bit frightening and she wasn’t willing to provoke him any further than she already had.</p><p>The ride out to the ranch was silent. It took all of Jennifer’s will-power but she refused to look over at the man who invaded her thoughts as much as he invaded her space during the week. She didn’t know how she’d continue working for him, but she couldn’t let go of the job.</p> <p>They arrived at the ranch and she jumped from the car quickly and watched as Trenton drove away, spitting gravel in an immature peel out. She watched him leave and sighed to herself. She knew she was lying to herself by denying her attraction to him, but she couldn’t accept she’d want him. She didn’t want any man, but especially him.</p><p>He was far too confident, good-looking, and arrogant for her taste. She preferred men who were kind, loving, and understanding. She certainly didn’t want to be with someone who would grab her and kiss her breathless without her permission. She’d just need to remind herself of that fact over and over again.</p><p>She headed up the stairs and could hear the kids before she even knocked on the door. She smiled to herself, happy her niece had found some joy in life once again. She knocked on the door and waited for it to be answered.</p><p>The next month at work flew by for Jennifer. She made sure she was never alone with Trenton for any length of time. She felt his eyes on her constantly and it was crumbling her wall of defenses, which she was so proud of having built up.</p><p>She was making new friends, making her realize she could deal with the tension between her and Trenton. She didn’t want to give up her job. There were a couple of single parents who worked there, who’d been invaluable in giving her tips and ideas. She’d been thrust into parenthood, and though she wasn’t complaining, she knew she had a lot to learn.</p> <p>“Hey, Jennifer, a bunch of us our heading to a club tonight. Want to come with us?” one of her new friends, Tracy, asked.</p><p>“That sounds perfect. Molly’s spending the night with a friend so I have the night free. Where do you want to meet?”</p><p>“We’re going to the new club over on Second Street. Dress extra sluty,” Tracy said with a laugh. Jennifer blushed and Tracy gave a large wink before she left, laughing the entire way.</p><p>Trenton was sitting in his office, seething. He hadn’t been able to get her out of his mind and she was planning on living it up at a club. He wanted to haul her into his office and remind her how good they were together. He managed to stay seated, just barely and pretended to get work done.</p><p>At the end of the day, when he watched Jennifer walk out of the office with some of the other women, smiling and laughing, he made his decision to do some clubbing of his own.</p><p>Trenton left the offices with such an angry expression on his face all his employees turned the opposite way, instead of daring to actually speak to him. He didn’t notice because all he had on his mind was one particular employee who was driving him nuts.</p> <p>Trenton got home and changed out of his suit into his favorite pair of jeans and t-shirt. He didn’t want to look like a wealthy man that night. He wanted to look like an everyday guy and prove to himself he’d still have women hanging off him. He didn’t need the attention of one stubborn woman.</p><p>He drove to the club, which he’d never been to before, and though it was only ten in the evening, the club was already crowded more than he liked. He made his way to the bar and ordered a stiff drink. He had the feeling he’d need about twenty of them that night but could only have one. He needed to be able to drive later.</p><p>He leaned against the bar to peruse the room and it didn’t take him long to find her, even in the crowded club. His gut clenched and he felt himself actually gripping the bar to keep from rushing onto the dance floor and ripping her from the arms of the guy she was with. The guy had her pulled tightly against him and her head was thrown back in laughter. He spun her out and quickly pulled her in again and Trenton wanted to rip the guy to shreds.</p><p>Just as he was about to lose the battle with himself and rush out there, a blonde rubbed up against him, pressing her half exposed breasts into his side and giggling.</p><p>“I’m so sorry,” the blonde said with another annoying giggle.</p><p>“It’s not a problem,” he told her, though she was actually irritating him. What was the matter with him? A beautiful woman was throwing herself at him and he could care less. She was much more his type than Jennifer, but he wanted to push her aside and rush out to his assistant. Hell, he’d come to the club in the first place to prove he could find other women attractive.</p><p>“Can I buy you a drink?” he offered and gave her his million dollar smile. She actually swooned from his full attention.</p><p>“That sounds great, handsome,” she purred before rubbing even closer. He clenched his teeth and swore to at least try and flirt with the air-headed blonde.</p> <p>Jennifer gritted her teeth as the man, who had asked her to dance, pulled her in tightly against him again. He was gorgeous, with a body she was sure took many hours in a gym, and a smile that would send most women into total organ failure.</p><p>Her friends had pushed her into dancing with him, when he’d asked, though she really hadn’t wanted to. The song seemed to never end and he was definitely placing all the signals he wanted to take the dance to the next level.</p><p>He was cute and entertaining, but she had to fake her enthusiasm, because she felt absolutely nothing for him. She was terrified her boss had set the standard so high she’d no longer be attracted to anyone else. That wouldn’t work for her.</p><p>She’d been with Trenton for over a month at the offices and he was constantly on her mind. She’d daydream about him and then he’d return to her in her dreams at night, as well.</p><p>He consumed her thoughts and dreams in such a short amount of time. She did her best to ignore him and had done well at keeping things professional, but it was certainly causing her a lot of stress, and her body a lot of aching.</p><p>The song finally ended, and with a smile, Jennifer pulled free from the man and headed toward her table of friends. He followed behind her and it took all her energy to remain nice, while still letting him know she wasn’t interested in anything more.</p><p>“Thanks for the dance, sweetheart. I’d love to do it again. Can I buy you a drink?” he asked in what she assumed was his most seductive voice. It did nothing for her.</p><p>“I appreciate the offer, but I’m here with my friends. Have a great night,” she told him and turned away, acting as if he didn’t exist. He must have left because a minute later Tracy looked at her like she was insane.</p><p>“Oh my gosh, Jennifer, he was completely hot and you totally blew him off,” she said, almost accusingly.</p><p>“I’m not interested in men like that, besides I didn’t come out tonight looking for a guy, I just want to relax and have some fun,” she told her friend with her best smile. She was trying to act as if she didn’t care.</p><p>“You’re crazy, but okay,” Tracy said and then thankfully the conversation changed to other topics and the time started passing quickly. She danced a few more times with other men, who all made it perfectly clear they were looking to go home with someone, and they didn’t care who it was. She was regretting her choice of clothing.</p><p>It was getting late and she’d drank a few too many margarita’s, as her latest dance partner swung her around the floor, she felt dizzy, and was having a harder time staving off his advances.</p><p>“I need to sit down,” she tried to tell him.</p><p>“You’re fine,” he said and pulled her tightly against him. There was a wall of people around her and she couldn’t untangle herself from his arms. She was starting to get a bit freaked out and was no longer pretending to be having a good time.</p><p>“You need to release me, now - I want to go back to my table,” she told him in as firm a voice as she could manage. He ignored her, and his hands started exploring her body. She was close to tears, as she realized how women could be so easily violated out in the open. No one was paying the least bit of attention to her, or the situation she was in.</p><p>She kept pushing him away, but it was to no affect. He was gripping her backside, and pulling her into his body. She felt dirty and violated and wanted to leave the club right away. Suddenly, the man let her go and flew backward with a shocked expression on his face. She looked up into the angry face of Trenton, shocked to see him there. She didn’t know what to say.</p><p>“The lady said she wanted you to let her go, I suggest you leave, now,” Trenton said and the power in his voice must have scared the man because he left quickly, without another look back. She was so thankful for his interference she didn’t even question what he was doing there, or his high handed methods.</p><p>“Thank you, Mr. Anderson. He wasn’t hearing the word no,” she said and turned to head back to her table. She wanted to leave and her friends seemed to be having a great time, so it looked like she was going to grab a cab. She didn’t know where Trenton had gone but that didn’t matter.</p><p>The group told her to stay, but she explained she’d gotten a headache and needed to leave. Tracy offered to leave with her, but she was having a great time and there was no need for that. Jennifer told her no and made her way to the front of the club.</p><p>She stepped out onto the sidewalk, and was surprised by the empty street. There were a few cars here and there and several people milling around but she couldn’t see a cab anywhere. She turned and decided to walk for a while, hopefully clearing her head.</p><p>“Hey lady, are you looking for a date?” some creepy guy asked, sending chills down her spine. How stupid of her to walk the Seattle downtown area in the middle of the night. She blamed her stupidity on one too many margaritas. She shook her head and walked a bit faster.</p><p>The guy started trailing her, making crude suggestions, really starting to scare her. She looked around for somewhere safe to go, thinking it may be wiser to turn around and try and make it back to the club. She could go inside and ask them to call her a cab.</p><p>Suddenly, her arm was grabbed and she was about to scream, when she turned and saw Trenton. She’d never been so happy to see the man.</p><p>“What the hell are you doing out here, wandering the streets?” he demanded. “I turn around for one minute and you’re gone. Don’t you know what could happen to you out here at this time of night?”</p><p>His tone of voice instantly put her on edge. She wasn’t some adolescent child who needed scolding. Sure, she’d made a stupid choice, but she was an adult and if she wanted to make stupid decisions on her own time, it was none of his business. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m looking for a cab, not that it’s any of your business,” she slurred at him, surprised by her own voice.</p><p>“You’re going to give me a heart attack. I don’t know why I’m bothering to worry about you,” he seethed and took her arm, leading her in the opposite direction. She tried to yank her arm free but he had a firm grip.</p><p>“I can walk on my own,” she snarled. He looked at her as if she was indeed not capable of doing anything on her own and he continued to walk, dragging her along, beside him.</p><p>He stopped and clicked a button and then she was being tossed inside his car again. She was so stunned by his behavior that she sat motionless, giving him time to reach the driver’s door. When he started the car and pulled onto the street she came out of her shock.</p> <p>“You arrogant jerk, I didn’t ask you for a ride, nor did I ask for your help. You can let me out of this car and I’ll call a cab,” she yelled, glaring at the side of his head.</p><p>“You may not have asked for my help, but you obviously need it. You can’t handle liquor worth a damn, and are a prime candidate for tomorrow’s news if I don’t get you home safe. I can’t imagine how you managed to stay alive this long,” he answered in an eerily calm voice. She was more irritated by his tone of voice than anything else. He was talking to her like she was a child and she didn’t appreciate it.</p><p>“What are you doing down here, anyway?” she demanded, giving up on the idea of him letting her out of the vehicle.</p><p>“Not that it’s any of your business, but I’m human, and do like to go out once in a while,” he said in the same tone.</p><p>“I didn’t think you knew how to take off your suit and mingle with the commoners,” she said, knowing how immature she sounded, and not caring. She knew she let her tongue run rampant when she drank.</p> <p>“I know exactly what to do when I take off my suit,” he said and the look in his eye let her know his exact meaning. She decided to keep her mouth shut for the remainder of the ride. She suddenly found they’d pulled up to her apartment and so she worked on getting her seat belt undone so she could get away from him before she said or did anything else.</p><p>Trenton exited the car and came around to open her door before she was finished. She got out on wobbly legs and holding her head high, started walking toward her door. He gripped her arm and led her there.</p><p>“I don’t need your help. I’ll be just fine getting in on my own,” she snapped.</p><p>“Obviously, you do need my help, and I don’t leave a lady alone this late at night without making sure she’s locked inside, safe and sound,” he said, still with too much patience. She was irritated he seemed so capable of keeping his cool when her own emotions were all over the place.</p><p>She dropped her keys in her haste to get the door unlocked and he just sighed, reached down, grabbed them, and then had her door open in a few moments. She held her hand out for the keys but he just placed his hand on her back and led her inside.</p><p>“I don’t need you to walk me in,” she snapped before plopping on the couch, too tired to argue with him anymore. He ignored her and walked over to the kitchen and soon she could smell coffee brewing. It smelled heavenly but she wouldn’t have a cup until after he left.</p> <p>“Drink this,” he said and she realized she’d drifted off while leaning against the back of her couch. She was surprised she could relax with him in her house enough to fall asleep.</p><p>“Maybe, I don’t want to,” she said, even though she really did want the soothing liquid. He raised his brow and with a sigh, she conceded and took the cup, taking a long sip. It was just how she liked it, which irked her. He was more observant than she’d given him credit for.</p><p>He stood there and sipped his coffee while she finished her cup. Then, he walked over and removed it from her fingers. She sucked in her breath, knowing she wasn’t up to fighting him off. Her traitorous body was already reacting to his nearness and she wanted him.</p><p>He bent down and without saying a word, pulled her off the couch and into his arms, where he devoured her lips. He kissed her long enough that her knees turned to jelly and her insides melted. She was ready for him to take her. She was tired of fighting both herself and him.</p><p>She wrapped her arms around his neck, pulling him closer and he caressed her back, sending goose bumps all along her skin and making her blood boil. Then, as suddenly as he began the kiss, he pulled away and the shutters were put back into place. He pulled her over to the door.</p><p>“Lock the door after I step out,” was all he said before he was gone. She stood there motionless for several moments, shocked he’d kissed her with so much heat and then walked out. Finally, she cleared up enough to throw the locks into place, and walked back to her room, flopping on the bed.</p><p>She kicked off her shoes, leaving her clothes on, lying on her bed, aching and needing him more than she’d ever needed anything. He turned her on more than any man should be able to but apparently she didn’t have the same effect on him because he’d been able to walk away without a second glance.</p><p>Jennifer tossed and turned for several hours, before finally falling asleep. She was grateful it was Saturday the next day or she would’ve had to call in sick, because she needed a couple of days before she could face her boss again. The man was extremely potent and she was discovering how very weak she was around him.</p> <p>Chapter Five</p><p>Trenton waited until he heard the locks click and then headed to his car. He should receive a medallion for walking away, because it was the hardest thing he’d ever done. She’d been willing and ready for him, but he knew she would’ve hated both him and herself in the morning and he’d done the right thing.</p><p>He drove himself home and poured a double scotch before climbing the stairs to his room. He took a long shower and climbed into bed, where he knew he was going to lay for hours on end. He couldn’t get her out of his head and it was really pissing him off. No woman had ever held his attention as long as she had.</p><p>He made the decision to really pursue her. He knew after they had a brief affair he’d get over her and be able to move forward with his life. Hell, it would be good for both of them and things could return to normal. He could find her a new position within the corporation so she wouldn’t be left without a job and he could once again sleep at night.</p><p>He had a long business trip coming up and figured it was the perfect amount of time to put his plan into motion. He would let her know on Monday morning about the trip. He felt better once he had a plan. It would all work out, even though a part of his brain tried to tell him he was crazy. He chose to ignore the more rational portion of his brain and focused on pleasure instead. He finally fell asleep and she invaded his thought even there.</p><p>Jennifer walked into work on Monday morning and knew she looked bad. She hardly slept over the weekend and knew her face showed the results. She was frustrated Trenton had so much power over her that he affected her sleep.</p><p>As soon as she sat down and pressed the computer on, her buzzer sounded and she was called into Trenton’s office. She squared her shoulders, held her head up high, and walked into his office. She was hoping her face looked professional.</p><p>As Jennifer stepped into his office Trenton noticed she looked exhausted. Even though it looked as if she’d slept even less than him, she was still stunning. The trip would be a great thing for both of them, even if it would take her a while to realize it.</p><p>“I have a business trip scheduled for the end of this week and I need you to come with me,” he told her, coming right to the point. Her eyes widened and she looked stressed.</p><p>“How long will we be gone?” she asked. She didn’t want to leave her niece for too long.</p><p>“If things go well, it will only take a week, if things don’t go according to plan, then it could take up to three weeks,” he said and her eyes widened even more.</p><p>“I c...can’t be away for that long. I have my niece to take care of,” she told him. She in no way wanted to lose her job, but she couldn’t leave her niece for three weeks. Molly would think she’d been abandoned again.</p><p>“I understand you have your niece, but as you were told when you interviewed for this position there’s a certain amount of travel. I need you with me on this trip. I’ve already arranged child care and she’s used to my cousin, so she’ll be fine. Your laptop also comes equipped with a video camera, so you can video message her nightly if you’d like,” he told her. He’d been prepared for her arguments and had already taken care of them.</p><p>“If I’m to go on this trip, then I need a couple days off to spend with Molly so I can explain what’s going on and she won’t panic,” she told him. He was impressed by her backbone.</p><p>“That will be fine. You can work from home the rest of the week. Take your computer with you, and if there’s any paperwork needing to be transported I’ll send a carrier,” he told her. “You can finish today in the offices, though.”</p><p>“Thank you,” she replied and quickly exited his office. Trenton was feeling pretty good about himself. He’d never wanted a week to end so badly. He couldn’t wait to get her all to himself for a week or two. He sat back in his chair and smiled.</p><p>“Auntie loves you so much and we will talk every night with the cool camera I showed you, okay,” Jennifer said to her niece. She was trying so hard to not let her tears fall. They were standing outside the company jet and thankfully Emily had agreed to bring Molly to the private airport to say goodbye.</p><p>“I’ll be okay, Auntie. I’m going to play with my friends,” Molly said, but Jennifer could see she was a bit frightened by her aunt leaving.</p><p>“I’ll bring you home lots of presents, too,” Jennifer told her, finally letting go.</p><p>“I like presents,” Molly said, enthusiastically.</p><p>“I know you do, baby - now be a good girl for Mark and Emily, okay?” she asked. Molly agreed, and before she knew it she was boarding the jet and waving to her niece from the window.</p><p>Emily led Molly to her car and they disappeared. Suddenly, Jennifer realized she was alone with Trenton and her heartbeat skyrocketed. She didn’t even know where they were going, or how far away it was. She’d been so focused on her niece nothing else had mattered.</p><p>She looked around at the luxury jet in awe. It was more plush than anything she’d ever been in. It had beautiful, soft carpeting, comfortable chairs, couches and a hall, leading to other areas. She’d flown in a couple of commercial jets in her life, but they didn’t even compare.</p><p>“Would you like to look around? We won’t be taking off for about fifteen minutes,” Trenton said.</p><p>“That would be great,” she answered. She wanted to see how the other half lived. He gave her the tour and she was amazed such a thing even existed. There were several rooms in the back of the aircraft, one with a large table and chairs around it, plus a huge television screen, another with a fairly decent kitchen. There were amazing smells coming out of there, ensuring they would eat well on the flight. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When they reached the sleeping section, she could feel her cheeks heat up at the huge bed in the main room. It even had an attached bathroom, bigger than the one in her apartment. She didn’t see how they could fit so much into the jet. It was large, but not overwhelmingly so from the outside.</p><p>She figured she’d be sleeping in the living room if it was too long a flight because there was no way she was sharing a bed with him. Hopefully, it didn’t become an issue.</p><p>“Where are we heading, anyway?” she finally asked.</p><p>“I have business in Austria. It’s a fairly long flight, but the jet’s comfortable so that shouldn’t be a problem,” he answered. She had to suck in the gasp wanting to escape. It looked like she’d be testing the comfortableness of the couch, after all. It was already early evening so they wouldn’t arrive until sometime the next day. She had no idea what time that would put them in Austria.</p> <p>“The captain has asked you to buckle up now, Mr. Anderson. He’s gotten the go-ahead for take-off,” a woman said.</p><p>Jennifer quickly sat down and buckled her belt as tight as she could make it. She hated the take-off and landing part of flying. She was fine once they were in the air, that’s of course unless there was turbulence. She really hated turbulence, and if the jet hit one of those pockets of air and dropped, she’d begin to panic.</p><p>She sat tensely, gripping the armrest on her seat until they were safely in the air and the flight attendant came back and offered them drinks. She ordered something strong and slipped off into the bathroom to take a couple of strong sleep aides. She wanted to sleep through the flight and wake up once they landed.</p><p>She came back out and sipped on her drink and then something smelling heavenly was placed before her. She dug into the appetizer, loving whatever it was. She wasn’t used to eating such incredible food and thought she could get used to it.</p><p>“Well, it looks as if you’re enjoying the meal,” Trenton said with a chuckle. She turned a bit pink and thought, ‘what the heck’ she didn’t care if he thought she was a pig.</p> <p>“I need to figure out how this was made. It’s so good,” she said. “Do you have a recipe?”</p><p>“I could ask,” he said, sounding amused. She didn’t care what he thought, he was used to the finer things in life but she’d always had to work hard for everything she got. She was a great cook and knew she’d be able to come pretty close to the same flavor.</p><p>More dishes were served and it seemed each one was better than the last. By the time dessert was presented her stomach was already filled to the full mark but it was dripping in rich chocolate and she couldn’t turn it down. Her sleeping pills were kicking in and she could feel the heaviness of her eyes. She wouldn’t last much longer.</p><p>They finished eating and then a warm cup of coffee was placed in front of her. It smelled delicious and she realized there must be a shot of rum in it. It tasted even better than it smelled. She finished the cup and laid her head against the seat. She wasn’t going to last very long, she thought happily.</p><p>“We should get some work done before we turn in for the night,” Trenton said, looking down at his laptop. She mumbled something and then let the fog drift over her and was soon sound asleep, sitting straight up in the chair.</p><p>Trenton looked over and realized Jennifer was out and not just napping, but really out. Hell, he most likely wouldn’t have been able to get any work done, anyway, as he was too anxious for the trip to really get started. He had a ton of work to finish, but he also planned on a lot of romance. He wanted her in his bed nightly, and he knew he was going to have to woo her.</p> <p>The flight attendant came back and he dismissed her for the evening, put his lap top away, and bent down and lifted Jennifer into his arms. She immediately snuggled into him, making his body grow hard and his lips relax into a smile.</p><p>He didn’t think it was going to be difficult seducing his sexy assistant. He carried her back to his room and laid her on the bed. He removed her shoes and pants and left the rest of her clothes in place. He was certainly not going to violate her in her sleep.</p><p>After tucking her into the large bed, he decided it was too early for him to sleep, so he went back out into the main cabin and worked on some papers for a few hours. When his mind kept drifting back to Jennifer, in his bed, he finally gave up and joined her.</p><p>He laid there for a couple of hours, with her body pressed against him, simply enjoying the feel of her in his arms. He could get used to her sharing his bed. That was the last thought he had before sleep finally overtook him.</p><p>Trenton woke up with Jennifer pressed tightly against him and it was incredibly hard to extract himself from her warm body. He was aching and hard and wanted nothing more than to flip her over and plunge within her inviting heat, but even though he knew how great it would be, the consequences weren’t worth it.</p><p>He wanted her hot and willing, and he wanted her aware. He walked out to the main cabin and tried to do some work but gave up after re-reading the same line for the tenth time. He wasn’t happy this one woman had so much control over his emotions and his body. It made him feel weak and no woman should ever have that much control.</p><p>He knew the minute she entered the cabin, even though his head was leaned back against the seat and his eyes were shut. He could not only smell her aroma, which would stay with him the rest of his life, but he could feel her.</p><p>“How did I get back there?” she asked, as she took her seat across from him.</p> <p>“I carried you, you were out cold,” he replied without looking up.</p><p>“Oh, uh, thanks,” she mumbled. The flight attendant walked in, breaking up the awkward silence.</p><p>“Would you both like some breakfast?” she asked.</p><p>“That would be great,” Trenton said. Jennifer was starving and glad he’d said yes.</p><p>“What would you like to drink?”</p><p>“I would love some coffee, extra sweet and also a big glass of milk,” Jennifer said.</p><p>“Black coffee,” Trenton added and then the flight attendant left to get their orders. She returned quickly with their drinks and some pastries, which Jennifer gulped down. Trenton watched her with a smile on his face.</p><p>“We have a few days before the meetings will start. We purchased some land over there about a year ago and are developing a new resort. Everything was fine until about a week ago, when some companies threw a few last minute wrenches in the works, trying to say there are environmental factors to consider. We did our research long before we ever bought the land and it’s all smoke screens from people trying to get more money out of us. This could take a while, but I have a feeling it will be solved quickly,” Trenton informed her.</p><p>Jennifer felt a shudder travel down her spine at the look in his eyes. She wouldn’t want to be his enemy, or on the wrong side of a business deal with him. He hadn’t become the corporate shark he was by backing down. She didn’t know what to say, as she didn’t even really know how she’d gotten the job in the first place. She was greatly lacking in the coldness factor required for her type of position. She couldn’t bluff her way out of anything - she’d end up losing a company millions by caving in on issues.</p><p>“So what are we going to do?” she finally asked.</p><p>“We’re going to meet with my attorneys, who have been working on this non-stop and then put the plan I’ve created into effect. I’ve been going over the complaints all week and there are many holes in the claims and we should be able to come to a mutual agreement,” he told her matter-of-factly. He didn’t seem to be in the least concerned.</p><p>“Why did you need me to come?”</p><p>“There’s a lot of work to do, Jennifer. You were told there was a lot of travel involved when you were interviewed,” he reminded her.</p><p>“I know,” she snapped. Luckily, the flight attendant appeared with the rest of their breakfast so she was able to break the glare he sent her way. He may be her boss and she may have a horrible crush on him, but he’d soon find she wasn’t easily walked on.</p><p>They finished their meal and before long the captain was announcing they’d be landing soon. Jennifer hated landing worse than taking off. It was especially bad when the aircraft bounced on the runway.</p><p>She gripped the armrest on her seat and started panting. She was fighting to not panic when Trenton moved seats to the one right next to her. He didn’t say a word, but his hand gripped hers and she felt the panic ebbing and she could breathe again.</p><p>It amazed her how the simple gesture was able to comfort her so much. She didn’t take her hand away, or even acknowledge it was there. She simply let the touch relax her. The jet touched down more smoothly than she’d ever experienced before, and she let go of the breath she didn’t even know she’d been holding.</p><p>“You have nothing to worry about, you know,” Trenton said with a chuckle and she looked at him with surprise. She’d forgotten he was there for a moment.</p><p>“I know a person is far more likely to die in a car crash than an aircraft accident, but there’s something terrifying about being so high up in the air in something weighing so much,” she said with a self-depreciating smile.</p><p>“There are many people afraid of flying, I’m just so used to it, I don’t even notice anymore,” he told her.</p><p>“Lucky you,” she said, not meaning it. She’d prefer to stay on solid ground at all times if she could get away with it.</p><p>“As soon as we get to the terminal, we’ll head to the hotel. We have a lot to get done before the official meetings start,” he told her, back to business.</p><p>“I’m ready,” she answered, though she felt she was in over her head.</p><p>They got off the jet and were whisked to a beautiful hotel. He’d rented a huge suite with multiple bedrooms, a large living room, and full-sized kitchen. There was a table set up for them to work on, so they immediately sat down and pulled out boxes full of papers.</p><p>She spent the rest of the afternoon typing up notes and filing things until she felt her brain was completely fried. She wondered if the man ever called an end to work. When her eyes felt like sand bags had spilled directly into them, he still seemed wide awake and raring to go. He finally looked up, and noticed her exhaustion, and decided to call it a night.</p><p>They worked just as hard over the following days. His attorneys came in and out, bringing more paperwork and picking up pages they’d modified. Jennifer quickly stopped trying to figure out what they were talking about and simply did her assigned work.</p><p>She looked longingly out the windows of the gorgeous suite, wanting so badly to explore the city she’d never thought she’d ever get to visit, but with Trenton’s work schedule she didn’t have the time. She hoped she’d get at least one day before they had to head back.</p><p>She’d been paranoid about them sharing the suite but he hadn’t seemed the least bit interested in sex, so her paranoia was for nothing. As a matter of fact, she started to feel a bit frustrated as she laid in her own room, nightly, feeling achy, like she was missing out on something.</p><p>“Jennifer, we need to leave,” Trenton snapped her out of her reverie. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“I’m ready,” she answered, gathering the files they’d need. It had been torture spending so much time alone with Trenton and it would help to be in a room full of people. She had zero doubt it would go his way because he didn’t miss anything in his quest for perfection. There wasn’t a single ‘t’ which wasn’t crossed, or an ‘i’ not dotted. He seemed to be flawless.</p><p>They arrived at the meeting place and it was apparent in a matter of minutes who was in charge. Of course, things ended up going his way, and the schedule immediately got back on track. He walked out of the meeting in a better mood than she’d ever seen him in before.</p><p>“That will wrap things up for a few days, but there are some other issues needing completed before we head for home. The next meeting is Wednesday,” he told her as they headed back to the hotel. It was late and she was exhausted but she was also excited. She was going to get to explore the amazing country.</p><p>Chapter Six</p> <p>She had three days, three precious, wonderful days in which to explore all she possibly could. She wanted to see everything and knew she was going to be the typical, annoying tourist, but she didn’t care. She’d never been out of the country before and she couldn’t wait to explore the beautiful country of Austria.</p><p>The day began as a crisp, cool morning with clear skies. She was enjoying a divine fresh breakfast at the luxurious hotel, prepared by the staff. It was the standard European selection of fruit, yogurt, granola, various meats and cheeses, bread, eggs, sausage and hot tea full of cream and sugar.</p><p>Jennifer figured she was going to end up gaining at least ten pounds on her trip because the food rivaled anything she’d ever eaten before. Normally for breakfast she was lucky to have a slice of toast and about five cups of extra sweet coffee.</p><p>She didn’t know what it was about a vacation, slash work, that made her want to eat so much, but with the tastes of the original foods put before her, she didn’t care, she just kept eating and told herself she’d work out extra-long when she got home.</p><p>Jennifer talked to the staff the night before and found out she was lucky to be there in the winter. The region was certainly beautiful any time of the year, but there was a magical transformation in the late autumn. The land transformed into a fairytale setting right off the pages of a children’s storybook and there was magic everywhere you looked. She finished her breakfast and went to her room to dress. She couldn’t contain her excitement and had to quickly get going before Trenton could change his mind and end up making her stay in to work instead.</p> <p>Jennifer dressed extra warm in wool slacks, a heavy sweater and large coat, along with the beautiful white boots Trenton had given her for the trip. She’d badly wanted to tell him where he could stick his gifts, but she knew she needed to dress appropriately as his employee on a business trip and out of everything, she’d fallen head over heels in love with the boots. They were gorgeous and comfortable and she absolutely refused to find out how much they cost him because then she’d feel too guilty to wear them. For just once, she decided ignorance was definitely bliss.</p><p>She stepped out of her room and stopped in her tracks, telling herself she had nothing to feel guilty about. She hadn’t been sneaking around - he’d told her they couldn’t do anymore work for three days so there was nothing wrong with her leaving. He wasn’t her father and she didn’t have to inform him of her every move when they weren’t working.</p><p>Trenton was standing in the living room glaring at her, though, and she felt like she’d done something wrong. She glared back at him, upset he could make her feel bad, especially when he hadn’t said a single thing to her, yet.</p><p>“Where are you sneaking off to?”</p><p>“I wasn’t sneaking anywhere, you said last night we were at a standstill for a few days so I’m leaving to explore the city,” she said defensively.</p><p>“Do you have any idea where to go?”</p> <p>“Oh yes, I talked to the hotel staff and they gave me a map and told me some must see's while I’m here,” she said excitedly, forgetting she was irritated with him in her excitement over exploring.</p><p>“Were you planning on just leaving and making me worry about you?” he said in an exasperated voice.</p><p>“There’s no reason for you to worry about me. I’m a grown woman and you’re cutting into my little amount of time, so you can rant at me when I get back. I want to go, now,” she told him and walked toward the door. She heard him growl something under his breath and then she was pushed up against the door.</p><p>“You’re so damn frustrating,” he said before his head lowered and his lips devoured hers. She pushed against him, terrified by the instant heat ignited in her stomach. He had her pressed against the door and within seconds she lost the will to fight him.</p><p>Her hands, which had been pushing against his chest, suddenly gripped his shirt tightly, pulling him even closer to her. She’d never wanted a man like she wanted Trenton, which should worry her, but there was room for nothing else but passion as his lips worked their way down her longing body.</p><p>He pulled away from her, just as quickly as he’d grabbed her, and took a step back. They were both breathing heavily as they stood by warily, both trying to get their breaths under control.</p><p>“I didn’t mean for that to happen right now, you just push me further than any other person. We got off on the wrong foot this morning. I’d like to personally show you the area. I’ve been here many times before and feel you’d be safer with me,” he said, quickly getting himself under control.</p><p>Jennifer looked at Trenton with suspicion. He hadn’t exactly apologized, but he did seem genuine. She couldn’t understand why he’d choose to take her around to tourist spots. Besides the kiss, he hadn’t shown much interest in her in a while. She’d have a better time with him, though, so decided to accept his offer.</p> <p>“If you really don’t mind,” she began and he nodded. “Well in that case, I’d love to have a guide, but no more kissing,” she said firmly. He gave her the first real smile she’d seen from him in quite some time. It took her breath away with its brilliance.</p><p>“That will happen later,” he promised. Her eyes widened, but she quickly got herself under control. She knew he was a typical male and had to get the last word in so she let it go. She didn’t want there to be any chance of her touring getting ruined.</p><p>“Well, if you’re going to be my guide, then I want to do things right. I don’t want the rich guy’s experience. I want to really tour, like any ordinary person. I want to ride the subway and take the busses. I refuse to be chauffeured,” she said. He immediately stiffened as if she was asking him to commit some sort of crime.</p><p>“There’s no way we can do that. There are security issues, and it’s just plain stupid,” he snapped.</p><p>“Well, then have a nice day, I’m going on my own,” Jennifer said and turned toward the door. She’d much rather spend the day with him, but she refused to give in on her last point.</p><p>“Fine, we’ll give up the chauffer, but I insist on having two security men accompany us. You won’t even know they’re there. The guards come, whether you go with me or not,” he said as he blew out another breath of frustration and ran his hand through his hair. She noticed he rumpled his hair a lot around her. She found she liked getting under his skin. It made her feel powerful in a way she’d never felt before.</p><p>“Okay, we better get going, then,” she said, beaming a huge smile his way before opening the door and practically skipping outside. He quickly caught up to her and wrapped her arm through his. He was right, she quickly forgot about the security men as they stepped onto the very cold streets. She was so excited she threw her arms out and twirled, causing several people to turn and look at her as if she’d lost a couple marbles.</p><p>They quickly found the subway and rode it to the Vienna City Center. Jennifer was practically bouncing in her seat and refused to acknowledge Trenton’s grumpiness next to her. It seemed he didn’t like riding the subway. She found it exhilarating. She knew it was a great place to see the real locals.</p><p>“See how amazing this place is, they actually trust each other. They know you aren’t going to steal a ride and don’t have to lock you out,” she said, pointing out the honor system of the subway. There were no turnstiles to keep them out, you simply bought your ticket and got on the tram. If someone came through and asked to see your ticket and you didn’t have one, then there would be serious consequences, but they didn’t ask on every ride and a dishonest person could take the risk.</p><p>Trenton was finding Jennifer’s enthusiasm hard to resist. She was excited about the simplest things and though he was less than happy to be riding on the subway, he was glad to be with her, and finding her joy was contagious. She smiled at every person they passed and they were quickly smiling right back. He was glad he’d decided not to let her leave his sight, or she may have ended up getting whisked away by a very smart local man.</p><p>“Oh, this is our stop,” she said and jumped up to head out the door. He barely had time to grip her hand. He looked over his shoulder at his guards and gave them an exasperated look. One of them actually had the nerve to smile, before he was able to straighten his lips.</p><p>Trenton knew it was probably a joy for his guards to watch him literally be led from place to place by a wisp of a woman, who was like a tornado on feet. He glared at them one more time before chasing after Jennifer. He heard a chuckle behind him and thought there was no way it was one of his guards - they wouldn’t dare.</p><p>“This is the largest Christmas Market in Vienna, Madge told me about it, so hurry, I don’t want to miss out on anything,” Jennifer said, as they made their way out of the subway. There was a huge open air market sporting all kinds of booths.</p><p>“This is the Rathus Christmas Market and it opens about a week before the others. She told me to go to a Punsch stand and I can get a special souvenir mug to take home,” she said.</p><p>“Why would I need to take one of the mugs home?”</p><p>“Because it’s something to remember the trip by,” she answered. He bought them each a hot drink, which had the kick of alcohol he desperately needed to make it through the day. He obediently kept his mug instead of turning it back in for the miniscule deposit. He’d let her have the mug so she could have a set.</p><p>When he handed over the mug, she acted as if it were a true treasure. Hell, he’d given diamonds, with far less appreciation. He couldn’t understand how something so simple could excite her so much. He found he liked her enthusiasm.</p><p>She started dragging him from place to place and surprisingly, he was enjoying himself. She was so happy it was impossible not to catch it from her. The market had a variety of foods and craft booths and she seemed determined to stop at every one.</p><p>She purchased Christmas ornaments, candles, toys, foods, and gloves. She told him she had to get a lot of souvenirs for people at home. She wasn’t spending an enormous amount of money, but he was soon carrying several large sacks. He looked over to his security men and when they approached, he handed them over. She was going to protest but he told her the items would be stowed in the car, where they were safe and that seemed to appease her. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was getting burned out from the market and started leading her toward the exit. Of course, she had to ooh and aah over the trees lining the streets with packages hanging from their branches, along with thousands of brightly lit lights. He’d have loved to have seen her as a child on Christmas morning. Hell, he thought she most likely still got just as excited.</p><p>“I have something to show you I think you’ll like,” Trenton told her.</p><p>“Sounds great to me,” she agreed, sure he’d know more than anyone the exciting places to visit.</p><p>“Do you know anything about the famous Hapsburgs, who were the royal family of Vienna?” he asked.</p> <p>“I haven’t heard anything about them,” she told him, starting to get more excited. There was nothing like a royal family.</p><p>“Well then, let me show you their palace,” he said and quickly led her there. She joined a tour group and found herself enthralled as they went from room to room.</p><p>“Normally, you need to book reservations at least a couple months in advance, but I happen to have some connections,” he told her with his cocky smile. She was, for once, grateful of his wealth, because she wouldn’t have wanted to miss out on the palace.</p><p>“This is so great, thank you,” she said, looking around in awe.</p><p>They got to watch the Lipizzaner Horses from the Spanish Riding School perform, and she was fascinated by their precision and the ease with which they handled the horses. They then sat back and listened to the Vienna Boys choir, which had originally started as a troupe of court musicians who’d been personally selected to entertain the royal family.</p> <p>Jennifer felt as if she’d gone back in time, and was sitting in the royal palace, being entertained. It was remarkable and it took her back to her days as a child, wishing she were a beautiful princess about to be rescued by her prince charming. She looked at Trenton and thought he’d make a stunning prince, riding up on his steed. She couldn’t suppress the shiver running through her body. She was grateful he was fixated on the performers, because she knew her heart must’ve been in her eyes.</p><p>They walked into the National library, with its incredible architecture. She was amazed at the stunning detail as she walked around the room. The ages of the books in the room stunned her. There was so much history in such a significant place and she knew she’d be happy to camp in the library for weeks, or even months, on end.</p><p>There were floor to ceiling shelves of leather bound books, some of which dated back to the early sixteenth century. Among the priceless books were impeccable pieces of art, some huge, others understated, historical globes, statues, and priceless paintings.</p><p>The day was quickly slipping away and she felt as if she’d barely seen anything. He quickly took her to the Porcelain and Silver Museum that was filled with the royal cutlery and china. As she looked at the various pieces on display she realized the royal family had eaten from those very plates and used those forks and spoons. She couldn’t imagine how items so delicate had survived through the years.</p><p>“It’s all so remarkable,” she whispered to Trenton. He looked at everything through her eyes and had to smile. He was so used to wealth and the finer things, he had a hard time appreciating the treasures before him, but if he looked at it through her eyes, everything was different.</p><p>He found he didn’t want the day to end. Her happiness was doing something to his insides and he tried to distance himself. He was trying to convince himself he was only playing tourist guide so she’d be appreciative later that night, but he knew he was falling for her in ways that had nothing to do with sex.</p> <p>She was stunning, full of life, loyal to family and had such passion. He shook his head, as he mentally listed her virtues. He was sure it was just the romantic city of Vienna and he’d be able to think clearly again once they got home.</p><p>“We need to hurry if you want to see the Royal Treasury,” he told her, when she was lingering over some intricate china.</p><p>“Oh, I definitely want to see that,” she said and didn’t even try to protest when he took her hand in his, once more. He smiled as he realized he was making progress.</p><p>They went through the Royal Treasury and she got to see the family’s jewels and even the coronation robes worn during the ceremony in which they were crowned King or Queen. Jennifer found the robes stunning and couldn’t believe the great shape they were still in.</p><p>She was surprised by the size of the crowns. They were nothing like what she saw in her favorite princess movies. They were large pieces of Gold, with huge gems she was sure cost an arm and a leg, but she’d much rather wear a delicate tiara with small, sparkling diamonds. She thought the weight from the crowns would have most certainly given the King and Queen Headaches.</p><p>She let out a giggle, making Trenton look at her with his brows raised. She just shook her head and turned back toward the displays. They came to one with a rusted nail and she read the plaque.</p><p>“Oh, look at this - it says it’s a nail from the crucifix of Christ. Do you think it’s true?” she asked him.</p><p>“I think it certainly could be true,” he offered and she rewarded him with a stunning smile, as she ran her hand reverently across the case. He looked at the rusted piece of steel and tried to find it as exciting as her, but he’d seen it many times before. He wished he’d done this tour with her for his first time. He knew it would’ve been a completely different experience for him.</p> <p>As they walked out of the Treasury, her stomach gave a loud growl and Trenton laughed out loud. She looked at him a bit horrified. She hadn’t even realized she was hungry, but suddenly she was starving and wanted nothing more than a huge plate of food after all the walking they’d done.</p><p>Trenton made a phone call and a car showed up in minutes. Jennifer thought about arguing with him, but her feet were hurting and she was starving. He looked at her, as if he was waiting for the argument, so she deflated and slipped into the backseat. She missed the sigh Trenton let out. He was tired himself, and didn’t feel like a huge argument, at least not until after he’d eaten.</p><p>“I’m going to take you to one of Vienna’s favorite places,” he told her.</p><p>“That sounds great. I wouldn’t even know where to begin. I can’t believe I’ve only eaten at the hotel since we got here. Don’t get me wrong, the food is great, but it’s nice to experience the local culture and you simply can’t do that from a hotel room,” she told him.</p><p>“I understand, and I’m glad we have the time for you to play tourist,” he told her with a chuckle. The car dropped them at Plachutta. The place was crowded, but he had no problem securing them a table and there was a waiter at their table within seconds. She sighed, thinking again that money most certainly did equal power.</p><p>“Try the Tafelspitz, it’s one of the most renowned dishes of Austria and this place makes it better than any other,” he told her. She let him order her meal, not knowing what she’d like and not understanding the menu, anyway.</p><p>The dish was fantastic with a beef so tender it fell off the bone and was surrounded by a host of vegetables, in a delicious broth. The meal came with fried potatoes and delicious warm bread and different sauces.</p><p>By the time they finished their meal, she felt like her stomach was going to split open, it was so full, but she somehow managed to take a few bites of the decadent desert. By the time he paid the bill and ushered her back to the car, she was falling asleep on her feet.</p><p>The day had been exhilarating, but exhausting, and she didn’t know how she’d make it back to the room. She slowly followed Trenton to the elevator and swayed on her feet as he opened their hotel room door.</p><p>Trenton took one look at Jennifer’s face and knew he wouldn’t be able to take her to his bed that night. She couldn’t even keep her eyes open, let alone have the energy to make love. He’d have to make sure they didn’t put so much on their agenda the next day, because he couldn’t go another night with nothing more than a cold shower.</p><p>He watched her stumble into her suite and decided he’d check on her in a few minutes to make sure she’d at least made it to her bed. He was exhausted, too, but he realized it had been the best date he’d ever been on. She was so genuine and full of life, and things seen through her eyes were much better than the jaded people he was so used to being around.</p><p>He drank a double shot of bourbon, checked on Jennifer, and then took a long, cold shower, before crawling into his own bed. He was surprised when his eyes shut - he was just about as tired as she’d been. He fell asleep with a small smile on his lips.</p><p>Jennifer woke up and jumped from the bed. She was eager to start her second day as a tourist in the city of Vienna. She didn’t know where they were going, but she knew it would be great. She quickly showered, dressed and then practically ran to the dining area.</p><p>Trenton was already seated and drinking coffee and she didn’t even stop for pleasantries. The sooner she finished breakfast, the faster she could be out on the streets, exploring the city more.</p><p>“You know you can actually slow down, nothing is going to disappear if you have a decent breakfast,” Trenton told her as she piled the food in. She grinned at him like she was an excited child.</p><p>“I can’t wait to get back out. There’s so much more to see,” she told him and then stuffed the rest of her breakfast down her throat and jumped up to grab her coat. “Where are we going today?”</p><p>“I thought I’d take you to the Schonbrunn Palace. It’s on the outskirts of the city and where the royal family resided during the summers,” he said, which gained him another one of her full blown smiles.</p><p>“That sounds perfect, let’s go,” she said, leaving him no choice but to get up and follow her, or be left behind. She caved in and let his driver take them to the place, since she was so eager to get there.</p><p>They walked from one beautiful room to the other and listened to the tour guide talk about the royal family. They talked of Joseph Franz and his wife Elizabeth - known by the world as Sissi. Their marriage had been a political alliance, which saddened Jennifer.</p><p>“I can’t imagine having to marry someone to better my country, or because my parents told me I had too,” she said. He was surprised by her naiveté, though he shouldn’t of been.</p><p>“Marriages are all about what the other person can bring to it,” he said.</p><p>“That’s not true. I know there are still marriages of convenience, even in this day and age, but most marry for love and passion, as it should be,” she told him stubbornly.</p><p>“If you want to think so in your naïve world,” he said with a mocking smile. She glared at him, but decided not to let his pessimism ruin her day.</p><p>They continued to walk through the rooms, looking at the beautiful ceilings depicting everything from landscapes to haunting scenes, to simple artwork. It was all exquisite and made her gasp repeatedly.</p><p>When they entered the room of mirrors, she spun around in delight, trying to look everywhere at once. She could imagine a royal ball going on and twirling through the room on the arm of a prince. Soft music played in the background and Jennifer was surprised when Trenton took her in his arms. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She heard some of the other guests giggle as he swirled her around the room in a dance that could’ve easily been performed there. She stared into his eyes and quickly forgot about everyone else in the room.</p><p>They continued to dance, and she felt as if her feet weren’t even touching the ground. He pulled her tightly against him, and she sucked in a breath as he pressed his hips against hers and she felt his obvious desire for her. She could feel her cheeks heating at the intimacy of the moment and as his head lowered toward hers, her only thought was of their inevitable connection.</p><p>Trenton touched his lips to hers in a gentle kiss, which quickly heated up. His hands pulled her even tighter against him. She let everything else go, except the priceless moment.</p><p>There was a clearing of throats, which snapped Trenton’s head back. Jennifer stared at him in a fog, wanting to know why he stopped, when reality slowly started seeping in. She looked around at the smiling faces and was mortified by her behavior. She couldn’t believe she’d let herself go like that in front of so many strangers.</p> <p>“Oh, you two are so romantic - you must be on your honeymoon,” one of the ladies said and then she hit her husband, and Trenton chuckled. He felt a bit sorry for the poor man. Jennifer had her head buried in his chest and he could feel the heat from her face through his clothing.</p><p>“We just can’t seem to get enough of each other,” he said, and Jennifer’s head snapped up to glare at him, making him laugh harder. “Come on, dear, we’re holding up the tour,” he told her before throwing his arm around her shoulder and pulling her after the group.</p><p>Jennifer was so shocked by the situation she let him lead her after the group without saying another word. She found she liked being wrapped in his arms, and let herself pretend for a few moments that they were a couple on their honeymoon. It scared her how much she desired this fictional dream.</p><p>They stepped outside the palace walls and she was delighted by the light covering of snow beginning to fall on the ground. It turned the entire area into an enchanted wonderland and she felt tears come to her eyes at the breathtaking beauty of it all. She was grateful they were there in the winter, even though she was sure it was just as spectacular in the summertime, with the flowers blooming all over the place.</p><p>There was another Christmas market set up in front of the palace and Jennifer pulled away from Trenton so she could search through all of the homemade crafts and gifts. She once again loaded down his arms with her purchases until he handed them off to be loaded into the car.</p> <p>They had a romantic lunch at a small diner, where the food was exquisite and she found herself laughing often. The room was barely lit and smoky, as the division for smoking and non-smoking was only a table. Things were so different than back in the states.</p><p>She realized as their hands brushed, that she was falling in love with Trenton. She pulled back and his brows rose in question at her instant withdrawal. She knew he wouldn’t understand why she pulled away, but she couldn’t possibly let him know how she was feeling.</p><p>She knew it was most likely the magic of being in a foreign land and spending so much time alone with him, and when they got back to the offices things would go back to their normal alienation, but at that moment she wanted him more than she’d ever wanted any other.</p><p>They left the café and toured more of the city, but nothing compared to the palaces and the history of the royal families. She entered many shops and was finally satisfied with all her purchases. She’d gotten something for all the people in the offices and many different items for Molly. She loved to give gifts and didn’t feel a need to buy anything for herself. She’d much rather give than have anything given to her.</p><p>They headed back to the hotel early. She was far from tired, as they hadn’t done nearly the walking they’d done the night before, and she wanted to go back out to the city. She knew she wouldn’t be able to stay in with Trenton all night, and not find herself begging him to relieve the aching in her body.</p><p>“Take an hour or so relaxing and then dress up for tonight. You’ll find a new dress on your bed. I’m taking you somewhere special tonight,” Trenton said, before he disappeared into his own room.</p> <p>She stood for a few moments, irritated he was so high handed as to simply assume she’d jump at his bidding, but who was she fooling, she wanted to go out on the town. The thought of getting dressed up was even better. What scared her was she wanted to go out with him. She knew a lot of the magic was from her time with Trenton. He knew how to turn on the charm and she was falling fast and hard.</p><p>She walked into her room and her eyes widened at the dress lying on her bed. It was the most stunning gown she’d ever laid eyes on. It was a shimmering blue silk, dipping daringly low in both the front and back, and looked as if it would cascade like a waterfall down her body.</p><p>She caressed the soft material, almost afraid to even touch it, let alone put it on. She was sure the item cost more than she made in a month. Sitting next to it was a stunning pair of heels that looked as if they had real diamonds glittering on their strappy ties. She’d never owned such a beautiful pair before and wanted to wear them.</p><p>She told herself she’d wear the outfit one night, for once feeling like a princess. Then, she’d return them to him. She wouldn’t be a bought woman and she’d make sure to tell him the night wouldn’t end like his normal dates. That thought didn’t sit too well in her stomach, but she’d have to remain strong. She couldn’t be a high priced call girl.</p><p>She headed toward the luxurious bathroom, where she soaked in an exquisite bubble bath and let her worries drain away. She tried to tamper down her excitement for the evening to come, but it was difficult to do. She forced herself to take her time in the bath and getting ready.</p><p>As she slid the dress over her body, and it clung to her like it was a part of her skin, she couldn’t control the sigh. Oh, how she could get used to dressing in clothes like the beautiful dress. She turned toward the mirror and had a hard time recognizing herself. She figured that was most definitely a good thing.</p><p>Chapter Seven</p><p>Trenton sucked in his breath at the sight of Jennifer when she stepped from her room. He’d spotted the dress at a fashion show a couple weeks before their trip and knew it had been made for her. He’d purchased it immediately, not knowing when he’d get the chance to present it to her, but he knew no one else could wear it but her. He’d been right.</p> <p>The dress flowed over her body, accenting every perfection of her luscious figure. She had beautiful rounded breasts, which begged for a man’s touch, begged for his touch, and her slim waist and rounded hips screamed sex. The dress dipped low in the front and he knew it went daringly low in the back and he couldn’t wait to pull her out on the dance floor and run his hands over her bared skin.</p><p>The strappy heels made her legs seem to stretch on forever and he had visions in his head of them wrapped around his back. He was thinking he’d have her leave the shoes on when he made love to her, later. He needed her so badly his body was in a constant state of arousal, and he shifted uncomfortably.</p><p>She was stunning and what made her even more so was the fact she didn’t realize the power of her looks. She was biting on her lower lip as he slowly examined her, and the nervous look in her eyes told him she didn’t know if he approved or not. He couldn’t see how she didn’t realize her own beauty.</p><p>He was used to women knowing exactly what assets to flaunt, and how to keep a man happy. They were good at playing their games, and knew how to get the most they could from their lover. Trenton had the feeling Jennifer had never played one of those games in her life.</p><p>“I’m just wearing the dress and shoes tonight. I’m sure they’re too expensive for me to keep,” she told him as he continued to look at her. For some reason her statement infuriated him. He’d actually picked the dress and shoes out for her, and he didn’t like a gift to be thrown back in his face.</p><p>“Sorry, but they’re yours. That color does nothing for my complexion,” he said with his mocking tone and a raise of his brows. She glared at him a moment and then turned around and bent over to grab her jacket. He nearly had a heart attack at the sight of her rounded butt sticking out for him so close. He had to grab the chair in front of him to stop himself from reaching out and grabbing her.</p><p>She was stunning, and he wanted to show her off in the beautiful city. It would satisfy them both a lot more if he were to simply take her to bed but he wasn’t finished with his seduction. This night would be something she’d always remember.</p><p>“It’s not up for argument. I have some accessories for you to wear, as well,” he told her, when he had his temper under control.</p><p>He walked forward, and opened a case with a stunning sapphire and diamond necklace and matching earrings. Her eyes widened and he could see her pulse beating visibly in her neck as she gazed down in shock. Before she had time to protest, he turned her body and attached the necklace.</p><p>She put her hand against her throat, feeling the cold sapphires and diamonds resting there. He was enjoying her reaction. He wasn’t used to women being so unassuming when presented a gift. Oh, they’d act surprised, but the greed would easily shine through their eyes.</p><p>“I can’t wear this. What if it breaks, or I somehow lose it? There’s no way I’m putting on those earrings. Do you know how many pairs I’ve lost?” she said and took a step back.</p><p>He followed her, like she was his prey, until she was backed up against the wall. She had her hair up in a sexy knot on her head, with some strands framing her face, so he had easy access to her delicate earlobes. Without saying another word, he took the dangling earrings from the box and attached the first one and then the other onto her lobes.</p><p>She glared at him, as her hands trembled. The earrings had a special clasp, so they were difficult to lose, and he saw her try to remove them before getting frustrated when she couldn’t figure out how.</p><p>“I said I didn’t want to wear these.”</p><p>“Accept them - you look stunning, as they match the dress. If you can’t even figure out how to get them off, then how are you going to lose them?” he questioned. She glared once more, but finally gave up trying to remove the jewelry.</p><p>“Well, I’m going to be stressed all night they’ll come off,” she said in a huff.</p><p>“I’ll keep an eye out for you,” he told her on a breath of laughter.</p><p>“Fine, I’ll wear them for now, but only because I want to go and we’re wasting time,” she conceded and walked toward the door. She wanted to leave, not fight with Trenton about what she would or wouldn’t wear.</p><p>“That sounds fine to me,” he said, a little irritated she was being so stubborn. He liked the fact she wasn’t greedy, but he’d taken time to pick her out nice things, and she could be a bit more appreciate and a lot less snarky about the situation.</p><p>He led her out of the room to another beautiful restaurant, where he once again ordered their meal. Her only request was to try something new from what she’d already had. She wanted to try as many of the local favorites as possible before they had to leave and she had yet to find anything she didn’t love immediately. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The highlight of her evening was when he took her to a concert featuring Mozart and Strauss. The first set was compositions of Mozart, exclusively, and was so beautiful her eyes filled with tears and spilled over. Trenton was there to hand her a Kleenex, but she was so enthralled with the music she couldn’t turn away even long enough to say thank you, so she just took it and dabbed her eyes and nose.</p><p>There was also a soloist who performed, alongside the musicians and ballet dancers, adding to the magic. A lovely opera singer performed with so much power in her voice the room echoed with her words. Intermission came too soon and she turned to Trenton with anxious eyes.</p><p>“I can’t believe how quickly that went. I hope the second half’s longer.”</p><p>“It’s certainly a great show, but there are a number of shows in the states with equal quality,” he told her.</p> <p>“I’ve never been to a show like this before. I’ve heard of them, of course, but never pictured I’d be the type of person who’d attend. I thought they were for the rich and famous, and more about being seen, than there actually being such sheer beauty,” she told him.</p><p>He sat back, a bit uncomfortable. He’d attended many of the shows as nothing more than another business meeting. It was a good place to see and be seen and he’d closed many business deals afterward. Her pure enjoyment of the music and beauty around her was humbling.</p><p>“I’m glad you’re enjoying yourself,” he finally said, and by the look in her eye she knew he was one of those people she’d just been talking about. He shouldn’t let her criticism affect him in any way but it surprisingly did.</p><p>He went and got them each drinks and a snack and then sat back, visiting with some of the other people in the exclusive box, while waiting for the second half to begin. As Jennifer didn’t speak German, she listened, but to his surprise, she didn’t seem uncomfortable at being excluded from the conversation.</p><p>The lights flickered and she turned forward, once again completely tuning him and the other people out, focusing on the rising curtain before her.</p> <p>The music of Strauss filled the room and Jennifer was once again mesmerized. His music sent her to a whole other dimension.</p><p>The music had the power to take her away to a new world and when it ended and she was thrown back into reality. She was surprised by the tears streaking down her cheeks and the quiet sobs escaping her lips. The entire event had been so beautiful she hadn’t been able to control her emotions. She didn’t see the look of wonder on Trenton’s face, as she was trying to get herself together.</p><p>“Would you like to go backstage?” he asked. Her eyes rounded in pleasure. She never thought she’d ever get to meet the people who made such beautiful music. She couldn’t even speak, so she simply nodded her head.</p><p>He led her down a hallway and quickly got them backstage, where she was surrounded with people, who were laughing and visiting, everyone seeming to be on a high after such a fabulous performance.</p><p>One of the Opera singers, a very gorgeous male, was showing her a lot of attention, which she didn’t even really notice, until Trenton put his arm around her and sent the man a glare, letting him know she was most certainly taken. A bit later in the evening, as she was sipping on a glass of champagne, and found herself alone, the man once again approached her.</p><p>“If you want to run away from that brute of a man, I can sneak you out the backdoor,” he suggested, which made her face turn pink, and a giggle escape her lips. She was flattered such a talented man would find her appealing enough to want to run away with her. She was tempted, if only to show Trenton he in no way owned her. She gave him a dazzling smile, when she was suddenly gripped from behind.</p> <p>“The woman is taken,” Trenton’s voice said from behind, as his arms snaked around her waist and pulled her tightly to him. She was shocked by his behavior, as she’d never before seen him act so possessively. It wasn’t like they were on a real date, anyway. She was his employee and he was simply showing her the town on a business trip.</p><p>He didn’t give her time to say anything else, he just steered her toward a door, where his guards were, and led her outside to his waiting car. She slid in, feeling slightly buzzed and completely euphoric because of the wonderful night. Even his bad temper did nothing to her great mood.</p><p>“That was amazing. I’m certainly going to have to go to shows in the states. I know I won’t get nearly as good of seats, but I don’t think it will matter whether you’re in the luxurious boxes or the back row. The music is so powerful it will carry to the furthest reaches of the theatre,” she said to him. He noticed her hand once again stroked the jewelry, as it had all evening.</p><p>He could care less about the expensive pieces and found himself even more frustrated she was still worried about it. He pulled her across the car and locked his lips onto hers, taking both of their breaths away. The driver pulled up to their hotel and he reluctantly released her, neither of them saying a word on the long elevator ride to the top floor.</p><p>They entered the room and she shrugged out of her jacket, leaving her before him in the dress that had bothered him all evening. He poured them each a drink and handed hers over. She greedily sipped from the cup. He swallowed his in one shot, his nerves fried.</p><p>“Thank you for another wonderful day, Mr. Anderson,” she said and turned toward her room. He stared at her in shock. She almost got away he was so stunned by her words. He finally got his footing just as she stepped through her doorway, and barged in after her, before she had a chance to shut the door and lock him out. Hell, he’d have broken the door down anyway, with the mood he was in.</p><p>“How the hell can you call me Mr. Anderson after the last few days we’ve had?” he shouted. She looked at him a bit stunned and took a step back. He slowly followed her, not letting his prey out of his sight.</p><p>“Y...you are my boss,” she stuttered, seeming to realize the anger she’d caused in him and quickly making a retreat.</p> <p>He followed her until her knees hit the bed and she had nowhere else to go. They were both breathing heavily as he stood with only inches separating them.</p><p>“I think we’re far past the formality, Jennifer, and you know it. It’s just your way of trying to create distance and I’m done with that,” he growled and didn’t give her a chance to respond. He took her in his arms and smashed his lips down on hers, all his days of frustration pent up in the long kiss.</p><p>She stood in his arms for a moment, shocked, and then her body erupted greater than any volcano could have. Her arms wrapped around his neck, and she kissed him back just as passionately as he was possessing her. She couldn’t get enough of him and found there were too many clothes in the way.</p><p>She knew she may regret her decision in the morning, but she didn’t care anymore. She was tired of the aching and she was done lying to herself. She wanted him.</p><p>He unzipped her dress and it fell in a puddle on the floor, leaving her standing before him in nothing more than a wisp of fabric covering her womanhood, and a very sexy garter belt and heels. His hands raced up and down her slender body, stopping at her rounded curves, to mold and shape them with his hands.</p><p>Her own hands pushed his jacked off and was ripping his tie away. Neither of them had the patience to deal with his buttons, and his own hands came up and ripped the shirt open so her hands could rub over his powerful chest, so smooth and hard beneath her touch.</p><p>He groaned into her mouth, when her fingers encircled his nipples and squeezed them, learning there shape. She wanted to taste him and moved her head down his neck, his skin tasting as good as it smelled. She bent further and circled his hardened nipple, gently nipping it, causing him to groan. He pulled her head back up, bringing their lips together again in another scorching kiss.</p><p>She reached down and unbuttoned his pants and pushed them down his hips, along with his boxer shorts. Her small hand gripped his throbbing erection, which jumped at her smooth touch. She rubbed her thumb over his slick head and he groaned into her mouth again. He pulled away from her, knowing he’d cum in her hand if she didn’t stop. He needed to sink into her hot folds, and he knew he wouldn’t last much longer if she continued to stroke him.</p><p>He tossed her on the bed, quickly following her, and ran his tongue down the smooth column of her throat. She tasted of strawberries and something else he couldn’t describe. It didn’t take him long to reach the lush mounds of her breasts and he quickly sucked her hardened nipple into his mouth, causing her back to arch off the bed, pushing herself harder into his face.</p><p>He cupped her breasts, massaging them with his mouth and hands, making her cry out in pleasure. Then, he trailed his mouth down her flat stomach, circling the tiny dent at her naval, loving the feel of her body. Finally, he made his way to her most sacred place, gripping her hips in his hands, as he sunk his face into her moist heat.</p><p>The first taste of her made his own erection jump painfully. Her moans of pleasure almost sent him over the edge. He swiped his tongue along her pink folds, then sucked her hardened nob into his mouth, tasting her and pleasuring her in a way he’d never enjoyed pleasuring any other woman.</p><p>“Please, Trenton,” she begged, dragging her fingers through his hair. He knew what she needed, because he needed it just as badly. He slipped his fingers inside of her, gritting his teeth at her wetness. She was more than ready for him.</p><p>He slowly made his way up her body, trailing his lips along her curves once more, until his mouth took hers again with so much hunger it took both their breaths away. He gripped her thighs, pulling her wide open for his easy access.</p><p>She didn’t need any more prodding, her legs circled around his back and her head rolled back in ecstasy as he sank fully into her in one quick thrust. She was so close to the edge, when he pulled out and sunk into her again she jerked off the bed and cried out as the explosion ripped through her sensitive body.</p><p>He stared at her in shock as her orgasm continued to rip through her, gripping his body over and over again with the force of her pleasure. Instead of it sending him over the edge, her pleasure seemed to calm him. He slowed his movements, helping to draw her pleasure out. He slid in and out of her body, enjoying the way her heat gripped him tightly. When her shaking stopped, and her eyes opened, he quickened his movements. Her mouth quivered, as he slowly started stroking her body’s flames, once more.</p><p>He pushed up on his arms, wanting to watch the sway of her breasts as he thrust in and out of her body, loving the tremors that continuously racked her body. She was flushed and panting, and he felt powerful, and masculine as she took him deep inside her.</p><p>She reached her hand forward, brushing his damp hair away from his eyes, trailing her fingertips down the side of his face. It was so intimate, he felt emotion welling inside him. He slowly bent forward, needing to kiss her. He ran his tongue along her swollen lips, tasting her, before slowly opening her mouth, as her body was already opened to him. She sighed into his mouth, before sucking his tongue deep inside, and tangling her tongue with his.</p><p>He lost all thoughts as their tongues tangled together, and the last of his control snapped. He started thrusting quickly in and out of her body plunging deeply inside her. He felt the heat building, and his body tensing. Her body tightened, as she cried out with her second orgasm. He suddenly shot his own release deep inside her, and cried out in pleasure that was so intense he thought his heart might stop. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She gripped him with her body, pulling every last seed from him as her legs remained tightly wrapped around his back. Her nails were dug into his shoulders and his mouth lay against her smooth neck as they both shook for many moments. It seemed to never stop but finally her body relaxed and she released her grip on him, seeming to instantly grow weak.</p><p>She tried to pull away from him but he wouldn’t allow it. He wouldn’t allow her to pull away from him, anymore, not until he was done with her. He didn’t believe in forever, but he knew what they had was special and he refused to let her retreat.</p><p>“You will not pull away from me, again,” he said, tipping her chin up so she had no choice but to look at him. Her eyes rounded as he bent his head and took her lips with his in a gentle kiss, his eyes staring into hers the entire time.</p><p>She shut her own eyes, feeling the moment was too intimate, she was too exposed. She didn’t want him to see the love she had for him. It was her secret to hold and she couldn’t share it with him.</p> <p>He smacked her hip, causing her eyes to open again, and he stared at her with satisfaction. She wiggled to break free from him, not liking how much power he held over her.</p><p>“I told you, you won’t pull away from me again, and I meant it, so quit trying to fight me,” he said with a satisfied smile.</p><p>“I’m done, and would like for you to get off me,” she said back in as haughty a voice as she could manage, considering he was still lying on top of her with them still connected in the most intimate way they could be. She wasn’t happy with how husky her voice sounded.</p><p>“Now you’re lying to me, because I most certainly am not done, and I can feel every inch of your body. Your nipples are still hard and pressed up tightly against my chest. Your heat is still wet and surrounding me tightly, and your pulse is beating quickly beneath your smooth skin, right here,” he said as he nipped her neck, causing her pulse to skip.</p><p>Jennifer was damning, both him and her, for the power he had over her. She jerked beneath him, trying to pull away, and her struggles caused him to harden within her folds. Her eyes rounded at the intense pleasure of him growing inside her. She’d never felt anything like that and as he once again started moving within her, she lost all control.</p> <p>“Damn you,” she said on a breathless sigh, before he took her lips with his and led her over the edge once again. After they were finished, which was a long time later, he wrapped her in his arms, and she fell asleep with her head resting on his chest, listening to his heartbeat, and taking in his masculine scent. What really scared her was being in his arms felt like being home and she never wanted to be anywhere else.</p><p>The next few days flew by in a blur. Trenton refused to let her withdraw from him. He made love to her several times a day and she responded each time. He knew her body more intimately than even she did.</p><p>She was sore in a pleasurable way and she decided to let go and enjoy her time in Vienna. She knew the real world would come crashing back around them and she’d deal with it then. She couldn’t fight him when she wanted him so badly, so why pretend?</p><p>He took her to Salzburg and she was ecstatic touring the area where the Sound of Music was filmed. It had always been one of her absolute favorite movies and she couldn’t resist the temptation to sing out loud on the same hills as Julia Andrews had. Trenton simply laughed and followed her as she pulled him around the famous city.</p><p>They went to the grand mountains where the opening of the movie was filmed and went around Lake Fuschl. He even allowed her to lead him onto a bus that took them through the area, though he grumbled and his guards didn’t look too happy with her, either. She smiled and told them to lighten up and live like real tourists.</p><p>She even managed to get the entire bus to sing ‘the hills are alive’ on the ride around the lake, even the always non-smiling guards. Trenton was amazed at how her enthusiasm managed to pass through everyone around her.</p> <p>The snow continued to fall lightly throughout the days and since there wasn’t much of it in Seattle, she enjoyed it. When they were waiting for the bus to turn around, Trenton was staring at the pureness around him when he felt a snowball come from nowhere and smack him in the side of the face.</p><p>He turned around and stared at Jennifer, incredulously. He couldn’t believe she’d dared to hit him with snow. He looked at his guards, who looked back and shrugged at him, telling him he was on his own. They, in no way, were going to protect him from the wisp of a girl.</p><p>Before he could figure out how to respond she pelted him again, right in the face, and then bent over, laughing so hard she was having a hard time breathing. He heard a chuckle come from his guards and turned to glare at them. They didn’t even try to hide their glee, which irritated him. He was becoming much too soft in her presence.</p><p>He started stalking toward her and she looked up in time to see his menacing look and then turned around and ran, slipping and sliding on the icy surface. It didn’t take him long to catch up to her and he lifted her in his arms and tossed her into a soft snow bank. She looked up at him in shock, halfway buried in the cold snow.</p><p>She grabbed a handful of snow and lobbed it at him, and reached down for more. He tackled her before she was able to release the snowball and then they were wrestling around, both getting soaked, and his body quickly hardened at the feel of her body. He took her cold lips in his, warming them both up instantly.</p><p>The bus came back and he reluctantly released her. She got one last round of snow shot off, before quickly running to the safety of the bus. He vowed to make her pay later. He glared at his guards as they walked past him, actually chuckling under their breaths.</p><p>They had lunch and visited the home of Mozart, called Mozartplatz. They also went to the beautiful plaza Residenzplatz, adorned with a historic fountain. He showed her the Salzburg Cathedral, with its wonderful beauty and history. They went through ancient cemeteries and her heart was heavy with sadness for unknown children who died too young. There were so many of the small graves.</p><p>Jennifer’s other favorite place was the fortress high on the hill above Altstadt, which was built to secure the city. It was actually never used to fend off enemy attacks, but it was a very impressive place.</p> <p>They had the best apple strudel high atop the hill. She found it fascinating the delicious desert was invented in Austria. There was so much rich history in the area and she wished there was an unlimited time to explore. Maybe, someday she’d be able to bring Molly there and take her to around.</p><p>After exploring the fortress, she finally allowed Trenton to lead her back toward the hotel. They were so exhausted they ended up eating in the hotel the remainder of their tour days.</p><p>Trenton grumbled a few times he’d never walked so much in his life. She ignored him, since he was obviously in incredible shape.</p><p>When the touristy part of the trip was over and they had to get back to work, Jennifer was extremely disappointed. She’d wanted to see so much more of the region and knew she’d need at least a month.</p><p>They finished their business in Vienna, much to Trenton’s satisfaction, and soon it was time for them to head home. She was sad to see her trip end, but excited to see Molly. They had been away for only two weeks, but it felt like months. She couldn’t wait to hold her niece in her arms again.</p><p>When they boarded the jet for home, Trenton seemed to be the one who pulled back from her and although her heart ached at the distance, she knew it was for the best.</p><p>They returned home and he had to leave again for the East Coast, where he’d be gone for about a week. She found herself actually missing him in ways she didn’t think would ever be possible.</p><p>Chapter Eight</p><p>Jennifer loved Christmas more than any other time of the year. She loved everything about it, the lights, decorations, food and the happy atmosphere almost everywhere you went. She knew she tended to take things over the top a bit, but she didn’t care, and she refused to change.</p><p>She got to work early, trudging to the office, with her arms full, and two security guards behind her, barely able to walk - they had heavy containers, they insisted on carrying for her.</p><p>“Thank you for the help, guys. I really appreciate it. I could’ve made a few trips and gotten all this up here, eventually,” she told them as they set the totes down by her desk.</p><p>“We couldn’t let you carry this on your own, Ms. Stellar,” one of the guards said, as if he was affronted by the very idea. It made her happy to know there were still true gentlemen in the world.</p><p>“Well, I do appreciate your help, it simply isn’t Christmas without loads of decorations,” she said.</p><p>“I don’t know how the boss will feel about this. He did send out a memo, reminding the staff the holidays were no excuse for tackiness,” the guard said a bit warily.</p><p>“You let me take care of the boss, I won’t allow him to be a scrooge and ruin my holidays,” she told the men as she pushed them out of the office. She immediately got to work hanging decorations and lights throughout the area.</p><p>Trenton was going to be out of the office all day, giving her plenty of time to get things done. She’d deal with him when he returned, and of course, take full responsibility for the festive decorations. His anger would be well worth it, when she got to step into the office and see the beautiful colors.</p><p>Soon, other office staff started coming in. The new employees were oohing and aahing at all the pretty colors, while his employees, who’d transferred from Chicago, warned her he wouldn’t be too happy about it. Her enthusiasm was infectious, though. Soon, people were joining her in hanging up all kinds of decorations.</p><p>Some staff even went out on their lunch breaks and purchased more decorations and by the end of the day the entire floor had been transformed. She managed to get all her work done, so Trenton couldn’t complain, but for the next month she’d be able to walk into her office and feel the Christmas spirit. She smiled and wished the staff Merry Christmas as they left for the day.</p><p>It was a Monday evening and Molly was once again staying the night with her new best friend, since there wasn’t school for her the next day due to a teacher work day. It gave Jennifer time to finish the rest of her work. She hung the last piece of mistletoe, then was startled by a throat clearing. She turned around guiltily, thinking she was going to have to face Trenton a bit sooner than she’d expected. Her face lit up when she spotted George and Joseph, instead.</p><p>“We heard about the decorations going up and had to come see them,” George said. She gave him a huge smile.</p><p>“Do you like them?” she asked eagerly.</p><p>“It used to look this way when my wife was still alive. She’d make sure the holidays surrounded us and she kept the magic alive. I’m glad you’ve brought it back,” George said with a tearful sparkle in his eyes. She’d always been an affectionate person and couldn’t help herself from giving him a hug. He seemed to need one at that moment.</p><p>George accepted her hug and kissed her forehead. With the holidays coming up and only she and Molly left in her family, it felt like being home, wrapped in George’s arms. She didn’t understand how Trenton distanced himself from such a wonderful man. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“You really are a breath of fresh air for our family, Jennifer, and I’m grateful you’ve brought this all back to us,” he told her before letting go.</p><p>“I think we’ll have to send you to the other floors to make sure the entire building shines,” Joseph added. Jennifer’s eyes lit up at the thought. She didn’t know if he was serious or not, but she’d love to decorate the building.</p><p>“Just name the time and place and I’ll be there,” she told him eagerly.</p><p>“I think we could get the boss to let her off the rest of the week. Don’t you?” Joseph asked.</p> <p>“I would count on it,” George said. She hoped she’d actually get to do it - it would be much better than sitting behind a desk all day. She appreciated her job, but it didn’t make her as excited as decorating did.</p><p>“I could work on the weekend if I can get a sitter for Molly,” she offered them, not wanting to anger Trenton by taking time off work.</p><p>“Weekend time is family time. We’d never expect you to work, then. There won’t be a problem with you decorating the building, we’ll take care of Trenton,” George said, as if reading her mind.</p><p>“Well, if you don’t think it’s a problem,” she said, still sounding unsure.</p><p>“We’re certainly sure,” Joseph added. The boys told her to meet them in the department store so they could get the decorations she’d need, and then they headed out. She finished the work she thought would need to be completed and decided she’d just make sure to swing by the offices at least a few hours during the day so nothing went undone.</p> <p>With all her work done, Jennifer headed home. She entered her empty apartment and missed Molly. It was amazing to her how she’d grown so attached to her beautiful niece in such a short amount of time. She looked forward to the end of her day when she’d get to spend the entire evening with her.</p><p>She loved the hugs and kisses Molly gave her. Most of all she loved that her niece finally seemed healed as well as any child losing a parent can be. They were making a real home for themselves.</p><p>She went to sleep, excited to decorate the office building and looking forward to Molly coming home. She had Christmas Carols running through her mind.</p><p>Trenton stepped out of the elevator and a gasp escaped his lips. He looked around at the red and green decorations and stood silently as he also realized Carols were playing over the speakers. The offices looked as if Santa had set up his workshop right there.</p><p>He slowly walked around the offices, noticing there wasn’t a single area not touched, whether it was with lights, mistletoe, garland, or bells. Decorations were everywhere. He walked into his office and turned on his computer.</p><p>He found the memo he’d sent out and re-read it. He thought to himself his employees obviously couldn’t read because the memo specifically stated he didn’t want Christmas Decorations all over.</p> <p>Trenton was getting ready to rush out his door, call a meeting, and fire whoever had dared come up with the idea to ignore his memo. He stood up, walking toward the door, when it was pushed open and his father and uncle walked in.</p><p>“You’re here nice and early, boy,” his dad said.</p><p>“I have a lot of work to do, Dad. This really isn’t a good time.”</p><p>“Oh, there’s always time for family. We came up to tell you we snatched your beautiful assistant to decorate the building, since she did such a great job, here,” Joseph said.</p><p>Trenton’s head snapped up as he gaped from his father to his uncle. He should’ve known Jennifer was the one responsible for his headache. She was always the one who seemed to push him to his limits. They were certainly going to have a few words together.</p><p>“Where is she, now?” Trenton asked through his teeth. He didn’t see the look his father and uncle gave one another.</p><p>“We are meeting her down in the store,” George said.</p><p>“Did you not think to ask me if I could spare her?” he said deceptively quiet. The two men looked at him quizzically, as if they couldn’t figure out why he’d ask such a thing. He had to count to twenty in his head before he could say anything more.</p> <p>They’d been back from Vienna for a couple of weeks and it had been taking all of his well-honed self-control to stay away from her. She hadn’t brought up the trip or their seemingly unquenchable desire for each other once, and he found he was irritated by it.</p><p>He didn’t want some clinging, nagging woman hanging all over him, but she could at least show some desire for him. He certainly hadn’t lost any of his passion toward her. She walked in a room and his body responded instantly. He hadn’t made any moves on her because he was trying to get himself under control, but that was quickly going out the window. She was certainly not caving in and he couldn’t hold out much longer. The Austria trip hadn’t done what it was supposed to, get her out of his system.</p><p>“Well, she did such a great job up here, we wanted her to decorate the entire place,” Joseph said, looking puzzled by his nephews ill temper.</p><p>“I’m sorry, Uncle Joseph, you’re right, she did a great job and I don’t mind you borrowing her. Please only take her for half the day, though, as work needs to get done up here as well,” he said through clenched teeth.</p><p>His uncle apparently didn’t notice there was anything wrong. He clapped him on the back and took off with his father. Trenton sat at his desk, fuming with anger, because the old men had once again gotten their way, and not only that, but taken his assistant, too. He wanted to hunt her down, but knew it wouldn’t be a good idea in his current mood.</p><p>After lunch, she came strolling into the office, wearing a freaking holiday shirt and grinning. There was a piece of tinsel stuck in her hair, she seemed unaware of, and he forced himself to stay in his seat. He wanted to pull her close to him and mark his territory. He was going to have to do something and soon, before he exploded.</p><p>“Don’t you think you should’ve talked to me before taking on another job?” he asked, amazed at how calm his voice sounded. Her smile fell away.</p><p>“I was told you were fine with this,” she said a bit uneasily.</p><p>“I had no choice but to be okay with it, with both my father and uncle being who took you away from your work,” he practically growled.</p><p>“Oh, I’m sorry, Mr. Anderson, I can tell them I can’t finish,” she said and his temper went through the roof. There he was, sitting with a raging erection, wanting her more than any other woman, ever, and she was daring to call him by his last name. He shot out of his chair so fast it went flying across the room, which left her staring at him in shock and a bit of fear.</p><p>She immediately retreated, making a dash for the door. She knew when to stay and fight, and when to retreat. He grabbed her, dragging her back over to his desk and glared at her, causing a tremor to shiver down her spine.</p><p>“Be silent,” he threatened and she didn’t dare defy him. He punched his button to his secretary, who picked up immediately. “Tell everyone to go home. I don’t care what they’re working on, the day is over, you can all count it as a vacation bonus,” he said, and broke the connection.</p><p>Jennifer was shocked and a bit scared at his words. He dragged her over to the door, locked it and then drug her to the couch, where he pushed her down, panting heavily. She was stunned by his behavior. She’d certainly seen him angry before, but he was so controlled, with a fire blazing in his eyes.</p><p>“I’ve warned you to stop calling me by my last name,” was all he said before dropping to the couch and making her forget all about the distance between them for the last couple of weeks.</p><p>She didn’t even consider fighting him as he took her into his arms. Shock was quickly consumed by burning passion. He was glorious in his temper, and she’d missed the feel of his body pressed closely to hers. She missed the feel of his thick shaft sinking in and out of her. She missed them touching, with no barriers between them.</p><p>He stripped her clothes, and then his, in record time, and stretched his body over hers, his skin hot, and glistening in the low office light. He was magnificent. He brought his lips to hers, pushing his tongue around the contours of her mouth, making her cry out in pleasure. His hands roamed every inch of her skin, taking their time in her most intimate areas.</p><p>He sucked her peaked nipple into his mouth, swirling his tongue around the hard, pink surface, causing her to groan as she gripped his head tightly to her breast. He moved his tongue and she whimpered in frustration. He glanced up at her, his eyes shining with unconcealed heat. He trailed his tongue between the sensitive valley of her breasts, causing her skin to quiver.</p><p>His mouth trailed lower, spending a lot of time on the soft surface of her belly, causing her most sensitive spot to throb with wetness. She was ready for him. Two weeks may as well be two years. She was addicted to him, no matter how hard she tried to deny it. He brought her pleasure she couldn’t even fathom receiving from another.</p><p>He moved his mouth down her thighs, licking and nipping on the inside. His lips trailed around her core, coming close, but not touching her where she wanted him to most. She wanted to yell in her frustration. She grabbed his head, trying to guide him, not even caring how bold she became in his arms. She needed him to relieve the pressure as only he could.</p><p>“Please, Trenton, please,” she begged, on a shaking breath of air. Finally, he swiped his tongue along her hot folds, causing her to shake from the pleasure of it. He kissed her intimately, taking her mind and body to a whole other level. He swirled his tongue along her heat, swiping his tongue up and down her silken folds. She tensed as he swiped his tongue across her nub, sending her over the edge in a heart-stopping orgasm. He softly flicked his tongue out, prolonging her pleasure, before he nibbled his way back up her body.</p><p>He pressed their slick bodies together, her nipples aching as they rubbed against his hard chest. She barely had the energy to wrap her arms around his neck, holding him closely to her. She looked into his eyes with a satisfied expression in her own. She smiled at him, full of joy. He bent down slowly, nibbling on her lips, swiping his tongue across her lips. She could kiss him like that every single day.</p><p>He lifted her hip, and slid effortlessly into her waiting heat. She was more than ready for him. He stopped, while deep inside her, letting the pleasure of them coming together, once more, engulf his system. They fit together, perfectly. He couldn’t ever remember being happier. She jerked her hips up and he was done playing. He moved quickly in and out of her, seeking his own pleasure.</p><p>It didn’t take Jennifer long for her body to throb once more, and they fell apart together as he released his long awaited seed deep inside her. She sunk into the couch, still gripping him tightly, afraid to let go, afraid of the intimate moment ending. He turned them so she was cradled in his arms, and his hands stroked up and down her back, luring her into a deep sense of security. They napped for an unknown length of time, and she was awoken by his roving hands.</p><p>He loved her several times on the couch and she responded in a way that showed her the distance she thought she’d created had been in her mind only. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>After they were both sated, fully, and began to dress, Jennifer stood up, unsure of what to say or do. She’d thoroughly enjoyed the lovemaking and certainly couldn’t complain, but she felt like a person must after a one night stand. She was so unsure what she should do next.</p><p>“My Uncle is having his annual Christmas Party this weekend. You’ll come with me,” he said, finally making eye contact. It was a command, not an invitation. She narrowed her eyes. He couldn’t seem to quit bossing her around.</p><p>“Maybe I already have plans,” she bluffed. He stared her down, and she finally broke the eye contact. She could feel his eyes drilling into her and was desperately trying to think of an excuse to get out of the party, but she did like his family and she’d enjoy a party at the famous Anderson Mansion she’d heard so much about.</p><p>“I’ll send a car for both you and Molly, dress formally,” he said, ignoring her other statement. Since he was allowing Molly to come she decided to go. She knew her niece would have a good time. She was a bit worried about what to wear, though.</p> <p>She’d brought him back the dress he’d given her in Vienna and left it in his office after they returned. When he got back and found it, he’d flipped and told her she either take the dress back or he’d personally strip her and put it on her himself. She’d decided it was better to just keep it, but had vowed never to wear it again.</p><p>Well, she did own the dang thing and it would be appropriate for the party, so she guessed she could cave in on that issue and wear it once more. She absolutely refused to wear the jewelry, though. He may not take the pieces back but she had them hidden under a loose floor board in her home, terrified of someone robbing the expensive pieces. She was determined to get them back to him at some point, when she wouldn’t have to deal with the aftermath of his anger.</p><p>She left the office without saying another word. She knew it wouldn’t do her any good and what was the point, anyway? They both knew she’d lost their little battle so she may as well walk out with her head high.</p><p>Jennifer went home and told Molly about the party, which had her niece ecstatic for the rest of the week. Her week also passed pleasantly. She got the entire building decorated, with a lot of extra help from other employees and felt joy when she walked in each day, listening to the Christmas Carols coming over the speakers.</p><p>The party snuck up on her before she knew it and she took her time getting ready. As she slipped the beautiful dress back on, she was amazed at how pretty it made her feel. She supposed the saying about clothes making the person had some merit, because she felt good in the gorgeous dress and stunning heals.</p> <p>Molly looked adorable in the dress Jennifer bought her. It was a pretty blue color because her niece had insisted they have matching dresses. There was no way Jennifer would put her niece in a gown like the one she had on, but she’d found a similar color, satisfying Molly. She’d also been able to find sparkly shoes her niece instantly loved.</p><p>By the time the car came to pick them up, her nerves were stretched thin and she was unbelievably anxious. She was relieved when Trenton wasn’t in the vehicle. It gave her extra time to compose herself before she had to face him.</p><p>Trenton was beyond irritated by the time he finally arrived at the party. He’d gotten held up with business and was over an hour late. He’d wanted to ride to the party with Jennifer, and wasn’t happy about missing part of the evening in her company. He was finding more and more that he needed to be around her. He was learning to accept the fact.</p><p>He stepped into his uncle’s large mansion and immediately went on a search to find her. He spotted her niece, Molly, without trouble, sitting with his cousins’ children and Santa. Molly was receiving a lot of presents. Trenton had to smile, as his uncle certainly went overboard when it came to his grandkids, and if there were any extra children in the mix, the old man figured, the more the merrier. All of the children were getting gift after gift and were squealing in delight.</p><p>He searched the room for Jennifer and couldn’t seem to spot her in the large crowd. He was about to go searching somewhere else when he heard her laugh and turned in that direction. He could pick her out of a crowd anytime, and as a sea of people parted and he finally spotted her, he felt a tight fist of jealousy knot deep inside him and for the first time in his life, he wanted to rip his brother’s head from his shoulders.</p><p>He began stalking toward the two of them, who were as yet unaware of him, and there was murder in his eyes. He logically knew his brothers would never poach on his woman but he hadn’t staked his claim on her yet, so as far as they knew she was available. He was about to make it more than clear she was indeed not available.</p> <p>“Good evening, beautiful,” he stated and took her in his arms, in front of everyone, and kissed her with so much hunger, she forgot where they were. Her arms wrapped around his neck drawing him closer and she moved her hips against his straining erection pushing against her stomach.</p><p>As suddenly as it started, Trenton pulled back, and she whimpered in her sexual haze, trying to draw him back to her. He was staring into her clouded eyes with a look of frustration on his face and she finally noticed the soft chuckle.</p><p>Jennifer looked in horror at the laughing face of George and she felt immediate heat suffuse her cheeks. She buried her head into Trenton’s neck for a moment, trying to get herself together. She’d never kissed a man like that in a crowded room.</p><p>She heard conversations around her and braved another look. She wasn’t reassured by the glances still coming their way.</p><p>“I guess someone just staked their claim,” Max said with his brows raised.</p><p>“Damn right,” Trenton said, not even trying to deny it in front of her.</p><p>“Excuse me, please,” Jennifer said, pulling away from him and disappearing from the room. She found the bathroom and locked herself in. She didn’t know which emotion she was feeling more at the moment, anger or embarrassment.</p><p>She was infuriated Trenton would decide it was his right to claim her, and then proceed to embarrass her in front of his family like that. They most likely thought she was a money hungry tart, which is what she always thought of women who slept with their bosses.</p> <p>She wished she hadn’t worn the sexy dress, feeling far too much skin was showing. She rinsed her face, reapplied her light make-up, then squared her shoulders, and walked back out. She would’ve loved to slip away but she couldn’t do that to Molly, who was having a wonderful time.</p><p>She found no one was acting any differently toward her from how they’d been before the kiss so she started to relax, but she certainly avoided Trenton, though she felt his eyes on her no matter where she was. She’d certainly have words with him later about his high handed behavior but she wanted to enjoy herself at the Christmas party.</p><p>Trenton watched Jennifer, wanting more than anything to drag her from the room and straight to his bed. He normally just took whatever he wanted, when he wanted it, but his family would skin him alive if he tried to drag her from the room and it wasn’t worth the fight, so he dealt with his frustration and even found himself having a good time as the evening progressed.</p><p>He’d been away from his cousins and siblings for a long time, and it felt good to be in their presence. He found himself laughing and giving as good as he got, but no matter who he was speaking to, or where he was, he knew where Jennifer was. He found he didn’t even do it consciously, he just sought her out.</p><p>The night flew by for Jennifer and before she knew it, she found herself yawning and reluctantly deciding she should get Molly home. Her niece had a wonderful time, but now it was time for bed. She found Joseph and Katherine, thanked them for a wonderful evening and then found Molly sleeping on the floor with a bunch of other children.</p><p>She smiled down at her tiny body, lying there with her friends. The Anderson family had been so great for her vulnerable niece.</p><p>“Let me carry her for you,” she heard Trenton say, causing her to jump. She hadn’t realized he’d followed her into the family room.</p><p>“I’d appreciate that. She may be small, but in her sleep she can get pretty heavy,” she accepted. He easily bent down and scooped Molly into his arms, as if she weighed nothing at all. The sight of Molly’s head lying against his masculine chest brought tears to her eyes. Her poor niece had lost both her mother and father and so deserved to have parents to love her. She’d do anything to give her niece all the love she deserved.</p><p>Jennifer walked outside with Trenton, enjoying the cool evening air touching her heated face. She realized she’d drank one too many glasses of champagne throughout the night and the breeze felt good. She also forgot she’d been picked up for the party and didn’t have her car.</p><p>“I’m going to call a cab,” she told Trenton, who didn’t slow down. “Where are you going?” she asked, as she trudged along after him.</p><p>“I’ll give you a ride home,” he told her.</p><p>“That’s not necessary, I can get a cab,” she tried again, not sure she could handle the ride home with him. Her hormones were all over the place and she was at an all-time low in resistance levels.</p><p>“Deal with it,” he stated and then he was buckling Molly in the backseat. Her niece was so exhausted she didn’t budge an inch with all the movement. He opened the passenger door and manhandled Jennifer into the seat. She sat there pouting but unable to move, considering her niece was in the back.</p><p>He drove them through the deserted streets and it seemed like the drive took twice as long with the nervous tension filling up the car. She sighed her relief as they pulled up to her apartment. She immediately scrambled out of the car, planning on retrieving Molly and rushing inside. Trenton had other plans, though, and beat her to Molly’s door.</p><p>“I have her,” was all he said, so she sulked up to her front door and was mad when it took her shaking fingers three tries before she was able to get the door unlocked. “Where is her room?” he asked. She pointed down the short hallway and then headed to her kitchen. Waking up in the morning with a hangover wasn’t an option, so she started a strong pot of coffee brewing and waited at the counter.</p><p>“She didn’t budge when I laid her down,” Trenton said, startling her. She hadn’t heard him come back to the kitchen. “I could use a cup of coffee,” he prodded her, since she didn’t seem willing to offer him one.</p><p>“Okay, but I’m really tired, so...” she let her words trail off at his look. It seemed he didn’t like being booted out of her house. He accepted the cup, leaning on the counter, only a few feet away from her. Her entire body was aware of his presence in the room. They hadn’t been alone since that day in his office and she felt the sensations rushing through her, needing his touch in ways that angered her.</p><p>“Invite me to stay,” he whispered to her seductively, leaving her trembling.</p><p>“That’s not a good idea,” she said, gripping the counter in her efforts to not reach out for him.</p><p>“Our entire relationship hasn’t been a good idea,” he told her and swiftly moved toward her, his intentions clear in his beautiful eyes. She tried to sidestep him, but it was useless in the small space. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He took her into his arms and her already weak resolve to not sleep with him again, evaporated as his lips touched hers. She ached for him in a way she never thought possible, and every time she was in his arms was a relief. What difference would one more night make?</p><p>Trenton couldn’t even think straight as he pulled her close. He lost all thoughts but to find her bed and take her. He found that no matter how many times he loved her, it was never enough. He didn’t think it ever would be. He lifted her up and carried her the short distance to her tiny bedroom.</p><p>He was barely able to remove their clothing before he sunk himself deep into her inviting heat. Her moans of pleasure sent him over the edge and their first time that night went too quickly. He made it up to both of them over the next couple hours, making slow, sweet love to her half the night. She was amazed how long he could pleasure them both, and she was very satisfied.</p><p>Both Trenton and Jennifer fell into an exhausted sleep as the sun was just starting to rise in the sky. He knew at that point he couldn’t let her go. He figured it was going to take a lot of convincing on his part, but she was his woman and he refused to release her from his life.</p> <p>Chapter Nine</p><p>Jennifer was woken by a knocking on her door. She groggily opened her eyes, relieved when she didn’t feel a pounding beneath her eyelids. She tried to move and found herself pinned to the bed. She turned her head and her night was quickly brought back. Trenton was staring at her with a satisfied smile on his lips.</p><p>“Good morning,” he murmured before kissing her softly, making her forget all about the knocking, until another insistent one pounded her door.</p><p>“Um, I have to answer the door,” she said, not good with morning after conversations, considering he was the only one she’d ever had one with. She jumped from the bed, self-conscious of her very naked state. She grabbed her bathrobe and secured it, before heading to her front door, aware she most likely looked a mess, even though it was some time in the afternoon. She felt horrible to have slept so long. The house was quiet, which meant her niece was still asleep as well. She wasn’t surprised, considering all the excitement of the night before, and how late she’d gotten to bed.</p><p>Jennifer opened the door to the disapproving look of her niece’s social worker. She wondered what the woman was doing there.</p> <p>“Hello, Ms. Ellis, did I forget about an appointment?” she asked, a lot more conscious of her own ragged appearance. The woman looked her up from head to toe and by the look in her eyes, didn’t approve.</p><p>“I have some news to share with you that couldn’t wait. May I come in?” the sour woman stated and pushed her way forward. Jennifer found her rude and annoying but couldn’t let her temper get the better of her. The woman was the difference of her having her niece permanently or not, so she’d play nice.</p><p>“Would you like a cup of coffee?” she offered.</p><p>“That would be great, thank you,” she said. Jennifer quickly made a pot and placed a cup in front of the woman and then joined her at the table. She pulled out a bunch of paperwork from her file and a cold sweat broke out on Jennifer’s skin. This didn’t seem to be a happy visit.</p><p>“As you know, your custody of Molly has been temporary until we determined if this would be the best environment for her,” the woman began and by her tone of voice, she seemed to be saying she indeed didn’t think it was a good environment.</p><p>“We’ve had interviews with Molly and then you, of course, and have come to the conclusion Molly would be much better off in a more traditional family setting. She had two very loving parents and we don’t think moving into a single parent household is what’s best for her,” the woman said in the same cool tones. It took a few moments for Jennifer to realize what she was saying, but when it hit, she felt all the color drain from her face. The woman was telling her they were going to take Molly from her care.</p> <p>“I don’t understand. Molly is doing great with me. I have her in school and I have a great job, so providing for her isn’t a problem. I’m her aunt and I don’t think living with strangers would be good for her,” Jennifer pled.</p><p>“We do try and have children with relatives if that’s what’s best for them, but with your long work hours and single status, this isn’t an ideal living environment,” the woman said, looking around the tiny room and finding it wanting.</p><p>Trenton picked that moment to walk into the room, looking sexy as sin in his clothes from the night before. He certainly didn’t look bedraggled like her. He looked like the confident businessman he was. He stepped over to the coffee pot and poured himself a cup and then joined them at the table. Even the snooty social worker seemed a bit flushed in his presence, as the man seemed to have that effect on all women, no matter their age.</p><p>“Good afternoon. I’m Trenton Anderson,” he said, while sticking out his hand. The woman actually blushed as she took his hand and Jennifer sat there in shock.</p><p>“Hello, I’m Betsy,” she replied and Jennifer’s mouth dropped open. She didn’t even know the woman had a first name, let alone been allowed to hear it. She sent Trenton a glare and he actually had the nerve to wink at her. She’d have words for him later, since her temper was starting to rise. She hated the power he held, when she herself, felt so hopeless.</p><p>“That’s a beautiful name, I’m sorry to interrupt but I couldn’t help but overhear your conversation,” he told her, causing the woman to blush, again.</p><p>“That’s perfectly okay, Mr. Anderson,” she said. Jennifer had the feeling if she were the one to interrupt she wouldn’t have gotten such a pleasant response.</p><p>“You won’t have to worry about Jennifer’s single status any further, as she’s my fiancé. We’re getting married at the end of this week. My father has always wanted a Christmas wedding,” he told the woman. She looked at him dreamily, while Jennifer stared in shock. She couldn’t believe he’d lie to the social worker. It wasn’t like she wouldn’t figure out the truth when a wedding didn’t occur.</p> <p>“Well, Jennifer, why didn’t you tell me,” she turned to Jennifer in admonishment. Jennifer couldn’t speak.</p><p>“Things have happened so quickly and I know she was planning on calling you right away, as a matter of fact, we’d like to invite you to the wedding since you’ve been such an asset in Molly’s life,” he said smoothly, taking Jennifer’s hand in his and bringing it to his lips, where he gently kissed her palm, sending a tingling sensation all the way down to her toes.</p><p>“That sounds just lovely, Mr. Anderson, and will you be living in a more suitable place for the child?” she asked, completely ignoring Jennifer.</p><p>“Yes, Molly will have a nice house to run free in, with a playground, of course, as all children need,” he answered. Jennifer could feel bile in her throat, as the lies kept growing. She didn’t know how she was going to get out of all this. She certainly knew she was going to strangle Trenton as soon as Ms. Ellis left.</p><p>“Sounds perfect. We’ll put a hold on this transfer and give you the time to get things done,” she said, as she stood up, once again shaking Trenton’s hand and then walking out the front door. She hadn’t even bothered to say goodbye to Jennifer. Once she knew the coast was clear, she turned toward Trenton with murder in her eyes.</p><p>“How dare you lie to her, you pompous, self-serving, arrogant man? When this wedding doesn’t take place, she’ll think I’m a liar, as well as incompetent, and they will take Molly from me for sure,” she yelled, as she stalked closer to him. She’d never in her life wanted to physically hurt someone, but at that moment she wanted to hit him repeatedly.</p><p>Trenton watched Jennifer and felt his body spring to life. Her anger was an impressive thing to watch and he found himself wanting her so badly he hurt all over. He smiled, which caused her eyes to spark, and her face to redden. He was fascinated with her reaction and found himself wanting to push her buttons even further.</p><p>She came toward him with her hand raised. He didn’t know if she planned on slugging him, or scratching his eyes out, but he didn’t give her time to do either. He pulled her into his arms and kissed her with so much heat, he didn’t know how they both didn’t combust.</p><p>She struggled with him for a few moments and then her anger quickly turned to passion and they were both clawing all over each other. He lifted her onto the counter and was getting ready to part her robe and sink deep inside her when he heard a noise behind him. He could barely turn his head in his passion filled haze but was grateful he did because Molly was standing in the doorway, with her sleepy eyes on them.</p><p>Jennifer hadn’t yet spotted her and was still clinging to him, needing him to finish what he’d started. He backed away from her and she whimpered, feeling cold and empty without him pressed against her. It took a moment, but she finally looked over and spotted her niece and then her face heated with embarrassment. She prayed her innocent niece hadn’t seen too much. She quickly checked both her clothing and Trenton’s, and was relieved to find everything was perfectly covered.</p><p>“Good morning, Angel,” she said through a tight throat.</p><p>“Morning, auntie, I’m hungry,” Molly replied and sat at the table, acting like it was nothing to find her aunt locked in the arms of a man in the kitchen.</p><p>“I’ll make you some pancakes,” she said and quickly got to work on them, glad to have something to do to take her mind off Trenton and the custody situation for a few moments. As her heated skin cooled and her mind had time to think, she began to stress once again, wondering what she was going to do and how she was going to get out of her current predicament.</p><p>She finished the pancakes and sat at the table with Molly, drinking in the sight of her. She couldn’t let her go, she was so precious to her and it would break both of their hearts to not be together.</p><p>Molly finished her breakfast and went into the living room to watch a movie while she woke up. Jennifer finally turned on Trenton, ready to have it out with him.</p><p>“How could you have lied to her? She’ll know you made the whole thing up and then blame me for it. Hell, I’ll be lucky to even get to visit with my niece after all this,” she finished on a tear choked voice.</p><p>“I didn’t lie. I heard your conversation with her and found you the best solution. We’ll get married and you can keep your niece,” he said in a matter-of-fact tone. She stared incredulously at him.</p><p>“I can’t get married to you.”</p><p>“Then you’ll lose your niece.” He spoke the words without any emotion, never breaking eye contact. She stood there, letting what he said sink in. Could she marry a man for any other reason than love? She’d have said never, even an hour ago, but she couldn’t lose her niece and if marriage was the solution to keeping her, then what could it really hurt?</p><p>She thought back to their conversation weeks ago about arranged marriages and how he was convinced all marriages were about convenience. Marriage to him was nothing more than a contract. He wasn’t offering marriage on an emotional basis, it was purely business to him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Why would you do this, you have nothing to gain?” she finally asked.</p><p>“In case you haven’t noticed, we’re great in bed together. That’s worth a wedding ring,” he told her and she flinched. He was trading a wedding ring for unlimited sex. Could she really sell herself like that? It wasn’t like sleeping with him was a hardship, but still it seemed so cold. She had to blink away the tears as she thought about it. She turned from him, looking out the window.</p><p>“I need to think about all of this.”</p><p>“There’s nothing to think about, Jennifer. You either do this for your niece, or not. A wedding takes time to plan and I already told Ms. Ellis we were marrying in a week, so you need to decide now,” he said, still in that cold voice. He was pushing her into a corner and she wanted nothing more than to run away. She looked into the living room, at her niece, who was so content in that moment. She’d opened up so much more in the last months and Jennifer knew if she went into the foster care system she’d quickly retreat again. She’d think her aunt had abandoned her. She couldn’t let that happen.</p> <p>“Fine,” she said, barely above a whisper. She wouldn’t turn and look at him when she spoke the single word. He didn’t need any clarification - he knew he’d won the battle.</p><p>“I’ll get it arranged,” he told her and walked out her front door. She felt like she’d just sold her soul to the devil, but she’d have done much worse if it would keep her niece safe. She joined her on the couch, pulling her close, needing to remember her own life didn’t matter - it was about Molly, who she was responsible for.</p><p>Trenton left the house feeling guilty about pushing Jennifer into a corner, but he knew he couldn’t let her go. He didn’t want to give her time to think of any other solution. He wanted her to be his wife, and when he wanted something, he always went after it until it was his.</p><p>Jennifer was stunned by how quickly things happened after one simply stated word. She got a call later from Emily Anderson, congratulating her on her upcoming marriage and asking her to come over so they could go over wedding details. She’d reluctantly accepted the invitation, not wanting to make a big deal over a fake marriage, but also not wanting to hurt Emily, who had become a friend to her.</p><p>She arrived at the ranch, where all the Anderson women were, along with Trenton’s siblings and cousins. The house was full of people and items. She’d been invited to stay at the ranch, though it had been more of a command, so they could get all they needed to get done in the short amount of time.</p> <p>She’d been excused from work, as she was busy day and night for the wedding, and she didn’t see Trenton alone, not even once. She spotted him here and there but always from a distance. The looks he sent her caught her on fire, though. He seemed just as hungry for her as she was for him and she had a feeling their wedding night was going to be explosive.</p><p>She was measured, waxed, plucked and put through every beauty treatment she could ever possibly imagine, and before she knew it, her wedding day was there. She told everyone repeatedly she didn’t want a large wedding but no one listened.</p><p>She stared at herself in the full length mirror, in one of the guest rooms, at the ranch and could barely recognize herself. She loved her dress, all white, poufy and filled with beads and lace. It was a dream dress and she couldn’t bemoan the gown in any way. Her hair was swept off of her neck, held in place by clips, beads and a sparkling tiara. Her make-up had been applied by an expert and she felt beautiful.</p><p>“Aunt Jennifer, is it time?” Molly, who looked like a miniature version of herself, asked.</p><p>“I think so, beautiful,” she said, causing Molly to giggle.</p><p>“I’m a princess,” Molly said and spun in a circle. She looked like a little princess in her white dress and tiara. She looked so beautiful it made Jennifer’s throat ache for her sister who would never get to see her child grow. Sometimes the world was a cruel place and she vowed to never let her sister’s memory fade. Molly would know her well.</p> <p>“Yes, you’re the prettiest princess in the land,” Jennifer told her, which caused her to giggle more. There was a knock on the door and George stepped in.</p><p>“You’re both stunning creatures,” he said and Molly beamed at him.</p><p>“Thank you,” Jennifer said shyly. She’d grown fond of George. He was a wonderful man, and she was grateful to be a part of his life.</p><p>“I’d be honored to walk you down the aisle, since your father couldn’t be here,” he offered, causing her eyes to fill up, again. He was such a gentle and kind man and she hated he didn’t know the real reason for the marriage.</p><p>“I would be the one honored,” she replied. He handed over a tissue and she got herself composed again, before stepping out the doorway. The wedding went by in a blur and before Jennifer knew what was happening, the preacher was pronouncing them man and wife.</p><p>“...man and wife, you may now kiss the bride,” he said and Trenton didn’t waste any time. He pulled her into his arms, which wasn’t an easy task, considering the yards of fabric separating them, and took her mouth in a passionate kiss. She found herself greedily sipping from his lips and wishing they were alone. He hadn’t so much as touched her once since the night after the Christmas party, and she reacted to him like she was starving.</p><p>“Okay, you have plenty of time for that, later,” someone yelled from the crowd, making Jennifer’s face heat up, so she really did look like a blushing bride. Trenton, on the other hand, turned toward the crowd with a triumphant expression, causing much laughter.</p><p>“I can’t wait to get you alone,” Trenton whispered, making her face stay in a constant state of redness. He led her down the aisle and she was overwhelmed when they stepped outside.</p> <p>The area had been transformed, with a huge tent set up with heaters, a dance floor, and waiters carting food and drinks, plus a full band. It was amazing how much the family had accomplished on such short notice.</p><p>As soon as they stepped onto the dance floor, the band started a slow song and Trenton pulled her into his arms and the rest of the world melted away. She didn’t know how long she swayed around the dance floor in his arms, but she could have done it the entire night.</p><p>“It’s time to cut the cake,” George announced and they did all the obligatory things a new groom and bride does. She danced with a few other people, but Trenton always seemed to find her quickly and take her back for himself. It made her feel wanted and like it was a real wedding, after all. She was nervous about their wedding night, though, as she didn’t know how she was supposed to behave.</p><p>She knew they certainly had chemistry and being in bed together wasn’t going to be a problem, but it was all those little things she was unsure about. Did she kiss him when she felt like it, or touch him casually? Did she meet him at the door after work? She didn’t know how he was expecting her to behave. What really shocked her was she wanted to greet him at the door with a smile and kiss and she wanted to wrap herself in his arms and not just for lovemaking. She was completely in love with him, where he was just in lust with her.</p><p>That last thought scared her more than anything, because lust would eventually fade and she was terrified he’d grow tired of her. At least by that point Molly would be safely adopted by her and she’d always have the memories to look back on.</p><p>“I want to leave, now,” Trenton whispered. She nodded her head, wanting to be alone as well. Molly was staying the next several days with Emily and Mark, so she could have a real honeymoon and she had the feeling she’d have nothing to worry about during that time as they most likely wouldn’t even leave their bed, let alone their room.</p><p>“I have a surprise for you,” he said as he whisked her down the aisle with people yelling out to them and throwing birdseed. She fell in a heap into the back of a huge limo, full of laughter as she turned in his direction. Her breath caught in her throat at what a stunning sight he was. His tie was loosened, along with the top few buttons of his dress shirt, and she found herself itching to reach up and feel the gloriously smooth skin of his chest. She wanted to finish unbuttoning the shirt.</p><p>As if he could read her thought, she watched Trenton’s eyes, as they darkened and then he pulled her onto his lap. She was still wearing her huge wedding gown and he had trouble getting her situated but his mouth came down on hers in a demand and she easily accepted the challenge, clawing her fingers through his hair and greedily tasting the contours of his mouth.</p><p>She couldn’t believe how wanton she was in his presence. The cool, reserved girl was instantly burned alive by the passion his touch invoked. He growled low in his throat and then pulled back from her. He pushed her head down on his shoulder and she couldn’t help but to gently bite the skin there. She felt a tremble rush through his body and smiled in satisfaction she was the one who’d caused it.</p><p>“I’m trying to pull myself together and talk to you,” he growled, though his hands were running all along her back and hips, making her squirm on top of him and lick even more at his exposed throat. He finally gave up and lifted her head to take her lips again, causing her to shudder and move to get closer. She wasn’t so in love with her dress anymore, as it was keeping them too far apart.</p><p>They continued to love one another in the back of the car and she had no idea how much time passed but eventually the limo stopped and the door opened. She looked up through her lust filled eyes at the open door and Trenton reluctantly released her. He stepped from the limo and helped her out.</p><p>She stared in wonder at the huge home before her, not having any idea where they were. She’d expected to be taken to some hotel, or even his private jet, to be whisked away. He’d been very secretive about their honeymoon. After their long business trip not long ago, she hadn’t felt a need to go anywhere far, preferring to not be from Molly too long, but had left the decision up to him. She hadn’t expected to be at some home, though. Maybe they were making another stop.</p><p>It was a huge three story house with large beams, decks, and lights glowing. The front door opened and a man in a uniform seemed to be waiting for them. Maybe it was one of those hotels, which were exclusive and looked like homes, she thought.</p><p>“This is your wedding present. The house is in your name so no matter what happens you’ll know you’re always safe,” he said. It took a few moments for his words to sink in. He’d bought her a house as a gift. She was so stunned she didn’t know what to say. The gift she’d gotten him, which was sitting in her bag, seemed silly now. She couldn’t accept a house from him. She could live there as long as they were married, but when the fairytale ended, she couldn’t keep the place. She was still overwhelmed and thrilled he would do something so generous.</p><p>“I don’t even know what to say. It seems far too simple to say thank you, but thank you so much...” she said with a tear choked voice. Her heartfelt thank you filled him with a warmth beyond compare of any other words spoken to him. One thing he knew was that she wasn’t greedy. He’d never bought such an expensive gift for a woman before, but then no other woman had deserved it. He’d paid hundreds of thousands on jewelry and the women he’d been with in the past had simply looked at the pieces with greed. Jennifer looked at the home with love. That was one of the reasons he knew he’d never let her go. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Would you like to go inside?” he asked with a chuckle as she just continued to stare at the place in awe. She snapped out of her trance and smiled at him with joy in her face.</p><p>“Very much so,” she told him and then he was having to catch up to her as she kicked off her heels and jogged up the stairs. She greeted the man at the door, who was their butler and entered the home, gasping in delight.</p><p>For the next half hour he followed her as she explored every inch of the home. He wanted to explore one room and one room only, but he couldn’t take away her pleasure. Each new thing she found sent delight into her expression. She even kissed him a few times and it took all his will-power not to pull her tightly against him and carry her off to their bedroom.</p><p>“Oh, Trenton, this place is the most amazing house I’ve ever seen. It’s beyond perfect, there just aren’t words enough to express how in love I am with it. I’m going to get lost, it’s so dang big and the library is incredible. I can’t wait to go swimming. I want to keep exploring, forever, thank you,” she gushed, throwing her arms around him.</p> <p>Trenton couldn’t take anymore and quickly pulled her in tighter, pressing his lips against hers, leaving no doubt it was time to explore their bedroom. Her eyes dilated and she went from excitement to passion in a heartbeat. He swept her into his arms and practically ran up the stairs to reach their bedroom.</p><p>He groaned in frustration at all the tiny buttons on the back of her dress, but didn’t want to rip her special gown, so he gritted his teeth as he exposed her perfect, milky white flesh a half inch at a time. When the gown finally fell to the floor and he saw the tiny wisps of lace barely covering her body he lost the rest of his control and tumbled her to the bed.</p><p>He didn’t care if he destroyed her delicate lace because he needed to touch her flesh and she seemed to be just as needful of him, by the sounds coming from her throat.</p><p>He ran his hands along the silky length of her hair, slowly removing the pins holding it in place, causing her to sigh.</p><p>He slowly moved down the arch of her back, touching her nearly naked skin, causing her to want so much more from him, but too afraid to ask. She wanted to be confident enough to simply take and demand from him but she couldn’t, so she simply enjoyed his caresses, praying he wouldn’t stop.</p> <p>Trenton growled low in his throat as he crushed Jennifer against his hard body, feeling her soft breasts smash into him. He quickly ripped his shirt off, needing to feel their naked skin brushing together. Her bra was unclipped and then there was nothing to block him from feeling her hardened nipples pressed into his chest. He ran his tongue down her throat, licking at her pounding pulse point and inhaling her scent.</p><p>She smelled so good, he couldn’t get enough of her. The feel, smell, and touch of Jennifer was quickly sending him over the edge of sanity. He didn’t think he’d ever get enough but he’d die a very happy man if he could continue trying.</p><p>She brought her hands up around his neck, pulling him closer. He loved it when she took the initiative so even though it killed him, he slowed down and let her explore his heated skin. He groaned his approval when her hands ran down his arms and circled to his backside and pulled his hips into her womanhood.</p><p>Trenton loved every inch of her luscious body, her shape, her texture, her essence, everything. He couldn’t imagine being with another woman and quickly lost his resolve of letting her slowly explore. He needed to take her.</p><p>Jennifer gasped as he lifted her up and tossed her on the bed. The look in his eyes just about made her over-excited body orgasm, right there. He looked almost out of control with passion, as he tore the rest of his clothing from his body and joined her on the bed.</p><p>“I need you so badly, I’m sorry,” he said between clenched teeth, with a bead of sweat trickling down his face. She was amazed she was able to bring such a strong man to the brink of losing control, and with a boldness she would’ve never thought she could possess, decided to push him all the way over.</p> <p>“I need you, too,” she whispered and moved quickly before he could pin her down beneath him. He groaned his disapproval of her movement, and then gasped as she pushed him over and quickly ran her tongue down his stomach.</p><p>“I c...can’t...” he tried to stop her, when he realized her intentions. She smiled up at him and then gripped his throbbing erection in her hand, rubbing it up the thick shaft, causing a bead of moisture to spill out of the tip.</p><p>He threw his head back on a groan of ecstasy when her hot mouth circled his head and she brought her head down on his aching staff. She was tentative at first, gripping him tightly in her small hand, rubbing up and down on the moistened shaft, as her mouth sucked on his throbbing head, licking up and down the length of him. She got bolder and started taking him deeper into her moist mouth, sucking him deep inside, causing his hips to jerk off the bed.</p><p>Trenton finally couldn’t take anymore without ending their love-making too soon. He gripped her head in his hands and pulled her up his body, loving the slick feel of their sweat slicked bodies rubbing together. The look of pure arousal in her eyes made his erection jump, almost painfully.</p><p>He flipped her onto her back and took both of her hands in one of his, pinning them above her head. He’d explode if she laid her hands on his body even one more time. His hot breath brushed against her face seconds before he locked his lips back onto hers, kissing her deeply, making her squirm beneath him.</p><p>With his other hand, he reached down their bodies and inserted his finger into her heat, groaning as he realized she was more than ready. She pushed her hips into his finger, crying out in pleasure as his lips continued to brush against her own.</p><p>Jennifer could feel her heart expanding so large within her chest she didn’t know how it didn’t rip right out. She loved him so much it seemed to be a constant ache the more he loved her body, the more she needed him. It was as if he was a piece of her soul now, and she wouldn’t be able to breathe without him.</p><p>The way his mouth moved along hers was so unlike any other kiss she’d ever experienced. He melted her bones, turning her into his slave with a simple swipe of his tongue. He held his body at her opening, teasing her with the tip of his head. She pushed her hips toward him, needing him to fill her up, and still he didn’t give them what they both wanted.</p> <p>“Please Trenton, I need you,” she cried out, seeing the triumph enter his expression and not even caring he held full control over her, because she knew it was equal. She knew he couldn’t have walked away from her for any reason and that gave her more confidence than she’d ever had.</p><p>He finally pushed into her and she couldn’t think about anything else but the pleasure she was experiencing. She jerked her hips upward, needing to not have even a scant inch between them. He started moving in and out of her, seeming to reach further and further with each powerful thrust.</p><p>She wrapped her legs around his back, pulling him tighter, making him really have to work to move his hips in and out of her heat. He released her hands and she immediately curled them into his back, clawing them up and down, pulling him even tighter into her. He reached around her hips, changing the angle of his penetration, making her cry out as her orgasm ripped through her body.</p><p>It kept washing through her, sending wave after wave of release up and down her spine, causing her breath to catch in her throat, and her back to arch completely off the bed. Trenton threw his own head back and cried out as he slammed deeply inside of her, spilling his seed deep within her womb.</p><p>She gripped him tightly, even after the shaking stopped, not wanting to let him go, not wanting to break the magical connection they’d created. She was so afraid of breaking the moment and losing the unbelievable closeness they shared.</p><p>“I’m crushing you,” he whispered on a gentle laugh and pulled her hands from his neck, slowly pulling them apart. She couldn’t stop the whimper from escaping her mouth. He chuckled again and turned them on their sides, still holding her close. His hand brushed her hair from her flushed face and he gently brushed his lips against hers, causing the whimper to turn into a sigh. His lips were so smooth and gentle, it caused tears to jump into her eyes and she quickly blinked them away, not wanting him to know how emotionally she was invested into their relationship.</p><p>“You’re stunning,” he said between gentle kisses, causing warmth to spread throughout her that had nothing to do with passion, and everything to do with pure love.</p><p>“You’re the one who’s stunning,” she told him, feeling herself blush. She didn’t know why she had such a hard time giving him a compliment.</p><p>“I’m sorry that was so hard. I seem to lose all control when I’m in your arms,” he said, as he continued caressing her body, causing heat to once again start to stir.</p><p>“Never apologize for wanting me. You make me feel things I never knew were possible to feel and I know you would never hurt me,” she said, meaning what she said. He’d never hurt her physically, but emotionally was a whole other story.</p><p>“Well, let me make it up to you, anyway,” he told her and then the talking ended for a very long time as he kept his promise and gave them both unbelievable pleasure late into the night.</p><p>Chapter Ten</p><p>Jennifer woke up and made a mad dash toward the bathroom. Thankfully, Trenton wasn’t there, as he normally was gone long before she woke up. The man couldn’t possibly get more than a few hours of sleep each night, but he was never less than perfect.</p><p>After her stomach was emptied, she started to feel a bit better and crawled into the shower to clean up and slowly made her way down the staircase. A new person had been hired to replace her and her last day had been a couple weeks ago and it was the first time in her life she had her days free.</p><p>She loved the time she got to spend with her niece and watched Molly blossom even more over the last few weeks, but didn’t like that their entire way of life depended fully on Trenton. She loved him more than she could have ever thought possible and even though they made love nightly, she knew he still held something back from her.</p><p>He had a full staff hired for the house, so it was hard for her to even be able to cook or clean. She tried to when she got a chance. Sunday’s were her favorite day because she’d talked him into giving the staff the day off, allowing her to prepare their meal and tidy the home.</p><p>“Auntie Jennifer, look at my pretty pancakes,” Molly said as Jennifer entered the kitchen. The staff had fallen in love with Molly instantly and pampered her at every possible opportunity. She had a giant pancake on her plate with a smiley face on it, made with whipped cream and strawberry syrup.</p><p>“That looks so yummy I think I may have to steal it from you,” she teased her niece.</p><p>“I’ll share with you,” Molly told her, holding out her fork with a bite on it. Jennifer took the bite and sighed dramatically, which made Molly giggle. They ate breakfast together and then decided to go and play at the park. It was a rare sunny day in Seattle and Jennifer was going to take full advantage of the fact.</p><p>Molly was having a great time playing with some other kids and Jennifer sat back on one of the benches, fighting nausea, hating she was still feeling unwell. She knew she was pregnant but was so afraid to confirm it. Then, she’d have to share her secret with Trenton and she didn’t want to yet. She’d be far too devastated if he was unhappy about the fact, and they hadn’t discussed children. She didn’t even know how long he planned on them being married, let alone if he wanted kids. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>He was amazing with Molly, but that didn’t mean he wanted to have his own kids, with a woman he didn’t love. She knew he cared about her in his own way because when he made love, he was passionate and loving but he never said the words and he was distant during the days.</p><p>She laid her head between her legs for a few moments, trying to get the nausea under control. She finally started to feel a bit better, grateful she wasn’t going to throw up in front of the people around her. She looked over to the swings and didn’t spot Molly. She looked around, not concerned at first, until she couldn’t spot her anywhere.</p><p>She jumped from the bench, calling out her name, looking over every square inch of the park and still not finding her. Soon, other parents joined in on her search and after about ten minutes she knew there was something desperately wrong. She immediately called the police and then Trenton, but never stopped looking.</p><p>Trenton arrived just as quickly as the police and after she explained the last area she’d seen Molly, Trenton pulled her into his arms. She finally allowed herself to break down and sobbed in his arms, terrified beyond anything she’d ever felt before.</p> <p>“I don’t know what could’ve happened. I looked away for only a moment and then she was just gone,” she told him, sobbing uncontrollably.</p><p>“We’ll find her, it will be okay,” he said soothingly, as he tried to comfort her. She was beyond being able to be comforted, though. She’d already lost her sister, she couldn’t lose her niece, too.</p><p>“We have to find her, I can’t believe I let something happen to her,” she continued to sob.</p><p>“This isn’t your fault,” he told her, lifting her face to his so she had no choice but to look into his eyes. She could barely make eye contact she felt so much guilt and misery. She didn’t answer him because there was no one else responsible but her and she’d messed up. She’d let her niece out of her sight.</p><p>“Mrs. Anderson, she’s not at the park. A couple of parents said they saw a strange man hanging around the park area and were able to give us a description. We think it’s a kidnapping and the best thing for you to do is go immediately home and wait by the phone. We’re going to send the FBI over to put a trace on your phone, but we think someone recognized you and they’ll demand a ransom,” the officer told her.</p> <p>Jennifer looked right through him, the terror overwhelming her. She couldn’t imagine anyone wanting to kidnap Molly. There was no need, Jennifer was a nobody, with nothing to give. She couldn’t even put the pieces together that she was married to a very powerful man and there’d be people who’d want to attack her because of that. Her brain finally shut down and she sunk into blackness as her body refused to face reality anymore.</p><p>Trenton swore as he caught Jennifer in his arms. He couldn’t believe he’d been so stupid as to not have assigned security to both her and Molly. He knew with his amount of money there were always people who resented him and would take from him if they got the opportunity. He had a wife and child to think about and couldn’t believe he’d allowed Molly to possibly be harmed.</p><p>He lifted Jennifer into his arms, carrying her to his car and drove quickly back to the house and carried her inside. She was starting to stir again as he laid her down on the couch and immediately placed a rag on her forehead.</p><p>“Molly,” she said hopefully, hoping for a moment it was nothing more than a bad dream.</p><p>“We’ll hear soon,” he told her and felt physical pain as he saw the terror enter her eyes again. He wished he would’ve been able to tell her everything was okay. He wished he could make it all go away and have the two most important females in his life be safe.</p><p>The officer was right, because they barely got the phone system set up when a call came in. Jennifer sat on the couch, shivering, caving in on herself, with silent tears streaming down her cheeks. Trenton wanted to fall apart himself. He was so scared something would happen to Molly, but he knew one of them had to stay strong and keep their head. He also knew Jennifer loved Molly more than her own life and was dealing with her terror by withdrawing. It was the only way she could survive the ordeal.</p> <p>“Just answer the phone, stay calm, ask as many questions as you can without angering the kidnapper, and give them whatever they want. Her life is worth more than any amount of money,” the agent told him seconds before he picked up the phone.</p><p>“I understand,” Trenton told him and then picked up the phone with a slight tremor to his own hand. He couldn’t mess up the phone call. He’d do whatever it took to get her back. He picked up the phone and spoke a curt hello into the piece.</p><p>“Trenton Anderson?”</p><p>“Yes,” he answered.</p><p>“I have Molly with me and for now she’s safe, but if you don’t do exactly what I say, then you’ll be the one responsible for her death. Do I make myself clear?” the caller asked.</p><p>“I understand,” Trenton said, having to control his rage. He heard the front door open and breathed a sigh of relief at the sight of his father, siblings and cousins. His entire family had arrived to support him and Jennifer.</p><p>He watched his cousins’ spouses immediately go over to the couch and surround Jennifer, pulling her into their arms and letting her cry on their shoulders. The women sat there crying together, while his family circled him, showing a wall of support that nearly brought him to his knees.</p><p>“I’m glad you’re not a stupid man. I want two million dollars in unmarked bills, non-consecutive numbers,” the man started. He gave dropping instructions, and a timeline for delivery. “If you do as I ask, you’ll be with Molly by the end of the evening, if not then you’ll be attending her funeral,” the man sneered. Trenton wanted to rip the man limb from limb and was amazed he was able to keep his voice calm.</p> <p>Trenton hung up the phone and felt his father’s hand on his shoulder. He was amazed at the comfort he felt from the simple gesture. He hung his head and took a few deep breaths, trying to control his rage. He explained everything to his family. He looked over at Jennifer, who had her eyes on him, seeming more alert, but still filled with terror.</p><p>He walked over to the couch, needing to hold Jennifer in his arms. He didn’t say a word, just sat down next to her and pulled her onto his lap. She laid her head on his shoulder and he ran his hands through her hair, both of them comforting each other.</p><p>“Please bring her back,” she finally whispered, making his heart ache with the trust she placed upon him.</p><p>“I will,” he promised and vowed to himself it would be one promise he’d make sure to follow through on, no matter what it took.</p><p>His father secured the money and then he was soon leaving the house, praying when he walked back in those doors it would be with Molly. He was terrified, not for himself but that he’d fail. He could care less about the money, it meant nothing to him. He only wanted Molly home. When she was, he and Jennifer needed to sit down together, because if he’d learned anything about the experience, it was Jennifer and Molly were his family now and he couldn’t live without them, not even one more day.</p><p>He followed the instructions the kidnapper set and soon was waiting in the designated spot, holding a bag filled with two million dollars. A child approached him and handed him a note saying to hand the bag over and walk down to the coffee shop a block away. He did as the note said and quickly made his way to the shop.</p><p>He walked in the doors and there at a back table was Molly, sitting by herself, drinking a glass of hot chocolate. He rushed to the table and pulled her into his arms.</p><p>“Uncle Trenton, you’re late,” she said as she took another sip from her cup.</p><p>“I’m sorry,” he told her, while taking his phone out and calling the agent, letting them know he had Molly and they could go after the kidnapper. He didn’t even care what happened at that point. He just wanted to get Molly home, back into Jennifer’s arms.</p><p>“That’s okay, the man said to wait here for you,” she told him and he was relieved she seemed to not realize what had happened. He wanted to ask her questions but he decided to just get her home and then go from there. He wouldn’t feel completely safe until she was under his roof once more.</p><p>“Let’s go home. Aunt Jennifer needs to see you,” he said, his voice coming out choked, she thankfully didn’t notice.</p><p>He walked to his car and drove back to the house. As he walked through the doors with Molly in his arms, the room exploded into action. Jennifer looked up, with her tear stained face breaking out in a huge grin. She jumped from the couch and pulled Molly into her arms and Trenton was never more thankful in his life to have been able to keep a promise.</p><p>She looked over Molly’s head, her eyes connecting with his and gave him a completely unguarded smile and he couldn’t resist pulling them both into his arms. He vowed to always keep them safe.</p><p>“Thank you, Trenton. Thank you so much, I love you,” she sobbed, which shook him to his very core. She’d never spoken those words, before. He knew she was vulnerable at that moment but he knew it was right. He knew they were going to be okay. He kissed her gently, wanting to feel her soft lips beneath his own, wanting to make sure the moment was real. Molly giggled, breaking their spell and he kissed her on the nose, which caused her to giggle even more.</p><p>“I need to talk to my family and then we’ll have a big dinner to celebrate,” he told Jennifer, kissing her again. She smiled at him and took Molly upstairs, he was sure to bathe her and check every square inch of her body. He headed over to his father, needing to speak to him.</p><p>Just as he was about to pull him aside, there was a knock on the door and the agent he’d called stepped inside with a huge smile on his face.</p><p>“We caught the guy. The idiot was in a rundown vehicle that wouldn’t start so he was still in the area. He was barely older than a teenager and trying to make some easy money. The good news is I don’t think he had any desire to hurt the child, but he will still be locked up for a very long time and your family has nothing to worry about,” the agent said.</p><p>“Thank you for your hard work. I’ll let my wife know,” Trenton said, shaking the man’s hand. He left them and Trenton pulled his father aside, needing to talk to him. They took a walk outside and as if his father knew he needed to gather his thoughts, he walked silently next to him.</p><p>“Dad, I’ve been really unfair to you. When we lost mom, I couldn’t cope with the pain, so I withdrew from the world, including you. I knew it wasn’t your fault but you were my father and I did blame you, and I’m sorry. I never thought about the pain you must’ve been experiencing, but now with Jennifer in my life, I can’t imagine what it would be like to lose the love of your life. I’m sorry for pulling away, and I’m sorry for the pain you must still live with today,” Trenton told his father.</p><p>“I love you, Trenton. Those words mean more to me than you could ever imagine. I also withdrew from everyone, just trying to figure out life without your mother. I loved her more than anything in this world. She was my rock, and the glue holding us together, but I think we’re on the mend. I think we’re still the family we’ve always been. We just got lost for a while,” George said. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The two men gave a genuine hug, feeling the pain begin to fade and it was again like things were when his mother was still alive. Trenton felt complete</p><p>“I need to talk to Jennifer,” he said and jogged into the house. He couldn’t wait even one minute more to hold his wife in his arms. He needed to shout his love to the ends of the world and he needed her forgiveness for the way he’d held back from her, because nothing else mattered if she wasn’t by his side. He’d been so afraid of opening his heart, he’d almost passed on the greatest relationship he could possibly be in. He loved her, she gave him something he didn’t even know he’d needed until she was a part of his life.</p><p>He quickly scaled the stairs and found her in Molly’s room. She must’ve been exhausted from her day, because she was sound asleep and Jennifer was rubbing her head, staring down at her. He walked over to both of them and rubbed along Jennifer’s back.</p><p>“She was tired so I gave her a bath. There’s not a single bruise on her, thank goodness. I laid her down and she was out instantly. I haven’t been able to leave her side, though,” she said.</p> <p>“She’ll be fine, now. Come with me, I want to talk,” he spoke softly. She looked up, startled by the tone of his voice and then reluctantly rose from the bed and followed him over to their room.</p><p>“What is it?” she asked nervously. She was afraid her declaration of love may have scared him.</p><p>“Jennifer, today has been the worst day of my life. I’ve never been so scared. You and Molly have become such an important part of my life, and I can’t imagine being without both of you,” he started, and her worried frown disappeared.</p><p>“We feel the same,” she told him cautiously, not sure where the conversation was leading.</p><p>“I’m sorry for the way I’ve acted with you. I’ve guarded myself for so long I haven’t known any other way, but the thought of losing Molly today woke me up. I love her and would love to adopt her, making her my official daughter. I also love you Jennifer, and want to make this marriage a real thing,” he said, watching her face. It took her a few moments to understand what he was saying and then she surprised him, by leaping into his arms.</p> <p>“Yes, Trenton! Yes, a million times over. I love you so much and I want this to be about us and nothing else,” she cried, filled with joy.</p><p>“I also want about twenty more little Molly’s running around,” he said with a huge grin. Her eyes widened at his words and her heart burst to overflowing.</p><p>“I don’t know about twenty, but I think I could manage one more in about seven months,” she said and waited for her words to sink in. His eyes grew large and then he surprised her by dropping to his knees and grabbing the bottom of her shirt, lifting it up to look at her still flat stomach. “It’s too soon for me to be showing yet,” she added with a giggle.</p><p>“You really are pregnant?” he asked her with hope shinning in his eyes.</p><p>“I haven’t taken a test, yet, but I’ve missed my last two cycles, and I’ve had horrible morning sickness.”</p><p>“Thank you, Jennifer. You’ve given me so much more than I could have ever imagined I would even want. I love you and I’ll protect you the rest of your life,” he promised. He kissed her stomach reverently, causing the tears to spill from her eyes. She was filled with more joy than she ever thought could be possible. They made slow, sweet love and made the family wait on them for quite a while. None of them minded one little bit.</p> <p>Epilogue</p><p>“We have done really well,” George said quietly, as he held his tiny granddaughter in his arms. She was only two weeks old and the most precious thing in his life. “I can’t believe I have two beautiful granddaughters in only a year’s time,” he said with awe.</p><p>“Well, us Andersons have never been known to do anything by half measures,” Joseph said, holding one of his own grandkids. Both men would be extremely happy to have a child in their arms daily for the rest of their lives.</p><p>“Jennifer’s such a wonderful woman and she loves Trenton so much. Since she’s come into his life, I see my boy happy and filled with life once again,” George said. He’d grown close to his daughter-in-law. She was a true ray of sunshine.</p><p>“Grandpa, it’s time for dinner,” Molly said, as she ran into the room. “Dad says they’re going to eat everything if you don’t hurry,” she finished.</p><p>Jennifer and Trenton had officially adopted Molly and she’d started calling them mom and dad one day. They hadn’t made a big deal out of it but George saw the joy in both of their faces that Molly loved them so much.</p><p>“Okay, baby girl, we’re coming,” he reassured her. She ran off ahead of them. The two brothers walked into the huge dining room, where their family was surrounding a huge table. There was laughter throughout the room and the men took in their family with a sense of joy and peace, unlike anything else they’d ever achieved in their many years.</p><p>“No amount of money can replace a great family,” Joseph said.</p> <p>“Agreed,” George said, patting his brother on the back. “Thank you for bringing us together, again.</p><p>“So, who’s next?” Joseph asked with glee. He couldn’t wait to get started on the next kid.</p><p>“I’m thinking it’s time for Max to settle down. He’s certainly been coming around more since we moved, but we still haven’t gotten back to where we once were, and I think a good woman would fix things,” George answered.</p><p>“Well then, we’ll have to figure out a plan after diner,” Joseph said. As if Max knew they were talking about him he looked up and gave them a suspicious look. The kids were getting slightly suspicious since they were all falling so quickly. If they could confirm their suspicions, the two men would be in serious trouble.</p><p>“Let’s enjoy a great meal,” George said and then the two men joined their family. </p> </body></html>"]