["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Chapter One</p><p>Some bodies just wouldn’t stay buried–no matter how much dirt you shoved on top of them. Those bodies...they just kept digging out of their graves.</p><p>And chasing a girl until she was so damn tired of running. So tired that she’d consider trading her own soul, just for a few moments of safety.</p><p>Paige Sloan stared up at the high stone walls of the werewolf compound. It had been ten years since she’d last been inside of those thick walls. Only she hadn’t been looking for protection back then. She’d been looking for love.</p> <p>Will he even remember me?</p><p>Paige stood there, trembling from the cold–she hated the bone-numbing cold of Alaska–and then she heard footsteps coming her way. Strong. Determined. She sucked in a deep breath and straightened her shoulders. Showtime. She just had to play this bit right and get past the guards. Paige lifted her arms into the air. “I’m not carrying a weapon!” Better to just go ahead and get that part out early.</p><p>Werewolves could be too unpredictable. She didn’t want them attacking first, then trying to get answers from her cold, lifeless body later.</p><p>The gate opened with a screech. Two men came rushing out. They weren’t carrying weapons. Then again, they didn’t need to carry extra firepower. If they wanted, she knew those two men could shift into powerful wolves in an instant.</p><p>Most humans didn’t realize the truth about the world that surrounded them. Humans thought monsters were make-believe. Just stories to scare children in the darkness of the night.</p> <p>If only.</p><p>Paige knew monsters were real. They were the nightmares that walked the earth.</p><p>“Vampire...” One of the men snarled the accusation at her, and just that quickly, his claws burst from his fingertips.</p><p>Under the moonlight, she saw his nostrils flare and knew the guy had caught the scent that revealed her for exactly what she was.</p><p>A monster. A vampire.</p><p>“You want to die, vamp?” The other guard demanded. He was the taller of the two, with close-cropped, dark hair, and huge, hulking shoulders. “Is that why you’re here?”</p> <p>Well, they weren’t trying to rip her open yet, so that was a good sign. Paige cleared her throat and kept her hands up. “Technically, I’ve already died.” That was how she’d become a vamp and–</p><p>The smaller werewolf lunged at her. Smaller, but still wicked strong. He wrapped his claws around her neck and snapped, “You’re about to die again.” His dark eyes promised a world of pain.</p><p>She could do without that promise. Been there, done that. Not really interested in that scene again, thanks.</p><p>Paige didn’t fight his hold, not yet. If things got desperate, then she’d be the one delivering the pain. But first... “Drake ...” She whispered the name that had haunted her memories and a small, icy cloud appeared before her mouth. She ignored the cold and focused on what mattered right then. She needed these wolves...and their new alpha. “Drake Wyler.”</p><p>The werewolf holding her leaned in even closer. She could see that his blond hair was long, brushing his shoulders, and his face was all hard angles and lines. “What do you want with the alpha?”</p><p>This was the part that would be tricky. Slowly, because she didn’t want to set the guys off, Paige lifted the long necklace that had fallen to rest between her breasts. She saw the blond werewolf’s eyes widen as he stared at the necklace. Stared at it–then hurriedly jumped the hell away from her.</p><p>That was right. No other werewolves were supposed to touch her, not when... “I belong to him,” Paige said simply.</p><p>And in an instant, those werewolves started tripping over themselves as they hurried to open the gate for her. Sure, they might hate her kind, but as long as she had their alpha’s protection, they couldn’t touch her.</p> <p>Well, not if they wanted to keep living.</p><p>Paige stared into that wolf compound. Dark. Dangerous. But, hopefully, not as deadly as what waited behind her.</p><p>And if she could just get the alpha to overlook that little matter of her vanishing for ten years...</p><p>Then maybe she’d have a chance of surviving the coming days and nights.</p><p>Maybe.</p><p>Maybe not.</p><p>The werewolves took her into the heart of the compound. Right inside the big, three story house with heavy stone walls that stood starkly against the night.</p><p>They walked into the foyer, and the tap of her boots seemed to echo on the marble floor. Marble. The wolves were kicking things up a notch. Normally, the vamps were the ones who liked to throw around their money.</p><p>She glanced down at her scuffed boots. Not that I ever had money to toss at anyone or anything.</p><p>But it looked like Drake had plenty of money now. And one big, fancy house. This place wasn’t where she belonged, and soon enough, she’d be leaving. After she took care of a little business.</p><p>“This way.” The werewolf on her right–the blond one who’d wrapped his claws around her neck moments before–was pointing to the stairs.</p><p>She nodded quickly and followed him up those winding stairs. Then they hurried down a hallway. Turned around a corner. As they headed down that quiet hallway, Paige got a really, really bad feeling in the pit of her stomach. “Are you taking me to Drake’s office?”</p><p>The werewolf beside her, the dark-haired one, just grunted.</p><p>That bad feeling got worse. This looked like private quarters to her. Like they were taking her–</p><p>A door jerked open to her left. And then, right there, bigger and even sexier than she remembered, with wide shoulders that brushed the edges of the doorframe, a muscled and bare chest, a wild curl of black hair, and eyes that blazed golden fire...right there stood the werewolf alpha, Drake Wyler.</p><p>The man she’d loved and lost before.</p><p>The man she needed now.</p><p>But at that moment, he stared at her with so much fury she almost felt the heat of his glittering gaze burn her skin.</p><p>“Paige.” Her name was a growl of rage. Okay, so coming here hadn’t been the best idea but–</p><p>His nostrils flared.</p><p>Hell. Her whole body tensed. With werewolves, their sense of smell was so strong that it only took one whiff to realize... “Vampire.” The word was a curse.</p><p>She didn’t flinch. Well, perhaps she did. When he’d known her before, his voice had always been softened with need, with love.</p><p>Not hardened with deadly rage.</p><p>He grabbed her, not with his claws out, like the other werewolf had, but Drake wrapped his hands around her shoulders and pulled her over the threshold of the room–and into his arms.</p><p>Then he kissed her. His lips pressed down on hers, and because she’d wanted him, for so long, Paige kissed him back. Her mouth opened beneath his. Her tongue met his, and the desire that only Drake seemed to be able to stir burned through her.</p><p>Her heart raced. Her hips arched toward him even as her nipples tightened against his chest. One kiss...and she craved. It was the way it had always been with them. She’d never wanted anything more than she wanted him.</p><p>And she’d never been meant to have anything less.</p><p>His tongue slid over her lower lip. Stroked into her mouth. Her wolf had become an even better kisser over the years. Seducing, taking, and making her want so much more. Making her–</p><p>Drake’s head lifted. He stared down at her–with that strong, chiseled face that often slipped into her dreams, a face that had a few more fine lines now, but the same square jaw, the same high cheekbones, and the same sensual but slightly cruel lips. His eyes blazed so brightly, and she could see the same raw lust she felt reflected in his stare.</p><p>The years hadn’t changed the way he felt. He still needed, just as much as she did. He still–</p><p>“Guess that means she is yours...” The blond werewolf behind them muttered. “A vampire...with a werewolf, how twisted is–”</p><p>Drake pushed Paige away and grabbed the wolf in one fast, brutal move. “I saw your claw marks on her throat.”</p><p>Paige lifted her hand and touched the skin. She felt the light wetness of her own blood. Huh. She hadn’t even noticed the sting. After all she’d experienced in the last ten years, what did few scratches matter?</p><p>“You don’t ever touch her.” Drake tossed the guy down the hallway. The smaller werewolf’s head thudded into a wall. “You come at her with your claws again, Michael, and I’ll rip you open.”</p><p>Ah, all right, so Drake thought that the scratches mattered. She hadn’t remembered him being quite so blood-thirsty.</p><p>He swung back toward her. The lust and fury were still battling in his eyes. This wasn’t the man she’d fallen for all those years ago. The guy staring back at her–he was a primal wolf.</p><p>“Make sure no one disturbs me,” Drake ordered and he stalked back toward her. She should speak. Say something. She hadn’t said a word to the guy yet. Maybe she should start with something like...Hi, there, long time, no see. You might wonder why I disappeared without a word. I’ve got a really good story to tell you.</p><p>More like a nightmare tale. A nightmare that she’d just brought to his door.</p><p>And the door closed behind him with a soft click. Her gaze flew around the room. She’d been right. This was definitely a bedroom. Complete with one huge, rumpled bed. But at least it looked like Drake had been sleeping alone. If there’d been a she-wolf in there with him, Paige might have just let her own claws out.</p><p>When he touched her, she jumped. Paige wanted to hide her fear, but being a werewolf, he could probably smell the scent on her. Werewolves had such damn superior senses. Better than anyone or anything else in the world.</p><p>His fingers brushed over the curve of her breasts. The guy had to slow down. This couldn’t happen. Not yet anyway. They had to talk first. “Drake, I–”</p><p>He lifted the necklace. Stared at the heavy gold etched with the carving of a wolf’s head.</p><p>She cleared her throat.</p><p>“Why are you wearing this?” Drake asked her, his voice the rumbling mix of darkness and lust that had always been able to make her yearn.</p><p>She was yearning already, but she pushed back the need and focused on what the guy was saying. Her necklace. He’d given it to her when she’d turned nineteen. The day he’d told her what he really was.</p><p>Werewolf.</p><p>That had been the day when her life had started to spiral out of control.</p><p>Time to woman up and talk. She swiped her tongue over her lips, tasted him, and managed to say, “Y-you told me...you said a werewolf would never attack me if I wore it.” The necklace had been a sign of pack protection.</p><p>His strong, tanned fingers closed around the necklace. Then he yanked and broke the gold chain in one vicious tug that seemed to claw across her heart. “I told you,” he said, voice even darker, “that this necklace meant you belonged to me.”</p><p>Ah, right, that rage was burning so bright in him.</p><p>“But then you left.” A muscle jerked in Drake’s jaw. “Disappeared.”</p><p>Paige backed up a step. When a werewolf this big and angry was coming at you, a smart woman backed the hell up.</p><p>“You vanished,” his fingers had whitened around the necklace, “when you were supposed to be mine.”</p><p>Yes, a human named Paige Sloan had promised to love him, always. But then she’d stopped being a human, and she’d become the one thing that she knew he hated.</p><p>Vampire.</p><p>“You don’t taste like death,” Drake told her.</p><p>She flinched at the cold and brutal words. Werewolves always were saying that vamps smelled and tasted like death–that was one of their many insults. So why hadn’t she expected that slam from him? Her chin lifted. “And right now, you don’t look particularly furry.” She’d never actually seen him shift. She didn’t want to, either. Paige squared her shoulders and held his gaze. “I guess we’re both full of surprises, huh?”</p><p>“You can fucking say that again.”</p><p>Her back teeth clenched together. She hadn’t expected the guy to run to her, wrap her in his arms, and immediately swear his undying love. She’d let that dream die a long time ago. But, jeez, did he want to rip her soul out or what? “Look, I know you aren’t exactly happy to see me–”</p><p>He advanced. She backed up once more. The last thing she wanted was for him to put those big, warm hands of his on her again. When he touched her, her body went into sexual overdrive. She’d gone way too long without a lover.</p><p>No one but him.</p><p>Right. Too damn long.</p><p>But lust had to wait. For now.</p><p>“Do you know how long I looked for you?” Drake demanded. She could see the edge of his fangs. Probably not a good sign. What was that saying in the vamp world? When you saw a wolf’s fangs, you were about to see hell. He shook his head slowly and said, “You vanished.”</p><p>It wasn’t like she’d wanted to leave him. But he’d been marked to be the next alpha of his pack and she’d been–</p><p>Bitten.</p><p>“I didn’t think you wanted a vampire turning up on your doorstep.” Some of her own anger–the anger she usually worked so hard to keep in check–broke through her fraying control. “Even if I was a vamp that you used to screw.”</p><p>He pounced. She should have expected the move, but she’d been around humans too long, and werewolves, damn, they could move fast.</p><p>In two seconds, he had her on his bed, sprawled amidst the covers, while he held her arms penned to the mattress. “You weren’t a vampire then.”</p><p>His muscled body pressed against her. No, correction, his aroused body pressed against her. There was no mistaking the bulge of his cock.</p><p>“You were human then,” he said, and his hold tightened around her. “Not vampire, not–” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>What she’d been didn’t matter. “I’m a vampire now.” His sworn enemy. Only...he still wanted her. She’d thought werewolves were supposed to be repulsed by her kind. She’d sure been told that often enough.</p><p>The voice from her nightmares whispered through her mind, saying, “Do you think he’ll ever want you again? One look, one taste...as soon as he knows what you are, you’ll be dead.”</p><p>And she wouldn’t be able to rise again.</p><p>She waited to feel claws at her throat again. Because she didn’t want to see this end, Paige closed her eyes. She’d remember him as he used to be. If only Drake could remember her the same way.</p> <p>Some dreams just weren’t meant to come true.</p><p>Paige took a breath, tasted him–strength, power, man–and waited for her second death to come.</p><p>Chapter Two</p><p>A ghost lay beneath him. A ghost who’d haunted more nightmares than Drake could count.</p><p>She was as still as a statue, her features pale and perfect. High, curving cheekbones, a small, pert nose, and lush, red lips made for sin. Her hair–dark as the night he’d always loved–tangled around her face.</p> <p>And she didn’t move. Barely seemed to breathe.</p><p>Why?</p><p>“Do it,” Paige whispered, her voice still that same combination of sin and seduction that had driven him to the edge too many times in the past. “Just...make it fast.”</p><p>He really hoped she wasn’t talking about sex. With her, fast hadn’t ever been an option. He’d always needed to take her again and again, to erupt inside of her, to lose himself.</p><p>She lifted one eyelid just a bit. Her green gaze darted over him. “You’re not...you’re not killing me?”</p><p>What. The. Fuck. It took every ounce of his will-power to hold back the rage that threatened to swamp him. “Not yet,” he managed to snarl.</p> <p>Paige trembled beneath him. Her slender body had trembled beneath his before, but back then, those little shivers had been from pleasure.</p><p>Not fear.</p><p>He could all but smell the fear covering her. He hated that smell on her.</p><p>“How.” Drake bit off the world. How had she become a vampire? Had she chosen this life? Some humans wanted to be vampires. They went out seeking the bite because they wanted to live forever.</p><p>Fools. The price of forever was a river of blood and death.</p><p>He hadn’t thought Paige would be like those desperate humans. He also hadn’t thought she’d vanish and leave him aching for her–ten damn years.</p><p>“It doesn’t matter,” she told him and both of her eyes opened fully as she gazed up at him. “I can’t change what I am.”</p><p>The scent of her blood filled his nostrils. When he got hold of Michael again, he was gonna give that claw-happy werewolf some marks to remember him by. You don’t touch her.</p> <p>Drake caught both of her wrists in his left hand and raised them over her head. She wasn’t fighting him, and as a vampire, her delicate form was hiding one hell of a lot of strength.</p><p>She just stared up at him, reminding him of all the stupid dreams he’d once had...and lost.</p><p>He’d almost left his pack for her. He’d wanted to be human. For her.</p><p>But now, the beast was in charge. There was no going back. There was only blood, death, and darkness.</p><p>For both of them.</p><p>He gazed down at her, trying to figure out when she’d stopped being human and become a vampire. She’d been nineteen the last time he saw her. He’d been twenty-one.</p><p>Right then, Paige’s skin was still flawless and pure, giving no hint to her real age.</p><p>What did her age matter? She was right. There was no going back. Not for either of them.</p><p>“Are you going to glare at me all night?” Paige asked. “Or do you want to know why I’m here?”</p><p>Why she was there...and still wearing his medallion. Or she had been wearing it, until he’d taken it from her neck. It was on the floor now. He’d dropped it when he’d pushed her onto the bed. Paige’s neck was bare, and...why the hell did he want to bend down and lick her flesh?</p><p>Because I still want her. More than breath. More than life. He saw her, and he needed.</p><p>“Why?” He didn’t lift his body off hers. Paige would feel his aroused flesh pressing against her. So what? If she wanted a favor from him, she’d pay the price he demanded.</p><p>And I demand her.</p><p>Vampire or not, she was still his.</p><p>Even death couldn’t change some things.</p><p>“I’m being hunted,” she told him in that low, husky voice that made his cock swell even more. He could just see the hint of her fangs behind her red lips. The sight should have repulsed him. It didn’t. “If you don’t help me, I’ll die.”</p><p>“You’re already dead.” That knowledge made him feel as if his chest had been ripped open. Since Paige had been human when he’d known her before, she must have been made into a vampire.</p><p>A rare few, the purebloods, were actually born as vamps, but the rest of the parasites out there? They’d been turned. They were bled until the point of death, then brought back as a vampire.</p><p>Drake would kill the one who’d turned her. He couldn’t wait to hear the vampire’s screams.</p><p>“Don’t say that,” Paige snapped at him, then she showed him just how strong she really was. She twisted beneath him and yanked her hands free. A fast roll sent them tumbling across the bed. Then she was on top of him. Her knees straddled his hips, and her hands slammed down against his chest. “I’m as alive as you are!”</p><p>Color stained her cheeks. Her breath heaved out. For an instant, they just stared at each other. Then she grabbed his hand and shoved it against her breasts.</p><p>“My heart still beats,” she told him and he could feel the frantic beat beneath his hand. That fast beat...and that sweet, plump flesh. Paige was curved in all the right places.</p><p>“I breathe,” she told him and he heard the rush of her breath. “I feel. More than you can imagine, all right? So stop treating me like shit!”</p><p>Maybe if she’d stop clawing his heart out...</p><p>But then, she was doing that just by breathing. Just by being there. Close enough to take...</p><p>So take her. The growl was from his beast, one that was never far from the surface these days.</p><p>“You want me to protect you.” He held the beast back, barely, because they had a deal to strike. He knew how these bargains worked in the supernatural world. So much could be bartered and exchanged. Flesh. Blood. Sex. Souls.</p><p>Sure, humans might be shocked by a deal like this–but then, humans would be shocked to see a man turn into a wolf.</p><p>Deal with it.</p><p>“You came to me, to my pack,” he said slowly, determined not to let his rage escape, not yet, “because you want us to keep you safe.” And he would. He–</p><p>“No.” She shook her head.</p><p>Drake frowned. If not for protection, then–</p><p>“I want you to kill the bastard after me.” Her fangs seemed to lengthen. “I want you to rip his head off, and I want you to make damn sure that he never rises again.”</p><p>Never rises again.</p><p>“You’ve got a vampire you want me to fight.” He’d grown used to battling them. In this part of Alaska, where the cold could creep straight to the bone, where darkness could reign for days and days...this part was home to all manner of supernatural beasts.</p><p>The ones at the top of the food chain? The wolves...and the vamps who kept trying to fight them for supremacy. A supremacy they weren’t ever getting.</p><p>“I’ve got a vampire I want you to behead.” Her breath rushed out. “A vampire named Gabe is the one who made me, he’s–”</p><p>Drake’s claws burst from his fingertips and sliced into the bedding. “He’s fucking already dead.” As far as Drake was concerned, the vamp–Gabe–had died the instant he put his fangs in Paige.</p><p>Her gaze held his, and he saw the worry there. “Gabe is a pureblood. He’s strong, he’s–”</p><p>“No match for an alpha.” Didn’t she get it? He wasn’t the boy she’d left behind. He was a warrior. A monster. A walking nightmare.</p><p>Since she’d left him, he’d seen more blood and hell than she could possibly imagine. No, he’d always known the blood and hell...Paige had been the only thing that had been good in his life.</p><p>Sweet. Pure.</p><p>Then she’d left him, and he’d gone back to the darkness.</p><p>She won’t leave again.</p><p>He stared up at her. He could move her easily enough, but he didn’t want to do so. He wanted to keep her just where she was, only he’d like to remove a few of her clothes. Or all of them.</p><p>But business came first. “What will you do for me?” Drake demanded.</p><p>She blinked. Vampires weren’t supposed to look so innocent. “I...um...”</p><p>He smiled and knew that his own sharpened teeth would flash. “Death doesn’t come for free. In the supernatural world, there’s always a price.”</p><p>He heard the slight hitch of her breath. “And what do you want?”</p><p>You.</p><p>But he wanted to play the game longer and see just what she’d offer him. “What have you got?”</p><p>Her gaze fell to his chest, but while she wasn’t looking at him, her slender shoulders straightened in a move he remembered. Pride. “I have some money. Not much, but a few thousand that I can pay–”</p><p>Drake laughed at that. A hard, deep laugh that sent her bouncing on him. Really? A few thousand to take out a vamp? She didn’t quite understand the paranormal market value. Most assassins wouldn’t touch a vamp for less than fifty grand.</p><p>Unless those assassins were werewolves.</p><p>Sometimes we do those hits for free. Depending on the vamp...and the blood and death that the bastard had left in his wake.</p><p>But she didn’t need to know about the free hits. That knowledge wouldn’t work in his favor.</p><p>“I can–I can fight with you. Help your pack.” Her gaze rose to meet his and a light flush still covered her cheeks. Her voice had hardened, probably because she was pissed by his laughter. “Having a vampire on your side wouldn’t be a bad thing.”</p><p>The laughter faded away and Drake knew his gaze hardened as he said, “I don’t want your strength.” She’d always had strength, even as a human. A solid core that had drawn him to her. Paige’s parents had both been killed when she was just thirteen. They’d only been in Alaska for a little over a year before their accident. Her parents had promised her that they’d all get a fresh start in America’s last frontier.</p><p>They’d only gotten death.</p><p>After their funeral, he knew that she’d bounced around the foster care system and never found a real home. But all that pain, it had never weakened her.</p><p>Wolves were attracted to strength.</p><p>“Then what do you want?”</p><p>Did she realize that her nails were digging into his shoulders? The wolf inside growled.</p><p>He liked that.</p><p>Time to take what he wanted. Drake stared up at her and said, “I want to fuck you.” Endlessly. Again and again until the ache for her, that damn gnawing ache that had kept his body tense and hungry for her–for years–finally vanished.</p><p>She stared down at him. Swallowed.</p><p>And nodded.</p><p>Chapter Three</p><p>So, what? Did the wolf think that she was gonna pull some kind of shocked, Oh, no, you can’t have sex with me! routine on him? When she’d been dreaming about him for so long?</p><p>Guess again, wolf. If he beheaded that sick freak Gabe and gave her the passion that she’d been yearning for, well that was just win-win in her book.</p><p>But she didn’t want to look too eager. A girl had her pride, after all, and she’d already had to come dragging into his compound looking for some werewolf strength.</p><p>Paige swallowed back that eagerness and slowly said, “Well, I guess once we can–”</p><p>“Not once, sweet, not even close.”</p><p>Sweet. He’d called her that, so long before. Only then the word had drifted with affection, and not held the tight, tense edge that honed the endearment now.</p><p>“H-how many times?” So she could plan. Savor.</p><p>His eyes burned up at her. His cock was also shoving right at the junction of her legs. It was all she could do not to rub against him. If she told him that there’d never been anyone since him, Drake wouldn’t believe her.</p><p>Even if the words were the truth.</p><p>Her body was starving. She was already wet for him. Just the touch of his hands had sent a shiver sliding over her. She wanted more. Just how much more would she get?</p><p>“As many times as I want,” Drake told her, voice rough and dark. “Until you can’t breathe without feeling me on every inch of your body.”</p><p>Her nipples ached. She wanted his hands on them. His mouth.</p><p>Did he smell her arousal? Those wolves...</p><p>His lips curled in the faintest of smiles. Damn him, he did.</p><p>His hands rose and tangled in her hair. He began to pull her toward him. Toward his mouth.</p><p>Her heartbeat drummed in her ears. They had a deal, and finally, she’d have him.</p><p>His lips were so close. She could already taste him on her tongue. Would taste him. And he’d taste her. He’d–</p><p>A shrill alarm cut through the room.</p><p>Sonofbitch.</p><p>She blinked, confused, aroused and–</p><p>Drake pushed her to the side of the bed and jumped to his feet. “Stay here,” he ordered and rushed for the door as the alarm kept shrieking.</p><p>Stay? She was a vampire, not a dog. Paige jumped up and raced after him.</p><p>He was already thundering down the stairs. More men and women were out now, all racing toward the main level of the house. She joined them, and hoped no one decided to attack the vamp in their midst. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Fire!” Someone shouted even as she caught the scent of smoke drifting in the air.</p><p>Then they were shoving open the front doors and hurrying into the darkness that waited outside of the main house. She saw the flames then, rising quickly, burning right up that thick wall that surrounded their compound. Red and gold flames, burning in a world of snow.</p><p>Paige stumbled to a stop even as the wolves fought the blaze. They had buckets of water. Hoses. The water blasted at the flames, but the fire kept attacking all around the compound walls. To the left. To the right.</p> <p>“You can’t escape me.” Gabe’s words rang in her ears. He’d warned her of this, so many times. He’d said, “I’ll find you and destroy anyone who gets in my way.”</p><p>Someone bumped into her and Paige jerked, then she realized–I can’t just stand here. She’d seen this type of attack before. It was Gabe’s specialty. Distract and conquer. He’d been using this technique for centuries.</p><p>Gabe...or rather, Gabriel, had been born long ago, in the midst of battles and carnage. War was what he knew, what he craved.</p><p>When it came to fighting strategies, he liked to think he was a master. The pureblood vamp was always plotting and planning.</p><p>The wolves didn’t realize that this was just a trick. They were scattering. Each going to a different spot to fight the flames. Each–vulnerable.</p> <p>“Stop!” Paige screamed.</p><p>No one listened to her.</p><p>More water. More fire.</p><p>“Stop! They’re coming for you!” An attack that had been planned for far too long. She ran forward and grabbed the arm of one woman, a chick with long red hair. “They’re coming!”</p><p>The woman spun around and her eyes widened. “Vampire.”</p><p>Yes, she was. “And more of my kind are coming. Move away from the walls! Get ready.”</p> <p>Because Gabe didn’t fight fair. He never had.</p><p>Thunder rumbled. Someone screamed. No, no, that wasn’t thunder. In the wild confusion of the fire, that was someone shooting. A man fell to the ground as blood covered the snow behind him.</p><p>Gabe always planned so well.</p><p>She looked up, her gaze flying along the length of the burning walls. There, to the left. Covered in darkness, she could just see the outline of the shooter.</p><p>Only...he wasn’t the only one up there.</p><p>Paige pushed the woman away. “Get back!” Paige yelled because she knew those guns would be loaded with silver bullets. The fire was just the bait. Carefully placed and targeted to draw out the wolves...</p><p>So they could be taken out easier.</p><p>She raced forward and leapt up that wall. As a human, she never would have been able to make that climb. The wall was at least fifteen feet high. As a vamp–</p> <p>Two seconds. That was all it took.</p><p>The gunman turned on her. Fired.</p><p>The silver bullet tore right through her shoulder. She gasped at the pain, and, somewhere below her, she heard a roar. “Try...harder,” Paige gritted out to the shooter as she snatched the gun from him. Then she shot him, right in the heart.</p><p>He fell off the wall, tumbling down below.</p><p>The vamp wouldn’t be dead, not from a silver bullet hit. He’d just be stunned for a while.</p><p>More gunshots. More screams.</p><p>She whirled around, balancing easily on top of the wall. More vamp shooters had positioned themselves, carefully hiding away from the flames. But the wolves were seeing them now. They were launching at the vamps, trying to take them out.</p><p>They just had to take them out faster.</p><p>Because there was blood on the ground. Injured shifters crying out in pain. And vamps were always attracted to that blood...</p><p>Her fangs burned in her mouth as they stretched and sharpened. An instinctive response to the scent of blood. She hurried along the wall’s edge, being careful to stay away from those flames. She had her eyes on another gunman. That jerk waited just five feet away, aiming down below. Her gaze darted to the right as she tracked his target. The vamp was–</p><p>Aiming at Drake.</p><p>No! Drake was rushing toward her, not even looking over at the gunman. “Get down!” She yelled at Drake, and she slammed her body into the vamp’s.</p><p>His gun fired. The bullet thundered as it exploded from the weapon.</p><p>The vampire laughed. “Got the alpha. Fuckin’ got him in the heart!”</p><p>She drove her fist into his jaw. She heard bones snap and wasn’t sure if that snapping was from the breaking of her own fingers or his jaw.</p><p>Her gaze lifted and flew to the area below. “Drake!” He was on the ground. Not moving.</p><p>The vamp’s gun had fallen into the snow near the bottom of the wall. Didn’t matter. She could deal with this jerk. He’d shot Drake. She grabbed for the stake that she kept in her left boot, strapped to her ankle. The vamp was twisting and fighting, and the ledge of the wall was barely a foot across and–</p><p>They both tumbled off the wall–falling not toward the inside of the compound, with the werewolves, but back outside.</p><p>When they hit the ground, Paige landed on top of the vamp. Even with the snow to cushion them, the thud of the impact shook through her body.</p><p>When she sucked in a deep breath, the vampire drove his knee into her stomach.</p><p>“Bitch,” the vamp snarled. But he wasn’t just any vamp. Henry DeVeau. She knew him. Had always hated the prick. He liked to torture his victims. The way he’d tortured her.Henry was Gabe’s number one attack vamp. A sadistic bastard who deserved to burn forever.</p><p>“You thought you’d be safe,” Henry spat the words at her as he punched out with his ham-like fists. “You thought he’d save you, but–”</p><p>“No,” Paige gasped out because, what did she have to lose now? No one else would hear what she said to Henry. The wolves were too busy fighting the flames and the other shooters. “I thought I’d save him.” Because she’d known that Gabe’s attack on the wolves was coming. She’d known that he was going after Drake.</p><p>So I wanted to be at Drake’s side, to keep him safe.</p><p>The bargain she’d made hadn’t been about her protection, not really. It had been about his.</p><p>But she’d failed him. After only a few damn minutes, she’d failed.</p><p>Henry’s thick brow lowered in confusion. “What? You–”</p><p>She had the stake in her hand. She rushed forward–and drove it into Henry’s heart. “I loved him,” she whispered as she twisted that stake. She had once loved him more than anything else in this world, but Henry and Gabe had taken Drake from her. Then, and now. “So you burn, asshole, burn.”</p><p>Blood dripped from Henry’s mouth, and she saw the light fade from his eyes as the bastard took his last gasp of breath.</p><p>And she smiled. A cold puff of air appeared near her face. She was still breathing. Henry would never breathe again.</p><p>The other vamps were racing away now, disappearing into the surrounding woods as quickly as they could–and vamps could run so very fast.</p><p>Time to chase.</p><p>She’d shown her true allegiance, and if she didn’t give chase, they’d all be coming for her head–or her heart.</p><p>Paige yanked up her stake. Barely glanced at the blood on the wood and–</p><p>Hard arms wrapped her around. She lifted her weapon, ready to take another heart herself.</p><p>But Drake stared down at her. His face was stark white, and his eyes glowed with the power of his beast.</p><p>His wolf wasn’t the only one straining for freedom. Some of the others had already shifted. Paige could hear wolf howls now as the beasts hunted the vampires. Big, furry beasts raced over the snow.</p><p>When had they shifted? She hadn’t even noticed. She’d been too intent on killing Henry. On getting vengeance because he’d shot Drake.</p><p>“Got the alpha. Fuckin’ got ‘him in in the heart!” Henry had been so certain of his hit. Unlike vampires, wolves couldn’t survive a shot of silver to the heart.</p><p>So how was Drake still alive?</p><p>Her gaze dropped to his chest. A chest he’d clawed open–to get the bullet out.</p><p>Oh, damn. That was just brutal.</p><p>“I thought you were dead.” His voice was guttural. His hands locked around her shoulders and pulled her against him. “I saw you go over the wall...”</p><p>She shook her head. Her body was trembling. He’s alive. “I-I was just trying to stop him. I didn’t want him to–”</p><p>Drake’s lips took hers. Not gentle. Not soft.</p><p>Hard. Wild. Rough.</p><p>There was desperation in his kiss, and so much lust.</p><p>The sounds of the wolves were all around them. The thudding of their paws on the snow. The howls that broke the night.</p><p>It was cold out there, bitterly cold, but she barely felt the ice around her. Right then, she was burning hot.</p><p>Drake lifted his head. Stared down at her. “Don’t ever do that again.”</p><p>Um, that wasn’t a promise she could make. She’d keep fighting, until the threats to him were gone. She wasn’t the running type, not anymore.</p><p>He kept a tight hold on her, smearing his blood over her clothes, and he turned to face the wolves who’d gathered around them. Smoke drifted in the air, but most of the flames were out, for now.</p><p>“Find them,” he shouted. “Hunt them!”</p><p>Some wolves were already in the woods, hunting. But vampires were good hunters, too.</p><p>“Find them,” Drake said again, and his voice cut through the night, “and kill them.”</p><p>The wolves howled.</p><p>Paige knew that the final war between the vampires and werewolves had begun.</p><p>Chapter Four</p><p>She could have fucking died.</p><p>Drake pulled Paige through the main house, making sure not to let her go, not even for an instant. The woman wasn’t getting away from him, hell, no.</p><p>When he’d looked up and seen her on that wall, with that vampire bastard attacking her...</p><p>He’d roared her name.</p><p>Then the vamp had shot him. The silver had burned, ripping and tearing through him as he fell to the ground. When Drake had looked up again, it had been to see Paige tumbling right over the edge of the wall.</p><p>Drake rounded the corner and shoved open the door that led to his quarters.</p><p>“Drake, look, I–”</p><p>In an instant, he spun on her. “You knew they were attacking.”</p><p>Did she look paler than before? It seemed so. Even the red of her lips had faded to a light pink. She stared up at him and gave a slow nod.</p><p>Shit. Why couldn’t she have lied? He didn’t want to know that she’d set him up.</p><p>Because then he’d have to punish her.</p><p>He headed to the left. He had blood on his hands, and he’d already smeared that blood on her. When he touched her again, he wanted his hands clean.</p><p>All he could smell was blood. His blood. The blood of the wolves who’d been attacked. The blood of the bastard she’d staked. And...</p><p>Her blood.</p><p>She’d seemed paler than before.</p><p>He whirled back to face her. As she stumbled, he picked her up and held her close against his chest. She’s a vampire, but she can still die. The scent of her blood was too strong. “Where’s the wound?”</p><p>She lifted her arm to her shoulder. Her hair had fallen forward, covering the injury, and he swept the mane back, then cursed at the sight of her flesh.</p><p>A bullet had torn through her shoulder.</p><p>Why the hell wasn’t she healing? Vampires usually healed fast enough when they were injured.</p><p>She wasn’t healing.</p><p>He took her into his bathroom. Put her down next to the shower that could easily hold three people, though he only preferred an intimate two. Then he tore open her shirt and tossed away the scraps of material so that he could see her wound.</p><p>But...it wasn’t the only wound that he found on her body. There were faint white lines on her flesh, snaking up her stomach. Sliding down her left arm. Scars. Old injuries.</p><p>Vampires didn’t scar. Those marks...she must have gotten them while she was still human.</p><p>He knelt on the marble tile so that his eyes were level with hers. “What happened to you?”</p><p>She bit her lip and glanced away. Then, voice whisper-soft, Paige said, “Nothing that matters now.”</p><p>Every single thing about her mattered.</p><p>He put his hand on her shoulder, being careful not to touch the bloody wound. She still flinched.</p><p>Because he’d hurt her...or because he’d touched her? She’d once begged for his touch. But that had been long ago.</p><p>Another damn life.</p><p>Locking his back teeth, Drake gritted, “Why aren’t you healing?”</p><p>She shrugged and still didn’t look him in the eyes.</p><p>He reached behind her and yanked on the water in the shower. The water thundered out in a hot rush and steam began to drift in the air. He didn’t worry about another attack interrupting them, not then. He’d put extra guards on sentry duty. The vamps wouldn’t be getting close again.</p><p>They’d just be dying soon.</p><p>“Too much blood loss can kill a vamp.” He knew because he’d killed his share that way before. A slow, painful death. Some folks deserved that kind of death.</p><p>Some didn’t.</p><p>The vamps who’d killed his family? They’d deserved every single moment of agony that he’d given to them.</p><p>“It’s almost stopped bleeding,” she told him. “I’ll be all right.” She glanced toward the water.</p><p>He put his hand on the curve of her waist. “You need blood.” No way to get around that. She’d been hurt, and she’d bled too much. For a vamp to get her strength back and heal, she’d need to drink.</p><p>“Yeah, well...” She gave a rough laugh that was nothing like the light, happy peal she’d once had, “Something tells me that wolves don’t exactly keep extra blood bags around for the vamp company that comes calling.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>No, they didn’t.</p><p>But if she needed blood...his gaze locked on her mouth. Her full lips. Her white teeth. Her delicate fangs.</p><p>A vampire bite is hell. Agony. Pain and degradation.</p> <p>How many times had he heard that line from other wolves? Too many.</p><p>So why was he even thinking about offering her his throat?</p><p>Because it’s her. And because she saved your ass out there. No matter what else she might be doing or planning, Paige had stopped the vamp from firing that silver into his heart. A few more inches to the right, and Drake knew he would’ve been dead.</p><p>She’d saved him and wasn’t that worth a few drops of blood?</p><p>He caught her chin. Lifted her head. Her gaze found his, finally. The water flowed behind her, and that steam heated the air. “Take from me,” he told her. When an alpha gave an order, that order was obeyed. No question.</p> <p>Her brow furrowed. “Um, take what?”</p><p>He caught her fingers–damn, her skin was soft–and lifted them to his throat. “Take.” He could handle this for a few minutes. He’d lock down his mind. Pretend he wasn’t being used as food and–</p><p>She snatched her hand back. Horror had her green eyes widening. “I can’t!”</p><p>She sure as hell could. “You’ve got the fangs, sweet, just sink them in.” Not like this was her first bite. She must have bled plenty of humans in her time. Bastards.</p><p>Without blood, vamps would turn to dust.</p><p>But she was shaking her head at him. “I-I’ll just take a quick shower and wash up. I’ll heal soon, and everything will be–”</p> <p>Well, damn, didn’t she want his blood? Now he was starting to feel insulted. “Drink from me.” Her whole body was shaking. She needed blood. Take it.</p><p>He wasn’t gonna sit there while she got weaker. He could help her. Her fangs would sink into his flesh, and she’d feed on him. The other wolves would think he was insane for offering his neck to her. So what? Screw them.</p><p>This was for her.</p><p>Only she was still shaking her head and looking like he’d just shoved a snake at her face. “I can’t.”</p><p>“You got something against shifter blood?” Which wouldn’t make a bit of sense. Paranormals had blood that was far more powerful than that of humans.</p><p>And vamps were always about power.</p><p>Her gaze dropped to his throat. He saw her eyes widen. Saw the flicker of raw hunger on her face. She wanted his blood. No missing that.</p><p>Why wasn’t she taking it?</p> <p>“Y-you don’t...understand...” Her gaze was still on his neck. “Drinking is...”</p><p>His hands curled around her waist. “I don’t want to hear about all the men you’ve tasted.” Because he’d just want to give those jerkoffs a whole world of hurt. Her mouth, on them. His beast roared. Kill. “Just...do it.”</p><p>Her laughter held a wild edge. “You’re not listening to me! I can’t!” Her voice dropped as she confessed, “Because I never have before.”</p><p>What the hell?</p><p>The words were a lie. They had to be. Drake’s hands tightened on her. “You’re a vamp. You have to drink to survive.”</p><p>“Not from a live s-source.” Her lips quivered. “I’ve never...When I drink, I-I use blood bags. I don’t take from people! Not directly.”</p><p>He frowned at her. He’d heard the rumors and whispers about some vamps going all bite-free and trying to blend better with the rest of the world. A newer, more human-friendly vamp.</p><p>He’d thought those stories were bullshit.</p><p>The vamps who’d attacked him tonight sure hadn’t been the blending variety.</p><p>“Just...give me a few minutes,” Paige told him. She pulled away. Stripped off the rest of her clothes–sweet hell–then stepped into the huge shower with its curtain of steam. “I’ll be okay.”</p><p>The hell she would.</p><p>She was in his home, back with him, and he was supposed to just stand back while she needed?</p><p>His jaw clenched as he gritted out, “We don’t have blood bags.” Why would they? It wasn’t like werewolves entertained vamps. No blood bags on the premises, and there wasn’t any damn way to get them right then.</p><p>Her body slid beneath the pounding water. Paige sighed softly and the sound was like a stroke right over his cock.</p><p>As she turned beneath the spray, letting the water pour down her back, her eyes began to drift closed. Did she really think he was just gonna walk away? He hadn’t bothered to put on a shirt when he’d raced outside. No shirt, no shoes. Just a pair of jeans stained with blood. His hands went to the snap.</p><p>When his zipper eased down with a hiss, her eyelids flew back open.</p><p>Ah, heard that, did you? A vamp’s hearing was almost as good as a shifter’s.</p><p>Almost.</p><p>“Drake?”</p><p>He loved the way she whispered his name.</p><p>He dropped the jeans and stepped into the shower. Then he positioned his body near hers. “You’re drinking from me.” He’d be her first at this, just as he’d been the first to take her body.</p><p>But she shook her head. “I don’t want to hurt you.”</p><p>“You won’t.” He pulled her against him. The water covered them both. Washing away the blood and death. Drake tilted his head to the side. His fingers curled around her chin, and he pulled her toward him. “Just start with a kiss.”</p><p>Her lips feathered over his skin.</p><p>His cock hardened even more–and the damn thing had already been swollen with need.</p><p>Her tongue slid out and licked the side of his neck. The small touch sent a rush of hot need surging through him.</p><p>He was supposed to be suffering through this. Giving her sustenance, nothing more. Dealing with the pain of her bite–</p><p>Only there wasn’t any pain yet.</p><p>Only pleasure.</p><p>“I-I can’t,” she told him again and tried to pull away.</p><p>Fuck that.</p><p>His hands locked tighter around her. He pushed her back, caging her against the tiled wall of the shower. Then his mouth took hers.</p><p>He knew one thing about vampires and their bloodlust...sex and blood were always tied for the vamps.</p><p>Sex and blood.</p><p>Her mouth opened beneath his. She kissed him back with a hunger to match his. If this was her when she was weak...</p><p>He couldn’t wait to see her when Paige was back at full strength.</p><p>His tongue slipped into her mouth. Tasted. Enjoyed the moan that rose in the back of her throat.</p><p>His cock thrust eagerly toward her, pushing hard because he damn well wanted to be inside of her.</p><p>Would be...soon.</p><p>His breath heaved out when he lifted his head. “Drink from me.”</p><p>The edge of her fangs glistened behind her slick lips.</p><p>Drake lifted his hand to his throat. His claws were out, and he sliced a thin line down the side of his throat. The better to tempt his little vamp.</p><p>The darkness of her pupils expanded in her eyes. “Drake.”</p><p>“I want you to drink from me.”</p><p>Her gaze was on the blood that dripped down his throat. Her fangs were lengthening. “Don’t...don’t let me hurt you.”</p><p>What was a little pain? Sometimes, it could even make the pleasure sweeter. He’d learned that lesson long ago, but he just told her, “You won’t.”</p><p>Her mouth went back to his throat. Kissed the skin. Sucked lightly along his flesh.</p><p>Damn. He held onto his control with every ounce of strength he had. But her body was wet, soft, and smooth. Her silken legs rubbed against his. Her breasts–tight with those pebbled nipples–pushed into his chest.</p><p>Then she licked at the blood on his throat.</p><p>His teeth ground together. His cock was so aroused that he felt like he’d erupt any minute.</p><p>Only in her.</p><p>She moaned low in her throat and licked him again. Again. She sucked his flesh once more, and he felt the score of her teeth on him.</p><p>Okay, this is it. She’ll slice into me, but it won’t last long and–</p><p>And her teeth sank into him.</p><p>Fuck, fuck, fuck!</p><p>This wasn’t about pain and degradation. This wasn’t about a vamp’s bite tearing and slicing prey.</p><p>It was about pleasure.</p><p>Because that was all he could feel then. A white-hot burst of pleasure that seemed to fill his veins and course through his body. So much pleasure that his control shattered in an instant. There was no holding back.</p><p>There was only...Paige.</p><p>He lifted her up against that tiled wall. Spread her legs.</p><p>Her mouth was still on him, lips, tongue, teeth...</p><p>His fingers slid over her core. Pushed inside her sex. So wet. So hot. She clamped down on him and held tight.</p><p>The water thundered down over him. Steam surrounded them.</p><p>In her.</p><p>He positioned his cock. Stroked over her clit. Loved her ragged moan.</p><p>The head of his cock pressed into her. Her sex stretched, straining around him. He wanted to see her, wanted to pull back–</p><p>But he couldn’t.</p><p>Drake drove into her as deep and as hard as he could. And it was just like he remembered. Tight. Hot. Heaven.</p><p>He pulled back. Thrust deep. Again and again. He lifted her up, positioning her so that she had to take all that he gave her. There was no hiding or holding back, not for either of them.</p><p>His fingers kept stroking over her clit. The way he knew she liked. The way that would make her–</p><p>Scream.</p><p>Paige lifted her mouth from his neck. Her eyes were wide, wild, and her lips were flushed red. The scream of pleasure slipped past those red lips even as he felt the contractions of her orgasm around his cock.</p><p>So good.</p><p>He kept thrusting. Faster. Harder. Rougher.</p><p>The wolf liked it rough.</p><p>So did the man.</p><p>She wrapped her legs around his hips. Wrapped her arms around his shoulders.</p><p>And she kissed him.</p><p>This time, the pleasure was his. A deep, wrenching pleasure that washed over him as he climaxed inside of her. The release blinded him and fucking seemed to gut him as it went on and on, hollowing out his body.</p><p>When the climax ended, he didn’t release her.</p><p>Because he wasn’t letting her go, not ever again.</p><p>Chapter Five</p><p>Dawn didn’t bring light. The polar night had come to Alaska weeks before, and now they were lucky if even a faint twilight would brighten the day.</p><p>Just darkness. And more darkness to come.</p><p>It was the kind of darkness most vampires loved.</p><p>Paige knew that she had never been like most vampires. Hell, she wasn’t even a particularly good vampire.</p><p>After dressing, she carefully crept toward the bedroom door. When she’d opened her eyes, she’d been alone. The sheets beside her had been cold. Alone.</p><p>It wasn’t like she’d expected Drake to stay with her, just holding her in those quiet hours. Cuddle time wasn’t so big with vamps and werewolves, she got that.</p><p>But had the guy really needed to haul ass so quickly? Would it have killed him to just stay with her for a little while?</p><p>Her hand pressed against the wood of the closed door. She could still taste Drake on her tongue.</p><p>And feel him between her legs.</p><p>The sex had been as good as she remembered. Actually, way better than good. Drake had always been one fantastic lover and–</p><p>Someone was screaming.</p><p>The screams tore through the house, echoing, and her body tensed in instant response.</p><p>She’d screamed before, for Drake, but those screams had been about pleasure. This time, the cries filling the air were from pain.</p><p>Paige yanked open the door. The screams and yells and shouts to “Stop!” had her racing down the hallway.</p><p>Faster, faster she went. She bounded down the stairs, taking three at a time, and Paige realized could she smell blood.</p><p>Her fangs were already coming out.</p><p>“Stop, dammit, stop!” A man’s ragged plea.</p><p>She rushed down another flight of stairs, one that led to some kind of basement or–</p><p>A line of werewolves blocked her path. Paige stumbled to a halt just seconds before she would have barreled into those guys.</p><p>The screams continued, coming from a room directly behind that living wall of werewolves.</p><p>What the hell?</p><p>Her gaze darted over the men. She recognized the two werewolves who’d escorted her in...jeez, had that just been last night?</p><p>The smaller one–the guy who’d made the mistake of touching her before–shook his head. “He doesn’t want you going inside.”</p><p>Yeah, well, screw that. “He also doesn’t want you touching me.” Drake had been more than adamant on that point the last time he’d squared off with this wolf. What had been the guy’s name? Mark? Matthew?</p><p>Michael. This wolf was Michael.</p><p>Drake had been more than clear when he’d said the guy wasn’t supposed to touch her again. If Michael couldn’t touch her...</p><p>Then you can’t stop me, wolf.</p><p>She marched right ahead. Damn straight that line of wolves backed up. She figured none of them wanted to dare to actually physically try and stop her. “So I’m betting you’re just gonna get out of my way.” Or else they’d get an ass kicking from Drake.</p><p>Then before one of them could grow some balls and maybe try to stop her, she sprang forward, leapt right over them, and kicked open the door behind the assembled wolves.</p><p>It was a metal door, heavy and huge, but it easily sprang open beneath her booted heel.</p><p>Wow. That blood of Drake’s had really amped her up. She’d always heard werewolf blood was powerful, but...damn. She’d never felt so strong.</p><p>The metal door slammed into the wall and bounced back at her, but she dodged it with a little sidestep, and then she noticed that she was in hell.</p><p>Or as close to hell as she’d been in a few months.</p><p>Cages lined the walls. Cells. Prisons. There was blood on the floor. The coppery scent of blood filled the room. She knew that scent too well. And there, in the middle of the area, strapped to what looked like an operating table, was a vamp that she recognized. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Malcolm Douglas. Another one of Gabe’s henchmen.</p><p>Guess you couldn’t run fast enough.</p><p>The wolves had caught him, and now they were making him pay.</p> <p>“You shouldn’t be here.” Drake grabbed her arms and turned Paige away from the sight of Malcolm’s bleeding body. “Dammit, I told them to keep you away.”</p><p>“You also told them not to touch me,” she said, lifting a brow, “so it’s not like they could really stop me.” Not unless they’d wanted to fight the alpha.</p><p>A muscle flexed in Drake’s jaw. “You don’t need to see–”</p><p>Malcolm started to laugh. “Fool. What you’re doing to me...we’ve done so much more...to her.”</p><p>Oh, crap. Ice flooded through Paige’s body. Malcolm shouldn’t have said–</p> <p>“We sliced her open...” Malcolm snarled out. She glanced over and saw the wildness in his eyes. “Drained her blood while she screamed–”</p><p>Drake lunged for him. His claws wrapped around the vampire’s neck and ripped the skin. “I won’t make death easy for you.”</p><p>Malcolm just smiled. His fangs were stained with blood. Despite his screams, she knew he didn’t fear death. The guy probably welcomed it.</p><p>Hell...had he been screaming just because he knew that she was in the compound? Had he been trying to draw her down here? So that I’d suffer...and Drake would suffer.</p><p>“Want me to tell you...” Malcolm muttered, “all that we did to her?”</p><p>No. She’d never wanted Drake to hear that story. “Drake!”</p> <p>“Get out of here,” Drake ordered without looking at her. His claws sank deeper into Malcolm’s throat. Pretty soon, Malcolm wouldn’t be able to talk at all.</p><p>Paige didn’t move. The screams had pulled her in, but she was staying because... “I can help you!” If Drake would just give her the chance.</p><p>Malcolm was the one still doing the talking. “She was...waiting,” he said, “for you–”</p><p>“Take her out, Heath! Now!” Drake snapped and a fair-haired wolf came her way. His hands closed around her arms, but she jerked against him.</p><p>Paige wasn’t going anywhere. Not yet. “Dammit, Drake, let me–”</p><p>“She was near the lake when we found her...” Malcolm’s blood dripped onto the floor. “You were supposed...to meet her.”</p><p>Why couldn’t the vampire shut the hell up?</p><p>Drake stiffened at the vampire’s words. “I went to the lake.”</p> <p>Lost Lake. A fitting name.</p><p>She’d lost her own life at that lake.</p><p>“You went later.” Malcolm’s eyes were bright. He liked power. Craved it. Always had, always would. Right then, despite the claws at his throat and the blood around him, Malcolm had the power.</p><p>And she had a stake in her boot. So if she could just get away from Handsy Heath, she’d use it and make sure Malcolm never hurt another human again.</p><p>The way he hurt me.</p><p>“Your alpha...” Malcolm growled, “he made sure you went late...to that little rendezvous...”</p><p>His words caused Drake’s hold to loosen, just a bit, but the Malcolm’s revelation didn’t surprise Paige. She’d learned this truth long ago.</p><p>The old alpha, Jeremiah Quintock, hadn’t wanted a human in his pack. He’d thought wolves were far too superior to humans. But Drake had wanted her to be his mate, and he’d been determined to bring Paige into the pack, and it hadn’t mattered to him who he pissed off.</p><p>Drake had thought he was safe because he was the next in line to be alpha. One day, he’d lead the Alaska wolves. He’d known that, even when they’d dated. So he hadn’t thought anyone in the pack would deny him the mate he’d chosen.</p><p>But Jeremiah hadn’t wanted the next alpha to have a human at his side.</p><p>So he’d sent me to die.</p><p>She saw the shock on the faces of the wolves around her. Even Heath eased his grip on her. What? Had they all really not known that old jackass Jeremiah had been dealing with the vamps for years?</p><p>Because Jeremiah had a taste for blood, too. A taste for blood and death and screams and pain. Not the best image when the werewolves in the pack were trying to show that they were more than beasts.</p><p>But Jeremiah had sure liked to play with his prey.</p><p>The vamps had gotten rid of the bodies for Jeremiah, and he’d gotten to pretend he was an evolved, strong alpha.</p><p>An agreement, of sorts, had been reached between Jeremiah and the vamps. But, sooner or later, all good and evil deals came to an end.</p><p>Jeremiah was dead. The old truce was gone. Now the vamps were looking to take back what they thought of as theirs.</p><p>Their land. Their power.</p><p>“You’re lying,” Drake snarled at the vamp. He’d yanked Malcolm right off the table, easily snapping the restraints that had held the guy. Drake lifted the vamp into the air, and Malcolm didn’t even try to break free. He just hung limply, laughing.</p><p>“Ask her...” Malcolm said, choking a bit on blood. “She begged...for you.”</p><p>Bastard.</p><p>He’d enjoyed it so much when she begged.</p><p>I stopped begging. Stopped crying. Stopped letting him enjoy her pain. In the end, she’d been the stronger one. Damn him, she’d been stronger.</p><p>Heath’s hands slackened even more on her. She yanked away from him. “Vamps use distraction as their number one attack method.” That’s what Malcolm was trying to do then. Why didn’t the wolves realize what was happening? “He wants to buy time, to give the others a chance to regroup and come in again for an attack.”</p><p>Paige inched forward as the wolves glanced around the room. She just needed to get within striking distance. Almost...there.</p><p>Drake swung his gaze back to her. “You weren’t at the lake.”</p><p>Paige could still smell the lake. That long ago day, the polar night had ended. The darkness had faded and the sunlight had just been about to come her way. Everything had been fresh. New.</p><p>She and Drake had wanted to see the sun together.</p><p>Then start their lives together.</p><p>She’d gone to Lost Lake early because she’d been so excited. She hadn’t cared about what Drake was. She’d just loved him.</p><p>When she’d heard the twig snap and the rustle in the bushes, she’d thought it was him. She’d spun around with a smile on her face.</p><p>Hello, little wolf whore.</p><p>“No,” she whispered through numb lips as the past and the present fought in her mind, “I wasn’t at the lake.”</p><p>Drake’s claws dug into Malcolm’s neck. More blood flowed. “I waited for you,” Drake told her, sounding lost. She’d been lost, for so long. His eyes were still on her as he said, “I waited for hours. But you never came. You left me. You couldn’t stand what I was.”</p><p>A few more steps, and she’d be at his side. “I left,” Paige agreed softly. Wasn’t that what she wanted him to know?</p><p>“She screamed,” Malcolm gasped out the words. Damn him. Shut up. Only he wasn’t shutting up. He was saying... “Jeremiah had taken you too far away...and you couldn’t hear her. We cloaked our scents, so you never knew we were...at that lake. Then the old alpha came...because he wanted to make sure...she died...”</p><p>You won’t tempt the boy again. Jeremiah’s vow to her. He’d met up with the vamps. In some God-forsaken cabin. A place that had reeked of death and fear.</p><p>But by the time he’d gotten there, she’d stopped screaming. She’d realized her screams were only building the excitement for the vamps. They got off on her pain.</p><p>So the tears had streaked silently down her cheeks, but she’d stopped crying out. Her lips had clamped together. She’d bit through them to hold back her cries.</p><p>Jeremiah had come to kill her. She’d understood that instantly. He’d wanted to be the one to send her to the grave. Personally. Because she’d dared to try and taint his pack with her human blood.</p><p>But Gabe...oh, Gabe, he’d always been so smart. He’d known that Jeremiah wouldn’t be around forever, and with Drake growing bigger and stronger every day...</p><p>A new alpha’s taking over. When he rises, I’ll have what he wants most. Gabe had whispered those words to her. Then kissed her tears away. Don’t be afraid, love. You’re not dying...yet.</p><p>“I wasn’t at the lake,” she said again as she tried to push the past back into the dark hole in her mind. Drake needed to remember her leaving him. He had to be strong. He couldn’t have a weakness.</p><p>Gabe was counting on his weakness.</p><p>She blinked. Why were her cheeks wet? Dammit, she was crying, and the wolves were all staring at her, dead silent.</p><p>As silent as she’d been when Jeremiah had raked his claws down her arm. Then her side.</p><p>But Gabe had stopped him before the bastard could rip out her heart.</p><p>“She’s not yours to kill, Jeremiah.” Gabe’s taunting voice still haunted her mind. “She’s ours now.”</p><p>“We didn’t turn her right away.” Malcolm’s body trembled and his voice shook. “She...got away from us...gave us quite a chase...”</p><p>Didn’t Drake get it? Malcolm was wasting time with this story. Distracting them all.</p><p>Making Drake weak.</p><p>Because Gabe wanted Drake to be weak, distracted...broken when the real attack came.</p><p>She remembered the desperate time she’d spent running. She’d fled through the snow. Hitchhiked. Gotten as far from Alaska as she could.</p><p>Hello, Florida.</p><p>But Gabe had always been chasing her. He hadn’t planned to let her go. Not when she could be such a valuable tool in his battle.</p><p>She’d never called Drake after she escaped. Never so much as spoken his name again. Why? Because Jeremiah had still been there, still wielding his power, and if she’d tried to get close to Drake again...</p><p>The old scars on her body seemed to burn.</p><p>Her heartbeat thudded in her ears. Fast. So fast.</p><p>“All vampires aren’t sick pricks like him,” she spoke quietly, but her voice filled the room. “There are others out there who are different. They’re good.” They’d found her. Hurt. Wild. So desperate after her change. And they’d helped her.</p><p>I won’t drink from a human. She’d been starving because she refused to drink. But she hadn’t wanted to attack another person, hadn’t trusted herself to stop once she sank her teeth into prey.</p><p>Gabe had told her that she wouldn’t be able to pull back after she had her first taste of blood.</p><p>“Once you taste the blood, it’ll drive you wild. You’ll do anything to get more. You’ll drain humans, one after the other, and leave their bodies in your wake.”</p><p>His promise to her, right after he’d turned her. He’d leaned close, pressed a kiss to her cheek and said, “Then you’ll be just like me.”</p><p>Never.</p><p>Drake had dropped Malcolm. The vamp lay sprawled on the floor while her werewolf stared at her with a face gone white. No, he shouldn’t be like this. She hadn’t ever wanted him to know all the secrets she carried.</p><p>“Paige...” Her name was a ragged sound of pain, torn from Drake.</p><p>And Malcolm–his eyes were on her. On her, then Drake. No, not just on Drake...on his neck.</p><p>Malcolm’s smile said he knew what she’d done.</p><p>After resisting for so long, she’d broken down and taken blood from a live source, from him. The one who mattered the most.</p><p>“Guess I am a monster,” she told Malcolm, then she lunged forward. No one tried to stop her. They couldn’t. She was too fast then.</p><p>In an instant, she had the stake out.</p><p>And Malcolm was attacking, too. Not an attack at her, but one aimed at Drake.</p><p>He was distracting you. She’d tried to warn him, but Drake had been too busy listening to Malcolm’s twisted tale. The vamp slashed out with his claws, going for Drake’s back.</p><p>Only she got to Malcolm first. Paige shoved the stake into his chest. “Go to hell, bastard,” she snarled. He’d sure done his best to drag her there and–</p><p>Malcolm ripped the stake right out of his chest. “Missed...heart...bitch...”</p><p>Oh, crap.</p><p>“I won’t miss,” Drake promised as he yanked her back. Then he attacked, slamming his body into Malcolm’s. And, no, he didn’t miss because one powerful swipe of the razor sharp claws that sprang from Drake’s fingers–well, one swipe took Malcolm’s head.</p><p>And the vampire went to hell.</p><p>The silence in the room was deafening then. All the wolves stood, as still as statues, watching her. Waiting.</p><p>After one glance, she didn’t look at Malcolm again. Her stomach was twisting, her hands shaking. She wanted the nightmare to just end, but for her and for Drake, the end was still too far away. The nightmare wouldn’t stop, not yet.</p><p>Not until Gabe was the one on the floor, stone dead.</p><p>She should say something. Anything. But...</p><p>Her shoulders hunched as Paige turned away. The scent of blood seemed to burn her nostrils, and she just needed to get out of there.</p><p>Away from the blood and death. Escape. She hadn’t known real freedom in so long, and she was so tired of being surrounded by death.</p><p>Constantly.</p><p>Paige shoved the shifters out of her way. Drake called out to her. She didn’t glance back, and she sure as hell didn’t stop. She’d talk with him–later.</p><p>Not now.</p><p>I wasn’t at the lake.</p><p>Her words had been so hollow because, yes, she’d been at Lost Lake. She’d kept her promise to Drake. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>And that promise had cost Paige far more than she’d ever expected–her life.</p><p>Chapter Six</p><p>She damn well wasn’t getting away from him.</p> <p>Paige had fled the compound and raced away into the night. Sure, he could have gotten his men to track her, but this hunt was personal, and Drake didn’t want the others chasing her.</p><p>If someone hunted Paige, it would be him.</p><p>“You can’t do this!” Heath grabbed him just as Drake was about to pass through the compound’ heavy gates. His eyes blazed with fury. “This could be a vamp trap! She’s luring you outside.”</p><p>Paige hadn’t gone through the gates. She’d just leapt over the wall. So fast and graceful. His blood had sure pumped up her power.</p><p>As for her bite...it had given him so much pleasure. I’ll have more. If she needed blood, he’d be happy to be her personal donor from now on.</p> <p>Her first, her only.</p><p>“She’s hurting,” Drake said and pain, yeah, that was just what he’d seen in Paige’s eyes. She’d always shown so much with her green gaze. He’d once been able to look right into her eyes and see her soul.</p><p>Heath actually shook him. “She’s in pain? Fine. Then let her go off and lick her damn wounds.” Heath’s words held a sharp bite. “But don’t put yourself at risk for her. She’s a vampire.”</p><p>The necklace he’d given to her so long ago, the one he’d stupidly taken from her neck just the previous night, was a heavy weight in Drake’s pocket. Give it back to her. “She’s mine.” There wasn’t anything else to say.</p><p>She was his. And she hurt.</p><p>Protect her. An instinct from the wolf and the man.</p> <p>He looked beyond the wall. So much darkness and icy cold waited for him. But that frigid darkness had been his whole life, ever since Paige had left him.</p><p>He wanted more now. He wanted warmth. Light. Paige had always been that to him.</p><p>“I’m bringing her back.” Drake shoved the other wolf aside.</p><p>Heath grabbed his arm. “You can’t bring a vampire into the pack.” Low words. Gritted. Burning with intensity. “You know you can’t do that.”</p><p>Very, very slowly, Drake turned his head and stared down at his first in command. He’d been friends with Heath since they were both just boys, but that friendship wouldn’t stop him from kicking the shit out of the guy. “I’m the fucking alpha.” He let the power ring in his voice. He’d fought for the title. Earned it. And since he was alpha, the one they all submitted to... “I can do anything I want.”</p><p>“Jeremiah–”</p><p>Had that bastard really gone after Paige? Set this whole nightmare in motion? His jaw ached as Drake growled, “He’s dead.” A very lucky thing for the old wolf right then. Because if he’d still been living, Drake would have ripped him apart. “It’s my pack now.” If Heath wanted to challenge him...</p><p>Come the hell on.</p> <p>He was more than in the mood for some ass-kicking.</p><p>After he brought Paige back. He had his priorities, and she came first. “Spread the word,” Drake ordered. “Any who want to challenge me...tell them to get the fuck in line.” When he came back, he’d take them all on.</p><p>Because no one was going to keep him from Paige. Not now.</p><p>Not ever.</p><p>He turned away from Heath and ran into the night. Vampires were fast, but wolves were faster. Especially when they hunted.</p><p>He shed the form of man with a crack and snap of his bones. The pain of the shift burned over him, familiar, white-hot, and soon he was running on all fours, with paws instead of hands, and he tossed back his head and howled for the one thing he wanted most in the world.</p><p>His mate.</p><p>He had her scent, and he wouldn’t lose it. He flew over the terrain, ignoring the frigid cold temperature–an artic chill that he knew would be cutting into Paige. The cold wouldn’t kill a vamp, but it would make her body tremble and shake. She’d suffer out there.</p><p>She’d already been in pain when she left him.</p><p>And the only damn thing he wanted to do was take that pain away.</p><p>He bounded through the forest and sent snow flying in his wake. The world was a blur of white, but he could just see the imprints of her footsteps.</p><p>He knew where she was going.</p><p>Inside the body of the beast, the man cursed.</p><p>The wolf ran faster, faster...</p><p>She’d never seen him in this form. Before, he’d been ashamed for her to see him transform. He knew what he was...</p><p>“Guess I am a monster...” Her words were burned into his mind.</p><p>But he’d been the monster. Always. The beast who’d taken what he should never have touched.</p><p>He leapt into the air, easily jumping over a fallen tree. Her scent was stronger now. Strawberries. Sex. Woman. He’d never been able to forget that lush scent.</p><p>The small lake was frozen, its surface dark and glistening. Even though it was day, the sky overhead was as dark as the lake. No sunlight.</p><p>Not now.</p><p>Just cold. Just darkness.</p><p>Paige spun at his approach and put her back to the lake. Her eyes widened when she saw him. Swallowing, she backed up a step.</p><p>He froze.</p><p>Then he changed, for her.</p><p>The transformation was brutal to watch. He knew it had to be. His bones shifted and broke, reshaped into a man’s body instead of the form that belonged to the beast. The fur seemed to melt from his body. Soon paws and claws became hands and fingers–fingers that had dug deeply into the snow.</p><p>“Drake?”</p><p>Her hushed voice pushed through the last of the shift, and, naked, he glanced up at her.</p><p>Paige rushed toward him. “You shouldn’t be here!”</p><p>“Neither...should you.” He rose before her. Wind whipped against his body, but werewolves always stayed warm no matter what the outside temperature was. The beast burned within.</p><p>Paige shivered.</p><p>He took a step toward her, but she stiffened, and her gaze darted around the small clearing. “It’s dangerous. I didn’t think–we need to go back.”</p><p>Drake lifted his hand and offered it to her. “Then come with me.” He knew why she’d run from the compound. Desperation and pain had driven her to flee blindly.</p><p>I wasn’t at the lake.</p><p>But she had been. He knew a lie when he heard it.</p><p>“I’m sorry.” The words were torn from him. Jeremiah had come to him, told him that he had a message from Paige. “Your little human said to meet you in two hours.” Jeremiah had smiled and flashed his fangs. “That gives us time for a hunt.”</p><p>And he’d just...gone off with the bastard.</p><p>Paige wasn’t taking his hand.</p><p>Her gaze was on him, sweeping over his body. She hadn’t been disgusted by his shift, and she sure didn’t appear disgusted by what she was seeing right then.</p><p>Lust. He knew that expression well. But he hated the mix of lust and pain in her eyes. He hated to see any pain in her gaze.</p><p>He’d rather just have the lust.</p><p>“Come with me,” he said again, and he still waited for her to take his hand. There would be no forcing on this. She had to choose to come with him.</p><p>To be with him.</p><p>Her gaze swept around the lake. The woods. She inched toward him. The snow crunched beneath her boots. “I-I didn’t...you shouldn’t have followed me.” Her words rushed out. “I just needed a little time...”</p><p>“There’s a vamp hunting you,” he told her. Hell, it was probably a whole gang of vamps now. “You really think I’d just leave you on your own?”</p><p>No. Her hand lifted and slowly, so slowly, her gaze met his. Her fingers touched his hand. Tentative. Soft. “I lied,” she whispered.</p><p>His fingers closed around hers. “What?” But he already knew and if she wanted to confess to him, he’d damn well listen.</p><p>He should have met her here, at Lost Lake. He should have told Jeremiah to screw off, that he was still heading out to meet Paige and that he’d just wait for her to show.</p><p>If he’d gone then, they would have been married by now. Had children. Had a fucking perfect life.</p><p>It was all his fault.</p><p>But then he heard the growl of an engine. No, not just one engine. Two. Three.</p><p>Coming close.</p><p>Too fast.</p><p>Far too fast.</p><p>Her eyes still held his. “I lied,” she said again, then she jerked her hand free from his grip and shoved against his chest. “Run!”</p><p>The vampires were coming.</p><p>“Shift! Turn back into a wolf!” Paige yelled at him. “You can outrun them, you can get away!”</p><p>“Not without you.” His claws tore through his flesh. He’d be damned if he left her behind.</p><p>She shook her head and shoved harder against him. “It’s not about me. They don’t want me.”</p><p>But–but she’d told him–the vampire she’d called Gabe–</p><p>“They want you,” she said, voice stark and sad. Her eyes had never looked bigger. Or sadder. “And Gabe always planned to use me...in order to get you.”</p><p>He could see the light from the snowmobiles cutting through the darkness. The vamps were closing in on them.</p><p>The vamps wouldn’t get them, though. Dumbasses. Drake knew this land so well.</p><p>Better than any vampire ever could. His beast ran free often. Knew every fallen tree. Every secret bend. Every dark cave.</p><p>Every hiding spot.</p><p>“Run with me,” he told her. Because right then, it wasn’t about fighting, even though the beast within was roaring for blood. That moment was about protecting Paige. Getting her to safety.</p><p>Then coming back to cut down all the vampires after him.</p><p>She nodded, and they took off, racing not around the lake, but right across it. It was icy and slick beneath their feet, frozen solid, and by going straight across that cold surface, they saved valuable time.</p><p>The ice wouldn’t break. Not for months.</p><p>They cleared the lake. Entered the edge of the forest, where the heavy weight of the snow had bent the trees. Because they’d gone right across the lake then leapt into the woods, they didn’t leave any footprints behind.</p><p>Well, no footprints that would be seen immediately. The vamps would have to search first, scanning every edge of the woods, then if they got lucky, they might see the tracks just past the trees but–</p><p>But it was starting to snow again.</p><p>Hell, yes. The snow came down, brushing against his skin as they ran. The fresh snow would cover any tracks they left behind.</p><p>A wolf would have been able to track them through the snow. Vamps were no match for wolves when it came to stalking prey.</p><p>No match.</p><p>Paige stumbled and would have fallen, but he just grabbed her and hoisted her into his arms. Her weight didn’t slow him. He pushed faster. Held her tighter.</p><p>He leapt easily over the dead trees, the rough rocks. Faster...</p><p>Drake turned abruptly, heading toward the cabin that he knew would be waiting. Small, non-descript, the snow almost hid it completely from view. But he knew the cabin was there, waiting.</p><p>The vamps wouldn’t be so lucky. Unless they knew the specific location of this safe house, they’d never find it in the darkness.</p><p>He punched in the security code, then shouldered open the door. Still holding her tightly, Drake carried Paige inside. The interior was pitch black, and their ragged breathing seemed to echo in the tight space.</p><p>“We can’t stay here,” Paige said, voice desperate. Her nails sank into his shoulder. “We need to get back to the compound. They’ll find you here! You can’t face all of them on your own!”</p><p>He put her down beside him. The cabin was sparsely furnished in this area–containing just a bed and an old table. But looks could be deceiving. Drake bent down and yanked back an old rug, a rug that had covered a trapdoor on the floor. When he’d had the cabin built, Drake had made sure that the trapdoor blended seamlessly with the floor. He pressed against the wood, in just the right spot. With a creak, the trapdoor opened, revealing the gaping entrance that led below.</p><p>He’d created this safe house for any wolf shifters who got caught outside the compound during the winter storms. The place was supposed to be a safe harbor for them.</p><p>One with all the benefits and security that a wolf needed.</p><p>Paige crept down the stairs. He shut the door behind her. Bolted it. Then punched in a series of codes on the alarm pad.</p><p>There was a faint hum, then a steel door slid closed above him, covering the wood. Lights flickered on, one after the other, revealing an area twice as big as the cabin above them.</p><p>One wall was composed of monitors. A security station that showed all the area around the cabin, just in case any unwanted guests came calling.</p><p>There was a bed. A desk. A cabinet full of food.</p><p>All the comforts of home and all the security of a mini-fortress.</p><p>Just what he’d wanted.</p><p>Drake headed toward the nearby desk. He lifted up the radio–one that was wired to the compound. “Alpha One.”</p><p>Paige made no sound behind him.</p><p>Static crackled. “Reading you sir, over.”</p><p>Drake glanced back at Paige. So still. So beautiful. “Send hunters to Lost Lake. The vamps are out there.”</p><p>He’d be taking care of this theat. Eliminating the vampires permanently, right after...</p><p>After he settled a few things between him and Paige.</p><p>“Yes, sir.” It was Michael’s voice. Drake caught the eagerness in the guy’s quick reply. Who didn’t enjoy a good hunt?</p><p>No wolf he knew.</p><p>Drake pushed away from the desk. Stalked toward Paige. She was still shivering but she stood straight and tall. She stared at him like she thought he would attack her.</p><p>He did want to pounce.</p><p>He lifted his hand and let it skim down her cold cheek. “Tell me about your lies, sweet.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>She turned her face into his touch. “You should...find some clothes.”</p><p>“Why?” Wolves had never been concerned with modesty. “I’m about to fuck you.”</p><p>Her eyes widened.</p> <p>Now he was the one lying. With her, it wasn’t just fucking. Not just screwing in the dark–or the light. It was more.</p><p>Mating.</p><p>He took a breath and could almost taste her. “Tell me the secrets you’ve been keeping...tell me...and I’ll tell you mine.”</p><p>She shook her head. “You know–”</p><p>“The vampires were watching the compound. They saw you leave.” Obvious. He wasn’t a damn idiot. Desperate for her, yeah, but not stupid. “Then they saw me.” The vamps had given chase, but they would have been watching from a distance, probably using scopes or binoculars, so it had taken them a while to close in. “And they came out to kill me.”</p> <p>He stepped closer. Pressed his lips against her throat and inhaled her scent. Sex and woman. His. “You were sweet bait.” He didn’t care. The vampires had hurt her. Tortured her. Used her against him. She’d been sent to lure him out in the open.</p><p>So the fuck what?</p><p>He still wanted her. Always would.</p><p>“No.” Her word was a sigh as her hands lifted to curl around his shoulders. “You don’t understand.”</p><p>He licked her neck. Her shiver wasn’t from the cold that time. “Make me understand.” Because he could see a pretty clear picture. She didn’t have a choice. The man understood that, and he was furious at the vamps who’d done this to her. “You should have just told me, from the start. I could have protected you–”</p><p>Her nails dug into his skin. “No.”</p> <p>Surprised by the fury in that one word, Drake lifted his head and stared down at her.</p><p>Her breath whispered out as she stared at him. Her eyes were chips of green ice. “This time,” she told him, “I’m protecting you.”</p><p>What?</p><p>Then she wrapped her hand around his neck and pulled him toward her. Her lips were open, slightly cool, and her mouth–perfect.</p><p>His cock was already hard. Like the cold had put a damper on that. He ached for her, and that bed was just waiting for them.</p><p>One step.</p><p>Two.</p><p>Three.</p> <p>They fell onto the bed. His hands fought to remove her clothes even as she kicked away her boots. He wanted in her. The truth, the lies–all that could wait. Right then, he just needed her.</p><p>The lake...</p><p>Waiting...</p><p>He wasn’t gonna wait anymore. They stripped in a tangle of hands. Fabric ripped. Boots and shoes hit the floor.</p><p>He tore her panties and tossed them aside. He pushed open her legs. Found her hot, soft. He pushed her legs farther apart and stared down at her pink flesh. So damn pretty.</p><p>Because he couldn’t resist, Drake bent his head and put his lips against her sex. Her hips rocked up against him.</p><p>“Drake!”</p><p>He loved it when she screamed his name. The room had been sound-proofed. No one outside would hear her. Only him.</p><p>He licked her clit. Tasted her. So delicious. So good.</p><p>So his.</p><p>Her hands were in his hair. Not urging him away, no, his vampiress was asking for more.</p><p>He’d give her more.</p><p>He licked. He tasted.</p><p>She came against his tongue. “Drake.” A whisper now.</p><p>Slowly, he rose above her. Her eyes were wide, shining, and her fangs flashed faintly from behind her red lips.</p><p>“You’re not a monster.” It pissed him off that she’d said those words before. No fucking way. Not her. Not ever. “You’re beautiful.”</p><p>She blinked up at him, and her lips curled in a faint smile. The sight nearly broke his heart.</p><p>What was left of the damn thing.</p><p>He thrust into her, driving deep, joining them. His hands locked with hers, their fingers threading together. The bed squeaked beneath him. In and out, he thrust. Again and again. Their eyes held.</p><p>Their breath heaved out.</p><p>Faster, faster now, harder...</p><p>Her legs locked around his hips. Her feet dug into his spine when she arched toward him.</p><p>His claws cut through his fingertips, but he didn’t slice her. Hell, no, he didn’t so much as scratch her with his claws.</p><p>Deeper, deeper.</p><p>He saw her come again. Saw the flash of pleasure on her face as she eyes seemed to go blind. She jerked beneath him and her sex squeezed his cock.</p><p>Yes.</p><p>He was so close to coming. He’d explode in her at any moment when she–</p><p>“Mark me.”</p><p>Her husky words had every muscle in his body tightening.</p><p>Wolves marked their mates. He hadn’t marked her before, he’d been waiting. There was an official ceremony, a marking in front of the pack. He’d wanted to do things right with her.</p><p>He’d waited...</p><p>And lost her.</p><p>“Mark me,” she whispered again, and dammit, she was asking for his bite. She wanted him as wildly as he wanted her.</p><p>He’d never been able to deny her anything.</p><p>She arched beneath him, offering herself. His teeth closed over her flesh, right where her shoulder curved into her neck. He licked the skin there.</p><p>Mark her.</p><p>It was what the wolf wanted and what the man needed.</p><p>His teeth pressed into her skin, breaking the skin, and the sweet flavor of her blood flowed onto his tongue.</p><p>Even as he tasted her, claimed her, his climax slammed into him. The powerful release crashed through his body as he pumped into her. He lifted his head, stared into her eyes, and, as he drove into her once more, the pleasure tore a roar from him.</p><p>Her name.</p><p>Drake held her tight, didn’t let her go, couldn’t. And he kept thrusting. Because he was still hard for her and growing harder every second.</p><p>He’d finally claimed her as his own, and no one would ever take her from him again.</p><p>“How do you lose a werewolf?” Gabe asked as his boots sank into the snow. So much damn snow. Bathing everything in white.</p><p>He hated that pure snow.</p><p>It looked much better when it was stained red.</p><p>So he turned to the right and sliced open the stomach of the incompetent newbie vamp next to him.</p><p>The fresh bloods were always so hard to train.</p><p>The guy, a blond with too-soft features, immediately fell to the ground, gasping and bleeding with a bright spray of red.</p><p>“Suck it the hell up,” Gabe snarled at him because the fresh blood’s screams grated. “It’s not like the wound will kill you.” But he was tempted. Oh, so tempted to finish the job.</p><p>The foolish bastards around him had let the alpha get away. They’d let the prick just vanish into the wilderness.</p><p>“Probably back at his compound by now,” Gabe muttered as he spun away and stared off into the distance. “Surrounded by all those mangy wolves.”</p><p>Gabe had been around a long time. Too long. He’d seen the worst wars and hell that the humans could create.</p><p>That hell...it had made him smart. He’d learned from the mistakes of the others. He knew how to pick his battles. Plan his attacks.</p><p>He wanted this land. The land that was rarely kissed by sunlight. The land with the savage side that loved his darkness.</p><p>The wolves had made a truce with him long ago. Divided the territory. That twisted freak Jeremiah had been all too eager to forge a deal with him.</p><p>But the new alpha wasn’t the same. Gabe had known that for years. Drake Wyler was different. Not so easily manipulated and controlled.</p><p>Drake will come for my head.</p><p>Because Gabe had taken the head of Drake’s father. His mother. And because...</p><p>I took her.</p><p>A wolf howled in the distance. A real beast? Or a shifter out for a run?</p><p>Gabe narrowed his eyes and stared into the darkness. Jeremiah had wanted him to take the little human. To torture her, to kill her.</p><p>He’d had his torturing fun. Oh, he always enjoyed that, but...</p><p>Gabe hadn’t killed Paige Sloan. Death would have been too easy and not at all in line with his plans.</p><p>“Wh-what can we do?” One of the vamps asked behind him.</p><p>Gabe’s teeth ground together. “She stopped screaming,” he gritted out. When she’d finally realized what was happening, when she’d seen Jeremiah and had known why she was taken, Paige had stopped calling out for her lover.</p><p>He’d actually seen the life fade from her eyes, even while she was still breathing.</p><p>That total lack of feeling–he’d seen that look before.</p><p>In my own eyes.</p><p>So he’d stopped Jeremiah from gutting her. Gabe had bitten Paige, transformed her. She’d fled, but he’d watched her. And he’d always known that the perfect time would come to use her.</p><p>That time was now.</p><p>“H-he followed her out to the lake, ran right out...” Ah, this came from the still bleeding blond. John. John Mackenzie. How long had he been in the fold? Two years? Three? It was getting hard for Gabe to remember all the fresh bloods. As he stared at the blond, John gave a quick nod. “He chased her out...I saw ‘em...through my binoculars.”</p><p>Because you couldn’t get too close to a wolf’s lair, not without being scented. So the vamps used technology to supplement their already enhanced vision.</p><p>They’d watched. They’d waited. They’d attacked.</p><p>The plan had still gone to hell.</p><p>“He took her with him.” This came from one of the other vamps. The one with the dark eyes and weathered skin. Lorenzo, the Spaniard. “She’s probably dead by now.”</p><p>Gabe laughed. They really didn’t understand the wolf at all. He did. “She’s probably getting fucked.” Because she was the one weakness that Drake possessed. He’d run away from his pack for her. Run into danger for her.</p><p>The wolf was addicted, and Gabe had no doubt that, if necessary, Drake would trade his life for Paige.</p><p>Snow crunched to the left of him. The vamps around him swore and leapt forward.</p><p>Gabe shoved them out of the way. He wanted to see this visitor.</p><p>Curiosity had always been his weakness.</p><p>The white wolf edged from the darkness with his eyes glowing. The beast didn’t attack. He just stared at Gabe with that intense gaze.</p><p>Gabe smiled at him. “All alone are you?” Because there were no other sounds at that lake. This wasn’t a wolf out leading an attack party.</p><p>This was something altogether different.</p><p>Gabe crossed his arms over his chest. “If you’re here to deal...” So many deals, so many years. He knew just how the devil felt. When will it end? “Then you’re gonna have to shift and talk to me because I don’t fucking speak animal.”</p><p>The white wolf crept forward. His wary gaze darted to each of the vampires.</p><p>“Shift,” Gabe snapped, losing patience, “or I can just go ahead and kill you now.”</p><p>The wolf began to shift. Disgusting. Gabe hated the sight of the shifting wolves.</p><p>Even though he did enjoy the sounds of those popping bones.</p><p>But soon enough, a man stood before him. Fury tightened the man’s face and hands. “I know where they are.”</p><p>Fatal mistake. The wolf was just throwing all of his cards out for them to see. Now, they just had to torture the shifter to get that important information.</p><p>No deal. Just pain.</p><p>Death.</p><p>Some blood.</p><p>Snow stained red...It could be so lovely.</p><p>“I’ll take you there,” the werewolf said, “ and get you past the security.”</p><p>Security. So perhaps he would be useful after all. The pain could wait a bit. Gabe lifted a brow but didn’t move forward. “And you’ll do this because...?”</p><p>“Because I want to be alpha.”</p><p>Right. Everyone wanted power. But this wolf, with his bitter eyes and snarling arrogance, he wasn’t going to control this land.</p><p>Gabe wasn’t going to sit back and let any animal take control. Not anymore. Those days were over. There’d be no more truces. No more deals.</p><p>Only death.</p><p>But he smiled because he knew how to play the game. He’d made the damn game. “You want me to kill Drake Wyler.”</p><p>A quick nod. “That’s what you’re planning anyway, right? Kill him...and we–we can have the same arrangement that you had with Jeremiah.” The wolf glanced over his shoulder. What? Was he afraid the rest of his pack would find out that he was a traitor?</p><p>You should be afraid.</p><p>“The same arrangement I had with Jeremiah.” How the hell did the wolf know about that deal? Gabe cocked his head to the side and studied the wolf with faint interest. “So you want to kill the humans, too? Want to slice them up and hear them scream until their voices break?”</p><p>Ah, now that was surprise on the shifter’s face. Gabe almost smiled.</p><p>“He–he did–” A quick swallow and the shifter shook his head. “No, no, I just want control of the pack. The shifters will leave your men alone, I’ll make them stay away. You can hunt, you can kill...and I won’t do a damn thing to stop you.”</p><p>The whelp was annoying. “Cause you’ll control the wolves...”</p><p>“Damn right.” The shifter threw back his shoulders and stalked forward. Did he realize how close he was to death? The arrogant ones never seemed to understand, not until it was too late. “I’ll keep ‘em away. I’ll be alpha–I’ll be able to do anything and everything that I want.”</p><p>Provided Drake was dead.</p><p>“Do we have a deal?” The werewolf demanded.</p><p>Gabe stared back at him. “What’s your name?”</p><p>“Michael. Michael Flint.”</p><p>The name meant nothing and that very fact said he was staring at a werewolf no one gave a shit about. “Michael, you’re turning on your alpha so quickly.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Because I’m stronger. I’m smarter, I can–”</p><p>Gabe barely stifled a yawn. He’d heard this spiel a dozen times. “Take me to him.” Then he’d kill Drake, eliminate this werewolf dumbass, and he’d take all the territory in Alaska.</p><p>Wolves were always weakest without a leader. Without Drake–they’d be easy pickings for his vamps.</p> <p>Michael smiled. No, some arrogant fools never saw death coming.</p><p>Not until the moment death reached up and yanked their beating hearts right out of their chests.</p><p>Chapter Seven</p><p>He’d taken her blood. Euphoria filled Paige’s body. She’d been so afraid she wouldn’t be able to get Drake to take her blood.</p><p>But he had. Her wolf hadn’t even hesitated.</p> <p>He’ll be safe now.</p><p>She wrapped her arms around him, holding tight. They’d just climaxed again, and the pleasure still hummed through her body.</p><p>Then an alarm began to beep, a shrill, deep cry that came from the far right of the room. Paige tensed in Drake’s arms because she knew what that sound meant.</p><p>They’re coming.</p><p>Gabe and his vampires had managed to track them through the snow.</p><p>You didn’t find us soon enough, asshole.</p> <p>Drake pulled away from her and stalked, naked, to the line of monitors. She followed him, but paused long enough to yank on her clothes as fast as she could.</p><p>She didn’t see anyone on the monitors, not yet.</p><p>“Motion sensor,” he said, not looking away from that screen. “Could be anything...”</p><p>But the clench in her gut told her that not just anything had triggered that alarm.</p><p>Then she saw the movement of a shadow. No, not a shadow.</p><p>A wolf. A white wolf, running toward the cabin. Paige tensed. “Are we...are we supposed to be having company?” She didn’t see anyone else, just that wolf.</p><p>“Michael.”</p><p>While she watched, the wolf began to shift. As the white fur vanished, it almost looked like snow was dripping away to reveal the man’s flesh. Then he stood, staring up at the camera. Up at them. In that moment, with him back in human form, she recognized the werewolf.</p> <p>Paige’s hand went to her throat. The faint scratches were long gone by now, but she never forgot anyone who gave her pain, no matter how slight the wound was.</p><p>Not until she’d given payback for her injuries.</p><p>The old Paige, the girl she’d been, had never thought of vengeance and punishment.</p><p>The vampire knew there had to be a rough justice in the paranormal world. Only the strong survived.</p><p>She’d survive. So would Drake. She’d make sure of it.</p><p>“Why is he here?” Drake demanded. “He should be at the lake, hunting the vampires. He should–”</p><p>“He’s not alone.” Because she’d seen the other shadows. The ones that were closing in on the shifter.</p><p>Michael had to hear the vampires. Had to smell them.</p><p>But he just kept walking toward the cabin like he didn’t have a care in the world. “Does he know how to get past your security?” Her heart was racing in her chest.</p><p>Michael headed for the cabin. Another camera zoomed in on his face as he approached the front door. For just an instant, Paige caught sight of the smile that curved Michael’s lips.</p><p>Hell.</p><p>“He brought them here,” she whispered as the cold certainty settled in her gut. Michael was going to lead the vampires inside. Right to her and Drake. They would be sitting ducks for the vamps.</p><p>Their safe house had just become their prison.</p><p>Two of them. Two against–how many vamps?</p><p>The shadows pushed toward the cabin. One. Two. Three. Four...</p><p>Five?</p><p>“He’s not getting in,” Drake said as he punched a series of codes into the computer. “He doesn’t have the right access code. I changed a few days, and, after he hurt you, I didn’t give it to him.”</p><p>Her breath rushed out.</p><p>“Never really trusted him,” Drake muttered as he reached for the radio. He connected almost instantly with the compound. “Wolf gone rogue at safe house one,” he said, biting off the words. “Send back up...”</p><p>Michael wasn’t smiling anymore. He was kicking at the door. Punching. Guess he’d realized he didn’t the right code to get inside.</p><p>“That’s steel, bastard,” Drake said, voice hardening, “Reinforced fucking steel, and no, I didn’t tell your ass about that little feature, either.”</p><p>Because Drake had known that Michael might turn on him?</p><p>Another voice crackled over the radio. “Coming now, alpha. Two teams. Are there–”</p><p>The vampires closed in on Michael. They grabbed him and hauled him away from the cabin. Michael didn’t fight them. The wolf went with them willingly.</p><p>But she could see he wasn’t smiling anymore.</p><p>Her chest began to burn. She knew what would happen next. Michael might have thought he was working with the vampires. He might have thought that...</p><p>“Michael brought the vampires,” Drake said flatly into the radio, “and, they’re–”</p><p>Killing him.</p><p>Or, they would be, soon enough. Right then, they were holding him down. Slicing into him with their razor-sharp fangs.</p><p>Drinking from him.</p><p>And making sure that the security cameras saw everything.</p><p>“Get the fuck here,” Drake snarled and tossed the radio aside. Then he whirled and headed for the stairs.</p><p>Paige grabbed him. “You can’t go out there.” A glance at the monitors showed her that Michael was fighting back now. Screaming.</p><p>The vampires were still drinking.</p><p>Only it wasn’t just four vampires any longer.</p><p>Six.</p><p>Her breath caught when she saw Gabe. He wasn’t drinking from the werewolf. Gabe just stood there, staring up at the cabin.</p><p>Waiting.</p><p>He’d waited on this one attack for years.</p><p>Secrets. She hadn’t told Drake everything yet. There hadn’t been enough time. There still wasn’t.</p><p>“I’m alpha,” he growled as his gaze burned into her. “Michael is one of mine, traitor or not.”</p><p>Um, there was a not portion? That guy was a straight-up traitor. No doubt.</p><p>“I won’t let them drain him,” Drake’s voice rumbled over the beeping alarm. “Not while I just watch.”</p><p>No, Drake wouldn’t do that. He wouldn’t just stand back while another wolf suffered. That wasn’t who her shifter was.</p><p>She knew that...and that was just one of the reasons she’d known that she had to get close to him again.</p><p>He’d taken her blood, but the boost from that blood didn’t happen instantaneously. She’d learned from the vampires in Florida–the vamps that weren’t twisted freaks–that when a vampire offered her blood to a werewolf, well, the result could be pretty damn amazing.</p><p>The wolf could become stronger.</p><p>She wanted Drake as strong as he could possibly be.</p><p>But the boost took a little time. The vampire blood had to work its way through his body.</p><p>I’ll give him the time he needs.</p><p>“I’m sorry,” she whispered because he’d hate what she was about to do.</p><p>But, sometimes, a vamp just had to do what she had to do.</p><p>Since he wasn’t expecting the attack, Paige had the advantage. She grabbed Drake and shoved him back against the wall. The wall had to be reinforced with steel. The whole place was reinforced.</p><p>This would hurt. But she had to hurt him in order to save him.</p><p>“Paige, what the hell–”</p><p>She kissed him. A deep, hard kiss that held all the passion and longing she felt for him. Did he know that she still loved him? That she always had? There’d never been another in her heart. There wasn’t room for anyone else. Even with all the miles and years between them, Drake had been the only one she wanted.</p><p>He shuddered against her. “Paige.” Lust. Need. Fury. All were in his voice. And he was about to try and break away from her. She knew it.</p><p>Couldn’t allow it.</p><p>I’m sorry. The words were only in her mind this time. She brought his lips back to hers. Kissed him again. She knew just what she had to do. Give him an injury that would disable him–for a bit–but allow him to come back even stronger once her blood started pumping fully in his veins.</p><p>A tear leaked down her cheek. His arms were around her. He was holding her tight. Some attacks, you never expected.</p><p>Paige tore her lips from his. In the same instant, she reached up, grabbed his head, and slammed it back against the reinforced wall. The thud of impact had nausea rolling in her gut.</p><p>Her shifter went down with a groan.</p><p>She stared at him, aware that her heart just hurt. “I’m sorry,” she said again. She had to move fast. She knew shifters–no, she knew him–and he’d be recovered in three, four minutes tops.</p><p>He’d come after her.</p><p>He’d go after Michael.</p><p>But Drake wouldn’t die. Because she wouldn’t allow it.</p><p>She spun away. Punched in the codes she’d memorized. She’d watched him so carefully, just in case...</p><p>The steel slid back. The trapdoor opened. She rushed through the opening but took precious seconds to secure the door behind her.</p><p>Her gaze flew around the cabin. She rushed to the left, to the right, and did her best to cover that trapdoor and protect her wolf.</p><p>Then she bent down, and her hand slid inside of her boot. Oh, that sweet weapon. Without a stake, she’d feel naked. She never left home–or her wolf’s compound–without it. Held inside by special straps, the weapon was waiting for her.</p><p>Time to die.</p><p>She ran out of that cabin and raced right toward her worst nightmare.</p><p>The vamps were feeding. Michael was screaming. And Gabe–Gabe opened his arms to her as if he were greeting a lost lover.</p><p>“I’ve missed you,” he said, voice smooth as silk.</p><p>Paige’s heart raced as she ran into his open arms.</p><p>Fury filled him as Drake’s eyes flew open. What. The. Hell.</p><p>He leapt to his feet. His gaze went to the monitors, and he saw Paige, his Paige, running into the open arms of a vampire.</p><p>The fuck no.</p><p>He leapt up the stairs and punched in the code to open the door. The steel slid back, and he shoved against the wood.</p><p>Only...the wood didn’t move.</p><p>He shoved again. Harder. The wood lifted, then fell back down with a snap. His eyes narrowed. Paige had put something on top of the trapdoor. She’d locked him in.</p><p>His beast didn’t like to be caged.</p><p>With a roar, Drake slammed his shoulders into that wood. He pushed. He heaved.</p><p>The wood broke apart. He leapt up, still shoving–the bed, she’d put the bed on top of the trapdoor–then raced for the front door.</p><p>He could hear the snarls and shouts and they seemed to burn his ears. The image of Paige running into that vampire’s arms was branded into his mind. Why? Why?</p><p>He rushed outside. Saw the blood on the ground. Michael. Still alive. Barely moving.</p><p>Paige–she was...</p><p>“Hello, alpha.” The taunting voice came from his left.</p><p>Drake’s claws were out and so ready to claw that SOB apart.</p><p>“Did you lose something?” The vampire asked as Drake turned to face him.</p><p>The vampire was tall. Blond. Bleeding. And he held Paige in his arms. The embrace wasn’t one of a lover, though. One of the vampire’s arms locked around her throat, while the vamp’s other hand held a wooden stake right over Paige’s heart.</p><p>“Because it looks like I found something.” The vamp smiled, flashing fangs.</p><p>Drake saw the other vampires stalking toward him. Was he supposed to be intimidated? Scared?</p><p>He was just pissed. “Let her go.”</p><p>The vampire–he had to be the one Paige had told him about, the one she’d called Gabe-shook his head and laughed. “If that’s what you want...she’s already served her purpose.”</p><p>Drake was looking at Paige then. He saw her eyes flare wide in horror, then Gabe spun her around so that she faced the vampire.</p><p>“You’re free now,” the vampire told her, voice soft, almost tender, “because that’s what your wolf wants.”</p><p>Paige struggled against him, clawing, punching–</p><p>Drake realized, too late, just what the asshole was doing.</p><p>You’re free now.</p><p>He was killing her.</p><p>Drake roared and lunged forward, forgetting the other vampires, desperate to reach Paige, to help her and–</p><p>Gunfire.</p><p>Bullets. Thudding into his flesh. Burning. Tearing apart muscle and bone.</p><p>His blood spilled onto the ground. His legs stopped working. He wanted to reach Paige, but he couldn’t.</p><p>He was falling.</p><p>The snow turned red beneath him.</p><p>His claws lifted as he tried to dig out the bullets. So many. In his chest. His back.</p><p>He managed to tilt back his head. He could see Paige. She was still fighting with Gabe. The stake was covered in blood.</p><p>But she was still alive.</p><p>She glanced back at Drake and screamed his name.</p><p>He’d promised to protect her. She’d asked him for just one thing.</p><p>I want you to rip his head off, and I want you to make damn sure that he never rises again.</p><p>Now that vampire was laughing. She was bleeding.</p><p>And I’m dying.</p><p>No, no, he wouldn’t die. He wouldn’t go out like this.</p><p>Drake called on the beast within. Wake up. Drake pushed to his feet. Stumbled. Yanked out the silver in his shoulder and barely felt the burn.</p><p>Wake up.</p><p>The beast hated silver.</p><p>But the wolf loved the woman who was screaming for him.</p><p>A vampire came at him, still with a gun in his hand. Fool. You came too close. Drake grabbed the gun. Shot the vampire in the chest. Swiped out with his claws. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This time, it was the vampire that fell.</p><p>Drake dug another bullet from his flesh. The smoke from his blistering fingertips rose in the air.</p><p>Another vampire came at him.</p> <p>A swipe of his claws and the vampire’s blood flowed.</p><p>“Stop him!” Gabe’s scream of fury.</p><p>Then all the vampires swarmed him. Even though Drake still had at least three silver bullets in him, he didn’t hesitate when they attacked.</p><p>He roared and slashed into the chest of the nearest vamp. Another one down. Bye, asshole.</p><p>The other two vamps–they just turned and ran.</p> <p>Drake grabbed a weapon that had been tossed aside and turned his focus on the one that mattered. The vampire that was about to lose his damn head.</p><p>“How?” Gabe gritted as he stared at Drake with fury boiling in his dark gaze. “You can’t–you’re not strong enough–”</p><p>Paige’s laughter cut through his words. “He’s strong enough...if he’s got vampire blood in him.”</p><p>Drake could still taste her on his tongue.</p><p>Mark me.</p><p>The wolf had claimed his mate. Marked her. And tasted her blood.</p> <p>“You bitch.” Gabe shook Paige, sending her head snapping back.</p><p>Begging for death. Drake fired the gun. It just clicked. No more bullets. That was all right. He wanted to get his hands bloody.</p><p>“You did this to him!” Gabe shouted. The guy didn’t even seem to see Drake closing in on him. The stake had fallen from his hand. “You made him–”</p><p>“Stronger,” Paige gasped out as blood dripped from her lips. “I made him strong enough to kill you...just in case I couldn’t.”</p><p>Her words had Drake’s body tensing. He’d kill the vamp for her, all right. A promise is a promise. Drake grabbed Paige and yanked her away from Gabe. Drake’s wolf was snarling, his claws were fully extended, and he was ready to destroy.</p><p>The stake broke beneath his feet, and he broke Gabe’s neck with one twist of his wrist.</p><p>But the vampire just laughed–and his bones snapped back into place almost instantly.</p><p>“Try harder,” Gabe murmured. There was no fear on the vampire’s face or in his eyes. “Come on, let’s see what you can do, alpha. Let’s see if you can fight as hard as you father did.”</p> <p>His father? What did his–</p><p>More laughter from Gabe. Colder than the night that surrounded them. “You thought that you got all the vamps from that attack, huh? Think again, alpha. Think fucking again.” Gabe barred his teeth. “Those vamps attacked because I gave the order. Only they were supposed to have killed your sorry ass that night, too.”</p><p>But he hadn’t been at home when his family was so brutally attacked. He’d been out, watching Paige as she worked at a little diner. He’d gone to that diner over and over, eager to catch a glimpse of her. That night, he’d finally asked her out. He’d been so excited when he’d gone back home. She’d said yes! Then he’d found the blood and the bodies waiting on him.</p><p>“Jeremiah let me in,” Gabe told him as the vamp circled around Drake. “He knew you’d be the next alpha, and he wasn’t ready to let go of the pack. He let me kill them all...and drink all that shifter blood.”</p><p>Because shifter blood was stronger than human blood. Far more powerful.</p><p>Jeremiah had fed his own pack to this prick? Why?</p><p>“Your bastard alpha was addicted...the same way she wants you to be...to vampire blood.”</p><p>He could taste her...The wolf howled within him, desperate to break free and attack.</p><p>Drake sucked in a deep breath. Paige was on the ground. Still, like a broken, beautiful doll. “It’s not the blood I’m addicted to,” Drake told Gabe, voice growling. The beast was coming out. The vamp was dying. “It’s her.”</p><p>He leapt at the vamp even as the shift burned through him. The vamp would get in a few swipes while he transformed, no way around that, because Drake was weak in those moments when he was locked between man and beast.</p><p>But he had to shift. The shift would push the rest of the silver from his body, and the wolf would be stronger than the man.</p><p>The wolf would take the vamp’s head.</p><p>Gabe was smiling as he lunged toward Drake. The vamp’s fangs were barred and–</p><p>“Think fucking again,” Paige shouted, throwing the vamp’s words right back at him. Then gunfire thundered. Once. Twice.</p><p>She had picked up one of the other discarded guns. But, unlike the weapon Drake had chosen, her gun still had ammunition. She filled Gabe’s chest with the silver bullets. He stumbled back, screaming and bleeding.</p><p>Not a broken doll, not anymore.</p><p>Time to die, Gabe.</p><p>In his mind, Drake could see his mother’s broken body. His father’s pale face.</p><p>The shift was over. The wolf growled and charged the vamp. They fell down in a tangle of limbs and claws. The vampire was biting, tearing into the wolf’s body, and punching with his enhanced strength.</p><p>Gabe was too used to pushing around humans. Too used to torturing them.</p><p>Wolves weren’t so easy to take down.</p><p>“K-killed the alpha...” Gabe gritted out as they fought. “And I’ll kill you, too.” Blood dripped down his chin. “The vamps are taking over this–”</p><p>Drake’s teeth locked around the pureblood’s throat.</p><p>Paige was standing right behind him. He could smell her sweet scent, hear the ragged gasp of her breaths.</p><p>This was it. She’d be free. His parents could rest in peace.</p><p>But Gabe was still laughing. “Mine...” Gabe gasped, spitting blood. “She’ll...always be...mine. The vamps...win. We take...Alaska...”</p><p>No, he wouldn’t win.</p><p>When the wolf’s teeth sank deep, the vamp didn’t speak again.</p><p>He just died.</p><p>Chapter Eight</p><p>It was over.</p><p>Paige turned away from the sight of Gabe’s body. She didn’t want to see anymore. She just wanted–</p><p>Wolves surrounded her.</p><p>Oh, crap, when had they arrived? She hadn’t even noticed them. She’d been so intent on fighting Gabe and helping Drake that she hadn’t been aware of the wolves. They could move so quietly as they prepared for an attack.</p><p>A dozen wolves formed a circle around her and Drake. They stood back. Watching, waiting.</p><p>Had they heard Gabe’s final taunt? Hell, she knew the wolves weren’t going to let her stay in the pack, so they didn’t have to worry about her taking over their precious territory.</p><p>The minute Gabe had transformed her, she’d known that her dream of finding Drake and staying with him–forever–well, it had truly just been a dream.</p><p>They might have sex. They might turn to each other in the darkness, but his pack would never accept her.</p><p>And she wouldn’t ask him to leave the wolves.</p><p>She held up her hands and realized they were stained with blood. Her own. Gabe’s. “Easy...”</p><p>The black wolf near her snarled.</p><p>Great. Just–</p><p>Drake leapt in front of her. He opened his mouth and howled his fury at the pack.</p><p>Paige shivered. She hadn’t been afraid when she faced off against Gabe and the vamps. She’d been too pissed. But now, with the wolves circling, hell, yes, she could admit to fear.</p><p>These wolves would love to rip and tear her apart. Once they found out the truth about what she’d done, the final secret that she’d kept from them...</p><p>They’d want her head, just as she’d wanted Gabe’s.</p><p>Drake was shifting back into the form of a man before her. The snap and crunch of his bones filled her ears.</p><p>But she didn’t wait around for him to finish shifting. Paige knew an exit time when she saw one. “Don’t worry,” she told the wolves–jeez, it sure looked like they were about to rip her limb from limb. “I’m leaving.”</p><p>She had friends waiting for her. Friends who’d helped her reach Alaska. Friends who’d be glad to welcome her back to the vampire world.</p><p>We’re not all monsters. She’d learned that. Some vampires were more than just predators. Just as the werewolves were more.</p><p>She kept her steps nice and slow. The wolves could probably smell her fear, but a running target–that was prey they’d always instinctively chase. No sense giving them any more reason to want her blood.</p><p>“You’re not leaving me.”</p><p>Drake’s voice. Guttural. Still more beast than man.</p><p>She froze. “The deal’s over.” Not the conversation she wanted to have in front of a wolf pack. “Gabe’s dead.” You’re safe.</p><p>He grabbed her hand. Pulled her close. She could smell the metallic scent of the silver hanging in the air. She’d come too close to losing him.</p><p>If he hadn’t taken her blood...</p><p>She swallowed. “Let me go.” Dammit, the words were a plea. Because she knew he wanted her, just as much as she wanted him.</p><p>I’m addicted to her.</p><p>But sometimes, the things you wanted most were the things that would destroy you.</p><p>His head lowered toward hers. “I killed for you.”</p><p>She’d wanted to kill for him. To protect him, she would have done anything.</p><p>I did.</p><p>“Do you know how your alpha died?” Paige asked him quietly. Maybe he knew some of the details already. There were spies in the vampire covens. For the right price, they’d share any information.</p><p>She’d sure offered up enough money over the years for the Intel they’d given her.</p><p>Drake frowned down at her. The wolves behind him still didn’t move.</p><p>“Your old alpha was fed poisoned vampire blood.” Jeremiah had thought that he’d get stronger by taking the vampire blood. If he’d been given normal vamp blood, he would have become stronger.</p><p>But he’d been ingesting blood laced with silver for years. Poison, building up in his body. Eating away at him from the inside.</p><p>He’d lost his ability to shift. He’d lost his ability to walk. To talk. To breathe.</p><p>Because Gabe had always enjoyed his torture.</p><p>“I knew what was happening to him,” she said. She’d known for a long time. Long enough to save him. Only she hadn’t wanted to save him. She’d wanted him to suffer. “I didn’t stop it because I wanted that bastard dead.”</p><p>A wolf snarled from somewhere behind her.</p><p>Screw them all. She turned and barred her fangs right back at the snarling beast. The wolf shut up. Good. Paige exhaled on a low, rough sigh and turned back to meet Drake’s intense stare. “But when Jeremiah finally died, I-I knew Gabe would come after you.” She shook her head. “But I wasn’t gonna let you die. I knew I’d do whatever I had to do...in order to keep you safe.”</p><p>And she’d done her part. He’d survived.</p><p>“It wasn’t ever about me taking his head...to protect you,” Drake muttered.</p><p>No, she hadn’t been the one who needed protection.</p><p>“You tricked me into taking your blood,” Drake said as he towered over her. Eyes so intent. Body naked. Strong. His hand tightened around her wrist. “You got me to drink, so I’d be strong enough to kill the pureblood when he came after me.” Because despite what Drake had originally thought, even an alpha wasn’t strong enough to take out a vamp like Gabe–not Gabe and his silver wielding buddies. But an alpha pumped up on vamp blood? He could kick ass and destroy any vamp in his path.</p><p>The wolves were shifting around them. Transforming into men and women and the snow was falling again.</p><p>She didn’t look at the dead body on the ground. And Michael–he was groaning and struggling to his feet. Some of the shifters went to help him.</p><p>“Leave him,” Drake ordered, voice tight with fury. “He worked with the vampires. He led them right to me.”</p><p>The shifters froze.</p><p>“He’s banished from the pack,” Drake said flatly. A judgment. Cold and brutal. “Leave him where the fuck he is.” His head turned as he stared over at Michael. “You’re still breathing, so count yourself damn lucky.”</p><p>When Drake’s gaze came back to her, Paige forced herself to meet that hard stare. So much fury. How much was for her? For the vamp he’d killed? And for the traitor he’d had in his own midst?</p><p>“You lied to me,” Drake said. The words were low and all the more lethal for their softness.</p><p>“From the beginning,” Paige agreed, her own voice just as soft. But there was no reason for lies anymore. She’d done her job. She’d protected him.</p><p>They’d saved each other.</p><p>Now they could go their separate ways. He’d go back to his pack. She’d go back to the life she’d created in Florida.</p><p>So what if she went back without a heart? She’d been missing that particular organ for years.</p><p>Paige turned away. She had to get out of there. Her chest was burning. Aching. Looking at Drake just hurt too much. Her job was done.</p><p>Time to leave before he saw through her mask.</p><p>I want you. I want to stay.</p><p>Some things just weren’t meant to be.</p><p>But Paige didn’t run away. She walked. One foot in front of the other. Slow. Steady.</p><p>“Was everything a lie?”</p><p>She stopped. Didn’t look back. “Not everything.” Then because–hell, what did she have to lose? Paige glanced back over her shoulder. “I really have always loved you.” From the first moment she saw him. “And I always will.”</p><p>Then she kept walking. Because sometimes, love just wasn’t enough.</p><p>Not when you were a vampire.</p><p>And not when the man you wanted more than blood was a werewolf.</p><p>Did Paige really think that she was just going to walk away? Hell, no. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Drake watched her as she left him. The snow drifted over her dark hair. Her steps were slow but certain.</p><p>Not running...just leaving him.</p><p>Right after she’d said she loved him? The woman was about to break him.</p> <p>He inhaled deeply, drawing in her scent. He’d never lose her again.</p><p>Never.</p><p>“Get rid of the bodies.” Easy enough in the wild. “Head back to the compound.” Because the battle wasn’t over. Not for him.</p><p>His gaze swept around the assembled wolves. “Then if there is any one of you who wants to challenge me, take your best shot.” He was ready for a fight with claws and teeth and blood and fury. “Because my mate is going to be with me, in my pack, by my side, for the rest of my life.” Even if his life was shorter than hers.</p><p>He’d take what he could get.</p> <p>Mate. That was what Paige was. She’d been his mate since she was nineteen.</p><p>She’d be his until he took his last breath.</p><p>Vampire, werewolf–it didn’t matter. She was his.</p><p>He’d fight for her, just as she’d fought for him.</p><p>When the fight was over, he’d find her.</p><p>I’ll come after you, Paige.</p> <p>Always.</p><p>Silence.</p><p>Drake stared at the group of shifters who’d assembled in the compound’s courtyard. No one spoke. No one moved.</p><p>They all stood before him. Waiting.</p><p>He wore a pair of jeans, hanging low on his hips, and his claws were out.</p><p>His gaze swept over them all. “Who’s first?” The wolf inside was already howling.</p><p>He’d fight to give Paige a place at his side because he damn well wasn’t living without her.</p><p>No one stepped forward.</p> <p>“Who’s first?”</p><p>They weren’t meeting his stare. The shifters backed up, showing submission.</p><p>All of them backed up...except for Heath. His first-in-command stepped forward.</p><p>First.</p><p>But Heath lifted his hands and no claws burst from his fingertips. “I have no quarrel with you or your mate.”</p><p>Drake grabbed him. Lifted him into the air. “That’s not what you said before.”</p><p>“Before...” Heath swallowed and shook his head. “Before I didn’t know what she’d risk for you.”</p><p>Everything.</p><p>“We saw the blood. The bodies. We know what she did.”</p><p>Fought. Saved him. Saved the pack.</p><p>Drake dropped the other shifter. Heath scrambled to his feet. “We’ll protect her, swear allegiance to her, just as we do to you.”</p><p>There was a murmur or agreement from the shifters. Not silence, not anymore.</p><p>The murmur turned into a growing roar of approval. Determination.</p><p>“So go get your mate,” Heath told him, voice fierce now. “Bring her into the pack. Bring her back where she belongs.”</p><p>Drake’s bare feet sank into the snow as he rushed through the crowd. Paige’s sweet scent still filled his nose. He wasn’t losing her this time.</p><p>Not this time.</p><p>Drake ran after his mate, and as he ran, he knew exactly where he’d find her.</p><p>The frozen lake stared back up at her. So still and cold. Paige was shivering and she was hungry and she just ached.</p><p>But she was still alive. Sort of, anyway, and pain was just part of life.</p><p>She turned away from the lake.</p><p>And found Drake watching her.</p><p>She was so surprised to see him that she flinched. “D-Drake?”</p><p>He stood next to an old, twisted tree, one bent beneath the weight of the snow. “I was supposed to meet you here,” he said, voice rumbling. Intense. Dark.</p><p>She shook her head. “Th-that was a long time ago.”</p><p>He pulled a necklace from the back pocket of his jeans. Her necklace. The one he’d taken away that first night.</p><p>Her chin lifted.</p><p>“Do you know why I gave this to you?”</p><p>She did. She’d known him so well back then. “Because you loved me.” The words were said with certainty. Once upon a time, a boy had loved a girl.</p><p>Once upon a time...</p><p>He stalked toward her. Didn’t even seem to feel the cold. But then, he wouldn’t. Not like she did.</p><p>He came toward her and lifted the necklace. “I still do love you, sweet.”</p><p>She raised her hand and stopped him before he could slide that necklace over her head. “You...you took this from me.”</p><p>Because of what she was.</p><p>Not a girl. Not just a boy.</p><p>A vampire. A werewolf.</p><p>“I was going out of my mind that night. I’d missed you for so long...” His breath heaved out in a rush. “I hurt, and I wanted to hurt you.”</p><p>A dark admission.</p><p>His head bowed. “I want to make it up to you. I want to make everything up to you.”</p><p>And there, in the snow, with the lake behind her and too many memories around them, Drake dropped to his knees.</p><p>Her breath rushed out. An alpha should never submit to another like this. It wasn’t the way of the pack. It wasn’t–</p><p>His hand clenched around the necklace. “I thought you didn’t want me.”</p><p>She’d always wanted him.</p><p>“I never loved anyone else. All those years...the only one to ever touch my heart...was you.” He looked up at her. She saw the beast and the man in his eyes. “Stay with me.” A plea, from a man who’d never pleaded for anything before.</p><p>Paige couldn’t speak.</p><p>“I can make things right for you. I’ll make you happy, I swear. Just give me a chance.”</p><p>She licked her lips and tasted the sorrow from the past. “I’m not the same...”</p><p>“You’re stronger. More beautiful. And I fucking love you even more than I did before.”</p><p>Her hands touched his shoulders. Hesitant. Hopeful. “You...do?”</p><p>“Yes.” Said with a growl. Said as he stared into her eyes. In his gaze, she saw–</p><p>The future.</p><p>“I want you to be with me, for as long as I walk this earth.” Now his words came faster. “I won’t live as long as you, I know that. Just give me those years, just give me–”</p><p>She sank to her knees before him. Kissed him. Kissed him so hard that they tumbled back onto the soft snow.</p><p>And he tasted so good. Like forever. Because that was what she could give to him. Her head lifted slowly. “I can give you more.”</p><p>If he’d let her.</p><p>His brows pulled low. His arms were around her, holding her so close. “You’ll stay with me?”</p><p>“The pack–”</p><p>“They want you to stay. They want you to come home.”</p><p>Home.</p><p>“Fifty years,” he told her, “sixty. Give me that, give me–”</p><p>She shook her head and saw the stark pain flash across his face.</p><p>“I love you,” he told her but he sounded...lost.</p><p>She knew because she’d been lost for years. “I can give you more,” Paige promised him. Because she’d learned so much from the vampires who’d helped her in Florida.</p><p>Down there, another werewolf had paired with a vampire female. They’d discovered that if a vampire’s blood was shared, the wolf would become stronger.</p><p>Aging stopped for the wolf. Death was put on hold.</p><p>Jeremiah had thought that he was cheating death by drinking from a vamp, but that blood had been poison.</p><p>She’d never poison Drake. She’d give him her blood, and she’d give him... “Forever,” Paige whispered and kissed Drake again.</p><p>As she kissed him, she heard the howl of wolves in the distance.</p><p>She wasn’t afraid of that sound. She wasn’t afraid of anything. Not anymore.</p><p>Because she wasn’t lost now. She was home and safe...in the arms of her wolf. </p> </body></html>"]