["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>This was the longest wedding reception in the history of the world. She wished it were over—which truly was saying something, since it was her wedding reception.</p><p>Jack leaned closer and whispered, “Stop sighing.”</p><p>His warm breath sent goose bumps cascading down the right side of her body. Keely turned her head so his five o’clock shadow scraped her jaw. She closed her eyes and inhaled his familiar scent: cologne, starch on his shirt collar and the underlying hint of his heated flesh.</p><p>Jack Donohue. Her husband. She really and truly was married to this gorgeous, sexy, intense man.</p> <p>Keely sighed again, not out of annoyance, but out of pure pleasure.</p><p>He smiled against her cheek. “Now that’s a sigh I recognize.”</p><p>“I have different sounding sighs?”</p><p>“Uh-huh. You make that one in bed after I—”</p><p>“Bringing up sex when we aren’t having any just makes me cranky, Jack.”</p> <p>His soft chuckle tickled her ear.</p><p>“It’s not funny. Why aren’t we rolling around in bed nekkid right now?” she demanded in a fierce whisper. “We are married. Why are we still stuck at the reception? No one would care if we left.”</p><p>He eased back to gaze into her eyes. “As much as I can’t wait to roll around naked with you, if we skip out early, your dad will kill me, turning you into a widow before you’ve had a chance to be a wife.”</p><p>His voice dropped an octave and the possessive rumble vibrated through her in an electric caress. “My wife.”</p><p>“You certainly get off on saying my wife.”</p><p>“Yes, I do, Keely McKay Donohue. So go ahead and call me a Neanderthal.”</p> <p>“I would if it meant you’d employ some caveman tactics and drag me off to your cave. Right now?”</p><p>she asked hopefully.</p><p>“God, I wish.”</p><p>“Jack, I—”</p><p>The chinking of silverware hitting glassware crescendoed. Knowing what the crowd of family and friends wanted, Keely twined her arms around Jack’s neck and gave him a long, wet, tongue-tangling kiss that probably caused some guests to squirm in their seats. She didn’t give a damn. It was her wedding day.</p><p>If she wanted to make out with her husband, she damn well would.</p><p>When they broke apart, Jack murmured, “Two more hours and I swear we’re outta here.”</p><p>“I’m holding you to that.”</p> <p>“I’d expect nothing less, buttercup.”</p><p>“So where are we going in one hour and fifty-nine minutes?”</p><p>He kissed her temple and said, “It’s a surprise,” for the millionth time. Then his brother Justin snagged his attention and he turned away.</p><p>Sneaky-ass tease. Jack hadn’t told her where they were spending their two-week island honeymoon beyond the cryptic hint that she only needed to pack beachwear—preferably a dozen skimpy bikinis.</p><p>Normally he’d spill his guts if she bribed him with unlimited, no-strings-attached sexual favors. But this time, the stubborn man wouldn’t budge.</p><p>After the Twin Pines banquet workers cleared the dinner plates, the head table was disassembled to make room for the wedding dance and members of the wedding party were relocated. Which would’ve been fine with her, if she and Jack hadn’t ended up on opposite sides of the dance floor.</p><p>A hard bump connected with her hip as AJ McKay—her best friend, matron of honor and sister-in-law—sidled up beside her. “Why the frowny face, Mrs. Donohue?”</p><p>She plastered on a fake grin. “Better?”</p><p>“No, that’s actually worse. What’s up? You seem jumpy.”</p><p>Would she sound like a horny ho-bag if she admitted all she could think about was jumping her husband? Wait. Could she even be a ho-bag if she was obsessed about having nonstop, shake-the-barn-rafters sex with the man she’d just pledged the rest of her life to?</p><p>“Granted, we’re all anxious. It’s been a crazy couple of weeks,” AJ said, breaking Keely’s thoughts.</p><p>“Four different family members having bouts of false labor during your bridal shower. The bachelorette party. I think Ramona is still hungover.”</p><p>Everyone had been shocked at how tame former wild child Keely McKay’s bachelorette party had played out last weekend. Not a lot of takers for a tequila shooting contest besides her cousin Ramona when the majority of Keely’s sisters-in-law and female family members were knocked up. But truthfully, not reverting to her formerly rowdy ways—even for one night—had been a huge relief.</p><p>Screeching feedback from the microphone distorted the air.</p><p>“Sorry about that,” JC Blackwell said from the stage. “The band is set up and we’re ready to kick off the weddin’ dance. So can I get Carson and Keely up here? We’ll start out with the father-daughter dance.</p><p>Hey, you know, in all the years I’ve been doin’ this, that’s the first time I’ve ever said that at a McKay wedding.”</p><p>Laughter rang out as Keely met her father in the center of the dance floor.</p><p>He squinted at her.</p><p>“What?”</p><p>“You’ve got a funny look on your face, girlie. Aw hell, you ain’t gonna cry again, are you?”</p><p>“Maybe.” She playfully tugged on the silky silver handkerchief poking out of the front pocket of his suit. “At least you’re prepared if I do begin to bawl.”</p><p>He muttered, “Don’t know why I have to wear this fancy-ass piece of crap. It’s worthless.”</p><p>Keely laughed.</p><p>The band started a cover of Kenny Chesney’s “There Goes My Life” and her dad twirled her around and around the dance floor like he had when she was five years old. She looked at him suspiciously.</p><p>“What?”</p><p>“Have you been drinkin’?”</p><p>“Yep. Ain’t every day a man gives away his daughter. His only daughter.”</p><p>Damn him. She was trying so hard not to cry. “Daddy—”</p><p>“We dancin’?” he asked gruffly. “Or talkin’?”</p><p>“Dancing. Definitely.” And she let him twirl her all he wanted.</p><p>When the dance ended and he hugged her in such a public display of affection, she knew he’d been hitting the bottle. When he released her and motioned for JC to bring the microphone to him, Keely thought her father might actually be hammered. Her dad. Making a speech. In front of over two hundred people.</p><p>He held her hand and cleared his throat. “The McKay Ranch had been in existence for over a hundred years when this little gal made an appearance. My brothers and me never considered what havoc this little spitfire would cause in all our lives and our future.”</p><p>More laughter.</p><p>Keely’s stomach clenched. She desperately wanted Jack by her side as support in case her father’s impromptu speech somehow embarrassed her.</p><p>“Our beautiful Keely was the only girl for a long time. But with the arrival of more darlin’ little girls into the McKay family the last few years,” he winked and waved at his granddaughters, Liesl, Oxsana and Sasha, “me’n my brothers know that times are changin’ and these girls deserve to have an equal part in the McKay Ranch if they choose to.</p><p>“So we’ve restructured the way we’re doin’ things and... Hell, it’ll be easier to show you. Hang on a second.” He released Keely’s hand and rooted in the inside pocket of his suit coat. He held out a folded piece of paper.</p><p>Keely gave him a blank look.</p><p>“Go on, girlie. Open it up.”</p><p>With shaking hands, Keely unfolded the legal document and she scanned the words. She reread it twice before she met her father’s bright eyes. “Daddy, are you serious?”</p><p>“Yep.”</p><p>The McKay Ranch had deeded Keely and Jack Donohue two hundred acres. Beyond shocked, beyond touched, she couldn't utter a single word.</p><p>Carson whirled around, searching the crowd. “Donohue? Where are you?”</p><p>Jack stepped forward and wrapped his arm around Keely’s waist before he peered at the document.</p><p>He looked at Keely and then Carson. “Wow. That’s very generous. Thank you, sir.”</p><p>“My pleasure. Though, I don’t envy the headaches you’re gonna have building my girl her dream house on that spot she’s always had her eye on. Do you know how many dollhouses she had growin’ up? I can’t count all the hours she spent redecorating them.”</p><p>More laughter.</p><p>Her father, the comedian. Just when she was afraid he’d keep going, Carson handed the microphone back to JC. He walked straight into the arms of Keely’s mother, who stood on the edge of the dance floor, with damp cheeks and wet eyes.</p><p>JC said, “Let’s give our bride and groom their first dance as husband and wife.”</p><p>Jack tucked the paper inside his tux pocket and brought Keely against his body as the band began to play “So Good in Love” by George Strait.</p><p>Keely clutched him, burying her face in his neck to hide her tears.</p><p>Jack didn’t say a word. He didn’t have to. He just knew what she needed and gave it to her without question.</p><p>God she loved this man.</p><p>The song ended and another slow one began. She’d specifically requested all slow songs be played first, figuring it’d be the only time she’d get to slow dance with her husband.</p><p>Sure enough, her oldest brother, Cord, tapped Jack on the shoulder during the second song. “Mind if I cut in?”</p><p>“Hell yes, I mind. Go dance with your own wife, McKay.”</p><p>Okay. That was...atypical Jack behavior.</p><p>Her next oldest brother, Colby, tried to cut in, and once again, Jack refused.</p><p>Same response when her brother Colt approached them.</p><p>Same response when her brother Cam approached them.</p><p>Same response when her brother Carter approached them.</p><p>Then Jack systematically shot down all eight of her McKay cousins and all eight of her West cousins.</p><p>Puzzled by his hard stance, she whispered, “Jack. What is wrong with you?”</p><p>“I don’t trust any of your redneck relatives not to hijack you for that stupid ‘steal the bride’ tradition. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>I’m letting them know the only man stealing you away tonight is me.” His lips brushed her ear. “In one hour and seventeen minutes.”</p><p>“Oh.” That was really sort of sweet. Demented, but sweet.</p><p>Finally Jack relented and let Keely dance with his brother Justin—but only because Jack was dancing right beside them with his mother, Doro, the entire time, watching them like a hawk.</p> <p>His possessive behavior didn’t piss her off like it did when her hard-assed, overprotective brothers and cousins acted the same way. Although outwardly Jack was much more polished than her male relatives, inside, every inch of him screamed primal dominant male. And could she just get a thank you, Jesus for that fact?</p><p>After Justin handed her back to Jack, her nephews and nieces surrounded them, both intrigued and repelled by their ability to get Aunt Keely to kiss Uncle Jack simply by hitting a spoon into a glass.</p><p>She and Jack exited the dance floor and made the rounds together, chatting with wedding guests.</p><p>When Keely glanced at the clock she realized only thirty minutes remained until she and Jack planned to leave.</p><p>Where was he taking her? And why had her matron of honor disappeared?</p> <p>While Jack was engrossed in a conversation with Trevor and Edgard, Keely tired of waiting for AJ to materialize. She palmed the dressing room key and quickly ducked down the hallway out of Jack’s sight.</p><p>Maybe he wouldn’t notice she was gone. Besides, she only needed a minute to ditch the ridiculously puffy underskirt—which was not enough time for any of her brothers to snatch her.</p><p>She unlocked the door to the makeshift dressing room, opening it just far enough to sneak inside. As she quietly shut the door by pressing her palms into it, she heard squeak squeak squeak and then, “Yes.</p><p>God, yes.”</p><p>“That’s it, baby doll, give me one more.”</p><p>Squeak squeak squeak.</p> <p>Keely whirled around. Cord had AJ bent over, and her hands gripped the table. His pants were around his ankles and her dress was flipped up her back and... Why in the hell hadn’t they heard her come in?</p><p>The squeak squeak squeak of the table rocking across the floor was only slightly louder than AJ’s moan.</p><p>That was why.</p><p>Keely shrieked and clapped her hand over her eyes before she faced the door again. “Omigod. I did not just see you two boinking like bunnies during my wedding reception!”</p><p>Silence.</p><p>And the silence was worse than the squeaking and moans.</p><p>“Keely—”</p><p>She held up her hand, but didn’t turn around. “Not a word, Cord. I’m leaving, but so help me God you two had better finish up fast because I need AJ’s help pronto.” With that, she practically ran out.</p> <p>Big surprise Jack blocked the mouth of the hallway, arms crossed over his chest, one eyebrow raised, wearing his what the fuck? expression.</p><p>Shit. “I can explain.”</p><p>“Later. Right now they want us to cut the cake.” He held out his hand.</p><p>Keely took it, allowing him to lead the way to the cake table.</p><p>Photos were snapped. Given their volatile past, everyone seemed disappointed when she and Jack didn’t smear wedding cake all over each other’s faces.</p><p>“It’s time to go,” he said, nibbling frosting from her fingertips.</p><p>“Okay. As soon as AJ gets done screwing—”</p><p>“Hey, guys, what’s up?”</p><p>Keely looked over at her very mussed, very flushed sister-in-law. Before she shot off a snarky comment like Besides your skirt? Jack spoke.</p><p>“We’re getting ready to leave. Can you tell me where it is?”</p><p>“What? Oh, that. Umm, it’s at the senior center.”</p><p>“Thank you.”</p><p>Her gaze bounced between AJ and Jack. “What the hell are you two talking about?”</p><p>“Nothing to concern yourself with, sweet wife.” Jack’s smooch on her cheek didn’t mollify her at all.</p><p>Ramona bounded up. “Now that you’ve cut the cake, it’s gotta be close to time to throw the bouquet, right?”</p><p>“Yes. Round up all the single ladies. Maybe you could get Justin to help you track down the bachelors for the garter—”</p><p>“Not necessary,” Jack inserted, “because there won’t be a garter toss.”</p><p>“What?” Keely stared at him with total confusion. “But that’s tradition! You remove the garter—”</p><p>“Oh, I will be removing the garters, Mrs. Donohue, but not in front of your whole damn family.”</p><p>The set to his jaw indicated this was nonnegotiable.</p><p>Bossy man.</p><p>“Soon,” he added in that alpha male tone, which always made her weak-kneed.</p><p>AJ tugged on her arm. “Come on. I’ll help you get changed.”</p><p>As they turned the corner and started down the hallway, Keely saw her cousin Brandt McKay in a heated discussion with Jessie McKay, his former sister-in-law. Suddenly, Jessie pulled back and punched Brandt in the stomach hard enough that Brandt bent over to clutch his gut.</p><p>Keely gasped.</p><p>Jessie’s angry gaze zeroed in on Keely and then she glanced at AJ who’d frozen a few steps behind.</p><p>“Sorry. I didn’t mean...”</p><p>“To punch Brandt in the stomach? That was an accident?”</p><p>“Umm. No. I meant to do that. I didn’t mean to cause a scene and I...really have to wash my hands.”</p><p>Keely’s eyes stayed on Jessie, but Jessie wouldn’t look at her. “Don’t be too long. I’m about to throw the bouquet.”</p><p>AJ unlocked the door to the dressing room and Keely followed her inside.</p><p>“I can’t believe Jessie just slugged Brandt. What do you think is going on with them?”</p><p>“Nice try at distracting me, AJ, but I can’t believe you and Cord were having sex in here.” Keely reached under the layers of her wedding gown and yanked off the puffy slip-crinoline that’d started to itch.</p><p>Ah. Much better. “How is it you get to have sex on my wedding day? And I don’t? That’s not fair.”</p><p>“Being pregnant makes me horny. Plus Cord looks so damn good in that suit I just wanted him right then and—”</p><p>“And my brother just obliged you? During my wedding reception?”</p><p>She shrugged. “Hormones and lust are beyond my control, Keely, when it comes to my husband. And he’s always up to the challenge of taking care of my every need.” AJ smoothed her hands over the bulging front of her bridesmaid’s dress and frowned. “Good Lord. How Cord still wants me and sees me as sexy when I look like a beached whale is a miracle.” She caught Keely’s gaze. “Anyway, let’s get you outta that wedding dress and into your traveling clothes.”</p><p>Keely stood in front of the antique boudoir mirror, fussing with the lace panel on the bodice as AJ</p><p>began unhooking the hundred or so buttons running down the back of her dress. “Do you know where Jack is taking me for our honeymoon?”</p><p>“Yep.”</p><p>Her mouth dropped open. “How’d you get him to tell you?”</p><p>“I volunteered to keep his car hidden so none of your overzealous relatives would decorate it with soap, shaving cream, tin cans and toilet paper,” she said smugly. “That’s what we were just talking about.</p><p>Where I stashed it.”</p><p>AJ played dirty, knowing how much Jack babied that car. But Keely had a trump card. “So, BFF, seeing you and Cord going at it like teenagers just proves how little alone time you two get these days with two point three kids, so I’ll make you an offer—I’ll baby-sit the boys every Saturday night for a month if you tell me where Jack is whisking me off to.”</p><p>“No deal. If Jack finds out I blabbed... Well, he is much scarier than you, Keels.”</p><p>The door opened.</p><p>Speak of the devil... Jack sauntered in, and once again Keely marveled at how dangerously sexy he looked in his black tux. Plus, he was sporting that wicked get naked grin that always caused her body to pulse with anticipation.</p><p>“Jack, you’re not supposed to be in here,” AJ said.</p><p>“I need to talk to my wife.”</p><p>“It can wait.”</p><p>“No, it can’t.”</p><p>“My job as her matron of honor is to help her out of her wedding dress,” AJ reminded him.</p><p>Keely met Jack’s eyes in the mirror. “Jack is very good at getting my clothes off, aren’t you?”</p><p>“Dare I say...I’m an expert at it?”</p><p>AJ muttered, “And...that’s my cue to leave.”</p><p>“Lock the door and don’t tell anyone where we are for at least ten minutes,” Keely said as AJ fled the room.</p><p>Her body stayed perfectly still as Jack sidled in behind her.</p><p>“Only ten minutes?” He pressed a soft, warm kiss to her nape. “I should be insulted.”</p><p>“You could prove me wrong. I know firsthand that table over there is sturdy enough for whatever you’ve got in mind.”</p><p>His eyes narrowed. “How do you know that firsthand?”</p><p>Crap. “Only because I walked in on Cord and AJ havin’ a quickie.”</p><p>“Ah. However, just to be clear, buttercup, there is no quickie in your immediate future.”</p><p>“Then why are you in here?”</p><p>He sighed. “All you want me for is sex. I feel so cheap.” His rough-skinned fingers traced the bare line of her spine down to where the buttons of her dress were undone.</p><p>“I could make you feel used too,” she offered. She felt the fabric shift as Jack loosened her dress. Her skin beaded from his steady, gentle touch.</p><p>“Thanks, but no. To answer your question, I’m here to give you news.”</p><p>“Good or bad?”</p><p>“Both. The bad news is I’m undressing you now. Otherwise, I won’t have a chance to see the very sexy wedding night lingerie you’ve been teasing me with all damn day.”</p><p>Keely stared at his dark head reflected in the mirror. “Why’s that?”</p><p>“Because as soon as you’re changed and done tossing the bouquet, we’ll be hopping in the car and driving to Denver. Our flight leaves at five a.m. So we won’t immediately have a wedding night, rolling around naked in bed, like you’ve been hinting at all damn day.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>A whine arose but she squashed it. “So what’s the good news?”</p><p>“I promise the wait will be worth it when we get to our honeymoon destination.”</p><p>“Which is where?”</p> <p>His mouth grazed her ear as he continued working the buttons. “Tahiti.”</p><p>She smiled. “Tahiti is good.”</p><p>“Mmm. I thought you’d like that. Especially since we’ll have two weeks to roll around naked in our private villa. Or on our private beach.”</p><p>She couldn’t freakin’ wait for two weeks alone with Jack. “What time will we get there?”</p><p>“We fly from Denver to LA, and from LA to Papeete. Tahiti is a little off the grid, so it’ll take about fourteen hours. We should be there in time tomorrow night to see the sunset.” He kissed the side of her neck and murmured huskily, “That was the last button. Turn around and drop the dress, Keely.”</p> <p>Her blood heated. Her pulse spiked. Her body went wet and soft in places, tight and hard in others.</p><p>Jack could fire her up in no time flat with mere words. But that didn’t mean she’d make it easy on him. Or that she wouldn’t use every feminine trick in the book to get him to recant his “no quickie in your immediate future” comment.</p><p>Holding the bodice in place over her chest, she faced him.</p><p>Jack wore the hooded expression that told her he was trying very hard to keep it together and keep his hands off her.</p><p>Ooh. Snapping his control was gonna be so much fun.</p><p>Keely loosely held the dress with her left hand, giving him the occasional glimpse of her cleavage, while her right hand began to remove the bobby pins maintaining her up ’do.</p> <p>“What are you doing?”</p><p>“Lettin’ my hair down.” The pins hit the tile floor, one at a time, each with a soft ping. “You like it when I let loose, don’t you, Jack? And I’ve been coiled so tightly all day.”</p><p>He said not a word, but his hands were clenched into fists at his sides. The muscles in his jaw jumped, as did the muscle in his pants.</p><p>Heh heh.</p><p>After the last pin freed her hair, she sighed as the tresses fell, knowing how Jack loved to wrap those loose waves around his hands as he fucked her. “Ah. I needed that. Now. Where were we?”</p><p>“Goddammit, Keely—”</p><p>“Oh, right, you asked me to drop the dress.” She released the heavy weight of the beaded bodice and it gradually slid down her upper torso, briefly clinging to her hips before she slipped it over her thighs to pool around her feet in a pile of satin, chiffon, and lace.</p><p>Not that Jack noticed the crumpled state of her wedding dress. His gaze was firmly glued on her undergarments.</p> <p>Low-cut push-up bra edged in white lace?</p><p>Check.</p><p>Ass-molding boy shorts in white spandex also edged in lace?</p><p>Check.</p><p>Satin and lace garters holding up sheer white stockings?</p><p>Check.</p><p>White satin stiletto peep-toe pumps with delicate ankle straps?</p><p>Check.</p><p>Hungry, possessive look on Jack’s face?</p><p>Check.</p><p>Keely tiptoed over the heap of fabric and stopped, expecting Jack would rush her, pin her to the wall, and do all the raunchy things that were etched on his handsome face.</p><p>But the stubborn man didn’t move.</p><p>So she did. She twirled and gave him her backside, swinging her hair as she threw her arms above her head and gyrated her hips. Then she peered at him over her shoulder and murmured, “You like?”</p><p>And...he was done for.</p><p>Jack’s growl was her only warning before he was on her. Spinning her into his arms, smashing her mouth beneath his, kissing her frantically, one hand twisted in her hair, the other clamped on her butt.</p><p>Keely wasn’t too far gone with lust not to release a little chuckle of superiority that Jack’s resistance had vanished so fast upon seeing her peep-show.</p><p>He herded her until the backs of her thighs hit the table ledge. Without missing a beat, Jack lifted her, positioning himself between her legs, continuing to gift her with the soul kisses she craved.</p><p>After he’d gotten her worked up to the point she writhed against him, he trailed his lips to her ear.</p><p>“Such a cocktease you are, wife. You are going to pay for that little display. Later.”</p><p>“Later? Not now?”</p><p>“No.” Jack nuzzled her temple. Then his mouth followed the curve of her cheek to the corner of her smile. Keeping his eyes on hers, he lightly sank his teeth into her bottom lip before continuing the hot, wet, openmouthed kisses down the column of her throat.</p><p>Keely moaned, tempted to let her head fall back, close her eyes and lose herself in the mind-boggling way this man made her feel. But she kept her eyes on Jack as he conducted his sensual blitz. When he looked at her, a hint of devilry glinting in his eyes, she shivered.</p><p>“Cold?” he murmured as his tongue traced the lace band of her bra down the valley of her cleavage.</p><p>“Yes. You should do the gentlemanly thing and take your clothes off to use your body heat to keep me warm.”</p><p>He chuckled against the upper swell of her breast. But he didn’t dally. That oh-so-talented mouth progressed southward, slower than she liked, but chances were high they both had the same end point in mind.</p><p>Finally.</p><p>Keely’s breath stalled when his hands gripped the tops of her legs and spread her thighs wider. She squirmed when Jack’s tongue traced the McKay cattle brand tattooed on her hip.</p><p>And she flat out whined when he retreated.</p><p>“Better grow some patience, cowgirl. You’re going to need it.” He grabbed her right ankle, leisurely unbuckled the rhinestone strap and threw her shoe behind him.</p><p>She laughed. The man surprised her on so many levels. She knew a lifetime wouldn’t be enough to learn everything that made him tick. “Jack. I love you.”</p><p>“I know you do.”</p><p>“Don’t you have something to say back to me?”</p><p>“Yes.” He lifted her left ankle and removed that shoe in the same manner. He stepped just out of her reach and said huskily, “Unhook the stockings.”</p><p>“But...” That wasn’t what she wanted to hear.</p><p>“But what?”</p><p>“But isn’t that your job?” she cooed. “Divesting me of all my apparel?”</p><p>Jack shook his head, but his gaze remained on the satin bridal garter, centered mid-thigh, below the band of the stocking. “Unfasten them, but leave the stockings and the garters on.”</p><p>Damn man was taking all the fun out of it...or was he? Keely crooked her finger. “I need to borrow your big, strong body to support myself so I don’t faint dead away with all the unbridled lust you bring out in me, husband.”</p><p>He grinned. “Laying it on a little thick, aren’t you?” but he edged forward.</p><p>Keely gently set her foot on his crotch. Not as unaffected as he projected; he was totally hard. “Talk about thick.” She smirked when he growled again, but she noticed he didn’t even attempt to move her foot.</p><p>She popped the buttons, moving the bridal garter up over the top of the stretchy band of the stocking, and slid her stocking-clad foot up and down his erection before she switched sides.</p><p>Once the stockings were loose, Jack leaned in and kissed her. A teasing brush of his lips. A fleeting nibble of his mouth on hers as his fingers inched up her thigh in a whisper-light touch across her trembling skin. When he reached the top of the stocking, he inserted his finger inside and slowly, slowly, slowly dragged it down the length of her leg.</p><p>Keely’s whole body was quivering. Tingling even. And he hadn’t even started working his magic touch on all her other special tingly parts. “Jack—”</p><p>Her protest disappeared in his intense kiss.</p><p>Jack removed the other stocking with the same painstaking precision, with such drawn out eroticism, she whimpered.</p><p>He laughed and dropped to his knees.</p><p>Oh hell yeah. Now we’re talkin’.</p><p>His mouth meandered up the inside of her thigh, the tantalizing touch of his hot breath, wet tongue, moist lips and the scrape of his five o’clock shadow was almost too much to bear. He latched onto the bridal garter with his teeth, snapped it once, and tugged it down her leg.</p><p>Okay, this garter removal business was much better in private.</p><p>One down, one to go.</p><p>She expected he’d torment her mercilessly on the other leg before pressing his mouth to her damp panties and giving her what she really wanted.</p><p>But Jack just tugged the other bridal garter off and rolled to his feet. “Done. Now get dressed so we can hit the road.”</p><p>“That’s it?”</p><p>“What? Were you expecting we’d go at it right here, right now?”</p><p>“Uh, yeah. Wasn’t that the point?”</p><p>“No. I’ll admit I was considering throwing you a bone after the striptease, but you were so cocksure I had no control—”</p><p>“Throwing me a bone?” she repeated. “Are you tryin’ to piss me off, Jack?”</p><p>His eyebrows rose. “On our wedding day? Not likely.”</p><p>“Then why won’t you—”</p><p>“Pin you down on the table or on the tile floor or against the wall and screw you blind?”</p><p>“That’d work for me.”</p><p>“Too bad, because it doesn’t work for me.”</p><p>She frowned. “You’re goin’ all puritan on me now that we’re married?”</p><p>“Hell no, but I don’t want fast and dirty the first time we make love as husband and wife, okay? I want to take my time with you. I want it slow.”</p><p>Keely stared at him for a few seconds, thrown by his PC reference to sex. “My God, GQ, sometimes you are such a girl.”</p><p>There. That oughta goad him into proving his masculinity. Right now.</p><p>Probably twice.</p><p>But he laughed—a bit meanly. “Nice try. But I will not fuck you until we’re alone, in a room with a huge bed, with the surf pounding in our ears and zero chance we’ll be interrupted by any of your two million family members.” He kissed her forehead. “And that, my sweet, sexy, horny wife, is a promise.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Promises are meant to be broken.”</p><p>“Not this one.”</p><p>A challenge? She loved a challenge. Keely would do everything in her power to make him eat his words—preferably while he was eating her.</p> <p>Smirking, she tucked the garter in the front pocket of his tux jacket. “If you change your mind, all you’ve gotta do is wave the white garter and surrender to me.”</p><p>“Not happening.”</p><p>She shrugged. “We’ll see. Now scram so I can get dressed and we can get out of here.”</p><p>Three hours later Jack was this goddamn close to saying fuck it, pulling off to the side of the road in nowhere Wyoming and fucking Keely until she couldn’t walk.</p><p>It figured his ornery cowgirl couldn’t just sit back and accept that he wanted to wait. No, she’d decided to turn it into a game of make Jack sweat. Within ten miles of driving away from the wedding reception, she’d offered to give him a handjob.</p> <p>He’d declined.</p><p>Then she’d offered to give him a blowjob.</p><p>He’d declined.</p><p>Then she’d asked if he minded if she took the edge off herself by masturbating.</p><p>He minded. A lot. He said as much.</p><p>But she’d just laughed, slipped her fingers beneath her sundress and proceeded to get herself off.</p> <p>Twice.</p><p>God. If he didn’t have any willpower now, how was he supposed to survive the next eleven hours?</p><p>“What are you thinking about?” she prompted.</p><p>As if the vixen didn’t know. “How absolutely exquisite you looked today. How lucky I am. How happy I am that you married me.” Jack lifted her hand and kissed her knuckles. “What are you thinking about?” She opened her mouth and he warned, “Besides sex.”</p><p>“I’ve actually been thinking about my dad’s wedding gift. It was a shock.” Her frown morphed into a sneaky smile that never boded well for him. “But then again, he did give us the section of land that’s closest to their house.”</p><p>Jack groaned. “I knew there had to be a catch.”</p><p>“It’ll be handy to have Grandpa and Gran-gran so close when we have kids.” She paused. “How many times did you get asked during the reception when we’re gonna start a family?”</p><p>“I lost track after seventy.”</p> <p>Keely laughed. “I rather liked seein’ you skirting the issue, Jack. But as long as we’ve got time to kill, maybe we ought talk about kidlets. Since it’s something we haven’t discussed.”</p><p>The last two months since they’d set the wedding date had been a whirlwind. Opening Keely’s clinic, setting up his office space in her building, meeting with his clients across the country to explain he was only changing his physical address, not the nature of his consulting business. He and Keely had been apart more than either of them liked, which was why they needed these two weeks alone.</p><p>“Okay.”</p><p>“I’m thinkin’ I’ll want seven kids.”</p><p>He nearly wrecked the car, his head whipped around so fast. “Seven? Are you fucking serious?”</p><p>“Yep. That’s only one more than Cam and Domini have, and they’re doin’ fine.”</p><p>“Their house and their lives are a goddamn zoo, Keely.” When she smirked, he realized he’d been had. “Very funny.”</p><p>“But I do think we could handle six.”</p><p>“No way.”</p><p>“Fine. How many do you want?” she demanded.</p><p>“Two.”</p><p>“Two? That’s it? I already feel bad for our two poor babies, practically raised alone.” She made the most pitiful-sounding sigh.</p><p>Jack rolled his eyes. “Last time I checked there were almost twenty-seven McKay and West cousins for Jack Junior and Little Keely to play with. That’s plenty.”</p><p>“Fine. Five kids.”</p><p>“Nope. But I’d agree to three.”</p><p>“Four.”</p><p>“We’ll see.” Four ankle biters sounded good to him, but he had to keep some negotiating power with his wife.</p><p>His wife who’d gotten very quiet all of a sudden.</p><p>“Keely? You okay?”</p><p>Her hand tightened around his. “Just thinking. As much as I wanna have a ton of kids with you, not right away, okay? I want you all to myself for a while first.”</p><p>Keely’s sweetness always surprised him, always moved him, always humbled him. “Deal.”</p><p>“But I definitely think we should get lots of baby-making practice in. Starting now.”</p><p>“You aren’t going to give this up, are you?”</p><p>“Not until you give in.”</p><p>“I will gladly give in to you as soon as we hit the villa. Until then—”</p><p>“Until then you’re giving me an excuse to relive my most memorable sexual encounters. Great idea.”</p><p>Keely’s eyes took on an unholy gleam before she looked away.</p><p>The car went silent. Except for her occasional sighs.</p><p>Sighs he recognized.</p><p>This was driving him fucking insane. Which sexual encounters was she reliving? She’d better not be thinking about any man other than him. Ever.</p><p>“You do make such a sexy sounding rumble when you’re jealous, Jack. It’s cute.”</p><p>“Cute?” His hands tightened on the steering wheel. “Fuck that. I’m not cute.”</p><p>“True. You’re definitely too hot to merely be cute.” Keely peeled his fingers free from the steering wheel and clasped his hand in hers, setting their joined hands on her lap. “And so you know, husband, I was thinking of you, because I completely forgot every man after the first time you touched me.”</p><p>“Such a silver-tongued cowgirl.” Jack relaxed because she knew just how to soothe him. “What memory were you reliving?” So much for his insistence they forgo discussions about sex.</p><p>“The one after our fake engagement party. When you just...” She sighed. “You rocked my world, GQ.”</p><p>It’d been a hard and fast encounter, as they’d both been drunk on the lust that’d shimmered between them for eleven years. Lust that’d finally hit the boiling point. He’d taken her on the floor of her apartment, which yeah, the I-need-you-right-fucking-now feeling was hot as hell, pinning her to the carpet and fucking her brains out. Although, he still held some regret that’s how their first time together had played out.</p><p>Is that why you’re so insistent on doing this differently?</p><p>“And then I got to thinking about how we christened my office at the clinic.”</p><p>An image of Keely, stripped naked and spread out on the top of her desk, flashed in his mind. That’d been a hot tryst, mostly because it was so unexpected. His cowgirl certainly liked to mix things up. He murmured, “And then we christened my office.” As soon as they’d caught their breath, she’d crooked her finger and led them to his office, where she’d draped herself over his drafting table and he’d nailed her from behind. Then they’d gone at it in the conference room.</p><p>Dammit. Now he was getting hard.</p><p>He glanced at her and realized while he’d been reliving the Jack and Keely sex show, she’d dropped their joined hands between her legs and was covertly rubbing his hand right where she wanted it. He stiffened his fingers and slid them free of her grasp. “Nice try.”</p><p>“But we were sharing, Jack. Connecting.”</p><p>“You are trying to connect my fingers with something, all right,” he said dryly.</p><p>Keely let loose the deep throaty laughter that made him think of slamming body parts and sweat-soaked sheets.</p><p>Damn her. He was still getting hard.</p><p>“But you know which one of our many, many, many, many times of getting down and dirty sticks out in my mind?”</p><p>Jack had gotten stuck on the many, many, many, many times portion of her question. “Ah. No, but I’m sure you’ll tell me. In detail. In explicit detail.”</p><p>“Last month. When you’d been gone for three weeks. I heard you running up the stairs to the apartment. You dropped everything you were carrying in front of the door and kissed me, such a deliciously long, slow kiss. Then you whispered, ‘I love you’ and took me to bed. And we stayed in bed the entire day. Twenty-four whole hours of mad, passionate love, wrapped together, napping, only to wake up and go at it again. It was amazing.”</p><p>“I agree. It was amazing.”</p><p>She fell silent, which surprised him. But he didn’t push it. Then she said, “Lemme see your left hand.”</p><p>“Why?”</p><p>“I just have this need to look at your wedding band, so I know this isn’t some kind of dream and we really are married.”</p><p>“Seems surreal, doesn’t it?” Jack held his hand across the console.</p><p>Keely turned the ring on his finger. “Will it take some time for you to get used to wearing it?”</p><p>“I’m already used to it. It’s never coming off.”</p><p>She smiled. “So you like it?”</p><p>That she’d managed to keep the design and style of his wedding band a secret from him was a miracle for her, his little hater of secrets. “It’s perfect. Why?”</p><p>“I thought it might bother you I didn’t try to match them.”</p><p>The wide band wasn’t too feminine or too plain. It wasn’t white gold like hers, but platinum. “Keely. I love it. It shows how different we are but how well we fit together.”</p><p>“Well, that’s a relief.”</p><p>Jack’s thumb swept across her new wedding band, comprised of diamonds and sapphires, nestled beneath her eleven-karat diamond engagement ring. “Do you like yours?”</p><p>“It’s really flashy, so of course I adore it.”</p><p>“The sapphires reminded me of your eyes.”</p><p>“Such a flatterer, but don’t stop. You could start talking about my other physical attributes. I could strip nekkid if you need a reminder of what my body looks like without such constricting clothing.”</p><p>Jack laughed. “Nice try.”</p><p>Comfortable silence fell between them for several miles. Then she yawned. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“If you’re tired, go ahead and sleep. I’ll wake you when we get to Denver.”</p><p>“Are we stopping at the condo before the airport?”</p><p>“No.”</p> <p>Keely sighed. “Damn. There goes my plan to carry you over the threshold and ravish you in your former bachelor pad.”</p><p>“There will be plenty of time for ravishment in Tahiti.” He kissed the back of her hand again. “Get some rest.”</p><p>“How am I supposed to change your mind about doing the nasty with me as soon as possible if I’m snoring?” She dropped his hand and turned in her seat to run her fingers through his hair. “So let’s talk about all the places I’m gonna try and seduce you before our toes hit the sand.”</p><p>Jack said, “Not a good idea,” even as his cock pressed against his zipper, arguing it was the greatest idea in the history of the world.</p><p>This was going to be a long drive.</p> <p>Six hours later Jack was this goddamn close to saying fuck it, pulling Keely into the bathroom in the first class section of the airplane and fucking her until she couldn’t walk.</p><p>Within ten minutes of passing through security at the Denver airport, she’d suggested they test out the private rooms in the VIP lounge.</p><p>He’d declined.</p><p>Then she’d suggested they hook up in one of the family-friendly bathrooms in preparation for joining the mile-high club on the flight to LA.</p><p>He’d declined.</p><p>It appeared she’d given up seducing him during the flight to LA, until they reached LAX and she’d started in again.</p> <p>Within ten minutes of reaching their gate, she’d begun whispering her fantasies, which seemed to include a lot of lube and different kinds of rope.</p><p>But by the time they’d settled in for the final flight to the island, Keely’s eyes were drooping. Her raunchy sexual suggestions had tapered off, focusing on soft pillows and cool sheets rather than vibrating marital aids and zero inhibitions.</p><p>As soon as they were airborne, she’d curled her body into his and had fallen fast asleep.</p><p>And in that moment, when it was just the two of them, snuggled together forty thousand feet in the air, Jack finally felt like they were married. That she belonged to him and he to her.</p><p>The vows and the ceremony and the exchange of rings and the reception had been great and all...yet, he’d never understood before that the wedding had been for their family and friends—public proof of their commitment to each other.</p><p>So in Jack’s mind, the honeymoon was the place to offer his private commitment to Keely. To look her in the eye, with no interruptions and no distractions, and let her know that he planned on loving her every day for the rest of his life.</p><p>That’s why he’d been so adamant about them waiting to make love—because they’d never get another first time as husband and wife and he wanted it to be meaningful. Special. Maybe even magical.</p><p>You’re such a girl, GQ.</p> <p>But now he was worried. Had he built up the union of bodies, spirits and lives to the point it’d be a big let down for them both?</p><p>Probably. He was prone to analyze stuff to death. Nothing he could do about it now—he’d begun to regret taking such a rigid stance. He’d make it up to her. Jack rested his chin on the top of Keely’s head, losing himself in the sweet lilac scent of her hair and drifted off.</p><p>They were both groggy when the plane finally landed.</p><p>The heat and the confusion about transportation made them both cranky. Rather than snipe at each other, they stayed quiet, lost in their own thoughts.</p><p>As soon as they reached the patio of the private villa, Jack pulled her into his arms and whispered,</p><p>“We’re here. You know what that means, don’t you?” He expected she’d laugh the sultry sound that always made him hard, and drag him inside with a cheeky, Let the rolling around nekkid begin. He didn’t expect her to disentangle from his arms and step back. Way back.</p><p>“That means we’re at the beach, Einstein.”</p><p>Jack squinted at her. Dammit. Sarcastic, lashing out Keely stood in front of him, which meant he’d somehow hurt her feelings.</p><p>Gee, ya think? You totally fucked yourself with your sexy wife, my friend, and not in a good way.</p><p>He had to figure out what to do, and fast. Charming his way back into her good graces, warred with his male instinct to just fuck his way back into her good graces. Maybe a combination of both would work?</p><p>He grinned, stepped forward and took her hand, kissing the knuckle above her wedding ring. “I know it’s been a long day. But if you can give me ten minutes—”</p><p>Once again she retreated. “Take as long as you want. In fact, take all night. There’s no hurry, right?</p><p>We’ve got two weeks.”</p><p>“But I thought...”</p><p>“What? That I would just strip right here, right now, and wait for you to take me by the hand so you could make sweet, sweet love to me on a bed of fucking rose petals? Wrong, bucko. I wouldn’t have sex with you right now if you begged me.”</p><p>His mouth dropped open. “What the hell?”</p><p>“In fact, I feel a headache coming on. A bad one.”</p><p>“Keely—”</p><p>“Or maybe I have to wash my hair.” She started humming “Wash That Man Right Outta My Hair”</p><p>from South Pacific.</p><p>Sometimes she was such a pain in the ass. “I swear to God if this—”</p><p>“Or maybe I’m just too damn tired. It’ll probably take me a couple of days to catch up on my sleep, bein’s I’m jetlagged and all. Days, husband, in which you can do anything you want...with the exception of one thing.”</p><p>Oh no, she wouldn’t.</p><p>Oh yes, she would. With absolute glee.</p><p>She smirked. “I hear the fishing is good this time of year.”</p><p>Do not yell at her on your wedding day.</p><p>Jack was trying to keep his cool, when he remembered something. He casually reached into his pants pocket, pulled out the white garter and waved it at her.</p><p>Keely looked at it, then at him, and laughed. Laughed. She said, “Nice try,” and sauntered off toward the beach.</p><p>There was some serious groveling in his immediate future. Now he really had to set the stage, and prove to her...what?</p><p>Hell if he knew. But he’d gone this far; he couldn’t back down or chicken out now.</p><p>Jack dragged the two hundred suitcases into the main living area. He barely gave the space a second glance as he booked it to the massive master bedroom to make sure his specific requests had been filled.</p><p>Bouquets of fragrant flowers.</p><p>Check.</p><p>Dozens of candles.</p><p>Check.</p><p>Four bottles of champagne.</p><p>Check.</p><p>Chocolate and raspberry sauce.</p><p>Check.</p><p>Silken scarves.</p><p>Check.</p><p>Batteries.</p><p>Check.</p><p>He stared at the set-up until frustration set in. He was a goddamn engineer, for fuck’s sake. He sucked at this stuff. But this was the exact romantic scenario he’d envisioned and it’d been perfectly executed. So why did it look...wrong?</p><p>Because Keely isn’t here. Why in the hell did you think she would want this anyway?</p><p>When had he stopped taking into account what she wanted?</p><p>Jesus. He was a fucking moron.</p><p>He swallowed his pride and tracked her down. And for a minute, he just stopped and stared at the woman he’d married.</p><p>What a magnificent picture she was, standing barefoot at the edge of the ocean, wind blowing through her glossy dark hair as the last rays of sunlight danced across her skin, bathing her in a golden glow.</p><p>Luckily she didn’t jerk away when he touched her. She murmured, “Beautiful, isn’t it?”</p><p>“Stunning. And the scenery ain’t bad either.”</p><p>She leaned into his chest and sighed.</p><p>They remained locked together, waves lapping at their bare feet, gazing across the horizon until the sun disappeared and darkness surrounded them.</p><p>Finally she turned and gazed at him with those sapphire eyes that seemed to have a direct conduit to his soul.</p><p>All Jack’s thoughts, fears, plans, and words of devotion vanished. So he said the first thing that popped into his head. “Keely. I love you.”</p><p>“I know you do.”</p><p>He supposed he deserved that. “I don’t want to fuck this up.”</p><p>“I know that too.”</p><p>“Maybe you think it’s lame that I wanted to wait to make love to you in such a...traditional way, when we’ve already had sex in every conceivable position and in some pretty inconceivable locations. I thought I’d try to be...”</p><p>“What? High-handed? Showing me who’s boss in our marriage from the get-go?”</p><p>“No. I wanted to give you romance.” He tucked a piece of hair behind her ear. “You deserve that on your wedding night.”</p><p>She drilled him in the chest with her finger. “No, Jack-ass, I deserve a say in what happens on our wedding night. You don’t get to make a decision and just expect me to fall in line with it.”</p><p>“I agree. I’m sorry.”</p><p>His capitulation seemed to surprise her and her smartass comment, “You were fully aware I’m not a shrinking violet—” ended abruptly. She said, “Oh. Well. Okay.”</p><p>“So am I forgiven for being a jackass?”</p><p>“Maybe. But you have to make it up to me.”</p><p>“Anything you want. Name it.”</p><p>“Happily for you, GQ, I’m all in for making love to my husband, in a big, soft bed, with the sounds of the surf pounding in the background and no interruptions.” She poked him in the chest again. “You dodged a bullet this time. Next time I won’t be so accommodating.”</p><p>“So noted.”</p><p>Keely stared at him thoughtfully again.</p><p>“What?”</p><p>“Did you really think I’d love you more if you gave me silk sheets, flowers and candlelight?”</p><p>He honestly didn’t know what to say.</p><p>“Jack. You already gave me your heart. That’s all I ever wanted. That’s all I need.”</p><p>Might make him a pussy, but he felt tears spring to his eyes. He could barely choke out, “I can’t live without you.” </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>“Lucky thing you don’t have to.”</p><p>“Promise?”</p><p>“I promise.” Keely stood on her tiptoes and kissed him. “Now will you please take me to bed? I’ve heard married sex is pretty hot.”</p><p>Laughing, Jack swept her into his arms and started toward the villa. But he didn’t make it far before he stopped and set her back on her feet.</p><p>“Oh, for Christsake, Jack, what now?”</p><p>He put his mouth on her ear, loving how it always caused her to tremble. Loving her whimpering sigh.</p><p>“Ever rolled around naked on a beach?”</p><p>“Ah. No. Have you?”</p><p>“No.”</p><p>“That’d be a first for both of us.”</p><p>“That would be pretty goddamned romantic.”</p><p>They looked at each other. Grinned at each other.</p><p>Keely said, “First one undressed—”</p><p>“Gets to be on top,” Jack finished as she started stripping.</p><p>“And also gets to decide if it’s hard and fast or slow and sweet,” she added.</p><p>“Deal.”</p><p>Keely won. She had less clothing on than he did. But truthfully, the first rays of moonlight reflecting off all her mouthwatering curves distracted him.</p><p>That, and the fact she still wore that sexy white wedding lingerie beneath her sundress.</p><p>Damn.</p><p>She tackled him. Pinned him. Kissed him. Owned him completely. And when they were joined in body, as well as in their hearts, Jack knew this woman would give him the ride of his life. </p> </body></html>"]