["<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>\"I wasn't really sleeping well either,\" Cole says sympathetically. He has no idea what he's doing to me. I'm breathless, embarrassed by things he can't possibly know, but it still makes my cheeks burn.</p><p>My emotions are jumbled. I look up at him. He's too old. I'm too young. He's from money. I hate money. I glance at Cole again. Damn. I still want him. That stirring, whatever put the idea into my head didn't leave when I woke up, and having him that close is like setting a magnet on a compass. My emotions are spinning like a top.</p><p>It's after 2:00am, but I feel wound tight. Pushing off, the couch I tell him, \"I'm getting a drink. You want one?\"</p><p>Smiling, he teases, \"Sure, but are you legal?\"</p> <p>My cotton shorts cling to my hips as I walk away. I laugh over my shoulder, \"Legal to do things you couldn't imagine, old man.\" I have no idea why I said that, but it makes me feel better. Cole remains in the den, but by the time I come back with drinks, he's sitting on my bed, also known as the couch.</p><p>He was sleeping on the floor next to me. The den doors were closed and my parents left us alone to make babies all night.</p><p>I hand him a glass with whiskey at the bottom and a can of Coke. I have a glass of wine. When he takes his glass, I clink them together, \"Cheers.\"</p><p>He nods, pours the Coke into his glass, and puts his feet up on the table and looks at me, \"What are we drinking to?\"</p><p>I say the first thing that flies into my head, \"To your appreciation for women, but not women's clothes. Unless you count Le Femme's panties. You don't wear those, do you?\" I laugh and sip my wine.</p> <p>\"Only on my head. That one with the apple makes a really cool mask,\" he laughs and I spew a sip of wine, trying to stifle a laugh. \"That's second grade underpants humor, Lamore. Seriously, underpants jokes make you laugh?\"</p><p>I'm covering my mouth so I don't spew again and try to swallow the wine left in my mouth. Nearly choking, I laugh, \"Combined with the image of you dressed as a super hero, sporting tights, with a panty-mask on your face, yes.\"</p><p>Cole grins at me.</p><p>I rest my head against the back of the couch. Cole's sits next to me, his bare chest is distracting. He's wearing his jeans, and is barefoot. I watch his chest rise and fall out of the corner of my eye. Damn dream. I shrug like he doesn't affect me. I don't want him to.</p><p>Changing topics I say, \"I'd like to see your paintings, the ones you told me about the other day.\"</p><p>\"Oh,\" and then he's quite. His eyes look into his glass like it has answers that he doesn't.</p> <p>\"I take it that you don't show that stuff to people too often?\"</p><p>He shakes his head, \"No, not really.\" He's silent for a moment, then says, \"If you really want to see them, I'll show you. I owe it to you for tonight.\"</p><p>\"Psh,\" I say swatting him in the shoulder, \"You owe me nothing. It's not like I would have left you sitting there.\" I stare at the ceiling, not thinking. Well, not wanting to.</p><p>\"You're a rare breed, Lamore.\" He finishes his drink, sets it down, and threads his fingers behind his head.</p><p>\"You have no idea,\" I glance at my wine glass and set it down. I rub my eyes with my hands.</p><p>He watches me before saying, \"You say that like it's a bad thing.\"</p><p>\"That's because most of the time it is.\" I look at him.</p><p>Cole's sitting next to me, stretched out, completely at ease. At least he appears that way. Everything about him says he's comfortable in his own skin, that he likes who he is and what he's become. He glances at me out of the corner of his eye, \"How? How is that bad?\"</p> <p>\"It just is. I'm a moron magnet. Being me attracts every loser in a twenty mile radius. The guy seems nice at first, but each and every one of them is totally messed up. Or maybe it's me. Maybe I'm the one who's messed up.\" These were thoughts that had been banging around in my brain. Without Emma to talk to, they stayed there. Cole rattled me and has made me feel ten times more alive in the past day than anyone else ever has.</p><p>Cole laughs initially, but when he realizes I was serious, he says, \"Anna, you can't be serious. It's not you.\"</p><p>I pull a pillow across my chest, \"How would you know? You just met me. And it's not like you know me that way. You can't be sure it's not me.\" My voice softens as I speak.</p><p>\"It's not you,\" he repeats. Tension lines his shoulders. It wasn't there a moment ago, but it seems hard to miss now.</p><p>\"Sorry,\" I say. \"I'm making you uncomfortable. I didn't mean to - \"</p><p>When he turns to face me, my breath catches in my throat. His eyes are so soft, so sincere, that I can't look away. He takes the pillow that I crushed against my chest and I feel exposed.</p><p>He says certainly, \"You're not making me feel uncomfortable.\" He places the pillow on the floor. When he turns back to me, he asks, \"Do you know how I can tell that it's not you?\" I shake my head. My heart races faster. His eyes search my face like he can't believe that I don't see that I'm not the reason morons flock to my side. \"You're naturally inquisitive. You question everything, to the point of exasperation,\" he smiles at me like it's an endearing trait. \"Anna, people who question things usually know themselves pretty well. They want to know why things work and they try to fix them when they don't. If he was doing that - if he was trying to take care of you - you wouldn't be asking me this right now, you'd be asking him.\"</p><p>Blinking hard, I look away. I pull my knees into my chest, and wrap my hands around my ankles. \"He's tried to do what I want.\" I realize where this conversation is going. I'm not sure if I want to talk about it with him. I barely know Cole, but after today, things have changed. The fact that he blindly trusts me wasn't missed. And it's so easy to talk to him.</p><p>\"And?\" Cole prompts.</p><p>\"And he offered to do what I want, but it's not the same. It's like the difference between really wanting a cookie and just thinking it's so-so.\" I'm staring at my feet. When he doesn't' answer, I look up at him. He's smiling at me with a strange expression on his face. \"What?\"</p><p>\"Cookies? Really? We're using a cookie metaphor in sex conversation?\" he smiles at me, and nudges my shoulder with his. \"Come on. Talk to me. You know my darkest secret. You can tell me yours.\"</p><p>I smile softly, \"How'd you know it was about sex?\" I cringe as I say it, my cheeks growing hotter.</p><p>\"Why else would you be beat-red right now? And I'm onto your diversions. Cookies, Skittles - do you always chose food when you're trying to skip over something important?\" I smile shyly at him, but don't respond. I can't say it. I want to, the question is sitting on my tongue, but I can't. \"Come on Lamore,\" he urges, bumping my shoulder again</p><p>\"Fine,\" I say nervously. \"I'll just ask, but don't laugh at me. This is a girl question, and you're not a girl.\"</p><p>\"Obviously,\" he grins.</p><p>I bump his shoulder back and then say, \"Do you think a relationship has a chance if one partner is too bland for the other?\"</p><p>\"Bland?\" he asks like he doesn't know what I mean.</p><p>I nod, \"Yeah, like he likes things kinky and I like things vanilla.\" I have no idea why I switched our roles. Edward was vanilla, and I wanted to be the kink goddess. I didn't realize I was wringing my fingers until Cole patted my hand.</p><p>\"Stop,\" he releases my fingers when I look up at him. \"It doesn't mean it can't work out, but there will also be a rift there for him. You won't feel it, but he's not going to feel satisfied as frequently. That's an issue in any relationship. And it's not something that's your fault. It's just the way it is.\"</p><p>\"You don't think he'd change? That he could be more... vanilla?\" There is desperation in my voice, like I know the answer before he even says it. Somewhere in the back of my mind, I already know that things are destined to fail with Edward. I just don't want to write off a good man for something that seems so selfish, especially if he is satisfied. At the same time, dealing with bland sex for a lifetime is something that doesn't hold much appeal.</p><p>Cole looks aside, and shakes his head. \"Sorry, but no. People like that tend to be passionate and they want to show it. It surfaces in other areas of their lives, too. A person who speaks, acts, and breathes passionately isn't going to become a subdued lover. It's not who they are... \"</p><p>Staring at his eyes, I speak without thinking, \"A person like you.\"</p><p>Cole is passionate. He knows what I'm talking about. While he was telling me what he thought, I realize that he's talking about himself. My face flushes when I realize what I've said. His eyes fixate on my lips until I look away.</p><p>He grins at me, \"A person exactly like me. Listen, Anna - \" he reaches for my hand. When he brushes his fingers against it, I look up at him. He doesn't touch me for long. It's little things here and there. I look up at him, and he says, \"I think I'm just telling you what you already know.\"</p><p>His voice is soft, his eyes don't quite meet mine. Cole rubs his thumb against the back of my hand. I can't stop staring at it. My heart is pounding. I can't control how he makes me feel.</p><p>\"Don't change for anyone. In the end, it's not worth it,\" he says and then grins again. \"Besides, depriving the world of Anna Lamore would be a sin. I'd have to seriously punch this dude in the face.\"</p><p>His words are so unexpected that I snort-laugh. It is one big honk. My hands fly to my mouth to hide it, but my face turns beet red anyway. Cole laughs, his eyes bright blue and shining. The warmth in his voice fills me up inside. The rich tones flow so easily, so confidently. I want what he has. I want to feel comfortable in my own skin.</p><p>When our eyes lock, I wonder what he's thinking, what he sees when he looks at me. Previously, he's said I was a child, but his gaze now says otherwise. The intensity of his eyes makes me hot. A current runs through the center of my body. I can't look away. Cole leans closer until I feel his breath wash across my lips. Every inch of me is vibrating. I want him to touch me, to feel his palm against my face and taste his beautiful lips.</p><p>My gaze drifts to his mouth. He blinks slowly, once, and I know he's going to pull away. Before he has the chance, I pretend that nothing happened, that I don't feel the attraction. I lean into his chest before he can say anything and rest my head against his shoulder.</p><p>Surprise fills me when Cole's arms wrap around me, pulling me tight. We stay like that for a long time, each of us too afraid to move. This is the first time I know how much of an effect Cole Stevens has on me. It shakes me to my core. The dream blindsided me, and there's no stopping it.</p><p>My body has reacted to him from day one, but I refused to acknowledge it.</p><p>After a few moments, we pull apart. Cole lowers himself to the floor and I close my eyes and lean back on my pillow. I twist the blankets between my fingers. My heart thumps in my chest like I'm startled. I am startled. I like him. I have a thing for Cole. Every muscle inside me cords tightly, my while fingers tug at the afghan in near panic. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The next morning, I wake up ready to pretend nothing happened, not that anything really did happen. It just feels like it did. Cole isn't next to me on the floor when I sit up. His blankets are folded on a chair. He let me sleep and is enduring my parents alone. Quickly, I pull on my jeans and tank top, and run a brush through my hair. As I approach the stairs, I hear my mother's voice. She's laughing, along with my dad and Cole.</p><p>When I get to the top of the stairs, I hesitate. Cole is sitting with my parents and it appears that they are having a somewhat normal conversation. I stand still, listening.</p><p>Ma says to Cole, \"So what about this one? Was this airbrushed?\" She pushes the paper toward him. Cole reaches out and slides it closer while sipping his coffee.</p><p>He nods, \"Yes, the models in the ads are Photoshopped - that's like airbrushing, but it's more than that. All of these are manipulated to some extent. Real thighs don't look like that.\"</p> <p>Ma tugs the paper away and looks at it closer, \"How do you know? I can't see it. And this girl is so skinny. Her thighs could really look like that.\"</p><p>Cole shakes his head and pulls the paper back. \"It's my job. We do this all day long. So does Anna, and she's very good at it. But, sometimes on the cheaper product lines you can see artifacts, like - \" he's turning pages. After flipping three times, he stops and smooths the newsprint, \"here. See this?\"</p><p>Ma tugs the paper back, and her jaw drops. She thrusts the pages at Dad, who is smiling like he already knows all this stuff. \"Frankie, did you see this? Did you know they could do that?\"</p><p>\"Yeah. They've been doing that for years. I told you real women don't look like that. You're beautiful and always have been. Those twigs got nothing on you, baby,\" he takes her hand while he's talking. He's always adored her. They gaze at each other.</p><p>Cole smiles and looks up, seeing me in the doorway. He stands and crosses the room, \"Good morning, lover. Can I get you some breakfast?\" He kisses me on the cheek and I nearly fall over. A voice inside my head giggles hysterically and instructs me to never wash my face again. I stare at Cole as he takes a plate and fills it with pancakes and sausages. He hands it to me and grabs me a cup of coffee. \"Come on. Sit. Eat. We have time.\"</p> <p>I make my way to the table. We sit together and eat. The conversation doesn't drift to loins or babies. A smile spreads across my face and I can't hide it.</p><p>It's Saturday. By the time I get back to the apartment, Emma is gone. I get in the shower, and crank up the hot water. I stand there letting it wash over me until my skin is numb. There are so many things that I want to do, but I don't know where to start. Cole left my parent's house right after breakfast. His driver picked him up in a shiny black car. He offered to take me home, but I didn't want to leave my bike behind. I thanked him and told him I'd be in later.</p><p>This week has been so strange. If someone told me that the man who shattered my dreams last weekend would be spending the night with me and starring in my naughty fantasies, I wouldn't have believed them.</p><p>Before I leave for work, I call Edward and tell him that I want to meet up with him later. Breaking up is going to suck, but it's inevitable. There's no future for us. This is more humane, even if he does love me. I just hope that he'll understand. I can't change for him, and he shouldn't have to change for me. Somewhere out there, there's a girl that's perfect for him, and I know that it's not me.</p><p>I tug on a pair of shorts and a cami. I'm not really dressed for work, but there are no clients today and it's insanely hot. I leave my motorcycle in the garage across the street and make my way to Le Femme via the subway, then trek the last stretch on foot. By the time I arrive, my cute outfit is soaked in sweat and my hair is deflated. I look horrible. After I push through the door, I walk to the mirror, trying to salvage my appearance, at least a little bit. Snatching a tissue, I blot the sweat off my face. Most of my make-up floated away a few blocks back. Sun-freckles and rosy cheeks peek back at me. The sheen on my face refuses to be tamed. I stand there for a second and look at the tissue, wondering if I should even bother.</p><p>\"Hey,\" Cole walks up behind me. His voice sounds soft at first, almost timid. \"You're here. And... um, wow... You look...\"</p> <p>I huff, \"Like a mess. Tell me there are no clients today. Please. I can't fix this.\" I gesture to my face which is glowing again in an I-just-worked-out kind of way.</p><p>Cole leans back on Miss Todd's empty desk. The muscles in his arms bulge. His shirt clings to his body and I realize that I haven't seen him dressed like this before. He looks like he's headed for the beach, wearing shorts and a tee shirt. The office is a warmer than usual. There's a sheen of sweat on his skin. He grins, \"There are no clients. We're editing all day. And you look great, so don't worry about it.\"</p><p>I laugh, \"Yeah. Nice try, but I saw the way I rendered you silent a few seconds ago.\" The way he looks at me makes my stomach flip. It's like seeing me in a disheveled mess makes him like me more. I stop fussing in front of the mirror and toss the tissue.</p><p>He slides off the desks and walks toward me, \"The air conditioner is having issues. We'll be lucky if it doesn't totally die. The repair guys will be here later to work on it. Come on. Let's get to editing.\" He tilts his head and turns. Cole shoves his hands in his pockets and I follow him back to the studio.</p><p>A few hours later, sweat is pouring off of me. The air conditioner totally died and the repair guy hasn't shown up. Cole calls them and is assured that we are next on the list, so we sit and wait. I stop editing and lay down on the cool concrete floor. Sweat was dripping into my computer keyboard; it's so insanely hot up here. The cement feels nice on the back of my neck and legs. I sigh and fold my hands behind my head.</p><p>When Cole notices, he walks over and stands above me, his hands on his hips, \"Get up, Lamore. There's more work to be done, and we'll be here until tomorrow at this rate.\" He holds out a hand to me.</p><p>I don't take it. \"It's got to be 20 degrees cooler down here. We should move the computer to the floor. This is way better.\" When I don't take his hand, Cole cocks his head and places his hands on his hips. I laugh. He looks ridiculous, \"What? Are you gonna yell at me? It's like a hundred degrees in here. Besides, you'd be sitting on the floor if you could get up again. Ya know, without using that button around your neck.\" I change my voice to mimic the old lady on the TV, \"Help! I've fallen and I can't get up!\" My laughter obscures my words by the time I finish teasing him.</p><p>Cole moves fast. He falls to his knees and lands by my side before starting a tickle fight that brings tears to my eyes. His fingers move over my slick skin. I'm laughing so hard that I can't breathe.</p> <p>\"If I could get up again,\" he mutters with a smile on his face. \"I'm not that much older than you, Lamore. In fact, you're going to be the one who begs for help getting up.\" He tickles me more. My legs kick as I try to roll out of reach. I manage to flop onto my stomach, but he grabs my ankle and pulls me back. I squeal as my cami hikes up. Frantically, my hands shift from the tickle fight, trying to keep my shirt from revealing too much skin.</p><p>Cole is laughing, \"Surrender, Lamore. Beg me for help.\" He bats his eyes and says in a girlie voice, \"I've fallen and I can't get up.\" His fingers wiggle against the bare skin at my waist, as I laugh hysterically.</p><p>Kicking at him, my foot connects with the side of his face by accident. The impact is audible. I didn't mean to do that. Startled, we both pause for a moment. His jaw drops, so does mine. No one laughs. No one breathes until he grins, saying, \"You're gonna pay for that.\"</p><p>Before he grabs for me, I try to crab crawl away, but Cole yanks my leg and I fall on my back. Suddenly he's over me, his hands trying to still my wrists. We roll around on the floor for a minute, both of us much hotter than a few minutes ago. Sweat trickles down my face. The little beads roll down my neck and into my cleavage. Cole's eyes trace the movement. I try to knock him off his knees, but when he goes down, he pins my body to the floor, clutching my wrists.</p><p>We're both breathing hard when he yanks my hands and slams them down over my head, stretching me. As he does it, our gazes lock, and now my shirt has crawled up, revealing more than I'd normally show. I feel the bare skin on my stomach against his shirt. It makes me feel like I'm falling. I don't want it to stop. There's no laughter, just ragged breathing as we stare at each other. He remains on top of me and I can't move.</p><p>I feel lost. My head is swimming, stuck in the haze that comes with being high from laughter. The way he looks at me sends a shiver through my body. He feels it move through me, but he doesn't release me. I don't want him to. I want to know what this passionate man will do, how he treats his lovers. I can't ignore the dream I had last night at my parents' house.</p><p>I close my eyes slowly, and look back into his beautiful face, \"Do I really have to beg, Cole?\" My voice is too deep, too sensual. I meant to be playful, but can't manage it. My voice betrays me and my innocent question sounds anything but innocent. Heat rushes to my cheeks, and it feels like every bit of my dream is painted across my face. I don't breathe as I watch him, waiting for him to react, but he doesn't.</p><p>Cole's expression doesn't change - his intense gaze darkens, his lips part. There is no smile on his face. Not anymore. Something changed, a moment of flirtation that crossed a line. We both know it. Cole's grip on my wrists tightens; his eyes are still locked on mine. His taller frame allows him to pull me slightly, stretching my body. My breasts push into his chest harder. I gasp, wishing, wanting something that I can't quiet comprehend. Every inch of my skin feels cold and hot at the same time. Cole's lips are just above mine. I want him to pull us together, and nip me, taste my kiss, and then do it all again.</p><p>Cole's body is tense, every muscle perfectly formed. His ribs expand as he tries to steady his breath. I can feel his heart pounding when he tugs me. The movement makes him lay flat against my chest. His eyes are so dark.</p><p>He whispers, \"Hell, yes. Beg for it, Anna. Beg me...\" His lips are so close to mine, but he won't kiss me. I wriggle beneath him, trying to close the distance, but he won't let me.</p><p>Before either of us can say another word the chime from the front door sounds. We split apart. Cole springs to his feet, rubbing his hands through his hair. His back is to me as he leaves the room to let the repair guy in. I can't read the expression on his face, but the way he moves, the way his broad shoulders slant as he walks away - it looks like regret.</p><p>My stomach falls. I wonder if he regrets not kissing me, or regrets being in that position with me at all. I'll never ask him. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When Cole returns, I'm working at my desk. I glance at him out of the corner of my eye. He doesn't notice. When he sits down he acts the way he did before our roll on the floor. My stomach is twisting in knots. Looking at him makes me want to touch him, his beautiful face, his silky hair, so I turn back to my computer. The screen glows in front of me. I edit pictures until I can't see anymore. The world has turned blurry, and my eyes sting. Cole tells me to leave several times, but I won't. The work isn't done yet, and in truth, I don't want to leave him. I want to see if there's more there. If he'll take me in his arms when the last photo is edited, and the computers are shut off. But, he doesn't.</p><p>We speak to each other like good friends and nothing more. I've become accustomed to his voice, the intensity of his gaze. Passion burns within him in a way that I couldn't have imagined. When we finally get through with work, we ride the elevator down to the lobby together. It's past midnight. I cancelled my break-up dinner with Edward to finish working. That was the only good that came out of staying late.</p><p>Cole is leaning against the metal rail in the elevator. His eyes are on the side of my face. I have my head tipped back against the wall, tilted up, eyes closed. Every muscle in my body aches. Between the heat and the number of hours I've been awake, I can barely stand. The thought of walking and then taking multiple trains home clouds my thoughts.</p><p>Finally he breaks the silence, \"You shouldn't go home tonight.\" His words sink into me. I wonder if I'm hallucinating when I open my eyes and look at him. He's staring straight at me, acting like he just said something completely reasonable.</p> <p>I know what he means, but I smile and say faintly, \"Yeah Cole? Where should I go?\" I shift my weight to the other foot. I can't look at him. I don't want any of the hope that's filling my chest. It's telling me that he wants me, that he likes me, that he'll act on it. I beat it down, and stuff it into a closet at the back of my mind.</p><p>He leans an arm above me. Tilting my face up to see his, he says, \"Come home with me. I can tell you're exhausted - \"</p><p>I stare at him. My heart is pounding. I can't tell what he's thinking, what he's offering. I play it safe. Shaking my head, I say, \"It's okay. The subway isn't too far and I'll be home in less than an hour - \"</p><p>His hand cups my cheek, \"My place is less than ten minutes from here. Think about it. In fifteen minutes you could be in a hot shower, in thirty you could be relaxing with your feet up.\" He reaches for a strand of hair and tucks it behind my ear. \"Come on, Lamore. I can't turn you loose on the streets. What if someone molests you?\"</p><p>Lamore. He put that distance there, like we're buds - but he's tucking hair behind my ear and standing too close for that. I don't understand what he's doing. It's like he wants me, but hasn't committed to the idea yet.</p> <p>My voice is light, \"Oh, and you won't?\" I laugh, but it sounds hollow. I tell myself it's because I'm tired. It has nothing to do with making bad decisions based on libido in an elevator.</p><p>He leans closer, his lips nearly brushing mine. When he speaks, his warm breath slips across my mouth, \"Not unless you want me to - \"</p><p>Our eyes lock. It's the first time either of us has said anything, made any indication that... that what, Anna? My inner nun is beating me over the head with a ruler. He's too old. He's too wild. He's nothing I want, nothing I need. Cole Stevens is chocolate-covered sin and I need someone steady, like fiber. My mind flashes to Edward, to vanilla, good old reliable Edward.</p><p>I smile softly at him and lean my head back against the wall. \"I can't,\" I hear myself say. \"I have to get home and pack. We're supposed to leave for Long Island tomorrow and I haven't packed a thing. And there's something else I have to do. It's important.\" I'm biting my lower lip. His eyes fixate on the movement.</p><p>Cole nods, saying, \"I see.\" Stepping back, he slides his hands into his pockets.</p><p>I realize that it sounds like I'm blowing him off. I reach out and touch his shoulder. He looks down at me more cautiously than before, \"Cole, I really have to do something. I need to break up with my boyfriend. I can't leave for three months and lead him on. I was supposed to do it tonight.\" I'm staring into his eyes, thinking but I want to stay with you and here you are offering and I'm saying no. What the hell is wrong with me?</p> <p>\"I was just offering you a bed for the night,\" he says, like he meant nothing - like I mean nothing. The elevator chimes that we are on the ground floor. The doors slide open and save Cole from getting slapped. I want to scream at him. I want him to stop playing and tell me what he thinks, but he strides away. When we exit the building I grab his arm. He stops and looks at me.</p><p>\"Tell me what you want.\" There. I said it. Point blank. My heart is slamming into my ribs and I feel like I can't breathe.</p><p>He nods, smiling, and continues to walk toward a black car parked at the curb. I follow. Emotions are flowing through me in a maddening rush. I don't know exactly what I want from him or what I expect him to say, and when he responds I can hear the darkness in his voice warning me away, \"Miss Vanilla, you shouldn't say things like that to me. You won't like where they lead you.\"</p><p>By the time he pulls the car door open, he's back to being carefree happy Cole. He looks apathetic, like he doesn't care about me one way or another, but his eyes tell another story. His eyes are nearly twenty years older than mine, and have seen things mine will never see. It's like the speck of soul that shines through has been snuffed out and replaced with a Cole that knows the world and knows there's no future for us. My stomach falls into my shoes. I don't like that world.</p><p>Before he slides into the car, he looks at me and says, \"Last chance.\" The way he looks at me makes it clear that this is an invitation to his bed, not his home.</p><p>Something about the way he says it sounds like a one-night-stand. While Cole might be insanely hot, I'm not that kind of girl. I shake my head. My voice is soft, \"I don't do one-nighters. Sorry.\" Before he can say anything else, I turn on my heel and walk away. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The sun spills into the room. I cover my face with a pillow. I want to go back to sleep, but I can't stop thinking about Cole. Miss Vanilla. Ha! If he only knew. I breathe deeply and finally decide to get up. It's a little after six in the morning. I hear Emma in the kitchen. When I emerge I see her dressed in work clothes, sipping a cup of coffee.</p><p>\"Hey,\" I say rather groggily.</p><p>\"Well, look who's home. Edward was looking for you.\"</p><p>I nod, \"Yeah, I had to work late last night.\" She glances at me over the rim of her cup. \"I told him to come by in a couple of hours.\"</p> <p>\"So, the new boss is a pain in the ass?\"</p><p>I shrug, \"Maybe a little.\" I take a cup and fill it with coffee. I feel her eyes on my back while I do it and I start to wonder what she's thinking. \"Why do you ask?\"</p><p>\"Oh, I don't know.\" She tears a piece of toast in half and offers me a piece of her breakfast. I take it. \"He has you working odd hours, is dragging you out to the Island again, and I'm not going to see you for the rest of the summer. He's a pain in the ass, Anna.\" She's laughing, as she turns and puts her empty mug in the sink. Glancing in the mirror, she checks her make-up and heads for the door. She shouts, \"Check in once in a while so I know you're safe. Your boss gives me the creeps.\"</p><p>\"Sure,\" I reply and the door slams shut. I'm staring at her toast. Something bothers me, something she said, but I don't know what.</p><p>Ignoring the sensation, I jump in the shower. I take my time getting dressed and then pack. When I pull open my negligee drawer, I wonder if I should take anything. What Cole suggested last night killed me. A one-night stand. I slam the drawer shut. There is no way I'm sleeping with him. Whatever I thought happened, didn't. It is that simple. He sees me as a tryst and nothing more.</p> <p>The doorbell rings, and breaks my thoughts. I walk toward the door telling myself that this is necessary, but when I yank open the door, Edward is standing there with a huge bouquet of yellow roses. My mouth opens into a little O and I can't talk. I feel like scum. He hands me the flowers. I smile at him sadly, but he mistakes my emotion as something good.</p><p>\"Hey, baby,\" he kisses my cheek and pushes past me into the apartment. \"I remember you saying you love yellow roses, and well, I thought since you were going away for a while, that you could take them with you to remember me by.\"</p><p>Gazing at the flowers, I say, \"Edward... these are lovely. Thank you, but - \"</p><p>He turns and looks back at me. Taking the flowers from my hands, he places them on top of my suitcase in the hallway, before reaching for me. He slides his arms around my waist and pulls me to him. I feel like I'm hugging an eel. I can't muster the strength to pretend anymore. This relationship has run its course and I want out.</p><p>He smiles huge, and turns, saying, \"Emma has a vase here. She said you could take it with you...\"</p><p>\"Edward, stop.\" But he doesn't. He's smiling like he's happy, totally ignoring that my mood doesn't match his. I push away from him, but he's walking away from me to get the vase. I follow him into the kitchen. \"Please stop. I need to tell you something,\" my voice is too loud, too curt.</p> <p>He straightens and turns to look at me. His eyes sweep over me and he shakes his head like he's missed something, \"Oh, I'm sorry babe. I didn't see it before. You're all shaken up because you're going to miss me.\" Reaching for me, he takes my hands in his and says, \"I love you, babe. It won't be that long. We can - \"</p><p>I cut him off, \"This isn't working out.\" I blurt it out while tugging my hands away. The way he came through the door and continues to speak makes it very hard for me to say anything. I realize that he keeps doing this to me - when I try to talk, he talks over me. It's like he's trying to control the relationship and keep it from ending. But after I've yelled at him, I think I'm wrong. Edward looks like I've hit him with a frying pan.</p><p>I sound apologetic, \"I really like you, but I just think we're a mismatch. We're too alike in some ways, and not enough in others. In the long run, we'll both be sorry for it. I can't do that to you. I think we need to take some time to - \"</p><p>\"See other people. Sure, why not?\" He shrugs, sounding angry. His fingers ball into fists and he turns like he wants to punch the wall, but he doesn't. Instead he takes a deep breath and tries to shake off the rage building inside of him. I've never seen him so angry. I never thought he had it in him.</p><p>Holding his head high, he turns back to me, \"Just tell me why.\"</p><p>\"I did,\" I say. I feel nervous now and I don't know why. Something about him makes me step away, \"We won't make each other happy. You're vanilla, Edward, and I'm sticky. You said so yourself - \"</p><p>He steps toward me, hands out, \"Baby, I said I could change that for you. I could - \"</p><p>\"No, you can't. You can't change who you are, what you want, what turns you on. We're not the same, Edward. We never will be. It just wasn't meant to be.\" He stands there silently, looking completely shocked. \"I'm sorry,\" I say.</p> <p>Edward nods, but says nothing as he heads toward the door. I feel horrible. The tightness in my throat is making it impossible to swallow. I want to say something to him, comfort him, but that will only make it worse.</p><p>Before he pulls the door open, he turns and looks at me, \"We could have been great, you know. You could have learned to like the way I love you.\"</p><p>I stare at him for a moment, and then say, \"But I want more that...\"</p><p>He glances up at me, \"So, there's someone else?\"</p><p>Hell no, there is not someone else. I feel the retort bubbling inside of me, but I shake my head and say, \"No. I'm not seeing anyone else. I'm not sleeping with anyone else. It's been me and you this whole time and we haven't had sex once. Every time I'm with you, I feel like you don't want me, that I'm not good enough for you.\" I am scared to tell him how much more I want, how much more I need. He doesn't know, but I think he suspects. \"I can't do it anymore. I've had this relationship before. It doesn't end well.\"</p><p>He blinks slowly. The sadness fades from his eyes. His gaze meets mine and he says, \"I love you, Anna. I always will.\"</p><p>\"Then let me go.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By the time I'm driving East on my bike, I'm in a horrible mood. Edward wouldn't take no for an answer. He is convinced that we belong together, that destiny will reunite us. I ended up being harsher than I wanted. I took his beautiful roses, shoved them back into his arms, and pushed him out the door. I literally threw him out. He gave me his love and I tossed him out like trash.</p><p>I wish there was traffic, something to distract me during the drive, but the roads are fairly empty. When l I hit the end of the highway and it turns into rural roads, it's barren. There isn't another vehicle in sight.</p><p>I follow Cole's directions and stop at a beach-front home that has been converted into his studio. Outside there is the Le Femme sign, but the colors are different - hot pink and black. His New York City studio is pale blue and gray. I wonder why this one is different, but don't pay it much attention. Different locations can have different colors. Besides, what do I know? Le Femme is his business, not mine, and if he thinks it makes sense to rebrand his studio, that has nothing to do with me.</p><p>Parking the bike on the side of the house, I get off and stretch. The air is balmy and warm. The sound of the ocean fills my ears. Seeing Cole after this morning's event with Edward is too much. My emotions are in overdrive and I can't contain them. It feels like my eyes will betray me and gush tears at any moment.</p> <p>No, I can't see Cole. Not yet. So, I set my helmet on the bike and walk toward the water. The sound of the ocean lapping into the shore calms me. Cole is so lucky to have this place. I'd live here year-round if I had a place like this. It is isolated, but part of a smaller town outside of the Hamptons hamlet, or whatever you call them. Townships? Anyway, it is perfect. The town itself feels like a piece of Americana New England. It is picturesque. Add in the house and it's a dream. I sit down on the sand, and watch the waves crash into the shore. The wind whips my hair, separating tiny strands that float on their own. My mind clears after a few moments and I feel a little better.</p><p>\"It's beautiful, isn't it?\" his voice flows over my shoulder, sending a chill down my spine. I turn, sucking in a deep breath. Cole's staring at the surf like there might be mermaids in there.</p><p>\"Sublimely so,\" I answer softly. I wonder how Cole can act like nothing happened last night, but he does. It makes me wonder if I misread him, if he was really just offering me a guest room.</p><p>\"Ah, and that's the most bewitching kind of beauty. Isn't it?\" Cole is standing barefoot a few paces from me.</p><p>He offers his hand, but I don't take it. \"Come on, Lamore. Let me show you around.\" He puts his hands back in his pockets and gazes at the ocean once more before turning back toward the house. He walks away from me before I can get up. I jump up and follow him inside.</p> <p>The exterior of the studio looks like a little a Cape Cod style house complete with gray shingles and white trim. It's perfect. We pass through glass sliding doors that lead to the beach.</p><p>Cole says, \"The studio has several rooms. There is a guest section with full bedding. Each room has a private bath.\" And it does. As we peek in the empty rooms, Cole shows me the upscale finishes with marble tiles and white fixtures. It's so soft and feminine. I wish I had a bathroom like this. It's completely perfect. Cole forgot nothing.</p><p>He looks down at me and says, \"The staff gets these two rooms, and the others are for clients who need to stay overnight. Some will want to fly in or need the session in the evening. The assistant will oversee all this, so you don't have to worry about it.\" Before I can ask anything, he's walking again. I stop gazing at the room and follow him.</p><p>Cole leads me into a room that still smells of paint, \"This is the shooting room. The electricians fell behind, so it isn't ready yet. That slows things down a little bit. The lights will be there and there. Additional units can be placed at these intervals.\" He shows me the room, and is talking layout, but I don't understand what he's shooting.</p><p>The set-up is similar to his city studio, but it's different - smaller and more posh. The sets have more details, more color. One set is solid pink like strawberry soda. It has a lightness, and feels girlie and seductive at the same time.</p><p>I walk through it, and touch the velvet blankets, and then the flocked paper on the walls. It makes my jaw drop. I notice things as we walk around. After seeing the shooting room, Cole shows me the office where I'll be working and which computer is mine. Everything is pink and black. The decor doesn't match his other studio. His branding is glaringly different, like he's trying to do something different out here, but for the life of me, I can't tell what.</p> <p>Finally, I ask, \"So what is this place, Stevens? It has your studio's name, but none of your branding. What gives?\"</p><p>He leans on the reception desk and folds his arms across his chest, \"It's a new division of Le Femme, a division that I'm putting you in charge of.\" He watches me from under dark lashes, waiting for my reaction.</p><p>\"What?\" I breathe, turning to him. Is he serious? He can't be. I'm an intern, which makes his suggestion insane.</p><p>\"I'm trying something new. This was the reason I wanted you to take the internship with me and not Sottero. I've been keeping track of you for a while, watching you turn into the perfect artist to work here.\"</p><p>My eyebrow creeps up my face as he speaks. I don't ignore the fact that he's been watching me, but I can't get over the obvious. \"But, I'm an intern,\" I sputter.</p><p>He looks at me like I'm insane. \"So?\" he shrugs. \"And that's bad because - ?\"</p><p>\"Because I'm too young to be entrusted with something like this.\"</p><p>A dark brow lifts. He shakes his head, \"Says who? You? You're telling me that you wouldn't want this? That you couldn't do it?\"</p> <p>My eyes narrow. I wonder what game he's playing, if this has something to do with last night or if he just wants to make me cry. I feel too emotional today. I can't handle his teasing, not after everything that's happened. \"Don't jerk me around just because you can. We weren't all born with a silver spoon in our mouths. A job like this would matter to me--\"</p><p>He cuts me off, \"You don't even know what the job is.\" He's smug, \"So don't go pulling the silver spoon crap. And for your information, this studio came from my own blood, sweat, and tears and no one else's. Both studios did.\"</p><p>I laugh. My arms fold over my chest defensively. \"Yeah, right. The trust fund baby must have had a hard time getting everything set up.\" There's a bite to my voice when I speak again. It says don't screw with me and I know Cole senses it. \"Every single thing you have was handed to you because of your name or your fortune. Don't tell me about blood, sweat, and tears. Those are things that you don't understand. The rich are cold conniving snakes, playing games for eternity, trying to outwit everyone around them, but in the end they lose - they always lose - because they find out they never had anyone who didn't love them for their money.\" By the time I'm done, my body is close to shaking. For some reason this feels incredibly personal. Steadying myself, I realize that it's because of my Grandmother and the effect she's had on my family.</p><p>Cole's brow inches higher and higher as I speak. \"So, you think you have me all figured out?\"</p><p>\"I didn't say that.\" I want to tell him that I have him figured out, that he's just like the rest of them, but I know it's not true. There's a piece that doesn't fit. Trying to figure out Cole is like having a puzzle with several pieces missing. I have an idea of what's there, but without those pieces, I'll never see the whole picture.</p><p>He's silent, watching me fume. Finally, he says, \"What do you want, Anna?\"</p><p>I want you to want me. I want your arms around my waist, your hand on my cheek. I want to feel you against me. I want you... I don't say any of it.</p><p>I breathe hard, and look away. \"Just tell me what you want from me. I've been jerked around enough for one lifetime.\"</p><p>He watches me like he's assessing something. His expression is unreadable. He glances down and says, \"Fair enough.\" Our gazes meet when he looks up. \"I want you to run this studio. My intention is to spend the summer with you, teaching you how. In the fall, I'll return to the city and we'll catch up a few times a year when we go over fiscal information. Like I said, I've been keeping tabs on you for a while. You have the skills needed to do this.\"</p><p>I eye him. He keeps skipping something, a pertinent detail. I still don't know what he's shooting out here, so I ask, \"What type of studio is this?\"</p><p>\"Boudoir.\"</p><p>\"Cole!\" I'm yelling and I don't know why. It's my dream job, but instead of shooting brides, I'll be shooting naked women. Tears sting my eyes, but I blink them back. I turn toward him and he slides off the desk. I slam my hands into his chest. \"How could you do this to me? You offered everything I want and everything I said I'd never do!\" It isn't something that should leave me in tears, but I am balling. Tears race down my cheeks and I can't stop them.</p><p>Cole's fingers wrap around my hands, keeping my palms from shoving him again, \"Why are you crying? I thought you'd be happy. You like it out here. Your family is nearby. You won't be alone. And the studio...\"</p><p>I try to yank my hands away, but he doesn't let me. I feel the rhythm of his heart beating in his chest. I look up at him, \"The studio is perfect. It's beautiful, but I want to shoot brides, not boobs. I can't do this! I can't!\"</p><p>I threw everything away. Ditching Sottero screwed me. I can see the beginning and end of my career in this building. Although I don't mind shooting models, I don't want to do this forever. Le Femme is supposed to be a stepping stone. Cole is supposed to teach me. I know he has skills that Sottero doesn't.</p><p>\"Listen,\" he snaps at me, tightening his grip on my hands. It makes my panic throttle down. \"I don't think I was wrong. You can do this. You have the skills. You just have your head stuck in this fantasy of being a wedding photographer. Why? Why does it matter so much that you shoot brides?\"</p><p>\"Because it's the most romantic moment of their lives. It's the most important.\"</p><p>\"And this isn't?\"</p><p>\"No! It's not! These are please fuck me pictures. These aren't even art. Cole, the fact that you - \"</p><p>He drops my hands like I've burnt him and shakes his head. He turns away from me and runs his hands through his hair. \"Anna!\" His voice booms. When he turns back his blue eyes are livid. I've insulted him. His jaw twitches like he wants to say things that he bites back. Finally he says, \"If you can see this is art - if you see that this is romantic and important - will you do it? Will you try?\"</p><p>\"There is no way that I'll ever say that.\"</p><p>He laughs and shakes his head, \"You are such a pain in the ass. Just say yes or no. If you can see that it's art will you do it?\"</p><p>His laughter disarms me a little bit. I nod and fold my arms over my chest. \"Yes. Now please prove to me that you haven't fucked up my life beyond repair. Show me the artistic boobies so I can go beg Sottero for a second chance next year.\"</p><p>Cole growls, leaning close to my face, \"The only person you'll ever beg for anything will be me.\"</p><p>My heart is pounding. I can't breathe. I want to punch him. I want to kiss him. This arrogant bastard thinks that I'll believe anything he says, and he says he made this place for me. I can't let him get under my skin like this, but he's already there.</p><p>I lean closer to him and breathe, \"I'll never beg you for a single thing.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cole avoids me for the rest of the day. He probably doesn't have any ideas on how to prove to me that this studio is artistic. I'm sitting in my new room, on my bed, with my head against the wall. It's a little guest room off the main hall.</p><p>A girl wraps her knuckles on my door and pushes it open. \"Hello?\" she says. A massive amount of red hair peers around the door with a strikingly pretty pale face at the center. Impossibly green eyes blink at me. \"Are you Anna?\"</p><p>I nod and scoot the edge of my bed. \"Yes. Can I help you?\"</p><p>She walks into the room. \"I'm Regina Davenport. I'm Mr. Stevens' assistant. I heard you're the new intern, well, the only intern.\"</p> <p>Confused, I ask, \"What do you mean?\"</p><p>She laughs, \"I'm sorry. I thought it was common knowledge. Every year Le Femme takes in one intern, and every year that intern quits before it's over. Sottero usually scoops them up and it pisses Mr. Stevens off to no end. We've never seen him on speaking terms with someone interning after this long.\"</p><p>My mouth is hanging open, \"It's only been a week.\"</p><p>Her eyebrows lift, \"Yeah, like I said, a long time in internland.\" She hesitates and then asks shyly, \"Is it true? Do you really get to run this if you finish the internship? I mean, it seems like a sweet deal, assuming you can tolerate Stevens...\"</p><p>I nod slowly. \"He chases off the other interns? How?\"</p> <p>Regina looks back toward the door like she shouldn't be talking, but she's the only person I've seen today that is within a few years of me. I know we'll be working together if I stay here and so does she. She grins, \"He's just difficult to get along with. He's got his own ideas about things and if yours don't line up, well, there's no future for you here. But he offered you this, so he must respect you an awful lot.\"</p><p>I don't know what to say, so I nod. She says, \"He's looking for you. He said something about some artwork to show you. I told him I'd check, that I thought you were sleeping. What would you like me to tell him?\"</p><p>She's protecting me from him. I don't really understand why. I don't even know her. A thought occurs to me and I blurt out, \"You're trying to make sure that I don't burn out?\"</p><p>She smiles like she's guilty and nods. \"A girl's gotta make a living, Miss Lamore. And it's so much prettier out here than in Manhattan. No commuting. Can you imagine?\"</p><p>I finally understand, \"You'd be the assistant who stays out here, with me?\"</p><p>She nods, smiling, hope flowing from her eyes. \"That's the plan, Ma'am. So, what should I say?\"</p> <p>\"Tell him I'll be right there. And Regina...\"</p><p>\"Yes?\"</p><p>\"Don't call me, Ma'am. I'm younger than you. And if you talk to me like I'm an old person, I'll truly lose my mind.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Cole downshifts the car and accelerates hard as we enter highway traffic. Narrow headlights shoot beams into the darkness as we navigate the back roads. The drive to civilization makes me uneasy. There is nothing around for miles. It looks like an alien abduction road. Cole's gaze keeps shifting to me, and makes me extra nervous. I can't tell what he is thinking. The sick part of my mind wonders if he is taking me into the strawberry fields to kill me. My pinky lifts for the door handle as we slow.</p><p>Shaking his head, he grins, \"Dear God. Miss Lamore, just jump. If you really think I'm going to kill you, please jump now before I really do.\"</p><p>I scowl, \"I'm not - \"</p><p>\"You are so. Your entire body is wound so tight that I could... well, never mind what I could do. I can tell you don't trust me.\" His voice is cold like I've offended him. After a moment he asks, \"Do you care to tell me why? What have I done to warrant this reaction from you?\"</p> <p>Biting my bottom lip, I'm not sure if I want to answer. I'm still upset with him, but I find myself saying, \"I don't really know you and I don't know where I am.\"</p><p>He glances at me out of the corner of his eye. His grip tightens on the steering wheel of his Porsche. \"You're north of the studio, nearing the highway, with a man who values his reputation and wouldn't waste it on dumping your body in a farmer's field, no matter how much you irritate him.\"</p><p>\"I irritate you?\" I laugh. I fold my arms over my chest to make sure I don't flinch and reach for the door again. I mutter something about farmers and pitchforks.</p><p>He smiles, glancing at me out of the corner of his eye. After a moment he says, \"So, Miss Vanilla,\" my stomach drops when he calls me that. It brings back the dream and every sensation that lit my body on fire, begging for his touch. I stiffen. Cole glances at me and continues, \"tell me why you so abhorrently object to fine art nudes. I find that ironic, being that you claim to be an artist and all.\"</p><p>He's baiting me. I know it, but I answer anyway, \"I'm not Miss Vanilla, smart ass, so stop calling me that.\" I'm quiet for a moment, trying to put it into words. \"As for the nudes, I think they belong in paintings, not photography. Nudes in photography usually equal pornography.\"</p> <p>He laughs, a deep belly laugh in one short burst, \"You actually believe that?\" I nod with a serious expression on my face. \"Then you're a hypocrite, Lamore. You can't be an artist and only value one medium and disregard the others.\"</p><p>\"I am not,\" I say calmly. I'm holding my hands in my lap, watching the world zoom by. Cole's foot is heavy when he's irritated. I appear to have easy access to his crazy buttons and seem to be punching them like a typewriter tonight. \"It's not the medium. It's the content.\"</p><p>\"But the same content is okay in a painting?\"</p><p>I nod, \"Yes. Botticelli was an artist. Heffner is a pornographer. No one jerks off looking at Venus on a half shell.\"</p><p>His voice is charged with emotion, \"Guys jerk off to all sorts of things, so that shouldn't be your criteria for anything. As for your identifying factors of what's art and what isn't, tell me - what makes something art? Can you define that?\"</p><p>I think about it for a moment. In my gut I know. I know it when I see it. My lips part and I'm telling him, \"It's art when it's evocative, when it can convey emotions and feelings to the viewer. An idea - or ideal.\"</p> <p>\"And sensuality doesn't count?\"</p><p>\"No. Well,\" I think about it. Sensuality isn't my issue. I'm not sure what is. I shake my head, not looking at him I say, \"Yes, it counts.\" Cole is silent with a surprised expression on his face. I stare out the window as lights blaze by in the darkness. We're on the highway now, zooming closer and closer to his apartment. I'm nervous. Nervous of what I'll say. What I'll do.</p><p>His voice is soft, \"Why? Why does it count?\"</p><p>He's no longer challenging me, but sounds like he genuinely wants to know what I think. This entire conversation is way outside of my comfort zone, but I don't back down. I want him to see that I'm right and not just some crazy prude. Leaning my head back in the seat, I think. \"Because it's an emotion. Sensuality isn't what I object to... it's more the fact that nude photos are degrading to women.\"</p><p>Cole laughs, \"Oh my god! How many crazy women are living inside your brain? How do you manage with all of them in there telling you what to say? Does one tie the others up and randomly take over?\"</p><p>\"You're such an ass,\" I sigh, shaking my head at him. \"You asked my opinion. Don't ask if you don't want to hear...\"</p><p>\"No, that was not your opinion. It was what you've heard, what you've learned. It isn't what you think. Last week I saw it on your face during those shoots. This kind of photography - this kind of work - isn't what you thought it was.\"</p><p>I shake my head, \"No it isn't. None of this is what I thought it would be.\"</p> <p>\"That makes two of us.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When we arrive at a tall building, it's late. He pulls up in front, gets out and walks around to my door. Before I can move, he has it open and pulls me up to my feet. Cole tosses the keys to a valet and we walk inside.</p><p>The doorman nods, \"Mr. Stevens.\" Cole nods and passes him, his hand in mine tugging me along.</p><p>The elevator door opens before I know it and Cole leads me inside. When the doors close, my heart is pounding. I stare at him, remembering his hands on me... remembering the dream. I swallow hard.</p><p>Cole keeps his distance. I know where we're going even though he doesn't tell me. I figured it out somewhere on the highway back into the city. He is taking me to see those paintings, the ones he mentioned before. My stomach twists as he gazes at me. The elevator stops and the doors open. We're in the penthouse. His home.</p> <p>Cole steps through, but I can't move. Fear snakes up my legs and binds me to the floor. Everything from the scent to the colors has my heart racing faster. It's Cole. This place is his haven, his security blanket. I don't belong here.</p><p>Before I can do something stupid, he sighs and walks back toward me. He holds out his hand, \"Come on, Anna. I won't bite.\"</p><p>My eyes slide over his face and I put my hand in his. I don't like this. Being in his home is demolishing the remaining ill conceptions I have of him like a buffalo in a china shop. Everything just shatters. There is no cold sterile modern furniture. Everything is plush and warm, decorated in deep blues, browns, and blacks. It's not one of the museum homes of the wealthy, it's Cole's home and he lives here.</p><p>He flips on lights as we walk through. They illuminate the walls creating a subtle golden glow. Cole stops in the kitchen and goes to the cabinets, pulling out wine glasses. I don't say anything. I feel nervous and I don't know why. Part of me is scared that I'll agree with him and change my mind. The other part senses something about him, about Cole, that makes me nervous.</p><p>He hands me a glass of wine. \"I don't know about you, but this is unusual for me.\" I know what he means. This situation makes him nervous. Since I feel the same way, I take the glass.</p> <p>I follow him into a room at the back of the apartment. When I see the bed, I realize it's his bedroom and stop. It feels like I'm being strangled. My grip on the glass is so tight it could shatter. I raise the wine to my lips and sip, hoping it will calm whatever has me on edge. I enter the room behind Cole, but I don't see the art he wants to show me. The walls are barren like he hasn't decorated this part of the apartment. A large poster bed made from dark wood is in the center of the room. I look at it, thinking things about Cole that I shouldn't. Tearing my gaze away from the bed, I look down at the dark wood floor and glance around. There is a row of windows and a balcony that overlooks a perfect skyline.</p><p>I'm not sure where he's going, but Cole continues walking in front of me and crosses the room. My heart rate steadies, but there's still something intimate about this. I inhale a little too deeply and notice it's Cole's cologne that I like after I've already done it. Guilt flames my cheeks and I pretend that I didn't do it.</p><p>Cole passes straight through the room without comment, and pulls open the closet doors. A light pops on. It's a huge walk-in with clothing lining both walls and a chair. Oak drawers and shelves line the lower part of the walls. The room smells like Cole. I don't cross the threshold. I stop and watch him.</p><p>Cole crosses the wardrobe in three strides, and reaches for a knob at the back of the closet and pulls open a door. There's a tiny darkened closet back there filled with large rectangle-shaped sheets. Those must be the paintings. I don't understand why they are hidden in his closet if he values them.</p><p>He looks back at me. As if reading my mind, he says, \"They're hidden for a reason. What I'm showing you is rarely seen. I'm curious what you think - and terrified.\" He swallows hard, his sapphire eyes on my face. He stands there for a moment, suspended like he can't decide if he wants to show me or not.</p><p>My voice is small. I step toward him asking, \"Why would it matter what I think? I'm nobody.\" Condensation is beading on my glass. I wipe a trail through it with my thumb. I don't look up at him. I don't want to see his face when he answers.</p> <p>There's a pause before he says, \"That's where you're entirely wrong.\"</p><p>I lift my eyes and see him watching me. Cole's blue gaze makes my stomach feel like it's in a free fall. His lips part like he's going to say more, but he doesn't. I wish he would. I wish he felt comfortable saying his secrets to me, but I suppose this is a secret. The paintings are something he doesn't show people and I'm standing here waiting to see them. A warm glow spreads through me until I remember the circumstances of my being here. It was to prove a point, and nothing more. I clutch my glass harder.</p><p>Instead of saying more, Cole reaches into the shadows and pulls out a large painting that's draped with a white sheet. Moving closer, I walk into his dressing room holding my breath. Goosebumps line my arms. The hairs on the back of my neck stand on end. I'm nervous. My stomach is twisting and I don't know why.</p><p>Cole's voice is too soft. He hands me the painting and says, \"Here.\" I take it from him.</p><p>\"Cole,\" I stand there frozen. For some reason this doesn't feel like he's just trying to prove a point. I can't pull the sheet off. It feels like I'm seeing something forbidden.</p><p>After a moment, Cole glances at me, \"Just look at it, Anna.\"</p><p>I swallow hard and pull the sheet. The drape falls to the floor and I don't understand what I'm seeing. I feel Cole behind me, but he's silent. My eyes take in the piece of art in my hands. The stretched canvas is too big to hold for long, so I set it down. It has no frame, just a black edge. My gaze follows the blue lines across the painting. It's the curves of a woman's body, her neck, her arms, her waist, her breasts, but I can't see her. She's lost in shadow. It's a sensual showcasing of her curves in shadow and light. I'm mute, staring at it. While the piece is stunning, that isn't what rendered me speechless. I can't admit why I'm drawn to it.</p><p>I swallow the lump in my throat as I stare. I move closer, trying to understand how it was created. It looks like a photograph printed on canvas that was painted, but the light is so unusual. It almost looks like watercolors, soft and pure.</p> <p>I find my voice and ask, \"How was this done? Why does your light source look like that?\"</p><p>\"I promise I'll tell you,\" Cole says, \"But tell me what you think.\"</p><p>I swallow hard. I feel the longing in this piece. I can't stop staring at it. \"It's beautiful,\" I breathe. \"I've never seen anything like it. The light is so pale it looks like she's been painted, but it's not a painting - is it? It's a photograph, or at least it started that way.\" I reach out to touch it and stop myself.</p><p>\"Go ahead,\" he says, allowing me to commit a cardinal sin. My fingers slide across the smooth canvas. I can't fathom how he made it. \"What else?\" I feel his gaze on the side of my face. Every time my heart beats, I feel it. I feel everything. It's like I'm inside Cole's body, touching his soul. It makes me shiver. I don't have words for it.</p><p>Finally I say something. \"She's different from your Le Femme models. This woman is unedited, imperfect.\" I notice that first. The majority of my time at Le Femme has been spent editing away cellulite and smoothing skin. I stare at the unedited piece. \"But that imperfection makes her real. It makes me wonder who she is and why she feels so lost. The way the light falls across her naked body, the way she was moving, reminds me of - \" I bite my tongue. It was a silly thought, a memory from an old story.</p><p>\"Reminds you of what?\" his voice is too sweet, too fragile, to not answer. I look over my shoulder at him and then lower my lashes, not able to look him in the eye when I say it.</p><p>\"It reminds me of Bathsheba bathing on the roof in the moonlight, unaware of her effect on the king. She has no idea how beautiful she is, what she does to him, how she makes him feel... It's beautiful and tragic. Like this...\" I turn and look up at him. Stubble lines his cheeks making his eyes appear bluer than this morning. I repress a shiver and turn back to the piece. \"When did you make this?\"</p><p>\"A lifetime ago.\"</p><p>I press my lips together when I realize this piece fits my description of art. I don't want to admit it, but he's right. It is evocative. I close my eyes, realizing what I said, that I just proved his point for him. When I open my eyes I whisper, \"I'm not a hypocrite. They can't all be like this. Every image can't portray emotions like that, Cole. It's not possible.\"</p><p>As I start speaking, he turns away and takes the next painting from the closet. He pulls the drape off and I gasp and turn away from it when I realize what I'm looking at. He sets the painting down and says, \"You promised you'd look. Anna, this isn't something you've never seen before. Look at it and tell me what you see... why you looked away.\"</p><p>\"Cole, she's! That's!\" I'm sputtering like an idiot. The image was beautiful, but I feel my face growing hotter and hotter. I can't look at it.</p><p>\"It's what? I don't understand you,\" he says, baffled. Cole steps in front of me and looks at the piece and back at my face. \"How can you look at the first one and not this one?\"</p><p>Suddenly, I don't know. They should be the same. But they're not. This one shows a woman with her back arched, her breasts thrust upward, her hand just below her navel. It's sexy, all lines, and curves, and shadows. A pale light source defines her curves in a creamy violet. The rest of her body is lost in inky shadows.</p><p>Nervously, I look at it again, \"Because they're not the same.\"</p><p>\"They are. I made them the same way. How are they different? I don't understand you. Is it evocative? Can you feel a strong emotion when you look at it?\" His voice is soft. I remember that he doesn't show these to anyone, but I still can't hide my shock.</p><p>\"That's not the point,\" my face is flushed and his eyes on me make it worse. Suddenly I feel like the room is too small and Cole is too close. I want to back out, but I can't.</p><p>\"Anna?\" he asks, almost pleading with me.</p><p>Looking at him, my voice catches in my throat. He looks so vulnerable, like a single word could crush him. The expression in his eyes makes me answer, \"The first one was beautiful and sensual. This one is too graphic, too bold. You can't do that. You can't take pictures of women doing that. It's not right.\"</p><p>He glances at the painting and back at me, \"Doing what?\" He's serious. I look past him at the painting and blush. \"Anna,\" he says, \"Is it possible that your mind is much dirtier than the images you're seeing? Is there any chance that you think things happened there that didn't?\"</p><p>Maybe. I hesitate. \"She's not... touching herself?\" I ask timidly. That's what I thought when I looked at it. The arch of her back, the way her breasts are thrust upward, and I can't see her other hand.</p><p>He laughs, \"No. She was laying on a cold floor. It made her arch her back like that.\" He's watching me, his eyes study my face. He's not arrogant now. Uncertainty sits well on him, if anything it makes him sexier. Seeing this confident man care about what I think makes me wonder why.</p><p>He interrupts my thoughts, \"Anna, I wish you could see what I see.\" The tone of Cole's voice is soft, wistful.</p><p>I can't be quiet. I glance at him out of the corner of my eye. \"What do you see in that piece?\" Now I want to know. If it's not what I thought, then I want to know what he thinks it is. I force myself to look at the piece of art again. It makes my stomach twist. The way her body is laying, the arch of her back, the tension in her arms - she looks like she's in ecstasy. I can't ignore it. The evocative nature of the image is too powerful.</p><p>Shaking my head, I breathe, \"No one has ever touched me so that my body moved like that.\" Once the words are out, I wish they weren't.</p><p>Cole steps closer to me. His eyes are on the side of my face, drinking it in like he can't get enough. I can tell that he wants to say something - that he wants to answer me - but he doesn't. My heart races as he watches me. I can't breathe. He's too close. This is too intimate. It feels like I'm coming unglued and I don't know what to do, what to say. The effect he has on me is powerful, and I'm having trouble hiding it. If my heart pounds any harder, I swear to God, he'll hear it.</p><p>Cole tucks his chin. He puts his glass of wine down somewhere. His arms fold over his chest. That beautiful dark shiny hair falls over his eyes, making it impossible to see them in the dim glow. I wish I could read his face, his eyes, the same way he reads mine. I wish I was inside his head when he made this painting. Did he really see something else? Was it really not a depiction of ecstasy? And if it was, was it wrong? Was it pornographic? At this very moment, I don't feel like it is. It feels like sublime beauty, like the last canvas he showed me.</p><p>Finally, he answers my previous question and turns from me. His voice is deep, seductive, \"I see shadows and light, curves and lines. Beauty mingled with power. Femininity and softness. I see desire. I see someone who doesn't know if her body is good enough. The position of her hand makes me think that. It sits on her stomach as if she's hiding something. As if she has secrets I'll never know...\"</p><p>Silence engulfs us and we both stare at his work, neither of us brave enough to speak. My body is covered in goose-bumps. I don't know what to think. I'm caught in the middle. My mind registers things like this as trash, or they are supposed to be, but after seeing it - after hearing Cole speak about it - how can I think that? It was my mouth that said the requirement for something to be art was the ability to evoke emotion, and here I am stunned into silence by something I wouldn't have considered art yesterday.</p><p>Damn. I'm a hypocrite. I don't like it. It feels like I've been blindsided, but Cole doesn't stop. He doesn't let me catch my breath.</p><p>Instead, he takes another canvas from its resting place and pulls the sheet off. When the drape hits the floor my toes curl inside my shoes. I can't breathe. It's another nude, another woman bathed in golden light. Long dark hair falls to her hips in curls. Her arms are stretched over her head, thrusting her chest out. The light catches the curve of the bottom of her breast, the softness of her jaw, the fullness of her hips - and there are glittering jewels hanging from her nipples.</p><p>Staring at it, I'm hyperaware of every inch of my body. My eyes fixate on her breasts, on those dangling jewels. It feels like someone sucked all the air out of the room. Heat engulfs me. I shouldn't be looking, but I can't stop. This kind of thing is too sensual, and it's too beautiful. I can't look away. I can't understand why I don't feel offended, and realize that it's because this is art that reflects Cole's heart. I'm seeing part of him when I look at these pieces. This woman meant something to him. She had to.</p><p>Glancing at him, I wonder who she is - this faceless woman who is concealed in shadows and hidden at the back of his closet - locked away from the world. It's part of a life he hides, a part of Cole Stevens that remains a secret.</p><p>\"Who is she?\" I ask finally.</p><p>Cole shakes his head once. Dark hair sways over downcast eyes. He doesn't look up. He doesn't answer. I don't know if he won't or he can't. This isn't a random model. The images feel too intense for that.</p><p>Trying to be less personal, I ask, \"How did you make these? The light is so soft. So stunning. I can't figure out how you did it - \"</p><p>Cole unfolds his arms, resuming the role of teacher. The softness in his eyes seeps back to the place he hides it in his heart. \"It's painting with light. It uses the camera, but the exposure is much longer. The model sits in a pitch black room. I set the camera on the tripod and release the shutter. Then I literally paint the model with a colored light. I move the light over her and it's kind of like a paintbrush, highlighting the areas I want and leaving the rest in darkness. It makes a soft color-wash over her skin.\"</p><p>I blink twice and turn my head back toward the print. \"But I don't see you in these.\" For that to happen, the exposure had to be pretty long - like minutes, not seconds. I'm astounded that he thought to do this. I've never seen it before. At least, I've never seen this concept with boudoir portraits. Cole is watching me as my mind races with questions. He knows I'll latch onto the technical aspect and appears eager to discuss it with me.</p><p>\"How long is the exposure?\"</p><p>\"Several minutes,\" the toe of his shoe picks a spot on the floor. Arms folded over his chest, he says, \"You won't see me unless I stand still for a moment, but I'm there - moving through the shadows, spilling light across her body like rain pouring from the sky.\"</p><p>Something occurs to me while he speaks. Turning to Cole, I say, \"This is the kind of work you want me shooting, isn't it? The Le Femme studio you're putting out East isn't like the one in the city. You want it to be something else - something like this.\" I already know the answer, but it doesn't stop the shock from spreading across my face. When he asked me to run the Long Island studio and said it was boudoir photography, I totally freaked out thinking he wanted something else.</p><p>But this. This intimidates the crap out of me. I don't know how to do this. I don't know how to make powerful images like these.</p><p>\"Yes,\" he nods. \"Or something similar. I want you shooting art. I want your images to be evocative and powerful; seductive and feminine.\"</p><p>I look at the canvas and don't turn my face back toward him. For a moment, I say nothing. A crazy thought is bouncing around in my mind and it won't shut up. Seeing these, seeing this part of Cole, is shocking. I don't know why, but I assumed he wasn't capable of this. I just stand there, mute until he asks again and this time I nod. At this moment, I recognize that my perception has changed. I can feel it shattering, cracking apart like shards of ice, and falling away.</p><p>His art has changed me - Cole changed me.</p><p>My mind resists accepting it. My body feels like I'm being strangled. I can't do this. I don't know how. Cole's passion spills across the canvas more powerfully than anything I've ever seen. It's feminine and beautiful and powerful. It's everything I want to do, everything I want to be. Wedding photography is something that most women will need at some point. It is a single chance to show them that they are beautiful, but this - what Cole is offering gives me the chance to do that but even more so. I see it. It's crystal clear. And I realize that I want to learn how. My mind is at war with itself. The prudent side is assaulting my rationale trying to poke holes in it. I can't tell who's winning, but my mouth shocks the hell out of both of them when I speak and say the crazy idea that's forming in my head.</p><p>Glancing at Cole, I say with complete certainty, \"I want one.\"</p><p>\"What?\" Cole turns toward me. He blinks and opens his eyes wider like that might disprove what he heard me say.</p><p>That was the thought that was trapped inside my mind. As soon as I felt my previous conceptualizations crack, I knew that I'd want to learn everything about this. I'm intrigued and terrified.</p><p>My heart thumps when I say it and my palms grow hotter. \"I need to know what it feels like on the other end of the lens. I can learn the practical part with models, but this - \" I shake my head, \"it's not about knowledge, it's about feeling. It captures the client's beauty in a powerful way. The only way for me to know how the client feels is to actually be the woman in the portrait.\" My gaze locks on his. His sapphire eyes search mine, his brow pinched with shock. \"Shoot me, Cole.\"</p><p>He seems shy, like the idea hadn't crossed his mind. He doesn't look away when he says, \"I don't think that's a good idea.\" His lips part like he wants to say more, but he doesn't.</p><p>\"Cole,\" I don't know what I'm going to say. I just know that this is important. I can't understand this wholly if I don't. \"Please. It's a shoot. We're both grown-ups here. We can manage this.\" Well, I was hoping we could. I shrug like it's no big deal, \"Besides, you said you only do one-nighters and I'm not that kind of girl.\"</p><p>He works his jaw and looks up at me from under his brow. \"I never said I only do one-nighters. I offered you a one-nighter.\"</p><p>\"And I said no,\" I reply absently, no longer looking at him. \"So there's nothing to worry about.\"</p><p>I'm staring at the paintings. The thought of a shoot like this has butterflies swirling in my stomach. I walk past Cole and pull out more canvases, looking at more of Cole's work. He watches me, silently. The paintings aren't what I thought they'd be. If light could be liquefied and poured into a paint can, that is what Cole made - something sensual, beautiful, and completely sexy.</p><p>\"I can admit I was wrong,\" I say turning toward him. \"This is art. I see it now. You showed me something I didn't think was possible and there's no way in hell I can shoot this kind of stuff without submerging myself in it.</p><p>\"There's a reason why Sottero wanted me, Cole. There's a reason why I'm at the top of my class. I don't do things half way. If I see something I want to do, I learn everything about it, and I'm taking you up on your offer. I'll run the Long Island branch of Le Femme. I'll shoot this kind of stuff, but you have to shoot me first. It's nonnegotiable.\"</p><p>He blinks at me and shakes his head, \"God, Anna. I - \" He runs his hands through his hair and sighs. I know I've won. I know he'll do it. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We stay in his apartment for the night. I sleep rather restlessly in his guest room. The place smells like Cole. I can't stop thinking about him, but I finally pass out not wanting to consider what I offered earlier in the evening. He lets me sleep late and I emerge from the shower around noon. We go into the Manhattan office and work until sunset, editing the remaining images from last week's shoot.</p><p>Neither of us says much. When we leave, he holds the door to his Porsche open and I slide in.</p><p>I feel his eyes on the side of my face as we drive back to the new studio. Cole is silent. His fingers are wrapped around the steering wheel tightly. It's like nothing happened last night, like he didn't agree to do something completely sexy with me. I lean my head back and stare out the window. I don't turn to look at him.</p><p>It's late by the time we hit the open stretch of highway back to the beach house. I wonder about him. I wonder who he really is, what he really sees. He does such a good job of hiding everything that I realize I have no clue. There's a passionate side to Cole, but there's something softer and more vulnerable, too.</p> <p>\"What are you thinking?\" he finally asks, glancing between me and the road.</p><p>I shrug, like I'm not thinking anything, like I'm not obsessing about him and wondering about his past. \"Just wondering about stuff,\" I mutter the half-truth to cover the lie, then add, \"Nothing really.\"</p><p>\"You have that far off look in your eyes. I've been around you long enough to figure out what that means, so spill Lamore. What has your brain in a knot?\" He smiles softly at me.</p><p>I glance over at him wondering if I'm so transparent all the time, or if he just reads me better than others. I sigh and shake my head, \"It's none of my business, but I saw something I wasn't supposed to see when I grabbed your bail money.\" I shrug like it's no big deal, and glance at him out of the corner of my eye. \"It was a picture of you in an army uniform and a beat up Tiffany's box. It looked like it'd been run over.\" He says nothing and stares at the empty road, concentrating as if it were rush hour. I'm looking at my hands, running my thumb over the thumbnail on my other hand.</p><p>My voice is soft, \"You looked so young and afraid. And the ring, I guess there's a heartbreaking story there?\" His shoulders tense. Cole works his jaw and swallows hard as I finish speaking. I think he's angry, but I can't tell. I look at my hands and say, \"I didn't mean to look. I'm sorry. I shouldn't have said anything.\"</p> <p>He doesn't glance at me anymore. His eyes take on a vacant stare like he's remembering something he wants to forget. \"It's fine. I'd forgotten it was in there. The rest of those pictures were burned.\" He doesn't acknowledge the Tiffany ring.</p><p>Burned? There's a story there, a part of him that I want to know. I can't not ask. Carefully, I say, \"Why'd you enlist? I mean, most families would have disowned a kid over something like that.\"</p><p>Now he glances at me. His eyes are cold as stone and I visibly flinch. \"What makes you think mine didn't?\" His words are filled with scorn for someone else, but some of it drips onto me.</p><p>I falter. My mouth hangs open. \"But, you're the only heir - \" I sputter, shocked, not believing what he's implying. A sole heir wouldn't be disowned. That's extraordinarily bad. I can't even imagine what he'd done. Enlisting doesn't seem big enough to warrant such a reaction, but as I look at him, I know I can't ask. I seriously doubt my mother would have been disowned if there were no cousins, if there were no one else to claim my mother's birthright.</p><p>Hedging, he says, \"You seem to know some things, for a girl who hates rich people so much.\"</p><p>I laugh, but there's no joy in it, \"Yeah, well, let's just say life wasn't kind to my parents. I saw things from the wrong side and it took its toll on me.\" Suddenly I stop talking. That's my darkest secret. It fills me with anger and shame to even bring it up - anger at my Grandmother for treating her daughter so cruelly, shame that I'm not more like my mom. She has backbone that I'll never possess. I look out the window, but I still see Cole out of the corner of my eye, watching me.</p> <p>\"I understand,\" he says and glances at me again. \"Things struck a little closer to home for me and it didn't matter that I was the sole heir. I enlisted to prove a point. They disowned me prove a point.\" He's staring out the windshield. His voice is cold. He doesn't look at me. Gripping the steering wheel of the Porsche, his knuckles turn white. I feel like I've picked open old wounds for both of us and desperately wish I could take it back. The pain in his eyes floods me and I want to take it away. That distant look, the feeling that he's not good enough - that he'll never be good enough - is plastered across his face.</p><p>Turning, I stare at him with my jaw hanging open. There's a word that's lodged itself in my throat, something I was going to say - but I've forgotten what it was.</p><p>It can't be true. He couldn't have been disinherited. Cole Stevens didn't have his family's millions? But, he's said it all along - he made Le Femme, it was his blood, sweat, and tears.</p><p>Oh my God. Staring, mouth still agape, I don't know what to say. I want to tell him that I understand, but I don't get it the way my mother does. I don't know what it feels like to have everything one day and nothing the next. His parents blindsided him. They chose money over love. They rejected their only child.</p><p>I finally say, \"I'm sorry. I didn't know.\"</p><p>Shrugging, he says, \"It's not your fault, so there's no reason to apologize. And no one knows. It was part of our agreement.\" He laughs and shakes his head like it's some cruel joke. \"I was allowed to keep my name - my fucking name - if I didn't tell anyone that I'd lost my inheritance. Even that wasn't mine. Anyway, it's a long story, but the short version is that you should never piss off a Stevens'. They have long memories and will tear you apart when you least expect it.\"</p><p>The savageness in his voice startles me. \"But,\" I say softly, \"you're a Stevens.\" You're not like them. You can't be, I think.</p><p>His eyes are on the road, staring into the inky night. \"I know.\"</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>When we arrive at the studio, I'm exhausted. I stumble out of the car and follow Cole inside. The other two people staying here are already asleep. Before Cole leaves me to find my room, he says, \"That shoot will be first thing tomorrow. If you have body jewelry, wear it.\" He doesn't look at me as he speaks. Instead, he walks over to the front desk and picks up a pile of mail, and sifts through it. My heart hammers. I nod and silently walk off to my room with my heart in my throat.</p><p>Sleep finally comes, but my dreams make me restless. I dream about Cole as a young man. I see the haunted expression in his eyes - the fact that he knows there is no such thing as forgiveness. He learned that lesson too well. There is no way he will ever forget.</p><p>The dream fades to Edward. His eyes are a void of black. Bleeding twin trails of ink spill down his pale cheeks. He says, \"You destroyed me.\" He reaches for my throat, his fingers moving toward my eye with a black nail in his fist. I know that will make my eyes bleed black like his, that my heart will never heal. I know I'm dreaming, but I scream anyway.</p><p>I wake, frightened, and trembling. The sun is barely over the horizon. I swing my legs over the side of my bed and rub my eyes. I breathe deeply trying to push away the nightmare.</p> <p>There's a knock on my door. \"Come in,\" I say. When I look up, Cole is standing in the doorway. I'm wearing cotton shorts and a thin cami. They're dorm pajamas, which means they're guy safe. At least that's what Emma and I used to say.</p><p>Stubble lines his cheeks. A white tee shirt clings to his torso. Dark jeans hug his narrow hips, and he's barefoot. Cole seems to have something against shoes. His eyes are red like he hasn't slept. \"You all right? I heard you scream.\"</p><p>\"Yeah. Fine.\" I don't elaborate. I look up at him and push the rat's nest that is my hair out of my face. \"What time are we shooting? Tell me it's not in fifteen minutes.\" I'm only half joking. Cole's a morning person. Apparently that's still true even though he's only had a few hours of sleep.</p><p>He smiles, \"No, not in fifteen.\" He looks at his watch and back up at me. \"Why don't we try for nine? You can get a few more hours rest.\"</p><p>I laugh and push off the bed, shaking my head. \"It'll take me that long to get ready. And I have to tell you that I didn't bring anything with me that might be even a little suitable for this shoot. Do you have props or something I could look at?\"</p> <p>\"No nudes, Miss Lamore?\" he asks leaning against the door frame, and folds his arms over his chest. A dark brow rises on his face. His eyes lock on mine.</p><p>My stomach flutters. A soft smile lines my lips and I shake my head, \"I thought I should see what my options are. I hear lace photographs well,\" I tease, knowing it will annoy him. Anything about wedding photography seems to get under his skin.</p><p>\"Damn wedding photographers and their lace,\" he laughs softly. The sound is stunning. I wish he were like this all the time, but it's the Cole that vanishes like smoke. I think that's the real Cole, the one he hides from everyone at all cost. He pushes off the door frame, and shakes his head, \"Come on. I'll show you where the wardrobe is located. Use whatever you want. They literally finished the sets last night and installed the lights. We'll christen the new studio and then get back to work.\"</p><p>An hour later Cole is gone and I'm still looking through boxes. I find some jeweled dangling earrings that I can use. They have a hook, but I grab some wire and wire cutters. I plan on modifying their intended use, slightly, if I have to. Other than that, I don't see anything else.</p><p>Regina walks in and flips on the lights, \"Hey boss. Can I help you find something?\"</p><p>Quickly, I decide to tell her what we're doing. It makes it seem less risque, even though telling her about the shoot makes me blush.</p> <p>Regina is very professional. She doesn't react. Instead she helps. She digs through a few boxes, showing me more necklaces and outfits from Le Femme.</p><p>She hands me a panty and I press the thin lace between my fingers, \"This is beautiful, but I wanted something different.\"</p><p>\"How different?\" she asks.</p><p>I shrug at her and put the panties back. I laugh nervously and look at her. \"I have no idea what I'm looking for. Or what I want. I just need it to be sultry, cover me a little bit, and be something that screams, Anna.\" I shake my head. \"None of this stuff seems to do all that.\"</p><p>Regina nods, listening. Grinning at me, she says, \"I have something.\" She looks over her shoulder like she's doing something that she shouldn't and reaches for a box on the top shelf. I look inside when she pulls it down. It's filled with tiny crystals. Many are clear, like tiny diamonds, but some are vibrant colors. She pulls a paper from the plastic sleeve on the top of the box. \"I got these thinking we could use them - to do this.\"</p><p>\"What is it?\" I ask and unfold the paper. My cheeks flush when I see it, but I can't look away. My jaw drops.</p><p>\"Vajazzling. At least that's what the article calls it.\" She shrugs. \"I guess you can do anything from pouring the crystals over your body, to applying them in a pattern.\" She points at the paper to a woman bared from the waist down. The patch of hair between her legs is gone and in its place there is an intricate design of a butterfly. The sparkles disappear between her legs. \"That one is really pretty,\" she says pointing to the butterfly. \"Of course, that only works if you already have a Brazilian.\"</p><p>I scan the paper, reading it. A smile creeps slowly across my face. As a matter of fact, I do. \"This is perfect. Thanks Regina.\"</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The moment I see Cole, my confidence fades. The box of crystals is in my hand and my stomach is twisting so violently that I nearly drop them. I feel hot and cold at the same time. My heart is pounding.</p><p>Cole doesn't notice. He strides toward me, lost in his own thoughts with his camera around his neck and a small light in his other hand. He places them on a table in the back of the shooting room. It still smells new, like paint and sawdust. Regina lit a candle to help ease the paint fumes from the room.</p><p>I'm standing on the other side of the table with my box of crystals. When Cole looks up, I decide to can Regina's original idea. I'm not that brave, and I wasn't able to apply the jewels myself. There wasn't enough time and I couldn't see what I was doing. When his eyes slide up my body from the box to my face, I realize that I'm in over my head. I can't do this. But I can't back out.</p><p>Cole says, \"Nice bathrobe. Tell me we're not shooting you in that?\"</p> <p>I shake my head, and put the box on the table. My hands quiver slightly. Trying to hide it, I shove the box and it slides at him. \"I thought we could pour these over me.\" That seems like a tamer version of my original plan. I have no idea how wrong I am until we get started.</p><p>He peeks in the box and his brow furrows. Looking up at me, I can see he doesn't understand. \"I'm not seeing it, Lamore. Walk me through it. What else are you wearing? Are these just accent pieces?\" He dips his hand into the box and when he lifts it, crystals pour between his fingers.</p><p>When I don't answer, he looks up at me. My face is flushed. Cole shakes his head and smiles softly, looking down at the crystals. \"How are you so shy? You're twenty-two for Godsakes. How do you still blush like that?\"</p><p>His words make my cheeks flame hotter. My eyes grow wider as he speaks, and I can't hide it. \"Shut up, Stevens.\" I smack his arm. He glances up at me from across the table, a boyish look on his face. I laugh, \"My brain's just wired wrong, okay? And you out of all people should have known that.\"</p><p>He presses his fingers to his chest, \"Me?\" he laughs.</p> <p>\"Yes, you,\" I say, smiling like an idiot, feeling the blush still burning my cheeks, \"You've been around me enough to know that I do everything wrong and backwards.\"</p><p>Laughing, he says, \"Yeah, maybe.\" He grins at me. \"Sorry, Anna. I didn't mean to make it worse. I know that this isn't easy for you.\" He clears his throat, and tries to be serious again. \"Okay, so you want to use crystals?\"</p><p>I nod, \"I thought we could pour them across me so there are tons of them in a line - like a ribbon draped across here,\" I gesture to my breasts, and then across my hips, \"and across here.\" He's nodding, like he understands what I'm thinking. His blue eyes are sliding over the robe, then they flick up to me.</p><p>\"What else will you be wearing?\" he asks.</p><p>\"Nothing,\" I breathe. I hurry on before I have time to notice the flush spreading across my body, \"I liked the art you showed me. I thought I wanted something similar, but not so revealing. The crystals will cover me enough.\"</p><p>He's smiling, watching me as I speak. When I finish he looks down at the box in his hands, \"Okay, I see what you want to do, but I have to tell you that I lied the other night. I can't shoot the exact same thing. I'm not the same person anymore. And you're - \" he glances up at me grinning, \"different. So the question is, do you trust me to make something new, something equally alluring and beautiful?\"</p> <p>His question takes me by surprise, \"Trust you?\" Smiling, I shake my head, surprised that he has to ask. My heart pounds harder when I reply, \"Yeah, of course I trust you. I wouldn't be here if I didn't. I'd be hiding out in the strawberry fields, jumping from moving cars, and that sort of thing, remember?\" I laugh nervously.</p><p>\"Anna Lamore, artist, action hero, and a little bit crazy.\" His voice mimics that deep voice in movie trailers right up until the last word and he laughs.</p><p>\"Mmmm,\" I say nodding. \"That's right. Better watch your back, jack.\" I waggle my eyebrows at him and he shakes his head.</p><p>Cole glances at me, grinning, and strides around the table, stopping in front of me. \"Okay, from here on out, this is my shoot. You'll do as I ask quickly, without question, and hopefully, you'll learn whatever it is you need to so you can do this.\" I nod once. My nerves are twisting me into insanity.</p><p>Cole leans against the table, and clasps his hands in his lap. Explaining the shoot he says, \"This will take a few hours. I'll be searching for the perfect shot. It's easier for me to find it if I take my time. The lights will be out, so it'll be totally dark. I'll take some test shots to figure out what pose I'd like you in before we shut the light. Once I chose the pose, we'll get started. I'll use the lights, so you'll see those and you may see me a little bit, but I won't be in the finished product. Remember, you can't move. Even breathing deeply can mess up the image, so no matter what - don't move once the shutter clicks open.\"</p><p>I'm nodding as he's speaking, trying to resist the urge to twist my fingers like a nervous child. I've done enough shoots with him to know how he is, that Cole will be beyond professional, but my heart is still pounding wildly.</p><p>His eyes are sweeping over me as he speaks. When Cole stands and walks behind me, I don't move. His voice is behind my ear, \"I'll take your robe so we can get started.\" Cole's out-stretched hand is next to me, waiting.</p><p>Slowly, I turn toward him. My eyes meet his. I knew this would happen, but it seemed much more sensible in my head. Breathing too hard, I reach for the bow at my waist and pull. The knot releases and the belt falls to the floor, revealing bare skin from my neck down. My fingers slip under the shoulders of the robe and it slides off and lands on the floor next to the belt.</p> <p>I'm completely bare and standing in front of him. I resist the urge to cover my body with my hands and ask, \"Where do I go?\"</p><p>A blank expression fills his eyes as I slip out of the robe. When I drop the robe to the floor instead of into his hand, Cole swallows hard. Instead of answering, he points to a white backdrop on the other side of the room. I turn and walk to the place he directs me to, feeling uncertain.</p><p>Cole softens, his tone is sweet and uncertain. He asks me to stand here, to pose there. I lay my wrists on top of my head, putting my weight on one foot. The pose forces the curve of my hips, the soft slope of my back, and thrusts my breasts forward. My nipples perked up as soon as I dropped the robe. I try not to be horrified.</p><p>Cole circles me, his eyes sliding over every inch of my body, examining me. Butterflies flitter through my stomach. He stops behind me and rubs his hands through his hair. He's already put me in several poses and taken test shots, but he seems dissatisfied. He shakes his head, \"This isn't going to work. The crystals aren't going to stay put. There's no way to drape them over you, Lamore. You're too curvy for that. Every pose I've put you in shows those curves off perfectly, but that means the crystals will roll right off of you.\" He pauses, stroking his chin. I feel his gaze on the side of my face, but I don't turn toward him.</p><p>My heart sinks into my stomach as he speaks, \"So you can't do it?\"</p><p>Shaking his head, he runs his fingers through his hair, \"I didn't say that.\" He stops in front of me, and looks into my eyes. My heartbeat accelerates. \"I can do it; it's just more complicated than you originally thought.\"</p><p>I gaze into his eyes, and when I feel every inch of my skin burning, yearning for his touch, I look away. \"Just do it, Cole. I know this is your way of telling me that my idea was good, but flawed. Just make it right and do what you want.\" My voice sounds curt, but I didn't mean to be. I'm beyond nervous and I don't know what he wants to do.</p><p>Cole nods and leaves the room for a moment. The tension drains from me as soon as he walks away. I sit down on a chair and cross my legs, scolding myself, Focus, Anna. When Cole returns, he has an arm full of plastic bottles and a few paint brushes.</p><p>Confused, I ask, \"What are those for?\"</p><p>He takes one bottle and pours clear contents into another container, \"To make the crystals stick.\"</p><p>I watch him as he mixes three clear liquids and then shakes the bottle hard. The muscles in his arms bulge slightly as he does it. My eyes are on his arms and my brain isn't working. He stops, pours the contents into a cup, grabs a brush and says, \"Up.\" He passes me and walks to the other side of the room. He points to a stool and says, \"Sit.\"</p><p>I have no idea what he's doing. It isn't until the brush is dipped in the clear liquid and the brush is coming at me that I pull back and ask, \"What are you doing?\"</p><p>He glances up at me. Cole is in work mode. His eyes have glossed over, but he snaps out of it when he hears my voice, \"Applying the crystals. I'll paint on the adhesive and place them by hand. Then we can pour on more so that they still look loose and flowing.\" He's staring at me, absorbing my confused expression. He laughs, and rubs his face with the heel of his hand. \"I forgot the box of crystals on the table. No wonder you were confused.\" As he hurries off to grab the box, I sit there with my jaw hanging open.</p><p>When Cole returns, he dips the brush again, and dots the cold viscous contents three times on my throat. Then he turns to the box and selects three different sized crystals, all white, and applies them. They stick. A smile spreads across his lips and his brush dips into the mixture again, moving lower this time.</p><p>I sit on the stool with my hands on the seat, fingers crushing the wood. Every time his brush touches me, I try not to flinch. It's so cold. And then he presses the crystals to my skin. His warm fingers brush against me as he does it. I can't breathe. My arms start to shake as his brush caresses the top of my breast. Cole stops what he's doing and looks up at my face. His attention had been concentrated on the curve of my breast and which stones to put where, but when I start shaking, he blinks twice and looks up at me.</p><p>\"What's wrong?\" he asks. His voice is too soft. I don't notice because I'm ready to crawl out of my skin. His little touches are driving me insane. His fingers have already seared a path across my chest and the closer he gets to my nipple, the more I can't stand it. That sexy blue gaze meets mine.</p><p>I want to say that I can't do this. I want to throw myself at him, but I don't. My nails dig into the wood, \"Nothing,\" I say. \"I just... well, this is kind of a bit much.\" I know I'm rambling, but I can't stop myself. For some reason it doesn't matter how many nude paintings I've seen, it's entirely different when I'm the naked girl being painted. Literally. With glue. And then getting bedazzled by Cole's perfect fingers. My brain snaps as I'm speaking. I can feel it happening, but can't stop the rush of words. \"And the glue, and the crystals - Cole - it's just...\"</p><p>He stills me with a firm hand on my shoulder. I look into his eyes, at those dark lashes, \"It's a little more personal than you thought it'd be?\" I nod once, and he averts his gaze. Cole's hand releases my shoulder and I shiver. \"Yeah, it's that way for me, too.\" He clears his throat and looks back up at me. \"Do you want to stop?\"</p><p>Sadness pours through me and I shake my head. \"I wanted to do this. I wanted...\" my voice is strained.</p><p>Cole pushes the hair out of his eyes, and says, \"I know. And this is a great idea. I know exactly what I want to do... \" he breathes hard, \"but it's strange because it's you. I know you.\" He looks at me for a moment and realizes how silly he sounds. A smile lines his lips and he sits down on the table. \"So, we both want this, but it's - \"</p><p>\"Awkward. Awkward as hell,\" I slouch on my stool. While we were talking, my arms have tried to fold over my breasts three times. Each time I had to stop myself or I'd shift the crystals. The glue hasn't dried yet.</p><p>\"Yeah, it is.\" He glances up at me. Cole seems more relaxed than me. My gaze locks with his, my lips part. I know I'm gazing too long, staring at him, willing him to walk over to me and do unspeakable things to his intern, but I know he won't.</p><p>Cole lets the gaze linger. His voice pins me in place, \"We need something to break the tension, to help you relax.\"</p><p>\"Yeah,\" I reply, nodding, not taking my eyes off his. As he steps closer, my stomach flutters and my skin tingles. Cole stops before me. His hands are in his pockets. His shoulders are slumped forward slightly, like he's uncertain about something. And his gaze doesn't leave my face. The look in his eye makes my pulse pound harder.</p><p>Cole is standing so close that I can feel his breath on my skin. He leans closer to my face, and doesn't stop until we're nose to nose. I fight for control of my breath, trying to still my racing heart. He breaks the gaze, and looks down at my breasts covered in crystals, then lifts his eyes to my lips. When he speaks, I melt, \"This shouldn't be like this... but it is. I want to have an excuse to touch you, anything... and now that I have one, I can't do it.\"</p><p>\"Do what?\" I'm gazing at his face, unable to look away. Is he saying what I think he's saying? My heart pounds harder, threatening to crack my ribs. I can't look away. I can't move. My lips tingle, as if they know what Cole was saying before the rest of me realizes it.</p><p>He leans closer and I feel his hot breath slide across my lips. I watch as he lowers his lashes, and moves toward my mouth. When his lips brush against mine, he barely kisses me. I stop breathing. My head rushes with sensations that make me feel giddy and light. My lips tingle, wanting more. Cole hesitates as I sit in front of him, naked, save some glue and glitter. I feel his fingers on my cheek, slowly sliding across my face, pushing back my hair. I feel him fighting it, trying to deny the attraction that's pulling us together harder and harder. His hand slips down my cheek until his thumb brushes my bottom lip. He rocks it slowly, feeling the softness of my mouth against his finger, tracing my lower lip. His mouth is right there, close enough to kiss me, but he doesn't. His other hand doesn't touch me. He keeps a space between his body and mine. I tremble as he touches me, as he watches my reaction to him.</p><p>\"This,\" he says, answering my question. His voice is filled with deep rich currents that pierce me through to my core. When he slides his thumb away, he moves slowly, like before. His lower lip touches mine, gently testing to see what I'll do. My hands lift on their own, finding the thick hair at the nape of his neck. I pull him down, so his lips press firmly against my mouth.</p><p>Every inch of Cole's body is corded tight, like mine, and when I touch him, he melts. His lips press into mine, softly. His teases me, kissing me softly before his tongue slips between my lips. His hands cup my face, his fingers sliding across my cheeks and into my dark hair. One hand slips down my neck, inching painfully slow toward my breast. Every inch of my body feels like it's on fire. I press my chest against him, thrusting my breast into his hand. The crystals are dry. I feel them under his hands as he slides his fingers over my taut nipple, rolling it gently between his fingers. I moan into his mouth, and he kisses me harder. My entire body has melted in his arms. I'm leaning into him, and sliding off the chair when a voice blasts us apart.</p><p>\"Hey boss. Just checking...\" Regina looks up, mortified. Her words die in her mouth as she averts her eyes, \"Just seeing if you need anything.\" She stands there, not knowing what to do or where to look.</p><p>Cole pushes away from me, his hands slip off my body. He turns to her saying, \"No. We're fine.\" Regina nods, and scurries for the door without a backward glance.</p><p>My heart is pounding in my chest, every inch of me is flushed bright red. Cole looks over his shoulder at me with an expression that I can't read. I'm wondering if he's going to deny the attraction again, but he doesn't say anything. Instead, he walks back toward the cup and the paint brush. I slide back onto the stool and he paints me in tiny strokes, placing crystals over me as he goes.</p><p>Neither of us says a word. We act like nothing happened, even though I wish more had. His brush moves over my nipples, and Cole's fingers press against my tender skin, pressing the stones in place one at a time. His hands pass over my body and I enjoy every second of it, but a suspicion starts to take hold in the back of my mind. What if he kissed me to get rid of the tension? What if it didn't mean anything? I sit, waiting for him to say something, but Cole is silent. I wish I knew what he was thinking.</p><p>When he finishes placing stones on my side, he says, \"Stand.\"</p><p>Without a word, I do as he says. Cole runs his thumb over the smooth skin that disappears between my legs and I gasp. \"The crystals should trail across your hips and across here, correct?\" His finger draws the curved line he intends to cover with crystals. It feels like he drew on my skin with fire.</p><p>I try to hide my emotions, and do the same thing he's doing, but I utterly suck at it. My voice quivers when I speak, \"Yes.\" That one short word betrays me. Cole is on his knees in front of me. He reaches for the crystals and the cup of adhesive and puts them on the floor.</p><p>\"Spread your legs, Lamore,\" there's no teasing nature in his tone. He sounds hard again, cold. He waits, but I don't move. He looks up at me and starts to explain. \"Part your - \"</p><p>I cut him off, \"What's with you? Did you kiss me because you wanted to? Or was there some other demented logic behind it?\" I sound angry. I don't like the way he is talking to me. His tone implies that I am nothing to him.</p><p>He doesn't look at me, \"Demented logic, Lamore. What other reason would there be? Now, let's just get through this. Please separate your ankles so I can finish?\" he looks up at me, exhausted. I don't say anything else. I spread my legs slightly and he strokes my sensitive skin with his brush. When his fingers press against my smooth flesh, I remain rigid, like he is doing nothing to me. As though the thought of his lips, his breath, that close to the spot between my legs isn't intoxicating.</p><p>When he's done, there are a million sparkling crystals glued to my body. He stops us in front of a full length mirror so that I can see. But, I don't bother looking up and begin to walk to the set he wants to use.</p><p>Before I can walk away Cole snatches my wrist, and pulls me back, \"Look at yourself.\"</p><p>\"I know what I look like, Cole. Let me go.\" I pull out of his grip. I don't want to see what I look like. It will sear the memories made today deeper into my mind. With Cole acting hot and cold, I don't want to risk it.</p><p>He doesn't reach for me again. Instead, he sets me up in a pose on the white set. I lay naked on the floor. Cole moves around me searching for angles, and I stare past him, my gaze getting lost somewhere on the ceiling.</p><p>\"You're frowning,\" Cole removes the camera from his face, and looks down at me. I try to stop, but I'm too irritated with him. Cole watches me for a moment, and then tethers his camera directly over me on a boom that swings out from the wall. He pulls a square black remote from his pocket and turns it on. Cole tests it, and I hear the shutter snap shut.</p><p>As he sets things up for the pose he wants, he says, \"Why do you always offer an escape clause?\" The sneer slides off my face and I look at him. His broad shoulders are reaching above his head as he moves the lights back away from the set.</p><p>\"What are you talking about?\"</p><p>Cole doesn't look at me when he replies. He continues moving around the set, putting things in place. \"You ask these jarring, emotionally loaded questions that demand an honest answer, but you tack on these clauses that allow the person you're asking to back out and not answer.\"</p><p>\"Again, what are you talking about? I'm tired of your games and you're PMS is giving me whiplash.\"</p><p>Cole stops and looks down at me. His eyes are glinting, brilliant blue. \"It's amazing that you're that blind - that you can't see what you do to me. I swear, Anna...\" his hands clench and he forces them open. His eyes shut tight and when he reopens them, he looks down at me shaking his head, \"Deranged logic? Really? That's easier to believe than the truth?\"</p><p>\"Oh, please,\" I say, feeling too exposed. \"Like you'd tell me the truth anyway.\" I avert my gaze, too upset to look at him, but Cole stands over me. He falls to his knees with the remote in his hand.</p><p>\"I've told you things that I never told anyone. I'd tell you anything you have the guts to ask without adding those ridiculous clauses to at the end.\" He flicks the light and the room goes black.</p><p>My heart is racing and I twitch when I hear the camera shutter. It's a prolonged exposure and I know that I can't move or I'll mess up the image. A blue light appears and he starts to move around me, running the light up and down my sides quickly.</p><p>His voice fills the shadows, \"If you asked, I'd tell you that you inspire me. Your passion ignited something within me, something that I thought was gone a long time ago. I'd tell you that I think you're too young for me. That I'll only hurt you if I act and do the things I want to do with you.\" The light is over my lips and they part. My gaze is on his face. He's close to me, kneeling, crawling around my naked body on the floor. \"Stay like that. That's perfect, Anna.\"</p><p>The question I want to ask burns in my mind, but I don't move. Cole grows quiet as he crawls around me, covering my body in light, inch by inch. When the shutter clicks again, I know I can speak.</p><p>I start to sit up, but his hands are on my shoulders holding me down. \"Don't move. Everything is perfect. I don't want to reset the pose.\" I still under his hands, and he releases me, saying, \"Ask your question, Lamore.\"</p><p>\"How do you feel about me?\" Before I can say anything else, the shutter on the camera snaps open and I'm still again. Cole doesn't respond right away. His light is next to my hair, moving in rapid sweeps over the right side of my body.</p><p>Finally he says, \"Too many things. I feel like I know you, but I'm not entirely sure I do.\" Moving to my breast, he waves the light close to my skin. I fight the urge to move, to speak. He continues, \"I feel like I want to know you more. There is nothing about you that doesn't captivate me. You're addicting, and I can't help myself, Anna. I want things from you, things I can't have. I feel things I shouldn't feel.\" His voice trails off as he moves around me.</p><p>My body reacts to his words and it becomes harder and harder to stay still. He's so close. That light sweeping over my body puts his hand just above my skin. As it passes over, I wish he was really touching me. My mind is racing with thoughts. While I know the age difference is large, I don't know why he holds back.</p><p>When the shudder snaps, I ask him, \"What do you feel, Cole?\"</p><p>He presses the button almost immediately. I barely had time to ask. He speaks as he works. A dim blue glow outlines his face. He looks haunted, pained almost. His voice is a breath, barely a whisper. He doesn't move this time. The light doesn't flash, outlining my body. He just sits there next to me on his knees, staring into the darkness, \"I feel like I'm falling in love with you Anna. And it doesn't matter what I do, I can't stop.\" He's breathing hard, looking down at me.</p><p>When he answers this time, I reach for him. I thread my fingers behind his neck and pull his lips down on mine. Cole tries to pull away, but I don't let him. I can feel him warring with himself. The tension in his back and the strength of his arms says he's trying to resist, but I hold him to me, gently stroking his lips with my tongue. When I push inside his mouth, when the kiss deepens, he melts into me. His body relaxes and Cole kisses me back, softly at first. His hands find my face and I hear the remote fall to the floor. His body lines up with mine, and I can feel his erection through his jeans. He presses against me and I moan, wanting to feel him inside of me. My hands drift down his sides, feeling the curve of his body beneath my hands.</p><p>Cole's fingers tangle in my hair. As his hands slide down my face, he touches my neck, skimming my breasts until they land on my hips. He pulls me tighter to his body and kisses me harder, sweeping the inside of my mouth with his tongue. Every kiss grows hotter, making my heart pound harder. His hands on my bare skin are sending currents through my body and I can't ignore them. I realize that I don't want to. The room is so hot that Cole's body slides against me. Running my hands under his shirt, I place my palms on his back. When Cole holds me tighter I feel safe and wanted. His fingers find my nipples and he teases me, holding them between his fingers, kissing me gently.</p><p>I gasp as he does it and arch my back to thrust my breast toward his mouth. I want him to kiss me, to taste me. There's nothing in this moment besides me and him. The lostness, the longing I've felt for so long, fades away as I feel my body growing hotter in Cole's arms. I want to feel his body moving with mine. I want to know every inch of him. I want to slide my tongue over his beautiful body and make him scream my name. Cole's kisses explode with passion. He moves like this isn't real, like I'll suddenly tell him to get off of me. His warm kisses trail my neck as his breathing increases. Another hard breath rushes from my lungs. Every muscle in my body is tense, crying out for release.</p><p>Cole shifts his weight so that one of his legs is between mine, and the other is off to the side. The muscles in his arms are corded tight as he holds himself up to keep from crushing me. I take his hand in mine and lower it slowly. His fingers are beneath mine. As I move his hand, I feel his palm slide over my stomach and down to my thigh. Cole lifts his lips from my neck. He breathes hard, watching me, feeling my skin. His palm is hot as his hand moves lower and lower.</p><p>Our eyes lock. This is more than kisses, more than lust. I feel it. I know he feels it. As his hand slides over the crystals on my lower lips, I look into his eyes. He doesn't breathe. My mouth is parted, waiting for him to reach his fingers between my legs and stroke me. My knees part and as I move his hand there, but he stops. The sound of my pulse roars in my ears. Cole breathes slowly, stilling his hand. It rests just a little too high. His thumb rubs one of the stones on my skin, hesitating.</p><p>Breathless, Cole pulls his hand away and sits up. \"I'm sorry, Anna.\"</p><p>I don't know what happened. Sitting up, I try to take his arm, but he's already pushing off the floor. I can see him in the dim blue glow of the light he was using. I roll onto my side and grab his wrist before he can walk away. Just as I grab him, the blue light flickers once and dies. There is nothing but touch and shadows.</p><p>We are disembodied voices in the dark. I can't see him. I can only sense where he is. I swear that I can hear his heart pounding in his chest. My hands search for his face. I find his cheeks and slide my hands across his strong jaw, feeling the stubble beneath my fingers. \"Cole, stop. I want this as much as you do...\" He's quiet. The tension grows between us. I lean forward until I can feel his breath on my lips. \"Cole?\"</p><p>\"Anna, I - \"</p><p>I breathe, \"Do you want me?\"</p><p>He says nothing, but he doesn't pull away. Every inch of my skin is prickling. I can't release him. Not until he says it'll never happen. The longer the silence stretches, the more my heart sinks. I finally add, \"If you don't, I'll never mention this again, but if you do... if you really think you're falling in love with me - \"</p><p>He pulls away and rips my heart out of my chest. I'm shaking, and I can't stop. I hear his footfalls cross the room. The light flips on. He tosses me my robe. It falls on the floor next to me. He doesn't turn back.</p><p>Facing away from me like I'm too difficult to look at, Cole says, \"Get dressed. I got what I needed.\"</p><p>The way his voice carries across the room makes me shudder. It's like part of him is locked away and I'll never get it. As he hurries away from me, I'm shocked into silence. I don't understand what's happening, why Cole shuts downs like this. Sitting naked on the floor, I realize that the only time Cole behaves like this is when he acts on his feelings. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>By the time I pull on my robe, Cole is nowhere to be found. I walk to my room and shower, washing off the rest of the adhesive that clings to my skin. I want to know why Cole ran. How could he say he's falling in love with me, and then refuse to touch me? For a moment, I feel sick, like maybe he didn't want me, that he just said those things to touch me - but that isn't like him. I've seen him shoot other women. Cole isn't that guy. He doesn't give or take affection lightly. The water pelts me in the face and I realize that I can't rationalize what happened. I can't make it go away.</p><p>By the time I get dressed, it's midafternoon. I pull my hair into a high ponytail and go to search for Regina. As mortifying as it is, I have to smooth things over with her. When I find her, she's in the storage area sorting through old backdrops. Her red hair is draped over her shoulders as she hunches over boxes, unpacking them one by one. Regina glances up at me as I enter the doorway and quickly averts her eyes.</p><p>Before I can say anything she straightens and blurts out, \"I had no idea you two were intimate. I thought it was a shoot.\" She drops the fabric that was clutched between her fingers. The look on her face tells me that she's equally as horrified.</p><p>I lift my hand to silence her, \"It was a shoot, but - \" I shrug like I don't know what happened \"things took an interesting turn. I would have told you, you know. If we were...\" I trail off. The knot in my throat is strangling me. If we were what, Anna? There's nothing between me and Cole, save a few kisses. In the back of my mind, I hear his voice - that hushed tone confessing that he's falling in love with me. I can't ignore it.</p><p>Regina watches me for a moment. She doesn't seem to know what to say. \"It's not my place to ask or know about anything like that. You don't need to tell me anything, Miss Lamore. I just hope that I didn't make you so uncomfortable that I lose my job.\" Regina's face flushes as she says it. The woman could have avoided me for days and never asked, but she's too blunt for that.</p><p>I smile. I like her straight-forwardness. Shaking my head I say, \"Your job isn't affected by my stupidity. I promise.\" She smiles at me and I nod.</p><p>When I turn to leave, she says, \"For what it's worth, I haven't seen Mr. Stevens with anyone for some time. You must have really turned his head.\"</p><p>I stop and look back at her, \"What do you mean?\"</p><p>She hunches over the box and goes back to work. I can tell she doesn't want to say more, but she does, \"Let's just say that his playboy ways are something of an illusion.\"</p><p>I don't know what to say, so I nod. Regina goes back to work. I walk away feeling more confused than before. I wander out of the studio, planning on going for a ride on my motorcycle to clear my head when I notice Cole's car is gone. No Porsche. I close my eyes and shake my head. What did I do? Sighing deeply, I walk over to the bike and lean against it.</p><p>It has to be me, right? I mean, Cole was in the moment and then something made him run. It was like he was sprayed with ice water. He didn't even stick around to give me an explanation. I can't figure him out and its driving me nuts. I wonder if that little shoot just destroyed our relationship. I wish I could take it back. I wish I hadn't done it. Tears sting my eyes, but I refuse to cry. I rub my eye with the back of my hand when a voice makes me jump.</p><p>\"It's beach time baby! I figured why wait until you invite me. I mean, how hard could it be to find this place?\" Emma is standing there with her head tilted to the side and a wry smile on her face.</p><p>\"Emma,\" I turn toward her and feel the tears break free.</p><p>\"Whoa!\" she says when I wrap my arms around her and start sobbing in her ear. She pats my back, \"What's wrong? What happened?\"</p><p>I shake my head, too upset to talk. Sniffling I say, \"Let's just get out of here. Tell me you drove, because I can't see straight to drive us.\"</p><p>She nods, taking me to her car on the other side of the house. When we're inside, I bite back the sobs that want to keep coming as tears stream down my cheeks.</p><p>\"What the hell happened?\" she asks, looking over at me.</p><p>\"I thought everything happened, but it turned out to be nothing. Emma, take me away from here.\" </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>We drive along the parkway. The scent of the ocean fills my head as I tell Emma what happened with Cole. She listens and doesn't say anything for a long time.</p><p>When she finally speaks, she seems confused, \"Edward seems to think you guys are still together.\"</p><p>I slam my head back onto the seat and look up at the ceiling. \"No, Em. We broke up a while ago. He took it really hard.\" Silence fills the air as the little car bobs and weaves through traffic. After a few moments I ask, \"I guess he's not doing too well?\"</p><p>She shakes her head, \"Apparently not. He said you needed space, but that you guys were fine. He's always been a bit of an idealist, but this is a little weird - even for him.\" She tilts her head to the side as she changes lanes, saying, \"Then again, it's not like I'm usually friends with his girlfriends. You know how people can act one way with one person and totally different around another. It seems like my brother's got a little of that going on.</p> <p>\"But he's not what's bothering you. Why are you so bent out of shape? I mean, did anything happen with Cole before now?\"</p><p>I shake my head, staring out the window. \"Not really. I don't know why it's bothering me so much. It's not like Cole promised me anything. I just hoped that - \" I swallow my words. I don't know what happened, but I intend to find out. Things can't stay like this between us. I don't want to push Cole, and I don't want to take something he isn't willing to give. I just wish I knew why. There's something between us, something preventing him from acting on his feelings. I feel it stuck there like a chasm that will swallow us whole.</p><p>Silence fills the car. Emma finally says, \"You really like him, don't you?\" I nod. She laughs, \"When you first met him, I thought you hated his guts. You did a 180 pretty fast, Anna. Even for you.\"</p><p>\"Even for me? What's that supposed to mean?\"</p><p>\"Nothing bad,\" Emma says. \"Don't take it like that. There are two types of people that flip that fast. The first group is the flakes, the people who don't know what the hell they want. That's not you. You're in the second group - the people who know exactly what they want, but they can't find it.\"</p> <p>\"The thing is, I think I have found it. Cole isn't like anyone I've ever known.\" He's passionate, driven, powerful.</p><p>\"He's kind of old for you, isn't he?\"</p><p>\"Thanks for stating the obvious, Em.\" I snap. \"Sorry,\" I say pushing my hair out of my face. I look over at her. \"Do you think that's why he's acting the way he is? Because I'm too young?\"</p><p>\"Anna, if I ever have a clue why a guy does anything I'll die of shock.\" She darts between cars as we drive toward the city. She glances at me before jerking the wheel back, \"One thing is certain - he thinks you're hot and is too chicken to act on it. You can either forget the whole thing happened or corner him and get your answer.\"</p><p>That sounded like a bad idea. Cornering Cole. I shiver thinking about it. We drive in silence when it finally dawns on me that Emma drove two hours to see me and didn't call first. I glance at her, just noticing that she seems happy, but is trying to hide it. A lopsided smile spreads across my lips, \"You're awesome, you know that?\"</p><p>She laughs, \"Yup! But what'd I do?\"</p> <p>\"Something major had to happen for you to come all the way out, without a phone call...\" I smile at her, waiting for her to tell me. When she grins, I know I'm right.</p><p>\"I got a job! It's mine, Anna.\"</p><p>\"That's great! Is it the one you wanted, over at the paper?\"</p><p>Emma's giddy now. She nods, \"Yup! All I have to do is finish the internship, graduate, and it's onto the lowest branch of the newspaper totem pole.\" She squeals and I can't help but feel excited for her. \"It's perfect, Anna. And oh my God! You should have seen me at the interview. I nailed it! Like, totally nailed it! I'll be working alongside Stacy James - \"</p><p>\"No way,\" I say leaning forward.</p><p>Nodding enthusiastically, she slaps her hands on the steering wheel and squeals, \"I know, right? He'll oversee the internship and I'll start getting my own stories in a few months. It's totally perfect!\"</p><p>\"I'm so happy for you, Em. I know how much you wanted this. You're gonna rock it. Just imagine, your own newspaper article with a little square picture of your head. It'll be retweeted worldwide and you'll become an overnight sensation.\"</p><p>She snorts, \"That's why I was coming to get you! I knew you'd be the perfect person to celebrate with!\" She glances at me, \"I have a beach bag filled with towels, bikinis, and trashy romance books. My original plan was to lounge on your beach, but I think some time away from Cole will help your brain work better. We need a Cole-free zone. Why don't we detour to Jones Beach and hang out for a while? You can relax and I can celebrate.\"</p> <p>Leaning my head back against the seat, I say, \"That sounds completely perfect.\"</p><p>Emma cuts across six lanes of traffic and I think I'm going to die. We make it onto the exit ramp for the beach and we both start laughing. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The beach is one of my favorite places - when it's empty. Today it's overflowing with people. Emma parks in a distant field and we pick a spot on the sand between several other sun-seekers. I lift my face and breathe in deeply. The sound of the ocean fills my ears, as the salty breeze lifts my hair. Emma throws down the towels and smooths them out. While Em runs off to change, I lay down on the towels in my tank and cutoff jeans, adjusting my sunglasses so they're in the right place. As I lace my fingers behind my neck, I close my eyes.</p><p>This is perfect. It'll give me time to think, to decide what I want to do before I see Cole again. Part of me wants to ignore the whole thing and not deal with the drama, because since I met Cole I've noticed that is the one thing he promises - lots of drama. I'm not sure if I'm up for that. Especially with the way my life is. I have plenty of drama on my own. Kicking it up a notch with Cole might make my head implode.</p><p>You're a coward, Anna, a voice whispers in the back of my mind. Maybe I am. Maybe Cole's not the right guy, but as soon as I think it, I know that's wrong. Cole feels right.</p><p>The sound of his voice makes me jump, \"Anna,\" Edward says. His shadow falls over me. I squint up at him, wondering how he spotted me. I'm packed between tons of people and after what Emma said, I really don't want to talk to him right now.</p> <p>I push myself up onto my elbows, \"Hey. Em just ran to change. She'll be right back.\"</p><p>Edward stands there frozen, hands on his hips, wearing a blue swimming suit that shows off his body. He has a deep tan that suggests he's already been here for hours. I wonder if Emma knows he's here, if she's trying to make our paths cross. My stomach twists. That can't be right. She planned on staying out in the Hamptons, not coming here.</p><p>\"I know,\" he says, running his hands through his hair. \"Actually, I came to see how you were doing. It's been a while.\" Actually, it hasn't, but he seems sweet enough.</p><p>Making my hand into a visor, I press it to my forehead so I can see him. The sun is behind his back. \"I'm good. Working a lot, but good.\" I pause and try to look at his face again. Something about the way he's standing makes me uncomfortable. I can't decide why. I clear my throat and ask, \"How's school? Staying out of trouble?\"</p><p>Raising his hand to his face, he grins down at me. I can see his eyes now. \"School's fine. Good. I heard you were staying out in the Hamptons for the summer?\"</p> <p>\"Yeah, for the internship, remember?\" He nods. I don't understand why he acts like I never told him about it. I did. I remember the conversation. \"I thought I already told you that?\"</p><p>He smiles sheepishly, \"You did. I just panicked and didn't want to walk away, yet. Anna...\" his tone is too soft, beseeching. It kills me to hear it.</p><p>Before I can say anything, Emma walks up behind me and seems surprised to see her twin, \"Hey, Eddy. What are you doing here?\" She turns her head both ways, looking for the rest of his friends, but turns back to her brother with a raised brow.</p><p>\"Just hanging out.\"</p><p>\"Cutting class, no doubt,\" Em retorts. She grabs a huge pair of black plastic sunglasses from her bag and slides them on. Her black bikini makes her look like a super model. As I look around, I see many male eyes on Emma, no doubt wondering if they should try and talk to her.</p><p>My phone rings. I pick it up and look at the screen. Cole. I send it to voicemail. I can't talk to him now. Edward is watching me as the conversation with his sister commences.</p> <p>\"As are you, unless the paper fired you already - \" He knew how to press her buttons. His words make Emma puff up, ready to fight.</p><p>\"For your information, I got the job and Anna and I are out celebrating. So go dig a hole or something and leave us alone.\" She makes a face at him and points, indicating he should leave.</p><p>Edward smiles, \"Is that so? Well, good for you, Sis. Good for you.\" He looks over at me and nods, \"See you around, Anna.\"</p><p>I nod back, watching him leave. Part of me wonders if I made a mistake, if Edward was the right guy. It seems like a minor thing, after all, a relationship isn't just about sex. Most of the time a relationship is spent doing other stuff, stuff that I enjoyed with him. Internally, I groan. I sound like an eighty-year old.</p><p>Emma is leaning back on her hands, people watching. \"There are a lot of hot guys here, Anna.\" Her gaze is locked on a group of young men a few towels down.</p><p>\"Then go get them, Em. I'm not in the mood.\"</p><p>\"Psh,\" she says, swatting me. \"You're never in the mood. It just means you haven't found the right guy yet - one who lights a fire in your panties and makes your heart bounce around in your chest until it feels like you'll keel over and die.\"</p><p>I stare at her blankly. I do feel like that about one guy. That is the problem. I laugh and shake my head, \"Do me a favor and just take the guy you're picking out for me, too. I seriously doubt he'll mind.\" I'm joking, but Emma has a devilish smile on her face.</p> <p>\"We'll see about that.\" She stands up and brushes the sand off her lean legs. Without another word she strides toward the group of guys playing volleyball. Her sights are set on a man that is clearly my type and not hers. I straighten and watch her in horror as she stops behind him. The guy turns and looks at Emma and then back at me. He nods, listening to her and then smiles at me. I return his smile, but feel foolish. Emma is a dead girl as soon as she comes back.</p><p>They talk for a few minutes. The guy is forced out of the game when his friends resume it without him. He follows Emma back toward our spot and says, \"You're friend here invited me to join you for a little bit.\"</p><p>\"Mmm,\" I eye Emma and mouth, I'm gonna kill you, when the hot guy turns to look at his friends, but she just swats her hand at me.</p><p>\"I'm Jesse. Jesse Oden.\"</p><p>\"Anna Lamore,\" I reply feeling silly. Jesse looks like he's in his early twenties. It's clear that Emma is telling me to stick with guys my own age. I hate it when she does stuff like this. I decide to curtail the whole thing, \"Listen, Jesse - I don't know what she told you, but - \"</p><p>He smiles down at me. \"She didn't tell me much of anything. Just that you were her friend and I was your type. So I thought I'd come over, say hi, and see if we hit it off. If not,\" he shrugs, \"no harm. Right?\"</p><p>I'm shooting daggers at Emma, who's standing behind him and nod slowly. Why does everyone need to prove a point with me lately? Am I that thick? Internally, I moan, but he's too nice. I smile at him and nod, \"Sure. Why not?\"</p><p>As it turns out, we have a lot in common and soon I find I'm laughing and talking to him because I want to, and not for any other reason. Emma runs off into the surf after a few minutes and leaves us alone on the towel. Jesse sits down next to me. He is my totally type - dark hair, blue eyes, and completely breathtaking. His smile is so perfect he could be on a toothpaste commercial.</p><p>Goosebumps pop up on the back of my neck. For some reason I feel uneasy, but it has nothing to do with Jesse. I shiver, and brush them away. Turning, I look around through the mass of people. It feels like someone is watching me, but I don't see anyone staring. There are people everywhere. It's stupid to get spooked like this, but I can't help it. I ignore the sensation and go back to talking with Jesse. He makes me smile.</p><p>\"No way,\" I say, shocked, pulling my feet closer to my bottom, \"when did you graduate?\" I wrap my arms around my knees as I talk.</p><p>\"Last year. Oh, I know where it was! I sat in front of you in art history with Peters. I thought you looked familiar.\" He is convinced he saw me on campus, but I can't place him. That isn't abnormal since the university is huge. So are the classes. However, in this case, I am just obtuse.</p><p>\"Oh my god! That was you? That was you!\" I laugh, shaking my head. \"Small world, huh?\"</p><p>\"Apparently so. Good thing for us, right? I mean, what are the odds? Out of all the places to park and then set your towel, what are the odds it'd be by mine?\" He flashes me that movie star smile. Jesse is so sweet.</p><p>\"Well, it must be fate, because I have no luck.\"</p><p>\"I think you might have a little,\" he leans closer to my face and brushes a kiss against my lips. I'm stunned, but I don't move. A thousand thoughts rush through my mind and each one stems from Cole. I feel caught in the middle. Jesse is the kind of guy that I would go for. Emma did well, but I don't want to give up on Cole.</p><p>I don't kiss him back.</p><p>Jesse hovers for a moment, his warm lips waiting for me. When I don't kiss him, he pulls back. Jesse smiles and runs his hand through his hair, looking at the waves in the distance, he says softly, \"Guess it's not the right time for us, is it?\" Through lowered lashes I glance up at him and shake my head. \"Well, whoever he is, he's lucky. I hope he knows it.\" He pushes off the towel and stands. \"I really liked meeting you. If my luck changes, let me know.\"</p><p>He hands me his number, and I take it.</p><p>I watch Jesse walk away and wonder what I'm doing. I just turned down an awesome guy after Cole made it clear he doesn't want to be with me. Staring at the waves, I decide that I have to find out why. There has to be a reason. It makes no sense for Cole to have that little moment of truth scene and then douse it with outright rejection. There has to be an explanation. Part of me shies away and doesn't want to hear it, but I can't leave it alone. I can't leave Cole alone. There's something about him that captivates me, something worth fighting for. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Emma drops me off at the new studio, and as I walk in a blue uniform catches my eye. The mailman is standing by the desk with a large envelope, alone. \"Can I help you?\" I ask.</p><p>He nods, \"Thank God. Where is everyone?\" Shaking his head, he thrusts the parcel at me and hands me a pen. \"I was about to leave, but this needs a signature.\"</p><p>\"Thanks for waiting for me. I know you didn't have to and I really appreciate it.\" I smile at him and his gruff curtness seems to melt despite my appearance. I'm sure I look like I'm crazy - windblown hair frizzed out along with a cherry glow across the bridge of my nose - but he doesn't seem to notice. It must be part of having a mail route in the Hamptons.</p><p>He nods once and says, \"Sure thing. Have a good day.\" He leaves me standing alone in the lobby with a fat envelope.</p> <p>I've been wondering why there only seems to be three people working here. I've been assuming that I just keep missing the others, especially since Cole said the NYC crew was sent out here, but aside from the first few days, they seem to have disappeared.</p><p>I glance down at the letter in my hands. It is from J. H. Hashre, esq., and stamped TIME SENSITIVE MATERIALS ENCLOSED with an \"open by\" date of today. What is this? Looking at the envelope, I think about opening it, but it is addressed to Cole, not the studio.</p><p>As I walk through the building, I flip on lights looking for him. Regina isn't around. She must have finished her work and went to dinner. I stop in the shooting room and look around. Memories of earlier in the day flood my mind. His hands on me, his lips. I want more of that - more of him.</p><p>\"Miss Lamore,\" Cole's deep voice echoes through the space. He stands across the way on the other side of the shooting room in an adjoining hallway.</p><p>\"This came for you. It looks important. Thought you'd want it.\" I cross the room and place it in his hand. When he looks down at it, he stiffens.</p> <p>\"Thank you.\" He turns to leave, but I grab his arm. Cole stops and looks down at my hand on his skin.</p><p>\"Tell me,\" I demand, my voice firm. I fold my arms over my chest and look at the side of his face. \"Tell me how you could do those things, say those things, and then walk away like it meant nothing?\"</p><p>His eyes meet mine, \"Because we don't belong together, Miss Lamore. Because it would be a horrible mistake to do more, to say more, than I already foolishly said. There's no future here,\" he gestures between us, \"nothing to pursue. I apologize for not controlling my tongue. There's no excuse for it.\"</p><p>Each word feels like a barb in my heart. \"I see.\" My voice quivers slightly. I don't understand. How is it a mistake? I have no idea, but from the look in Cole's eyes I can tell there is no way to convince him otherwise. I lower my head and look at the floor, at his bare feet. Cole seems like he can't wait to get away from me. He shifts his weight from foot to foot, looking anywhere - everywhere - but at me.</p><p>Finally, I say, \"Maybe I should work somewhere else?\"</p><p>That catches his attention. His brow pinches together, \"Did Sottero talk to you?\"</p> <p>\"No, Cole. She didn't. I just thought that maybe it would be too awkward to stay here, that I should - \"</p><p>He shakes his head, \"Anna, I won't be here much longer. It's only a few more weeks.\" He taps the envelope against his thigh and I glance down at it. \"I promise that it won't happen again. Regina can show you a lot of what you need to know, and as for your skills - I think you'll be perfect for this position. I really hope you'll stay.\" As he speaks his voice softens.</p><p>\"Cole, I don't understand why you want me to work here. There are more qualified people, honestly. And the staff...\"</p><p>He looks up at me confused, \"What about the staff?\"</p><p>\"Where are they? I thought you had more people. When we were in the city, you said they were out here, but now that we're out here, there's just Regina.\"</p><p>His gaze falls to the floor and he breathes in deeply. Shaking his head he says, \"There are some things going on, some things that require me to make changes. I made them. And I only kept the best.\"</p><p>\"Cole,\" I whisper his name and see him respond to my voice. I want to touch him, to push his hair back and open that letter than hangs in his hand like a lump of lead. That has something to do with this, I can sense it. But, before I can say anything else, he turns away.</p><p>\"There's a shoot in the morning,\" he says. \"Better get some rest.\"</p>  </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>The shoot the next morning feels tense. Cole's out of sorts and silent. I speak for him, and take over the shoot without him asking me to. At one point he hands me the camera. \"Time to show off, Lamore. Do your best. I have what I need.\" Cole moves to the back of the room and presses a button. Regina shows up and he disappears into the back, out of sight.</p><p>The client is patient. She knows of Cole and his work, and she trusts him. She doesn't bat an eye at Cole handing the shoot over to me, which makes me even more nervous. Why does everyone think I can do this but me? After a few poses I feel less nervous. I start to see what I want to shoot and I forget that I haven't shot on my own yet. I don't worry about Cole yelling at me for messing up the session. He trusts me, maybe too much. I glance around wondering where he went.</p><p>The client and I chat about lots of things until she asks, \"Has Cole shot you?\"</p><p>Her question takes me by surprise. I nod shyly, my cheeks flaming, \"As a matter of fact, he has. Although I haven't seen the results yet.\"</p> <p>She grins, \"I hope you show off his work. There's something about the mind of an artist like Cole. I don't know. It's like he's broken and it just makes me want to fix him. At the same time, if he weren't so messed up, he couldn't create such beautiful work.\"</p><p>She laughs lightly and I stare at her. Is that what draws me to him? Cole's broken. He was abandoned by his parents, leading life totally alone - a life that no one knows about. Cole has been on his own since he was eighteen, since that picture of him in the army uniform. And now something else is happening to him, something that is weighing on him. She is right. I want to fix it. I want to let Cole know he's not alone.</p><p>The session continues and I steer the conversation away from Cole. Although I don't know where he's gone, I'm not sure if he can hear us. And a level of protectiveness washes over me when she talks about him like that. I don't know what's tormenting Cole, but I can't make light of it the way she does.</p><p>When she leaves, I try to find Cole, but I only see Regina. After the client leaves, Regina moves to the front desk to answer the phone and return calls.</p><p>\"Where the hell did Cole go?\" I ask.</p> <p>She looks up at me, \"I tried to ask, but he took off without a word. He looked pissed, Anna. What happened?\"</p><p>Wide-eyed, I say, \"Nothing. We were shooting, and then he shoved the camera in my hands and walked out. I didn't do anything.\"</p><p>Irritated, I push through the front door and walk outside into the afternoon air. The salty smell of the ocean fills my lungs as I walk down the path behind the studio. My heart falls into my shoes when I see him. He's sitting on a bench between two massive pines with his head in his hands, shoulders hunched toward the ground like he's utterly defeated.</p><p>I'm certain he knows I'm there by the time I step next to him, but he doesn't move. To see him like this consumes me with grief. It feels like there are two hands on my throat, pressing away the air. I slip onto the bench next to him. Looking at the scattered pines that stand between us and the ocean, I ask, \"How long did it take you to pick this property for the studio? You wanted it for a while, didn't you?\"</p><p>He doesn't move. After a minute, he turns his face slowly toward me, \"How'd you know?\"</p><p>I shrug, \"It just seems like you're familiar with this place in a way that someone who's been here before would be. Maybe more than once.\" He smiles but it fades too fast. He rubs his hands through his hair and sits up.</p> <p>\"I came here a few times when I was younger. I told myself that if it went up for sale, that I'd get it. Everything about this place reminds me of things I love.\" He shrugs. \"I didn't think I was that transparent.\"</p><p>\"You're not,\" I reply. He arches a brow at me like he doesn't believe me. \"That's the only thing that I figured out and I wasn't even sure I was right. \"So, do you want to tell me why you walked out of the shoot?\" He blinks once at me and returns his gaze to the ground. The expression clearly says NO. \"Okay,\" I say, \"Well, at least tell me you're leaving next time.\"</p><p>\"There won't be a next time,\" he says and glances over at me, \"I'm going back to the city. You can do this. I don't need me to be here anymore. Besides, there's something that came up and it would be easier to deal with if I were at Le Femme and not here.\"</p><p>My mouth hangs open and I try to snap it shut, but shock washes over me too quickly. After one solo shoot out here, he's leaving? Cole says nothing else. I don't know what to say. It feels like I should be excited, but I'm not. Everything feels wrong.</p><p>\"So, it's just me and Regina?\" He nods and doesn't look up. His gaze is on the ground, on the pebble path beneath his feet. \"Cole,\" he lifts his head and looks at me. I want to take him in my arms and hold him. \"You don't have to be alone.\" He laughs when I say it, but it sounds so tormented that I want to cry. \"I'm serious.\"</p><p>\"It's not an option for some people, Anna.\"</p><p>\"Fine,\" I say and his dark laughter gets cut short. \"Let's accept it. You and I are alone. We rely on no one. We sleep alone, if we sleep at all.\"</p><p>\"What are you getting at?\" he asks.</p> <p>\"Just that life doesn't have to be so damn lonely.\" My eyes meet his and I can't look away. Those endless pools of blue pin me in place. Inside my mind I'm pleading with him, begging him to let me in, but I say nothing. There's nothing more to say. Standing, I turn to him and rest my hand on his shoulder, and pause. There are so many things I want to say. I feel the words in my mouth, but I say none of them. My hand slips off his shoulder. I walk away and Cole lets me. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Weeks pass. I shoot at the studio and the only person to keep me company is Regina. I try to work, to take care of the clients as best I can, but my mind keeps returning to Cole. I can't get him out of my head. Picking up my phone, I walk back into my room, and pull up his number. I've done this so many times, but I never press the button. As I sit down on my bed, I hold my thumb over his name. One touch and it will call him. I'll hear his voice again. Sitting perfectly still, I know I can't do it. There are too many things with him, things that can't be said over the phone. I have to be there to convey them in person. Why I let weeks go by is beyond me. Maybe I am a coward. Annoyed with myself, I throw the phone on my bed and pull on a pair of jeans and a tank top. I yank my hair into a ponytail and head toward the garage for my motorcycle.</p><p>The ride into the city passes in a blur as I think about what I'll say, what excuse I'll give for showing up on his doorstep unannounced, but I can't ignore it anymore. The closer I get to Manhattan, the darker and cooler it becomes until tiny droplets of water fall from the sky. The streets become slick as glass. The little sunlight that was left is gone and the street lights turn on. By the time I pull up in front of Cole's building, the sky has opened up and I'm totally soaked. My black tank clings to me like a second skin. My jeans are holding an extra ten pounds of water, making them feel stiff and heavy. I park the bike and slosh to the door. Before I can step inside the doorman stops me.</p><p>\"Cole Stevens,\" I say and try to walk past him.</p><p>He's standing under the portico, perfectly dry, and doesn't let me pass. He glances at me once and says, \"I'm sorry, but Mr. Stevens isn't expecting anyone tonight.\"</p> <p>\"I know,\" I reply, pushing my sopping wet hair out of my face. The guy looks at me like I'm nuts. \"I didn't tell him that I was coming. Can you just tell him that I'm here?\"</p><p>He shakes his head, \"I'm sorry Miss. Better be on your way.\"</p><p>I'm about to protest when I see the valet pull up in Cole's black car. I turn toward the doors with a slow smile spreading across my lips. Finally, something is going to work in my favor. Cole will step outside and see me. We'll talk and everything will be better.</p><p>But that isn't what happens. Cole walks through the door dressed in a black tux. He looks stunning. My lips part as my jaw drops and it's all I can do to keep breathing. The way its cut, like it was made just for him, showcasing every angle of his perfect body. His dark hair is smoothed back, away from his blue eyes. He extends his elbow and a woman in a red gown follows him out.</p><p>Just as reality slams into me, just as I realize her couture dress and shoes, her status - Cole sees me. The expression on his face falters as our eyes meet. I feel the desire in that gaze, the pull on an imaginary line that runs between us. That same line that's been tugging me back to him ever since he left. But Cole doesn't say anything. He keeps walking, and helps the beautiful woman into his car. When her door closes he looks up at me.</p> <p>Our eyes meet and I feel like I'm going to be sick. In every single way possible, I don't compare to her. Her elegance, her grace, her fluid movements scream of refinement that is the prideful trademark of the wealthy.</p><p>Before I can walk away, Cole says to the doorman, \"Show her in. I'll be back shortly.\"</p><p>The doorman nods, surprised, \"Yes, Mr. Stevens.\"</p><p>I'm deposited on the doorstep of Cole's apartment and walk inside. It's vacant.</p><p>Shivering, I wait in the kitchen, dripping on the floor, thinking he'll be right back. But Cole doesn't come right back. I wait in my sopping wet clothes, overemotional and tired. After grabbing a few towels, I set them beneath me and sit on his couch.</p><p>Before I realize what's happened, Cole's voice is in my ear. \"Anna, wake up. We need to get these clothes off you. You're freezing.\"</p> <p>Bleary-eyed, I looked up at him. He's still wearing that tux. I feel horrible and completely frozen. My arms are plastered close to my body and I can't stop shivering. I let him pull me to my feet and turn on a hot shower for me. By the time I finish, it is well after one in the morning. I wrap the towel around my body and walk out into his room.</p><p>Cole has removed his jacket and tie. The crisp white shirt is open at the collar. Cole is sitting in a blue leather chair in the corner of the room, his hand on his temples.</p><p>When I step into the room, he looks up. His eyes soften, \"Feel better?\" I nod, clutching the towel to my chest. \"Good. You want tell me why you were riding your motorcycle in the rain?\" he says, and anger vibrates in his voice.</p><p>\"It wasn't raining when I left.\"</p><p>\"It was stupid, Anna.\" His voice is clipped, tension lines his shoulders.</p><p>I mutter, \"I do stupid things, Cole.\" Like continuing to think about you when you obviously have better things to do. I want to fight. I feel it inside of me, the tension waiting to explode.</p><p>He glances up at me. His expression is soft, serious, \"You're staying here tonight.\" It's a statement. A fact.</p><p>\"I am?\" I don't want to leave, but something about the way he says it grates.</p> <p>\"You are. Let me get out of this and we can talk.\" He rises and goes to his closet. He grabs some clothes and tosses me a white tee shirt. \"You can sleep in that.\"</p><p>I put it on while he's in the shower and climb onto his chair. I'm so cold, I can't stop shaking. Cole takes forever in the shower. At least it feels like forever. Between being an emotional lunatic, the long ride into the city, and the rain, I can barely keep my head up. Resting my head on the arm of the chair, I fall asleep again.</p><p>Cole's voice rouses me, but I don't fully awake until I feel his hands slide under my cold skin. \"I can't let you freeze in a chair.\" He deposits me in his massive bed and buries me beneath blankets, but I still shiver. After a moment, I feel him sit next to me. His hands move down my sides, tucking me into the blankets so tightly that I can't move.</p><p>He looks down at me, \"Better?\"</p><p>I nod. \"Thanks.\" I don't know how I feel. I don't know what I want. Part of me wants to just lay here and see what happens.</p><p>My heart flutters when his hands tuck the blankets. Did he really put me in his bed? The last time I was here, Cole gave me a guest room. This time he is sitting next to me and we are in his room. In his bed.</p><p>\"I hope I didn't mess up your evening. She was very pretty, Cole. I'm really sorry.\"</p><p>He glances away and says, \"You didn't mess up anything.\" His voice is soft, like he wants to say more about it, but he doesn't. \"So, what was so important that you drove here in the rain?\"</p><p>I try to shrug but I'm cocooned in blankets. Drowsiness is pulling at me hard. My eyelids feel like lead. \"I had a bad feeling that something was wrong. It just felt like you needed help. I can't explain it. It makes no sense. So I jumped on my bike and came to make sure you were okay.\"</p><p>He's looking straight ahead when he answers, \"You have impeccable timing... keeping me from making hideous mistakes.\" He grins down at me, dark hair falling into his eyes.</p><p>\"Mmmm, maybe - but she looked way less than hideous to me.\"</p><p>Cole laughs. His entire face lights up. \"God, I missed you, Lamore.\"</p><p>And I know he means it. I don't press him on who the woman was, because I'm the one who is in his bed.</p><p>Cole lays on his side next to me and I can feel the change in him as we lay there and talk. The tightly wound muscles in his neck seem to relax as minutes turn into hours. Sleep pulls at me, but I don't surrender.</p><p>After a while, I roll onto my side and we're facing each other. Cole's head is on his pillow, his bright blue eyes blink slowly like he's exhausted. \"You're right,\" he says.</p><p>\"About what?\"</p><p>Smiling, he lowers his dark lashes and replies, \"Everything, Anna.\"</p><p>There's a pang of pain in my heart when he says it. They are the words I'd hoped to hear, but not the right tone. His voice says he can admit it, but I know he's still holding me at arms-length, in the safe zone.</p><p>There is no way to get closer to Cole, and I know that's where I want to be. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Stretching, I blink a few times as my heart pounds in my chest. I gasp and sit up quickly.</p><p>\"Forget where you were?\" Cole asks from the leather chair. He's already dressed, sitting with an e-reader on his lap.</p><p>Breathing hard, I smile sheepishly and relax. \"Maybe,\" I grin. He's smiling now, watching me.</p><p>\"I never thought I'd get you in my bed, Lamore,\" he jokes, shaking his head. That soft smile makes his eyes shine like he's happy.</p> <p>\"Yeah, well, even you have to get lucky once in a while,\" I laugh. My fingers caress the silky sheets. The thread count has to be close to a zillion. They feel like butter, soft and supple under my palm. I fall back onto the pillows and look at the ceiling. \"I'd better get going. My boss is going to be pissed. I didn't call in sick today and I'm going to be close to three hours late by the time I get there.\" I stare at the ceiling, noticing it has a pearlescence that makes the room have a soft glow.</p><p>\"Yeah, I heard he can be a dick. You might want to hurry up and get out here, take care of your clients, and maybe he won't chain you up in the basement for being so damn late...well, not for more than a few nights anyway.\" The corner of Cole's lips pull up. It's a sexy smirk that makes my stomach flip. His fingers tap the e-reader, and he lifts it, his eyes scanning the lines, but I saw the screensaver and know it's not even on.</p><p>When he looks up, our eyes meet. My heart shudders like I'm being electrocuted. Our gazes lock and heat sears through my stomach and between my legs. The room suddenly feels overly warm. I want to push back the blankets and walk away. I don't want him to have this effect on me, especially because it seems to be mostly one-sided. I can't hold him like that. Hell, I can't even get him to kiss me. These thoughts run through my mind as his blue eyes bore into mine.</p><p>It feels like he can see every inch of me. I realize I'm not breathing and suck in a shaky gasp. My entire body is tingling. I break the gaze and throw my feet over the side of the bed and stare at my toes. What am I doing? Why am I chasing this guy? He's too screwed up to ever be with, and yet - I can't walk away.</p><p>\"Lamore?\" he says my name and I glance over at him. He's leaning back in that chair like nothing happened, like he doesn't feel anything.</p> <p>\"Yeah, boss?\" I pull my lips into a smile, but it feels hollow. I glance at him from behind a wall of frizzy dark hair.</p><p>\"What time is your last shoot today?\"</p><p>I think about it for a second and say, \"Six. Mrs. Patterson wants me to shoot something sexy with her Pomeranian. You knew how bat-shit crazy they are out there, didn't you? Sexy pictures with a dog. There must be something in the water...\" I'm talking to myself now, shocked at the strange requests people have. It's like no two people can agree on what's sexy. \"What the hell am I supposed to do with a dog?\"</p><p>Cole ignores my bewilderment, \"I'll come by at eight and you can show me your work. I'll help keep you on track when stuff like this comes up. The best way is to shoot it the best you can and then talk about what to do next time. And since I failed to feed you breakfast, I'm taking you to dinner.\" He sets the e-reader down as he's speaking and stands. As he finishes the last word, he's standing in front of me. \"Assuming you eat dinner and don't have other plans?\"</p><p>The spot between my brows pinches and I look up at him. He's holding a white slip of paper between his fingers. It has ten black digits and the name JESSE OWDEN, slightly crumpled and linty from a spin through the washer and dryer. I glance past him, annoyed that he went through my clothes, but I can tell he washed them for me. My clothes are folded neatly on Cole's dresser. The paper was left in my pocket and got soaked, but any idiot can tell what it was.</p><p>\"Not tonight,\" I hedge, not wanting to say anything. I stand and realize that he's much taller than I am. I pluck the slip from between his fingers.</p> <p>\"Want to tell me who he is?\" he asks, his arms folding over his chest, his head tilting to the side like I've done something wrong.</p><p>I mirror his pose. Folding my arms, I tilt my head, and say, \"Want to tell me about the hot chick in the red gown?\" We stare at each other, each of us driven to hide our secrets. The tension in the air is thick, coating us until my hairs are standing on end.</p><p>Cole folds first, \"Well played, Lamore.\" His arms unfold and he looks into my eyes. The gaze is so vulnerable, so sweet that I can't believe it belongs to Cole. \"I'll see you at eight.\" With that, he turns and walks away, leaving me alone in his room to get dressed. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>During the shoot my brain is all over the place. I can't focus. The little dog yips every time I go to fix the pose. Posing dogs is like trying to teach a Frisbee to walk.</p><p>\"Regina, please reset the dog,\" I say, pressing my temples with my fingers. For a split second I imagine myself fanning a brides train and the happy couple smiling back at me. Then I look down at Mitsy who thinks biting constitutes talking. She nips at Regina as she repositions the dog by her master's hand.</p><p>The pose is perfect. I chose the white set and have the client laying face-down on satin sheets. She's propped up on one elbow slightly. The pose shows off her curves without being too revealing. It's the kind of pose that looks seductive. It works perfectly for her. Everything is white on white, with layered textures. Linens, lace, throws and silk pillows are strewn through the set. It's completely perfect. Even the little dog helps pull the shot together. His snow white fur adds just the right about softness, but the little beast won't sit still.</p><p>Regina picks up Mitsy. The little dog bares her tiny teeth and is very unhappy to be placed back on the bed. Regina runs off the set and I shoot. Working fast is new to me. Normally, I take all the time I need. When I think I have the shot, we move on. The final piece is going to be a high key black and white. Everything is pale from the client's skin to the dog's fur. She wears nothing but a white thong. Her implants make her look like she is twenty, even though those years of her life are at least a decade behind her. She holds the dog in her arms, its fur concealing helping conceal her breasts. The dog is happy in her arms and the owner looks straight back into the camera, staring at the lens. The finished product will be striking.</p> <p>Later that night, Cole arrives and thumbs through the unprocessed shots with me. When he gets to the end of the shoot he stops and looks at the poses with the dog in her arms more carefully. He leans in close to the screen with me sitting in front of the computer.</p><p>He taps a pen to his lips, \"Open it.\" I double click the image and it opens in an editing program. \"Show me what you plan to do.\"</p><p>My hand moves on the tablet, clicking settings and altering the image to black and white. I adjust a few settings, run a few of Cole's actions to smooth her skin, and then pump up the contrast. \"What do you think? The dog threw me for a loop. I didn't know what to do with it, and the stupid thing wouldn't sit still.\"</p><p>He leans over my shoulder, his gaze on the screen. He puts a hand on my shoulder. It feels warm and strong. His scent fills my head and I think back to last night, to laying in his bed and sleeping right next to him.</p><p>\"I think this is amazing. I mean, people ask us to do and shoot all sorts of things, but this - damn Anna...\" he strokes his chin, staring at the screen. \"You even made the dog look sexy.\" He laughs and looks down at me.</p> <p>I beam, \"Thanks, Cole. That means a lot to me.\" The weight of his hand suddenly feels like something more. My skin tingles and I want him to touch me, to stroke my face with his hand. Cole watches me with that expression that I can't read.</p><p>He pats my shoulder before stepping away, \"No problem. I knew you had a talent for this before I even met you. Some people just have it. You're one of them. You're lucky, Lamore.\"</p><p>\"Yeah, well, not so much. Actually, me and luck are strangers. Maybe even enemies,\" I joke. I put things away for the night and shut down the editing program, the screen glows dimly before its light goes out as the computer powers down. I reach for the scattered pens and papers on my desk, and shove them into a drawer. \"If I saw Luck on the subway, she'd probably mug me. Nothing lucky has ever happened to me.\"</p><p>Cole has that smirk on his face as he listens. He slides his hands into his pockets and tilts his head, \"Oh, I don't know if I'd say that. Luck's the kind of thing most people notice in hindsight. It's hard to see it in the moment.\"</p><p>I stop what I'm doing and turn to look at him. He's oozing with boyish charm. Everything from the way he stands to the curve of his mouth makes my heart race. I shake my head, trying to evade his charms. Why am I tormenting myself by hanging around him?</p><p>\"And at this moment, am I lucky? Is there something happening that I can't see?\" I pull a folder to my chest and wait for him to answer.</p> <p>\"Maybe,\" he says, voice soft and sensual.</p><p>My eyebrow lifts. I stand there for a moment at a loss for what to say. I hug the folder tighter. His eyes drift toward my hands before he turns away, nodding his head toward the door. \"Come on, Lamore. Dinner. Now.\"</p><p>I place the folder down and follow him out. As my hand flips off the lights, I wonder when I became so obedient and discover that I don't care. If it means being around Cole, and seeing him happy, I'll jump when he snaps his fingers. At least a little. It goes against every fiber of my being to let someone else be in charge, but with Cole, it feels comfortable. </p> </body></html>", "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"utf-8\"/><meta content=\"width=device-width, initial-scale=1, maximum-scale=1, user-scalable=0\" name=\"viewport\"/><link href=\"https://fonts.googleapis.com/css?family=Open+Sans|Roboto\" rel=\"stylesheet\"> <style type=\"text/css\">img { max-width: 100%;}body {font-size: 1.2em;font-family: \"Open Sans\", sans-serif;}h2 {font-family: \"Roboto\", sans-serif !important;}* {-webkit-user-select: none;}</style></head><body> <p>Somehow a routine develops. I work out East, Cole works in the city. We have dinner together and then head back to his place where we talk until one of us passes out. I've woken up in his bed more times in the past three weeks than I've slept in my own. I wonder what this is, what he's doing, but I'm too afraid to ask. I'm just glad to have him in any capacity at all.</p><p>One night after dinner, I'm laying on his bed staring at the ceiling. I feel Cole's eyes on me - they are always on me - but I don't turn to look at him. His gaze lingers, sliding over my breasts, watching me breathe as my chest slowly rises and falls. His fingers slip the buttons through the holes on his shirt. I let him look. I like it and wish he'd do more. The man has self-control like nothing I've ever seen.</p><p>\"Cole,\" I ask, still looking at the ceiling.</p><p>\"Mmmm?\" he says, his eyes still searing into my body as he peels the shirt off his chest and tosses it in the hamper. He stands there bare skinned, in nothing but jeans. I'm dying to look at him, but I don't. He hesitates like he knows I want to look before grabbing a tee shirt from the dresser.</p> <p>I want to ask him how he does it, how he can lay next to me night after night and not touch me. My fingers twist the sheets. \"Are you seeing anyone?\" Maybe that was it. Maybe he has a sex friend and I'm his other friend. The one that he sleeps with. Jealousy flames through me at the thought. I want to be the sex friend. Hell, I want to be his only friend.</p><p>\"Why would you ask that?\" he stops and looks at me bewildered.</p><p>I shrug, \"I don't know. It's just... \" Suddenly he's much closer. He's standing next to the bed looking down at me. I keep my gaze on the ceiling.</p><p>\"Just what?\" he asks, like this is normal. I lower my gaze and look at my hands. The question is caught in my throat. I don't look at him. \"You want more?\"</p><p>I feel his eyes on my face, but I can't look up. My heart is pounding, wondering if I just ruined whatever we had.</p> <p>\"There isn't more than this. This is the best of what I can offer you. The rest is too...,\" he shakes his head, \"It's just not possible.\" </p> </body></html>"]