[{"title": "Blue Bloods (Blue Bloods #1)", "author": "Melissa de la Cruz", "pgs": 23, "sum": "Storyline: \nI picked up this book suspecting to be an unconventional, interesting vampire tale. I am a fan of vampire lore, or good ones, at least, so I had to pick this up at my friendly local library. Was I surprised - or perhaps not, coming from the author of 'Au Pairs'- that this book had very little to do with vampires. The first 100 or so pages had absolutely no vampire mentions, and hardly any insinuations that vampires would come up later. Even after that the whole 'Guess what, I'm a vampire, and nearly everyone around you is too...oh yeah, and blood is indeed a necessity' thing is merely a side plot. Mainly, this book concerns Schuyler, an outcast of sorts, dealing with the Queen Bee, Mimi Force, and her gorgeous twin brother, and other high school dramas such as that. It takes a look at the high end of society, where teens learn to drip money without showing it off...", "hash": "302271a4-3960-48fc-9a5c-417429fbc711"}, {"title": "Collide (Collide #1)", "author": "Gail McHugh", "pgs": 19, "sum": "Storyline: \nCollide (Collide #1) A missed first encounter... Colliding with a second chance... On the heels of graduating college and trying to cope with her mother's death, Emily Cooper moves to New York City for a fresh start. While harboring secrets of his own, Dillon Parker takes care of Emily through her grief. Knowing he can't live without her by his side, he's sweet, thoughtful, and everything Emily has ever wanted in a man. Until she meets Gavin Blake - a rich and notorious playboy who is dangerously sexy and charming as hell. Emily tries to deny the instant connection she feels, but Mr. Tall, Dark, and Handsome is not inclined to let go so easily. Recovering from his own painful past, Gavin will stop at nothing to win Emily over. This unexpected encounter compels Emily to question her decisions, forcing her to make a choice that will destroy friendships, shatter hearts, and forever change her life.", "hash": "04b68c69-d431-4a81-91db-5aef0c3ef756"}, {"title": "Losing Control (The Hunter Pact #1)", "author": "Robyn Grady", "pgs": 20, "sum": "Storyline: \nLosing Control The Hunter Pact #1) \"You'll be working for me.\"Taking charge comes naturally to workaholic media mogul Cole Hunter. That includes dealing with headstrong TV producer Taryn Quinn. Cole may not like her idea for a travel show, but Taryn intrigues him. Enough for Cole to join her on a location-scouting trip to an isolated Pacific island, despite the family drama at home. Soon the tantalizing Taryn makes Cole forget about everything...except making love to her in the moonlight. But once reality intrudes, will he risk losing all he's worked for to keep this woman in his life?", "hash": "12a42ca5-94e8-4ef6-adc1-79012cdd6efc"}, {"title": "Kissing Coffins (Vampire Kisses #2)", "author": "Ellen Schreiber", "pgs": 21, "sum": "Storyline: \nKissing Coffins (Vampire Kisses #2) Not far from Dullsville, someone's lurking in the dark. . . . After meeting the handsome and shadowy Alexander Sterling, goth-girl Raven's dark world has a bright, new glow. But as in her favorite movie, \"Kissing Coffins,\" Raven knows that love always has its complications, especially when Alexander has a big secret to guard. When Alexander suddenly disappears, Raven leaves Dullsville to begin a dangerous search to find him. Can she stay safe, no matter who--or what--she encounters on the way?", "hash": "7ecbf2a1-c850-4635-9c11-7cabb98726ab"}, {"title": "Vampireville (Vampire Kisses #3)", "author": "Ellen Schreiber", "pgs": 19, "sum": "Storyline: \nVampireville (Vampire Kisses #3) For goth-girl Raven, dating her dream boyfriend is complicated, especially because Alexander's secret means that they can see each other only at night. And now the pair must be extra wary in the dark with Alexander's archrival, Jagger, appearing around town. As if Jagger isn't enough cause for worry, Luna, his strikingly pale sister, has also surfaced and seems to have her sights set on Raven's longtime nemesis, Trevor. Together, Raven and Alexander must begin a terrifying search for Jagger and Luna's hideout to drive them away -- that is, if it's not already too late to save Dullsville from becoming Vampireville. In the latest installment of her popular Vampire Kisses books, Ellen Schreiber continues the startling story of two teen outsiders -- she from the mortal world and he from the Underworld -- who share a thrilling, extraordinary romance.", "hash": "b4d17a2a-a402-40f8-a7c4-5bf9fe879e87"}, {"title": "Devoured (Devoured #1)", "author": "Emily Snow", "pgs": 21, "sum": "Storyline: \nDevoured (Devoured #1) Sienna's dreams lie in California, but when she discovers her grandmother's Nashville home has been foreclosed, she has no other choice but to move back to Music City, where she comes face to face with the flawed, gorgeous man she never thought she'd see again - and who now holds the deed to her grandma's estate. Millionaire rock star Lucas Wolfe is just as surprised to find the outspoken redhead glaring at him from across a courtroom. Both infuriated and intrigued, he still can't forget the night Sienna spent with him, and the chemistry between them is as undeniable as ever. Now, Lucas is determined to do whatever it takes to lure Sienna into his bed, even if that means making a deal with her: if she spends ten days with him, playing by his rules, he'll hand over the deed to her grandmother's home. Though she agrees to the arrangement for her family's sake, Sienna struggles with the promises she's made to herself and a past that still haunts her. Soon, as Lucas's game of seduction continues and Sienna is introduced to his dark, erotic world, she realizes that at any moment, she could be devoured.", "hash": "5a8f314d-744e-45b3-abbb-9195b995b531"}, {"title": "Someone to Love (Someone to Love #1)", "author": "Addison Moore", "pgs": 21, "sum": "Storyline: \nSomeone to Love (Someone to Love #1) What happens when two people who don’t believe in love, happen to fall madly into the most beautiful relationship they could ever imagine? A train wreck. When twenty-year-old Kendall Jordan transfers clear across country to Garrison University, the last thing she’s looking for is a one-night stand. Unfortunately, that’s exactly what, gorgeous, Cruise Elton offers. Kendall has long since come to realize that love is an illusion that never lasts, and Cruise couldn’t agree more—but something deep inside her wants him all for herself. So, Kendall devises a seat of the pants plan to “play the player” and proposes that Cruise tutor her in becoming a female version of himself, Garrison University’s own playboy. Real feelings begin to emerge, and neither Kendall nor Cruise know how to classify them. Everything they once thought they knew is redefined as they discover, in one another, Someone to Love.", "hash": "1e816d7a-75b2-4c3a-b78f-330dcc1956bc"}, {"title": "Love Bites (Vampire Kisses #7)", "author": "Ellen Schreiber", "pgs": 16, "sum": "Storyline: \nLove Bites (Vampire Kisses #7) As a mortal girl dating a vampire, Raven knows that love isn't always easy. Now that Alexander's parents have returned to Romania, Raven and her dreamy vampire boyfriend are happy to resume their cryptic romance. But soon another visitor comes knocking: Sebastian, Alexander's best friend, arrives for a stay at the mansion. At first Raven is wary, then thrilled--this is the perfect chance to learn more about her darkly handsome boyfriend and his past. Raven has been wondering whether Alexander will ever bite her and make their love immortal, and Sebastian could be her guide to the love habits of Alexander and his kind. But when Sebastian falls for a particular Dullsvillian, will another mortal beat Raven to the bite? With suspense, danger, and a fabulous vampire party, this seventh book in the bestselling Vampire Kisses series continues the exciting nocturnal romance of Raven and Alexander.", "hash": "96a135bd-ddd9-419f-8efb-d4e3b7da8110"}, {"title": "Fate Interrupted (Fate Interrupted #1)", "author": "Kaitlyn Cross", "pgs": 15, "sum": "Storyline: \nFate Interrupted (Fate Interrupted #1) Dean Jacobs is one of Milwaukee’s hottest eligible bachelors and in no mood to settle down, until she comes along. Evy, however, is focused on opening a new dessert bar with her sister but Dean won’t take no for an answer. She finally gives in to the want in her gut and - much to her surprise – discovers he isn’t the player she thought he was. Just when things turn into a fairytale sent from above, Dean’s past comes back to haunt him. The only question is: will it make them stronger, or rip them apart?", "hash": "b276440f-31fc-4382-84e0-b436635631b0"}, {"title": "The Long Hot Summer (The Blackstones of Virgina #1)", "author": "Rochelle Alers", "pgs": 13, "sum": "Storyline: \nThe Long Hot Summer (The Blackstones of Virgina #1) After his wife walked out on him and his son, veternarian Ryan Blackstone swore never to love again. He'd tried to dislike beautiful Kelly Andrews-the teacher hired to run Blackstone Farms Day School-on general principle, but failed. And it wasn't long before the sultry widow had ignited a firestorm of emotion that was burning a sensuous trail...straight to his heart Ryan had shattered Kelly's visions of a lonely future since that first mind-bending, knee-weakening kiss. Before she knew it, he was oh-so-close to tearing down her defenses. Even as Kelly gave in to the passion they both ached to statisfy, Kelly wondered--was what Ryan felt for her love or just lust?", "hash": "35c26788-e7a8-4ab7-9420-da8ef28ff1f1"}]