[{"title": "Shadow of the Moon (Nightcreature #12)", "author": "Lori Handeland", "pgs": 6, "sum": "Storyline: \nShadow of the Moon (Nightcreature #11.5) The hero and heroine from the award winning novel BLUE MOON, Jessie McQuade and Will Cadotte, return in a short adventure. Sent to a small Wisconsin town to investigate a sudden rash of insanity, Jessie and Will meet a mad scientist who has invented a new kind of werewolf--one that silver can't kill.", "hash": "1c6e08ba-3b0f-41e9-b64e-080539ba0b36"}, {"title": "Dead Man Dating ", "author": "Lori Handeland", "pgs": 11, "sum": "Storyline: \nPretentious? Maybe. But I'd hoped that any man who chose a service by that name might be a little more grown up than most - had at least moved beyond a desire to bang supermodels and begun to think about finding a life. Being a literary agent, I should have known that semantics were as dead as most people's belief in a soul mate.", "hash": "df58bbdf-e600-4e8b-b56b-d92e60a4d091"}, {"title": "Midnight Moon (Nightcreature #5)", "author": "Lori Handeland", "pgs": 39, "sum": "Storyline: \nMidnight Moon (Nightcreature #5) Under the midnight moon, dark secrets are revealed--Cassandra thought she had the perfect life until she suffered a devastating tragedy. Now she has a new identity as Priestess Cassandra, owner of a New Orleans voodoo shop, and a new purpose. A research trip for a paranormal secret society leads Cassandra to Haiti, where rumors fly of a sinister voodoo master, Jacques Mezareau, who can resurrect the dead. Fortune hunter Devon Murphy agrees to guide Cassandra there safely, but his sensual appeal promises danger of a different kind… and desperate hungers must be satisfied… As Cassandra and Devon make their way to the eerie jungle village, their attraction explodes into an intoxicating desire, and Cassandra begins to question her resolve to never let another man into her life. Her attempts to resist Devon become more and more impossible. But when she succeeds in learning Jacques's macabre ritual, her new powers may have come with a terrifying price. Now, haunted by violent dreams that grow more vivid as the midnight moon approaches, Cassandra must uncover the shocking truth about an ancient curse before it leads her to destroy herself--and everyone she loves…", "hash": "d04d9d44-ce1d-446e-8834-f995331be4c2"}, {"title": "Rising Moon (Nightcreature #6)", "author": "Lori Handeland", "pgs": 36, "sum": "Storyline: \nRising Moon (Nightcreature #6) Denizens of The Big Easy know its steamy nights can hide any number of sins and secrets. Private-eye Anne Lockhart is counting on it. Her life has been in a holding pattern ever since her sister Katie disappeared without a trace…but when a clue leads Anne to a jazz club in the French Quarter, everything changes. Rising Moon's proprietor, John Rodolfo, is mysterious in his own right, a gifted musician who reaches deep into Anne's soul and whose mere presence taps into desires she can't afford to indulge... By going undercover at the Rising Moon, Anne can get close to people who know what goes on after dark--people like John, whose nocturnal disappearances are more than a little suspicious. But unlocking John's secrets is harder than Anne had anticipated. What's far too easy is surrendering to him. And now someone--or something--is stalking the innocent and the guilty, and waiting for Anne's next move...", "hash": "2b9df2f4-b2db-4d5a-8d8e-4f5fcb9c0fec"}, {"title": "If Angels Burn (Darkyn #1)", "author": "Lynn Viehl", "pgs": 55, "sum": "Storyline: \nIf Angels Burn (Darkyn #1) SHE RESTORES THE LIGHT OF HOPE. Dr. Alexandra Keller is Chicago's most brilliant reconstructive surgeon. HE DWELLS IN SHADOW. Michael Cyprien is New Orleans's most reclusive millionaire--and in desperate need of Dr. Keller's skills. A NEW DAWN AWAITS THEM BOTH.... Beneath the foundation of a mansion in the heart of the Garden District, Alexandra will perform an illegal surgery. Her patient's disfigurement is beyond medical repair. But his body's ability to recuperate from his wounds borders on the miraculous. Alexandra knows Michael Cyprien is no ordinary patient. Intrigued by how his remarkable physiology might benefit medical science, she is even more compelled by his presence--and the mystery surrounding him and his associates, a cadre of immortals who call themselves the Darkyn.", "hash": "b295e43d-c947-4340-953c-87f1845c0828"}, {"title": "Private Demon (Darkyn #2)", "author": "Lynn Viehl", "pgs": 56, "sum": "Storyline: \nPrivate Demon (Darkyn #2) Night after night, Jema Shaw's dreams have become a haven for Thierry Durand. But his nocturnal visits have placed her in danger and brought her between two ancient enemies: the Brethren and the Darkyn.", "hash": "362c74ed-36d9-4524-810f-ddfd525810f0"}, {"title": "Dark Need (Darkyn #3)", "author": "Lynn Viehl", "pgs": 55, "sum": "Storyline: \nDark Need (Darkyn #3) AN ACHING EMPTINESS... Homicide detective Samantha Brown is a tough, highly decorated cop. But for the past twelve lonely years, since she nearly died of a gunshot wound, she has felt a deep inner longing. A LONG-LOST LOVE... The mysterious Lucan, with his timeless ability to seduce women, is focusing on the emotionally battered Samantha, who has awakened his wild memories of a long-ago love. A PASSION THAT WILL BE FULFILLED. As Samantha pursues a deranged killer, her only clue is a medieval cross inscribed “Lucan”—the name of a man who owns a nightclub near the murder scene. Drawn into a seamy underworld, Samantha falls for Lucan, who believes that he’s a vampire and that Samantha is his reincarnated first love. Now she must save this man who seems beyond redemption—and who fulfills her deepest, darkest desires....", "hash": "0468f932-a852-4796-8cec-64ec0043c0f4"}, {"title": "Night Lost (Darkyn #4)", "author": "Lynn Viehl", "pgs": 50, "sum": "Storyline: \nNight Lost (Darkyn #4) Abandoned by his fellow Darkyn, Gabriel Seran is in continual torment as a prisoner of the religious zealots known as the Brethren. His only hope for rescue lies in Nicola Jefferson, a thief seeking a holy relic-and connected to Gabriel in more ways than she can possibly imagine...", "hash": "8e834806-7410-4dd6-9c32-d81d53290472"}, {"title": "Evermore (Darkyn #5)", "author": "Lynn Viehl", "pgs": 54, "sum": "Storyline: \nEvermore (Darkyn #5) The NEW YORK TIMES AND USA Today bestselling Darkyn series continues... Jayr is proud to be the only female ever permitted to serve as seneschal to a Darkyn lord. But in her centuries of service to Master Byrne, she has fallen in love with him. Now, Byrne plans to step down and hand over the Jardin to another Kyn lord-a move that threatens not only Jayr's position, but her very life...", "hash": "2fd201cb-cb64-4651-9b49-a506dcad1309"}, {"title": "Twilight Fall (Darkyn #6)", "author": "Lynn Viehl", "pgs": 50, "sum": "Storyline: \nTwilight Fall (Darkyn #6) Immortal Darkyn Lord Valentin Jaus and landscape artist Liling Harper are two lost souls. Brought together by fate, bound together by passion, Valentin and Liling find solace in each other’s arms. But the ties that bind them are deeper—and more dangerous—than either of them can possibly imagine…", "hash": "09127361-731c-4bc2-a56b-a792d151e8f1"}]