[{"title": "Midnight Blues (Darkyn #7)", "author": "Lynn Viehl", "pgs": 12, "sum": "Storyline: \nMidnight Blues (Darkyn #6.5) Samantha and her mate Rafael are homicide cop. Once they were ordered to investigate the case of the cops lying at convent. This corpse was a message for one of the woman inside the convent, Daniela, or Cristál. Her old nemesis, Donatien, a Kyn gone bad centuries ago, wants her for her powers to heal. He loves torturing people, and she can make them last longer. For years she has run from him, but always he finds her.", "hash": "5c36c116-c9fe-4180-b2e3-aa630c15147f"}, {"title": "Stay the Night (Darkyn #7)", "author": "Lynn Viehl", "pgs": 51, "sum": "Storyline: \nStay the Night (Darkyn #7) Outlaw, immortal vampire, and art thief, Darkyn Lord Robin of Locksley has evaded authorities for the last 700 years. At the moment, he’s falling for undercover federal agent Christina Renshaw, who has no time for an affair. She hopes to snag an elusive art thief, but soon has no choice other than to join forces with Robin. When the chase becomes dangerous, both will have to choose between losing each other and losing everything they value...", "hash": "86297916-3bcf-456a-bdca-08483322c460"}, {"title": "Master of the Shadows (Darkyn #8)", "author": "Lynn Viehl", "pgs": 30, "sum": "Storyline: \nMaster of the Shadows (Darkyn #7.5) Will Scarlet, right-hand man to Darkyn leader Robin of Locksley, has been charged with an impossible task: He must regain control of his lord-s stronghold, which has been invaded by vicious Darkyn renegades, without harming any captives or attracting the attention of the Brethren, the Kyn-s mortal enemies. Things only get worse when Will learns that Reese Carmichael, the mortal woman he loves, is one of the hostages. - Reese was sent by her father, a former Brethren inquisitor, to infiltrate Rosethorn, retrieve an ancient vial containing the cause of a medieval plague, and prevent Armageddon from being accidentally unleashed upon the mortal world. Seducing and falling in love with Will Scarlet was never part of the plan, but Reese has no choice other than to use him and the siege of Rosethorn to complete her mission. If she does, she knows he will never forgive her-but if she doesn-t, millions of innocent lives will be lost. - As Kyn allies Jayr, Byrne, and Lucan arrive to provide Will with reinforcements, Reese-s true identity and motives are revealed.- Torn between love and loyalty, Will and Reese uncover one last secret from the past that may help them win the final battle-if it doesn-t destroy them first.", "hash": "eec6740f-27ee-4faf-b67f-73bdd717d4ef"}, {"title": "Incarnatio (Darkyn #8)", "author": "Lynn Viehl", "pgs": 14, "sum": "Storyline: \nIncarnatio (Darkyn #7.6) Luce wanted to live up to her name tonight. She’d just turned twenty-one, started her new job, moved into her own place last weekend and finally, finally had some goddamn privacy. Her life was her own and tonight she intended to start living it on her terms......", "hash": "ef54c5a5-2e0a-436b-85aa-348afac221e8"}, {"title": "Shadowlight (Kyndred #1)", "author": "Lynn Viehl", "pgs": 52, "sum": "Storyline: \nShadowlight (Kyndred #1) With just one touch, Jessa Bellamy can see anyone’s darkest secrets, thanks to whoever tampered with her genes. What she doesn’t know is that a biotech company has discovered her talent and intends to kill her and harvest her priceless DNA... Gaven Matthias is forced to abduct Jessa himself so he can protect her, but Jessa has a hard time believing the one man whose secrets she can’t read. As a monstrous assassin closes in and forces them to run, Jessa will have to find another way to discover if Matthias is her greatest ally—or her deadliest enemy.", "hash": "6af5ed94-e051-42e2-aa72-e9cfd9f439df"}, {"title": "Dreamveil (Kyndred #2)", "author": "Lynn Viehl", "pgs": 52, "sum": "Storyline: \nDreamveil (Kyndred #2) Rowan Dietrich grew up on the streets. Now she's out to start anew, find a job-and keep her identity as a Kyndred secret, as well as her ability to \"dreamveil\" herself into the object of others' desires. But Rowan isn't using her gift when world-class chef Jean-Marc Dansant is stricken by her beauty and strength. And when dark secrets from her past threaten her new life and love, Rowan realizes she can't run forever...", "hash": "b036ca1c-9efe-4532-9554-803abce278f9"}, {"title": "Frostfire (Kyndred #3)", "author": "Lynn Viehl", "pgs": 49, "sum": "Storyline: \nFrostfire (Kyndred #3) As one of the genetically enhanced Kyndred, Lilah's mind-reading powers make her vulnerable to a mysterious biotech company willing to murder to acquire her superhuman DNA. But her true fear may come from her own Kyndred brethren...", "hash": "c74f4b49-6838-4235-96bf-c51998640242"}, {"title": "Nightshine (Kyndred #4)", "author": "Lynn Viehl", "pgs": 53, "sum": "Storyline: \nNightshine (Kyndred #4) As a psychic, Samuel Taske can see the future, but he never predicted that he'd fall for San Francisco paramedic Charlotte Marena, the woman he's been charged with protecting. GenHance-the biotech company willing to do anything to acquire superhuman DNA-is after them. And when Samuel discovers that his Takyn powers have abandoned him, Charlie and her secret nighttime telepathic ability are their only hope for survival...", "hash": "c3c0af4c-691e-4b64-ab19-ff2663c6d15c"}, {"title": "Nightborn (Lords of the Darkyn #1)", "author": "Lynn Viehl", "pgs": 48, "sum": "Storyline: \nNightborn (Lords of the Darkyn #1) The High Lord of the Immortal Darkyn has sent his most trusted warrior, Korvel, to retrieve a coveted scroll that's rumored to contain maps to Templar treasures and the secrets to eternal life. Uniting with Korvel to recover the dangerous artifact is Simone Derien, the daughter of the scroll's guardian, and a woman with many deadly secrets...", "hash": "6a374b56-bb93-4353-a096-42c7997a285c"}, {"title": "Nightbred (Lords of the Darkyn #2)", "author": "Lynn Viehl", "pgs": 48, "sum": "Storyline: \nNightbred (Lords of the Darkyn #2) Jamys Durand has survived being made an immortal Darkyn, horrific torture, and years of grueling warrior training. But he has no future to offer Chris, the mortal woman he loves, without his own territory. When he learns of a lost Templar treasure, Jamys vows to possess it and win his lady’s heart. No one knows Chris Lang wants to be a tresora so she can live with Jamys, her secret love. Her superiors offer to make her dream come true, but only if she finds the lost treasure before Jamys can. Working together, Chris and Jamys track the jewels through a shadowy maze of priceless artifacts, decadent secrets, and one ruthless opponent who can possess an immortal’s mind…and will stop at nothing to have Chris.", "hash": "ee99ebdf-0ed3-4a61-9625-13e43949ae3d"}]