[{"title": "Nightbound (Lords of the Darkyn #3)", "author": "Lynn Viehl", "pgs": 47, "sum": "Storyline: \nNightbound (Lords of the Darkyn #3) Beaumaris of York has many secrets. No human can know that he’s an immortal Darkyn assigned to Knight’s Realm, the Kyn stronghold disguised as a medieval theme park. And none of his brethren can discover that he’s a half-breed, rescued from slavery as a child. Lately Beau has been yearning for action—and he’s about to find it with his new mission. Brilliant archaeologist Dr. Alys Stuart is infamous for her extraordinary theories—especially those concerning the mysterious Knights Templar—and she is unaware that her research is funded by the Kyn coffers. When the Kyn sends a vexingly good-looking man to assist—and protect—her, she doesn’t expect the surge of attraction she feels for him. When a powerful Templar artifact surfaces, Alys and Beau must trust each other enough to stop mankind’s greed for immortality from sparking a war between mortals and Kyn that will destroy the world.", "hash": "05560a07-b3bd-46be-9640-91d757bd2485"}, {"title": "Undead and Unemployed (Undead #2)", "author": "MaryJanice Davidson", "pgs": 29, "sum": "Storyline: \nUndead and Unemployed (Undead #2) Nothing can make Betsy Taylor give up her shoe fetish - even dying and rising as the new Queen of the Vampires. Being royally undead isn't all it's cracked up to be - there are still bills to be paid. And Betsy is determined to live as normally as possible, even if it means getting a job. A \"feet\" she accomplishes with panache, landing her dream job selling designer shoes at Macy's. Things couldn't be better - except for her new friends, who keep pestering her while she's on the clock. As if she has time to socialize when there are deliciously sinful shoes to try on - and buy at a discount. It seems that vampires are being murdered in St. Paul, and they're all clamoring for Betsy to do something about it. The worse part is she's going to have to enlist the help of the one vamp who makes her blood boil: the oh-so-sexy Sinclair. Now, she's really treading on dangerous ground - high heels and all...", "hash": "218f0c7c-92bb-421f-8ccc-39f75fa09d8f"}, {"title": "Undead and Unappreciated (Undead #3)", "author": "MaryJanice Davidson", "pgs": 36, "sum": "Storyline: \nUndead and Unappreciated (Undead #3) Fans can't get enough of author MaryJanice Davidson and her topsy-turvy world of the undead with its newly-crowned queen, Betsy Taylor. Now, Betsy continues her reluctant reign while being bedeviled by family secrets... Most women would love to live as royalty, but Betsy has found that being vampire queen has more problems than perks, except for always being awake for Midnight Madness sales. It may be easy to find blood (yuck) in the dark of night, but try finding a strawberry smoothie. And employees at her nightclub Scratch have been giving her nothing but grief since she killed their former boss. Some people... But Betsy's \"life\" takes an interesting turn at a shower for her wicked stepmother, who lets it slip that Betsy has a long-lost half sister. Now twenty years old, this woman just so happens to be the devil's daughter - and destined to rule the world...", "hash": "660d8be6-f2e6-4615-9040-1b291dba8fed"}, {"title": "Undead and Unreturnable (Undead #4)", "author": "MaryJanice Davidson", "pgs": 43, "sum": "Storyline: \nUndead and Unreturnable (Undead #4) As if she needed yet another reason to shop, Queen of the Vampires Betsy Taylor is in the middle of planning the perfect wedding to drop-dead gorgeous vamp Eric Sinclair. And she’s not about to let little things like death and blood-drinking get in her way. But all is not bouquets and bridal showers—Betsy is plagued by ghosts who demand her help in rectifying their past mistakes, and a serial killer is on the loose. With his victims all being tall, blond women, Betsy fits the profile exactly…", "hash": "8ad6f4c7-c315-422a-b7d3-c72c5d339149"}, {"title": "Undead and Unpopular (Undead #5)", "author": "MaryJanice Davidson", "pgs": 30, "sum": "Storyline: \nUndead and Unpopular (Undead #5) In her fifth outing, Vampire Queen Betsy Taylor has a birthday coming up and she has a lot on her plate, including wedding plans. So when some birthday guests show up uninvited, she gets really cranky. RThink \"Sex and the City\"--only the city is Minneapolis and it's filled with demons and vampires.S--\"Publishers Weekly.\"", "hash": "ee9f0387-b629-4302-961c-45a9012314a3"}, {"title": "Undead and Uneasy (Undead #6)", "author": "MaryJanice Davidson", "pgs": 41, "sum": "Storyline: \nUndead and Uneasy (Undead #6) Weddings are never easy. But when you're Vampire Queen Betsy Taylor, they can become downright deadly... In the days leading up to The Big Day, Vampire Queen Betsy Taylor seems to have a full house - and the wedding guests have yet to arrive. Along with her human buddies, there's a ghost, a werewolf, and a Fiend crashing at her place. And though her fiancé, Vampire King Eric Sinclair, conveniently disappears when the conversation turns to seating charts and flower arrangements, he does manage to make his oh-so-sexy presence known at other moments. Betsy knows the next few weeks won't be smooth sailing - but she never expects just what's in store for her. Cold feet are no surprise, especially with an undead groom. But when Sinclair truly goes missing - and not just to avoid wedding preparations - along with most of her friends and loved ones, Betsy is frantic. Alone and afraid for the fate of everyone she loves, Betsy can't trust anyone as she tries to find them and whoever is behind all the disappearances. And what happens next will shake the foundation of the vampire world forever.", "hash": "5853ab0f-f23e-4be9-bdea-c2baa9bb46c3"}, {"title": "Undead and Unworthy (Undead #7)", "author": "MaryJanice Davidson", "pgs": 49, "sum": "Storyline: \nUndead and Unworthy (Undead #7) Betsy Taylor thought entering the world of the undead was a big adjustment. Being a new bride isn't much easier. The blush has only been on for two months, and Betsy has a lot to do: set up the new house, finish writing thank-you notes, and raise BabyJon, her half brother and legal ward. Just another happy American family adjusting to marital bliss. Betsy's husband, Sinclair, has been perusing the Book of the Dead, and Betsy's visited by a ghost who's even more insufferable, stubborn, and annoying in death than she was in life. She not only blames Betsy for her condition but insists she fix it. It's all just a prelude to the fun and games awaiting Betsy and Sinclair when a pack of formerly feral vampires, hungry for blood and power, pays a visit to the happy couple.", "hash": "2a994f86-7456-431e-b4ad-e73e09c3ee4c"}, {"title": "Undead and Unwelcome (Undead #8)", "author": "MaryJanice Davidson", "pgs": 25, "sum": "Storyline: \nUndead and Unwelcome (Undead #8) That's what Betsy is facing when she takes her werewolf friend Antonia's body to Cape Cod, where the Pack resides at Wyndham Manor. Because Antonia died in her service, Betsy is alive and well-and wracked with guilt. She has no idea if the Wyndham werewolves will greet her with fangs or friendship. While Betsy and her husband, Sinclair, try to make nice, their legal ward, BabyJon, freaks out every werewolf he meets. Meanwhile, Betsy's posse back at the St. Paul mansion is not LOLing. Increasingly frantic e-mails alert Betsy to her half sister's increasingly erratic behavior. Looks like the devil's daughter is coming into her own-and raising hell. All in the name of making Betsy's life easier, of course.", "hash": "7b6228f7-678a-4627-919d-366e8e4f64af"}, {"title": "Undead and Unfinished (Undead #9)", "author": "MaryJanice Davidson", "pgs": 33, "sum": "Storyline: \nUndead and Unfinished (Undead #9) There's only one thing Vampire Queen Betsy Taylor hates more than the threat of hosting a traditional Thanksgiving dinner (after all, how traditional is her family?), and that's trying to get through the Book of the Dead without going insane. Every time she's tried reading it, she just gets blindsided - until this time, when the devil strikes a bargain. She offers Betsy a chance to get through the cursed (literally!) thing cover to cover and finally discover all its mysteries. There's just one teensy little catch. Betsy and her half sister, Laura, have to go to Hell. Just long enough for Laura to finally embrace her dark heritage (after a rebellious youth of charity work and teaching Sunday school) and make nice with her mother, aka Lucifer, by picking up such skills as slicing through time and the universe with a hellfire sword. While such things might sound fun, time travel is proving to be an alarming journey for Betsy and Laura. Not only are they interacting firsthand with their own family's past, but in doing so, they're dangerously impacting the future in ways they never anticipated. Of course, that's what Mother wanted all along. Damn her.", "hash": "0d78d2e2-ded5-47b9-a4b1-bffb1f975bf7"}, {"title": "Undead and Undermined (Undead #10)", "author": "MaryJanice Davidson", "pgs": 49, "sum": "Storyline: \nUndead and Undermined (Undead #10) So this is what being dead feels like. Vampire queen Betsy Taylor has awoken in a Chicago morgue, naked as a corpse. Her last memory is reconciling with her husband, Eric Sinclair, after a time-traveling field trip, including an indirect route to hell (literally), with her sister, Laura. Now she’s Jane Doe #291, wrapped in plastic with a toe tag. Betsy can’t help but wonder, what in hell happened? Grabbing clean scrubs, Betsy hits the pavement and heads back to her St. Paul mansion to find that her family and friends have been frantically searching for her. And not one of them can explain how she ended up dead and naked - not to mention, in Chicago - until Betsy realizes that she and Laura didn't time-travel alone. What followed them had a wicked agenda: to kill Betsy in a time when she was still young and vulnerable and end her future reign as queen. But it's not just Betsy's future that's taken an unexpected detour. Everyone in her circle, alive or undead, is feeling the chill. Betsy can't let the unthinkable happen. It would be a day in hell if she did.", "hash": "6dc1b903-5294-4355-b521-5259f93087c1"}]