[{"title": "Undead and Unstable (Undead #11)", "author": "MaryJanice Davidson", "pgs": 28, "sum": "Storyline: \nUndead and Unstable (Undead #11) Betsy's heartbroken over her friend Marc's death, but at least his sacrifice should change the future - her future - for the better. But it's not as if Betsy's next few hundred years will be perfect. After all, her half sister, Laura, is the Antichrist. Laura's mother is Satan, and family gatherings will always be more than a little awkward. What's really bothering Betsy is that ever since she and Laura returned from visiting her mom in hell, Laura's been acting increasingly peculiar. Maybe it's Laura's new job offer': Satan's replacement down under. Unfortunately, the position comes at a damnable price: killing Betsy, her own flesh and blood. Over Betsy's dead body. And for that matter, Marc's, too, since he's not quite as buried as everyone thought. Now a war has been waged - one that's going to take a sibling rivalry to a whole new level and a dimension where only one sister can survive.", "hash": "e8fbed8b-4c92-495d-a8fb-d7428bd1a4b1"}, {"title": "Undead and Unsure (Undead #12)", "author": "MaryJanice Davidson", "pgs": 35, "sum": "Storyline: \nUndead and Unsure (Undead #12) It’s no surprise to Betsy that her trip to Hell with her sister Laura landed them in hot water. Betsy isn’t exactly sorry she killed the Devil but it’s put Laura in a damnable position: assuming the role of Satan (she may not have the training but she looks great in red)—and in charge of billions of souls as she moves up in the world. Or is that down? But Betsy herself is in an odd new position as well—that of being a responsible monarch suddenly in charge of all things more earth-bound: like her vampire husband Sinclair who has gone from relieved to ecstatic to downright reckless now that he can tolerate sunlight. And if Sinclair isn’t enough to contend with, Betsy’s best friend Jessica is in her sixth (and hopefully last) trimester. Considering she’s been pregnant for eighteen months, she’s become a veritable encyclopedia of what not to expect when you’re expecting. Oh, the horror… And speaking of growing pains, Betsy and Sinclair’s adopted little BabyJon is finally starting to walk. And if the increasingly unpredictable toddler is anything like his extended family, precisely where he’s headed is anyone’s guess.", "hash": "058a4635-fd37-455b-93a4-5d0e0304f819"}, {"title": "Undead and Underwater (Undead #12)", "author": "MaryJanice Davidson", "pgs": 42, "sum": "Storyline: \nUndead and Underwater (Undead #11.5) Betsy Taylor and the Wyndham werewolves are back in three all-new outrageous novellas from New York Times bestselling author MaryJanice Davidson. MaryJanice Davidson “continues to put her own unique spin on paranormal romance” (Fallen Angel Reviews) in these hilarious and sexy new novellas featuring Undead Queen Betsy Taylor as she meets Fred the mermaid, an all-new female superhero, and Lara Wyndham, the daughter of the Pack leader of the Wyndham werewolves.", "hash": "21a178e7-4215-40de-9ae3-962e4186f660"}, {"title": "Derik's Bane (Wyndham Werewolf #3)", "author": "MaryJanice Davidson", "pgs": 28, "sum": "Storyline: \nDerik's Bane (Wyndham Werewolf #3) Derik's a werewolf with alpha issues--and a body to die for. Sara is the personification of unspeakable evil--and smells like roses. Now if they could just stop drooling over each other long enough to save the world.", "hash": "61d2238d-c86e-4a71-819f-81508009bc21"}, {"title": "Santa Claws (Wyndham Werewolf #4)", "author": "MaryJanice Davidson", "pgs": 7, "sum": "Storyline: \nSanta Claws (Wyndham Werewolf #4) \"Santa Claws\" by MaryJanice Davidson: a powerful European werewolf falls in lust at first bite with sidewalk Santa Giselle Smith. Giselle, a pleasant but sheltered woman, is literally swept off her feet by the charismatic and sexually hungry Alec.", "hash": "3abbe391-b4bb-4caf-b296-0439fceee2d1"}, {"title": "Dead and Loving It (Wyndham Werewolf #5)", "author": "MaryJanice Davidson", "pgs": 27, "sum": "Storyline: \nDead and Loving It (Wyndham Werewolf #5) -Santa Claws -Monster Love -There's No Such Thing as Werewolves -A Fiend in Need The queen of comic, erotic, other-species romance brings her best setups and hottest sex scenes to this four-novella party. Three of them feature the bad Wyndham werewolves, who find unanticipated love with often reluctant earthlings. In \"Santa Claws,\" Alec Kilcurt, the most powerful werewolf in Europe, falls for Santa-clad Giselle Smith and wins her over with lots of oral sex and a heavy Scottish accent. In \"Monster Love,\" bad-tempered Janet Lupo is kidnapped by a sexy werewolf. Then there's the story of Doctor Drake Dragon and his unusual encounter with Crescent. Finally, following the events of Undead and Unreturnable, a psychic werewolf, Antonia Wolfton, receives a vision to show up at Queen Betsy's Minneapolis home to help and falls hard for George, the fiend in the basement. It's all pure Davidson fun. Ginger Curwen", "hash": "12a0fa71-ffbf-4cce-9e99-8c6082d45e68"}, {"title": "Thief of Hearts ", "author": "MaryJanice Davidson", "pgs": 26, "sum": "Storyline: \nNever a dull night in the ER for Dr. Jared Dean, especially when he sees the woman of his fantasies beating the crap out of the largest man he has ever seen, only to have her escape before he even gets to ask her name.Kara realizes the gorgeous doc is now in danger of retribution from the Godfather wannabe, so she immediately assigns herself the arduous task of guarding the hard body of Dr. Dean until she can figure a way out of the mess.Jared is only too happy to accommodate the woman of his dreams, even if he doesn't take her seriously. Anything to have her close at hand... and in his bed.", "hash": "dfb43b9c-e2a7-435f-a8a3-467021440f3f"}, {"title": "The Pagan Stone (Sign of Seven #3)", "author": "Nora Roberts", "pgs": 22, "sum": "Storyline: \nThe Pagan Stone (Sign of Seven #3) The Pagan Stone had stood for hundreds of years, long before three boys gathered around it to spill their blood in a bond of brotherhood, unwittingly releasing a force bent on destruction... Gage Turner has been running from his past for a long time. The son of an abusive drunk, his childhood in the small town of Hawkins Hollow was tough--his only solace his friendship with Fox O'Dell and Caleb Hawkins. But, aged ten, the boys unleashed evil on their town: every seven years murder and mayhem reign, and each cycle is more extreme than the last. Now Gage has returned home to help his friends save Hawkins Hollow, but a lifetime as a loner has made him wary of emotional ties. And who can make plans for the future when their present is so uncertain? For unless they find a way to use the Pagan Stone against the demonic force, everything they know and love will be destroyed...", "hash": "84608df9-e1fd-4634-8dea-ffb5a11f77fe"}, {"title": "Moon Called (Mercy Thompson #1)", "author": "Patricia Briggs", "pgs": 16, "sum": "Storyline: \nMoon Called (Mercy Thompson #1) Mercedes \"Mercy\" Thompson is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot like ours but is populated by those things that go bump in the night. And Mercy's connection to those things is about to get her into some serious hot water...", "hash": "8ac43957-d4f0-4641-8684-b91f62083d4c"}, {"title": "Blood Bound (Mercy Thompson #2)", "author": "Patricia Briggs", "pgs": 15, "sum": "Storyline: \nBlood Bound (Mercy Thompson #2) Under the rule of science, there are no witch burnings allowed, no water trials or public lynchings. In return, the average law-abiding, solid citizen has little to worry about from the things that go bump in the night. Sometimes I wish I was an average citizen... Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since she can shapeshift at will, she agrees to act as some extra muscle when her vampire friend Stefan goes to deliver a message to another of his kind. But this new vampire is hardly ordinary-and neither is the demon inside of him.", "hash": "8dad6e26-dd16-4237-9408-0fbc3757ef0c"}]