[{"title": "Iron Kissed (Mercy Thompson #3)", "author": "Patricia Briggs", "pgs": 13, "sum": "Storyline: \nIron Kissed (Mercy Thompson #3) I could smell her fear, and it satisfied something deep inside me that had been writhing under her cool, superior gaze. I curled my upper lip so she could get a good look at my sharp teeth. I might only weigh thirty or so pounds in my coyote shape, but I was a predator... Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is arrested for murder and left to rot behind bars by his own kind, it's up to Mercy to clear his name, whether he wants her to or not. Mercy's loyalty is under pressure from other directions, too. Werewolves are not known for their patience, and if Mercy can't decide between the two she cares for, Sam and Adam may make the choice for her...", "hash": "aadee9c0-37dc-4c2b-8b1c-99af85b86239"}, {"title": "Bone Crossed (Mercy Thompson #4)", "author": "Patricia Briggs", "pgs": 13, "sum": "Storyline: \nBone Crossed (Mercy Thompson #4) By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for. Marsilia, the local Vampire Queen, has learned that Mercy crossed her by slaying a member of her clan—and she's out for blood. But since Mercy is protected from direct reprisal by the werewolf pack (and her close relationship with its sexy Alpha), it won't be Mercy's blood Marsilia is after. It'll be her friends'.", "hash": "f75e014f-671b-42e3-89e3-11f17d66c3bd"}, {"title": "Silver Borne (Mercy Thompson #5)", "author": "Patricia Briggs", "pgs": 15, "sum": "Storyline: \nSilver Borne (Mercy Thompson #5) Being a mechanic is hard work. Mercy Thompson, for instance, just spent the last couple of months trying to evade the murderous queen of the local vampire seethe. And now the leader of the werewolf pack, who's maybe-more-than-just-a-friend, has asked for her help. A book of fae secrets has come to light and they're all about to find out how implacable - and dangerous - the fae can be. OK, so maybe her troubles have nothing to do with the job. But she sure could use a holiday...", "hash": "13eee63b-a9c0-4d8d-829a-468236e8ab11"}, {"title": "River Marked (Mercy Thompson #6)", "author": "Patricia Briggs", "pgs": 13, "sum": "Storyline: \nRiver Marked (Mercy Thompson #6) Mercy Thompson is a shapeshifter, a talent she inherited from her long-gone father. And she's never known any others of her kind. Until now. As Mercy comes to terms with this new information, an evil is stirring in the depths of the Columbia River. Something deadly is coming, facts are thin on the ground and Mercy feels ill at ease.", "hash": "1a777f59-3f3f-4f41-b221-7828965cceeb"}, {"title": "Frost Burned (Mercy Thompson #7)", "author": "Patricia Briggs", "pgs": 13, "sum": "Storyline: \nFrost Burned (Mercy Thompson #7) Mercy Thompson's life has undergone a seismic change. Becoming the mate of Adam Hauptman - the charismatic Alpha of the local werewolf pack - has made her a stepmother to his daughter Jesse, a relationship that brings moments of blissful normalcy to Mercy's life. But on the edges of humanity, a minor mishap on an ordinary day can turn into so much more. After an accident in bumper-to-bumper traffic, Mercy and Jesse can't reach Adam - or anyone else in the pack for that matter. They've all been abducted. Through their mating bond, all Mercy knows is that Adam is angry and in pain. Outclassed and on her own, Mercy may be forced to seek assistance from the most unlikely of allies: the vampire seethe.", "hash": "42fa896d-fe2f-4e76-aa5c-5573e8c3d580"}, {"title": "On the Prowl (Alpha and Omega #1)", "author": "Patricia Briggs", "pgs": 28, "sum": "Storyline: \nOn the Prowl (Alpha & Omega 0.5) Alpha and Omega 0.5 by Patricia Briggs The werewolf Anna finds a new sense of self when the son of the werewolf king comes to town to quell unrest in the Chicago pack- and inspires a power in Anna that she's never felt before. Inhuman by Eileen Wilks Kai has a secret gift of sensing thoughts and desires. What she senses in her neighbor Nathan could be dangerous. Because he has a secret gift, too, and it's about to be let loose. Buying Trouble by Karen Chance In a New York auction house, a Lord of the Fey crosses paths with a fiery redheaded mage named Claire. But in this strange underground society, the rarity up for sale is Claire herself. Mona Lisa Betwining by Sunny Among the children of the moon, Mona Lisa is of Mixed Blood- part Monere, part human, and destined to be alone. Then she meets a man who could be her salvation- or her downfall.", "hash": "f06ee211-e09b-43cb-a357-14e023550292"}, {"title": "Cry Wolf (Alpha and Omega #1)", "author": "Patricia Briggs", "pgs": 16, "sum": "Storyline: \nCry Wolf (Alpha & Omega #1) Anna never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the pack, she'd learned to keep her head down and never, ever trust dominant males. Then Charles Cornick, the enforcer—and son—of the leader of the North American werewolves, came into her life. Charles insists that not only is Anna his mate, but she is also a rare and valued Omega wolf. And it is Anna's inner strength and calming presence that will prove invaluable as she and Charles go on the hunt in search of a rogue werewolf—a creature bound in magic so dark that it could threaten all of the pack.", "hash": "c2f3756b-4d3d-4645-a368-6b6b661931f8"}, {"title": "Hunting Ground (Alpha and Omega #2)", "author": "Patricia Briggs", "pgs": 13, "sum": "Storyline: \nHunting Ground (Alpha & Omega #2) Anna Latham didn’t know how complicated life could be until she became a werewolf. And until she was mated to Charles Cornick, the son — and enforcer — of Bran, the leader of the North American werewolves, she didn’t know how dangerous it could be either... Anna and Charles have just been enlisted to attend a summit to present Bran’s controversial proposition: that the wolves should finally reveal themselves to humans. But the most feared Alpha in Europe is dead set against the plan — and it seems like someone else might be too. When Anna is attacked by vampires using pack magic, the kind of power only werewolves should be able to draw on, Charles and Anna must combine their talents to hunt down whoever is behind it all — or risk losing everything...", "hash": "02cccc5f-0426-4a8a-b61a-bc00a3cf6731"}, {"title": "Fair Game (Alpha and Omega #3)", "author": "Patricia Briggs", "pgs": 14, "sum": "Storyline: \nFair Game (Alpha & Omega #3) Patricia Briggs, the #1 \"New York Times\" bestselling author of the Mercy Thompson novels, \"always enchants her readers.\" (Lynn Viehl, \"New York Times\" bestselling author) Now her Alpha and Omega series-set in a world of shifting shapes, loyalty, and passion- brings werewolves out of the darkness and into a society where fear and prejudice could make the hunters prey...", "hash": "8c855683-c3ba-46e0-8b24-d98141d5023c"}, {"title": "Raven's Strike (Raven Duology #2)", "author": "Patricia Briggs", "pgs": 22, "sum": "Storyline: \nRaven's Strike (Raven Duology #2) The Traveler Seraph must use all her cunning and ability as a Raven mage to track down an unimaginable force of destruction known as the Shadowed.", "hash": "e5610205-c3a4-4c59-a417-ee79e8d9cb30"}]