[{"title": "Masques (Sianim #1)", "author": "Patricia Briggs", "pgs": 12, "sum": "Storyline: \nMasques (Sianim #1) When the peaceful kingdom of Reth is overrun by Geoffrey ae'Magi, the evil master of illusion, Aralorn, weaponsmistress of the shapechanging race, and her companion, Wolf, attempt to overthrow him.", "hash": "98da6164-78ae-4ef7-89bd-738e03b9ca5f"}, {"title": "Shadow Heir (Dark Swan #4)", "author": "Richelle Mead", "pgs": 66, "sum": "Storyline: \nShadow Heir (Dark Swan #4) Shaman-for-hire Eugenie Markham strives to keep the mortal realm safe from trespassing entities. But as the Thorn Land's prophecy-haunted queen, there's no refuge for her and her soon-to-be-born-children when a mysterious blight begins to devastate the Otherworld... The spell-driven source of the blight isn't the only challenge to Eugenie's instincts. Fairy king Dorian is sacrificing everything to help, but Eugenie can't trust the synergy drawing them back together. The uneasy truce between her and her shape shifter ex-lover Kiyo is endangered by secrets he can't--or won't--reveal. And as a formidable force rises to also threaten the human world, Eugenie must use her own cursed fate as a weapon--and risk the ultimate sacrifice...", "hash": "aea63ef7-15f8-4952-b5d2-cb09f64fcc75"}, {"title": "Conversion (Conversion #1)", "author": "S.C. Stephens", "pgs": 19, "sum": "Storyline: \nConversion (Conversion #1) Emma is content. She's got a promising career in front of her, great friends, and a pretty amazing family. But her love life has been a little lacking lately. That's when fate steps in, and she crashes into a tall, dark and handsome man—Teren Adams. He’s single, successful, an extraordinary gentleman, but he’s also secretive. And some of his secrets are more unusual than most people’s. For instance, he’s a “little bit” vampire. He has fangs, incredible hearing, unbelievable speed, and, on occasion, he enjoys drinking a steaming cup of blood. But he’s also very much alive. He has a heartbeat, loves steak as well as cappuccinos, and has no problems walking around during the day. Since Teren acts human the majority of the time, the pros far outweigh the cons in Emma’s book. But when it becomes apparent that Teren’s condition is much more serious than he first lets on, and that being in a relationship with him requires more sacrifices than most would be willing to make, will Emma stay? Is love enough to compensate for a life that will never be anywhere near normal? But then again...what's normal anyway?", "hash": "2b84f3d2-a9e1-4a88-b133-2e74ed37e289"}, {"title": "Bloodlines (Conversion #2)", "author": "S.C. Stephens", "pgs": 22, "sum": "Storyline: \nBloodlines (Conversion #2) Emma has admittedly made some bad decisions in her life, but she was positive that being with Teren Adams wasn’t one of them. He was everything she’d ever wanted in a man – kind, caring, loyal, loving, and on occasion, a hopeless romantic. True, he was also a vampire, or partially so, and had recently joined the ranks of the undead, but to Emma, that was inconsequential. She was his, he was hers, and she could not wait to be his bride, to mother his children, and to stay by his side for as long as her mortal life would allow her to. At least…that was the plan.", "hash": "7820cbdd-3d66-4a8e-8ff7-6c93fcddf272"}, {"title": "'Til Death (Conversion #3)", "author": "S.C. Stephens", "pgs": 24, "sum": "Storyline: \n'Til Death (Conversion #3) Emma was content with her life. She didn’t want anything to change. Two kids, an amazing husband, and one incredible family, her life had become everything she ever hoped it would be. But there is a downside to having everything that you’ve ever wanted, a downside that Teren and Emma couldn’t possibly have been prepared for. When you have everything that you want…then you also have everything to lose.", "hash": "3d7880d9-9b01-473a-858e-a8959cf60da0"}, {"title": "Night Embrace (Dark-Hunter #2)", "author": "Sherrilyn Kenyon", "pgs": 21, "sum": "Storyline: \nNight Embrace (Dark-Hunter #2) Camulus cursed Talon, decreeing death for everyone he loved. Now a Dark-Hunter in modern-day New Orleans, Talon meets Sunshine, who is key to ending his curse once and for all. Not to mention helping him to save New Orleans from an ancient god bent on total destruction. See original cover listed below. The cover shown here is the reissued cover that was done seven years ago.", "hash": "c3d410f2-ef66-40aa-b91d-da9c8f25de16"}, {"title": "Kiss of the Night (Dark-Hunter #4)", "author": "Sherrilyn Kenyon", "pgs": 20, "sum": "Storyline: \nKiss of the Night (Dark-Hunter #4) What do you get when you have an immortal Viking warrior no one can remember five minutes after he leaves their presence, and a demon on the run for her life who is being pursued by one seriously pissed-off demigod? That would be my life. It started out simple enough. One night I went to save a woman in trouble. The next thing I knew, the doorway to hell had opened and out stepped Daimons- soul-sucking vampires the likes of which I’d never seen before. Led by the son of Apollo, they are out to end the curse that has banished them all to darkness. The only problem with that is they have to kill Cassandra Peters to do it and if she dies, so dies the sun, the earth and all who dwell here. Life’s just a bowl full of cherries, ain’t it? Brought together by fate, it’s now my job to protect a daughter of the very race I have been hunting for centuries. Neither of us dares to trust the other. But if we don’t find a way to overcome our differences and to bridge thousands of years of animosity, we won’t die alone. We’ll take the entire world with us.", "hash": "bb34aa0b-d158-46d1-90db-29d1cc4bfbb8"}, {"title": "Seize the Night (Dark-Hunter #6)", "author": "Sherrilyn Kenyon", "pgs": 19, "sum": "Storyline: \nSeize the Night (Dark-Hunter #6) Valerius isn't a popular Dark-Hunter-he's a Roman, which means that the largely Greek Hunters have a major grudge against him and his civilization for superceding them. To make things worse, he's very conscious of his aristocratic background and breeding. So it serves him right when he runs into Tabitha Devereaux. She's sassy, sexy, and completely unwilling to take him seriously. (Not to mention that she's the twin sister of the wife of former Dark-Hunter Kyrian-Val's mortal enemy.) What Tabitha does take seriously is hunting and killing vampires-and soon she and Val have to grapple with the deadliest of all Daimons-one who's managed to come back from the dead, and one who holds a serious grudge against both of them. To win against evil, Val will have to loosen up, learn to trust, and put everything on the line to protect a man he hates and a woman who drives him nuts.", "hash": "00c9af87-81d9-4edc-b1f8-c93afe83bcf0"}, {"title": "Sins of the Night (Dark-Hunter #7)", "author": "Sherrilyn Kenyon", "pgs": 24, "sum": "Storyline: \nSins of the Night (Dark-Hunter #7) But every now and again a Dark-Hunter thinks himself above the Code. That's when I'm summoned. Who am I? I'm the one thing the fearless fear. Step over the line and it's my wrath you will face. Nothing can touch me. Nothing can sway me. I am relentless and unfeeling. Or so I thought until I met a female Dark-Hunter who goes by the name of Danger-it's not just her name, it's how she lives her life. She doesn't trust me at all. And who could blame her? She alone knows that I'm here to be judge, jury and most likely executioner of her friends. Yet she is my key to saving some of them. Without her, they all will die. Dangereuse St. Richard is a deadly distraction. Something about her is reawakening a heart I thought was long dead. But in a race against evil, the only hope mankind has is that I do my duty. And how can I do my duty when it means that I will have to sacrifice the only woman I've ever loved?", "hash": "0fe1169e-fd0c-4c80-8cad-b3a94ec959e0"}, {"title": "Unleash the Night (Dark-Hunter #8)", "author": "Sherrilyn Kenyon", "pgs": 18, "sum": "Storyline: \nUnleash the Night (Were-Hunter, #3; Dark-Hunter, #8) An orphan with no clan that will claim him, Wren Tigarian grew to adulthood under the close scrutiny and mistrust of those around him. A forbidden blend of two animals - snow leopard and white tiger - Wren has never listened to anyone when there was something he wanted. Now he wants Marguerite. Marguerite D'Aubert Goudeau is the daughter of a prominent U.S. senator who hates the socialite life she's forced to live. Like her mother before her, she has strong Cajun roots that her father doesn't understand. Still, she has no choice but to try and conform to a world where she feels like an outsider. But the world of rich and powerful humans is never to meet the world of the Were-Hunters who exist side by side with them, unseen, unknown, undetected. To break this law is to call down a wrath of the highest order. In order to have Marguerite, Wren must fight not just the humans who will never accept his animal nature, but the Were-Hunters who want him dead for endangering their world. It's a race against time and magic without boundary that could cost Marguerite and Wren not just their lives, but their very souls...", "hash": "a4f627f4-b098-4a38-b35e-4959b39f7fa0"}]