[{"title": "Dark Side of the Moon (Dark-Hunter #9)", "author": "Sherrilyn Kenyon", "pgs": 21, "sum": "Storyline: \nDark Side of the Moon (Were-Hunter, #4; Dark-Hunter, #9) Half animal, half man, wholly dangerous. Locked in eternal battle, a Were-Hunter knows everything about peril and pain. But the greatest threat is yet to come... Susan Michaels was once the hottest reporter on the Beltway Beat until she walked into a setup that ruined her reputation. Now she's working for a small Seattle paper, penning stories about killer moths and alien babies, convinced that her life couldn't get any worse... That was before an idea for a breaking news piece brings her to a local animal shelter where she ends up listening to her source rant about vampires and gets coerced into adopting a cat despite her allergies. But when her new pet suddenly reveals himself to be a gorgeous - and lethal - shapeshifter, Susan realizes that there's far more at stake than a career-saving by-line. Born into a world of predators, Were-Hunter Ravyn Kontis was betrayed by those he loved best. Soulless, pitiless, he has spent three hundred years battling the Diamons who seek to subjugate humankind. And with the ultimate battle about to begin, this one very human woman holds the power to shatter both their worlds...", "hash": "13b3002b-6a6c-4a90-8366-886a9ef69bf2"}, {"title": "The Dream-Hunter (Dark-Hunter #10)", "author": "Sherrilyn Kenyon", "pgs": 22, "sum": "Storyline: \nThe Dream Hunter (Dream-Hunter, #2; Dark-Hunter, #10) What she doesn't know is that Arik holds more than the ancient secrets that can help her find the mythical isle of Atlantis. He has made a pact with the god Hades: In exchange for two weeks as a mortal man, he must return to Olympus with a human soul. Megeara's soul. With a secret society out to ruin her expedition, and mysterious accidents that keep threatening her life, Megeara refuses to quit. She knows she's getting closer to Atlantis and as she does, she stumbles onto the truth of what Arik really is. For Arik his quest is no longer simple. No human can know of a Dream-Hunter's existence. His dream of being mortal has quickly turned into his own nightmare and the only way to save himself will be to sacrifice the very thing he wanted to be human for. The only question is, will he?", "hash": "32cc823c-586a-4e84-99c5-f446478b70ed"}, {"title": "Devil May Cry (Dark-Hunter #11)", "author": "Sherrilyn Kenyon", "pgs": 22, "sum": "Storyline: \nDevil May Cry (Dark-Hunter #11) As an ancient Sumerian god, Sin was one of the most powerful among his pantheon.  . . Until the night Artemis brutally stole his godhood and left him for dead. For millennia, this ex-god turned Dark-Hunter has dreamed only of regaining his powers and seeking revenge on Artemis. If only life were that simple. Unfortunately he has bigger fish--or in Sin's case--demons, to fry. The lethal gallu that were buried by his pantheon are now stirring and they are hungry for human flesh. Their goal is to destroy mankind and anyone else who gets in their way.  Sin is the only one who can stop them--that is if a certain woman doesn't kill him first. Unfortunately, Sin discovers that now he must rely on her or witness an annihilation of biblical proportions. Enemies have always made strange bedfellows, but never more so than when the fate of the world hangs in the balance. Now a man who knows only betrayal must trust the one person most likely to hand him to the demons. Artemis may have stolen his godhood, but this one has stolen his heart. The only question is will she keep it or feed it to the ones who want him dead?", "hash": "e2f745d1-06ac-4e05-87c1-b23a7c93c58d"}, {"title": "Upon the Midnight Clear (Dark-Hunter #12)", "author": "Sherrilyn Kenyon", "pgs": 11, "sum": "Storyline: \nUpon the Midnight Clear (Dream-Hunter, #3; Dark-Hunter, #12) Ever think Scrooge had it right before the ghosts ruined his life? Meet Aidan O'Conner. At one time he was a world-renowned celebrity who gave freely of himself and his money without wanting anything in return...until those around him took without asking. Now Aidan wants nothing of the world--or anyone who's a part of it. When a stranger appears at his doorstep, Aidan knows he's seen her before…in his dreams. Born on Olympus as a goddess, Leta knows nothing of the human world. But a ruthless enemy has driven her from the world of dreams and into the home of the only man who can help her: Aidan. Her immortal powers are derived from human emotions--and his anger is just the fuel she needs to defend herself… One cold winter's night will change their lives forever… Trapped together in a brutal winter storm, Aidan and Leta must turn to the only power capable of saving them--or destroying them both: trust.", "hash": "3408fe6d-9f17-4a6e-828d-e586583a20ab"}, {"title": "Dream Chaser (Dark-Hunter #13)", "author": "Sherrilyn Kenyon", "pgs": 18, "sum": "Storyline: \nDream Chaser (Dream-Hunter, #4; Dark-Hunter, #13) Hades doesn’t often give second chances... Xypher has one month on Earth to redeem himself through one good deed or be condemned to eternal torture in Tartarus. But redemption means little to a demigod who only wants vengeance on the one who caused his downfall. Until one day in a cemetery... Simone Dubois is a medical examiner with a real knack for the job. Those who are wrongfully killed appear to her and help her find the evidence the police need to convict their killers. But when a man appears and tells her that she’s more than just a psychic, she’s convinced he’s insane. Now the fate of the world hangs in her hands... It was bad enough when just the dead relied on her. Now’s there’s the seductive Dream-Hunter Xypher who needs Simone’s help in opening a portal to the Atlantean hell realm to fight insatiable demons. The future of mankind is at stake—and so is her life. The only question now is: Who is the bigger threat: the demons out to kill her, or the man who has left her forever changed?", "hash": "5e8a1d77-7c6f-4879-a813-af46c283f35b"}, {"title": "Acheron (Dark-Hunter #14)", "author": "Sherrilyn Kenyon", "pgs": 48, "sum": "Storyline: \nAcheron (Dark-Hunter #14) Eleven thousand years ago a god was born. Cursed into the body of a human, Acheron spent a lifetime of shame. However, his human death unleashed an unspeakable horror that almost destroyed the earth. Then, brought back against his will, Acheron became the sole defender of mankind. Only it was never that simple. For centuries, he has fought for our survival and hidden a past he’ll do anything to keep concealed. Until a lone woman who refuses to be intimidated by him threatens his very existence. Now his survival, and ours, hinges on hers and old enemies reawaken and unite to kill them both. War has never been more deadly... or more fun.", "hash": "0e423989-da9f-4c24-8cd4-e9b46dff86d5"}, {"title": "One Silent Night (Dark-Hunter #15)", "author": "Sherrilyn Kenyon", "pgs": 14, "sum": "Storyline: \nOne Silent Night (Dark-Hunter #15) While the world carries on unawares, Stryker, who leads an army of demons and vampires, is plotting an all out onslaught against his enemies—which, unfortunately for us, includes the entire human race. To avenge his sister, Stryker prepares to annihilate the Dark-Hunters. But things go awry when his oldest enemy returns. Enter his ex-wife. Zephyra. Just when he thought nothing could stop him, he’s now embroiled in a centuries old war with a shrew who gives new meaning to pain.", "hash": "cf2ab872-4498-4006-bd05-597c848f2116"}, {"title": "Dream Warrior (Dark-Hunter #16)", "author": "Sherrilyn Kenyon", "pgs": 20, "sum": "Storyline: \nDream Warrior (Dream-Hunter, #5; Dark-Hunter, #16) We are the Dolophoni. Diligent. Vigilant. Fierce and inescapable. Servants of the Furies, we are the right hand of justice and no one stands before us. The son of Warcraft and Hate, Cratus spent eternity battling for the ancient gods who birthed him. He was death to any who crossed him. Until the day he laid down his arms and was banished into exile. Now an ancient enemy has been unleashed and our dreams are his chosen battlefield. The only hope we have is the one god who swears he will never fight again. As a Dream-Hunter, Delphine has spent eternity protecting mankind from the predators who prey on our unconscious state. But now that her allies have been turned, she knows in order to survive, the Dream-Hunters need a new leader. Someone who can train them to fight their new enemies. Cratus is her only hope. But she is a bitter reminder of why he chose to lay down his arms. Time is running out and if she can’t win him to her cause, mankind will be slaughtered and the world we know will soon cease to exist.", "hash": "63762ee3-e180-4fb4-8de8-f65cb14da4c8"}, {"title": "Bad Moon Rising (Dark-Hunter #17)", "author": "Sherrilyn Kenyon", "pgs": 32, "sum": "Storyline: \nBad Moon Rising (Hellchaser, #3; Were-Hunter, #5; Dark-Hunter, #17) Fang Kattalakis isn't just a wolf. He is the brother of two of the most powerful members of the Omegrion: the ruling council that enforces the laws of the Were-Hunters. And when war erupts among the lycanthropes, sides must be chosen. Enemies are forced into shaky alliances. And when the woman Fang loves is accused of betraying her people, her only hope is that Fang believes in her. Yet in order to save her, Fang must break the law of his people and the faith of his brothers. That breech could very well spell the end of both their races and change their world forever. The war is on and time is running out...", "hash": "64ba5694-4206-4575-9c40-bde3e58b97b4"}, {"title": "No Mercy (Dark-Hunter #18)", "author": "Sherrilyn Kenyon", "pgs": 22, "sum": "Storyline: \nNo Mercy (Were-Hunter, #6; Dark-Hunter, #18) Live fast, fight hard and if you have to die then take as many of your enemies with you as you can. That is the Amazon credo and it was one Samia lived and died by. Now in contemporary New Orleans, the immortal Amazon warrior is about to learn that there’s a worse evil coming to slaughter mankind than she’s ever faced before. Shapeshifter Dev Peltier has stood guard at the front of Sanctuary for almost two hundred years and in that time, he’s seen it all. Or so he thought. Now their enemies have discovered a new source of power- one that makes a mockery of anything faced to date. The war is on and Dev and Sam are guarding ground zero. But in order to win, they will have to break the most cardinal of all rules and pray it doesn’t unravel the universe as we know it.", "hash": "b9ead37b-e5e4-45c7-b82d-e8487fcff884"}]