[{"title": "Retribution (Dark-Hunter #19)", "author": "Sherrilyn Kenyon", "pgs": 21, "sum": "Storyline: \nRetribution (Were-Hunter, #7; Dark-Hunter, #19) Harm no human... A hired gunslinger, William Jessup Brady lived his life with one foot in the grave. He believed that every life had a price. Until the day when he finally found a reason to live. In one single act of brutal betrayal, he lost everything, including his life. Brought back by a Greek goddess to be one of her Dark-Hunters, he gave his immortal soul for vengeance and swore he'd spend eternity protecting the humans he'd once considered prey. Orphaned as a toddler, Abigail Yager was taken in by a family of vampires and raised on one belief - Dark-Hunters are the evil who prey on both their people and mankind, and they must all be destroyed. While protecting her adoptive race, she has spent her life eliminating the Dark-Hunters and training for the day when she meeting the man who killed her family: Jess Brady. A gun in the hand is worth two in the holster....", "hash": "62e2f4d9-f748-465d-a08b-53edb9e28e14"}, {"title": "The Guardian (Dark-Hunter #20)", "author": "Sherrilyn Kenyon", "pgs": 22, "sum": "Storyline: \nThe Guardian (Hellchaser, #4; Dream-Hunter, #6; Were-Hunter, #8; Dark-Hunter, #20) Dream-Hunter Lydia has been charged with the most sacred and dangerous of missions: To descend into the Nether Realm and find the missing god of dreams before he betrays the secrets that could kill her and her kind. What she never expects is to be taken prisoner by the Realm’s most vicious guardian… Seth’s time is running out. If he can’t hand over the entrance to Olympus, his own life and those of his people will be forfeit. No matter the torture, Seth hasn’t been able to break the god in his custody. Then there’s the beautiful Dream-Hunter Lydia: She isn’t just guarding the gates of Olympus—she’s holding back one of the world’s darkest powers. If she fails, an ancient curse will haunt the earth once more and no one will be safe. But evil is always seductive...", "hash": "e93c4d92-c868-4d9f-a0ab-f77419456170"}, {"title": "Time Untime (Dark-Hunter #21)", "author": "Sherrilyn Kenyon", "pgs": 20, "sum": "Storyline: \nTime Untime (Hellchaser, #5; Were-Hunter #9; Dark-Hunter, #21) Kateri Avani has been plagued her entire life with dreams she doesn't understand. Images of places she's never been and of a man she's never seen. Her quest for answers has driven her to Las Vegas, where she hopes to finally silence the demons in her mind. What she never anticipates is coming face-to-face with the warrior who has haunted her her entire life. One who belongs to a world the scientist in her refuses to believe is real. Ren Waya came back from the dead to keep the prophecy he began from coming true and ending the world. For thousands of years, he has fought the same evil that once possessed him. But now that evil has found the one person he can't fight. The one person who, against his will, holds the most sacred part of him His heart. But if he doesn't kill Kateri, the deadliest of evils will reemerge and destroy everyone else on the planet. It was a sacrifice he made once. Will he be able to make it again?", "hash": "70001bfd-5251-4caa-b346-897a3905f51d"}, {"title": "Styxx (Dark-Hunter #22)", "author": "Sherrilyn Kenyon", "pgs": 52, "sum": "Storyline: \nStyxx (Dark-Hunter #22) Centuries ago Acheron saved the human race by imprisoning an ancient evil bent on absolute destruction. Now that evil has been unleashed and it is out for revenge. As the twin to Acheron, Styxx hasn’t always been on his brother’s side. They’ve spent more centuries going at each other’s throats than protecting their backs. Now Styxx has a chance to prove his loyalty to his brother, but only if he’s willing to trade his life and future for Acheron’s. The Atlantean goddess of Wrath and Misery, Bethany was born to right wrongs. But it was never a task she relished. Until now. She owes Acheron a debt that she vows to repay, no matter what it takes. He will join their fellow gods in hell and nothing is going to stop her. But things are never what they seem, and Acheron is no longer the last of his line. Styxx and Acheron must put aside their past and learn to trust each other or more will suffer. Yet it’s hard to risk your own life for someone who once tried to take yours, even when it's your own twin, and when loyalties are skewed and no one can be trusted, not even yourself, how do you find a way back from the darkness that wants to consume the entire world? One that wants to start by devouring your very soul?", "hash": "a12df130-7448-41f5-b031-370d76db7735"}, {"title": "Heir to the Shadows (The Black Jewels #2)", "author": "Anne Bishop", "pgs": 86, "sum": "Storyline: \nHeir to the Shadows (The Black Jewels #2) Enough time has passed for the young girl Jaenelle, heir to the magical Darkness, for her physical wounds to heal, while amnesia keeps her frightening memories at bay. But with Saetan--a Black-Jewelled Warlord Prince and Jaenelle's foster-father--to protect her, she will continue to grow. Her magic will mature. Her memories will return. And Jaenelle will face her destiny when she remembers Daemon, Saetan's son, who made the ultimate sacrifice for her love....", "hash": "703de696-7565-4880-82f3-dbb7bf447542"}, {"title": "Queen of the Darkness (The Black Jewels #3)", "author": "Anne Bishop", "pgs": 83, "sum": "Storyline: \nQueen of the Darkness (The Black Jewels #3) Jaenelle Angelline now reigns as Queen-protector of the Shadow Realm. No longer will the corrupt Blood slaughter her people and defile her lands. But where one chapter ends, a final, unseen battle remains to be written, and Jaenelle must unleash the terrible power that is Witch to destroy her enemies once and for all. Even so, she cannot stand alone. Somewhere, long lost in madness, is Daemon, her promised Consort. Only his unyielding love can complete her Court and secure her reign. Yet, even together, their strength may not be enough to hold back the most malevolent of forces.", "hash": "40830fd4-7976-4f7e-9e9c-45ccc2affe3a"}, {"title": "The Invisible Ring (The Black Jewels #4)", "author": "Anne Bishop", "pgs": 72, "sum": "Storyline: \nThe Invisible Ring (The Black Jewels #4) Jared is a Red Jewel Warlord auctioned as a pleasure slave by a notorious queen. He fears he will share the fate of her other slaves, but the Gray Lady may not be what she seems....", "hash": "0174c687-7190-457a-aa5c-5deebe4536ee"}, {"title": "Tangled Webs (The Black Jewels #6)", "author": "Anne Bishop", "pgs": 53, "sum": "Storyline: \nTangled Webs (The Black Jewels #6) The invitation is signed Jaenelle Angelline, she who had been both Witch and Queen. It summons her family to an entertainment she had specially prepared. Surreal SaDiablo, former courtesan and assassin, arrives first. But as she and her escort enter the house, the door disappears. Surreal finds herself trapped in a nightmare created by the tangled webs of Black Widow witches - a nightmare where the monsters are too real. And if she uses Craft to defend herself, she risks being sealed in the house forever. But Jaenelle did not send the invitation. And now Jaenelle and her family must rescue Surreal and the others inside without becoming trapped themselves, and they must also discover who created such an evil place and why. Because there is one thing they all know about this house: No matter who planned it as a way to kill members of the SaDiablo family, only one of the Blood could have created the trap....", "hash": "76a8691b-cff5-4268-ba83-32795dcdfe0d"}, {"title": "The Shadow Queen (The Black Jewels #7)", "author": "Anne Bishop", "pgs": 65, "sum": "Storyline: \nThe Shadow Queen (The Black Jewels #7) From the national bestselling author? the new novel set in the ?darkly fascinating world?(\"SF Site\") of the Black Jewels. Dena Nehele is a land decimated by its past. Once it was ruled by corrupt Queens who were wiped out when the land was cleansed of tainted Blood. Now, only one hundred Warlord Princes stand?without a leader and without hope. Theran Grayhaven is the last of his line, desperate to find the key that reveals a treasure great enough to restore Dena Nehele. But first he needs to find a Queen who remembers the Blood's code of honor and lives by the Old Ways. The woman chosen to rule Dena Nehele, Lady Cassidy, is not beautiful and believes she is not strong. But she may be the only one able to convince bitter men to serve once again.", "hash": "7d6a1d55-4650-4890-91f1-e666e7b264be"}, {"title": "Shalador's Lady (The Black Jewels #8)", "author": "Anne Bishop", "pgs": 87, "sum": "Storyline: \nShalador's Lady (The Black Jewels #8) For years the Shalador people suffered the cruelties of the corrupt Queens who ruled them, forbidding their traditions, punishing those who dared show defiance, and forcing many more into hiding. Now that their land has been cleansed of tainted Blood, the Rose-Jeweled Queen, Lady Cassidy, makes it her duty to restore it and prove her ability to rule. But even if Lady Cassidy succeeds, other dangers await. For the Black Widows see visions within their tangled webs that something is coming that will change the land-and Lady Cassidy-forever...", "hash": "1e20f8a4-4c1d-4823-add2-95b7d8d5954f"}]