[{"title": "Daughter of the Blood (The Black Jewels #1)", "author": "Anne Bishop", "pgs": 77, "sum": "Storyline: \nDaughter of the Blood (The Black Jewels #1) The Dark Kingdom is preparing itself for the fulfillment of an ancient prophecy--the arrival of a new Queen, a Witch who will wield more power than even the High Lord of Hell himself. But this new ruler is young, and very susceptible to influence and corruption; whoever controls her controls the Darkness. And now, three sworn enemies begin a ruthless game of politics and intrigue, magic and betrayal, and the destiny of an entire world is at stake.", "hash": "46217d08-2fa5-40f5-a8dd-2bee602b6755"}, {"title": "Dreams Made Flesh (The Black Jewels #5)", "author": "Anne Bishop", "pgs": 80, "sum": "Storyline: \nDreams Made Flesh (The Black Jewels #5) The national bestselling Black Jewels trilogy established award-winning Anne Bishop as an author whose \"sublime skill...blends the darkly macabre with spine-tingling emotional intensity, mesmerizing magic, lush sensuality, and exciting action.\"* Now the saga continues-with four all-new adventures of Jaenelle and her kindred.", "hash": "77ce02ca-15c6-4cdb-b0d4-ed5352a607c8"}, {"title": "Some Girls Bite (Chicagoland Vampires #1)", "author": "Chloe Neill", "pgs": 16, "sum": "Storyline: \nSome Girls Bite (Chicagoland Vampires #1) They killed me. They healed me. They changed me. Sure, the life of a graduate student wasn’t exactly glamorous, but I was doing fine until Chicago’s vampires announced their existence to the world. When a rogue vampire attacked me, I was lucky he only got a sip. Another bloodsucker scared him off and decided the best way to save my life was to make me the walking undead. Now I’ve traded sweating over my thesis for learning to fit in at a Hyde Park mansion full of vamps loyal to Ethan “Lord o’ the Manor” Sullivan. Of course, as a tall, green-eyed, four-hundred-year-old vampire, he has centuries’ worth of charm, but unfortunately he expects my gratitude—and servitude. Right… But someone’s out to get me. Is it the rogue vampire who bit me? A vamp from a rival House? An angry mob bearing torches? My initiation into Chicago’s nightlife may be the first skirmish in a war—and there will be blood.", "hash": "baa23488-eefa-4cbd-b4c2-595394ef5cd5"}, {"title": "Friday Night Bites (Chicagoland Vampires #2)", "author": "Chloe Neill", "pgs": 25, "sum": "Storyline: \nFriday Night Bites (Chicagoland Vampires #2) Vamps in Chicago! You’d think headlines like that would have provoked the fine citizens of the Windy City to take up arms against us bloodsucking fiends. Instead, ten months later, we’re enjoying a celebrity status reserved for the Hollywood elite—fending off paparazzi only slightly less dangerous than cross and stake-wielding slayers. Don’t get me wrong, Joe Public isn’t exactly thrilled to be living side-by-side with the undead, but at least they haven’t stormed the castle yet. But all that will change once they learn about the Raves—mass feeding parties where vampires round up humans like cattle and drink themselves silly. Most civilized vampires frown on this behavior, putting mere mortals at ease with their policy of asking a person’s consent before taking a big gulp of the red stuff. However, that doesn’t make good copy for a first time reporter looking to impress his high society family. So now my “master,” the centuries old, yet gorgeously well-preserved Ethan Sullivan, wants me to reconnect with my own upper class family and act as liaison between humans and vampires—and keep the more unsavory aspects of our existence out of the media. But someone doesn’t want people and vamps to play nicey-nice—someone with an ancient grudge.", "hash": "a600a6d2-b124-4df8-ac74-23043b919057"}, {"title": "Twice Bitten (Chicagoland Vampires #3)", "author": "Chloe Neill", "pgs": 24, "sum": "Storyline: \nTwice Bitten (Chicagoland Vampires #3) Merit, Chicago’s newest vampire, is learning how to play well with others. Other supernaturals, that is. Shapeshifters from across the country are convening in the Windy City, and as a gesture of peace, Master Vampire Ethan Sullivan has offered their leader a very special bodyguard: Merit. Merit is supposed to protect the Alpha, Gabriel Keene—and to spy for the vamps while she’s at it. Oh, and luckily Ethan’s offering some steamy, one-on-one combat training sessions to help her prepare for the mission. Merit must accept the assignment, even though she knows that she’ll probably regret it. And she’s not wrong. Someone is gunning for Gabriel Keene, and Merit soon finds herself in the line of fire. She’ll need all the help she can get to track down the would-be assassin, but everywhere she turns, there are rising tensions between supernaturals—not least between her and a certain green-eyed, centuries old master vampire.", "hash": "c78bade0-496b-4274-a26c-b8cb88084fe2"}, {"title": "Hard Bitten (Chicagoland Vampires #4)", "author": "Chloe Neill", "pgs": 25, "sum": "Storyline: \nHard Bitten (Chicagoland Vampires #4) Times are hard for newly minted vampire Merit. Ever since shapeshifters announced their presence to the world, humans have been rallying against supernaturals—and they're camping outside of Cadogan House with protest signs that could turn to pitchforks at any moment. Inside its doors, things between Merit and her Master, green-eyed heartbreaker Ethan Sullivan, are tense. But then the mayor of Chicago calls Merit and Ethan to a clandestine meeting and tells them about a violent vamp attack that has left three women missing. His message is simple: get your House in order. Or else. Merit needs to get to the bottom of this crime, but it doesn't help that she can't tell who's on her side. So she secretly calls in a favor from someone who's tall, dark, and part of an underground vamp group that may have some deep intel on the attack. Merit soon finds herself in the heady, dark heart of Chicago's supernatural society—a world full of vampires who seem to be ready to fulfill the protesting human's worst fears, and a place where she'll learn that you can't be a vampire without getting a little blood on your hands.", "hash": "7740af0d-334c-4571-9368-71e12d61c933"}, {"title": "Drink Deep (Chicagoland Vampires #5)", "author": "Chloe Neill", "pgs": 19, "sum": "Storyline: \nDrink Deep (Chicagoland Vampires #5) Clouds are brewing over Cadogan House, and recently turned vampire Merit can’t tell if this is the darkness before the dawn or the calm before the storm. With the city iself in turmoil over paranormals and the state threatening to pass a paranormal registration act, times haven’t been this precarious for vampires since they came out of the closet. If only they could lay low for a bit, and let the mortals calm down. That’s when the waters of Lake Michigan suddenly turn pitch black-and things really start getting ugly. Chicago’s mayor insists it’s nothing to worry about, but Merit knows only the darkest magic could have woven a spell powerful enough to change the very fabric of nature. She’ll have to turn to friends old and new to find out who’s behind this, and stop them before it’s too late for vampires and humans alike.", "hash": "0c8d2a92-8567-4596-963b-180713a7962a"}, {"title": "Biting Cold (Chicagoland Vampires #6)", "author": "Chloe Neill", "pgs": 24, "sum": "Storyline: \nBiting Cold (Chicagoland Vampires #6) Turned into a vampire against her will, twenty-eight-year-old Merit found her way into the dark circle of Chicago’s vampire underground, where she learned there was more to supernaturals than met the eye—and more supernaturals than the public ever imagined. And not all the secrets she learned were for sharing—among humans or inhumans. Now Merit is on the hunt, charging across the stark American Midwest, tailing a rogue supernatural intent on stealing an ancient artifact that could unleash catastrophic evil on the world. But Merit is also the prey. An enemy of Chicagoland is hunting her, and he’ll stop at nothing to get the book for himself. No mercy allowed. No rules apply. No lives spared. The race is on.", "hash": "5c62fe29-85ae-4abd-98d1-3e5edbf748bd"}, {"title": "House Rules (Chicagoland Vampires #7)", "author": "Chloe Neill", "pgs": 20, "sum": "Storyline: \nHouse Rules (Chicagoland Vampires #7) In a city full of vampires, trouble never sleeps. At the tender age of twenty-seven, Merit became a sword-wielding vampire. Since then, she’s become the protector of her House, watched Chicago nearly burn to the ground, and seen her Master fall and rise. Now she’ll see her mettle—and her metal—tested like never before. It started with two . . . Two rogues vanishing without a trace. Someone is targeting Chicago’s vampires, and anyone could be next. With their house in peril, Merit and her Master, the centuries-old Ethan Sullivan, must race to stop the disappearances. But as they untangle a web of secret alliances and ancient evils, they realize their foe is more familiar, and more powerful, than they could have ever imagined.", "hash": "fceb608c-bfa1-4827-9672-98e304af4e06"}, {"title": "Biting Bad (Chicagoland Vampires #8)", "author": "Chloe Neill", "pgs": 20, "sum": "Storyline: \nBiting Bad (Chicagoland Vampires #8) Merit has been a vampire for only a short while, but she's already seen a lifetime's worth of trouble. She and her Master, centuries-old Ethan Sullivan, have risked their lives time and again to save the city they love. But not all of Chicago is loving them back. Anti-vampire riots are erupting all over town, striking vampires where it hurts the most. A splinter group armed with Molotov cocktails and deep-seated hate is intent on clearing the fanged from the Windy City come hell or high water. Merit and her allies rush to figure out who's behind the attacks, who will be targeted next, and whether there's any way to stop the wanton destruction. The battle for Chicago is just beginning, and Merit is running out of time.", "hash": "f6626426-0938-4d0f-8b62-fc434d283278"}]