[{"title": "Wild Things (Chicagoland Vampires #9)", "author": "Chloe Neill", "pgs": 57, "sum": "Storyline: \nWild Things (Chicagoland Vampires #9) Since Merit was turned into a vampire, and the protector of Chicago’s Cadogan House, it’s been a wild ride. She and Master vampire Ethan Sullivan have helped make Cadogan’s vampires the strongest in North America, and forged ties with paranormal folk of all breeds and creeds, living or dead…or both. But now those alliances are about to be tested. A strange and twisted magic has ripped through the North American Central Pack, and Merit’s closest friends are caught in the crosshairs. Gabriel Keene, the Pack Apex, looks to Merit and Ethan for help. But who—or what—could possibly be powerful enough to out-magic a shifter? Merit is about to go toe to toe, and cold steel to cold heart, to find out.", "hash": "0fbb4f34-8166-48cc-82b2-9789d6542897"}, {"title": "Howling For You (Chicagoland Vampires #8.5)", "author": "Chloe Neill", "pgs": 11, "sum": "Storyline: \nHowling For You (Chicagoland Vampires #8.5) Jeff Christopher is a shapeshifter and ally of Chicago’s Cadogan House of vampires—he’s also a tech whiz and mostly-legal hacker. And the only protective shields he’s never been able to find a way around are those of the powerful Keene Family. For a long time, Jeff has only had eyes for the beautiful Fallon Keene. Unfortunately, she is the only sister of the lethal North American Central Pack Apex Gabriel Keene. The intricate balances of power and politics make it all but impossible for Fallon to trust her feelings. But fate takes a hand when the Pack’s totem is stolen—threatening the Keene family’s rule—and Fallon enlists Jeff’s help to retrieve it before the Pack is thrown into chaos. Can she and Jeff find the totem, and restore order, before it’s too late? And will Jeff finally be able to prove himself to the only person he truly loves?", "hash": "89a5b34b-297c-4d04-a677-aede562589e6"}, {"title": "Twilight's Dawn (The Black Jewels #9)", "author": "Anne Bishop", "pgs": 61, "sum": "Storyline: \nTwilight's Dawn (The Black Jewels #9) Anne Bishop's \"darkly fascinating\"* (SF Site) Black Jewel novels have enthralled readers and critics alike with their mixture of fantasy, intrigue, and romance. Now in Twilight's Dawn, Bishop returns to the Blood realm with four all-new captivating novellas.", "hash": "40bcac68-c662-4b0c-9db4-83a494357cfc"}, {"title": "Ascension (Guardians of Ascension #1)", "author": "Caris Roane", "pgs": 81, "sum": "Storyline: \nAscension (Guardians of Ascension #1) Vampire. Warrior. Legend. Lover. Discover a secret, sensual world of winged vampire warriors and the women they crave—in an epic battle between unearthly longing and immortal love... On The Wings Of Desire Alison Wells is no ordinary woman. Born with supernatural powers, she can never make love to a man without putting him in grave danger. But when her special vision reveals a glorious muscled man soaring overhead on mighty wings, she feels an overwhelming attraction she cannot resist—even as he tells her: \"I have come for you. Your blood belongs to me.\" In The Heat Of Passion Kerrick is a vampire and a warrior who has fought his hunger for a woman's love for the past two hundred years. As a Guardian of Ascension, he is sworn to protect Alison from the death vamp armies who crave her blood and her power. But Kerrick has cravings of his own—a forbidden longing to open his heart and veins to Alison. To share his blood...satisfy his thirst...and seal their fates forever.", "hash": "54ceb6ef-a305-4901-9f16-c80cb63cffa9"}, {"title": "Burning Skies (Guardians of Ascension #2)", "author": "Caris Roane", "pgs": 81, "sum": "Storyline: \nBurning Skies (Guardians of Ascension #2) THE HUNGER WITHIN A vampire warrior in exile, Marcus Amargi resists the call to return to the ranks of the Guardians who fight the death vamp armies. Here on Mortal Earth, Marcus has another battle on his hands -- the seductive lure of Havily Morgan. The woman meant for him. Whose blood he craves. The one who comes to him in dreams -- and demands his surrender... THE FIRE UNLEASHED A beautiful immortal with extraordinary powers, Havily lives in the realm of Second Earth but, in her fantasies, yearns for her winged lover Marcus. Soon, their bond will be put to the ultimate test. When their bloodthirsty enemies set the night on fire with sky-blazing weapons, Marcus and Havily must unite body and soul, to unleash the full power of their passion -- and fight fire with fire...", "hash": "26fa54de-ccac-498e-85e8-8902bcfca65e"}, {"title": "Brink of Eternity (Guardians of Ascension #3)", "author": "Caris Roane", "pgs": 22, "sum": "Storyline: \nBrink of Eternity (Guardians of Ascension #2.5) Guardians of Ascension novella, tracks vampire Militia Warrior Gideon, who is on the brink of becoming an elite Warrior of the Blood. The Militia Warriors strive to keep the peace on Second Earth while battling death vampires whenever they can. Brink of Eternity gives a glimpse into the Militia Warrior world as Gideon breaks all the rules to protect his ex-girlfriend, Elise, during her rite of ascension, a process that puts her directly in the path of a dozen lethal enemies.", "hash": "31906440-a5fa-4e16-81e2-881cdd388135"}, {"title": "Wings of Fire (Guardians of Ascension #3)", "author": "Caris Roane", "pgs": 80, "sum": "Storyline: \nWings of Fire (Guardians of Ascension #3) By night, the winged warrior Antony Medichi fights the death vampires who threaten his world. By day, he hunts the rogue vampires who invade Mortal Earth. But deep in his heart rages the fiercest battle of all—his soul-searing passion for the one mortal he is sworn to protect…the one woman he is doomed to love. Parisa Lovejoy is so beautiful, and so powerful, that Antony cannot fight the feelings she arouses. But his unexpected love only intensifies his strength as her Guardian—a strength that is put to the ultimate test when Parisa is abducted. Her captor, Commander Greaves, enslaves mortal women for their blood. If Parisa hopes to survive—and ascend—she must forge an even deeper bond with Antony…in the flames of eternity.", "hash": "1f0e83c3-9958-47c1-9764-e334f15ca502"}, {"title": "Born of Ashes (Guardians of Ascension #4)", "author": "Caris Roane", "pgs": 76, "sum": "Storyline: \nBorn of Ashes (Guardians of Ascension #4) For years, she was kept as a human slave—one of seven unwilling “blood donors” for the death vampires who thirst for absolute power. Now, Fiona is a free woman, haunted by her memories of being strapped to a gurney, drained of blood, then revived at the last moment. She lives to avenge her captors—but only one warrior can help her... Jean-Pierre has lived and fought for over two-hundred years. He knows the triumph of slaying a death vampire, but has never known anything like the feelings that arise when he becomes Fiona’s guardian. Her beauty, her pain, her passion—and her growing power—consume his senses. Now the warrior must draw his sword once more…and fight the gates of hell itself—for love.", "hash": "41fdb622-11a4-4674-b781-626aa318613f"}, {"title": "Obsidian Flame (Guardians of Ascension #5)", "author": "Caris Roane", "pgs": 76, "sum": "Storyline: \nObsidian Flame (Guardians of Ascension #5) For a hundred years, Marguerite has been imprisoned and used for her powerful psychic abilities. Her only relief comes from her regular visits with Thorne, her vampire lover.  His every touch leaves her hungry for more..and aching for their next encounter. When Marguerite is finally set free, she returns to Mortal Earth to begin a new life for herself.  She dyes her hair white-blonde, paints her nails blood-red, and seduces a sexy-hot stranger. Why can’t she stop thinking about Thorne? Now that Marguerite is gone, Thorne craves her more than ever..and follows her to Mortal Earth.  Unfortunately, he is not the only vampire who wants her. As one of three powerful women with obsidian flame abilities, Marguerite is a valuable treasure—and a dangerous weapon. For Thorne, she is a soulmate he must protect at any cost…even his own life.", "hash": "882239f5-c2e8-4ca7-ae27-1b651a533586"}, {"title": "Embrace the Dark (The Blood Rose #1)", "author": "Caris Roane", "pgs": 27, "sum": "Storyline: \nEmbrace the Dark (The Blood Rose #1) How can he resist his blood rose… Gerrod, mastyr vampire of the Merhaine Realm, never thought to have his blood-needs satisfied by a mere human. But Abigail is no ordinary woman. She stuns him with her telepathy as well as the richness of her blood. However, her human DNA makes her an unacceptable mate. Yet how can Gerrod turn her away when she alone has satisfied his blood-starvation for the first time in a hundred-and-fifty-years? Will she fall to temptation and give herself to a vampire… When the dreaded enemy of all realm-folk, the Invictus, attacks at a fae wedding, Abigail’s simple human life gets turned upside down. She doesn’t know if she has the courage to pursue a path that means giving herself body and soul to a mastyr vampire. Will she return to her normal existence in Flagstaff, Arizona? Or will she embrace the dark…", "hash": "687d66c2-6afb-42ed-b75a-c532bef2e851"}]