[{"title": "The Unwanted Wife (Unwanted #1)", "author": "Natasha Anders", "pgs": 13, "sum": "Storyline: \nThe Unwanted Wife (Unwanted #1) All Alessandro de Lucci wants from his wife is a son but after a year and a half of unhappiness and disillusionment, all Theresa de Lucci wants from her ice cold husband is a divorce. Unfortunate timing, since Theresa is about to discover that she’s finally pregnant and Alessandro is about to discover that he isn’t willing to lose Theresa.", "hash": "7a94311e-450f-48ea-bdd4-8428d9f82c53"}, {"title": "Shattered (The Secret Life of Trystan Scott #4)", "author": "H.M. Ward", "pgs": 14, "sum": "Storyline: \nI run. I run out the front door of my house sobbing. I don't know what I think or what I need. I just know that I want Trystan, but when I get to his house, something's wrong. When Trystan pulls the door open, it seems like he is going to walk out, which is strange since he's not wearing a shirt and his hair is damp. I glance at his face - his blue eyes are wild. They're too big, like he has no idea what to do, like I'm the last person he expected on his doorstep.", "hash": "e56e257e-145e-493f-bf85-0511ae975f56"}, {"title": "Secrets Vol 2 Ella Steele (Secrets #2)", "author": "H.M. Ward", "pgs": 20, "sum": "Storyline: \nSexy thoughts about Cole fill Anna's dreams. Every detail burns brightly in her mind; the way his hands feel on her bare skin, the soft brush of his lips against hers, and the way their bodies fit perfectly together. Anna awakes breathless, tingling as if it really happened. What caused her to think about Cole like that? It was completely forbidden. And Anna didn't feel that way about him, at least she didn't think she did. Cole was fun to flirt with, that's all, and the sexual tension between them was normal, right? Everyone has that from time to time with some super-hot guy. It made sense. Her mind was just telling her that she needs a boyfriend. But what if Cole's the right guy? What if he's right there and Anna lets him slip through her fingers? Cole's more than she bargained for, with enough sex appeal to make Anna realize everything she's been missing.", "hash": "ff2b399f-9379-4331-8afd-1cec1b4cdc6f"}, {"title": "Going Under (Going Under #1)", "author": "Georgia Cates", "pgs": 40, "sum": "Storyline: \nGoing Under (Going Under #1) Jessie Boone is a self proclaimed bad boy and doesn’t march to the beat of anyone’s drum, but his own. Growing up in less than desirable circumstances has made him no stranger to the hard knock life and his determination to leave it behind is fierce. When he finds himself transferred to East Franklin High School, he sees his opportunity to use his athletic ability to snag a college football scholarship, but Forbes Henderson, the player Jessie means to replace isn’t giving up his spot willingly. In fact, Forbes is willing to go to extreme measures to retain his place as first string quarterback. When Forbes’ malicious plan to injure his replacement fails, Jessie is furious and determined to show him he messed with the wrong person; not only is he going to take the position of first string quarterback, he’s going to take his girl, too. Claire Deveraux is perfection at it’s best. She is beautiful, intelligent and unaware she just became Jessie Boone’s conquest as revenge against her boyfriend, Forbes Henderson. Like her flawless performance as the perfect daughter and student, Claire’s production of being the perfect girlfriend has everyone fooled, except Jessie Boone, and she fears this tattooed bad boy will see her secret desire to explore his crude threats and promises to rock her perfect world. If she decides to give in to one uninhibited moment with Jessie, will she learn too late that it was all an act of vengeance or will Jessie learn the taste of first love is sweeter than that of revenge?", "hash": "183e1505-1285-4daf-b377-0d7ed77034dc"}, {"title": "Shallow (Going Under #2)", "author": "Georgia Cates", "pgs": 41, "sum": "Storyline: \nShallow (Going Under #2) Payton Archer's best friend, Claire, strives to be perfect in every way. Payton doesn't and this is her story. Nick Hawke likes his car fast and his girls even faster. He blows through females quicker than his muscle car races down the \"The Strip\" in Collinsville and he wouldn’t have it any other way. Determined to avoid the devastation he has watched his father endure in the aftermath of his mother leaving, he believes there is no room in his life or his heart for a relationship lasting more than one night. He seeks happiness in things that won’t let him down...fast cars, adrenaline and one night stands. To his absolute dismay, all of that changes when he unexpectedly runs into an old friend and is introduced to Payton Archer, the first girl he ever wanted for more than one night. There’s only one catch...she is completely immune to him and his smooth talking ways.", "hash": "c0f7acf9-ead3-488c-9657-6ea7e8e79370"}, {"title": "Beauty from Pain (Beauty #1)", "author": "Georgia Cates", "pgs": 49, "sum": "Storyline: \nBeauty from Pain (Beauty #1) They agreed on three months...but their love knew no boundaries. Jack McLachlan is a winemaking magnate and easily one of Australia’s most eligible bachelors. His success and wealth make him no stranger to the complications of romantic relationships and that’s why he goes to extreme measures to avoid the hassle. He prefers simplicity in the form of a beautiful female companion with no strings attached. He arranges relationships like business deals and they’re always the same. No long term relationships. No real names. It’s his game and his rules. He’s content to play as usual, but when Laurelyn Prescott enters his life, his strategy must change because this player is like none he's ever encountered. His world is turned on its head after he begins a three month affair with the beautiful American musician. Nothing goes according to plan and as he breaks more and more of his own rules for her, she’s exceptionally close to becoming something he never thought possible. His ultimate game changer. Not recommended for younger readers due to sexual content and language.", "hash": "72843de6-297b-4a94-8a44-bccff2981c88"}, {"title": "Beauty from Surrender (Beauty #2)", "author": "Georgia Cates", "pgs": 50, "sum": "Storyline: \nBeauty from Surrender (Beauty #2) How do you move on when he’s every song you sing? After Laurelyn Prescott walks away from the love of her life, she returns to Nashville to pursue the only dream she has left. Determined to find a distraction from the pain of losing Jack Henry, she immerses herself in her music. But with her old life comes old acquaintances and new expectations. When Laurelyn refuses her record producer’s outrageous demands, she finds herself without a career—until an unforeseen opportunity presents itself. From there it’s a rocket ride straight to the top where Laurelyn finds the success she’s always dreamed of. Will it be enough to bring her the happiness she so deserves, or will the absence of Jack Henry leave her wanting more? Jack Henry McLachlan never expected to fall in love with Laurelyn Prescott—but he did. After he foolishly let her slip through his fingers, he spends three months searching for her, but their reunion doesn’t come easy. The woman he finds isn’t the same one who drifted away without a goodbye. No longer an insecure girl on an Australian adventure, this Laurelyn is a successful musician with a promising career. Her dreams are becoming a reality, and Jack is terrified his American girl won’t have a place for him in her new life. With only a month to convince her otherwise, will it be enough time to make her visualize a life beyond the glitz and glamour, a life that includes him?", "hash": "49cb8298-f46b-43b1-8d39-9718d0468257"}, {"title": "Awaken To Pleasure ", "author": "Nalini Singh", "pgs": 30, "sum": "Storyline: \n\"WHAT WOULD YOU SAY TO MARRYING ME?\" The proposal was as unexpected as her feelings for the man whose dark good looks rivaled an even darker past. Painful experience screamed that Taylor Reid should run far and fast from Jackson Santorini. But keeping custody of her brother meant becoming her former boss's bride. And giving Jackson a baby. Despite his powerful size and presence, Jackson had been wounded...deeply...by a woman. Yet he'd protected her at a personal cost, if his restrained ardor in deference to her virginal apprehension was one indication. Suddenly, for Jackson's sake, Taylor wanted to replace pain with pleasure. Only, she'd never imagined what sensations--and secrets--she would awaken....", "hash": "2d492747-31a2-44a6-814e-162ceabd15d1"}, {"title": "Love's Prisoner (Wyndham Werewolf #1)", "author": "MaryJanice Davidson", "pgs": 14, "sum": "Storyline: \nLove's Prisoner (Wyndham Werewolf #1) Trapped in an elevator, Jeannie Lawrence experienced unwilling rapture at Michael Windham's hands. She never expected the devilishly handsome man to show back up in her life \u0097 or turn out to be a werewolf! Will she accept her destiny to be his mate?", "hash": "b5538ddc-23da-4bee-8a5c-10d748db1699"}, {"title": "Jared's Wolf (Wyndham Werewolf #2)", "author": "MaryJanice Davidson", "pgs": 15, "sum": "Storyline: \nJared's Wolf (Wyndham Werewolf #2) Jared Rocke will do anything avenge his sister's death, even believe in werewolves. What he doesn?t believe is that he's attracted to Moira Wolfbauer, the she-wolf sworn to protect her pack. In Jared's Wolf, two enemies must join forces to stop a killer while learning that love defies all boundaries--even those between species.", "hash": "007ba74e-1446-4043-b228-1faa69a06bd8"}]