[{"title": "Born in Chains (Men in Chains #1)", "author": "Caris Roane", "pgs": 49, "sum": "Storyline: \nBorn in Chains (Men in Chains #1) Chained For Life Two years ago, the rogue vampires invaded Lily Haven's home and kidnapped her son. Now, if she hopes to see her child again, she must do the unthinkable—bind herself, body and soul, to a vampire warrior. She must choose one of the rogue army's prisoners of war and force him to do her bidding. But when she sees the warrior, Adrien, naked, beaten, and straining against his chains, it is she who is held captive… Hungry For More Adrien has been waiting for her. A beautiful woman who appears to him in visions. Who soothes his tortured body, feeds his erotic cravings—and quenches his thirst for blood. But Lily is more than he ever hoped for. She is the master of his destiny, and he is her willing slave. Even when she asks him to find the ultimate weapon for his enemies, he must obey her. Even if the task destroys them both, he will fight for her love, forever…", "hash": "138be0be-7ab4-4c2a-ba34-feeade6fc15a"}, {"title": "The Darkening (Dawn of Ascension #2)", "author": "Caris Roane", "pgs": 32, "sum": "Storyline: \nThe Darkening (Dawn of Ascension #2) He thwarted connection of any kind… Fearing that his newly emerged grayle power will kill innocent ascenders, Samuel Daman struggles to keep his distance from beautiful Vela Stillwell. But the breh-hedden has struck and her light floral scent tears at his restraint. When the enemy draws them both into the darkening, a place of secret travel for Third ascenders, will Samuel learn to control his power, or will he destroy what he desires most? She hid from grief… Vela Stillwell wanted a new life, away from Militia Headquarters, away from the reminder of all she’d lost when her husband died five years earlier. Seeking a more reclusive occupation, she finishes her last day of work only to have Samuel Daman and the infamous breh-hedden sweep through her life. Though trying to disconnect from her new emerging power and from Samuel, the call of the darkening pulls Vela into an adventure that both terrifies her, yet reveals the truth about her deepest desires. Will she succumb to the breh-hedden, or will her fears prevent her from living life to the fullest?", "hash": "401be2d5-2aad-4b4c-9258-df8828182bc9"}, {"title": "Lycan Unleashed (Files of the Otherworlder Enforcement Agency #3)", "author": "Tiffany Allee", "pgs": 25, "sum": "Storyline: \nLycan Unleashed (Files of the Otherworlder Enforcement Agency #3) Detective Astrid Holmes is a sensitive, a human capable of feeling the energy of otherworlders. When she is dispatched to the horrific murder scene of a local vampire, she expects it to be just another day on the job. But when evidence is stolen on her watch, she is removed—not only from the investigation, but from her job as a member of the Chicago police department’s paranormal unit. Astrid’s only hope of reinstatement lies with her ex co-worker and almost-lover, Lycan Mason Sanderson. But convincing the OWEA agent to let her assist with the investigation isn’t nearly as difficult as staying alive when the murderer realizes that Astrid may hold the key to unlocking his identity. Fighting to take down a killer could have deadly consequences for Astrid and Mason, but working together puts their already fragile relationship in jeopardy.", "hash": "a4dad492-ae02-4f83-852e-8245e8c156e8"}, {"title": "Vampire Games (Files of the Otherworlder Enforcement Agency #4)", "author": "Tiffany Allee", "pgs": 23, "sum": "Storyline: \nVampire Games (Files of the Otherworlder Enforcement Agency #4) She’s seen the past… OWEA Agent Beatrice Davis is haunted by the death visions that help her solve crimes. When Detective Claude Desmairis, her vampire ex-lover, asks for her assistance on a case, she’d rather help him than take the mandated leave to stave off her burn-out. The truth won’t stay buried… Pressed to solve a series of crimes before the perpetrator blows the vampire world apart, Claude turns to a woman he thought he’d been able to leave behind. But he was wrong, and his feelings for her will only bring trouble in an investigation this dangerous. As their passions reignite, they see a possible future together. Until her visions show her the face of the murderer—a man Claude can never betray.", "hash": "e50b1ecc-1712-421b-a2f3-595965286a38"}, {"title": "Heels and Heroes ", "author": "Tiffany Allee", "pgs": 15, "sum": "Storyline: \nBrenda is a second-rate superhero, normally more concerned with uniform fashion than defeating bad guys. But when a violent, new super villain declares war against her city, she suddenly finds her specialized power to deafen sound in high demand. As if facing the destructive force of a new enemy isn’t bad enough, she finds herself paired with the powerful, yet emotionally d...", "hash": "a33164cf-2e16-4756-ace0-c59b39d95a9f"}, {"title": "Don't Bite the Bridesmaid (Sons of Kane #1)", "author": "Tiffany Allee", "pgs": 35, "sum": "Storyline: \nDon't Bite the Bridesmaid (Sons of Kane #1) Alice Shepard needs one thing: a date for her sister's wedding. And not just any date. A hunk who will make her fiancé rue the day he left her for her best friend. Her drop-dead gorgeous neighbor fits the bill—even if he is a bit quirky and never comes out during the day—and Alice has downed just enough appletinis to ask him. But she makes it quite clear that there will be no funny business. Spending a week on a cruise ship full of humans while sleeping close to his sexy next-door neighbor sounds like a helluva bad idea to vampire Noah Thorpe. But his friends need time to get him out of a shotgun wedding—a vampire bonding that will tie his fate to a female vampire he's never met. And Alice's offer comes at just the right time. What could possibly go wrong?", "hash": "d59c6232-7b3c-4cb4-a7a6-7bcba408c978"}, {"title": "Cursed (The Devil's Roses #1)", "author": "Tara Brown", "pgs": 49, "sum": "Storyline: \nCursed (The Devil's Roses #1) Sometimes the scariest things in life aren’t the Vampires and the Werewolves. Since the dawn of time there have been things God doesn’t want to know about. Which is why he created the Devil's Roses. There is a place between worlds where our souls take a moment, before they go to Heaven. It is a quiet place where everything feels as if it has paused. It is here that Aimee James first meets him. He is standing over her dead body. He is more beautiful than anything she has ever seen. Waking in the hospital after the first attempt is made on her life, Aimee discovers the missing pieces of her memory may have something to do with the one thing she does remember. A man. Not just any man, but a beautiful man who has enchanted her from her dreams. No one else saw him or recalls him, but Aimee isn't convinced that he doesn't exist. From the moment she wakes, she is thrust upon a journey that will contradict everything she holds true in the world and reveal secrets about her mother's untimely death. In the end Aimee must choose between life and love, as death is forced upon her once again.", "hash": "323b3bbc-14c7-4fb3-8884-72f3db00a0b5"}, {"title": "Bane (The Devil's Roses #2)", "author": "Tara Brown", "pgs": 41, "sum": "Storyline: \nBane (The Devil's Roses #2) \"Ari, this is Aimee James. She’s different, like you.” The old lady smiled brightly, “Until you get to know each other, I wouldn’t go holding hands. Who knows what’ll happen.” This is the second book of the completed series, The Devil's Roses Aimee is now a Devil's Rose. She has a ring that makes her brand of deadly force acceptable. She has killed every flavor of bad. Vampires, shifters, weres, demons, Nephilim. She has lived through nearly every kind of loss, and yet that still can't prepare her for the arrival of Ari. Tattoo's, piercings, scars, and a poor attitude are pasted across the girl's face when she arrives at the old haunted house where Aimee has found refuge. The problem with Ari, this isn't Ari. She isn't the girl she was a day ago. She's something else. Something powerful and dark and dangerous. Something very few have ever seen.", "hash": "52cf40e9-0a0f-4fe7-92de-cbf381ee51fd"}, {"title": "Witch (The Devil's Roses #4)", "author": "Tara Brown", "pgs": 42, "sum": "Storyline: \nWitch (The Devil's Roses #4) The old house at the end of the haunted street seems emptier with the people missing and the lives lost. Sam thinks he has Hanna all to himself now but The Roses have other plans. Ari and Aimee struggle to cope with the changes they've suffered through, the newest one being Giselle. She is thrust into the role of Vampire Royalty and with it come certain obligations and limitations. None of them really have much time to feel sorry for themselves and the deaths of their loved ones. An ancient bloodline, tracing as far back as Adam and Lillith, is discovered with an heir to the power living closer than they thought. Enter the young and confused Ophelia, who has no idea of the power she has or the role she plays in it all. Time is running out for the Roses. The Devil's Roses Mature Readers Recommended", "hash": "0837e798-7d85-4341-8674-d4b45dd7e480"}, {"title": "Death (The Devil's Roses #5)", "author": "Tara Brown", "pgs": 47, "sum": "Storyline: \nDeath (The Devil's Roses #5) Sadness looms over the old mansion at the end of the road where the massive oaks and willows line the street. With no one recovering from the losses they have experienced and D-Day creeping up on them, Ari decides to make a final push. Only this time she has a little help from O. Between the strongest magic in the world and the control Ari has learned, they hope they will be able to manipulate the time change and make everything better with a single push. There is one thing they don't account for, Angels. Angels and the gifts they bestow upon us change us. Sometimes permanently.", "hash": "9b5cf4e9-ec92-47db-b2f8-8b4d505c9b0e"}]