[{"title": "Dark Secrets (Dark Secrets #1)", "author": "A.M. Hudson", "pgs": 100, "sum": "Storyline: \nDark Secrets (Dark Secrets #1) How can you be attracted to a guy who just said he wants to kill you? Ara-Rose asks herself the same question. She’s been torn away from her old life, thrown into a new one in a new country, and in the midst of death, heartache and depression, she finds herself in love with a vampire—one who kills people with his teeth! But the vampire is forbidden to fall for this human, and at the point Ara-Rose decides she can’t live without him, he pulls away and leaves her falling back to the darkness he woke her from. She will be caught up in a century-old feud among brothers, and the fight for love becomes a fight for her life. The only question now is whether her beloved vampire will find her in time, or leave her to face a destiny he triggered with their first kiss. Since their release in 2011, Books 1 & 2 from the Dark Secrets series have come together, presented as one great book for one low price.", "hash": "dc35aa1b-7d03-4724-84cd-a3dceb0c492c"}, {"title": "Mark of Betrayal (Dark Secrets #3)", "author": "A.M. Hudson", "pgs": 81, "sum": "Storyline: \nMark of Betrayal (Dark Secrets #3) A love so strong fire and torture could not break it. A heart so pure neither death nor hate could taint it. But, left alone in a world of lies and secrets, Ara will find herself down the road of treachery, walking very dangerous ground, while those closest to her fight to keep her safe from dangers unseen. The boundaries between friends and enemies will blur, and the return of an old friend will see Ara crossing a line she can never return from.", "hash": "e2c52169-d8a7-40a0-b722-915222ceb71a"}, {"title": "Lies in Blood (Dark Secrets #4)", "author": "A.M. Hudson", "pgs": 82, "sum": "Storyline: \nLies in Blood (Dark Secrets #4) The ashes of a dark past fall away, and a new sun rises in place—bringing light to a nation once thought lost to ancient secrets. All that has been done in pursuit of vengeance will be undone for peace, and an age-old agreement will finally be met. At last, the child who became a queen will pave the way through the blood of others’ lies, and the betrayal on her soul will mark the beginning of a new future—one even she could not have predicted. All the lies will finally come undone. All the truths will finally be out, but with the layers of deception shifting and evolving, so spawns a new secret Ara must carry alone—one she will fight to take to her grave.", "hash": "1cb20cbc-b749-4219-9915-c239948bdd3f"}, {"title": "Twilight Phantasies (Wings in the Night #1)", "author": "Maggie Shayne", "pgs": 18, "sum": "Storyline: \nTwilight Phantasies (Wings in the Night #1) In two centuries of living death, Eric Marquand had never once cried out against the cruel fate that had condemned him to walk forever in shadow. But then, he found the woman he knew was his chosen one--and understood that to possess her was to destroy her... Tamara Dey trembled at the aura of dread and despair that enshrouded this creature of the night. And yet, against all reason, she saw clearly that her destiny was eternally entwined with his, and that she must know--even welcome--the terror and the splendor of the vampire's kiss... For centuries, loneliness has haunted them from dusk till dawn. Yet now, from out of the darkness, shines the light of eternal life...eternal love.", "hash": "cd1193c1-44f0-4791-afb9-7db60433256c"}, {"title": "Twilight Memories (Wings in the Night #2)", "author": "Maggie Shayne", "pgs": 15, "sum": "Storyline: \nTwilight Memories (Wings in the Night #2) Roland de Courtemanche had rejected Rhiannon's affections for centuries, banishing her to exist alone in eternal darkness. Yet now the man she loved and the boy in his care were in serious danger. For Rhiannon to stay away was impossible... Resisting Rhiannon took strength--strength Roland needed in order to protect his young ward. Yet to succumb to his desire and then cast her away would be to drive a stake through her heart...exactly what the avenging mortal on their trail had in mind for them all... For centuries, loneliness has haunted them from dusk till dawn. Yet now, from out of the darkness, shines the light of eternal life...eternal love.", "hash": "58d49081-6cc8-4f12-9110-6179f5c908b4"}, {"title": "Twilight Illusions (Wings in the Night #3)", "author": "Maggie Shayne", "pgs": 16, "sum": "Storyline: \nTwilight Illusions (Wings in the Night #3)  Master of the damned There could be no doubt that the one called Damien was the master of shadows, the greatest of his accursed kind. But now his ancient mantle of mystic power was threatened by a terrible weakness--a fatal passion for a woman of mortal flesh and blood... Suspicion had first drawn Shannon Mallory into the darkness, in search of the truth behind the legends that swirled around this man--if man he was. But it was not suspicion that kept her there, or even fear--it was pure, stunning desire... For centuries, loneliness has haunted them from dusk till dawn. Yet now, from out of the darkness, shines the light of eternal life...eternal love.", "hash": "485b3861-b7f9-49f4-a2ce-5612247fd67b"}, {"title": "Beyond Twilight (Wings in the Night #4)", "author": "Maggie Shayne", "pgs": 13, "sum": "Storyline: \nBeyond Twilight(Wings in the Night #4) He twisted away, but her hands were still there. Burning him. Whispering across his chest like wind over water. He shivered. He sweat. He gasped for air but inhaled only her scent. He reached for sanity and found his fingers entangled in short, satiny hair. He opened his eyes and found them captured by hers. Huge, dark, innocent. Imploring, hot, sexy eyes, staring down at him as he lay trembling with desire on his bed. And he knew he was lost. He lifted his arms, slid them around her small body to pull her down to his chest. Parted his lips to taste her succulent mouth...", "hash": "cb64596b-e383-448a-b424-258cbbffac9c"}, {"title": "Born in Twilight (Wings in the Night #5)", "author": "Maggie Shayne", "pgs": 16, "sum": "Storyline: \nBorn In Twilight (Wings in the Night #5) Meeting a starving and beautiful vampire, Jameson Bryant is unable to resist giving her his blood and spending a night of passion with her, nine months after which their child is born.", "hash": "08384c66-c02e-435b-ae87-be57dfd92bca"}, {"title": "Twilight Vows (Wings in the Night #6)", "author": "Maggie Shayne", "pgs": 13, "sum": "Storyline: \nTwilight Vows(Wings in the Night #6) Rachel Sullivan had hoped to learn his secrets but found herself at the mercy of mysterious vampire Donovan O'Roark. Now her sexy captor was about to discover her own desire: to give up her innocence to the man she'd always loved.", "hash": "2a6bc138-0729-4d7b-b341-5c32e30fd193"}, {"title": "Twilight Hunger (Wings in the Night #7)", "author": "Maggie Shayne", "pgs": 27, "sum": "Storyline: \nTwilight Hunger (Wings in the Night #7) When struggling screenwriter Morgan DeSilva uncovers the ancient leather diaries in the attic of an old house in Maine, she is swept into the seductive world of a long-dead madman who had believed himself a vampire. Now, though Dante's story has made her rich and famous, Morgan is wasting away. At night she dreams of him, an erotic fantasy so real she can see the marks on her neck, feel her life's blood draining from her. Almost as if he were real... He comes to her at night. Watching her. Wanting her. She is one of The Chosen. She can be his, if he desires. And he desires it so much that he is filled with a terrible fear. He knows that his kiss can save her from destiny's curse, and from the enemies who stalk them both. But to save her, he must trust her. With his life. With his love. With the promise of immortality.", "hash": "73b39a86-e71c-4146-adf1-b6b0835aa820"}]