[{"title": "Embrace The Twilight (Wings in the Night #8)", "author": "Maggie Shayne", "pgs": 23, "sum": "Storyline: \nEmbrace The Twilight (Wings in the Night #8) A creature of the night, Sarafina lives only for pleasure, but love is an emotion she has deemed forbidden. Experience has taught her that love leads only to betrayal and pain, and she wants no more of pain. She cares for no one, tolerating only the presence of those she can control utterly. With her powers, she is convinced she can break anyone. Willem Stone cannot be broken. He is a challenge Sarafina cannot resist--a man as boldly alive as she is, a man with a will of iron, yet a mere mortal. And the only thing stronger than the clash of their wills is the power of their desire. But when vampire hunters take Amber Lily, the only child ever born to a vampire, Sarafina and Willem must put their struggle aside and combine their strengths in a rescue attempt that could cost them their very lives. And in the process, they find the most powerful force of all: love.", "hash": "cd679255-8678-4f03-86e6-8be7dc33adb4"}, {"title": "Run from Twilight (Wings in the Night #9)", "author": "Maggie Shayne", "pgs": 13, "sum": "Storyline: \nRun from Twilight (Wings in the Night #9) A serial killer who strikes by the light of the full moon has made Mary McLean his next target. She knows she should be cautious, but she can't stay away from Michael Gray, a mysterious man with an unearthly secret. But is he there to protect her? Or is he the real danger?", "hash": "493b4d5a-70b3-4642-9841-bb2e1bc1d1b6"}, {"title": "Edge of Twilight (Wings in the Night #10)", "author": "Maggie Shayne", "pgs": 26, "sum": "Storyline: \nEdge Of Twilight (Wings in the Night #10) His name is Edge, and he is the last of a band of Immortals murdered by obsessed vampire-hunter Frank Stiles. Vengeance is Edge's obsession, but to destroy Stiles, he must find the woman called the Golden Child. A legend among the undead, Amber Lily is the only half human, half vampire ever born. She shares Edge's need to find Stiles—but she needs to keep him alive. Edge is exciting, irresistible, and despite herself Amber is drawn into his hunt, led by passion to the lair of an evil she may be unable to defeat—to the edge of twilight, where only the Immortals belong.", "hash": "22d4f28f-a9d0-4a10-b70f-d4c9059f1dce"}, {"title": "Blue Twilight (Wings in the Night #11)", "author": "Maggie Shayne", "pgs": 23, "sum": "Storyline: \nBlue Twilight (Wings in the Night #11) The idyllic town of Endover, New Hampshire, looks innocent. But below its surface a thirst and a desire both powerful and ancient boil fiercely. When two girls go missing, only one person can delve deep enough to find them - Maxine Stuart, a private investigator who has finally started to believe. \"Mad Maxie\" understands why she was asked to help - no living mortal knows as much about the undead as she. But the dark force controlling Endover can see all, and will use Maxine's knowledge against her to strengthen his hold on the town. Not even the influence of Lou Malone, the man Maxie most desires, can convince her to abandon the crusade against a madman's yearning for power...and resurrected love.", "hash": "4287f720-83a9-4dcc-936b-3d170ec8dbee"}, {"title": "Prince of Twilight (Wings in the Night #12)", "author": "Maggie Shayne", "pgs": 17, "sum": "Storyline: \nPrince Of Twilight (Wings in the Night #12) Far older than his legend, the immortal Vlad Dracul has wandered the earth for centuries in search of the reincarnation of his wife, Elisabeta. Now he believes he has found the woman possessed by his beloved's soul and is prepared to make her his for all eternity. Tempest \"Stormy\" Jones is that mortal. She has long sensed the other, someone inside her fighting to take control, a feeling that becomes even stronger when the dark prince is near. But as Stormy denies the passion that burns between them, she also resists allowing Elisabeta to take over her mind and body to prevent her from claiming Vlad as her own. But when Elisabeta discovers Vlad's feelings for Stormy, her wrath knows no bounds. She demands that her destiny be fulfilled, and seeks to destroy her rival, leaving Vlad in anguish, tormented by what was...and what could be. Now only he can choose--who will live and who will die.", "hash": "075655a6-fb4f-479d-974e-a6b508398310"}, {"title": "Demon's Kiss (Wings in the Night #13)", "author": "Maggie Shayne", "pgs": 27, "sum": "Storyline: \nDemon's Kiss (Wings in the Night #13) Even by vampire standards, Reaper is a loner, and his current mission to destroy a gang of rogue bloodsuckers is definitely a one-vamp job. Then fate takes a hand, and before he knows it, he's surrounded by a ragtag crew of misfit helpers: the newbie, the princess, the shape-shifter and the human healer. Seth is new to immortality, but he's sharp and strong&#151;and he'll risk anything for the rogues' strange female captive, a secretive creature he doesn't understand but feels compelled to save. Vixen is confused by the emotions that swirl through her at the sight of her impulsive hero. She only hopes the brutal Gregor and his bloodthirsty renegades will leave her alive long enough to explore them. Or will Reaper himself be the one to destroy them all?", "hash": "cf5b3d29-c8b9-4d79-bf9f-8f4c3c2cecd8"}, {"title": "Lover's Bite (Wings in the Night #14)", "author": "Maggie Shayne", "pgs": 17, "sum": "Storyline: \nLover's Bite (Wings in the Night #14) Before she joined Reaper in hunting Gregor's gang of rogue bloodsuckers, privileged princess Topaz was gunning for just one vamp: Jack Heart. The gorgeous con man had charmed his way into her bed, her heart and her bank account, taking her for half a million dollars and vanishing without a word.Now she and Jack--maddeningly attractive as ever-- are supposedly on the same side. As Reaper's ragtag outfit scatters, Topaz sets out to solve a mystery that's plagued her all her lives, mortal and immortal: what really happened to her movie-star mother, who died when Topaz was just a baby? With four men claiming to be her father, why has she always been alone? And what stake does Jack have in discovering the truth about her past? Topaz is sure he's up to something--but her suspicions are at war with her desires....", "hash": "7e1730f1-b2da-484b-8b24-587e1de9b2c4"}, {"title": "Angel's Pain (Wings in the Night #15)", "author": "Maggie Shayne", "pgs": 19, "sum": "Storyline: \nAngel's Pain (Wings in the Night #15) Briar needs just two things: blood and vengeance. The first sustains her immortal life; the second gives it meaning. First on her hit list is Gregor, the renegade vampire who schooled her in brutality, then betrayed and tortured her. To achieve her deadly ends, Briar joins the inscrutable Reaper and his misfit gang of vampires who are also hunting her old mentor. But once she's destroyed Gregor, she'll be gone. The group means nothing to her. Not even Crisa&#151;damaged, defenseless, a liability in every way&#151;the childlike vamp with whom Briar shares a blood bond. Or Reaper. Though they shared one moment of pure passion, it's not as though Briar has feelings for him. Because Briar needs no one. She needs only to satisfy her twin hungers&#151;ones that may ultimately consume her.", "hash": "da956541-4a4e-4624-9b8d-1d4bcfabd79b"}, {"title": "Bloodline (Wings in the Night #16)", "author": "Maggie Shayne", "pgs": 22, "sum": "Storyline: \nBloodline (Wings in the Night #16) When Ethan discovers the terrified woman hiding on his ranch, he knows immediately not only who she is, but what. He's never forgotten her, not in all the time since he escaped their joint prison, a clandestine CIA facility where humans are bred into vampires willing to kill on command. He refused to accept that fate, and since he won his freedom he's become a legend to those he left behind. With her own escape, Lilith has become a legend, too, and now—together—they have no choice but to fight those who would become a legend by killing one.", "hash": "3faf7072-0e01-4fa7-8ce6-b1727fb91609"}, {"title": "Twilight Prophecy (Wings in the Night #17)", "author": "Maggie Shayne", "pgs": 24, "sum": "Storyline: \nTwilight Prophecy (Wings in the Night, #17) According to ancient prophecy, there's only one chance to avert the complete annihilation of the Undead. Twins James William and Brigit Poe, part human, part vampire, believe that they \"are\" that chance. In truth, the key lies with the reclusive--and mortal--scholar Lucy Lanfair.As Armageddon approaches, antivampire sentiment fuels a war neither side can win, driving James to abandon his moral code and draw Lucy into a deadly battle she wants no part of. But Lucy soon realizes that she holds this powerful immortal's soul in her hands and that it's her destiny not only to stop a war but to save him from his inner darkness. If she fails, his race will die--and so will her heart. Is the power of love strong enough to save the world?", "hash": "1f0a1c36-07ad-4f73-866d-7f4d6ea9be6e"}]