[{"title": "Twilight Fulfilled (Wings in the Night #18)", "author": "Maggie Shayne", "pgs": 23, "sum": "Storyline: \nTwilight Fulfilled (Wings in the Night #18) Utanapishtim has paid dearly for the sin of creating the vampire race—imprisoned in a living death for centuries, driven to near madness. With a single white-hot glance, he immolates his descendants…and the vampire Armageddon begins. Beautiful and deadly Brigit Poe, not wholly vampire but fiercely loyal to that shared bloodline, is called into action. She abhors yet cannot deny her destiny: to vanquish the once-great king of the immortals and save the vampire race. Two warriors, equally matched in power and determination, are soon locked in an unwinnable battle, only to discover a passion so shocking it threatens every truth they've ever known—even as they must face one final battle that seems fated to end in death and heartbreak for them both.", "hash": "3ba546be-2e09-454c-9600-a0e1c31326bf"}, {"title": "Before Blue Twilight (Wings in the Night #11)", "author": "Maggie Shayne", "pgs": 20, "sum": "Storyline: \nBefore Blue Twilight (Wings in the night #10.5) I'd lived alone for so many centuries that I'd had enough, and so I'd decided to end it that night, and I prayed to whatever gods might exist that there was no such thing as the immortality of the soul, or that if there was, I had lost mine long ago. I had no desire to go on. Not then. Not in any form.", "hash": "eb9ddc34-de57-4e86-91a9-e9ae100a634e"}, {"title": "Because Your Vampire Said So (Broken Heart #3)", "author": "Michele Bardsley", "pgs": 24, "sum": "Storyline: \nBecause Your Vampire Said So (Broken Heart #3) Not just anyone can visit Broken Heart, Oklahoma, especially since all the single moms—like me, Patsy Donahue—have been turned into vampires. I’m forever forty, but looking younger than my years, thanks to my new (un)lifestyle. And even thought most of my customers have skipped town, I still manage to keep my hair salon up and running because of the lycanthropes prowling around. They know how important good grooming is—especially a certain rogue shape-shifter who is as sexy as he is deadly. Now, if only I could put a leash on my wild teenage son. He’s up to his neck in danger. The stress would kill me if I wasn’t already dead. But my maternal instincts are sill alive and kicking, so no one better mess with my flesh and blood.", "hash": "1c220057-4270-41b6-a4eb-69dab65dc534"}, {"title": "Wait Till Your Vampire Gets Home (Broken Heart #4)", "author": "Michele Bardsley", "pgs": 28, "sum": "Storyline: \nWait Till Your Vampire Gets Home (Broken Heart #4) Undead fathers really do know best... To prove her journalistic chops, Libby Monroe ends up in Broken Heart, Oklahoma, chasing down bizarre rumors of strange goings-on -- and finding vampires, lycanthropes, and zombies. She never expects to fall in lust with one of them, but vampire/single dad Ralph Genessa is too irresistible. Only the town is being torn in two by a war between the undead -- and Libby may be the only thing that can hold Broken Heart together", "hash": "d14a36ce-c3a6-489e-899c-fda138fe8f6f"}, {"title": "Reaper (End of Days #1)", "author": "Mina Carter", "pgs": 9, "sum": "Storyline: \nReaper (End of Days #1)  The World after the End of the World will never be the same again… Sanctuary. Clichéd name, but the sentiment is still the same. Ten years after the end of the world, ex-soldier Mason and a small group of humans defend their fortified town against creatures of myth and legend made real. But with dwindling game to hunt and a lycan pack in the area looking for an easy meal, just surviving is getting harder every day. Andy has a few screws loose, and she knows it. She’s been on the road since the bombs fell and changed humanity forever. Driven by inhuman instincts, she tracks the newly and soon-to-be dead and dispatches their souls to the afterlife. Sometimes they go quietly, most put up a fight. She doesn’t care either way. Her ambition in life is to find her next hit of coffee and one day, maybe, sleep in a real bed again. Then Andy’s instincts bring her to Sanctuary and its enigmatic leader, Mason, and even the world after the end of the world will never be the same again… Warning: Contains a snarky female Reaper with a hair-trigger temper and a caffeine addiction, a hot ex-commando with an attitude and a twisted sense of humour and a happily ever after that defies death itself.", "hash": "aee33e6c-7e6f-45f4-be9e-12ba7c287eb0"}, {"title": "Dark Gold (Dark #3)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Gold (Dark #3) Was he a man...or a miracle? Alexandria Houton would sacrifice anything - ever her life - to protect her orphaned little brother. But when both encountered unspeakable evil in the swirling San Francisco mists, Alex could only cry to heaven for their deliverance... And out of the darkness swooped Aidan Savage, a golden being more powerful, more mysterious than any other creature of the night. The ageless Carpathian male snatched them from a hideous fate. But was Aidan a miracle...or a monster? Alex's salvation...or her sin? If she surrendered to Aidan's savage, unearthly seduction - gave him the color, the light, the family he craved - would Alex truly save her brother? Or sacrifice more than her life?", "hash": "afe10649-55e2-4a81-9543-84c572dba410"}, {"title": "Dark Magic (Dark #4)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Magic (Dark #4) Young Savannah Dubrinsky is a mistress of illusion, a world-famous magician capable of mesmerizing millions. But there is one--Gregori, the Dark One--who holds her in terrifying thrall. Whose cold silver eyes and heated sensuality send shivers of danger, of desire, down her slender spine. With a dark magic all his own, Gregori--the implacable hunter, the legendary healer, the most powerful of Carpathian males--whispers in Savannah's mind that he is her destiny. That she was born to save his immortal soul. And now, here in New Orleans, the hour has finally come to claim her. To make her completely his. In a ritual as old as time ... and as inescapable as eternity.", "hash": "206a13b0-4da8-46a6-8bec-fc8192cac037"}, {"title": "Dark Challenge (Dark #5)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Challenge (Dark #5) Julian Savage was golden. Powerful. But tormented. For the brooding hunter walked alone, always alone, far from his Carpathian kind, alien to even his twin. Like his name, his existence was savage. Until he met the woman he was sworn to protect... When Julian heard Desari sing, rainbows swamped his starving senses. Emotions bombarded his hardened heart. And a dark hunger to possess her flooded his loins, blinding him to the danger stalking him. And even as Desari enflamed him, she dared to defy him with mysterious, unparalleled feminine powers. Was Desari more than his perfect mate? Julian had met his match in this woman, but would she drive him to madness... or save his soul?", "hash": "5303b7eb-a3d8-446a-95dc-d1567414237f"}, {"title": "Dark Fire (Dark #6)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Fire (Dark #6) \"There is always a price to pay.\" So Darius warned her when she accepted a position with his traveling troupe. And gazing mesmerized at the merciless slash of his mouth, the implacable resolve on his face, the soulless emptiness of his black eyes, Tempest was afraid to ask what it was. She had always been different, apart from others. From the moment his arms closed around her, enveloping her in a sorcerer's spell, Darius seemed to understand her unique gifts. But did his kiss offer the love and belonging she sought, or a danger more potent than his own panthers? Somewhere deep inside herself, Tempest, realized she knew the answer. She had no choice but to accept the velvet stroke of his tongue, 'submit to the white-hot heat piercing her skin, welcome an erotic pleasure like no other. . . .", "hash": "755ae3e5-0cac-46c6-b001-ec10a1a8dfe4"}, {"title": "Dark Dream (Dark #7)", "author": "Christine Feehan", "pgs": 11, "sum": "Storyline: \nDark Dream (Dark #7) She’s known him since she was fifteen. Every night, he is with her: his face, his voice. Tonight, Sara Marten will meet the man who is both angel and demon, salvation and temptation: Falcon—the Carpathian, the banished hero. Tonight, Sara will meet the dark-eyed destroyer destined to be her mate.", "hash": "1d132227-559e-4a82-be29-d873dc3b4cce"}]