[{"title": "Dark Legend (Dark #8)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Legend (Dark #8) He woke deep within the ground, and the first sensation he felt was hunger. An overwhelming hunger for blood that demanded satisfaction. But as he hunted the dark streets of Paris for prey, a voice called to him, soothing, calming, giving him the strength to control his craving. Francesca Del Ponce was a healer, a woman who radiated goodness as powerfully as the sun did light. But surely his obsession with her would turn him as his twin brother had turned, leaving the world with two monsters instead of one. Though he knew she would be like hot silk in his arms, though he knew the taste of her would be addictive, he feared for her life and his soul if he took her. Then with one mind-shattering vow she gave herself -- \"I offer freely, without reservation, I offer my life for yours as is my right\" --and with a firestorm of long-forgotten feelings, he glimpsed salvation.", "hash": "01147924-36ce-453e-902d-fa4ec13b933f"}, {"title": "Dark Guardian (Dark #9)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Guardian (Dark #9) They were masters of the darkness, searching through eternity for a mistress of the light.... He ran with the wolves...materialized from the mists...hijacked the very heavens to his whims. He was the dark guardian of his people. So how, after centuries of a bleak, soulless existence had he, Lucian Daratrazanoff, suddenly come to crave petite, curvy, colorful lady cop Jaxon Montgomery, who foolishly made it her life's work to protect others from harm? Fiercely daring, Jaxx would sacrifice anything to shield others-- particularly since a deadly menace dogged her every footstep, threatening all who got close to her. And strangely seductive, piercingly erotic Lucian was no exception. Lucian was powerfully, perilously mesmerizing--oddly gentle yet clearly a born predator. He had vowed to possess her, to guard her for all time. Yet with his every thirsty kiss, was he drawing Jaxon more deeply into danger . . . and his dark, mysterious desires?", "hash": "afe6fb59-a277-4a1e-9673-785fc0766807"}, {"title": "Dark Symphony (Dark #10)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Symphony (Dark #10) Blinded and scarred in a terrible accident, Antoinetta Scarletti made music that thrilled the world with its beauty and passion. Descended from a long line of psychics, Antoinetta has learned to rely on her other senses to “see” the world around her, but nothing could have prepared her for Byron. He came to her, drawn by her music, and became her secret obsession. Others fear him, sensing that he is dangerous—a predator—but for Antoinetta he is her ultimate fantasy, her dream lover. He woos her with kisses full of erotic allure, whispering that she is his light, his salvation. Byron has waited an eternity for her, and he will let nothing stand between him and the woman born to be his lifemate...", "hash": "3e2e5bf0-1261-4b0f-a255-3636dceac753"}, {"title": "Dark Melody (Dark #12)", "author": "Christine Feehan", "pgs": 19, "sum": "Storyline: \nDark Melody (Dark #12) Lead guitarist of the Dark Troubadours, Dayan was renowned for his mesmerizing performances. His melodies stilled crowds, beckoned, seduced, tempted. And always, he called to her. His lover. His lifemate. He called to her to complete him. To give him the emotions that had faded from his existence, leaving him an empty shell of growing darkness. Save me. Come to me. Corinne Wentworth stood at the vortex of a gathering storm. Pursued by the same fanatics who'd murdered her husband, she was risking her life by keeping more than one secret. Fragile, delicate, vulnerable, she had an indomitable faith that made her fiery surrender to Dayan all the more powerful. This was the one woman whose loss would destroy him, even as her love promised to heal his soul.", "hash": "eb261e50-9348-4bd3-9881-edb0a2827d76"}, {"title": "Dark Hunger (Dark #14)", "author": "Christine Feehan", "pgs": 11, "sum": "Storyline: \nDark Hunger (Dark #14) Christine Feehan has reinvented the vampire novel with her New York Times bestselling Carpathian series. Now she and Berkley take her \"out-of-the- ordinary\" (Booklist) in a thrilling new direction--and this time it's more graphic than ever. Riordan is an immortal Carpathian male, trapped and caged, his honor compromised by his captors. They're in his mind. They're in his blood. And not one can withstand his desire for revenge. Juliette is an activist devoted to liberating animals from a secret jungle lab. What she stumbles upon is a prisoner like no other. She will release him from his bonds. He will release her from her inhibitions.", "hash": "d540d707-ab21-488a-b9d2-0f15cfa305f5"}, {"title": "Dark Destiny (Dark #13)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Destiny (Dark #13) Her childhood had been a nightmare of violence and pain until she heard his voice calling out to her. Golden and seductive. The voice of an angel. He had shown her how to survive, taught her to use her unique gifts, trained her in the ancient art of hunting the vampire. Yet he could not bend her to his will. He could not summon her to him, no matter how great his power. As she battled centuries-old evil in a glittering labyrinth of caverns and crystals, he whispered in her mind, forging an unbreakable bond of trust and need. Only with him can she find the courage to embrace the seductive promise of her ...", "hash": "10b357bb-952e-498a-8e8e-5f6188ef7114"}, {"title": "Dark Secret (Dark #15)", "author": "Christine Feehan", "pgs": 22, "sum": "Storyline: \nDark Secret (Dark #15) Rafael De La Cruz has spent centuries hunting vampires with his brothers, and with each passing year his capacity to feel emotions has grown weaker and weaker until finally there's barely been a memory left-until only sheer willpower keeps him from turning into the very abomination he hunts. But it'll take more than will to keep him away from the woman who is meant to be his and his alone… For five years, rancher Colby Jansen has been the sole protector of her younger half-siblings, and with fierce determination and work she has kept her family together and the ranch operational. Now, the De La Cruz brothers are threatening that stability. They claim that her siblings belong with their father's family, not with her. Colby vows to fight them-especially the cold and arrogant Rafael De La Cruz. But Rafael is after more than her family-he wants Colby and will not let anything stand between them. After ages of loneliness, the raw desire to possess her overwhelms his very soul, driving him to claim her as his lifemate.", "hash": "0883d0c4-361e-4dcd-8dac-ee5296431954"}, {"title": "Dark Demon (Dark #16)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Demon (Dark #16) Christine Feehan has worked magic on a legion of fans with her darkly thrilling Carpathian tales. Now she delivers the provocative story of a female vampire slayer who proves as seductive--and mysterious--as the night dwellers she stalks... For as long as she can remember, Natalya has been fighting demons: first in the form of childhood nightmares, then later, immortal creatures that kill and prey on the innocent--including her own twin brother. Whether Carpathian or vampire, she slays those who murder by night, and has no equal--until she is seduced by the ve thing she considers her enemy... A Carpathian who has seen nearly everything in his endless existence, Vikirnoff doesn't think he can be surprised anymore--until he faces a woman who rival him as a vampire hunter. A formidable and gifted warrior in her own right, Natalya has a nature that is strange familiar--yet alien--to his own. Who is this mysterious female who fears no one--not even him? Natalya could the key to the survival of the Carpathians, but a Vikirnoff is certain of is that she is the key to his hear and soul...", "hash": "91b2ef57-6dce-4abe-a8e9-8c05138ef389"}, {"title": "Dark Celebration (Dark #17)", "author": "Christine Feehan", "pgs": 19, "sum": "Storyline: \nDark Celebration (Dark #17) With her erotically charged Carpathian tales, Christine Feehan has enthralled a legion of fans, captivated by a seductive world and the unforgettable characters--both human and not--who inhabit it. Now, she reunites all of them in a Dark Celebration... After centuries as the prince of the Carpathians, Mikhail Dubrinsky fears he can't protect his people for long from their greatest threat: the extinction of their species at the hands of their immortal enemies--who are devising a scheme to slaughter Carpathian females. But even with his own lifemate, Raven, and their daughter, Savannah, vulnerable to the encroaching evil, Mikhail's hope is not lost. Carpathians from around the world are gathering to join their souls and their powers to bring light to the darkness. But so too are their adversaries uniting--hunters, vampires, demons and betrayers--bringing untold dangers into the fold of the Carpathian people.", "hash": "43d646be-a508-4a19-99c1-92f04fd99d0b"}, {"title": "Dark Possession (Dark #18)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Possession (Dark #18) Christine Feehan returns to her uniquely sensual Carpathian world in a novel about the nature of true love and the unnatural forces that can destroy it... Manolito De La Cruz knew he was dangerously close to turning into a vampire. The last thing he expected after being called back to his Carpathian homeland by Prince Mikhail was to catch the scent of his destined lifemate in MaryAnn Delaney. MaryAnn is human, but she knows all too well the aggressive instincts of Carpathian males. And they're not exactly the kind of men she'd prefer to be bound to for life. A dedicated counselor for battered women, MaryAnn has a fulfilling life with no room for someone like Manolito, born and bred in the Carpathian mountains, a law unto himself. But when MaryAnn agrees to go to South America to offer guidance to a brutalized young woman, she has no idea a trap awaits her in the sweltering thick of the jungle. She has been drawn there by Manolito himself, who has seductive plans for the unaware, irresistibly human female...", "hash": "daf9137f-73a3-4505-849d-c14a2844e1d9"}]