[{"title": "Dark Curse (Dark #19)", "author": "Christine Feehan", "pgs": 21, "sum": "Storyline: \nDark Curse (Dark #19) Born into a world of ice, and slave to her evil father, Lara Calladine knew only paralyzing fear as a child—and escaping with her mysterious gifts unbroken would be the only way to survive her great Carpathian heritage as a Dragonseeker. Human, yet mage, she was of the blood of three species yet belonged to none. She walked her chosen path alone, guided by the wisdom of her aunts—to blend in and let no one know of her ancestry and powers. And never trust anyone. For beyond the frozen hell of her youth was a world of even greater mysteries and dangers. Today Lara is the leading expert in the field of ice cave study around the world and the healing microorganisms that thrive in them. She’s also in search of something else: the source of her nightmares—the cold dark corners of her childhood. Only one man has the will and the powers to help her: Nicolas De La Cruz, for whom centuries of hunting and killing have long since taken their toll. Dangerous and arrogant, he still longs to feel sensual love without the hunger for blood. Now, between Lara and Nicolas, a tenuous trust has emerged, and a passion neither has ever known before as a melody of dark promise begins. But as each scales the treacherous land of the Carpathian in search of their past, they also harbor a secret that could save or destroy them. And as each may be desirous of a new beginning as lifemates, they are also haunted by the unknown dangers of a dark curse.", "hash": "b3d685bb-f39e-46ec-af85-a1cd7e364179"}, {"title": "Dark Slayer (Dark #20)", "author": "Christine Feehan", "pgs": 21, "sum": "Storyline: \nDark Slayer (Dark #20) A rumor has persisted in the vampire world of a dark slayer—a woman—who travels with a wolf pack and any among the vampires who meets her is slain. Mysterious, elusive and seemingly impossible to kill, she is the one hunter who strikes terror into the hearts of the vampires. Ivory Malinov is that woman, betrayed by her own people, by her family, by everyone she held dear and she hunts during the night with only her pack to sustain her sanity. She has not spoken to or been with any other person for a hundred years other than to feed from or slay. She stumbles across a body on her way back to her lair and discovers—her lifemate. He is Razvan, branded a hated criminal, detested, feared and loathed by all Carpathians—he is also a dragonseeker of one of the greatest lineages of all Carpathians Held captive nearly his entire life by his grandfather, the Carpathians bitterest enemy, he is seeking the dawn to end his terrible existence. This is a story of two people, horribly betrayed, wounded in spirit, fighters to the death, who must struggle to unite against a common enemy.", "hash": "183c6e32-ac3f-4dfe-8cd1-f03b961997d1"}, {"title": "Dark Peril (Dark #21)", "author": "Christine Feehan", "pgs": 21, "sum": "Storyline: \nDark Peril (Dark #21) Dominic of the Dragonseeker lineage, one of the most powerful lines the Carpathian people has, ingests vampire blood laces with parasites in order to be able to go the very heart of the enemy camp and learn their plans. It is a one way mission. He knows he has little time once the parasites and the blood go to work. He plans to get in fast, relay the information to the leader of the Carpathians living in the area and go out fighting -- an honorable way to end his life. Solange Sangria is one of the last of the jaguar people, a royal pureblood. Her people, once many are now nearly extinct, a dying species that cannot recover from the choices they made over hundreds of years. She has long been alone, fighting to save the remaining women who are able to shift, from the hands of Brodrick the Terrible, her own father who slaughtered her family and everyone she loved. Wounded, weary, she plans one last battle, hoping to stop the man who has made an alliance with the vampires, accepting she will not come out alive. They are two warriors who have lived their lives alone. Now, at the end of their time, they find each other, a complication, neither saw coming.", "hash": "d4d88de3-3204-48b4-8b98-b3ee961a8cae"}, {"title": "Dark Predator (Dark #22)", "author": "Christine Feehan", "pgs": 56, "sum": "Storyline: \nDark Predator (Dark #22) As brutal as the undead he hunted, Zacarias De La Cruz was a master executioner. Now his stark and savage journey has ended. For his brothers, Zacarias had walked to the edge of madness, but with centuries as a killing machine now left to the past and without a hunt to define him, Zacarias wonders, for the first time in his life, who he really is. The answer awaits him back home, in Peru, in the betrayal of a woman who is readying her trap, in the vengeance of an old enemy, in the inevitable consequences of a bloody family legacy-and in the deliverance of a lifemate he never could have imagined...", "hash": "0a4aba86-d669-480c-ad4a-963319e1055d"}, {"title": "Dark Storm (Dark #23)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Storm (Dark #23) Awakening after all this time in a world of absolute darkness and oppressive heat, Dax wonders in how many ways the world above must have changed. But it is how he has changed that fills him with dread and loathing. Buried alive for hundreds of years in a volcano in the Carpathian Mountains, Dax fears that he has become the full-fledged abomination that every Carpathian male fears, a victim of the insidious evil that has crept relentlessly into his mind and body over the centuries. But there are some things that never change. His name is Mitro, the vampire Dax had hunted all these long centuries. Second in command to the prince of the Carpathian people he is the epitome of everything malevolent, and perpetrator of one of the most shocking killing sprees known to man - and beast. Even his friends and family weren't safe from Mitro's bloodlust. Neither was Mitro's lifemate, Arabejila, an extraordinary woman with extraordinary gifts. But now that Dax has re-emerged, so too has Mitro. The ultimate battle between good and evil has been re-engaged. Between Dax and Mitro, a violent game has begun - one that has marked Riley Parker, the last descendent of Arabejila, as the reward.", "hash": "668c5905-b3da-4d21-9b6d-c909860e5a81"}, {"title": "Dark Lycan (Dark #24)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nDark Lycan (Dark #24) Tatijana of the Dragonseekers spent centuries encased in ice with her sister, trapped in limbo between life and death, never speaking to a soul other than those who tormented her. Now, she has been freed from her frozen prison by an unknown descendent. Awakened in human form, Tatijana yearns to explore the modern world in which she now lives—a world with more mysteries than she is prepared for. Fenris Dalka has returned to the Carpathian Mountains after a long absence to be with his brother. He is scarred by centuries of battle, and every hard-won victory. But the real reason for his return home could prove deadly if discovered by the wrong man—or woman. Upon his arrival, he is compelled by a beautiful and enigmatic stranger who carries the scent of fresh earth, of forest, of the night itself. In time Tatijana and Fenris will discover all that unites them—their secrets and pasts, their predators, and the hot flush of passion that stirs their souls. Yet just as surely, seduced into the silvery darkness of a full-moon night, they’ll also discover everything ancient and evil that exists to destroy them.", "hash": "80b8c49c-0937-4c07-bcf9-411fda1f55be"}, {"title": "Shadow Game (GhostWalkers #1)", "author": "Christine Feehan", "pgs": 20, "sum": "Storyline: \nShadow Game (GhostWalkers #1) The classified experiment is the brainchild of renowned scientist Peter Whitney and his brilliant daughter, Lily. Created to enhance the psychic abilities of an elite squadron, it can transform their natural mental powers into a unique military weapon. But something goes wrong. In the isolated underground labs, the men have been dying-victims of bizarre accidents. Captain Ryland Miller knows he is next. When Dr. Whitney himself is murdered, Ryland has only one person left to trust: the beautiful Lily. Possessed of an uncanny sixth sense herself, Lily shares Ryland's every new fear, every betrayal, every growing suspicion, and every passionate beat of the heart. Together, they will be drawn deeper into the labyrinth of her father's past and closer to a secret that someone would kill to keep hidden.", "hash": "3b71a3f3-d204-4225-be40-1231da5e0cc6"}, {"title": "Dark Descent (Dark #11)", "author": "Christine Feehan", "pgs": 13, "sum": "Storyline: \nDark Descent (Dark #11) For Each, There Could Be Only One: They came from the darkest places: secluded monasteries, the Carpathian mountains, galaxies under siege. They were men with the blackest pasts-warriors, vampire monks, leaders of armies-but whose passions burned like dying stars. They had one purpose: to find those women who fulfilled them, completed them, and made them rage with a fire both holy and profane. They sought soul mates whose touch consumed them with desire, yet whose kisses refreshed like the coolest rain. And each man knew that for him there was only one true love-and in finding her, he would find salvation.", "hash": "37499f0f-9a1e-463a-921d-7e939a180ffa"}, {"title": "Dark Prince (Dark #1)", "author": "Christine Feehan", "pgs": 16, "sum": "Storyline: \nDark Prince (Dark #1) Prince of the Night. He came to her in the night, a predator -- strength and power chiseled his features. The seduction was deep and elemental; he affected her soul. His need. His darkness. His terrible haunting loneliness. Her senses aroused, she craved the dangerous force of his body. Burned for him. And he had only touched her with his mind. Lady of the Light She came to him at dawn, his bleakest hour. As the beast raged inside him, threatening to consume him, he vented his centuries-old despair in an anguished cry that filled the waning night. And she answered, a ray of light, piercing his darkness. A beautiful angel. Her compassion, courage, and innocence awakened in him an exquisite longing and tenderness. He knew he must possess her, for only she could tame his savage side and lift the dark shadow from his soul. Apart they were desolate, bereft. Intertwined physically and spiritually, they could heal one another and experience an eternity of nights filled with love.", "hash": "9f8ce8b7-a34e-47eb-9f8d-a645d88d6d04"}, {"title": "Dark Desire (Dark #2)", "author": "Christine Feehan", "pgs": 18, "sum": "Storyline: \nDark Desire (Dark #2) The stranger silently summons her from across the continents, across the seas. He whispers of eternal torment, of endless hunger...of dark, dangerous desires. And somehow American surgeon Shea O'Halloran can feel his anguish, sense his haunting aloneness, and she aches to heal him, to heal herself. Drawn to the far Carpathian mountains, Shea finds a ravaged, raging man, a being like no other. And her soul trembles. For in his burning eyes, his icy heart, she recognizes the beloved stranger who's already become part of her. This imperious Carpathian male compels Shea to his side. But is she to be his healer...or his prey? His victim...or his mate? Is he luring her into madness...or will his dark desire make her whole?", "hash": "11f86a27-0613-4136-9ca0-bb3e4c42d0bf"}]