[{"title": "First Dates Are Hell ", "author": "Amanda Arista", "pgs": 6, "sum": "Storyline: \nThis was a test of some sort. Prima Violet was famous for them, pushing everyone the extra step to make them better. Scheduling his monthly meeting here instead of in his own place of business was a test. Her directive to be unarmed was a test. And judging by the uncomfortable nakedness between his shoulder blades and the pressure of the others' energy, he wasn't going to pass this one.", "hash": "ee8c362c-ee90-48e9-aea2-163023e101e1"}, {"title": "My Lord Vampire (Immortal Rogues #1)", "author": "Alexandra Ivy", "pgs": 36, "sum": "Storyline: \nMy Lord Vampire (Immortal Rogues #1) Alexandra Ivy, author of the 'Guardians of Eternity' series, introduced the 'Immortal Rogues' - three vampires duty-bound to protect their own kind even as they fall prey to mortal desires.", "hash": "8e35f624-6697-4412-ac01-ce7ad5874c53"}, {"title": "My Lord Eternity (Immortal Rogues #2)", "author": "Alexandra Ivy", "pgs": 36, "sum": "Storyline: \nMy Lord Eternity (Immortal Rogues #2) To other vampires, mortals are weak, uninteresting creatures. To Lucien Valin, they are infinitely fascinating. Especially Jocelyn Kingly--once the prize of London society, now an outcast. As the vampire assigned to guard her, Lucien is relishing his task. But her beguiling goodness puts her in terrifying danger. Not just from the traitor intent on claiming her mysterious amulet, but from the desire Lucien struggles to keep in check. Youthful infatuation already cost Jocelyn her good name. But even with little to lose, instinct tells her that accepting Lucien as a tenant in her home is a devil's bargain. As she roams London's streets at night, helping the most wretched, she feels a dark force drawing near. And Lucien--magnetic, charming, irresistible--may turn out to be her savior, her lover, or the means to change her destiny forever.", "hash": "9f87c038-4de0-42ea-9b55-db00961cbcef"}, {"title": "My Lord Immortality (Immortal Rogues #3)", "author": "Alexandra Ivy", "pgs": 36, "sum": "Storyline: \nMy Lord Immortality (Immortal Rogues #3) Despite her impeccable lineage and delicate beauty, Amelia Hadwell has no interest in social demands - not when she must care for her brother William, whose otherworldly manner has convinced their family he is mad. Determined to care for him, Amelia is horrified to learn that he has been escaping to the East End, where a shocking series of murders has terrorised the neighbourhood - and that her neighbour, Drake Ramone, is convinced William is the culprit! Desperate to safeguard her brother, Amelia accepts the offer of a hiding place from Sebastian St. Ives, a reclusive scholar to whom William has taken a liking. Drawn to the reserved, silver eyed stranger, she is amazed when he reveals the unsettling reason for Drake's interest in William - and the danger an amulet in Amelia's possession represents. Yet nothing is as shattering as the realisation that although Sebastian belongs to a world she cannot imagine, she has surrendered her heart to him with just one kiss...", "hash": "26cbd183-0df3-494a-9ace-c5ec6ab76d3a"}, {"title": "When Darkness Comes (Guardians of Eternity #1)", "author": "Alexandra Ivy", "pgs": 54, "sum": "Storyline: \nWhen Darkness Comes (Guardians of Eternity #1) In this first book of Ivy's pulse-pounding Guardians of Eternity vampire trilogy, an unearthly guardian is forced to protect a mortal woman, plunging them into an epic battle between good and evil and a desperate race to save their love. Original.", "hash": "572c4b79-d59e-4247-8717-183916164cfd"}, {"title": "Embrace The Darkness (Guardians of Eternity #2)", "author": "Alexandra Ivy", "pgs": 62, "sum": "Storyline: \nEmbrace The Darkness (Guardians of Eternity #2) IS HE HER MORTAL ENEMY Lady Shay is the last of her kind. Half human, half Shalott, her blood is a precious aphrodisiac to vampires, who consider it more precious than gold. Though Shalotts are renowned assassins, a curse held over Shay lands her on the slave auction block, where her fate is uncertain- OR THE MAN WHO WILL RISK IT ALL Viper, the beguiling chief of a deadly vampire clan, can't explain his longing to possess the beautiful Shalott who once saved his life, but now he is free to do anything he wants with her. Strangely, while he desires both Shay-s blood and body, he wants her to surrender willingly. TO SAVE HER LIFE? A hidden evil has been stalking Shay since she left the slave market with Viper. It is an evil that endangers the very existence of Viper's kind, and there's no reason he should court such danger just to protect a Shalott. But the love he feels for Shay is enough to make him willing to go to hell and back if it means spending an eternity with her in his arms.", "hash": "12a090e0-ef2e-4f63-9d5b-0da018d295c6"}, {"title": "Darkness Everlasting (Guardians of Eternity #3)", "author": "Alexandra Ivy", "pgs": 63, "sum": "Storyline: \nDarkness Everlasting (Guardians of Eternity #3) In this third book of Ivy's pulse-pounding series, a remarkable woman unwittingly becomes a pawn in an epic battle between vampires and werewolves, as she discovers a new world filled with ecstasy and dark passion. Original.", "hash": "33dc0d3b-8e66-4140-b4a8-3acc2a6e1efc"}, {"title": "Darkness Revealed (Guardians of Eternity #4)", "author": "Alexandra Ivy", "pgs": 66, "sum": "Storyline: \nDarkness Revealed (Guardians of Eternity #4) Two hundred years have passed since Anna Randal gave herself to Conde Cezar in a night of relentless passion. Since then, Anna has become filled with unearthly power she can't begin to comprehend. And the sexy, charming vampire responsible has eluded all of her efforts to track him down, until now... Cezar's blissful encounter with Anna cost him two centuries of penance. But one thing hasn't changed...his body's response to her is as urgent as ever. Now, commanded by the Oracles to keep watch over Anna, Cezar finds himself torn between his need to protect her...and to possess her... Someone wants Anna dead. And as an ancient enemy prepares to wage a terrifying battle, Anna must decide whether to succumb to a dark, burning desire...and accept a destiny that could change the world forever...", "hash": "0a9e2759-ca8a-4176-b7d8-88d887a43450"}, {"title": "Darkness Unleashed (Guardians of Eternity #5)", "author": "Alexandra Ivy", "pgs": 64, "sum": "Storyline: \nDarkness Unleashed (Guardians of Eternity #5) A scarred recluse, Jagr makes no secret of his disdain for others' company. But now, as a member of Chicago's powerful vampire clan, he has certain obligations to fulfill. The latest: track down a missing were pureblood and return her to her sister. The problem: Regan Garrett has no intention of complying.", "hash": "06c0e35c-6bb0-483a-bf00-df119a02bbec"}, {"title": "Beyond the Darkness (Guardians of Eternity #6)", "author": "Alexandra Ivy", "pgs": 61, "sum": "Storyline: \nBeyond the Darkness (Guardians of Eternity #6) He Would Do Anything to Claim Her Salvatore Giuliani is not a happy werewolf. It's his duty as leader to track down the pure-blood females who can keep his people from extinction. But the moment he catches scent of Harley, a pure-blood held by a pack of mangy curs, his savage need for her obliterates all other instincts. And the only thing worse than being captured is finding that beautiful, independent Harley defiantly refuses to become his mate. And Everything to Keep Her Harley has been taught to distrust all Weres, especially their arrogant king. She won't be used for breeding or bonded against her will, not even to a man who makes every nerve tingle with awareness. Yet Salvatore is her key to saving the family she never knew she had—if she dares to succumb to his dark, predatory desire, and face a vicious enemy sworn to destroy them both. . .", "hash": "3fe6440a-55f3-4c91-b141-7711735b4766"}]