[{"title": "Devoured by Darkness (Guardians of Eternity #7)", "author": "Alexandra Ivy", "pgs": 56, "sum": "Storyline: \nDevoured by Darkness (Guardians of Eternity #7) Tane is a Charon, sworn to hunt and kill rogue vampires. His new assignment seems like a waste of his talents…until he catches up with the Jinn he's been sent to capture. Half human, half demon, Laylah has a vulnerable streak that strikes right through to Tane's cold heart. He should be furious when she uses her powers to bind them together, preventing him from dragging her before the Commission. Instead he welcomes any reason to stay close enough to touch, to taste, to seduce… Laylah doesn't know why she was chosen to protect a child who may be the catalyst in a war between good and evil. But the mysteries of her past pale compared to the dangers approaching. Tane is devastatingly strong, breathtakingly sensual. And Laylah will have to trust in every ounce of that strength, because her enemies are drawing near, eager to destroy them both…", "hash": "2dd5b7bc-6e40-401c-af9a-c8605fc9dd54"}, {"title": "Fear the Darkness (Guardians of Eternity #9)", "author": "Alexandra Ivy", "pgs": 65, "sum": "Storyline: \nFear the Darkness (Guardians of Eternity #9) Her Visions Lead Her To Danger Beautiful Cassandra is a Were, a prophet both vulnerable and defiant, blessed with visions that portend the fate of the world. A rare and delicate creature, Cassie must be protected at all costs. Enter Caine, a powerful cur turned pureblooded Were whose recent tangles with a demon lord have left him in serious need of redemption. Caine is duty-bound to keep Cassie out of danger—and that means resisting his potent urge to seduce her. And Only He Can Save Her As Cassie's mysterious visions lead them in and out of danger, Caine believes he has found his true mate, the woman with whom he is bound for all eternity. Cassie is both charmed and frightened by Caine's magnetism, and unsure if he—or her feelings for him—can be trusted. But Cassie can't afford to doubt Cain now. A deadly enemy bent on destruction is closer than they realize—and only they can keep chaos from ruling the world.", "hash": "91182bcb-5e59-480d-bfab-acabe5f1fd9c"}, {"title": "Darkness Avenged (Guardians of Eternity #10)", "author": "Alexandra Ivy", "pgs": 68, "sum": "Storyline: \nDarkness Avenged (Guardians of Eternity #10) THE SEARCH FOR A TRAITOR As the demon world celebrates the defeat of the Dark Lord, the vampire Santiago’s mood remains bleak. He still yearns for the sensual, raven-haired Nefri, who has inexplicably disappeared. But brooding for Nefri is a luxury that Santiago does not have. His traitorous sire, Gaius, is unleashing a violent scourge upon the mortal world, and Santiago must stop him before it’s too late... LEADS TO A DANGEROUS SEDUCTION To her dismay, the all-powerful Oracles have sent Nefri on her own mission to find Gaius, and failure is not an option. Nefri’s search leads her to the vampire’s abandoned lair—and straight into Santiago’s path. It’s clear Santiago intends to seduce her, but then an ancient, banished evil reappears, threatening to thrust the world into a madness it cannot survive...", "hash": "8cf39a34-34c9-43f9-8ee3-a0cb063924ff"}, {"title": "Bound By Darkness (Guardians of Eternity #8)", "author": "Alexandra Ivy", "pgs": 51, "sum": "Storyline: \nBound By Darkness (Guardians of Eternity #8) The Sylvermysts have a reputation as sinister cousins to the fey, and none are more mysterious than Ariyal and his tribe. To save his people from banishment, he faces a new challenge: Jaelyn, an elite vampire warrior sent to capture him. By rights, he should kill her on sight. Yet he cannot bring himself to hurt her—or to resist her… Jaelyn is stunningly beautiful, utterly lethal—and always alone. Until Ariyal. From their first encounter, she knows that what's between them is more dangerous than simple lust. And as they unite to thwart a terrifying prophecy that will mean the end of his clan and of the world they know, she will risk everything to fulfill her destiny by his side…", "hash": "9c26e2fc-8de8-42e4-b8f1-be1b9cd3d82d"}, {"title": "The Real Werewives of Vampire County (Guardians of Eternity #9)", "author": "Alexandra Ivy", "pgs": 67, "sum": "Storyline: \nThe Real Werewives of Vampire County (Guardians of Eternity #8.5) This scandalous anthology, rife with drama, secrets and the supernatural, includes Alexandra Ivy's Title: The Real Werewives of Vampire County Author: Ivy, Alexandra/ Fox, Angie/ Taylor, Tawny/ Haines, Jess", "hash": "4ee8ee39-5dcb-47f6-8420-5cf31669bfa7"}, {"title": "Predatory (Immortal Guardians #4)", "author": "Alexandra Ivy", "pgs": 73, "sum": "Storyline: \nPredatory (Immortal Guardians #3.5) Four of today's most exciting paranormal authors take readers into the thrilling realm of vampires, immortals, and other supernatural beings with a thirst for illicit desire... Out Of Control by Alexandra Ivy Ph.D student Angela Locke has a crush on her sexy professor, Dr. Nikolo Bartrev. When she learns he's actually a Sentinel with extraordinary powers, she joins forces with him to catch a psychopath. But soon, their hottest pursuit is of each other... Ties That Bind by Nina Bangs Cassie Tyler agrees to sub for her friend at the funeral home where she works. But she gets more than she bargained for when a group of men attack her and a vampire comes to her rescue. . . In Still Darkness by Dianne Duvall Immortal Richart d'Alençon can't forget the woman who rewarded him with a sensuous kiss after he saved her from a trio of vampires. While Richart knows that loving a human can only bring trouble, the taste of forbidden lust is too great to resist. . . High Stakes by Hannah Jayne When vampire fashionista Nina LaShay's design contest rival is found dead, she's the prime suspect. Sexy photographer Pike is number two. He's the kind of man who makes Nina salivate. But will she have to reveal herself to have him--and to save them both? Or does Pike have a secret of his own?", "hash": "fe945b7d-956a-4d8a-b36d-3aea37a530c3"}, {"title": "Born in Blood (The Sentinels #1)", "author": "Alexandra Ivy", "pgs": 59, "sum": "Storyline: \nBorn in Blood (The Sentinels #1) Sergeant Duncan O’Conner has seen it all before. A beautiful erotic dancer is found murdered in her home—no suspect, no motive. But there’s one clue: she’s missing her heart. It’s enough to make the hard-bitten Kansas City cop enlist the help of a necro—one of the dead-channeling freaks who live in the domed city of nearby Valhalla. It’s a long shot, but desperate crimes call for desperate measures. Unlike the other “high-bloods” in Valhalla, Callie Brown considers her abilities a gift, not a curse. But when she reads the dancer’s final thoughts, she senses a powerful presence blocking her vision. This is no ordinary homicide. This is the work of a legendary necromancer who controls souls. A ravenous force that will put Callie’s skills to the test, O’Conner’s career at risk, and both their hearts on the line…literally.", "hash": "53d8c188-d9ac-4fc6-9d1f-29ca5b272c87"}, {"title": "Darkness Dawns (Immortal Guardians #1)", "author": "Dianne Duvall", "pgs": 58, "sum": "Storyline: \nDarkness Dawns (Immortal Guardians #1) In this dazzling, sensual novel, Dianne Duvall beckons readers into a world of vampires, immortals, and humans with extraordinary gifts…where passion can last forever, if you’re willing to pay the price… Once, Sarah Bingham’s biggest challenge was making her students pay attention in class. Now, after rescuing a wounded stranger, she’s landed in the middle of a battle between corrupt vampires and powerful immortals who also need blood to survive. Roland Warbrook is the most compelling man Sarah has ever laid hands on. But his desire for her is mingled with a hunger he can barely control… In his nine centuries of immortal existence, no woman has tempted Roland as much as Sarah. But asking her to love him is impossible—when it means forfeiting the world she’s always known, and the life he would do anything to protect", "hash": "d2da1dd4-ce63-4c4d-8fbe-dc7b9018c251"}, {"title": "Night Reigns (Immortal Guardians #2)", "author": "Dianne Duvall", "pgs": 64, "sum": "Storyline: \nNight Reigns (Immortal Guardians #2) Ami isn't much for trusting strangers. She has a hard time trusting anyone. But she's no coward, and she's no pushover in the protection department either. So when she comes across a mysterious warrior taking on eight deranged vampires on his own, she doesn't hesitate to save his bacon. Of course, that was before she realized what one little rescue would get her into . . . Marcus Grayden has been an immortal protector of humanity for eight hundred years, and at the moment he's not interested in backup. From the moment Ami arrives in his life, he can't deny that she's strong, smart, and extremely skilled at watching his back. But she's also destroying his protective solitude and stirring desires he can't bear to awaken. After all, whatever her secrets — how can she defeat death itself?", "hash": "0a0185ce-671c-4b10-8725-9233fcd5ef9d"}, {"title": "Phantom Shadows (Immortal Guardians #3)", "author": "Dianne Duvall", "pgs": 65, "sum": "Storyline: \nPhantom Shadows (Immortal Guardians #3) Dr. Melanie Lipton is no stranger to the supernatural. She knows immortals better than they know themselves, right down to their stubborn little genes. So although a handsome rogue immortal seems suspicious to her colleagues, Sebastien Newcombe intrigues Melanie. His history is checkered, his scars are impressive, and his ideas are daring. But it's not his ideas that have Melanie fighting off surges of desire . . . Bastien is used to being the bad guy. In fact, he can't remember the last time he had an ally he could trust. But Melanie is different — and under her calm, professional exterior he senses a passion beyond anything in his centuries of experience. Giving in to temptation is out of the question — he can't put her in danger. But she isn't asking him . . .", "hash": "4f426782-35ff-4d9c-b01f-0f5e854b7c34"}]