[{"title": "Darkness Rises (Immortal Guardians #4)", "author": "Dianne Duvall", "pgs": 65, "sum": "Storyline: \nDarkness Rises (Immortal Guardians #4) Krysta is used to getting the drop on vampires. Her \"special abilities\" aren't much, but the plan is simple--she plays helpless pretty young thing to lure them in. Then her shoto swords come out and it's bye-bye, bloodsucker. Until one night she finds herself with an unexpected ally. He's a vampire, all right, but different. Mysterious. Handsome. And more interested in saving her skin than draining it. Etienne has been an Immortal Guardian for two hundred years--long enough to know that Krysta is special. He can't stop thinking about her long legs, even more than her short swords. Then he discovers the vamps she's exterminating have friends in high places, and the Guardians are in danger too. He'll have to accept Krysta's help to save them. The stakes for a mortal are high. But the cost to his heart might be higher. . .", "hash": "34e2c5be-6aa3-4e5c-9b32-b335eeae501b"}, {"title": "Afterlight (Dark Ink Chronicles #1)", "author": "Elle Jasper", "pgs": 48, "sum": "Storyline: \nAfterlight (Dark Ink Chronicles #1) Savannah's most unconventional tattoo artist, Riley Poe, lives on the edge. Now she's put over the edge when her younger brother is taken by a sinister cult led by vampires. Her only ally is the hot-tempered vampire Eli Dupre, attracted to Riley's beauty and rare blood type. To save her brother from certain un-death, Riley faces dangers she's never dreamed of, ruthless bloodthirsty enemies, and an evil of endless hunger that wants to devour it all...", "hash": "2e459298-9018-450d-b7e5-eff44de9836b"}, {"title": "Everdark (Dark Ink Chronicles #2)", "author": "Elle Jasper", "pgs": 45, "sum": "Storyline: \nEverdark (Dark Ink Chronicles #2) When Savannah tattoo artists Riley Poe is ambushed by an undead enemy, she inherits some of the traits of her attackers-and a telepathic link with a rampaging vampire. Now, she's experiencing murder after murder through the victims' eyes. And her new powers will not be enough to stop the horror-or the unending slaughter...", "hash": "625694b2-f209-48a6-87c7-6218e65275fa"}, {"title": "Eventide (Dark Ink Chronicles #3)", "author": "Elle Jasper", "pgs": 38, "sum": "Storyline: \nEventide (Dark Ink Chronicles #3) Newly-bitten tattoo artist Riley Poe feels herself changing in unimaginable ways. Eli Dupre, her vampire lover, has seen the change in her and fears for her humanity. His rival, Victorian, tells her she must see the patriarch of the vampire cult that attacked her to save her soul. In the vampire cult's fortress in Romania, Riley will face her worst fears-and the dark powers threatening to destroy her. And she'll have to do the one thing she's been determined not to do—put her trust in Eli.", "hash": "e7ff761c-09f0-4413-8c4a-1b6eaebfe64f"}, {"title": "Black Fallen (Dark Ink Chronicles #4)", "author": "Elle Jasper", "pgs": 42, "sum": "Storyline: \nBlack Fallen (Dark Ink Chronicles #4) There’s only one thing more lethal than a vampire. A Black Fallen. Rather, a fallen angel engulfed in the blackest of magic. And three of the most dangerous have descended upon Edinburgh… Tattoo artist, RILEY POE, has changed. After surviving the bites of three potent Strigoi, she has acquired traits from each that parallel those of the most lethal of vampires. Her strength, speed, hearing are unmatched. She’s a stick of dynamite, fuse lit. She’s about to put those unique powers to good use. And she’ll need them. Now that the rogue bloodsuckers plaguing the Lowcountry are under control once more, and Riley, along with her guardian vampire, ELI DUPRE, Riley’s brother, SETH POE, and Eli’s brother, PHIN DUPRE, and Strigoi vampire VICTORIAN ARCOS agree to join JAKE ANDORRA’S elite WUP team. Worldwide Unexplained Phenomenon takes cases too powerful and dangerous for mere humans to handle. Comprised of vampires, humans with tendencies, immortal druids, werewolves and witches, there aren’t many situations the WUP members can’t handle. But there are unholy, lethal disturbances in the ancient city of Edinburgh, Scotland, and Riley and the others accept the mission.", "hash": "f2fb164e-ce13-424e-b32e-132544782e66"}, {"title": "Darklove (Dark Ink Chronicles #5)", "author": "Elle Jasper", "pgs": 41, "sum": "Storyline: \nDarklove (Dark Ink Chronicles #5) Utterly destroyed, or lost forever? This is the question that plagues Riley Poe. After her vampire lover, Eli Dupre, was seemingly murdered by a fallen angel, she receives word that he's actually trapped in an alternate dimension, where hell on earth is revealed and dark forces reign. Riley’s been there before, and it nearly ripped her to pieces. But her efforts to find Eli are thwarted by a new foe: a powerful, unstoppable vampire is slaughtering humans. Riley knows how to handle a vamp, and with the WUP team by her side, she's determined to take down the rogue. But what she finds rocks her to the core, as she discovers a startling connection between the slaughter and Eli, who might not be missing after all—and who might not be the same vampire she fell in love with.", "hash": "22dc3237-b6bd-4edb-83c4-ddbc9312ec57"}, {"title": "The Darkest Whisper (Lords of the Underworld  #4)", "author": "Gena Showalter", "pgs": 63, "sum": "Storyline: \nThe Darkest Whisper (Lords of the Underworld #4) He is the keeper of Doubt and his entire world’s about to be rocked. Bound by the demon of Doubt, Sabin unintentionally destroys even the most confident of lovers. So the immortal warrior spends his time on the battlefield instead of the bedroom, victory his only concern…until he meets Gwendolyn the Timid. One taste of the beautiful redhead, and he craves more. Gwen, an immortal herself, always thought she’d fall for a kind human who wouldn’t rouse her darker side. But when Sabin frees her from prison, battling their enemies for the claim to Pandora’s box turns out to be nothing compared to the battle Sabin and Gwen will wage against love…", "hash": "6f5bd25c-c557-4b21-a881-da404e0f2ef7"}, {"title": "The Darkest Passion (Lords of the Underworld  #5)", "author": "Gena Showalter", "pgs": 70, "sum": "Storyline: \nThe Darkest Passion (Lords of the Underworld #5) For weeks, the immortal warrior Aeron has sensed an invisible female presence. An angel-demon-assassin has been sent to kill him. Or has she? Olivia claims she fell from the heavens, giving up immortality because she couldn't bear to harm him. But trusting - and falling for - Olivia will endanger them all. So how has this mortal with the huge blue eyes already unleashed Aeron's darkest passion? With an enemy hot on his trail and his faithful demon companion determined to remove Olivia from his life, Aeron is trapped between duty and consuming desire. Worse still, a new executioner has been sent to do the job Olivia wouldn't...", "hash": "ee4432f1-1030-4936-b8d5-17b46067f92f"}, {"title": "The Darkest Lie (Lords of the Underworld  #6)", "author": "Gena Showalter", "pgs": 63, "sum": "Storyline: \nThe Darkest Lie (Lords of the Underworld #6) Forced to his knees in agony whenever he speaks the truth, Gideon can recognize any lie - until he captures Scarlet, a demon-possessed immortal who claims to be his long-lost wife. He doesn't remember the beautiful female, much less wedding - or bedding - her.", "hash": "f715f026-2456-4800-9415-e23ea685db03"}, {"title": "The Darkest Secret (Lords of the Underworld  #7)", "author": "Gena Showalter", "pgs": 65, "sum": "Storyline: \nThe Darkest Secret (Lords of the Underworld #7) Keeper of the demon of Secrets, Amun can manipulate the darkest thoughts of anyone nearby. But when the immortal warrior is chained and isolated to protect those he loves, death is his only hope of release—until he meets Haidee, a fellow prisoner whose beauty and hidden vulnerability draw him into a reckless test of his loyalty. Haidee is a demon-assassin, raised to despise Amun's kind. Yet how can she hate the man whose touch sets her aflame? But to save him, she must give herself body and soul...and face the wrath of a powerful adversary sworn to destroy her.", "hash": "30d128f1-51d3-4f22-90ba-b7164afff235"}]