[{"title": "The Darkest Surrender (Lords of the Underworld  #8)", "author": "Gena Showalter", "pgs": 68, "sum": "Storyline: \nThe Darkest Surrender (Lords of the Underworld #8) Possessed by the demon of Defeat, Strider cannot lose a challenge without suffering unimaginable pain. For him, nothing stands in the way of victory. Until Kaia, an enchanting Harpy, tempts him to the razor's edge of surrender.Known among her people as The Disappointment, Kaia must bring home the gold in the Harpy Games or die. Strider is a distraction she can't afford because he has an agenda of his own-steal first prize, an ancient godly artifact, before the winner can be named. But as the competition heats up, only one prize will matter-the love neither had thought possible...", "hash": "156ad513-0309-47c3-b771-c005b987c2c2"}, {"title": "The Darkest Seduction (Lords of the Underworld  #9)", "author": "Gena Showalter", "pgs": 74, "sum": "Storyline: \nThe Darkest Seduction (Lords of the Underworld #9) Possessed by the demon of Promiscuity, immortal warrior Paris is irresistibly seductive, but his potent allure comes at a terrible price. Every night he must bed someone new, or weaken and die. And the woman he craves above all others is the one woman he thought was forever beyond his reach until now. Newly possessed by the demon of Wrath, Sienna Blackstone is racked by a ruthless need to punish those around her. Yet in Paris's arms, the vulnerable beauty finds soul-searing passion and incredible peace. Until a blood feud between ancient enemies heats up. Will the battle against gods, angels and creatures of the night bind them eternally or tear them apart?", "hash": "9ecb65dd-6165-4a95-a84c-a7c4a7d5da33"}, {"title": "The Darkest Craving (Lords of the Underworld  #10)", "author": "Gena Showalter", "pgs": 69, "sum": "Storyline: \nThe Darkest Craving (Lords of the Underworld #10) Having endured weeks of torture in the bowels of hell, Kane wants nothing to do with his beautiful rescuer, Josephina Aisling. The half-Fae female threatens to awaken the demon of Disaster inside him—a beast he’s determined to kill, no matter the price. Josephina is hunted by a brutal enemy—her royal family—and Kane is her only source of protection. He’s also the only male to ever set her aflame, and even he succumbs to the heat. But as they navigate the treacherous world of the Fae, they are forced to make a choice: live apart…or die together.", "hash": "70b36773-a72f-4b24-8353-0e1e18aa2b58"}, {"title": "Into The Dark (Lords of the Underworld  #0.5)", "author": "Gena Showalter", "pgs": 35, "sum": "Storyline: \nInto the Dark (Lords of the Underworld 0.5 & 3.5) The Darkest Fire—a Lords of the Underworld prequel Geryon is the guardian of hell, more monster than man. Kadence is the goddess of Oppression, more angel than woman. Together they will enter the flames to battle a dangerous horde of demon lords—and discover a passion unlike any other. The Amazon's Curse—a tale of Atlantis Zane, a fierce vampire warrior, has been enslaved by the Amazons. Nola, a lovely Amazon soldier, has been cursed with invisibility. Now, these two stubborn enemies must overcome the pasts that haunt them and embrace a love that can set them free…. The Darkest Prison—a Lords of the Underworld tale Once, Atlas, the Titan god of Strength, was the Greek goddess Nike's slave. Now, he is her master. And soon these sworn rivals destined to destroy each other will be forced to risk everything for a chance at love…", "hash": "559d18d8-7ad3-4043-8bb6-5f36854c7015"}, {"title": "The Darkest Prison (Lords of the Underworld  #3.5)", "author": "Gena Showalter", "pgs": 9, "sum": "Storyline: \nThe Darkest Prison (Lords of the Underworld #3.5) Once, Atlas, the Titan god of strength, was the Greek goddess Nike's slave. Now, he is her master. And soon these sworn enemies destined to destroy one another will be forced to risk everything for a chance at love….", "hash": "fa29181e-da80-4785-8fd0-51c7d0169b71"}, {"title": "The Darkest Angel (Lords of the Underworld  #4.5)", "author": "Gena Showalter", "pgs": 21, "sum": "Storyline: \nThe Darkest Angel (Lords of the Underworld #4.5) Winged warrior Lysander has been alive for centuries, and yet he's never known desire-until he meets Bianka. Spawned from the bloodline of his enemy, the beautiful but deadly Harpy is determined to lead the untouched Lysander into temptation. He may try to evade her attempts, but even the most iron-willed demon assassin can resist for only so long....", "hash": "1a069813-ded6-4048-9547-0e96a646dc3c"}, {"title": "Wicked Nights (Angels of the Dark #1)", "author": "Gena Showalter", "pgs": 64, "sum": "Storyline: \nWicked Nights (Angels of the Dark #1) Leader of the most powerful army in the heavens, Zacharel has been deemed nearly too dangerous, too ruthless - and if he isn't careful, he'll lose his wings. But this warrior with a heart of ice will not be deterred from his missions at any cost - until a vulnerable human tempts him with a carnal pleasure he's never known before. Accused of a crime she did not commit, Annabelle Miller has spent four years in an institution for the criminally insane. Demons track her every move, and their king will stop at nothing to have her. Zacharel is her only hope for survival, but is the brutal angel with a touch as hot as hell her salvation - or her ultimate damnation?", "hash": "36ce2255-bdfc-4ed6-a36e-733039752959"}, {"title": "Beauty Awakened (Angels of the Dark #2)", "author": "Gena Showalter", "pgs": 64, "sum": "Storyline: \nBeauty Awakened (Angels of the Dark #2) His name is Koldo. He is scarred, powerful, his control legendary-and he lives only for vengeance, determined to punish the angel who viciously removed his wings. But if he yields to the forces of hatred, he will be kicked from the heavens, eternally damned. She is his last hope. Nicola Lane was born with a defective heart, yet this fragile human shows surprising strength as demons stalk her every move, determined to end her. She is the key to Koldo's deliverance...and his downfall. Though he fights duty, destiny and his first addictive taste of desire, his toughest battle will be the one for Nicola's life-even if he has to sacrifice his own....", "hash": "3c8c652d-8e4c-4860-ac0e-771583d2aa29"}, {"title": "Lord of the Vampires (Royal House of Shadows #1)", "author": "Gena Showalter", "pgs": 76, "sum": "Storyline: \nLord of the Vampires (Royal House of Shadows #1) Nicolai the Vampire is renowned for his virility, but in a cruel twist of fate “The Dark Seducer” has become a sex slave in the kingdom of Delfina—stripped of his precious timepiece and his memory. All that remains is a primal need for freedom, revenge—and the only woman who can help him. When the wanton vampire summons Jane Parker, she is helpless to obey. She's drawn to his dark sexuality and into his magical realm. But for this human, all is not a fairy tale. For saving Nicolai could mean losing the only man she's ever craved...", "hash": "e1e57092-d116-4a4c-8b17-41719870bf52"}, {"title": "On the Hunt (Sentinel Wars #0)", "author": "Gena Showalter", "pgs": 61, "sum": "Storyline: \nOn the Hunt (Sentinel Wars #3.5)  With shadowy creatures, intoxicating magic, vivdly imagined worlds, and sizzling passion, this is an anthology no fan of paranormal romance will want to miss. In New York Times bestselling author Gena Showalter's Ever Night, Rose Pascal is swept into a dark, haunting world every year on her birthday - a world ruled by a warrior king who hunts her kind. Neither of them can deny the passion that soon consumes them both.... In Shannon K. Butcher's The Collector, demon hunter Neal Etan sets out to acquire a powerful artifact, but finds much more in beautiful Viviana Rowan. The antique dealer's touch strengthens his magic - and her life may be in Neal's hands if they don't recover the artifact in time.... In Jessica Andersen's Crystal Skull, archaeologist Natalie Albright's dig gets shut down amid rumors she has awakened the local demons. But when the terrifying underworld creatures attack, Natalie must team up with her ex to survive. As they fight the ancient menace, they discover a destiny that binds them together - and threatens to tear them apart.... And in Deidre Knight's Red Angel, Jamie Angel, leader of the deadly Nightshades, has tracked every kind of monster and demon that roams the darkness, but none of his experiences can prepare him for falling in love with one of the creatures he's trained to destroy....", "hash": "e2ea9025-3712-4f9e-865d-bb89e8a09a33"}]