[{"title": "Effortless (Thoughtless #2)", "author": "S.C. Stephens", "pgs": 0, "sum": "Storyline: \nDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: Effortless (Thoughtless #2) After being caught in the middle of a love triangle that led to a devastating betrayal, Kiera pledged to learn from the mistakes she'd made. She was determined to never again inflict that kind of pain on anyone, especially the soulful, talented man who held her heart. But life offers new challenges for every relationship, and when Kiera's love is put to the ultimate test, will it survive? Love is easy, trust is hard.", "hash": "2ddf8def-1cec-4559-8a09-a8702b87b8fe"}, {"title": "Reckless (Thoughtless #3)", "author": "S.C. Stephens", "pgs": 31, "sum": "Storyline: \nReckless (Thoughtless #3) When the band hits it big, Kiera and Kellan must ask themselves: Can their love for each other survive the constant pressures of superstardom? The friendships they've formed, the new family they've found, and the history they've forged will all play a part in helping them navigate the turbulent waters of the band's exploding popularity. A greedy executive hell-bent on success, a declining pop star looking for an edge, and a media circus that twists lies into truths are just some of the obstacles the lovers will have to overcome if they are going to remain together. Fame comes with a price-but will it cost Kiera and Kellan everything?", "hash": "b422abc8-6417-4a83-a9d1-a3400f192967"}, {"title": "Collision Course ", "author": "S.C. Stephens", "pgs": 26, "sum": "Storyline: \nLucas had it all – popularity, a devoted girlfriend, a brotherly best friend, and a loving mother who would do anything for him. His life was right on course to be a successful and fulfilling one, until the crash changed everything. It happened late one night during a sudden downpour. That evening, three young lives were lost and one life was left irrevocably altered. As the lone survivor, Lucas finds himself surrounded by swirling gossip of reckless drunkenness from the small town he used to warmly call home. Amid his own guilt and self-hatred, Lucas struggles to find hope, find peace, and maybe, even find love again.", "hash": "f7a8a23f-2bc3-4def-a938-d7f8050ab177"}, {"title": "Thoughtless (Thoughtless #1)", "author": "S.C. Stephens", "pgs": 82, "sum": "Storyline: \nThoughtless (Thoughtless #1) For almost two years now, Kiera's boyfriend, Denny, has been everything she's ever wanted: loving, tender and endlessly devoted to her. When they head off to a new city to start their lives together, Denny at his dream job and Kiera at a top-notch university, everything seems perfect. Then an unforeseen obligation forces the happy couple apart. Feeling lonely, confused, and in need of comfort, Kiera turns to an unexpected source—a local rock star named Kellan Kyle. At first, he's purely a friend that she can lean on, but as her loneliness grows, so does their relationship. And then one night everything changes...and none of them will ever be the same.", "hash": "2c330bf8-9f6a-4150-afc7-b7bd512c65e8"}, {"title": "The Lonely (The Lonely #1)", "author": "Tara Brown", "pgs": 47, "sum": "Storyline: \nThe Lonely (The Lonely #1) 19+ The truth is subjective to what the lonely lets in. Emalyn Spicer has lived with it for a long time. She thinks it goes back further than her memories do. She knows it goes back further than the OCD. When she arrives at college, her OCD's and the lonely refuse to let her have her wish to be normal. When she meets Sebastian and starts to fall for him, she lets herself believe it's possible to outrun the things chasing her from the past. But how to you get away from the things inside of you? How do you run from yourself? Just as she gives up and succumbs to the lonely, the unthinkable happens. She finds herself once again trapped in the dark, once again held against her will. This time she meets the lonely head on. In the darkest corners of her mind, she discovers there is more to her world than she ever imagined. She discovers that the lonely was there for her, protecting her from herself and her secrets. How far would you go to find yourself? This is a dark and captivating novel, tread lightly", "hash": "a2545679-483a-44bc-b862-e14cd89e75a1"}, {"title": "Lost Boy (The Lonely #2)", "author": "Tara Brown", "pgs": 35, "sum": "Storyline: \nLost Boy (The Lonely #2) 19+ Being the boy who accidentally shot his sister was hard. Never being able to find the girl who actually pulled the trigger was worse. Convinced, through years of relentless therapy, that she was a figment of his trauma and imagination, Eli Adams gave up on her existence. Until one day a name, bearing remarkable resemblance to the people missing in his life, showed up out of nowhere. Suddenly he was thrust into a journey that forced him to offer up his soul as payment for the truth. What he discovered along the way, was that the girl who took his sister's life and his hand, all those years ago, had become the thing he needed to be whole. Saving her was one thing. Healing her was another. Convincing her to love him will be the toughest part of it all.", "hash": "8e8db215-457e-4663-a5c3-b0136cac462a"}, {"title": "The Long Way Home ", "author": "Tara Brown", "pgs": 38, "sum": "Storyline: \nHow lucky can one girl get? Just ask Jacqueline Croix. She has it all. The right fiancé, money, looks, and connections. But everything comes at a cost. Sometimes that cost is looking the other way when the imperfections of your world start to show themselves. When something happens she can't look away from, she ends up drunk in a Chanel dress at a pity party on the beach in SC. There on the beach, she finally sees the cost of having everything is too high. Luckily, Jacqueline has one thing most girls like her do not, somewhere to run when she leaves it all behind. That somewhere happens to be to the open arms of the New York Rangers' right wing, Mike France. He has always been there through thick and thin, waiting for his chance to make her his. But how do you go from being best friends to lovers, when you know all the dirty details?", "hash": "8a59962c-3fa5-4a17-a853-a9db40e1b5df"}, {"title": "On Dublin Street (On Dublin Street #1)", "author": "Samantha Young", "pgs": 55, "sum": "Storyline: \nOn Dublin Street (On Dublin Street #1) Jocelyn Butler has been hiding from her past for years. But all her secrets are about to be laid bare… Four years ago, Jocelyn left her tragic past behind in the States and started over in Scotland, burying her grief, ignoring her demons, and forging ahead without attachments. Her solitary life is working well—until she moves into a new apartment on Dublin Street where she meets a man who shakes her carefully guarded world to its core. Braden Carmichael is used to getting what he wants, and he’s determined to get Jocelyn into his bed. Knowing how skittish she is about entering a relationship, Braden proposes an arrangement that will satisfy their intense attraction without any strings attached. But after an intrigued Jocelyn accepts, she realizes that Braden won’t be satisfied with just mind-blowing passion. The stubborn Scotsman is intent on truly knowing her… down to the very soul.", "hash": "c7d6c470-915d-4652-95ae-30a3c62fbbfc"}, {"title": "Until Fountain Bridge (On Dublin Street #2)", "author": "Samantha Young", "pgs": 18, "sum": "Storyline: \nUntil Fountain Bridge (On Dublin Street #1.5) Ellie Carmichael had a crush on Adam Sutherland, her brother, Braden’s, best friend, for years, and although Adam treated her with proprietary concern he made it clear he thought of her only as a little sister. Over the years, as Ellie’s crush develops into love, her romantic idealism makes it difficult for her to move on. To make matters worse, as she’s gotten older, Adam’s attitude has changed toward her. His affection for her is now joined by attraction, but his loyalty to Braden, and his fear of losing the only family he has, stops him from claiming Ellie the way she wishes he would. But one night his attraction is put to the test, and as much as Adam would like things to remain the same everything changes between them in a simple brush of the lips. Soon lust, love, jealousy and heartbreak combine to force change upon their relationship… and Adam discovers the hard way that life is too damn short to spend it on regret.", "hash": "27a2664f-de09-46b0-aa39-53cd2422bff3"}, {"title": "Down London Road (On Dublin Street #2)", "author": "Samantha Young", "pgs": 64, "sum": "Storyline: \nDown London Road (On Dublin Street #2) Johanna Walker is used to taking charge. But she’s about to meet someone who will make her lose control.... It has always been up to Johanna to care for her family, particularly her younger brother, Cole. With an absent father and a useless mother, she’s been making decisions based on what’s best for Cole for as long as she can remember. She even determines what men to date by how much they can provide for her brother and her, not on whatever sparks may—or may not—fly. But with Cameron MacCabe, the attraction is undeniable. The sexy new bartender at work gives her butterflies every time she looks at him. And for once, Jo is tempted to put her needs first. Cam is just as obsessed with getting to know Jo, but her walls are too solid to let him get close enough to even try. Then Cam moves into the flat below Jo’s, and their blistering connection becomes impossible to ignore. Especially since Cam is determined to uncover all of Jo’s secrets …even if it means taking apart her defenses piece by piece.", "hash": "167175ff-512d-481e-b761-5ade3ee4306a"}]