[{"title": "Night of the Vampires (Vampire Hunters #2)", "author": "Heather Graham", "pgs": 18, "sum": "Storyline: \nNight of the Vampires (Vampire Hunters #2) As a soldier, Cole Granger fights to restore peace to a world divided by war and evil. His extraordinary talents are enlisted to prevent the president's horrific premonition from becoming reality. Nothing—and no one—will stop him from fulfilling his duty. Especially the mysterious young woman who claims to be his comrade's sister. Enemy or ally, he can't yet determine. But one thing he knows for certain is that he must keep her close. Very close. Megan Fox's quest to uncover a family secret leads her to the center of vampire riots in West Virginia. To find the answers she needs—and clear herself of suspicion—she must join forces with Cole. They work undercover to bring justice, but they can't disguise the potent attraction and need that draw them together. Yet trust doesn't come easily for Cole…and when Megan unearths the grim, dark truth, can she trust him to believe her?", "hash": "4cf83adf-567c-448b-8cc2-007cb20c42c8"}, {"title": "Bride of the Night (Vampire Hunters #3)", "author": "Heather Graham", "pgs": 18, "sum": "Storyline: \nBride of the Night (Vampire Hunters #3) She's the vampire that could destroy a nation. At least, that's what Pinkerton detective Finn Dunne thinks of Tara Fox. Capturing her aboard a ship sneaking its way northward, he's convinced she's been sent to take out President Lincoln. While she's certainly the most attractive assassin he's ever faced, that won't keep him from his duty. Tara has always been caught between worlds. As a vampire born and raised in Key West, she has many friends among the humans. Many friends that are now fighting and dying in the raging Civil War. When her strange dreams began, she thought of them as abstract visions. But she now knows that she must travel to Washington, D.C., and protect the president at all costs. Finn still won't trust her, despite what he's seen. And if Tara has to go through him\u0097or bring reinforcements\u0097to save Lincoln, she will do whatever it takes, even if it costs her her heart.", "hash": "6dc00143-b15c-487c-a1ab-8ea664044cfc"}, {"title": "The Keepers (The Keepers Trilogy #1)", "author": "Heather Graham", "pgs": 39, "sum": "Storyline: \nThe Keepers (The Keepers Trilogy #1) At the core of New Orleans lie the otherworldly vampires and shape-shifters that hide in plain sight among mankind. As one of the Keepers, an elite group possessing superior skill and strength, Fiona MacDonald's duty is to maintain peace in a place where one vampire's bite could ignite war. When Detective Jagger DeFarge, a vampire, is called in at the discovery of a body drained of blood, both the detective and Fiona must join uneasy forces. Jagger will stop at nothing to find the murderer-- including working with the sensual and suspicious Fiona. As more die, it becomes clear that this isn't the work of an ordinary vampire. No one is safe. So when the killer's attention turns to Fiona, will Jagger risk destroying his own species to protect the woman he so passionately desires? The Keepers: Three extraordinary sisters, balancing the duties of their birthrights and the yearnings of their hearts…", "hash": "8a6b8a4e-c9f3-44fe-a913-04896c53eea6"}, {"title": "The Shifters (The Keepers Trilogy #2)", "author": "Alexandra Sokoloff", "pgs": 31, "sum": "Storyline: \nThe Shifters (The Keepers Trilogy #2) Charged with overseeing the shapeshifters of New Orleans, Caitlin MacDonald has her reasons for being wary of their kind. So when charismatic bounty-hunting shifter Ryder Malloy blows into town claiming to be on the trail of a horde of malevolent entities called Walk-Ins, Caitlin has no reason to trust him--with her city or her heart. But as tourists start dropping dead from supernatural possession, Cait must team with Ryder to navigate his shadowy, ephemeral world... Fiercely independent, Ryder usually hunts alone--but this case requires an exception. To prevent a supernatural massacre, he needs the beautiful Keeper on his side--and, if possible, even closer. In his world, appearances can be deceiving and deadly. And the only way they'll survive is if this woman who tempts him like no other trusts in him completely....", "hash": "dc6ddaaa-50d8-4f78-aa75-163e2fba614a"}, {"title": "The Wolven (The Keepers Trilogy #3)", "author": "Deborah Leblanc", "pgs": 37, "sum": "Storyline: \nThe Wolven (The Keepers Trilogy #3) Someone--or some\"thing\"--is systematically murdering the members of Danyon Stone's werewolf pack. As Alpha, he knows that finding and punishing the murderous entity is his responsibility, and he's not about to rest until he sees justice done. But to stop the slayings he has to accept help from the most unlikely source--a wickedly sensual \"mortal\" woman.Mystic-shop owner Shauna MacDonald has a special interest in the recent string of otherworldly deaths. As the Keeper of the werewolves, it's her duty to guard and protect the packs. Working by Danyon's side to stop an unknown killer--and trying to deny the potency of their illicit attraction--poses a threat to her heart unlike any she's ever known; and if she becomes the killer's next target, it could be the death of her....", "hash": "9f3e72df-2354-4463-b8dd-8fb25642124e"}, {"title": "Beneath a Blood Red Moon (Alliance Vampires #1)", "author": "Heather Graham", "pgs": 63, "sum": "Storyline: \nBeneath a Blood Red Moon (Alliance Vampires #1) IMMORTAL DANGER For more than a century, Maggie Montgomery has hidden her true nature from the humans around her. But when Lieutenant Sean Canady follows a trail of blood from a drained corpse to the door of her New Orleans boutique, the ethereal beauty realizes the comfortable life she's made for herself is once again in danger? IMMORTAL LOVE Despite her fears that her secrets are no longer safe, it's the past that could ultimately be Maggie's undoing. Sean Canady, a Civil War hero, was the love of her life. Only his memory has kept her from succumbing to her darkest urges all these years. Has the murder now brought him back into her life? Between them, they must find the truth, lest their lives and their souls be lost to the darkness she has fought for so very long. Her colorful cast of characters will engage.? ? Publishers Weekly on Deep Midnight", "hash": "133c498c-aaef-4f06-80d9-04530431dc9e"}, {"title": "When Darkness Falls (Alliance Vampires #2)", "author": "Heather Graham", "pgs": 63, "sum": "Storyline: \nWhen Darkness Falls (Alliance Vampires #2) What You See - In an ancient cemetery, travel writer Jade MacGregor’s tour of a Scottish tomb is marred by a terrifying attack that leaves her surrounded by corpses drained of blood. A year later, back home on a shadowy French Quarter street, she glimpses the oddly compelling stranger she met that day. Coincidence—or is it something far more disturbing? Could Kill You - Surrounded by her friends and engrossed in her work, Jade should feel secure. But then new bodies start showing up, and somebody is dogging her every move. Somebody who knows what she saw on that long ago afternoon among the gravestones and mausoleums. Somebody who will try to rescue her from the undead waiting to make her one of them.", "hash": "96fa12ac-0eb2-4ff0-9769-6f664ea7929d"}, {"title": "Deep Midnight (Alliance Vampires #3)", "author": "Heather Graham", "pgs": 64, "sum": "Storyline: \nDeep Midnight (Alliance Vampires #3) Hosted by the Contessa della Trieste, an opulent Carnevale ball in Venice takes a terrifying turn for American book critic Jordan Riley. As festivity turns into frenzy, Jordan is rescued by a powerful man disguised as a wolf. But was the mayhem she witnessed - the blood, the fangs, the screams - truly just entertainment, or something far more sinister? From a deconsecrated Venetian church to a secret society in New Orleans, Jordan is led on a nightmare journey to the razor's edge of reality. Her mysterious saviour is always a shadow behind her, both tormenting and tantalising her, as Jordan discovers a world of predators and survivors, a new order of vampires - and an eternal hunger that threatens to consume her.", "hash": "1509de78-8b9c-480c-80d9-f1d40085525a"}, {"title": "Realm of Shadows (Alliance Vampires #4)", "author": "Heather Graham", "pgs": 60, "sum": "Storyline: \nRealm of Shadows (Alliance Vampires #4) Every Nightmare Has Its Beginning Tara Mason wants more than tourist sights out of her trip to the city of dreams, something strange and off the beaten path. But is it her own curiosity that draws her to an ancient cemetery on the outskirts of Paris? Or is she lured by a dark, immortal force she is powerless to resist? When she realizes someone is chasing after her, a shadowy figure getting closer and closer, how quickly the dream becomes nightmare. . . In The Dead Of Night He calls himself a guardian. He is sworn to protect the innocent from an evil most never see. Now that he has caught up to her in the abandoned ruins of a country estate, he insists Tara must trust him. She has carelessly exposed herself. The evil has seen her, but he vows it will not claim her. . .", "hash": "9c764eb2-56ea-41e1-b5f7-54c4fcfc0a4b"}, {"title": "The Awakening (Alliance Vampires #5)", "author": "Heather Graham", "pgs": 78, "sum": "Storyline: \nThe Awakening (Alliance Vampires #5) The tree-lined streets and mystical shops of Salem, Massachusetts resonate with a seductive and brutal history. New Orleans musician Megan O’Casey has returned to the home of her ancestors to perform , with her husband Finn, in a weeklong series of concerts, culminating on All Hallow’s Eve…and to renew her connection with the past. But from the moment they arrive in Salem, Finn seems different—sensual beyond belief one moment; cold and ruthless the next. The locals—even Megan’s relatives—regard him strangely, with a distrust bordering on hatred. Megan must soon face the fact that something powerful is rising, a malevolence that may have already claimed Finn for its own… As the full moon approaches, Megan senses that she, too, is in great danger. Sinister forces seem to be bringing her closer to darkness in a centuries–old ritual that music cannot tame…and time cannot conquer…", "hash": "625a1cc4-8caf-4188-a234-1c24c053d487"}]