[{"title": "Dead By Dusk (Alliance Vampires #6)", "author": "Heather Graham", "pgs": 59, "sum": "Storyline: \nDead By Dusk (Alliance Vampires #6) The rustic oceanfront village of Bella Vista seems like something from an Italian postcard---until young women start diappearing, only to be found horribly mutilated. The polic fear a sexual serial killer is at work, somthing to e hushed up to keep the tourists calm. But the fear in the eyes of the locals says it all: the murders are starting again.... For American Stephanie Cahill, Bella Vista is a new beginning--a chance to put her painful past behind her. Yet, from the moment the first body is discovered at teh site of an archeological dig, Stephanie feels as if she's being watched, followed, studied...hunted. Archeologist Grant Peterson ssenses something odd about this dig, something that has him locking his door at night. And now, the echoes of a burial site's ancient legend can be found in the chilling signature of a killer on the loose. The powerful attraction between Stephanie and Grant is a complication neither can afford as they are pulled into a desperate race against time to keep Stephanie from joining the ranks of the missing . For nothing in Bella Vista is what it seems. No one can be trusted. And those closest to Stephanie may prove the most dangerous of all....", "hash": "5d84713a-0875-4585-87ba-44e87375db4d"}, {"title": "Something About Witches (Arcane Shot #1)", "author": "Joey W. Hill", "pgs": 56, "sum": "Storyline: \nSomething About Witches (Arcane Shot #1) It's amazing what a little magic can do... Ruby Night Divine is a gun shop owner. She's also a witch who knows magic can fail. She's experienced it first hand, with full-blown tragic consequences. Smith & Wesson is a whole hell of a lot more reliable, and nothing's as cathartic as the ability to put a few holes in the things that piss you off. Like Derek Stormwind. A powerful sorcerer, Derek is determined to get to the bottom of why Ruby pushed him away and ran three years before. He also needs her help. A coven needs training to fight a demon and his minions. While Ruby is willing to do it, she's sure it's just a ruse to get back in her heart—and her bed. The thing is, that's where she wants him. Unfortunately, her bed's already made, she's this close to losing her soul, and she fears nothing can save her. Not Derek. Not even Smith & Wesson.", "hash": "55d722a1-f93e-44ca-8c32-abb5a051bf10"}, {"title": "In the Company of Witches (Arcane Shot #2)", "author": "Joey W. Hill", "pgs": 60, "sum": "Storyline: \nIn the Company of Witches (Arcane Shot #2) All witch and part succubus, savvy businesswoman Raina has converted a Southern plantation house into an extremely profitable old-fashioned bordello. Because of her abilities as a witch, the demons under Raina’s protection can feed off the sexual energy of their clients without killing them—definitely a good thing for repeat business. But when a rogue incubus shows up on Raina’s doorstep begging for asylum, the witch’s well-run business is put in jeopardy. The incubus has stolen an object of great power from Lucifer, and Underworld Dark Guardian Mikhael will do anything to get it back—even if it means incinerating the incubus on Raina’s porch to get the answers he seeks. Not to be trifled with, Raina enters a dangerous match of wits with Mikhael to achieve their mutual goals—only to discover that the reluctant attraction between them is the most hazardous game of all…", "hash": "39a35371-40c2-4357-943f-72545040f66e"}, {"title": "First Drop of Crimson (Night Huntress World #1)", "author": "Jeaniene Frost", "pgs": 38, "sum": "Storyline: \nFirst Drop of Crimson (Night Huntress World #1) Denise MacGregor knows all too well what lurks in the shadows – her best friend is half-vampire Cat Crawfield – and she has already lost more than the average human could bear. But her family’s dark past is wrapped in secrets and shrouded in darkness – and a demon shapeshifter has marked Denise as prey. Now her survival depends on an immortal who craves a taste of her. He is Spade, a powerful, mysterious vampire who has walked the earth for centuries and is now duty-bound to protect this endangered, alluring human – even if it means destroying his own kind. Denise may arouse his deepest hungers, but Spade knows he must fight his urge to have her as they face the demon nightmare together…", "hash": "ad97a724-7cb9-4b37-b674-fb27ff47f76c"}, {"title": "Eternal Kiss of Darkness (Night Huntress World #2)", "author": "Jeaniene Frost", "pgs": 34, "sum": "Storyline: \nEternal Kiss of Darkness (Night Huntress World #2) Chicago private investigator Kira Graceling should have just kept on walking. But her sense of duty refused to let her ignore the moans of pain coming from inside a warehouse just before dawn. Suddenly she finds herself in a world she's only imagined in her worst nightmares. At the center is Mencheres, a breathtaking Master vampire who thought he'd seen it all. Then Kira appears, this fearless, beautiful . . . human who braved death to rescue him. Though he burns for her, keeping Kira in his world means risking her life. Yet sending her away is unthinkable. But with danger closing in, Mencheres must choose either the woman he craves, or embracing the darkest magic to defeat an enemy bent on his eternal destruction.", "hash": "09ce06fd-5a7d-4e7f-9bd8-316f8969907e"}, {"title": "Devil to Pay (Night Huntress #0)", "author": "Jeaniene Frost", "pgs": 16, "sum": "Storyline: \nDevil to Pay (Night Huntress Universe #3.5) Blake Turner had it all until a demon decided to take residence in his soul. Plagued with constant black outs and a trail of dead bodies in his wake, Blake thinks vampire Elise is his best chance at ending the nightmare. It's just too bad he's fallen in love with the gorgeous vamp right before he has to die.", "hash": "1921f6d6-4ec3-4c01-8041-1c3bf98b7a45"}, {"title": "At Grave's End (Night Huntress #3)", "author": "Jeaniene Frost", "pgs": 34, "sum": "Storyline: \nAt Grave's End (Night Huntress #3) It should be the best time of half-vampire Cat Crawfield’s life. With her undead lover Bones at her side, she’s successfully protected mortals from the rogue undead. But though Cat’s worn disguise after disguise to keep her true identity a secret from the brazen bloodsuckers, her cover’s finally been blown, placing her in terrible danger. As if that wasn’t enough, a woman from Bones’s past is determined to bury him once and for all. Caught in the crosshairs of a vengeful vamp, yet determined to help Bones stop a lethal magic from being unleashed, Cat’s about to learn the true meaning of bad blood. And the tricks she’s learned as a special agent won’t help her. She will need to fully embrace her vampire instincts in order to save herself—and Bones—from a fate worse than the grave.", "hash": "780f4be3-c41e-46cc-b05e-fe52db4b356a"}, {"title": "Kushiel's Justice (Imriel's Trilogy #2)", "author": "Jacqueline Carey", "pgs": 100, "sum": "Storyline: \nKushiel's Justice (Imriel's Trilogy #2) My blood beat hard in my veins and hammered in my ears, like the sound of bronze wings clashing. And I understand for the first time what it meant that Kushiel, the One God's punisher, had loved his charges too well... Imriel de la Courcel's blood parents are history's most reviled traitors, while his adoptive parents, Phèdre and Joscelin, are Terre d'Ange's greatest champions. Stolen, tortured, and enslaved as a young boy, Imriel is now a Prince of the Blood, third in line for the throne in a land that revels in beauty, art, and desire. After a year abroad to study at university, Imriel returns from his adventures a little older and somewhat wiser. But perhaps not wise enough. What was once a mere spark of interest between himself and his cousin Sidonie now ignites into a white-hot blaze. But from commoner to peer, the whole realm would recoil from any alliance between Sidonie, heir to the throne, and Imriel, who bears the stigma of his mother's of his mother's misdeeds and betrayals. Praying that their passion will peak and fade, Imriel and Sidonie embark on an intense, secret affair. Blessed Elua founded Terre d'Ange and bestowed one simple precept to guide his people: Love as thou wilt. When duty calls, Imriel honors his role as a member of the royal family by leaving to marry a lovely, if merely sweet, Alban princess. By choosing duty over love, Imriel and Sidonie may have unwittingly trespassed against Elua's law. But when dark powers in Alba, who fear an invasion by Terre d'Ange, seek to use the lovers' passion to bind Imriel, the gods themselves take notice. Before the end, Kushiel's justice will be felt in heaven and on earth.(", "hash": "03310d8b-302e-4a45-b719-1949f5ad14ab"}, {"title": "Kushiel's Mercy (Imriel's Trilogy #3)", "author": "Jacqueline Carey", "pgs": 93, "sum": "Storyline: \nKushiel's Mercy (Imriel's Trilogy #3) Having learned a lesson about thwarting the will of the gods, Imriel and Sidonie publicly confess their affair, only to see the country boil over in turmoil. Younger generations, infatuated by their heart-twisting, star-cross romance, defend the couple. Many others cannot forget the betrayals of Imriel's mother, Melisande, who plunged their country into a bloody war that cost the lives of their fathers, brothers, and sons. To quell the unrest, Ysandre, the queen, sets her decree. She will not divide the lovers, yet neither will she acknowledge them. If they marry, Sidonie will be disinherited, losing her claim on the throne. There's only one way they can truly be together. Imriel must perform an act of faith: search the world for his infamous mother and bring her back to Terre d'Ange to be executed for treason. Facing a terrible choice, Imriel and Sidonie prepare ruefully for another long separation. But when a dark foreign force casts a shadow over Terre d'Ange and all the surrounding countries, their world is turned upside down, alliances of the unlikeliest kind are made, and Imriel and Sidonie learn that the god Elua always puts hearts together apurpose.", "hash": "b067bb88-e725-4a25-9840-676fed731076"}, {"title": "Naamah's Kiss (Moirin's Trilogy #1)", "author": "Jacqueline Carey", "pgs": 87, "sum": "Storyline: \nNaamah's Kiss (Moirin's Trilogy #1) Once there were great magicians born to the Maghuin Dhonn, the folk of the Brown Bear, the oldest tribe in Alba. But generations ago, the greatest of them all broke a sacred oath sworn in the name of all his people. Now only small gifts remain to them. Through her lineage, Moirin possesses such gifts - the ability to summon the twilight and conceal herself, and the skill to coax plants to grow. Moirin has a secret, too. From childhood onward, she senses the presence of unfamiliar gods in her life - the bright lady and the man with a seedling cupped in his palm. Raised in the wilderness by her reclusive mother, Moirin learns only when she comes of age how illustrious, if mixed, her heritage is. The great-granddaughter of Alais the Wise, child of the Maghuin Donn and a cousin of the Cruarch of Alba, Moirin learns her father was a D'Angeline priest dedicated to serving Naamah, goddess of desire. After Moirin undergoes the rites of adulthood, she finds divine acceptance...on the condition that she fulfill an unknown destiny that lies somewhere beyond the ocean. Or perhaps oceans. Beyond Terre d'Ange, where she finds her father, in the far reaches of distant Ch'in, Moirin's skills will be a true gift when facing the vengeful plans of an ambitious mage, a noble warrior-princess desperate to save her father's throne, and the spirit of a celestial dragon.", "hash": "e0a7a3bb-c676-443b-88d3-59c25fb022b3"}]