[{"title": "Naamah's Curse (Moirin's Trilogy #2)", "author": "Jacqueline Carey", "pgs": 73, "sum": "Storyline: \nNaamah's Curse (Moirin's Trilogy #2) Far from the land of her birth, Moirin sets out across Tatar territory to find Bao, the proud and virile Ch'in fighter who holds the missing half of her diadh-anam, the divine soul-spark of her mother's people. After a long ordeal, she not only succeeds, but surrenders to a passion the likes of which she's never known. But the lovers' happiness is short lived, for Bao is entangled in a complication that soon leads to their betrayal.", "hash": "e302e1c0-cb68-4345-89e2-02fe7d36879a"}, {"title": "Naamah's Blessing (Moirin's Trilogy #3)", "author": "Jacqueline Carey", "pgs": 79, "sum": "Storyline: \nNaamah's Blessing (Moirin's Trilogy #3) Returning to Terre d'Ange, Moirin finds the royal family broken. Wracked by unrelenting grief at the loss of his wife, Queen Jehanne, King Daniel is unable to rule. Prince Thierry, leading an expedition to explore the deadly jungles of Terra Nova, is halfway across the world. And three year old Desirée is a vision of her mother: tempestuous, intelligent, and fiery, but desperately lonely, and a vulnerable pawn in a game of shifting political allegiances. As tensions mount, King Daniel asks that Moirin become Desirée's oath-sworn protector. Navigating the intricate political landscape of the Court proves a difficult challenge, and when dire news arrives from overseas, the spirit of Queen Jehanne visits Moirin in a dream and bids her undertake an impossible quest. Another specter from the past also haunts Moirin. Travelling with Thierry in the New World is Raphael de Mereliot, her manipulative former lover. Years ago, Raphael forced her to help him summon fallen angels in the hopes of acquiring mystical gifts and knowledge. It was a disastrous effort that nearly killed them, and Moirin must finally bear the costs of those bitter mistakes.", "hash": "e8fd59e1-77d1-499c-9a48-cebc6b66f9aa"}, {"title": "Kushiel's Dart (Phedre's Trilogy #1)", "author": "Jacqueline Carey", "pgs": 82, "sum": "Storyline: \nKushiel's Dart (Phèdre's Trilogy #1) The land of Terre d'Ange is a place of unsurpassing beauty and grace. It is said that angels found the land and saw it was good...and the ensuing race that rose from the seed of angels and men live by one simple rule: Love as thou wilt. Phèdre nó Delaunay is a young woman who was born with a scarlet mote in her left eye. Sold into indentured servitude as a child, her bond is purchased by Anafiel Delaunay, a nobleman with very a special mission...and the first one to recognize who and what she is: one pricked by Kushiel's Dart, chosen to forever experience pain and pleasure as one. Phèdre is trained equally in the courtly arts and the talents of the bedchamber, but, above all, the ability to observe, remember, and analyze. Almost as talented a spy as she is courtesan, Phèdre stumbles upon a plot that threatens the very foundations of her homeland. Treachery sets her on her path; love and honor goad her further. And in the doing, it will take her to the edge of despair...and beyond. Hateful friend, loving enemy, beloved assassin; they can all wear the same glittering mask in this world, and Phèdre will get but one chance to save all that she holds dear. Set in a world of cunning poets, deadly courtiers, heroic traitors, and a truly Machiavellian villainess, this is a novel of grandeur, luxuriance, sacrifice, betrayal, and deeply laid conspiracies. Not since Dune has there been an epic on the scale of Kushiel's Dart-a massive tale about the violent death of an old age, and the birth of a new.", "hash": "7c74b51f-b961-47fd-8780-ffcddcbd45f0"}, {"title": "Kushiel's Chosen (Phedre's Trilogy #2)", "author": "Jacqueline Carey", "pgs": 94, "sum": "Storyline: \nKushiel's Chosen (Phèdre's Trilogy #2) Mighty Kushiel, of rod and weal Late of the brazen portals With blood-tipp'd dart a wound unhealed Pricks the eyen of chosen mortals The land of Terre d'Ange is a place of unsurpassed beauty and grace. The inhabiting race rose from the seed of angels and men, and they live by one simple rule: Love as thou wilt. Phèdre nó Delaunay was sold into indentured servitude as a child. Her bond was purchased by a nobleman, the first to recognize that she is one pricked by Kushiel's Dart, chosen to forever experience pain and pleasure as one. He trained Phèdre in the courtly arts and the talents of the bedchamber--and, above all, the ability to observe, remember, and analyze. When she stumbled upon a plot that threatened the very foundations of her homeland, she gave up almost everything she held dear to save it. She survived, and lived to have others tell her story, and if they embellished the tale with fabric of mythical splendor, they weren't far off the mark. The hands of the gods weigh heavily upon Phèdre's brow, and they are not finished with her. While the young queen who sits upon the throne is well loved by the people, there are those who believe another should wear the crown...and those who escaped the wrath of the mighty are not yet done with their schemes for power and revenge.", "hash": "3b5179e3-a002-425c-b8af-985aef8cf1d1"}, {"title": "Kushiel's Avatar (Phedre's Trilogy #3)", "author": "Jacqueline Carey", "pgs": 141, "sum": "Storyline: \nKushiel's Avatar (Phèdre's Trilogy #3) The land of Terre d'Ange is a place of unsurpassed beauty and grace. It's inhabited by the race that rose from the seed of angels, and they live by one simple rule: Love as thou wilt. Phèdre nó Delaunay was sold into indentured servitude as a child. Her bond was purchased by a nobleman who recognized that she was pricked by Kushiel's dart, chosen to forever experience pain and pleasure as one. Phèdre's path has been strange and dangerous. She has lain with princes and pirate kings, battled a wicked temptress, and saved two nations. Through it all, the devoted swordsman Joscelin has been at her side, following the central precept of the angel Cassiel: Protect and serve. But Phèdre's plans will put his pledge to the test, for she has never forgotten her childhood friend Hyacinthe. She has spent ten long years searching for the key to free him from his eternal indenture to the Master of Straights, a bargain with the gods to save Phèdre and a nation. The search will take Phèdre and Joscelin across the world and down a fabled river to a forgotten land. . . and to a power so intense and mysterious, none dare speak its name.", "hash": "35372ade-62ff-48c1-8c4a-94959e9e9ef6"}, {"title": "In the Company of Vampires (Dark Ones #8)", "author": "Katie MacAlister", "pgs": 52, "sum": "Storyline: \nIn the Company of Vampires (Dark Ones #8) Fran was a young witch of 16 when she became Ben’s Beloved, bound to him by fate to save his immortal soul—as if puberty isn’t hard enough. Over the next five years, she fights hard for space, and time, to grow into her own person, pushing Ben away. But when her mother goes missing, she returns to GothFaire to find her, only to find Ben in another woman’s arms. Having not only to face Ben’s secrets, but also a vengeful Norse god, will Fran be able to find out what has really happened to her mother, and to her own heart, in time?", "hash": "afaf4da3-e442-4bdf-ab68-2833bed299c5"}, {"title": "Much Ado About Vampires (Dark Ones #9)", "author": "Katie MacAlister", "pgs": 21, "sum": "Storyline: \nMuch Ado About Vampires (Dark Ones #9) Bitter at first bite… Corazon Ferreira is one heck of a jaded woman. Not only did her husband dump her for a pretty, vivacious blonde, but her sister has lost her mind and married a vampire. Worse, it turns out that Cora herself was a vampire’s mate in a past life…the very same vampire she witnessed killing someone. If only Cora hadn’t inadvertently been caught up in the ill-laid plans of a reanimated corpse and its master, she could deal with the distractingly gorgeous vampire. But it’s only Alec who stands between her and those who threaten her existence, and there’s only so much temptation a woman can bear before she starts taking her heart as seriously as her head…", "hash": "79e02a98-9a85-4fad-8e32-9e5426a1211e"}, {"title": "A Tale of Two Vampires (Dark Ones #10)", "author": "Katie MacAlister", "pgs": 49, "sum": "Storyline: \nA Tale of Two Vampires (Dark Ones #10) Iolanthe Tennyson has had a very bad year—due in part to the very bad men in her life. So, she’s accepted her cousin’s invitation to spend the summer in Austria indulging in her photography hobby. There, rumors of a haunted forest draw Iolanthe into the dark woods—and into the eighteenth century… Nikola Czerny is a cursed man, forced by his half-brothers to live forever as a Dark One. But his miserable existence takes an intriguing turn when a strange, babbling woman is thrown in his path. Iolanthe claims to know Nikola’s daughter—three hundred years in the future. She also knows what fate—in the form of his murderous half-brothers—has in store for him. If only she knew the consequences of changing the past to save one good, impossibly sexy vampire…", "hash": "9279a0dc-68e7-4096-b160-4c6136a7598f"}, {"title": "Playing With Fire (Silver Dragons #1)", "author": "Katie MacAlister", "pgs": 25, "sum": "Storyline: \nPlaying With Fire (Silver Dragons #1) Gabriel Tauhou, wyvern of the silver dragons, has found the one woman who can withstand his fire. Too bad May Northcott is already bound to a demon lord. But when the demon orders May to steal one of Gabriel's treasures:An immensely important relic of all dragonkin - Gabriel has to decide which to protect: his love or his dragons.", "hash": "70b34382-dd63-4244-8810-4d74315e2931"}, {"title": "Embraced By Darkness (Riley Jenson Guardian #5)", "author": "Keri Arthur", "pgs": 14, "sum": "Storyline: \nEmbraced By Darkness (Riley Jenson Guardian #5) She's hunting a killer and shattering every boundary she's ever known. Part vamp, part werewolf, Riley Jenson plays by her own rules, whether it's her stormy love life or her job as a guardian. But when her family's alpha male demands that she solve the mystery of a vanished girl, Riley can feel a trap closing in around her. Because the job comes with a catch: if Riley fails, her own mother will die. Now the stakes are raised, the hunt is on...and when more women vanish, Riley is caught between a lover who demands that she give up her work, a serial killer who knows no boundaries, and a club where humans and supernaturals mix at their own peril. Thrust into a realm of seduction and violence unlike any she could have imagined, Riley has to battle to save everything she holds dear. But the ultimate hunt has only just begun....", "hash": "12f0eab7-4de9-4afb-8045-0f1c8cccd60b"}]