[{"title": "Darkness Devours (Dark Angels #3)", "author": "Keri Arthur", "pgs": 55, "sum": "Storyline: \nDarkness Devours (Dark Angels #3) New York Times bestselling author Keri Arthur has been hailed for her “smart, sexy”* urban fantasy novels. Now, she continues her Dark Angels series set in the realm of danger and desire known as the Guardian World… Half-werewolf, half-Aedh Risa Jones can enter the realm between life and death, and she can see the Reapers who collect the souls of the dead. Now, she is using her gifts—and the investigative know-how of a man who broke her heart—to find a cabal searching for the power to control time, reality, and fate. And this is besides her work for the Vampire Council, half of whom want her dead. But for now the Council needs her alive. Someone is killing blood-whore addicted vampires, and Risa must find the guilty party. If she succeeds, she may finally convince the council to lift the execution order on her life. But before she succeeds, she must first survive…", "hash": "bb42eb2e-c364-4953-a4e2-70a2b024a287"}, {"title": "Darkness Hunts (Dark Angels #4)", "author": "Keri Arthur", "pgs": 52, "sum": "Storyline: \nDarkness Hunts (Dark Angels #4) \"New York Times\" bestselling author Keri Arthur returns to the enthralling Guardian World--and a twilight realm of danger and desire... Risa Jones, half-Aedh/half-werewolf, can enter the realm between life and death. She can speak to the dying and the dead, and she can see the reapers, collectors of souls. What she can not yet see is the identity of a stranger murdering women and draining their blood. Now Risa must summon her gifts to find him, even if it means putting her own life in danger. But Risa needn't look far. The killer knows who she is. He tells her his victims are infected by darkness and he's fated to destroy them. Fascinated by Risa, he engages her in a sinister game: the chance to save the life of his next victim by deciphering his series of clues. In a race against time, she enlists the help of the reaper Azriel. But as an attraction between them grows, so does the fear that the stranger's motives are only part of a larger, more dangerous stratagem--one that that has lured Risa and Azriel into the dark.", "hash": "837875c3-9f2d-44bc-9aa0-3430683eb1ea"}, {"title": "Darkness Unmasked (Dark Angels #5)", "author": "Keri Arthur", "pgs": 52, "sum": "Storyline: \nDarkness Unmasked (Dark Angels #5) Keri Arthur's explosive Dark Angels series is packed with everything you could want: a fiesty heroine, witches, vampires, werewolves, demons, angels of death, suspense and a whole lot of sexy action. The sexy, exciting, suspenseful adventures continue in New York Times bestselling author Keri Arthur's Dark Angels series, starring Risa Jones, a half-Aedh/half-werewolf. She can speak to the souls of the dying and the dead, and can see Reapers, the collectors of souls. Shortly after her fight on the astral plane, Risa receives a phone call from Madeline Hunter, the leader of the vampire council, ordering her to investigate the death of Hunter's close friend and lover - Wolfgang Schmidt. His body has been discovered wrapped in a web-like substance and has been completely drained. As the body count continues to grow, Risa must summon her gifts to find the dark spirit before it strikes again. Meanwhile, as the search for the keys that keep the gate to Hell closed grows more intense, Risa begins to unravel mysteries that will have startling consequences for her.", "hash": "4fea59ae-4984-4be6-9e9f-01592c9bea3f"}, {"title": "Darkness Splintered (Dark Angels #6)", "author": "Keri Arthur", "pgs": 50, "sum": "Storyline: \nDarkness Splintered (Dark Angels #6) When Risa loses the second key to hell, she angers several powerful people, and she’s starting to feel the pressure from all sides. She gets a visit from her father, who gives her an ultimatum: Get back the key or he will kill her friends. Risa also finds herself under the scrutiny of the vampire council, some of whom consider her a monster who should be destroyed. But they offer her a bloody bargain: Take on the lethal head of the council, Madeline Hunter, and others will support her. As the search for the keys to hell heats up, Risa realizes that she has no choice. For the sake of the people she loves, she must find the keys — and get rid of Hunter — before the second gate is opened and brings the world closer to all hell breaking loose...", "hash": "fe7e3f88-93c9-44de-a9a3-b07c8f4b41b2"}, {"title": "Dark Awakening (Dark Dynasties #1)", "author": "Kendra Leigh Castle", "pgs": 50, "sum": "Storyline: \nDark Awakening (Dark Dynasties #1) Enter the world of the Dark Dynasties... For centuries, shapeshifting vampire Tynan MacGillivray has prowled the night as an outcast, valued only for his ferocious hunting skills. When a feud among the immortals escalates into all-out war, he is ordered by his ruthless queen to locate a Seer - a human woman with a special gift - who can secure victory for their clan. Ty's search leads him to a quiet New England town, but once he has the Seer in his grasp, her touch awakens within him a hunger like he's never known... Lily Quinn has always been different. Since childhood, she's had vivid nightmares and an eerie sixth sense. When a sexy, silver-eyed stranger demands her help, Lily plunges into a new world of danger and sensuality. With Ty, she discovers sizzling passions she cannot deny and powers she cannot control. Soon, it is clear that Lily is much more than a Seer - she holds the key to ancient secrets and unthinkable destruction. But will a vampire's vow of eternal protection stop these evil forces...or unleash her dark destiny?", "hash": "3df0332d-4ff6-455c-9e97-44881045d8d5"}, {"title": "Midnight Reckoning (Dark Dynasties #2)", "author": "Kendra Leigh Castle", "pgs": 51, "sum": "Storyline: \nMidnight Reckoning (Dark Dynasties #2) Wild and passionate by nature, Lyra Black is not just any werewolf. She's the future leader of the powerful pack of the Thorn - if she can stay alive long enough to inherit the title. One of the Cait Sith bloodline of vampire cat-shifters, Jaden Harrison has no interest in the wars plaguing the world of night. But when he rescues Lyra from a violent attack, they're both captured by an insatiable desire that threatens to overwhelm them and bind them together for eternity... just as ancient enemies prepare to strike. And when they do, the Thorn and the Cait Sith - and Lyra and Jaden's love - may never recover from the deadly blow...", "hash": "9b06867b-f107-4b6b-8b8c-31e5dfac17ca"}, {"title": "Shadow Rising (Dark Dynasties #3)", "author": "Kendra Leigh Castle", "pgs": 49, "sum": "Storyline: \nShadow Rising (Dark Dynasties #3) Ancient Secrets, Dark Passions... As one of the Grigori, a noble vampire dynasty shrouded in mystery, Ariane has spent her life hidden away in the desert. Like all of her kind, she is a watcher, fated to observe, forbidden to act. Yet when her best friend, Sammael, vanishes, she defies all rules and flees her safe haven to bring him home. A shape-shifting assassin for the House of Shadows, Damien Tremaine is hired to locate Sammael. His hunt for the wayward Grigori leads him to Ariane, the rogue vamp who stands between him and his bounty. Damien never lets emotion interfere with his work, but a single touch from the sexy, beguiling vampire shatters his self-control. Drawn together by their common goal, what begins as an alliance of necessity soon becomes one of desire. But when the secret at the dark heart of the Grigori comes to light, Damien and Ariane must make a choice that could bind them eternally...or tear them—and everything they care about—apart.", "hash": "0f78d7d1-e616-4516-9ace-403167f64a50"}, {"title": "Call of the Highland Moon (The MacInnes Werewolves #1)", "author": "Kendra Leigh Castle", "pgs": 54, "sum": "Storyline: \nCall of the Highland Moon (The MacInnes Werewolves #1) Gideon is a werewolf from the Scottish Highlands. He loves the haunting beauty of his home, but grappling with the destiny of being his clan's next alpha, he runs away to upstate New York. Where, working in a bookshop, he finds a human mate, who has to choose between love and protecting humankind.", "hash": "a6ac51ac-f798-4880-8f7a-4b4358ba4185"}, {"title": "Dark Highland Fire (The MacInnes Werewolves #2)", "author": "Kendra Leigh Castle", "pgs": 56, "sum": "Storyline: \nDark Highland Fire (The MacInnes Werewolves #2) Gabriel MacInnes has led a charmed life. A Highland werewolf of Alpha lineage, he'd always thought that, as the second son, he'd never have to worry much about responsibility. But with his Pack now squarely in the sights of an ancient and rediscovered enemy, everything has begun to change.", "hash": "9be39cd2-e82d-40e3-8bda-0b6564b3099e"}, {"title": "Vampires Are Forever (Argeneau #8)", "author": "Lynsay Sands", "pgs": 37, "sum": "Storyline: \nVampires Are Forever (Argeneau #8) Inez Urso is beginning to have her doubts. Her business associate Thomas Argeneau has some interesting traits, like an allergic reaction to the sun, excellent night vision, and not much of an appetite for food. And to top it all off, he just tried to bite her neck . . . but maybe that was a sign of passion. If so, she'd be happy to experience more, despite her determination not to mix business with pleasure. Well, if not forever, at least two hundred years. Inez is the most beautiful woman he's seen in centuries. Those luscious lips, seductive curves, and her elegant neck . . . he just couldn't resist the temptation of one little bite. Now Thomas will do anything to convince her that only an immortal like him can satisfy her all night long . . .", "hash": "41103d4a-2c6e-4462-a559-d2ad0eaa38ad"}]