[{"title": "Eternal Hunger (Mark of the Vampire #1)", "author": "Laura Wright", "pgs": 38, "sum": "Storyline: \nEternal Hunger (Mark of the Vampire #1) In the dark, fear and desire are one. Alexander Roman wants nothing to do with the controlling rulers of his vampire breed or the family he escaped from a hundred years ago. But as a new threat to the pureblood vampires emerges, Alexander's ties to the past are forced upon him again, and without warning, he finds himself— disoriented, terrified, and near death—at the door of a stranger. Fear is in the blood. Dr. Sara Donohue is dedicated to removing the traumatic memories of her patients—like those of the stranger at her front door. But what he tells her of his past is too astonishing to believe. Yet she has seen his flesh scarred by the sun and witnessed his inhuman strength. And never before has she felt so connected to a man. Love is eternal... But as their worlds collide, Sara and Alexander are bound by something stronger, as one becomes hunter and the other prey.", "hash": "a6ab7436-99b7-40df-871c-2f01857df3cd"}, {"title": "Eternal Kiss (Mark of the Vampire #2)", "author": "Laura Wright", "pgs": 37, "sum": "Storyline: \nEternal Kiss (Mark of the Vampire #2) Sacrifice will be their downfall. And their resurrection. Family is blood. His father unknown, his mother dead, Nicholas Roman was raised by the vampire Breed with one wish: to live as a normal vampire. But once he's transformed against his will into a gifted immortal, Nicholas now has one goal: to stop the Eternal Order of vampires from controlling his life and from transforming more males from his bloodline for their vicious reign. Then comes a beautiful stranger with a startling secret. Vampire Kate Everborne claims she's sheltering Nicholas' long-lost son. If this is true, then who is the mother? And how endangered are they if, indeed, Nicholas does possess the bloodline so coveted by the Order? These are questions that with every seductive whisper, every silken touch, draw Nicholas and Kate intimately closer and nearer still to the truth. But aroused too are Nicholas' fears that this tantalizing woman has even more secrets—both dangerous and provocative—she has yet to share.", "hash": "d2f731ee-db9e-4237-b151-6c5045cdb73b"}, {"title": "Eternal Captive (Mark of the Vampire #3)", "author": "Laura Wright", "pgs": 31, "sum": "Storyline: \nEternal Captive (Mark of the Vampire #3) When Lucian is faced with his biggest fear - becoming the next breeding male - he knows his only options are imprisonment or death. But when he learns that the key to his salvation may lie in the body of the veana he's trying to forget, he's forced to choose between sanity and the destruction of the only woman he's ever loved.", "hash": "81ce1fd4-ca05-4189-8a8e-23130ec9b3ae"}, {"title": "Eternal Beast (Mark of the Vampire #4)", "author": "Laura Wright", "pgs": 26, "sum": "Storyline: \nEternal Beast (Mark of the Vampire #4) A Taste of Blood Ever since his abduction by the Eternal Order of Vampires, Gray Donohue has finally found his true calling: vengeance. He will stop at nothing to bring his fellow Impure vampires the freedom they deserve. Now if he could just release his primal need for the beautiful vampire who saved his life—and rules his thoughts and desires… After nearly killing the senator she was assigned to protect, Dillon is now in mortal danger. The jaguar within her has been unleashed, and she can no longer control it. Sex is the only thing that can tame her shift. And Gray is the only man who can make her surrender to a passion strong enough to overpower her inner beast. But she doesn’t want to surrender—she wants her life back. Because she is determined never to belong to anyone, especially not Gray—the male whom destiny claims is her mate…", "hash": "9b545e27-8b2a-4c52-a5eb-8ca1d4f33506"}, {"title": "Eternal Demon (Mark of the Vampire #5)", "author": "Laura Wright", "pgs": 26, "sum": "Storyline: \nEternal Demon (Mark of the Vampire #5) When Erion’s son is kidnapped by the evil vampire Cruen, Erion vows to stop at nothing to find his hideaway—including intercepting the traveling party of Cruen’s beautiful bride-to-be. But instead of a vulnerable caravan, Erion is met by a feral band of female demons that includes Hellen, the bride—a creature of dark magic and darker passion. Though the safety of his son is foremost, Erion can’t deny his unexpected connection to Hellen—inflaming a manic desire as primal as it is irresistible. As their bond intensifies, they move toward an inevitable and terrifying battle. With time running out, Erion realizes he must not only find and rescue his son but protect Hellen from Cruen and the underworld forces waiting to destroy her for her betrayal.", "hash": "382670b6-0897-4642-aa5c-4a19d2cbe9bd"}, {"title": "Eternal Sin (Mark of the Vampire #6)", "author": "Laura Wright", "pgs": 43, "sum": "Storyline: \nEternal Sin (Mark of the Vampire #6)  Love and Vengeance... The violent attack left Synjon destroyed and his lover dead—at the will of the evil vampire Cruen. Syn’s passionate savior was Petra. When she became pregnant with his child, it should have been a blessing—until Syn vanished after discovering the truth: Petra was the daughter of the man he despised above all others. The daughter of Cruen. When Petra’s health begins to decline, she contacts Syn to help save their baby. Though reluctant to see Petra, he cannot turn his back on his own innocent child. But night after night, as his feelings for Petra are rekindled, Syn becomes increasingly torn. Although everyone assumes that Cruen is dead, Syn is not convinced—and is still hell-bent on finding and destroying him once and for all. But will his thirst for vengeance keep him from seeing what is really worth living for before it is too late?", "hash": "942e4d82-3f0c-43ae-8826-64b02503dc41"}, {"title": "Eternal Beauty (Mark of the Vampire #0)", "author": "Laura Wright", "pgs": 10, "sum": "Storyline: \nEternal Beauty (Mark of the Vampire #4.5) He is captivated by the one who saved him from death—until he finds out who she is… When his lover is murdered by evil vampire-beast, Cruen, the grief-stricken Synjon Wise believes his life over. Enraged, he flashes her away to a remote spot in South America to give his beloved’s body a proper burial. But when the sun blazes overhead and takes her body before his eyes, Synjon’s mind completely unravels. Mad with the need to join her, he walks into the sun a morphed male, prepared to die. He awakens to find himself amongst a breed known as Shifters. As he is nursed back to health by Petra, who saved his life, Synjon feels no gratitude—only anger and guilt that he is still alive. But this female is strong and refuses to let Syn waste away. For the bond that will form between them will be enduring: as nurse and patient, male and female, savior and saved. Betrayer and betrayed…", "hash": "e6273ed6-fe6b-4fdf-8d6c-761a4cb264a7"}, {"title": "Eternal Blood (Mark of the Vampire #0)", "author": "Laura Wright", "pgs": 4, "sum": "Storyline: \nEternal Blood (Mark of the Vampire #2.5) An Original Mark of the Vampire Novella Gray Donahue is crippled by the guilt he feels for his father's death. An Impure vampire cursed with the ability to hear the thoughts of others, he indulges in blood and sex to stave off the pain of his existence. He is then abducted by the Eternal Order of Vampires, who subject him to a nightmarish ritual. But when he is rescued by the icy pureblood vampire Dillon, he finds something that is worth living for, dying for, killing for.... \"An addictive new series.\"-New York Times bestselling author Nalini Singh Includes a teaser chapter from the latest Mark of the Vampire novel, Eternal Captive, and a letter from the author.", "hash": "635d122c-6c2e-465f-9244-7ed57b90ca08"}, {"title": "Mates: True and Eternal (Mark of the Vampire #0)", "author": "Laura Wright", "pgs": 2, "sum": "Storyline: \nFree Read on laurawright.com. Alexander Roman and his true mate, Sara Donohue. A snippet of life after their happily ever after.. *Will be followed by Nicholas and Kate, as well and Lucian and...", "hash": "a0ccfb60-b7b3-44fb-bf54-a853ffd9d6f3"}, {"title": "Raphael Parish (Bayou Heat #1)", "author": "Laura Wright", "pgs": 15, "sum": "Storyline: \nRaphael/Parish (Bayou Heat #1-2) by Alexandra Ivy , Laura Wright RAPHAEL The brilliant and dangerous diplomat of the Pantera shapeshifters, Raphael has devoted his life to discovering the key to the infertility that is threatening the extinction of his puma race. Creating a vast network of spies worldwide, he never expected to discover that the answer might be beneath his very nose. But when Ashe, a beautiful human female, crosses his path, his most primitive instincts are stirred. Unable to resist, he takes her to his bed, and is shocked when she becomes pregnant with his child. It’s a miracle that might prove to be the salvation of his people, but only if he can keep her safe from the mercenaries determined to kill her. PARISH Untamed and undeniably sexy, Parish, leader of the Pantera hunters, rarely leaves the magic of the Wildlands to deal with the humans he despises. But with the prized and risky Pantera birth on the way, puma shifter, Parish must travel to New Orleans to find and bring back a human doctor. The moment he sees the lovely, talented and all too human Dr. Julia Cabot he cannot resist the wild, potent drive to make her his. Betrayed and destroyed by love, Julia will not let her heart choose her path again. But as she and Parish fight to save the life of an unborn child, a fierce and overwhelming bond develops between them, threatening her frozen heart with the secret hope and ultimate temptation of love and family.", "hash": "562968e9-5354-417a-9a3e-1d37bc6be63d"}]