[{"title": "Bayon Jean-Baptiste (Bayou Heat #3)", "author": "Laura Wright", "pgs": 16, "sum": "Storyline: \nBayon/Jean-Baptiste (Bayou Heat #3-4) by Alexandra Ivy , Laura Wright The fight continues in the Wildlands. Facing extinction, the Pantera have been given a miracle. A child. The first one in over fifty years. But even as they prepare to celebrate, the enemy strikes, putting at risk the fragile female who carries the hope of their people. BAYON Charming, drop-dead gorgeous Hunter Bayon is thirsting for revenge on the enemies who slipped into the Wildlands and attacked Ashe and her vulnerable child. Pledging to track down the cowards, Bayon goes on the hunt, pursuing the humans to a nearby town. But searching their shabby hideaway, he makes a discovery that shocks him to his very soul and might very well destroy the heart of the Pantera. JEAN-BAPTISTE Tattooed and pierced, sexy Nurturer Jean-Baptiste has been living in utter isolation. His cat is out of control, and the only thing that soothes the beast is a rare mineral he keeps inking into his skin. Until he meets her: Genevieve Burel. The beautiful and buttoned-up female puma is unlike anyone he’s ever met. She makes his cat purr, and he knows he must possess her, mate with her. But the secret she's keeping might threaten not only their unbridled passion for one another, but the very future of the Pantera race.", "hash": "43f9a67f-018b-4525-bf14-fce2a05cd850"}, {"title": "Talon/Xavier (Bayou Heat #5)", "author": "Laura Wright", "pgs": 17, "sum": "Storyline: \nTalon/Xavier (Bayou Heat #5-6) by Alexandra Ivy, Laura Wright New Year. New Species. Welcome to the Wildlands. TALON After the tragic death of his parents when Talon was young, he’s dedicated his life to protecting the Pantera. To the strikingly gorgeous man, loyalty and honor mean everything. So it’s no surprise that he’s determined to treat Isi Rousseau as the enemy. If the elders believe she is a danger then he will do whatever necessary to prevent her from destroying his beloved Wildlands. But discovering the delicate beauty sleeping in his bed, Talon discovers his noble intentions wavering. The female, with short, jet black hair streaked with blue, and a pair of dark eyes, might act tough, but it’s obvious to him that she’s as desperate as he is for a place to call home. More importantly, her presence is helping keep Ashe and her baby alive. Suddenly things are not quite as black and white as Talon assumed, and he must decide if his loyalty to his people is worth losing his true mate. XAVIER He shouldn’t want his best friend’s little sister… The drop-dead gorgeous leader of the Geeks, Xavier has one goal: find the human male his enemies seek. Devoted to his work, and to the Pantera, there is nothing that can distract him from accomplishing his goal. Until he spots his best friend’s little sister alone and partying it up with a bunch of human males at the local bar. Consumed with possessiveness, Xavier takes her home and refuses to leave her side until her brother returns. He tries to convince himself he’s just looking out for her, but the longer he’s around Amalie, the harder it is to deny the molten attraction that burns between them. She has three days to change his mind… Beautiful and strong-willed Hunter, Amalie is free. No brother to tell her what to do, and no Pantera watching over her because she happens to be the last Pantera born. But before she can truly enjoy herself, her brother’s best friend tries to put her on lockdown. Xavier has been the star in all of Mal’s fantasies, and there’s no one she’d rather give her virginity to. But the sexy male refuses to open his eyes and see what’s right in front of him. Mal knows she has three days to change his mind. Three days to make him see her as grown, and the one female he can’t resist.", "hash": "8ebf011e-52ed-4842-857a-0cb2fda4c2bf"}, {"title": "Craved (Gwen Sparks #1)", "author": "Stephanie Nelson", "pgs": 38, "sum": "Storyline: \nCraved (Gwen Sparks #1) WITCH FOUND DRAINED Gwen Sparks just wants to live a peaceful life in the supernatural town of Flora, but from the moment she read about the first murdered witch, all hope of peace was abandoned. Possessing the rare ability to read the memories of dead, she volunteers to help catch the culprit behind the string of drained witches. Gwen has to team up with the one man who broke her heart, deal with a ghost who pulls her into the deathly realm at will, and a fight off the advances of sexy but frustrating vampire who not only craves what runs through her veins—he wants her heart.", "hash": "8cd31f79-79d4-4bcc-a75a-71d3b794e336"}, {"title": "Deceived (Gwen Sparks #2)", "author": "Stephanie Nelson", "pgs": 42, "sum": "Storyline: \nDeceived (Gwen Sparks #2) The vampire drug, brew, nearly ruined Gwen Sparks’ life. Just when things started to get back to normal between her and Aiden, she is summoned by the North American Witches Council to their central city of Moon. A war is imminent between vampires and witches, and Gwen’s experiences with brew are being used to fuel the fire. She is about to discover just how powerful she is with the help of the ruggedly handsome Angel of Death and just how far some people will go to get what they want. Gwen is going to learn exactly what it means to be Deceived.", "hash": "38fca795-ca44-4119-b5ff-85835f8aa83b"}, {"title": "Coveted (Gwen Sparks #3)", "author": "Stephanie Nelson", "pgs": 49, "sum": "Storyline: \nCoveted (Gwen Sparks #3) Having prevented the war between the witches and vampires, Gwen Sparks was ready to move on and heal. She thought she could go home and her life would return to normal—she thought wrong. Being a spirit walker offers her protection, but it also put her life in danger as others covet what she possesses. A bounty is placed on Gwen and rogues, who will stop at nothing to get the job done, relentlessly track her. With no choice but to head to New Orleans to retrieve a special dagger, Gwen comes face to face with the angel of Death and the feelings she has been denying. Living in a world where everyone has a motive, can Gwen find the inner strength she needs to save her own life?", "hash": "356a08e5-13b2-44a8-a3ac-1d37a40225ec"}, {"title": "Taming the Wolf (Anna Avery #1)", "author": "Stephanie Nelson", "pgs": 41, "sum": "Storyline: \nTaming the Wolf (Anna Avery #1) Attacked by a wolf while hiking in the mountains, Anna Avery's life just got a little hairier. Living in the Big Horn mountains in Wyoming, with a group of werewolves who are more animal than human, Anna must try to hold onto her human side. It's not easy when the alpha continues to persuade her into his bed, while another wolf is chomping at the bit to become her mate. To top it all off, dead bodies are showing up and it just so happens that Anna was the last to see them alive. She'll have to work to prove her innocence and taming the wolf who bites first and asks questions never.", "hash": "98f4aa07-3932-4c0d-9e6e-82e2e51207ec"}, {"title": "Embracing the Wolf (Anna Avery #2)", "author": "Stephanie Nelson", "pgs": 43, "sum": "Storyline: \nEmbracing the Wolf (Anna Avery #2) For the first time, Anna Avery was looking forward to the future. She’s mated to her soul mate. The pack has become her new family, and she has friends she can confide in. She had every reason to look ahead, until a vision put her future happiness in jeopardy. Someone is set on destroying her mate, Adam, and only Anna can prevent this possible future. While trying to unravel the hazy web of her premonition, she finds out the annual pack conference will take place on her mountain. And Adam’s parents will be attending. As only a “made” wolf, Anna will have to face their prejudice and possibly make the hardest decision she has ever had to make. Because saving Adam’s life might just mean walking away from him for forever.", "hash": "a9ff9ec6-6a50-4b6d-8b87-de266853dbb2"}, {"title": "Nocturne (Guild Hunter #3.5)", "author": "Sharon Shinn", "pgs": 20, "sum": "Storyline: \nNocturne - Angels of Darkness (Guild Hunter #3.5) Nocturne by Sharon Shinn — Accepting a position in a secluded and whispered-about mansion, a woman soon discovers the source of its mystery: the blind, tormented angel who lives there, and whose secrets could now destroy them both.", "hash": "8e61f84b-4195-43e5-909f-1dd973379905"}, {"title": "Pleasures of the Night (Dream Guardians #1)", "author": "Sylvia Day", "pgs": 41, "sum": "Storyline: \nPleasures of the Night (Dream Guardians #1) There are sensuous pleasures that can only be tasted in the night . . . He comes to her in the twilight between sleep and consciousness to fulfill her secret desires. Lyssa Bates has never experienced such ecstasy, brought to her by a man whose deep, soul-penetrating blue eyes hold the promise of tempting intimacies and decadent pleasures. But this stranger, this lover, this immortal seducer is only a dream—a phantom of her nocturnal fantasies—until he appears, inexplicably, at her door in the flesh! Lyssa aches for the reality of him, but there is grave danger in surrender. Because Captain Aidan Cross is on a mission, and the passion that consumes them both, body and soul, could have dire consequences in a world of dreams . . . and in the waking one as well.", "hash": "161c1a0d-b70b-4cab-8c8d-d711c5c97a2b"}, {"title": "Heat of the Night (Dream Guardians #2)", "author": "Sylvia Day", "pgs": 36, "sum": "Storyline: \nHeat of the Night (Dream Guardians #2) Stacey Daniels has always been attracted to the wrong type of man . . . And she knows in her heart the virile, wounded Viking at her front doorstep will certainly be no exception. A vision from her most secret erotic fantasies—a glorious god of a man—he excites her with his tantalizing aura of dangerous sensuality. Stacey knows in the deepest depths of her soul that submission will bring unforeseen peril into her life, and yet she is helpless to resist him—for he is a master of decadent pleasures and sweet sensuality . . . and all she has ever wished for. But loving Conor carries a burden that no mortal woman can bear. Though he finds solace in Stacey's passion and the warmth of her welcoming body, his true realm is one of darkest dreams, torn by violence and strife, that is now following him into Stacey's world . . . .", "hash": "c9077816-947f-4917-ac26-10da28d6099f"}]