[{"title": "Midnight Pleasures (Wild Wulfs of London #0)", "author": "Amanda Ashley", "pgs": 45, "sum": "Storyline: \nMidnight Pleasures (Wild Wulfs of London 0.5) by Amanda Ashley , Maggie Shayne , Sherrilyn Kenyon, Ronda Thompson Handsome and sensual, surrounded by an aura of danger, mystery, and the forbidden, a lover steps from the shadows. But is he mortal? Or is he an ancient god, a sorcerer, or a mythical beast who can possess a woman's heart...and her very soul? Four of romance's most popular authors have created this spellbinding collection of stores filled with dark passion and desire. Under the cover of darkness, their heroes inhabit worlds haunted by ageless hungers and deadly forces stronger than any seen by day...and vanquished only by the power of love. Now travel into realms where dazzling wonders roam the night, where magic replaces reason, and where a kiss unleashes a raging fire in the blood. And here, if you dare, discover the seduction that begins at the bewitching hour when a man and woman partake in...Midnight Pleasures. Darkfest by Amanda Ashley The price of saving her dying mother is Channa's promise to spend a year at the castle of tormented nobleman, Lord Darkfest...to obey him as his servant or, as his secrets are revealed, to become his salvation. And her own. Phantom Lover by Sherrilyn Kenyon Haunted by recurring nightmares of terrifying beasts, Erin McDaniels is afraid to sleep-until a hero arrives in her dreams to save her...and makes erotic, incredible love to her. But can she find him again when she is awake? Under Her Spell by Maggie Shayne A consultant for a TV series about one gorgeous witch, \"white witch\" Melissa St. Cloud plans to make the show authentic. But once on the set she is pulled into the arms of a man who opens up a doorway to the darkside and chilling peril. A Wulf's Curse by Ronda Thompson Running away from an arranged marriage, Elise steals aboard a wagon in a traveling circus and finds herself in the bed of the Beast Master, Sterling Wulf, who is something other than he seems...and suddenly all Elise desires.", "hash": "277e1fba-0a09-40b8-9221-edb7b18748fe"}, {"title": "Bound by Night (Bound #1)", "author": "Amanda Ashley", "pgs": 49, "sum": "Storyline: \nBound by Night (Bound #1) A Vampire's Kiss Is Forever... Once featured in a horror movie, the crumbling wolfram estate is said to be haunted by ghosts witches, and worse. But Elena doesn't believe a word of it - until she spends the night and wakes up in the arms of compelling stranger... Tall, dark and disturbingly handsome, Drake is the most beautiful man Elena has ever seen. For centuries he has lived alone, and Elena is the first woman to enter his lair - and survive. And Drake is the first man to touch her heart and soul. By the time she discovers who he really is - and what he craves - it's too late. Blood lust has turned to love, and Elena is deeply under Drake's spell. But forever comes at a price for each of them...", "hash": "e325f371-5b2e-4717-b3f1-01b81c2a37c6"}, {"title": "Bound By Blood (Bound #2)", "author": "Amanda Ashley", "pgs": 50, "sum": "Storyline: \nBound By Blood (Bound #2) A Vampire's Love Is Eternal. Zack Ravenscroft loves women-all women-and they love him. The irresistibly seductive owner of the hottest casino in Vegas, Zack has tasted every wicked pleasure Sin City can offer. But never in his six hundred years as a vampire has he seen a morsel as delectable as Kaitlyn Sherrad, the mysterious young newcomer in town. Zack knows nothing about her-except that he craves her. Kaitlyn is half vampire, half human-and all woman. As the cherished daughter of the Carpathian Coven's master, she has been given every luxury a girl could desire. Now her only need is for a prince. But though she's ready to gamble her heart on Zack, a powerful enemy stalks their every move...watches their every kiss...and waits to destroy their undying love...", "hash": "4540a5e8-ec8c-42e3-bbf1-6b38da1ca107"}, {"title": "Born of the Night (Nightcreature #0)", "author": "Amanda Ashley", "pgs": 12, "sum": "Storyline: \nBorn of the Night - Stroke of Midnight (Nightcreature #1.5) Born of the Night by Amanda Ashley When Lady Shanara Montiori is taken hostage, she learns that the rumors about her captor are true. Lord Reyes is afflicted with the dark curse of the werewolf. Still, Shanara can't fight the attraction they both feel. Will their love break the curse-or feed its powerful hold?", "hash": "4df4f1eb-0611-4877-b2d3-83af19986ade"}, {"title": "Dead Perfect ", "author": "Amanda Ashley", "pgs": 52, "sum": "Storyline: \nBe Careful What You Wish For... Only a woman with nothing left to lose knocks on a vampire's door and asks for help. Shannah Davis is convinced that the mysterious dark-haired man she's followed for months can save her life if he doesn't kill her first. But though Ronan insists he can't give her what she needs, his kiss unleashes a primal hunger that makes her feel truly alive for the first time. After centuries of existence, Ronan has done the unthinkable. He has fallen in love with a mortal and one with only weeks to live. Sensing the fear and reluctance beneath Shannah's request, he offers her a different bargain that will keep her near him during the time she has left. Every hour spent together leaves him craving her touch, her scent, her life's essence. Soon, only Shannah can satisfy his thirst. But if he saves her from death, will she love him for it or spend eternity regretting what she has become?", "hash": "7873f664-d209-40fa-9752-93c60d2350d6"}, {"title": "Desire the Night ", "author": "Amanda Ashley", "pgs": 53, "sum": "Storyline: \nHeld captive in a basement prison, wrapped in silver chains, the vampire Gideon is too weak to fight the monster who enslaves him. For years, she's tapped his precious blood like a fountain of youth - sustaining him with human females she captures for his pleasure. But with the latest victim she brings him, he senses something intriguingly different. Something dangerous, yet oh so tempting.", "hash": "761012ee-8532-4ce1-aad4-cb7d0f258e6f"}, {"title": "Immortal Sins ", "author": "Amanda Ashley", "pgs": 47, "sum": "Storyline: \nThere was nothing the least bit remarkable about the old Underwood Art Gallery located on the corner of Third Street and Pine. And nothing particularly remarkable about the paintings displayed inside....", "hash": "126feabd-bf39-424e-8bce-5d410eac1c98"}, {"title": "Midnight Embrace ", "author": "Amanda Ashley", "pgs": 33, "sum": "Storyline: \nThere are may kinds of embraces -- tender ones, passionate ones, even deadly ones. Amanda Ashley writes of all three in her paranormal romances, in which vampires, cursed creatures of darkness, seek the warmth of human love. Analisa is young, lovely, innocent...and very alive. The day before she lay at death's door. Now, after an evening visit from a mysterious stranger, she is fully recovered -- and in possession of an invitation from the reclusive Lord Alesandro de Avallone to take up residence at Blackbriar Hall. Alone and penniless, with nowhere else to go, she accepts, little knowing that while her mysterious benefactor saved her life, the cost may yet prove to be terribly high. Midnight Embrace is the story of an ancient vampire, lost in loneliness, and the woman whose freely given love could be a light in the cold shadows of his existence.", "hash": "a78afe06-6e16-4464-930a-e36a441d721e"}, {"title": "A Whisper of Eternity ", "author": "Amanda Ashley", "pgs": 34, "sum": "Storyline: \nHe Will Not Lose Her Again When artist Tracy Warner purchases the rambling seaside house built above Dominic St. John's hidden lair, he recognizes in her spirit the woman he has loved countless times over the centuries. Drawing her into the fascinating, seductive world of the vampire, he aches to believe that this time she will not refuse his Dark Gift. But when Dominic's ancient rival appears in Sea Cliff, hungry for territory and power, Tracy becomes a pawn in a deadly game. To save her—and the passion that burns between them—Dominic must offer...A Whisper of Eternity.", "hash": "67bc24ee-9335-4bb6-8d38-5a3415b821c5"}, {"title": "Beneath a Midnight Moon ", "author": "Amanda Ashley", "pgs": 52, "sum": "Storyline: \nDescended from ancient shapeshifters, Hardane could take on wolf form to stalk the darkness. But as a man he had long, sinfully black hair and a body to entice any woman. He appeared to Kylene in her dreams, then rescued her from certain death at the executioner’s hand. He was promised to another, his marriage destined to end the brutal warfare between their two peoples. But no matter what the danger, no matter who tried to stop them, he would spirit her into the night and tempt her with a love like no other…", "hash": "cec59ece-2523-42d4-b417-98b16c0e8362"}]