[{"title": "As Twilight Falls ", "author": "Amanda Ashley", "pgs": 42, "sum": "Storyline: \nPhotographing ghost towns across the American West, Kadie Andrews takes a wrong turn and ends up in Morgan Creek—a spot that isn’t on the map. It’s a quaint little place, but there’s something off about its complacent residents. And when twilight falls, it takes on a truly sinister air… Unable to run or to find any way out, Kadie finds herself a prisoner, hunted for her blood. Still more disturbing, her spirit and beauty have captured the attention of the town’s leader—the mysterious Rylan Saintcrow. When he looks into her eyes, she can see his hunger. When he takes her in his arms, she can feel his power. When he presses his lips against hers, she can taste his need. Saintcrow may be the most powerful creature she’s ever imagined, but Kadie knows in her heart that he is also a man. A man who needs a woman. To want him, desire him, crave him. To be his willing prisoner—for all eternity…", "hash": "394f024f-5498-405c-8355-30c2bc3e437e"}, {"title": "After Twilight (Dark #0)", "author": "Amanda Ashley", "pgs": 32, "sum": "Storyline: \nAfter Twilight (Dark, #7a) by Amanda Ashley , Christine Feehan , Ronda Thompson Three of romance's hottest bestselling authors -- Amanda Ashley, Christine Feehan, and Ronda Thompson -- invite you to explore the dark side, to taste the forbidden, to dive into danger with heroes who fire the blood and lay claim to the soul in these striking tales of sensual passion. A man hunts for a woman. Yet what if he is no ordinary male, but a predator in search of prey? A dark soul looking for the light? A vampire, a werewolf, a mythic being who strikes fear into the hearts of mortals? When day fades into night, when fear becomes fascination, when the swirling seduction of everlasting love overcomes the senses, it must be after twilight.", "hash": "0a19fbee-5a28-4674-8637-33d087866205"}, {"title": "Winter Born (Dark-Hunter #6.5)", "author": "Sherrilyn Kenyon", "pgs": 11, "sum": "Storyline: \nWinter Born (The Dark-Hunterverse #6.5) Two enemy Were-Panthers discover that fate has destined they become lovers. Pandora must learn to trust Dante's foreign nature. But as she slowly succumbs to the truest passion she has ever known, dark forces have already set out to reclaim her...", "hash": "2d638f80-3bd1-4112-985d-02ed61a1106d"}, {"title": "Dragonswan ", "author": "Sherrilyn Kenyon", "pgs": 12, "sum": "Storyline: \nDragonswan (Were-Hunter 0.5) Then one evening the mysterious Sebastian appears. He claims to hold the key to solving the tapestry’s mysteries… He also claims to be a dragon slayer trapped between two worlds. For Channon there’s only one way to finally uncover the secrets of the intricate embroidery-- by following this stranger into a fantastic alternate world of magic, danger, and adventure.", "hash": "0f77df3c-5eb8-4f87-9df7-ebb412f43e1f"}, {"title": "Fear the Darkness (Dark-Hunter #10.5)", "author": "Sherrilyn Kenyon", "pgs": 8, "sum": "Storyline: \nFear the Darkness (Dark-Hunter #10.5) This is a special thank you to readers for all the great years. It’s a small story about Nick’s homecoming to New Orleans after his mother’s death and after Katrina. I knew from the beginning what was going to happen to Nick. I wanted the reader to see the birth of a Dark-Hunter, only to have it with a twist. And even though I knew what was going to happen, I still cried when I wrote the scene.", "hash": "4a9f620c-6e36-4e99-956e-89ff3349a97c"}, {"title": "A Dark-Hunter Christmas (Dark-Hunter #2.6)", "author": "Sherrilyn Kenyon", "pgs": 4, "sum": "Storyline: \nA Dark-Hunter Christmas (Dark-Hunter #2.6) This is the special Christmas story that features the gangster Gallagher and Simi when Gallagher is temporarily relocated to New Orleans to help battle Daimons. Written as a gift for DH fans, it originally appeared in the back of the first edition of Dance with the Devil. It's also found in its entirety in Dark Bites, and you can read the whole thing as an excerpt on the above link by clicking \"Read the Whole Story Here\".", "hash": "326012f5-070d-44a3-acc4-3632ed8489c7"}, {"title": "Second Chances (Dark-Hunter #7.5)", "author": "Sherrilyn Kenyon", "pgs": 1, "sum": "Storyline: \nSecond Chances (Dark-Hunter, #7.5) Originally included in the Dark-Hunter Collectible Booklet and Dark Hunter Companion. This is the short story that was given away with Unleash the Night about Acheron and his brother Styxx. It can be found in Acheron and Dark Bites. You can also find it for free in its entirety at the link below and clicking \"Read Book Excerpt\".", "hash": "2399c119-43cb-49b9-ac4b-dd6482ddc464"}, {"title": "Until Death Do We Part (Wild Wulfs of London #0)", "author": "Sherrilyn Kenyon", "pgs": 10, "sum": "Storyline: \nUntil Death Do We Part - Love at First Bite (Wild Wulfs of London #2.5) Until Death Do We Part by Sherrilyn Kenyon Over five hundred years ago, Esperetta’s soul was bound to her husband’s by dark magic, and when Velkan became a Dark-Hunter, to her horror, she became immortal as well. Now, they must come together to fight an old enemy…and the passion that threatens to consume them once more.", "hash": "9152c3b1-a483-4243-bc98-4e0d4f8e7a1a"}, {"title": "Ill Wind (Weather Warden #1)", "author": "Rachel Caine", "pgs": 29, "sum": "Storyline: \nIll Wind (Weather Warden #1) Joanne Baldwin is a Weather Warden - waves her hand to tame the most violent weather. Now she races against accusations of corruption and murder. Her only hope is Lewis, the most powerful warden known. Because he stole three bottles of Djinn, he is now the most wanted criminal on earth. Can she find him before the bad weather closes in?", "hash": "22903546-a64f-46bd-8498-82c6b620087f"}, {"title": "Tempest Rising (Jane True #1)", "author": "Nicole Peeler", "pgs": 56, "sum": "Storyline: \nTempest Rising (Jane True #1) Living in small town Rockabill, Maine, Jane True always knew she didn't quite fit in with so-called normal society. During her nightly, clandestine swim in the freezing winter ocean, a grisly find leads Jane to startling revelations about her heritage: she is only half-human. Now, Jane must enter a world filled with supernatural creatures alternatively terrifying, beautiful, and deadly- all of which perfectly describe her new \"friend,\" Ryu, a gorgeous and powerful vampire. It is a world where nothing can be taken for granted: a dog can heal with a lick; spirits bag your groceries; and whatever you do, never-ever rub the genie's lamp.", "hash": "0a2fcafb-5af5-443b-a924-a63e84373812"}]