[{"title": "Goddess of the Sea (Goddess Summoning #1)", "author": "P. C. Cast", "pgs": 30, "sum": "Storyline: \nGoddess of the Sea (Goddess Summoning #1) On the night of her twenty-fifth birthday, alone in her apartment, Air Force Sergeant Christine Canady wished for one thing: a little magic in her life. After drinking way too much champagne, she performed, of all crazy things, a goddess-summoning ritual, hoping that it would somehow make her life a little less ordinary...but she never believed the spell would actually work. When her military plane crashes into the ocean, CC's mission overseas takes an unexpected turn. She awakens to find herself in a legendary time and place where magic rules the land—occupying the body of the mythic mermaid Undine. But there is danger in the waters and the goddess Gaea turns this modern, military gal into a beautiful damsel so that she can seek shelter on land. CC is soon rescued (literally) by a knight in shining armor. She should he falling in love with this dream-come-true, but instead she aches for the sea and Dylan, the sexy merman who has stolen her heart.", "hash": "2d2e0a4b-0c49-4539-a551-785893e9afda"}, {"title": "Goddess of Spring (Goddess Summoning #2)", "author": "P. C. Cast", "pgs": 31, "sum": "Storyline: \nGoddess of Spring (Goddess Summoning #2) Lina's trendy bakery in Tulsa is proving to be less than lucrative, and she must come up with a plan. When she stumbles upon an Italian Goddess cookbook, Lina can't help but think she's found the answer to her problem—even if it means invoking a goddess to save her business. Soon enough, Lina finds herself face-to-face with Demeter, who has a plan of her own. She proposes that Lina exchange souls with Persephone, the Goddess of Spring, who will breathe new life into the bakery. In return, Lina must set order to the Underworld. Before all this, Lina's problems mostly involved sourdough and second dates. Now that she embodies the enchanting Persephone, Lina has weightier things on her mind—like the formidable task of bringing Spring to a world of spirits. But when the handsome, brooding Hades kindles a spark in her heart, Lina wonders if this Lord of the Underworld might be the man of her dreams.", "hash": "480c0075-4804-4a46-9f66-8fa96d086ece"}, {"title": "Goddess of Light (Goddess Summoning #3)", "author": "P. C. Cast", "pgs": 36, "sum": "Storyline: \nGoddess of Light (Goddess Summoning #3) When hardworking Pamela Smythe whispers her wish for a god-like man, she never expects to find one--especially not in Vegas. But the goddess Artemis has dared her twin handsome brother Apollo to change all that.", "hash": "f454ec22-ad91-41ae-81cc-dd3256c1d0ba"}, {"title": "Goddess of the Rose (Goddess Summoning #4)", "author": "P. C. Cast", "pgs": 37, "sum": "Storyline: \nGoddess of the Rose (Goddess Summoning #4) When modern-day Mikki ends up in the strange Realm of the Rose, Hecate has been waiting for her. So too has her gorgeous guardian beast, who soon has Mikki swooning. But to save the realm, Mikki will have to sacrifice her life-giving blood.", "hash": "7edbff40-51c0-4ed5-b08b-b1c35937c124"}, {"title": "Goddess of Love (Goddess Summoning #5)", "author": "P. C. Cast", "pgs": 31, "sum": "Storyline: \nGoddess of Love (Goddess Summoning #5) With \"humor and verve,\" (Publishers Weekly) Cast tells the story of the mythical Venus who comes to life to help a nerdy woman find her inner goddess. Pea Chamberlain needs a makeover-shoes, hair, clothes, make-up-if she wants to attract an ?bersexy fireman. And who could better coax Pea out of her pod than the Goddess of Love, whom she invokes in a moment of desperation? Venus works her magic on Pea, but who will help her when she falls for that same sexy fireman? Could Venus need a love makeover for herself? Check out the five-alarm heat when the Goddess of Love unexpectedly loses her heart.", "hash": "bb840804-0537-42da-9caf-194052449f19"}, {"title": "Goddess of Legend (Goddess Summoning #7)", "author": "P. C. Cast", "pgs": 29, "sum": "Storyline: \nGoddess of Legend (Goddess Summoning #7) Saved from a car accident by the Water Goddess, photojournalist Isabel visits the time of King Arthur to seduce Lancelot du Lac away from Queen Guinevere.", "hash": "e404f851-ead8-4ff2-b05e-1fc4143a1f07"}, {"title": "Warrior Rising (Goddess Summoning #6)", "author": "P. C. Cast", "pgs": 37, "sum": "Storyline: \nWarrior Rising (Goddess Summoning #6) The Goddesses have had it with the Trojan War. So much devastation?all because of some silly male egos. The worst of the bunch is that cocky, handsome brute Achilles. But the only way to stop a man like Achilles is to distract him with something far more pleasurable than combat? Enter Kat, a modern girl from Tulsa, Oklahoma. The Goddesses transform her into a Trojan princess, having no doubt that she?ll capture Achilles?s attention. But can her independent spirit match the unquenchable fire of his epic rage? Goddess only knows?", "hash": "4619ed56-20cc-4d0d-8a89-dfa647d8eb78"}, {"title": "Elphame's Choice (Partholon #4)", "author": "P. C. Cast", "pgs": 39, "sum": "Storyline: \nElphame's Choice (Partholon #4) I was marked from birth as belonging to the Goddess Epona--but that didn't make my life easy. Because of my \"blessings,\" I was set apart, worshipped, unable to make real connections with others. Then came the Feeling, and with it a glimpse of my destiny. It led me to the MacCallen castle of legend, deserted since the terrible Fomorian war. I followed the wordless call to breathe new life into a place long dead, but I didn't realize there were dark remnants of the war lingering in the nearby forest--victims and survivors who remained hidden. Others marked as different, powerful. Feared. My choice was now twofold. I could keep to the happiness and safety of my newfound home, or I could choose a path that led to something more terrible, more dangerous, more thrilling than anything I'd ever expected. And in that future I might never be alone again. . .", "hash": "82061fff-3106-4484-bca9-db2dd4ddb794"}, {"title": "Real Vampires Have Curves (Glory St. Clair #1)", "author": "Gerry Bartlett", "pgs": 56, "sum": "Storyline: \nReal Vampires Have Curves (Glory St. Clair #1) What - did you think all vamps were pale, thin and brooding? Don't I wish. Gloriana St. Clair is an eternally \"full-figured\" vampire-she just happened to be bloating when a sexy Scotsman sank his teeth into her. She and said Scot- Angus Jeremiah Campbell III, aka Jeremy Blade-have been on and off again for centuries, currently off. A couple hundred years has taught them how to press each other's buttons-in good ways and bad. Glory's headed for Austin and a new business venture: Vintage Vamp's Emporium. After all, she loves clothes, and she is an antique. Only problem is, there's a billionaire techno-freak vampire hunter on the loose. Blade's in total he- vampire mode, and wants Glory to move in with him so he can \"protect\" her. But it's time for this vamp to explore her own powers.", "hash": "367a5552-b10b-4557-8c4f-05a4e714bf5e"}, {"title": "Real Vampires Live Large (Glory St. Clair #2)", "author": "Gerry Bartlett", "pgs": 55, "sum": "Storyline: \nReal Vampires Live Large (Glory St. Clair #2) It's not easy to keep a boyfriend, run a business, and survive for centuries as one of the immortal undead. Glory St. Clair knows-ever since a sexy Scottish vampire bit her while she was a tad...bloated. But when a frustrated vampire hunter firebombs her vintage clothing boutique, she's ready to pitch a fit. Then her long-time, part-time lover takes off in a rage to hunt the hunter and prove himself worthy of her. And that's only the beginning of her troubles. The Energy Vampires want her-and not in a good way. They're paranormal drug dealers, selling thrills to those who've lived for ages, been everywhere, and done everything...and they want to suck Glory dry. But it'll take more than a few super-suckers to get the goods out of her.", "hash": "4e8d2fea-921e-4378-9f27-0609b67c6f49"}]