[{"title": "Real Vampires Get Lucky (Glory St. Clair #3)", "author": "Gerry Bartlett", "pgs": 60, "sum": "Storyline: \nReal Vampires Get Lucky (Glory St. Clair #3) When a female loan shark named Lucky is attacked and left for dead, vampire Glory St. Clair turns her into one of the undead to save her\u0097\u0097but eternity would have been safer without her. Vamps prefer a low profile, and that's not Lucky's style. She prefers to flaunt her sexy rock-star ex-boyfriend and great shoes. Trouble is, her flamboyant behavior is not only drawing every vampire hunter within miles\u0097 it's bringing her would-be killer out of hiding, too.", "hash": "620714a9-f7f6-40c4-8047-7e8c099693e8"}, {"title": "Real Vampires Don't Diet (Glory St. Clair #4)", "author": "Gerry Bartlett", "pgs": 61, "sum": "Storyline: \nReal Vampires Don't Diet (Glory St. Clair #4) Gloriana St. Claire-curvy, stylish, and undead-is spending New Year's Eve alone. And it's all because her boyfriend, Jeremy Blade, is traipsing off to parts unknown to rescue his supposed daughter from the clutches of \"dangerous radicals.\" But just as Glory settles in for the evening, a phone call from the bodyguard of a drunk, newly-undead rock star could end her year on a crazy note.", "hash": "a34a170b-6730-4604-a89d-e694f28ece64"}, {"title": "Real Vampires Hate Their Thighs (Glory St. Clair #5)", "author": "Gerry Bartlett", "pgs": 63, "sum": "Storyline: \nReal Vampires Hate Their Thighs (Glory St. Clair #5) Glory St. Clair loves soaking up Hollywood's vampire nightlife with her sexy Scottish lover, Jeremiah. Especially when she meets a vampire/ diet guru who promises to give her the body she's wanted for centuries. One problem: his clan and Jeremiah's are ancient enemies. But Glory's not about to let a stupid family feud come between her and slender bliss. Yet, she can't help but wonder...how much is she willing to risk for her hips? And how much (and precisely what) is she willing to lose?", "hash": "1af6f1ad-6413-4112-88cc-f262ea374384"}, {"title": "Real Vampires Have More to Love (Glory St. Clair #6)", "author": "Gerry Bartlett", "pgs": 65, "sum": "Storyline: \nReal Vampires Have More to Love (Glory St. Clair #6) Glory St. Clair is a vampire with man trouble. Between her on-again, off-again lover Jeremy Blade, smoking hot rock star Ray Caine, and former bodyguard turned apartment mate Valdez, there's enough man-candy around to make even a gal with a liquid diet feel a sugar rush. Glory's got no time to enjoy it, though, considering that she's in the middle of planning her best friend's wedding. And let's not forget that there happens to be a hit on her head, thanks to when she took out a techno-freak billionaire. Now, between planning a bachelorette party and dodging stakes, Glory has to decide which man she really wants, before her love life meets an early grave...", "hash": "e6309cef-f664-4361-a52e-63aa49da8683"}, {"title": "Real Vampires Don't Wear Size Six (Glory St. Clair #7)", "author": "Gerry Bartlett", "pgs": 18, "sum": "Storyline: \nReal Vampires Don't Wear Size Six (Glory St. Clair #7) After Glory St. Clair kicked out the demon that had set up shop in her body, she had a serious fallout with longtime lover Jeremy Blade. But before Glory can win him back, she has some issues of the hellish variety to deal with. When Lucifer himself offers Glory the ultimate temptation-work for the devil and he'll make her a size six-the curvy vampire's not sure if she can resist. But what Glory does know is that somehow, she's going to get back the man she loves and show everyone that real vampires always have more to love.", "hash": "61cbedf4-dcb4-4ec8-a5a1-a08b8217adac"}, {"title": "Real Vampires Hate Skinny Jeans (Glory St. Clair #8)", "author": "Gerry Bartlett", "pgs": 58, "sum": "Storyline: \nReal Vampires Hate Skinny Jeans (Glory St. Clair #8) Someone is eating for two... Full-figured vampire Glory St. Clair thinks things are finally going her way. She's no longer possessed by a demon, the legions of hell aren't on her tail, and her love life is heating up since she managed to reconnect with her maker-and longtime lover-Jeremy Blade. When a pregnant demon shows up on her doorstep, Glory knows that everything is about to go to hell. Alesa is claiming that the baby she's carrying is Rafe's, conceived while she was inhabiting Glory's body. A clever trap? Or could it be true? Booties and bibs are the last thing on Glory's mind when she discovers dark secrets from her own forgotten past. Who is she? What is she? And how will the men in her life deal with the fact that she may be more powerful than she knew? One thing is certain. Glory has way more to worry about than fitting into her favorite pair of jeans...", "hash": "9d934eb5-f496-47d0-b77d-0189f389619e"}, {"title": "Real Vampires Know Hips Happen (Glory St. Clair #9)", "author": "Gerry Bartlett", "pgs": 18, "sum": "Storyline: \nReal Vampires Know Hips Happen (Glory St. Clair #9) Does plaid make your butt look big? Glory St. Clair knows that it does. But she'll even throw on a Campbell kilt if it will help her win her hunky Scottish lover back. She's risked everything to cross the Atlantic to confront him in Scotland. Now powerful forces are determined to keep them apart. An attack on Jeremiah Campbell leaves him with amnesia and he doesn't remember her or their centuries together. Glory must win her man back and prove to her nemesis that she's where she's always wanted to be, even if it means dragging Jerry back to Texas. Jeremiah doesn't remember the woman who claims they've been together so long but he's more than willing to take what she freely offers--her ancient blood and her voluptuous body. But when she tries to get him to travel to the New World in a flying machine and to work with his ancient enemy, he thinks she's cracked. In his mind, he's stuck in 1590. This modern world is almost too much for him. But there's something about this woman with the generous curves... Soon enough he finds himself risking death for her more than once. Who or what seems determined to keep them apart? The ancient warrior in him won't stand for it. And the fight is on.", "hash": "08bc0bbb-dda2-457c-ae27-6ac572e14b21"}, {"title": "Real Vampires Know Size Matters (Glory St. Clair #10)", "author": "Gerry Bartlett", "pgs": 56, "sum": "Storyline: \nReal Vampires Know Size Matters (Glory St. Clair #10) Just when curvaceous vampire Glory St. Clair has her life semi-on track, a woman from her longtime lover Jeremiah Campbell's past steamrolls into town on a mission to win him back. Normally Glory wouldn't feel threatened by a mortal with amorous intentions, but Jerry's ex just happens to be a beautiful voodoo priestess with evil spirits at her beck and call-and a serious lack of conscience when it comes to getting what she wants. With her mother in the picture now, desperate to get Glory up to Olympus, Glory has her hands full. This time not even her new powers may be enough to help Glory cook up a solution that will help her keep the man she loves.", "hash": "f53cde5a-f40f-4d66-b8a2-fe3912b62794"}, {"title": "Cinder X (Death Collectors #2)", "author": "Jessica Sorensen", "pgs": 34, "sum": "Storyline: \nCinder X (Death Collectors #2) Until Asher Morgan came along, nineteen-year old Ember’s life had always been about death. Being around Asher, though, and being able to be near him and touch him, changed her and made her feel alive for the very first time. But now he’s gone and she’s left dealing with her seclusion again, the emptiness of not being able to be touched, and the curse of the Grim Angel. As a battle breaks out between Angels and Reapers, she desperately searches for answers about who she is, where she came from, and what she needs to stop the battle. But things get complicated when Cameron returns to her life and begins messing with her thoughts and emotions. Ember tries to hold onto her sanity while the line between life and death begins to blur. Lives are threatened and taken. Murder is everywhere. She needs to figure out what’s real, what’s an illusion, and who she really has feelings for before it’s too late.", "hash": "0d28b943-140a-47d4-ba39-c7d4d99207ba"}, {"title": "A Hunger So Wild (Renegade Angels #2)", "author": "Sylvia Day", "pgs": 35, "sum": "Storyline: \nA Hunger So Wild (Renegade Angels #2) Elijah Reynolds is the most dominant of lycans, a rare Alpha whose skill on the hunt is surpassed only by his primal sexuality. When the lycans revolt due to the iron fist of angelic rule, he steps into command, becoming both enemy and coveted ally in the conflict between vampires and angels. Vashti is the second most powerful vampire in the world, a lethal beauty with a path of devastation in her wake. Tasked with proposing an alliance between vampires and the lycans who killed her mate, Vash approaches Elijah, whose need to avenge a friend demands Vash’s death even as his passion demands her surrender. Soon, their enmity erodes beneath an all-consuming desire. Elijah has never encountered a woman whose warrior spirit and fierce sexual appetite rivals his own, while Vash is faced with the one man strong enough to be her equal. But as war looms, each must decide where their loyalty lies—with their own kind or with the enemy lover they can no longer live without.", "hash": "162066c7-b410-4719-9c52-4cd4ba86daf7"}]