[{"title": "Castle Hill (On Dublin Street #3)", "author": "Samantha Young", "pgs": 14, "sum": "Storyline: \nCastle Hill (On Dublin Street #2.5) A Joss and Braden Novella Braden Carmichael never imagined he’d fall as hard and as fast as he did for Jocelyn Butler. He also could not have anticipated how difficult it would be to convince her to give in to love. But now that he has her, he’s never letting go. He’s got it all planned—the passionate proposal, the dream wedding, the sexy Hawaiian honeymoon—even the perfect family they’ll start. After trying to flee from her painful past, Joss is finally allowing herself to embrace the future. But when things start moving faster than she anticipated, she finds herself panicking over something Braden can’t understand. After everything they’ve been through, Joss is sure that their love can survive even her worst fears. But, this time, she may push Braden too far—and risk losing everything all over again…", "hash": "40a77335-7a52-4110-8200-83c05c34dc75"}, {"title": "Before Jamaica Lane (On Dublin Street #3)", "author": "Samantha Young", "pgs": 45, "sum": "Storyline: \nBefore Jamaica Lane (On Dublin Street #3) One simple lesson in seduction between two friends can turn into so much more… Despite her outgoing demeanor, Olivia is painfully insecure around the opposite sex—usually, she can’t get up the nerve to approach guys she’s interested in. But moving to Edinburgh has given her a new start, and, after she develops a crush on a sexy postgrad, she decides it’s time to push past her fears and go after what she wants. Nate Sawyer is a gorgeous player who never commits, but to his close friends, he’s as loyal as they come. So when Olivia turns to him with her relationship woes, he offers to instruct her in the art of flirting and to help her become more sexually confident. The friendly education in seduction soon grows into an intense and hot romance. But then Nate’s past and commitment issues rear their ugly heads, and Olivia is left broken-hearted. When Nate realizes he’s made the biggest mistake of his life, he will have to work harder than he ever has before to entice his best friend into falling back in love with him—or he may lose her forever…", "hash": "5e789aba-5f75-4dad-bd13-218d0a25dbc3"}, {"title": "Some Girls Are ", "author": "Courtney Summers", "pgs": 36, "sum": "Storyline: \nClimbing to the top of the social ladder is hard—falling from it is even harder.  Regina Afton used to be a member of the Fearsome Fivesome, an all-girl clique both feared and revered by the students at Hallowell High... until vicious rumors about her and her best friend's boyfriend start going around.  Now Regina's been \"frozen out\" and her ex-best friends are out for revenge.  If Regina was guilty, it would be one thing, but the rumors are far from the terrifying truth and the bullying is getting more intense by the day.  She takes solace in the company of Michael Hayden, a misfit with a tragic past who she herself used to bully.  Friendship doesn't come easily for these onetime enemies, and as Regina works hard to make amends for her past, she realizes Michael could be more than just a friend... if threats from the Fearsome Foursome don't break them both first.", "hash": "04ddaf85-1598-4db7-bec4-f22930fefb6e"}, {"title": "Cracked Up To Be ", "author": "Courtney Summers", "pgs": 34, "sum": "Storyline: \nWhen \"Perfect\" Parker Fadley starts drinking at school and failing her classes, all of St. Peter's High goes on alert. How has the cheerleading captain, girlfriend of the most popular guy in school, consummate teacher's pet, and future valedictorian fallen so far from grace? Parker doesn't want to talk about it. She'd just like to be left alone, to disappear, to be ignored. But her parents have placed her on suicide watch and her conselors are demanding the truth. Worse, there's a nice guy falling in love with her and he's making her feel things again when she'd really rather not be feeling anything at all. Nobody would have guessed she'd turn out like this. But nobody knows the truth. Something horrible has happened, and it just might be her fault.", "hash": "26dff3f9-476e-44b1-9c08-2fe76ac60920"}, {"title": "Fall With Me ", "author": "Bella Forrest", "pgs": 23, "sum": "Storyline: \nJill Freyss-Charon is just trying to get through the year. After losing her father in a horrific car accident, she is eager to return to her summer job at a horse ranch where she knows everything will be just as it always is each summer. But when a tanned young man washes up on the beach outside her tent one night, half-drowned and begging to be given shelter until morning, any hope of normality immediately vanishes. Jill has dated Griffin Alexander's type before, and soon regrets taking him in when he decides to stay on at the ranch. She finds she is repelled by him, and doesn't believe his crazy story about being kidnapped and held to ransom... until three words escape his lips that send her head into a tailspin. ...Three words that threaten to unravel her painful past and bring her closer to this man she is trying to avoid - which will put her in more danger than either realizes.", "hash": "4be76294-e0cb-4f43-ad4c-6b1c94a95a4e"}, {"title": "First Rapture (The Rapture #1)", "author": "Alexandra Ivy", "pgs": 14, "sum": "Storyline: \nFirst Rapture (The Rapture #1) Madison Philips has only one reason to return to Las Vegas: Luc Angeli. The tall, dark bad boy took her virginity on her eighteenth birthday and then walked away, now she’s back, and ready for revenge. Luc Angeli spent his youth trying to earn the approval of his philandering father. Now he’s his own man, but there’s still something missing from his life. He doesn’t know what it is until he catches sight of Madison across a balcony. Suddenly he knows this woman is what he’s been searching for, and this time he’s not walking away.", "hash": "cded7314-94a8-4d22-9bfc-bb060ee4e80e"}, {"title": "Board Resolution (Knights of the Board Room #1)", "author": "Joey W. Hill", "pgs": 25, "sum": "Storyline: \nBoard Resolution (Knights of the Board Room #1) Savannah was groomed from birth to take the reins of her father’s manufacturing empire. Her emotional armor is as tough as the steel used in her factories, and nobody is allowed past it. Business partner Matt realizes that the key to entry is to command her submission. Calling on the unique sensual talents of his four-man management team, he engineers an aggressive and erotic takeover, determined to rescue the woman he loves from the steel cage she’s manufactured around her heart. Masked and lost to the sensations the team arouses in her, Savannah is theirs, at least for this one night.", "hash": "85516751-06d1-40c3-bbb2-a8709a61a80a"}, {"title": "Controlled Response (Knights of the Board Room #2)", "author": "Joey W. Hill", "pgs": 30, "sum": "Storyline: \nControlled Response (Knights of the Board Room #2) Lucas Adler has recently realized he wants more from a relationship than just fantastic sex. But while on a cycling trip through the Berkshires, he encounters a beautiful blonde in the woods. Dressed in only white silk panties and a matching corset, she's stretched out on the back of a motorcycle and revving her engine--just not the one on the bike. Although he wonders if he can have the fantasy and the reality, Lucas is certain of one thing. He wants her... Cassandra Moira wants to relax. Things are crazy back home, and the deal she just tied down has unraveled. So when an opportunity comes along to hop on a motorcycle and take in some scenery, Cass takes it. Stopping to rest and reflect, she remembers the weak men she's dealt with in her life. So she closes her eyes and imagines a man who can take charge. A man, who with the blink of an eye, is right in front of her... After their encounter, Cass enters Lucas's life again. This time, she's part of a negotiating team on a three-day business deal. She's also not about to let any man control her. Now Lucas must use every strategy he knows to prove his love before she's gone from his life again. Includes a preview of the next novel in the bestselling Vampire Queen series, \"Taken By a Vampire\" \"Controlled Response\" previously appeared in \"Unlaced.\"", "hash": "a3488d4a-1303-45a1-b021-5e84450d98a4"}, {"title": "Honor Bound (Knights of the Board Room #3)", "author": "Joey W. Hill", "pgs": 30, "sum": "Storyline: \nHonor Bound (Knights of the Board Room #3) Peter Winston is a successful business man and a captain in the National Guard. On the night before his second tour in Afghanistan, he and his partners at Kensington & Associates head out to enjoy an upscale BDSM club. While the evening begins with laughter and whiskey, it takes a sharp turn when Peter, a sexual Dominant, sets his eyes on a beautiful masked submissive… Army Sergeant Dana Smith doesn’t often seek the shelter of a man, but being Peter’s gives her a welcome sense of sanctuary. What begins as a night of fantastic pleasure becomes something they hope will never end. But duty calls, and it will be over a year before they can see each other again. And when they do, things have drastically changed. Severely injured in the line of duty, Dana has lost her sight and her will to live. But Peter doesn’t accept defeat in business, battle or love. With the talents of the other K&A males, he’ll set the stage for another special night for them, knowing that only a submissive’s willingness to trust her Master will bring her back to love and life again.", "hash": "3d80df6c-55d8-4992-b7db-4a44df995337"}, {"title": "Afterlife (Knights of the Board Room #4)", "author": "Joey W. Hill", "pgs": 60, "sum": "Storyline: \nAfterlife (Knights of the Board Room #4) Part of the Knights of the Board Room series. Rachel gave up seeking a Master years ago. After a failed marriage and terrible tragedy, she's walled her soul against going down that dangerous path again. Then Jon joins her yoga class. He's thirteen years younger than she, but his Dominant nature threatens her shields from the moment she recognizes it. Not only does he understand what her body wants-he knows what her soul craves. Part of the five-man executive team of Kensington & Associates, Jon uses his calm, philosophical nature to defuse volatile acquisition negotiations. He can compel opponents to willingly surrender when he draws the sword that closes the deal. As a sexual Dominant, he employs that same expertise. A spiritually driven Master who enjoys connecting with a woman's soul, he wins her utter submission with his skills. But with Rachel, it goes beyond that. She's the submissive his own soul has always hungered to have, and he won't hesitate to use his talents, as well as that of the other four K&A men, to claim her. Publisher's Note: Rachel's sensual journey to healing contains light female/female exploration and group sex.", "hash": "4e3ccba9-5cd3-41a9-ac44-388215500a2c"}]