[{"title": "A Caress of Wings (Renegade Angels #1.5)", "author": "Sylvia Day", "pgs": 0, "sum": "Storyline: \nDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: A Caress of Wings (Renegade Angels #1.5) Author of \"Bared to You\" and \"A Hunger So Wild \"Sylvia Day takes us into a shadowy underworld, where a powerful angel breaks all the rules by falling for the mortal whose life she's saved... Chained in the dark, Trevor Descansos endures pain and terror as vampires slowly drain the life from him. He finds mercy in Sentinel Siobhan, a beautiful avenging angel with lethal wings. She draws Trevor from the depths of hell, wrapping him in the softness of the same feathers that she wielded like blades to cut down his tormentors. Ageless and eternal, Siobhan has seen too much to be surprised by anything, but the mortal she finds in the pit of a vampire den shakes her to the core. Broken and near death, his ravaged masculine beauty stirs the heart she hadn't realized she possessed. Though she's tasked with eradicating the vampire disease sweeping across her world, she nurses Trevor back to health, healing him even as he awakens a forbidden longing. But the true test has yet to come. Siobhan faces an even darker fate than Trevor's, as she falls from grace into mortal love... Includes a preview of the next Renegade Angels novel, \"A Hunger So Wild\"", "hash": "0537afe1-3e4e-4fde-909d-3cbe0b39146e"}, {"title": "Incubus Dreams (Anita Blake, Vampire Hunter #12)", "author": "Laurell K. Hamilton", "pgs": 39, "sum": "Storyline: \nIncubus Dreams (Anita Blake, Vampire Hunter #12) Vampire hunter Anita Blake finds her life is more complicated than ever, caught as she is between her obligations to the living-and the undead.", "hash": "259af185-7b46-45b2-b07d-ea5358ec93bb"}, {"title": "Kiss the Dead (Anita Blake, Vampire Hunter #21)", "author": "Laurell K. Hamilton", "pgs": 50, "sum": "Storyline: \nKiss the Dead (Anita Blake, Vampire Hunter #21) When a fifteen-year-old girl is abducted by vampires, it’s up to U.S. Marshal Anita Blake to find her. And when she does, she’s faced with something she’s never seen before: a terrifyingly ordinary group of people—kids, grandparents, soccer moms—all recently turned and willing to die to avoid serving a master. And where there’s one martyr, there will be more… But even vampires have monsters that they’re afraid of. And Anita is one of them…", "hash": "9190cb38-6ab1-476c-98a1-6d088ef0df69"}, {"title": "Dancing (Anita Blake, Vampire Hunter #22.5)", "author": "Laurell K. Hamilton", "pgs": 9, "sum": "Storyline: \nDancing (Anita Blake, Vampire Hunter #22.5) For most people, summer barbecues are nothing to be afraid of. But Anita isn’t exactly plain vanilla—and neither is her love life. So it takes a special kind of courage to attend a barbecue thrown by her friend Sergeant Zerbrowski. Walking into a backyard full of cops and their families with wereleopards Micah and Nathaniel both looking gorgeous on her arm won’t be easy, even with almost-four-year-old Matthew Vespucci to break the ice… Anita is determined to have a good time with her family, just like everyone else. But it doesn’t take long for tensions to rise among the adults and kids. And Anita will learn that gossip and innuendo can be just as dangerous as anything the undead can throw at her… Includes a preview of Affliction, the new Anita Blake, Vampire Hunter novel.", "hash": "8170be38-b23b-45b5-875f-eeb48b9298a4"}, {"title": "Shutdown (Anita Blake, Vampire Hunter #22.6)", "author": "Laurell K. Hamilton", "pgs": 4, "sum": "Storyline: \nShutdown (Anita Blake, Vampire Hunter #22.6) This story is for all my readers who have been impacted by the current political SNAFU – and for anyone else who might need to enjoy a free story in these difficult times. “Shutdown”, will be available free for the duration of the government shutdown. Once the government is back in business then the short story will no longer be available on line, at least not until my publisher and I figure out what we might want to do with it. But for right now, while we’re all wondering how it got to this point, here’s a brand new Anita Blake short story, featuring our favorite bad boy werewolf, yep, I mean Richard Zeeman. Hey, I’ve been telling you, he’s been working his therapy: read on to see the results that hard work and being brave enough to own your whole self can get you.", "hash": "51a5d1b9-5aae-405b-aefb-0d68f1953aa3"}, {"title": "Forbidden Fruit (Corine Solomon #3.5)", "author": "Ann Aguirre", "pgs": 13, "sum": "Storyline: \nForbidden Fruit (Corine Solomon #3.5) I see dead people. Okay, that’s a lie. I hear dead people—on an antique radio… So far, that talent hasn’t brought Shannon Cheney fame or fortune. Since the world remains unaware that magick is real, being Gifted largely sucks. Her boss is an asshole, she makes minimum wage, and she’s got a serious case of forbidden lust for a sexy cop named Jesse Saldana. He’s part Mexican heat, all Texas charm, and enough of a dirty cowboy to curl her toes. Too bad he’s set on resisting her wiles. To make matters worse, there’s this weird amnesia thing happening. She might think she’s going crazy, except Jesse’s got it too, and memory loss isn’t contagious like the flu. When Shannon pokes around, trying to put the missing pieces together, demonic retaliation is swift and potentially deadly. Jesse’s too much of a white knight to let her face danger alone, and she’s hoping he can’t resist the white-hot chemistry blazing between them…", "hash": "786d56cb-9600-4688-9950-7197fb111ad4"}, {"title": "The Bringer ", "author": "Samantha Towle", "pgs": 40, "sum": "Storyline: \nDeath is sad, love is agony. Max was her next job. She got his name just before he died and it was for her to lead his soul to heaven. She was a Bringer. Then Max started pleading (as they often do), but not for himself, for his son, James. Would she look after him, would she comfort him as he grieved for the loss of his father? James was a sensitive young man. He would take his father's death very hard. Well, Bringers don't do that sort of thing; their exclusive role is to usher souls to heaven. They are not allowed to get involved in earthly affairs. However, when she saw James, she felt something she had never felt before - an emotion, a shock. She was a Bringer. Bringers do not have emotions. Yet she couldn't help herself. She found herself being drawn inexorably towards James and his life, against every instinct she had ever had, against every law of the universe. And she fell in love. For a Bringer, that is a terrifying fall.", "hash": "4741bee3-bbf0-4a38-98fe-5c9c07ff7987"}, {"title": "A Kiss of Shadows (Merry Gentry #1)", "author": "Laurell K. Hamilton", "pgs": 37, "sum": "Storyline: \nA Kiss of Shadows (Merry Gentry #1) My name is Meredith Gentry, but of course it's not my real name. I dare not even whisper my true name after dark for fear that one hushed word will travel over the night winds to the soft ear of my aunt, the Queen of Air and Darkness. She wants me dead. I don't even know why... I fled the high court of Faerie three years ago and have been in hiding ever since. As Merry Gentry, I am a private investigator for the Grey Detective Agency: Supernatural Problems, Magical Solutions. My magical skills, scorned at the courts of Faerie, are valued in the human world. Even by human standards, my magic isn't flashy, which is fine by me. Flashy attracts attention and I can't afford that. Rumour has it that I am dead. Not quite. I am Princess Meredith NicEssus. To speak that name after dark is to call down a knock upon your door from a hand that can kill you with a touch. I have been careful, but not careful enough. The shadows have found me, and they are going to take me back home, one way or another. So the running is over. But the fighting has just begun... Rich, sensual, brimming with dangerous magic, A Kiss of Shadows is a dazzling tour-de-force where folklore, fantasy and erotically charged adventure collide.", "hash": "91aa1f44-3057-4393-a074-ffced184803b"}, {"title": "A Caress of Twilight (Merry Gentry #2)", "author": "Laurell K. Hamilton", "pgs": 22, "sum": "Storyline: \nA Caress of Twilight (Merry Gentry #2) \"I am Princess Meredith, heir to a throne--if I can stay alive long enough to claim it.\" \"After eluding relentless assassination attempts by Prince Cel, her cousin and rival for the Faerie crown, Meredith Gentry, Los Angeles private eye, has a whole new set of problems. To become queen, she must bear a child before Cel can father one of his own. But havoc lies on the horizon: people are dying in mysterious, frightening ways, and suddenly the very existence of the place known as Faerie is at grave risk. So now, while she enjoys the greatest pleasures of her life attempting to conceive a baby with the warriors of her royal guard, she must fend off an ancient evil that could destroy the very fabric of reality. And that's just her day job. . . . \"From the Paperback edition.", "hash": "36d05798-4f14-4c2d-b49c-ab733de459de"}, {"title": "Seduced by Moonlight (Merry Gentry #3)", "author": "Laurell K. Hamilton", "pgs": 34, "sum": "Storyline: \nSeduced by Moonlight (Merry Gentry #3) To some I am Meredith Gentry, P.I. To others I am Princess Merry, heir to the throne of Faerie. And there are those who whisper that I am both of these and more. My aunt, the Queen of Air and Darkness, no long distracted by her sadistic pastimes, now focusses unwaveringly on me. I spend each night with my immortal guards, but still no child has come of our decadent pleasures. But something IS happening to me. I appear to have awakened a force that's lain dormant for thousands of years and I haven't the damndest idea how or why... It all began with the chalice. I dreamed it, and there it was - cool and hard - when I awoke. My guards know this ancient relic well - its disappearance so many ages ago stripped them of their vital powers. And here it is with us now. My touch resonates with its force. A strange, dazzling magic now courses through my half-mortal half-Sidhe body. But while my guards cherish me for this unexpected gift, there are those who loathe me for it and would rather the Unseelie court suffer than have it ruled over by me, a mongrel queen. My enemies grow in number every day. If only they knew what I am capable of. But come to that, if only I did too. This is the world of Meredith Gentry, a twilight world of gods, shapeshifters and immortal souls, a world full of sensuality, wild magic, treacherous deceits and latent powers about to be unleashed...", "hash": "5dca2fe9-0c19-401f-b7b9-22c666b477df"}]