[{"title": "A Stroke of Midnight (Merry Gentry #4)", "author": "Laurell K. Hamilton", "pgs": 20, "sum": "Storyline: \nA Stroke of Midnight (Merry Gentry #4) I am Meredith Gentry, P.I., solving cases in Los Angeles, far from the peril and deception of my real home-because I am also Princess Meredith, heir to the darkest throne faerie has to offer. The Unseelie Court infuses me with its power. But at what price does such magic come? How much of my human side will I have to give up, and how much of the sinister side of faerie will I have to embrace? To sit on a throne that has ruled through bloodshed and violence for centuries, I might have to become that which I dread the most. Enemies watch my every move. My cousin Cel strives to have me killed even now from his prison cell. But not all the assassination attempts are his. Some Unseelie nobles have waited centuries for my aunt Andais, Queen of Air and Darkness, to become weak enough that she might be toppled from her throne. Enemies unforeseen move against us-enemies who would murder the least among us. The threat will drive us to allow human police into faerie for the first time in our history. I need my allies now more than ever, especially since fate will lead me into the arm of Mistral, Master of Storms, the queen's new captain of her guard. Our passion will reawaken powers long forgotten among the warriors of the sidhe. Pain and pleasure await me-and danger, as well, for some at that court seek only death. I will find new joys with the butterfly-winged demi-fey. My guards and I will show all of faerie that violence and sex are as popular among the sidhe as they are among the lesser fey of our court. The Darkness will weep, and Frost will comfort him. The gentlest of my guards will find new strength and break my heart. Passions undreamed of await us-and my enemies gather, for the future of both courts of faerie begins to unravel. \"From the Hardcover edition.\"", "hash": "fa7c6d57-28df-41cb-ae28-cf1331670656"}, {"title": "Mistral's Kiss (Merry Gentry #5)", "author": "Laurell K. Hamilton", "pgs": 22, "sum": "Storyline: \nMistral's Kiss (Merry Gentry #5) The time has come for Meredith Gentry to put aside her detective work and fulfill her ultimate obligation to the world of Faerie - where her efforts to conceive an heir to the throne of the Unseelie Court are crucial to restoring magic, and life itself, to the Fey kingdom. And though her quest to produce an heir may be full of sensual pleasures, it is also fraught with peril: the shadows of intrigue stalk the royal court, and sabotage lurks at any turn. Merry's cousin schemes and plots, determined to see her fall. But, in the once-dead gardens of the world of faerie, something has re-awakened an all-powerful, malign magic. And Merry's own powers have turned wildly - dangerously - unpredictable. As plots and counterplots are hatched and strategies and subterfuges played out, the destiny of an entire world turns upon the fortunes of Merry Gentry: object of obsession, target of treachery and pawn of uncertain fate.", "hash": "242b445a-b36f-4d8e-945e-a85bd2fe16e1"}, {"title": "A Lick of Frost (Merry Gentry #6)", "author": "Laurell K. Hamilton", "pgs": 29, "sum": "Storyline: \nA Lick of Frost (Merry Gentry #6) I am Meredith Gentry, princess and heir apparent to the throne in the realm of faerie, onetime private investigator in the mortal world. To be crowned queen, I must first continue the royal bloodline and give birth to an heir of my own. If I fail, my aunt, Queen Andais, will be free to do what she most desires: install her twisted son, Cel, as monarch?and kill me. My royal guards surround me, and my best loved - my Darkness and my Killing Frost - are always beside me, sworn to protect and make love to me. But still the threat grows greater. For despite all my carnal efforts I remain childless, while the machinations of my sinister, sadistic Queen and her confederates remain tireless. So my bodyguards and I have slipped back into Los Angeles, hoping to outrun the gathering shadows of court intrigue. But even exile isn't enough to escape the grasp of those with dark designs. Now King Taranis, powerful and vain-glorious ruler of faerie's Seelie Court, has leveled accusations against my noble guards of a heinous crime - and has gone so far as to ask the mortal authorities to prosecute. If he succeeds, my men face extradition to faerie and the hideous penalties that await them there. But I know that Taranis's charges are baseless, and I sense that his true target is me. He tried to kill me when I was a child. Now I fear his intentions are far more terrifying.", "hash": "11f6013a-f627-411e-8d63-310d554ba8b6"}, {"title": "Swallowing Darkness (Merry Gentry #7)", "author": "Laurell K. Hamilton", "pgs": 24, "sum": "Storyline: \nSwallowing Darkness (Merry Gentry #7) I am Meredith, princess of faerie, wielder of the hands of Flesh and Blood, and at long last, I am with child–twins, fathered by my royal guard. Though my uncle, Taranis, King of Light and Illusion, claims that he is the true father since he abducted me from my home, betrayed, and defiled me. And now he has branded my guards as a threat to my unborn children. Bearing an heir has placed me halfway to my aunt’s throne, that much closer to my reign over the Unseelie Court–and well ahead of her son, my cousin Cel, in this race. Now I must stay alive to see my children born and claim my place as queen. But not all in faerie are pleased with the news, and conspirators from every court in the realm plot against me and mine. They seek to strip my guards, my lovers, from me by poisoned word or cold steel. But I still have supporters, and even friends, among the goblins and the sluagh, who will stand by me. I am Meredith Nic Essus, and those who would defy and destroy me are destined to pay a terrible price–for I am truly my father’s daughter. To protect what is mine, I will sacrifice anything–even if it means waging a great battle against my darkest enemies and making the most momentous decision ever made as princess of faerie.", "hash": "3248377e-d61f-4351-96e5-017cf9cf34ae"}, {"title": "Divine Misdemeanors (Merry Gentry #8)", "author": "Laurell K. Hamilton", "pgs": 16, "sum": "Storyline: \nDivine Misdemeanors (Merry Gentry #8) The tension in this saga continues to mount as Merry, pregnant with twins, rejects the throne and instead chooses exile in the human world with her beloved Frost and Darkness. But though she has left faerie for Los Angeles, Merry knows she can never abandon her people and when someone begins killing the fey, Merry will do whatever is takes to uncover the truth behind the deaths. And yet, even stranger things are happening. The mortals that have been healed by Merry's touch are suddenly performing miracles and Merry finds herself amidst dark suspicions of banned magical activities. Filled with riveting twists, Divine Misdemeanors adds yet another unforgettable chapter to a story that is both epic and breathtaking.", "hash": "28537c53-19c0-4919-877e-165f5ca85532"}, {"title": "Never After ", "author": "Laurell K. Hamilton", "pgs": 23, "sum": "Storyline: \nNever After by Laurell K. Hamilton , Yasmine Galenorn , Marjorie M. Liu , Sharon Shinn The bonds of love... The bonds of matrimony... The bonds between husband and wife... Let's face it-some bonds are made to be broken. Here, for the first time ever, are four stories from today's most provocative authors that take the classic idea of the \"faerie tale wedding\" and give it a swift kick in the bustle.", "hash": "4187cfe9-0c29-48eb-b04e-26d10d183ce9"}, {"title": "Nightseer ", "author": "Laurell K. Hamilton", "pgs": 17, "sum": "Storyline: \nKeleios the Half-Elf was but five years old when she saw her mother murdered by the evil witch Harque. For years she has asked the gods for the strength she'll need to avenge this foul death, and it seems the gods have answered her. She's been granted an array of powers never before seen in one person, but she has also acquired a most terrifying burden, a demonmark. This mark can open the door to undreamed abilities, but it can also open her soul to the forbidden dark side of magic. Keleios must choose between the demonmark's tainted power and the lives of those she holds most dear. In an epic battle of good versus evil, of enchanted swords and shapeshifting dragons, of unquenchable hatred and unlikely love, Keleios must face her own demons—before she can acquire the most important power of all: the power to forgive.", "hash": "80d10a64-0ba8-408c-8456-03e3e8dbffd0"}, {"title": "The Rest Falls Away (The Gardella Vampire Chronicles #1)", "author": "Colleen Gleason", "pgs": 51, "sum": "Storyline: \nThe Rest Falls Away (The Gardella Vampire Chronicles #1) Beneath the glitter of dazzling 19th-century London Society lurks a bloodthirsty evil... In every generation, a Gardella is called to accept the family legacy of hunting vampires, and this time, Victoria Gardella Grantworth is chosen, on the eve of her debut, to carry the stake.", "hash": "a93c0037-7dce-4d9e-bfe3-e2a97b6c9193"}, {"title": "Rises The Night (The Gardella Vampire Chronicles #2)", "author": "Colleen Gleason", "pgs": 53, "sum": "Storyline: \nRises The Night (The Gardella Vampire Chronicles #2) In Italy, a powerful vampire is amassing the power to control the souls of the dead. Lady Victoria Gardella de Lacy-a vampire slayer for just over a year-races across Europe to stop what could be the most deadly army the Gardellas have ever faced. She is accompanied by Sebastian Vioget, a man as tempting as he is untrustworthy. But when Victoria discovers that she has been betrayed by one of her most trusted allies, the truth will challenge all her powers as a Venator-and as a woman.", "hash": "f337370a-8fe8-4c84-b197-3b214629406b"}, {"title": "The Bleeding Dusk (The Gardella Vampire Chronicles #3)", "author": "Colleen Gleason", "pgs": 55, "sum": "Storyline: \nThe Bleeding Dusk (The Gardella Vampire Chronicles #3) To gain access to the secrets of a legendary alchemist, Rome's vampires have allied themselves with creatures as evil and bloodthirsty as they are. The new leader of the city's vampire hunters-Lady Victoria Gardella Grantworth de Lacy-reluctantly turns to the enigmatic Sebastian Vioget for help, just as Maximilian Pesaro arrives to aid his fellow slayers, no matter what the sacrifice. Desire puts her at the mercy of Sebastian, while loyalty binds her to Max, but she does not know if she can trust either. Especially when a seductive vampire begins luring her into the shadows...", "hash": "0bc8641d-cfe5-4936-b18e-d309983c5ace"}]