[{"title": "When Twilight Burns (The Gardella Vampire Chronicles #4)", "author": "Colleen Gleason", "pgs": 53, "sum": "Storyline: \nWhen Twilight Burns (The Gardella Vampire Chronicles #4) After narrowly escaping Rome with her mortality, vampire hunter Lady Victoria Gardella Grantworth de Lacey returns to London - where not even sunrise can stop a vampire's carnage. Not only is Victoria unable to detect the vampire with her heightened senses, but she's being framed as the prime suspect behind the killings. Meanwhile, the legacy of a vampire's touch has left his blood boiling in her veins and forces her to fight evil on two fronts: against the new breed of undead threatening London and the darkness within herself….", "hash": "a6af7cbe-501b-469c-bbf7-2b3073640f19"}, {"title": "As Shadows Fade (The Gardella Vampire Chronicles #5)", "author": "Colleen Gleason", "pgs": 52, "sum": "Storyline: \nAs Shadows Fade (The Gardella Vampire Chronicles #5) Directly descended from the very first vampire hunter in the Gardella family, Victoria knows she must continue the lineage so humanity will have protectors against the undead. While Sebastian Vioget appears to be both the perfect warrior and lover to ensure the Gardella Legacy, Victoria cannot forget Max Pesaro - the former slayer still haunted by the vampire queen Lilith's obsession with him. But it is Lilith's obsession that may save all of humanity. Demons, enemies of both mortals and the undead, have found their way to earth. To defeat them, vampires and slayers must fight side by side. But Lilith wants Max in return for her cooperation; a small price for the world, but too high a price for Victoria.", "hash": "35a6aac4-8739-413a-bde3-554184c3d8d1"}, {"title": "The Vampire Voss (Regency Draculia #1)", "author": "Colleen Gleason", "pgs": 61, "sum": "Storyline: \nThe Vampire Voss (Regency Draculia #1) Regency London – a dizzying whirl of balls and young ladies pursued by charming men. But the Woodmore sisters are hunted by a more sinister breed: Lucifer's own. Voss, also known as Viscount Dewhurst, relishes the sensual pleasures immortality affords. A member the Dracule – a cabal of powerful, secretive noblemen marked with a talisman that reveals their bartered souls – the mercenary Voss has remained carefully neutral ... until Angelica. Angelica Woodmore possess the Sight, an ability invaluable to both sides of a looming war among the Dracule. Her very scent envelops Voss in a scarlet fog of hunger – for her body and her blood. But he is utterly unprepared for the new desire that overcomes him – to protect her. Now Voss must battle his very nature to be with Angelica ... but this vampire never backs down from a fight.", "hash": "172d2c6f-1630-488f-abda-04ca3a6adc9c"}, {"title": "The Vampire Dimitri (Regency Draculia #2)", "author": "Colleen Gleason", "pgs": 58, "sum": "Storyline: \nThe Vampire Dimitri (Regency Draculia #2) Dimitri, also known as the Earl of Corvindale, should be delighted that the headstrong Maia Woodmore is getting married. His mortal ward and houseguest has annoyed—and bewitched—the Dracule nobleman too long, and denying his animal cravings grows more excruciating by the day.Miss Woodmore's family has a rather…complicated history with the immortals and she herself possesses a keen sensibility far beyond mere women's intuition. Marriage will give her safety, respectability and everything else a proper young lady could wish for. Everything, that is, except passion. In the looming battle between Dracule factions, all pretenses will shatter as Maia and Dimitri come together in an unholy union of danger, desperation and fiercest desire.", "hash": "558abd0f-a3c8-43a0-b6e5-db92803dd408"}, {"title": "The Vampire Narcise (Regency Draculia #3)", "author": "Colleen Gleason", "pgs": 24, "sum": "Storyline: \nThe Vampire Narcise (Regency Draculia #3) Skilled in the seduction of men, both mortal and immortal, Narcise Moldavi is the greatest weapon in her twisted brother's war among the Dracule. Until she falls for Giordan Cale. Her first searing encounter with Giordan seals their fierce connection. But Giordan's vow to help Narcise escape her brother's rule is followed by a betrayal more agonizing than sunlight. Wounded but determined, Narcise ensnares vampire hunter Chas Woodmore in her quest for revenge and to reclaim her life. He wants her, worships her, will kill for her. And the Dracule never forget a wrong-nor do they forgive.", "hash": "68bf57b3-817b-4296-8b86-2e49a1e2cc12"}, {"title": "Roaring Midnight (Macey Gardella #1)", "author": "Colleen Gleason", "pgs": 19, "sum": "Storyline: \nRoaring Midnight (Macey Gardella #1) Amid the glitzy age of Jazz, when gangsters and bootleggers control the cities, there lies another, more insidious threat ... the undead. Macey Gardella is a typical young woman of the Roaring Twenties: she works a job, has her own flat, and loves to dance the Charleston. But when a mysterious man named Sebastian Vioget informs her she belongs to a family of vampire hunters, Macey is stunned and disbelieving. Yet, strange and frightening things begin to happen, and when Macey comes face-to-face with one of the fanged creatures, she has no choice but to believe Sebastian. And when she learns his own soul depends on her willingness to carry forth the family legacy and hunt the undead, Macey capitulates and joins the fight. As she begins to learn about her new life, Macey meets the handsome newspaper reporter known as Grady--who seems to know more about vampires than he should. When he begins to ask too many questions, she has to juggle her strong attraction to him with the need for secrecy. Slipping into speakeasies and sampling bootlegged whiskeys, dodging gangster gunfire and trying to keep her nosy landlady from finding the stakes in her flat, Macey Gardella must navigate through a world of stunning violence, passionate romance, and dark betrayal...", "hash": "b686508d-6ca4-4e4e-b78e-fa8aeb42bc19"}, {"title": "The Catalyst (Preternaturals #3)", "author": "Zoe Winters", "pgs": 15, "sum": "Storyline: \nThe Catalyst (Preternaturals #3) It started with one lost, shivering pup; it may end in a war... Panthers don’t do responsibility. They don’t do long-term relationships. They definitely don’t raise kids. But when Z discovers a young wolf in the forest, he takes him in, unaware of the powerful beings hunting the pup. Fiona is a witch who can’t leave her house; the birds have told her something bad will happen. The mailbox is as far as she’ll go, but even that may provide more danger than she’s bargained for. When a wolf pup stumbles into her garden, her safe, wrapped-up world heads for a free fall. But along with danger, the pup brings a chance at love—a chance an agoraphobic witch and a bachelor panther shifter aren’t likely to find on their own.", "hash": "ddbed1e6-a7b7-44c5-9d29-d811cee847e7"}, {"title": "Life Cycle (Preternaturals #5)", "author": "Zoe Winters", "pgs": 25, "sum": "Storyline: \nLife Cycle (Preternaturals #4) Immortality can be a bitch... Tamara has lived nearly two thousand years, trapped by a spell of her own creation. Hunted by her enemy and former lover, she knows there is only one man strong enough to release her from the curse. But will Cain honor her death wish, or keep her for himself, whatever the cost? Two ancient souls. Two weary fighters, torn between love and hate, forced to decide if the other could be worth living for.", "hash": "b44a64ef-c4ce-456c-91fc-2f763a550dcf"}, {"title": "Dark Mercy (Preternaturals #0)", "author": "Zoe Winters", "pgs": 12, "sum": "Storyline: \nDark Mercy (Preternaturals #2.5) 1955, Las Vegas, Nevada Angeline has been on the run from her sire, Linus, for centuries. She’s tired, and she’s lonely. High from mescaline-induced blood, she sees a sign—a church that seems to glow in the distance—and she knows. Her future mate is in that building. Important Author’s Note: Dark Mercy is the beginning of Hadrian and Angeline’s story, not the end. Their HEA will happen later in their own full-length novel. This story is important both for the overall series and for this couple, but it’s not their HEA. Just a mild disclaimer so no one goes in with false expectations for this story.", "hash": "6f338ce5-1471-408b-b695-3b756c785111"}, {"title": "Kept ", "author": "Zoe Winters", "pgs": 12, "sum": "Storyline: \nKept (Blood Lust #1) As a cat therian (shifter), Greta’s blood is already sought after to enhance spells and potions, but due to a quirk of her birth, her blood is potent enough to kill for. When her tribe plans to sacrifice her, Greta must ally herself with Dayne, the dangerous local sorcerer, and the only person strong enough to protect her.", "hash": "fd3f7082-cb1f-4950-bc58-6f93545eccc5"}]