[{"title": "Burning Alive (Sentinel Wars #1)", "author": "Shannon K. Butcher", "pgs": 50, "sum": "Storyline: \nBurning Alive (Sentinel Wars #1) They are the Sentinels... Three races descended from ancient guardians of mankind, each possessing unique abilities in their battle to protect humanity against their eternal foes-the Synestryn. Now, one warrior must fight his own desire if he is to discover the power that lies within his one true love... Helen Day is haunted by visions of herself surrounded by flames, as a dark-haired man watches her burn. So when she sees the man of her nightmares staring at her from across a diner, she attempts to flee-but instead ends up in the man's arms. There, she awakens a force more powerful and enticing than she could ever imagine. For the man is actually Theronai warrior Drake, whose own pain is driven away by Helen's presence. Together, they may become more than lovers-they may become a weapon of light that could tip the balance of the war and save Drake's people...", "hash": "a2fadf51-9ba4-401d-ac0a-6249ac2f2ded"}, {"title": "Finding the Lost (Sentinel Wars #2)", "author": "Shannon K. Butcher", "pgs": 53, "sum": "Storyline: \nFinding the Lost (Sentinel Wars #2) They are the Sentinels: three races descended from ancient guardians of mankind, each possessing unique abilities in their battle to protect humanity against their eternal foes–the Synestryn. Now a young woman must put faith in a warrior whose power frightens her even as it draws her in. Andra Madison knows that monsters are real. She’s been fighting them ever since her family was victimized by the Synestryn eight years ago. Now she’s devoted to finding children who’ve been abducted by the Synestryn. When she gets a call about a lost little boy, she tracks him to a warehouse on the outskirts of town, where she’s aided by a trio of human men…or so she thinks. Paul has been searching for centuries for a woman like Andra. To find her, he strikes a bargain with a bloodhunter that could cost him his life. Now his desire for Andra threatens to destroy his much-needed control. Against her wishes, Andra agrees to join Paul on a journey fraught with danger–one that leads directly to the Synestryn.", "hash": "2d4778ce-752e-4955-848a-b2dbaeb0b0d0"}, {"title": "Running Scared (Sentinel Wars #3)", "author": "Shannon K. Butcher", "pgs": 54, "sum": "Storyline: \nRunning Scared (Sentinel Wars #3) They are the Sentinels. Three races descended from ancient guardians of mankind, each possessing unique abilities in their battle to protect humanity against their eternal foes: the Synestryn. Now one Sentinel's survival determines the fate of them all. Lexi Johns has one purpose: to free her best friend from the hands of the Sentinels. And Zach, the Sentinel she has been running from for months, has one goal: to convince her that their destinies are entwined. For the magic that Zach has absorbed could destroy him if he doesn't find the woman who can channel it for him. And he knows Lexi is the one. From an early age, Lexi has been taught to fear the Sentinels. And now she is an agent of a group out to destroy them. So when Zach finds her, it is Lexi's chance to strike at the heart of the Sentinels. But, as Lexi sees Zach's courage, selflessness, and honor, she begins to doubt her beliefs — and is faced with an unbearable choice.", "hash": "d22842c5-5d40-4726-8b2e-18f6b22ac0fd"}, {"title": "Living Nightmare (Sentinel Wars #4)", "author": "Shannon K. Butcher", "pgs": 55, "sum": "Storyline: \nLiving Nightmare (Sentinel Wars #4) For nine years, the Sentinel Nika has had one goal-to save her younger sister from the Synestryn who hold her captive. Now, the psychic bond Nika forged with her sibling on that terrible night is fading, and time is running out. But the one man who can unlock the power inside her may be the greatest danger to her.", "hash": "f2dd3e7b-8f52-4018-9369-a449ed59524c"}, {"title": "Blood Hunt (Sentinel Wars #5)", "author": "Shannon K. Butcher", "pgs": 55, "sum": "Storyline: \nBlood Hunt (Sentinel Wars #5) Hope appeared out of nowhere, naked and alone, a woman without a past. The only thing she knows is that she is imbued with a strange power. It's in her blood. And two men want to posses it. One is Logan, a Sanguiner demon-fighter who needs Hope's essence to survive. The other is Krag, a Synestryn lord whose desire is to enslave Hope, and drain her of the lifeforce. When Hope and Logan both fall prey to Krag, a powerful desire grows between them. But is it enough to thwart their captor's diabolical plan and his demon warriors, and survive a vampire's destiny written in blood?", "hash": "fb3f8bc8-c822-41f2-9452-31e9e88659ee"}, {"title": "Dying Wish (Sentinel Wars #6)", "author": "Shannon K. Butcher", "pgs": 55, "sum": "Storyline: \nDying Wish (Sentinel Wars #6) Jackie Patton has been rescued by the Theronai from her captivity and torture at the hands of the Synestryn, only to learn that she's a potential match for the Theronai warriors who need a woman to literally save their lives. Forced to choose, she unexpectedly selects Iain, a cold-hearted warrior who doesn't want to be saved. Iain is convinced that it's too late-that his soul is already as dead as his former betrothed, killed by the Synestryn. Still, he is the only one she wants. But is Iain indeed beyond saving?", "hash": "085e813d-0211-4edf-b646-36790209c970"}, {"title": "Falling Blind (Sentinel Wars #7)", "author": "Shannon K. Butcher", "pgs": 55, "sum": "Storyline: \nFalling Blind (Sentinel Wars #7) They are the Sentinels. Three races descended from ancient guardians of mankind, each possessing unique abilities in their battle to protect humanity against their eternal foes: the Synestryn. Now a warrior must protect a strong-minded woman from an incredible evil... A beautiful, independent Theronai, Rory Rainey knows that her attempts to be a warrior are futile—unless she can stop the demonic visions that torment her. Determined to be free, Rory sets out to find the mysterious guardian who can cure her, before she loses her sight—or her life. But Rory’s journey brings its own dangers when she is attacked by a pack of Synestryn sent by the demon lord Raygh. Cornered and desperate, Rory narrowly escapes with the help of a sword-wielding stranger. Cain knows that Rory needs his protection to survive, just as he knows that her power is compatible with his own. And when Rory binds herself to Cain, the warrior knows he will do anything to keep her safe from the threat of the demon lord that pursues her...", "hash": "2f41eacc-3687-4aa9-83cc-1834bad76033"}, {"title": "Forget Me Not ", "author": "Shannon K. Butcher", "pgs": 14, "sum": "Storyline: \nThe last thing Adria expects to find when she arrives at her vacation rental is a man in her front yard—unconscious and stark naked. But something else sets him apart from most strangers. He is no ordinary man. Toren is new to Earth, framed for a crime he didn’t commit and banished to this planet to serve his sentence. He’s desperate to return to his planet, because the magic that is part of him will soon disappear, and along with it, all of his memories. Adria is his only hope to help make his escape for home—and as fate would have it, his reason to stay.", "hash": "9296ecf7-9e5a-4d03-9c86-193b5387056f"}, {"title": "A Hunger Like No Other (Immortals After Dark #2)", "author": "Kresley Cole", "pgs": 24, "sum": "Storyline: \nA Hunger Like No Other (Immortals After Dark #2) A mythic warrior who'll stop at nothing to possess her... After enduring years of torture from the vampire horde, Lachlain MacRieve, leader of the Lykae Clan, is enraged to find the predestined mate he's waited millennia for is a vampire. Or partly one. This Emmaline is a small, ethereal half Valkyrie/half vampire, who somehow begins to soothe the fury burning within him. A vampire captured by her wildest fantasy... Sheltered Emmaline Troy finally sets out to uncover the truth about her deceased parents—until a powerful Lykae claims her as his mate and forces her back to his ancestral Scottish castle. There, her fear of the Lykae—and their notorious dark desires—ebbs as he begins a slow, wicked seduction to sate her own dark cravings. An all-consuming desire... Yet when an ancient evil from her past resurfaces, will their desire deepen into a love that can bring a proud warrior to his knees and turn a gentle beauty into the fighter she was born to be?", "hash": "58359cc5-01a7-4d9c-9840-ff3645e0c18f"}, {"title": "No Rest for the Wicked (Immortals After Dark #3)", "author": "Kresley Cole", "pgs": 24, "sum": "Storyline: \nNo Rest for the Wicked (Immortals After Dark #3) A vampire soldier weary of life... Centuries ago, Sebastian Wroth was turned into a vampire—a nightmare in his mind—against his will. Burdened with hatred and alone for ages, he sees little reason to live. Until an exquisite, fey creature comes to kill him, inadvertently saving him instead. A valkyrie assassin dispatched to destroy him... When Kaderin the Cold Hearted lost her two beloved sisters to a vampire attack long ago, a benevolent force deadened her sorrow—accidentally extinguishing all of her emotions. Yet whenever she encounters Sebastian, her feelings—particularly lust—emerge multiplied. For the first time, she's unable to complete a kill. Competitors in a legendary hunt... The prize of the month-long contest is powerful enough to change history, and Kaderin will do anything to win it for her sisters. Wanting only to win her, forever, Sebastian competes as well, taking every opportunity—as they travel to ancient tombs and through catacombs, seeking relics around the world—to use her new feelings to seduce her. But when forced to choose between the vampire she's falling for and reuniting her family, how can Kaderin live without either?", "hash": "60ef987a-fe7f-4e02-9706-5f9da34b3745"}]