[{"title": "Shadow's Claim (The Dacians #1)", "author": "Kresley Cole", "pgs": 0, "sum": "Storyline: \nDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books:  Shadow's Claim (The Dacians #1)  HE WON’T BE DENIED Trehan Daciano, known as the Prince of Shadows, has spent his life serving his people—striking in the night, quietly executing any threat to their realm. The coldly disciplined swordsman has never desired anything for himself—until he beholds Bettina, the sheltered ward of two of the Lore’s most fearsome villains. SHE’S BOUND TO ANOTHER Desperate to earn her guardians’ approval after a life-shattering mistake, young Bettina has no choice but to marry whichever suitor prevails—even though she’s lost her heart to another. Yet one lethal competitor, a mysterious cloaked swordsman, invades her dreams, tempting her with forbidden pleasure. A BATTLE FOR HER BODY AND SOUL Even if Trehan can survive the punishing contests to claim her as his wife, the true battle for Bettina’s heart is yet to come. And unleashing a millennium’s worth of savage need will either frighten his Bride away—or stoke Bettina’s own desires to a fever pitch. . . .", "hash": "e42cd263-7dde-476e-86af-2e10978dad88"}, {"title": "Captured (The Captive #1)", "author": "Erica Stevens", "pgs": 22, "sum": "Storyline: \nCaptured (The Captive #1) Blood Slave. Captured, taken from her beloved family and woods, Aria’s biggest fear is not the imminent death facing her, but that she will be chosen as a blood slave for a member of the ruling vampire race. No matter what becomes of her though, Aria knows that she must keep her identity hidden from the monsters imprisoning her. She has already been branded a member of the rebellion, but the vampires do not know the true depth of her involvement with it, and they must never know. Though hoping for death, Aria’s world is turned upside down when a vampire named Braith steps forward to claim her. He delays her execution, but Aria knows it’s only a matter of time before he drains her, and destroys her. Especially once she learns his true identity as a prince within the royal family; the same royal family that started the war that ultimately brought down humankind, reducing them to nothing more than servants and slaves. Aria is determined to hate the prince, determined not to give into him in anyway, but his strange kindness, and surprising gentleness astonish her. Torn between her loyalties to the rebellion, and her growing love for her greatest enemy, Aria struggles to decide between everything she has ever known, and a love she never dreamed of finding.", "hash": "9d0f1bb5-519e-45ec-b5b0-13e7acdbfbfd"}, {"title": "Renegade (The Captive #2)", "author": "Erica Stevens", "pgs": 28, "sum": "Storyline: \nRenegade (The Captive #2) Though she is free of the palace, rescued from her position as a blood slave, Aria is haunted by the memories of her time spent within the fortress, tormented by memories of Braith, the prince that betrayed her and shattered her heart. Every day is a struggle to get through, and the only solace she is able to find is with Max, her best friend, and fellow captive. Though Max does not understand her bond to Braith, he knows some of what she endured, and helps to ease some of the tattered pieces of her soul. Aria slowly begins to salvage the broken parts of her wounded spirit by throwing herself into the wonder of the woods she had so greatly missed, and the secure and reassuring love that Max freely gives her. Her world is thrown into a tailspin again though when a marauding group of vampires destroy the caves she had found temporary shelter in. Scattered about the forest, seeking to stay hidden and find her family, Aria is stunned when Braith, the monster that savaged her heart, reappears. Stunned by his sudden arrival in her world, Arianna is uncertain if he has come to recapture her, or to kill her for daring to escape.", "hash": "7c3f1a14-8cc0-4276-8bf3-b423affdd878"}, {"title": "Salvation (The Captive #4)", "author": "Erica Stevens", "pgs": 37, "sum": "Storyline: \nSalvation (The Captive #4) Imprisoned by Caleb and at the mercy of the king, Aria is determined not to let them break her. However, the more atrocities she witnesses, the more she realizes there are some horrors no one can withstand, and sometimes survival isn’t always the best option. Tormented by the loss of Aria, Braith is forced to choose between his need to rescue her, and the impending rebel war he’s been chosen to lead. Fighting against the darkness which threatens to drag him into its tempting depths, Braith struggles not to become like the one thing he hates the most, his father. Faced with their own separate challenges, Aria and Braith must come to terms with who they are, what they want, and the likelihood that they can never be together as the inevitable war looms on the horizon. A war that all of them will fight but not all of them will survive.", "hash": "60a26e4d-6f77-46e2-be16-4cc6694372b2"}, {"title": "Ashes (The Kindred #2)", "author": "Erica Stevens", "pgs": 34, "sum": "Storyline: \nAshes (The Kindred #2) For the past four years Cassie has only known vampires as her enemy. With the revelation of Devon’s true nature she must come to terms with the fact that not everything she knows is right, especially when the source of her Hunter powers is revealed. Slowly, Cassie begins to unravel the mystery that enshrouds Devon as the bond between them grows and intensifies. It’s not until a woman from his past walks into their present, that Cassie realizes there are far more layers to Devon than she ever realized. Layers that may very well destroy her, and everyone that she loves. Thrown off by the new arrival in their town, and struggling to survive, Cassie is not prepared for the devastating blow that leaves the world she knows nothing but a pile of rubble and ashes. Ashes that may very well give rise to something else inside of her, something that’s not entirely human.", "hash": "0a09167d-8543-4bc4-a98b-ed7f2d5b916c"}, {"title": "Fated (The Vampire Destiny #1)", "author": "Alexandra Anthony", "pgs": 11, "sum": "Storyline: \nFated (The Vampire Destiny Series #1)  Chasing the secrets of her past... Josephine Anderson is a 28 year old psychic empath. Isolated and alone, she'd given up on finding love because of her \"gift\". She's haunted by her vivid dreams about a mysterious man that is her destiny... Her world is turned upside down... When she meets Stefan Lifsten, she's surprised to discover that he's the man from her dreams. He's tall, blond and drop-dead gorgeous, but he has his own secrets to hide. He's a millennia old vampire that's been on a quest to find her after his own vision 200 years ago... Their fates finally collide... Will their fated love and desire be enough to keep them together as she becomes entrenched in the world of vampires and her past unravels?", "hash": "d6cc1544-6800-4625-908a-2cae0be33264"}, {"title": "Illusion (The Vampire Destiny #2)", "author": "Alexandra Anthony", "pgs": 11, "sum": "Storyline: \nIllusion (The Vampire Destiny Series #2) Her story continues... Psychic empath Josephine Anderson is surprised to discover that she's a little more than human. She's a vampire hybrid with a powerful vampire father... Her life will never be the same... She prepares to live as an immortal with her vampire mate,Stefan Lifsten. As she makes plans to abandon her old life to be at her lover's side, she begins to slowly transform,developing new abilities and desires... Long buried secrets are revealed... When she discovers the truth about her heritage, she's drawn into a web of passion, deception, and power struggles that leave many lives hanging in the balance.", "hash": "bf7a2737-14cf-4958-94b5-f1e7b01d4078"}, {"title": "Raphael (Vampires in America #1)", "author": "D.B. Reynolds", "pgs": 43, "sum": "Storyline: \nRaphael (Vampires in America #1) Malibu, California-home to rock-and-roll gods and movie stars, the beautiful, the rich . . . and vampires. Powerful and charismatic, Raphael is a Vampire Lord, one of the few who hold the power of life and death over every vampire in existence. Thousands call him Master and have pledged absolute loyalty on their very lives. But when, in a brazen and deadly daylight attack, a gang of human killers kidnaps the one female vampire he'd give his life for, Raphael turns to a human investigator to find his enemies before it's too late. Cynthia Leighton is smart, tough and sexy, a private investigator and former cop who's tired of spying on cheating spouses and digging out old bank accounts. When Raphael asks for her help in tracking down the kidnappers, Cyn's happy to accept. But she soon realizes her greatest danger comes not from the humans, but from Raphael himself. Battling Russian mobsters and treacherous vampires, and betrayed by those they trusted, Cyn and Raphael find themselves fighting for their lives while caught up in a passion of blood and violence that is destined to destroy them both.", "hash": "069c2d22-3c93-43f9-ac81-04f62d1fc5f8"}, {"title": "Jabril (Vampires in America #2)", "author": "D.B. Reynolds", "pgs": 52, "sum": "Storyline: \nJabril (Vampires in America #2) Houston, Texas-Cowboy boots, baseball and journeys to the stars . . . right? Wrong. Because Houston is also home to Jabril Karim, one of the eight powerful Vampire Lords who control all of North America. And as Private Investigator Cynthia Leighton will soon discover, not all Vampire Lords are created equal. For Jabril is the face of evil in the new world, a vampire who values no life but his own, who enslaves those he desires, steals whatever he covets and destroys anyone who stands in his way. Running from L.A. and its seductive Vampire Lord, Raphael, Cyn sees the Houston job as a welcome refuge, a place to get away and heal her broken heart. But Texas will be no vacation. For in Jabril Karim, Cyn will confront a true enemy, one who will go to any lengths to satisfy his lusts, enrich his coffers and expand his power. Fighting for the lives of two young sisters, Cyn's journey will take her through the streets of Houston and back to L.A., where the human police are determined to bring Raphael down for the murder of one of their own. But the danger doesn't end there. For Jabril has set his sights on Cyn, and he will stop at nothing to have her.", "hash": "62ce5048-4f87-4ee7-8dba-3018b1c0cb45"}, {"title": "Rajmund (Vampires in America #3)", "author": "D.B. Reynolds", "pgs": 61, "sum": "Storyline: \nRajmund (Vampires in America #3) RAJMUND GREGOR is a vampire . . . and the undisputed Master of New York City. He bows to no one but his Sire, Krystof, who is the Vampire Lord for the entire Northeastern U.S. Based in Buffalo, NY, Krystof is an old vampire—-too old, it would seem, because he’s slowly losing his mind. Summoned back to Buffalo by his Sire, Rajmund finds his master out of touch and rapidly weakening. He knows the territory will crumble if something isn’t done, and he’s the only one of Krystof’s children strong enough to seize power. But there’s also the matter of some missing women and a rogue vampire who seems to be moving in for the kill. SARAH STRATTON has a secret, one she’s never shared with anyone–—at least not anyone who knows her now, not even her good friend Cyn. It’s a secret that could destroy her carefully constructed life, but it’s one she may have to share with a vampire, if she’s going to save the lives of the missing women.", "hash": "79a81dfe-b627-407a-aa7c-1a4742ff4e42"}]