[{"title": "Sophia (Vampires in America #4)", "author": "D.B. Reynolds", "pgs": 59, "sum": "Storyline: \nSophia (Vampires in America #4) The Pacific Northwest . . . home to lush forests and constant rain, to lumberjacks and computer geeks, especially those of the vampire kind. Sophia, beautiful and deadly, has spent the last hundred years dancing her way through the balmy nights and hot-blooded men of South America. But when her Sire sends an urgent summons, Sophia rushes home to Vancouver only to find he has disappeared, leaving nothing behind but three dead vampires and a letter with Sophia’s name on it. Colin Murphy, a former Navy SEAL, came to the Northwest seeking a quiet place to heal the scars earned in more than a decade at war. But when someone starts killing local vampires and torturing their mates, Colin takes on the mantle of a warrior once again as he sets out to find the killers and do whatever it takes to stop them, even if that means hunting with vampires. Following her Sire’s trail of death to a small town in northern Washington, Sophia unexpectedly discovers the heat of a South American night in Colin’s arms. But all too soon Sophia and Colin find themselves in a race to uncover the killers before the next dead vampire is Sophia herself.", "hash": "c3df47c2-89f4-4f56-acba-a30196061e86"}, {"title": "Duncan (Vampires in America #5)", "author": "D.B. Reynolds", "pgs": 61, "sum": "Storyline: \nDuncan (Vampires in America #5) Washington, D.C. … capital of an empire. Powerful. Exhilarating. Corrupt. And in the shadows … vampires far older than the nation itself. A power unto himself, Duncan has served at Raphael’s side for a hundred and fifty years. But long laid plans have finally borne fruit, and the time has come for Duncan to leave Raphael and tackle the greatest challenge of his life. He will face treacherous vampires and murderous humans. He will rock the halls of human power if necessary. But Washington, D.C. will be his. Emma Duquet cares nothing for vampire politics. She just wants to find her missing roommate and best friend, Lacey. But Lacey’s been playing with vampires of a particularly dangerous kind, and Emma will have to deal with the new vampire in town if she’s going to find her friend. Battling powerful enemies who will stop at nothing to keep their secrets, Duncan and Emma will dig beneath the corruption and depravity that is Washington, D.C. and uncover the most heinous conspiracy of all…", "hash": "6c2b1210-9e66-43e3-811c-d4f2df7e6c86"}, {"title": "Lucas (Vampires in America #6)", "author": "D.B. Reynolds", "pgs": 61, "sum": "Storyline: \nLucas (Vampires in America #6) THE BADLANDS of SOUTH DAKOTA . . . haunting landscapes, legendary outlaws, and . . . vampires? LUCAS DONLON, Vampire Lord, is one of the most powerful vampires in North America and beyond. Charming and irreverent to his friends and lovers, he enjoys everything about his life as a vampire. But when a neighboring lord makes the mistake of declaring war, he quickly discovers that Lucas is every bit as lethal as he is charming. KATHRYN HUNTER doesn't care about powerful vampires or their wars. Her baby brother is missing and she will do anything to find him, even if it means going against both her FBI bosses and the local vampire lord. But Lucas Donlon has other plans for the lovely FBI agent who's landed on his doorstep. Waging war against their enemies and each other, Lucas and Kathryn will risk everything to keep the most deadly vampire war in hundreds of years from engulfing every vampire, and human, in North America.", "hash": "50c51f74-7e59-4824-9c40-190fd55e0cf7"}, {"title": "Aden (Vampires in America #7)", "author": "D.B. Reynolds", "pgs": 55, "sum": "Storyline: \nAden (Vampires in America #7) She was seeking revenge. What she found was a vampire who swept her into the darkest depths of passion. Chicago, Illinois... the windy city. Home to football greats, dinosaurs named Sue, and, when the sun goes down... powerful vampires battling for the right to rule the city and beyond. Born into slavery, Aden is one of the most powerful vampires in North America, waging war on others of his kind in a struggle to become the next Lord of the Midwest. But in the midst of the deadliest fight of his long life, the ghosts of his past have come back to haunt him. Slavery still exists, and Aden is hellbent on destroying it and the vampires who profit from it. Sidonie Reid is an investigative reporter in pursuit of the biggest story of her career, until that story costs the life of a friend and Sid realizes she has to do much more than write about it. Intent on bringing down the vampires and their slave network, Sid gains entry to the highest levels of vampire society, where she finds herself confronting the raw sexuality that is Aden. Caught up in a dark passion that neither can resist, Aden and Sidonie join forces, determined to defeat the old regime and everything it stands for. The dangers are beyond calculation, but the ultimate reward is worth the risk. If they survive...", "hash": "586d9091-2a4c-49b7-b100-99024f2eb5f5"}, {"title": "Hunted (Vampires in America #6.5)", "author": "D.B. Reynolds", "pgs": 16, "sum": "Storyline: \nHunted (Vampires in America #6.5) Power, it comes down to this... those who have it, those who want it. Revenge, the need for it is a fire in the soul, a goad for the unwise. Hunted, the fate of the foolish when they think to become the hunter. The Lord of the Midwest is dead, and the powerful vampires of North America are gathering to choose his successor. The Vampire Council will be there to oversee the competition and to keep the violence to a bloody minimum, including Raphael, who will do whatever it takes to ensure the victor is a vampire he can trust. But someone is determined to stop Raphael and his mate, Cyn, from ever reaching Chicago, a hunter who may soon become... the hunted.", "hash": "34961b64-3c23-40d6-9e54-b57dd6aeb22e"}, {"title": "A Discovery of Witches (All Souls Trilogy #1)", "author": "Deborah Harkness", "pgs": 43, "sum": "Storyline: \nA Discovery of Witches (All Souls Trilogy #1) A richly inventive novel about a centuries-old vampire, a spellbound witch, and the mysterious manuscript that draws them together. Deep in the stacks of Oxford's Bodleian Library, young scholar Diana Bishop unwittingly calls up a bewitched alchemical manuscript in the course of her research. Descended from an old and distinguished line of witches, Diana wants nothing to do with sorcery; so after a furtive glance and a few notes, she banishes the book to the stacks. But her discovery sets a fantastical underworld stirring, and a horde of daemons, witches, and vampires soon descends upon the library. Diana has stumbled upon a coveted treasure lost for centuries-and she is the only creature who can break its spell. Debut novelist Deborah Harkness has crafted a mesmerizing and addictive read, equal parts history and magic, romance and suspense. Diana is a bold heroine who meets her equal in vampire geneticist Matthew Clairmont, and gradually warms up to him as their alliance deepens into an intimacy that violates age-old taboos. This smart, sophisticated story harks back to the novels of Anne Rice, but it is as contemporary and sensual as the Twilight series-with an extra serving of historical realism.", "hash": "0d71bfe6-a5f9-4278-b988-6cd8d0a7c6a4"}, {"title": "Tempt Me with Darkness (Doomsday Brethren #1)", "author": "Shayla Black", "pgs": 46, "sum": "Storyline: \nTempt Me with Darkness (Doomsday Brethren #1) He's an immortal knight hungering for satisfaction.... As soon as Marrok sees Olivia Gray's dark windswept hair and burning violet eyes, he's sure they've met in eons past. He's felt her soft gentle curves writhing in pleasure beneath his own hard powerful body...Morganna! For centuries, towering Marrok, once the mightiest of King Arthur's warriors, has endured a terrible curse cast upon him when he spurned the witch. She's a modern woman about to discover ancient magic.... Olivia shares a mystical - and irresistible - connection with brooding Marrok. Soon after the sexy warrior appears in her erotic dreams, he abducts her, demanding she uncurse him. Their intense passion is more powerful - and intimate - than either of them has ever known. Olivia may be the key to unlocking the diary that will break Morganna's hold on his life. But in the wrong hands, the book also holds the power to destroy all magickind. As they search for answers, a ruthless wizard returned from exile is building an army of evil. When he discovers Marrok and Olivia have the diary, only their love - with the help of a powerful group of magical Brethren - can save them.", "hash": "5e31245e-18f0-45d2-b334-2ce1d2b54b2c"}, {"title": "Fated (Doomsday Brethren #1.5)", "author": "Shayla Black", "pgs": 10, "sum": "Storyline: \nFated (Doomsday Brethren #1.5) Kari Keswick and Ronan Wolvesey burned for one another, but a deadly family curse targets their love with destruction. Will magic tear them apart?", "hash": "f7d37a71-610b-4d3f-a38a-b6b7bdc4104f"}, {"title": "Seduce Me in Shadow (Doomsday Brethren #2)", "author": "Shayla Black", "pgs": 44, "sum": "Storyline: \nSeduce Me in Shadow (Doomsday Brethren #2)  When a villainous wizard escapes from exile, the devastatingly sexy Doomsday Brethren must defend all magickind in the spellbinding second book in bestselling author Shayla Black's seductive new paranormal series. Ex-marine Caden MacTavish has shunned his magical heritage all his life, but he will do anything to heal his desperately ill brother, a Doomsday Brethren warrior in mourning for his missing mate. Posing as a photographer, Caden must convince firecracker tabloid reporter Sydney Blair to reveal the source of her recent exposé on a supernatural power clash. Unfortunately, keeping his hands off the sizzling redhead proves as hard as getting them onto the potent and mystical Doomsday Diary he discovers at her bedside. A bloody rebellion led by an evil, power-hungry wizard is imminent. If Sydney divulges the book's existence, she will jeopardize magickind's most deeply guarded secrets and become the ruthless wizard's number one target. Caden has never trusted magic's cruel and dangerous powers, but he will protect Sydney with his life and magic \u0097 even if it means risking his heart.", "hash": "8aa7f60b-7205-436c-b076-f752d5a72b62"}, {"title": "Possess Me at Midnight (Doomsday Brethren #3)", "author": "Shayla Black", "pgs": 43, "sum": "Storyline: \nPossess Me at Midnight (Doomsday Brethren #3) The sexy warrior Ice Rykard finds himself craving beautiful Sabelle Rion As a mysterious dark cloud drains the life of her beloved brother, Doomsday Brethren leader Bram, Sabelle Rion can think of little else. Still, every time she meets Ice Rykard’s intense green gaze, her body aches with need for the sexy warrior. Their attraction is explosive, incredible—and forbidden. As dangerous as he is unpredictable, Ice is her brother’s sworn enemy. But as Bram weakens, a more sinister force is gaining power. Evil Mathias and his ruthless Anarki army are on a bloodthirsty hunt for the Doomsday Diary. Sabelle must guard the potent book with her life—and Ice vows to protect the beautiful witch with his. Duty demands that Sabelle deny her lover’s fiery call of possession and mate with a man who can sway the magical Council against the impending rebellion. With the fate of magickind hanging in the balance, will she forsake the burning desires she can’t ignore or turn her back on her people for the courageous man she can’t resist?", "hash": "f759af08-f7a4-41d9-b697-36eb702a5cc8"}]