[{"title": "Entice Me at Twilight (Doomsday Brethren #4)", "author": "Shayla Black", "pgs": 43, "sum": "Storyline: \nEntice Me at Twilight (Doomsday Brethren #4) Dangerously handsome Simon Northam, Duke of Hurstgrove, and his uptight brother Mason are hardly close, but crashing Mason’s wedding and stealing his fiancée further aggravate their sibling rivalry. Duke’s family has no notion he’s a wizard, so how can he explain that magickind’s fate lies with the beautiful, tenacious bride he longs to seduce? Felicia is an Untouchable, a rare human whose presence disables magic—even the impenetrable forces surrounding Morganna le Fay’s tomb. The evil witch’s malicious powers could propel nefarious wizard Mathias to ultimate world domination . . . if he can resurrect her. To conceal herself, Felicia must succumb to her smoldering desire for Duke, but he risks binding his life—and sanity— to a lover whose loyalties are forever torn. He faces a choice: betray his brother for ultimate survival . . . or lose the woman who tempts him beyond control.", "hash": "02da2276-3377-469a-ac86-b6b2d8b1cfc9"}, {"title": "Embrace Me at Dawn (Doomsday Brethren #5)", "author": "Shayla Black", "pgs": 49, "sum": "Storyline: \nEmbrace Me at Dawn (Doomsday Brethren #5) No man will ever define her again. Anka MacTavish lost everything when Mathias D’Arc captured her, shattered her bond with her mate, and broke both her body and spirit. Determined to heal her bleeding soul, she joins the Doomsday Brethren’s fight to vanquish the evil wizard and seize her revenge. But becoming a magical warrior will require close contact with her former mate, the love who’s never left her heart, Lucan. And she’ll have to explain why she left him and fled to the arms of another lover… No woman can ever take her place. Lucan’s world crumbled when Anka escaped Mathias and sought protection from his long-time rival, Shock. Now she has returned, and Lucan must train her to confront a new and terrible danger that threatens magickind. With every punch, blow, and parry, Lucan discovers that Anka isn’t the demure wife he once knew, and his growing desire for this woman is a need he can’t control. He vows to do whatever it takes to reclaim her heart and make her his once more. But when the Doomsday Brethren are forced to make an unlikely alliance, it will test Anka’s resolve like never before. To survive, she and Lucan must rely on one another, face their deepest fears... and expose the dark secrets that threaten to destroy everything, including their love.", "hash": "d96e1ba9-5f87-474d-b516-4fd50c4179d9"}, {"title": "Providence (Providence #1)", "author": "Jamie McGuire", "pgs": 50, "sum": "Storyline: \nProvidence (Providence #1) Struggling with her father's death, Nina meets Jared Ryel, presumably by chance. However it soon becomes clear that he knows more about her than even close friends. When her father's former associates begin following her in the dark, Nina learns that her father was not the man she thought he was, but a thief who stole from demons. In searching for the truth behind her father's death, she stumbles upon something she never expected, and something Hell wants, that only she holds the key for. Jared risks everything to keep the women he was born to save, by sharing the secret he was sworn to protect.", "hash": "8ea0ade1-5b37-417a-94df-c175eadfb8be"}, {"title": "Requiem (Providence #2)", "author": "Jamie McGuire", "pgs": 33, "sum": "Storyline: \nRequiem (Providence #2) Dreaming of the dead might mean a restless night for anyone, but for Nina Grey it was a warning. Still healing from her last run-in with Hell, Nina struggles with not only her life as a Brown University student, but also as an intern at Titan Shipping, her father's company. Recurring nightmares about her father's violent death have become a nightly event, but being overwhelmed with guilt from Ryan's unexpected departure to the Armed Forces, and heart ache over Claire being across the ocean to protect him, Nina believes her sleepless nights are the least of her problems—but she's wrong. Worried about Nina's declining health, Jared must steal back Shax's book for answers. Fighting new enemies, and with the help of new friends, Jared's worst fear comes to fruition. Desperate, he is faced with a choice: Fight Hell alone, or start a war with Heaven.", "hash": "1ccb6d91-4087-41b0-a8f8-939d50679dfa"}, {"title": "Eden (Providence #3)", "author": "Jamie McGuire", "pgs": 31, "sum": "Storyline: \nEden (Providence #3) She had seen the unspeakable. She would learn the unknowable. Now, she would fight the invincible. In the third and final installment of the Providence series, Nina Grey will marry the wrong man, carry the child that was never supposed to be born, and fight a war she can't win. Faced with the impossible task of protecting his new wife and unborn child against the throes of Hell, Jared Ryel is allowed no mistakes. Pressured to return the Naissance de Demoniac to Jerusalem, he revisits St. Ann's to learn the answers were in front of him all along. Together, they must survive long enough to let their child save them - and the world.", "hash": "0f6fefdc-70dd-42ae-bbff-72b4b7f65b57"}, {"title": "Eternal Seduction (Darkness Within #1)", "author": "Jennifer Turner", "pgs": 58, "sum": "Storyline: \nEternal Seduction (Darkness Within #1) After living on the streets of New York for over a decade, Logan admits her perceptions might be a little skewed. But twisted or not, there's a satisfying irony in watching a well dressed vampire stand in the middle of a ghetto alley, windblown trash scraping circles near his feet. What she finds even more intriguing, is waiting for him to decide if he's going to kill her. Kerestyan hasn't made up his mind. As the Lord of New York, he can't let a drug addict, whose memories are packed with knowledge of vampires, run free in his city. It's not the first time he's been in this situation with a human, it's just the first time he's come face to face with one who doesn't seem to care. And that's what makes the decision so difficult. What horrors could you witness before you went numb? How long would it take before you felt that way? What could make you care again? Logan's answers are simple: the worst humanity has to offer, almost thirty, and something she never expected.", "hash": "a5d84751-5e42-418e-8527-679162d47748"}, {"title": "An Insider's Guide ", "author": "J.R. Ward", "pgs": 11, "sum": "Storyline: \nAn Insider's Guide (Black Dagger Brotherhood Compendium) Prepare to enter the dark, passionate world of the Black Dagger Brotherhood and get up close and personal with each of the Brothers.... You'll find insider information on the Brotherhood, including their dossiers, stats, and special gifts. you'll read interviews with your favorite characters, including a heartbreaking conversation with Tohrment and Wellsie, conducted three weeks before she was killed by lessers. You'll discover deleted scenes -- accompanied by the whys behind the cuts -- in addition to exciting material from the J.R. Ward message boards and the answers to questions about the series posed by readers. you'll learn what it's like for J.R. Ward to write each installment of the series, and in a fascinating twist, you'll read an interview with the author -- conducted by the Brothers. For the first time ever, you'll see an original novella about Zsadist and Bella, and witness the miracle of their daughter Nalla's birth and experience the depth of their love for each other. Also, you'll receive a sneak peek at the much anticipated next book in the Black Dagger Brotherhood series, Lover Avenged, Rehvenge's story. This is a compendium no black Dagger Brotherhood fan should miss...and an insider's guide that will seduce you as powerfully as the sexy band of Brothers and the \"ferociously popular\" world in which they live.", "hash": "6c768987-48c3-4ba6-9287-0a246fbfd1e2"}, {"title": "Dark Lover (Black Dagger Brotherhood #1)", "author": "J.R. Ward", "pgs": 57, "sum": "Storyline: \nDark Lover (Black Dagger Brotherhood #1) In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood. The only purebred vampire left on earth, Wrath has a score to settle with the slayers who murdered his parents centuries ago. But, when one of his most trusted fighters is killed-leaving his half-breed daughter unaware of his existence or her fate-Wrath must usher her into the world of the undead-a world of sensuality beyond her wildest dreams.", "hash": "4c2a9581-46f9-4de3-8487-cf142f0f7843"}, {"title": "Lover Eternal (Black Dagger Brotherhood #2)", "author": "J.R. Ward", "pgs": 51, "sum": "Storyline: \nLover Eternal (Black Dagger Brotherhood #2) Within the brotherhood, Rhage is the vampire with the strongest appetites. He's the best fighter, the quickest to act on his impulses, and the most voracious lover-for inside him burns a ferocious curse cast by the Scribe Virgin. Owned by this dark side, Rhage fears the time when his inner dragon is unleashed, making him a danger to everyone around him. Mary Luce, a survivor of many hardships is unwittingly thrown into the vampire world and reliant on Rhage's protection. With a life-threatening curse of her own, Mary is not looking for love. She lost her faith in miracles years ago. But when Rhage's intense animal attraction turns into something more emotional, he knows that he must make Mary his alone. And while their enemies close in, Mary fights desperately to gain life eternal with the one she loves...", "hash": "9615d3fc-8df7-48e2-ace2-249836ceb7e3"}, {"title": "Lover Awakened (Black Dagger Brotherhood #3)", "author": "J.R. Ward", "pgs": 52, "sum": "Storyline: \nLover Awakened (Black Dagger Brotherhood #3) A former blood slave, the vampire Zsadist still bears the scars from a past filled with suffering and humiliation. Renowned for his unquenchable fury and sinister deeds, he is a savage feared by humans and vampires alike. Anger is his only companion, and terror is his only passion—until he rescues a beautiful aristocrat from the evil Lessening Society. Bella is instantly entranced by the seething power Zsadist possesses. But even as their desire for one another begins to overtake them both, Zsadist’s thirst for vengeance against Bella’s tormentors drives him to the brink of madness. Now, Bella must help her lover overcome the wounds of his tortured past, and find a future with her…", "hash": "f66cf029-ec57-4e41-96df-19cdf37855fb"}]