[{"title": "Lover Revealed (Black Dagger Brotherhood #4)", "author": "J.R. Ward", "pgs": 51, "sum": "Storyline: \nLover Revealed (Black Dagger Brotherhood #4) Butch O'Neal is a fighter by nature. A hard-living ex-homicide cop, he's the only human ever to be allowed in the inner circle of the Black Dagger Brotherhood. And he wants to go even deeper into the vampire world-to engage in the turf war with the lessers. His heart belongs to a female vampire, Marissa, an aristocratic beauty who's way out of his league. And if he can't have her, then at least he can fight side by side with the Brothers. But fate curses him with the very thing he wants. When Butch sacrifices himself to save a civilian vampire from the slayers, he falls prey to the darkest force in the war. Left for dead, he's found by a miracle, and the Brotherhood calls on Marissa to bring him back, though even her love may not be enough to save him.", "hash": "ea3fc3ce-864d-4eca-8bb3-460b47a9a7b5"}, {"title": "Lover Unbound (Black Dagger Brotherhood #5)", "author": "J.R. Ward", "pgs": 56, "sum": "Storyline: \nLover Unbound (Black Dagger Brotherhood #5) Ruthless and brilliant, Vishous, son of the Bloodletter, possesses a destructive curse and a frightening ability to see the future. As a pretrans growing up in his father's war camp he was tormented and abused. As a member of the Brotherhood, he has no interest in love or emotion, only the battle with the Lessening Society. But when a mortal injury puts him in the care of human surgeon, Dr. Jane Whitcomb compels him to reveal his inner pain and taste true pleasure for the first time-until a destiny he didn't choose takes him into a future that cannot include her...", "hash": "57589cce-69e4-461a-8ea3-a1410df3f8bf"}, {"title": "Lover Enshrined (Black Dagger Brotherhood #6)", "author": "J.R. Ward", "pgs": 58, "sum": "Storyline: \nLover Enshrined (Black Dagger Brotherhood #6) Fiercely loyal to the Black Dagger Brotherhood, Phury has sacrificed himself for the good of the race, becoming the male responsible for keeping the Brotherhood's bloodlines alive. As Primale of the Chosen, he is obligated to father the sons and daughters who will ensure that the traditions of the race survive, and that there are warriors to fight those who want all vampires extinguished. As his first mate, the Chosen Cormia wants to win not only his body, but his heart for herself. She is drawn to the noble responsibility behind the emotionally scarred male. But Phury has never allowed himself to know pleasure or joy. As the war with the Lessening Society grows grim, tragedy looms over the Brotherhood's mansion, and Phury must decide between duty and love....", "hash": "9bad9a3c-eb70-482e-a3c8-923b91dfcfeb"}, {"title": "Lover Avenged (Black Dagger Brotherhood #7)", "author": "J.R. Ward", "pgs": 37, "sum": "Storyline: \nLover Avenged (Black Dagger Brotherhood #7) Caldwell, New York, has long been the battleground for the vampires and their enemies, the Lessening Society. It's also where Rehvenge has staked out his turf as a drug lord and owner of a notorious night club that caters to the rich and heavily armed. His shadowy reputation is exactly why he's approached to kill Wrath, the Blind King and leader of the Brotherhood. Rehvenge has always kept his distance from the Brotherhood-even though his sister is married to a member, for he harbors a deadly secret that could make him a huge liability in their war against the lessers. As plots within and outside of the Brotherhood threaten to reveal the truth about Rehvenge, he turns to the only source of light in his darkening world, Ehlena, a vampire untouched by the corruption that has its hold on him-and the only thing standing between him and eternal destruction.", "hash": "5ead3945-bd2e-4af9-a2ee-254ae5d9b26e"}, {"title": "Lover Mine (Black Dagger Brotherhood #8)", "author": "J.R. Ward", "pgs": 72, "sum": "Storyline: \nLover Mine (Black Dagger Brotherhood #8) John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal vendetta takes John into the heart of the war, he will need to call up on both who he is now and who he once was in order to face off against evil incarnate. Xhex, a symphath assassin, has long steeled herself against the attraction between her and John Matthew. Having already lost one lover to madness, she will not allow the male of worth to fall prey to the darkness of her twisted life. When fate intervenes, however, the two discover that love, like destiny, is inevitable between soul mates.", "hash": "1953dc7f-a5da-4989-8b7c-7d9fd301cbec"}, {"title": "Lover Unleashed (Black Dagger Brotherhood #9)", "author": "J.R. Ward", "pgs": 57, "sum": "Storyline: \nLover Unleashed (Black Dagger Brotherhood #9) Payne, twin sister of Vishous, is cut from the same dark, warrior cloth as her brother: A fighter by nature, and a maverick when it comes to the traditional role of Chosen females, there is no place for her on the Far Side… and no role for her on the front lines of the war, either. When she suffers a paralyzing injury, human surgeon Dr. Manuel Manello is called in to treat her as only he can- and he soon gets sucked into her dangerous, secret world. Although he never before believed in things that go bump in the night- like vampires- he finds himself more than willing to be seduced by the powerful female who marks both his body and his soul. As the two find so much more than an erotic connection, the human and vampire worlds collide … just as a centuries old score catches up with Payne and puts both her love and her life in deadly jeopardy.", "hash": "6e612ee8-a009-4cdb-8851-482c14893b63"}, {"title": "Lover Reborn (Black Dagger Brotherhood #10)", "author": "J.R. Ward", "pgs": 77, "sum": "Storyline: \nLover Reborn (Black Dagger Brotherhood #10) Ever since the death of his shellan, Tohrment has been a heartbroken shadow of the vampire leader he once was. Brought back to the Brotherhood by a self-serving fallen angel, he fights again with ruthless vengeance, unprepared for a new tragedy. Seeing his beloved in dreams—trapped in a cold, isolated netherworld—Tohr turns to the angel Lassiter to save his former mate. The only way to rescue her is for Tohr to love another. As war with the lessers rages, and a new clan of vampires vie for the Blind King’s throne, Tohr struggles between an unforgettable past and a hot, passion-filled future. But can his heart let go and set all of them free?", "hash": "ccbbd731-b32f-49cb-9a16-b1700f071c0a"}, {"title": "Lover At Last (Black Dagger Brotherhood #11)", "author": "J.R. Ward", "pgs": 85, "sum": "Storyline: \nLover at Last (Black Dagger Brotherhood #11) Qhuinn, son of no one, is used to being on his own. Disavowed from his bloodline, shunned by the aristocracy, he has finally found an identity as one of the most brutal fighters in the war against the Lessening Society. But his life is not complete. Even as the prospect of having a family of his own seems to be within reach, he is empty on the inside, his heart given to another.... Blay, after years of unrequited love, has moved on from his feelings for Qhuinn. And it’s about time: The male has found his perfect match in a Chosen female, and they are going to have a young—just as Qhuinn has always wanted for himself. It’s hard to see the new couple together, but building your life around a pipe dream is just a heartbreak waiting to happen. As he’s learned firsthand. Fate seems to have taken these vampire soldiers in different directions... but as the battle over the race’s throne intensifies, and new players on the scene in Caldwell create mortal danger for the Brotherhood, Qhuinn finally learns the true definition of courage, and two hearts who are meant to be together... finally become one.", "hash": "8f7ad0ae-55a7-4b23-94ee-501ae6f12f33"}, {"title": "Covet (Fallen Angels #1)", "author": "J.R. Ward", "pgs": 44, "sum": "Storyline: \nCovet (Fallen Angels #1) Redemption isn't a word Jim Heron knows much about-his specialty is revenge, and to him, sin is all relative. But everything changes when he becomes a fallen angel and is charged with saving the souls of seven people from the seven deadly sins. And failure is not an option. Vin DiPietro long ago sold his soul to his business, and he's good with that-until fate intervenes in the form of a tough-talking, Harley-riding, self-professed savior. And then he meets a woman who will make him question his destiny, his sanity, and his heart-and he has to work with a fallen angel to win her over and redeem his own soul.", "hash": "2733cf0d-4464-4a20-b96d-30ba911bad76"}, {"title": "Crave (Fallen Angels #2)", "author": "J.R. Ward", "pgs": 53, "sum": "Storyline: \nCrave (Fallen Angels #2) Isaac Rothe is a black ops soldier with a dark past and a grim future. The target of an assassin, he finds himself behind bars, his fate in the hands of his gorgeous public defender Grier Childe. His hot attraction to her can only lead to trouble-and that's before Jim Heron tells him his soul is in danger. Caught up in a wicked game with the demon who shadows Jim, Isaac must decide whether the soldier in him can believe that true love is the ultimate weapon against evil.", "hash": "19eefb7f-5f17-40e6-8297-f48fa8134744"}]