[{"title": "Hostile Takeover (Knights of the Board Room #5)", "author": "Joey W. Hill", "pgs": 70, "sum": "Storyline: \nHostile Takeover (Knights of the Board Room #5) Ben is the last unattached member of the five-man executive team of K&A Associates. The other four, all Masters, have found the submissive of their dreams. That’s fine. The sharp-edged lawyer knows he’s the most hardcore of all of them, with extreme tastes as a Master he satisfies physically through experienced club submissives. He doesn’t really need anything more than that. Marcie has loved Ben since she was sixteen. He’s never behaved as anything more than a protective big brother, a family friend. But now she’s twenty three and starting her career as a corporate investigator. She may be a blood-and-bone deep submissive, but she won’t hesitate to use her aggressive talents to prove she’s meant to be his. With a Master as tough as Ben, she’ll have to take whatever measures are needed—even if her deepest desire isn’t a hostile takeover of his heart, but an unconditional surrender to it.", "hash": "849bbb14-8fc5-4958-8683-713cc620d1dd"}, {"title": "Willing Sacrifice (Knights of the Board Room #6)", "author": "Joey W. Hill", "pgs": 71, "sum": "Storyline: \nWilling Sacrifice (Knights of the Board Room #6) Janet Albright prefers her men submissive, her relationships confined to a club environment. Which is why her attraction to former Navy SEAL Maxwell Ackerman doesn’t make a lot of sense. There isn’t a submissive bone in his muscular body, suggesting her interest in the man is best indulged as a private fantasy. When a crisis situation reveals different sides of them both, the attraction becomes mutual and undeniable. Janet and Max take the plunge, willing to see if the give-and-take of their unexpected relationship can satisfy their deepest desires. Until ghosts from their past emerge, threatening to destroy the delicate balance of power before their love can find a way to tip the scales.", "hash": "0ad70573-b774-47a5-86b1-736baf0d7161"}, {"title": "Holding The Cards (Nature of Desire #1)", "author": "Joey W. Hill", "pgs": 21, "sum": "Storyline: \nHolding The Cards (Nature of Desire #1) Lauren is a successful doctor with a healthy attitude toward sex, unashamed of her proclivities as a sexual dominant. She wants love and a family, but she's beginning to believe there is no Mr. Right willing to stand by her in sickness and health...and be cuffed, stripped, and smacked with a riding crop. Then her friend Lisette invites her to spend a long weekend on a private island. It turns out Lisette can't come with her, but Lauren opts to go anyway, with no one for company but Joshua, the island caretaker, and his visiting friend, Marcus. Though both men are beautiful, it is Joshua that catches Lauren's attention, and not just because Marcus prefers men. Something in Josh's stormy eyes calls to her. When Marcus facilitates a game of submission and control between the three of them that will last throughout the weekend, Lauren embraces the opportunity. Josh overwhelms her with his willingness to submit to her body's desires, but her heart wants to get to the secrets behind those eyes. She is going to have to tear down his defenses and make him give her everything. And this is one Mistress who doesn't take no for an answer...", "hash": "700838f0-dc38-4392-bb91-12ea7b8ffd2d"}, {"title": "Natural Law (Nature of Desire #2)", "author": "Bella Forrest", "pgs": 22, "sum": "Storyline: \nNatural Law (Nature of Desire #2) Mackenzie \"Mac\" Nighthorse is a highly respected homicide detective and a career cop. There isn't a dangerous situation that can back him down. However, the personal becomes uncomfortably entangled in the professional when he goes undercover in a high class BDSM club as a male submissive in order to find a Dominatrix who is winning the trust and then murdering her chosen partners. When his path crosses Violet Siemanski's, he realizes he's found a Mistress willing to be his ally in finding the murderess. But Violet is also going to shatter Mac's shields and make him question who he is and what he wants, a challenge more disturbing than any case he's ever worked.", "hash": "5c5fe4d4-7fcc-4197-908e-d9846c98ad99"}, {"title": "Ice Queen (Nature of Desire #3)", "author": "Joey W. Hill", "pgs": 17, "sum": "Storyline: \nIce Queen (Nature of Desire #3) They call her the Ice Queen. At the exclusive BDSM club known as The Zone, Mistress Marguerite is a legend. Tyler Winterman has been fascinated with her since he's known her, though the rules of their world say they shouldn't share more than mutual admiration. He is her male counterpart, one of the most powerful male Doms practicing at The Zone. Due to a computer error, Marguerite lacks the mentoring program stipulation required of all Zone Doms, which includes spending a number of hours learning about BDSM from the submissive's perspective. Tyler considers it an act of fate that Marguerite chooses him to be the Dom who helps her fulfill that requirement. He is convinced she is a \"switch\", a closet submissive, but the truth will be even more remarkable than the theory, changing their lives in ways neither of them anticipates. Having no equal except one another in their skills at stripping a sub's defenses bare, these two Dominants will turn their considerable talents on each other and discover that who is Master and who is slave doesn't matter, not when two souls have found their mate.", "hash": "ed9c1d8d-b6b3-4e34-b83c-fde3796f3e34"}, {"title": "Mirror of My Soul (Nature of Desire #4)", "author": "Joey W. Hill", "pgs": 61, "sum": "Storyline: \nMirror of My Soul (Nature of Desire #4) Some stories can't be contained between the covers of just one book. In Ice Queen, Tyler helped Mistress Marguerite fulfill the mentoring requirement The Zone club imposes on all its Dominant members, to learn about BDSM from the submissive's perspective. Though Marguerite is one of The Zone's most sought-after Mistresses, Tyler is convinced she is a \"switch\", a closet submissive. But the truth that is revealed is more remarkable than that. As he begins to unravel the complex and terrible layers of her past, Tyler must do what he's never been willing to do before. Open up his own soul, offering Marguerite his own dark places in order to help them both heal. Only then will they be able to surrender to a force stronger even than The Zone's most powerful Master and Mistress—a force that can bind them together forever.", "hash": "83dcf68b-36f6-4ee4-ae18-e33265090ea1"}, {"title": "Mistress of Redemption (Nature of Desire #5)", "author": "Joey W. Hill", "pgs": 35, "sum": "Storyline: \nMistress of Redemption (Nature of Desire #5) The white-collar life Jonathan Powell created for himself is gone. Standing outside Wentworth prison after serving his five-year sentence, he knows he has to start over. No more hooking up with Dominant women so he can enjoy the challenge of screwing up their minds. But who knew his last target would be a psychopathic killer who tried to off two cops? No, it wasn't the game that was the problem. He just made some key mistakes. Mistakes he won't make again. Then Mistress Dona shows up to give him a ride from the prison into his new life, and his resolve goes out the window. She's everything he can't resist. Dona knows she has to help Jonathan make the right choice this time, because Hell doesn't offer options. He has to understand and accept what surrender truly means. His only hope is a Mistress of Redemption. The problem is she may lose her own soul in the attempt to save his.", "hash": "ce2059aa-9fa7-407c-a9e6-5239091f7153"}, {"title": "Rough Canvas (Nature of Desire #6)", "author": "Joey W. Hill", "pgs": 23, "sum": "Storyline: \nRough Canvas (Nature of Desire #6) When his father dies, Thomas is forced to abandon a burgeoning art career in New York. As difficult as it was to give up his lifelong dream, it's nothing next to walking away from the man he loves. Marcus taught him to embrace who he is, a sexual submissive who responds to the touch of only one Master. But why would the sophisticated Marcus need some farm kid from the South? Then Marcus shows up and offers him a way to continue his art career and help his family. There's only one hitch-he asks Thomas to spend a week with him in the Berkshires. Thomas knows he should refuse. But he's never been able to say no to his Master.", "hash": "17da2a1e-989b-44e4-9415-e2bc5cd92e59"}, {"title": "Branded Sanctuary (Nature of Desire #7)", "author": "Joey W. Hill", "pgs": 55, "sum": "Storyline: \nBranded Sanctuary (Nature of Desire #7) Chloe has always been a creature of joy and laughter. Since a brutal attack nearly a year ago, the trauma she experienced has gotten worse. She has started hiding from her life, even putting up walls between herself and those she cares about most. During a panic attack one night, she impulsively calls a number that she’s had for many months. Chloe met Brendan at her boss’s wedding. With confidence and seduction, he easily steps into the role of helping her manage her fear. By the end of the long call, they’ve indulged in some serious flirtation and mind-blowing phone sex—and she’s feeling things she’s buried for too long. The problem is that Brendan is the perfect male submissive—and Chloe isn’t wired for the D/s lifestyle. While their attraction is undeniable, Chloe doesn’t know if she can be everything Brendan needs. As a submissive, Brendan would never ask her to be something she’s not—even if it will break both of their hearts to turn away from how they feel about each other.", "hash": "71c9a8f5-a888-40a2-973a-4faa4d85a013"}, {"title": "Sierra Falls (Sierra Falls #1)", "author": "Veronica Wolff", "pgs": 56, "sum": "Storyline: \nSierra Falls (Sierra Falls #1) Sierra Falls, California, is one of those sleepy towns that people choose to leave. Sorrow Bailey chose to stay behind, but has always yearned for more... Family is important to Sorrow. She gave up her dreams to run the struggling family lodge. Even her name is a family relic, though lately it feels like a curse that might determine her fate. Things look up when she discovers a collection of letters from her three-times great-grandmother and namesake, telling the story of a forbidden love affair. Billy Preston is the new sheriff, a widower escaping the grief of his former life as a big-city cop. He helps out after an accident at the Baily lodge, and what begins as admiration for Sorrow's quiet strength quickly becomes something much more. When Sorrow's discovery brings fame to Sierra Falls, and her dreams of a better life are within reach, one too many \"accidents\" have Billy wondering whether someone is willing to kill to keep them off the map. As the community pulls together, Sorrow takes a lesson from her ancestor's letters: Only in family, friends, and love do you find true joy.", "hash": "5647d90c-f8c0-4a23-b2a7-6be37945c8e1"}]