[{"title": "Be Still My Vampire Heart (Love at Stake #3)", "author": "Kerrelyn Sparks", "pgs": 38, "sum": "Storyline: \nBe Still My Vampire Heart (Love at Stake #3) One look at her was enough to stop his heart... If it was still beating. Angus MacKay has been undead for almost five hundred years, and it's not often something, or someone, surprises him. Until Emma Wallace. The sight of this luscious agent from the CIA's elite Stake-Out team was enough to stop Angus in his tracks. But then he discovers that she's a vampire slayer, intent on killing the \"monsters\" who killed her parents. And it's Angus' job to stop her. The only good vampire is a dead vampire. It's been Emma's motto since she committed her life to the destruction of these things. Now Angus MacKay wants to convince her differently. Sure, he's a sexy Highland warrior who seems to have stepped off the cover of a romance novel, complete with brogue, kilt, and sword, but he's also one of them. And it's her job to kill him. The war is on, but will it end in the destruction of one or both of them...or in total surrender to a passion for the ages?", "hash": "2ac5a840-37ce-4ac3-9eb4-b357cc53fdd6"}, {"title": "The Undead Next Door (Love at Stake #4)", "author": "Kerrelyn Sparks", "pgs": 42, "sum": "Storyline: \nThe Undead Next Door (Love at Stake #4) Three signs that something is very different with your new man: 1. He sleeps all day...which would be annoying except he's so attentive at night. 2. He's attacked by sword-wielding assailants, yet insists he can handle it on his own. 3. He never seems to age. Heather Westfield has always lived a quiet life, but that all changes when she helps a very handsome, very mysterious stranger. There's something not quite right about Jean-Luc, but still, she's never been with a man so charming, so attractive...so wonderful. Now if only a murderous villain wasn't after them, they might get their happily-ever-after.", "hash": "dfbdc7fc-f22e-4e16-bbb9-29cc7c98569d"}, {"title": "All I Want for Christmas is a Vampire (Love at Stake #5)", "author": "Kerrelyn Sparks", "pgs": 43, "sum": "Storyline: \nAll I Want for Christmas is a Vampire (Love at Stake #5) Toni Davis's Christmas wish list     1. Springing my best friend from the psych ward.     2. Living somewhere that doesn't have coffins in the basement. Occupied coffins.     3. Finding Mr. Right. Please make him tall, dark, handsome, and alive. This Christmas isn't so merry for Toni. Her best friend's been locked up in a mental hospital ever since she told the police she was attacked by vampires, and the only way for Toni to get her out is to prove that bloodsuckers really do exist. So she's taken a job as a bodyguard for the Undead, but she gets more than she bargained for, especially when she meets Ian MacPhie, a Scottish rascal looking for Ms. Right. Although Ian's nearly five centuries old, he looks and acts like a twenty-seven-year-old hunk. How can a dead man be so damn sexy? Could Mr. Wrong be Mr. Right? One forbidden kiss could lead to an eternity of passion—and all it takes is one moment under the mistletoe . . .", "hash": "ed82b5be-0726-4490-b259-4d91b41ff063"}, {"title": "Secret Life of a Vampire (Love at Stake #6)", "author": "Kerrelyn Sparks", "pgs": 40, "sum": "Storyline: \nSecret Life of a Vampire (Love at Stake #6) Nothing's sexier than an man who can keep a secret. A typical bachelor party is all about beers and beautiful women. A vampire bachelor party is no different -- except the men are drinking Blissky (whiskey-flavored synthetic blood). And no one can throw a party quite like Jack, the illegitimate son of the legendary Casanova. But when the party gets out of hand and the cops show up, Jack has some explaining to do . . . if only he wasn't struck speechless by the beauty of Officer Lara Boucher. Lara is sure there's something more than a bachelor party going on. What is Jack hiding? And why is he so interested in the recent disappearance of young women all over town? Her investigation uncovers more than she wants to know, especially about this modern-day Casanova. But if she's ever to make detective, she'll need to expose all his secrets . . . if only her heart wasn't on the line.", "hash": "7916205c-2436-4f9d-aa41-ac9326d9938e"}, {"title": "Forbidden Nights with a Vampire (Love at Stake #7)", "author": "Kerrelyn Sparks", "pgs": 37, "sum": "Storyline: \nForbidden Nights with a Vampire (Love at Stake #7) Vanda Barkowski is in trouble. As the owner of a hot nightclub, she's more unconventional than most of her fellow vampires, and if some think her a little out of control, then so be it. But after three former employees filed a complaint about her temper, Vanda is sentenced to an anger management class. Worse, Phil Jones agreed to be her sponsor. Phil, the mortal who is forbidden to her . . . If Vanda knew who—or what—Phil really is, she'd reconsider her attraction to him, for his true nature is wilder than anything she'd ever imagined. He has tackled the beast within and now is the perfect person to help Vanda with her rage . . . if only he can keep his cool when she makes him so undeniably hot. But with rogue vamps on the loose, will they ever have their forbidden nights?", "hash": "a0277898-99aa-433e-8c37-6be4cbebf611"}, {"title": "The Vampire and the Virgin (Love at Stake #8)", "author": "Kerrelyn Sparks", "pgs": 39, "sum": "Storyline: \nThe Vampire and the Virgin (Love at Stake #8) Olivia's packing list:     1. Sunscreen     2. Bathing suit     3. Flip-flops FBI psychologist Olivia Sotiris was looking for a cool ocean breeze, sand between her toes, and a break from her crazy, chaotic, and sometimes all-too-dangerous life. But when she escaped to the small Greek island of Patmos, all she got were meddling grandmothers trying to marry her off. Can't they see that none of the men around interests her—except Robby MacKay? Robby's packing list:     1. Synthetic blood     2. More synthetic blood     3. Jogging clothes     (even vamps have to stay in shape!) Robby needs to cool off, too, since all he can think about is revenge on the Malcontent bloodsuckers who once held him captive—but then he meets Olivia, the beauty with wild curls and a tempting smile. When a deadly criminal from a case back home tracks her down, Robby will have to save her life—along with giving her a first time she'll never forget . . .", "hash": "5f034c83-d07a-4c55-bad7-727c0d94da22"}, {"title": "Eat Prey Love (Love at Stake #9)", "author": "Kerrelyn Sparks", "pgs": 37, "sum": "Storyline: \nEat Prey Love (Love at Stake #9) Wanted: Bride. Must love children. Mortals need not apply. Carlos Panterra is looking for a mate, a woman who will love and care for the young orphans he's recently taken under his wing (or paw, as the case may be). When the shape shifter spies the beautiful Caitlyn, it's like sunshine amidst the darkness. At last, he's found the perfect woman, except . . . Caitlyn Whelan is mortal. Worse, her father is the head of a CIA agency bent on hunting the undead. Still, Caitlyn knows that Carlos is the man for her, shape shifter or not. So she jumps at the chance when her sister offers her a job to work with him, determined to show Carlos their attraction is more than just animal magnetism. But danger lurks in the night, and their unleashed, untamed passion might just get them both killed . . .", "hash": "92d83b12-6bb2-40a3-ab50-3af1650f7770"}, {"title": "Vampire Mine (Love at Stake #10)", "author": "Kerrelyn Sparks", "pgs": 32, "sum": "Storyline: \nVampire Mine (Love at Stake #10) Nothing on earth can make this vampire fall in love . . . After 499 years of existence, Connor Buchanan has arrived at an inescapable conclusion: he is a cold-hearted SOB. He's been watching his friends—those poor romantic fools—plummet off the cliff into love like a dazed herd of sheep. But not Connor. He knows that love leads to nothing but heartache. Until Marielle . . . She is an angel cast down from heaven for disobedience. Trapped in mortal form, she finds a protector in Connor, a Scottish vampire haunted by a dark past. Marielle hopes to heal his broken heart and earn her way back home, but suddenly she has these . . . feelings. This strange yet pleasant physical yearning—for a vampire! Is this the work of a demon luring her into hell, or has this angel found heavenly bliss?", "hash": "ac03b1a0-cfb3-4d46-9f00-10bc4d8656f1"}, {"title": "Sexiest Vampire Alive (Love at Stake #11)", "author": "Kerrelyn Sparks", "pgs": 39, "sum": "Storyline: \nSexiest Vampire Alive (Love at Stake #11) He was both a vampire and a playboy . . . and impossible to resist. The secret is out . . . Vampires do exist! When a video reveals to the world that vampires live among us, it's up to \"young\" vamp Gregori Holstein, VP of Marketing, to persuade the U.S. government to declare the video a hoax. But first the president wants a favor, one that requires Gregori to spend forty-eight hours in very close contact with the First Daughter. Abby Tucker would rather spend her nights in a lab than attend her father's state dinners. She's dedicated her life to finding a cure that will save her dying mother and needs only two more ingredients. To find them, she'll have to venture into the most dangerous region of the world—with a vampire. Her Armani-clad escort may be Undead, but he still makes her heart race. And the greatest danger won't be the predatory hordes lying in wait for them; it will be her undying desire for the Sexiest Vampire Alive.", "hash": "2b2fbd85-47df-47ba-89da-ffb992475451"}, {"title": "Wanted: Undead or Alive (Love at Stake #12)", "author": "Kerrelyn Sparks", "pgs": 38, "sum": "Storyline: \nWanted: Undead or Alive (Love at Stake #12) He's a vampire from the big city . . . Phineas McKinney thought New York City was tough, until he was attacked by Malcontents—evil vampires who consider mortals to be snacks. Saved by the good vampires, Phin swore to devote his now undead life to stopping the Malcontents. He's got his job cut out for him when word comes that their enemy may be hiding in Wyoming. What does a city boy like him know about horses and campfires? Good thing he's got Brynley Jones with him . . . if only she didn't hate every vampire on earth. She's a werewolf princess . . . Bryn believes vampires are seductive and charming, and that makes them dangerous. So she's more than a little annoyed about teaming up with Phin, even if he is the only bloodsucker able to make her inner wolf purr. But as they hunt down the new leader of the Malcontents, danger threatens . . . and Phineas and Brynley discover a passion that will rock the foundation of their supernatural world.", "hash": "527ea97f-e3aa-4696-8b9f-1126bb2fc09d"}]