[{"title": "Wild About You (Love at Stake #13)", "author": "Kerrelyn Sparks", "pgs": 37, "sum": "Storyline: \nWild About You (Love at Stake #13) Handsome Howard... Hunky Howard... Hot Howard... It's not every day that Elsa Bjornberg feels delicate, not when she hosts a home renovation show where she can effortlessly demolish a kitchen. But from the moment she meets Howard Barr, this bear of a man makes her feel like a woman. And the way he looks at her, as if she were a pot of honey he'd like to lick... Howard is not like most men. For one thing, he's a shapeshifter. And he always thought his celebrity crush would never amount to anything more than drooling at Elsa on TV. When his meddling vampire employer gets involved, the star is suddenly within his grasp—and within a hair of her life. For an ancient curse forbids their newfound love, and Howard is suddenly torn between his desire for her and his desire to keep her alive.", "hash": "155c5ce5-7b6e-4664-9f44-6253cb4012c7"}, {"title": "Vampires Gone Wild (Love at Stake #13.5)", "author": "Kerrelyn Sparks", "pgs": 29, "sum": "Storyline: \nVampires Gone Wild (Love at Stake #13.5) by Kerrelyn Sparks , Pamela Palmer , Amanda Arista , Kim Falconer V is for VampWoman by Kerrelyn Sparks Pamela decides to shed her prim and proper ways for spandex and a mask to help fight the Malcontents. Now if only she weren't so distracted by the sexy vampire fighting by her side . . . A Forever Love by Pamela Palmer Trapped in Vamp City, Lukas has been unable to return to the beauty who stole his heart. But now that she's stumbled into his world, it will take every ounce of cunning he possesses to keep her alive. First Dates Are Hell by Amanda Arista Valiance's first date in a hundred years is going great . . . until they're attacked in the parking lot and quiet, unassuming Esme turns out to be way more than she appears. Blood and Water by Kim Falconer Beneath the waves of San Francisco Bay lives a vampire race that wants nothing to do with the \"landers\" except to feed on them. But when Stellan sets eyes on Angelina, everything changes.", "hash": "ee0112a5-e58a-450a-af3d-abee30d659ef"}, {"title": "The Vampire With the Dragon Tattoo (Love at Stake #14)", "author": "Kerrelyn Sparks", "pgs": 38, "sum": "Storyline: \nThe Vampire With the Dragon Tattoo (Love at Stake #14) He's Out of Control Dougal Kincaid has something to prove. After being injured in a battle with the Malcontents, he's ready for active duty protecting unsuspecting mortals from these villainous vampires who want to rule the world. But first he has to get control of himself . . . because just the sight of a certain lovely doctor has his injured hand doing some peculiar things, not to mention the sizzling sensation that burns along his dragon tattoo. Vampires? Vampires?! As a scientist, Leah is having trouble believing that these immortal creatures exist. But there they are, standing in front of her, asking for help in solving a genetic puzzle that can save mankind. There's even one in a sexy kilt! Just one look into Dougal's gorgeous green eyes sets her pulse racing. But can she trust him—and the overwhelming desire that refuses to be ignored?", "hash": "adc0983b-d4ca-4dbb-87d9-913160f6db4d"}, {"title": "Ecstasy in Darkness (Alien Huntress #5)", "author": "Gena Showalter", "pgs": 50, "sum": "Storyline: \nEcstasy in Darkness (Alien Huntress #5) Growing up poor on New Chicago’s meanest streets, Ava Sans had two options: be the predator or be the prey. No contest. Now, working for Alien Investigation and Removal, she’s been ordered to capture the biggest, baddest warrior of all—a vampire too beautiful to be real, with the ability to manipulate time. Once the leader of the entire vampire army, McKell has been deemed savage and unstable, spurned even by his own kind. To McKell, humans should be nothing more than sustenance. Yet the petite, golden-skinned Ava is a fascinating contradiction—vicious yet witty, strong yet vulnerable, lethal but fiercely loyal. Against his better judgment, McKell craves that loyalty, and much more. When the chase leads to seduction, McKell and Ava will race to discover the truth about his past. But the answers will come at a price, even for a woman who thought she had nothing left to lose. . . .", "hash": "ac9e6805-1107-4e86-9537-7415bfd00b87"}, {"title": "Desire Untamed (Feral Warriors #1)", "author": "Pamela Palmer", "pgs": 34, "sum": "Storyline: \nDesire Untamed (Feral Warriors #1) They are called Feral Warriors—an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release . . . Kara MacAllister's quiet small-town life is transformed forever the night a powerful stranger rips her from her home, claiming she is the chosen one—the key to his survival. Spiriting her away into the rain-soaked night, Lyon reveals a truth Kara can barely credit. She's immortal, and the only one who can save his race. And deep within her, he arouses a fierce, primal hunger beyond anything she's ever imagined. But only when their lives are threatened by an ancient evil will Kara and Lyon realize they have found a love they would risk their immortal souls to claim . . . and a powerful desire that could never, ever be tamed. And he begins to wonder if the woman who's stolen his heart is destined to be his salvation...or his doom.", "hash": "61505fdd-10ca-4673-8f71-07548f5e93c8"}, {"title": "Obsession Untamed (Feral Warriors #2)", "author": "Pamela Palmer", "pgs": 35, "sum": "Storyline: \nObsession Untamed (Feral Warriors #2) They are called Feral Warriors-an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release . . . Every time she closes her eyes, Delaney Randall suffers another nightmare. A brutal serial killer has found his way inside the tough, take-no-prisoners FBI agent's head. Now she lives the murders through his eyes, from his deadly approach to his victims' screams-until the night he breaks into her apartment and she fears she's going to be the next to die. But the man who snatches Delaney from her home isn't the murderer. He's Tighe, a dangerous Feral Warrior who needs her and her visions to stop the rampages of a creature as inhuman as he is evil. Tighe has little use for humans, but as he and Delaney join forces to track the dark fiend, he falls for the intense beauty and becomes wild with an obsession as untamed as his heart.", "hash": "0464e3af-e590-4a7c-a93f-a5a96e9d15c7"}, {"title": "Passion Untamed (Feral Warriors #3)", "author": "Pamela Palmer", "pgs": 35, "sum": "Storyline: \nPassion Untamed (Feral Warriors #3) Though the Mage witch, Skye, has a gentle heart, demonic forces have enslaved her, forcing her to kidnap Paenther, a powerful and dangerous Feral Warrior. Even chained and naked, Paenther is a cunning prisoner who seduces her, body and soul, turning captive into captor. Paenther's pride demands revenge against the enchantress who emerged from the deep woods like a sensual vision and enthralled him, even as she makes his body burn with passion. Despite his fury over her treachery, Skye's gentle beauty calls to his soul, calming the wild chaos within him, and stealing his heart. But when evil threatens, Paenther and Skye's only chance at survival is to trust in one another...and the power of love.", "hash": "bd8d8d69-1a3f-4418-9d01-d8c8d190f7b7"}, {"title": "Rapture Untamed (Feral Warriors #4)", "author": "Pamela Palmer", "pgs": 33, "sum": "Storyline: \nRapture Untamed (Feral Warriors #4) The most combative—and tormented—of all the Ferals, Jag is a predator who hunts alone - until daemons terrorize the human population. To stop them, he partners with Olivia, a flame-haired Therian temptress as strong as she is beautiful. But Olivia is no ordinary immortal. The survivor of a vicious supernatural attack, she possesses a deadly and forbidden skill— one that must remain hidden, especially from the powerful Feral Warriors. As Jag and Olivia's sensual dance of dominance and seduction gets wilder and hotter, a dark force sets its sights on Olivia, threatening to destroy everything she has vowed to protect. And the only one who can save her soul is the arrogant jaguar shifter she lusts for but dares not love.", "hash": "1407962f-b734-499f-8815-9025d867ed2a"}, {"title": "Hunger Untamed (Feral Warriors #5)", "author": "Pamela Palmer", "pgs": 33, "sum": "Storyline: \nHunger Untamed (Feral Warriors #5) They are called Feral Warriors—an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release . . . For a thousand years she has haunted him—Ariana, Queen of the linas, a beauty of mist and light. His love, his life mate . . . Kougar believed her lost to him forever, until the truth of her stunning betrayal left him bitter and hungry for revenge. Now she alone holds the power to save two trapped and desperate Feral Warriors. Ariana, caught in a deadly battle of her own, is neither the soulless creature Kougar believes her to be nor the savior he seeks. And when darkness threatens to annihilate both races, the greatest danger of all becomes the glorious love Kougar and Ariana once shared. A love that must never rise again. A love that has never died.", "hash": "684360d8-eadc-4155-b019-dec309152bb1"}, {"title": "Ecstasy Untamed (Feral Warriors #6)", "author": "Pamela Palmer", "pgs": 40, "sum": "Storyline: \nEcstasy Untamed (Feral Warriors #6) They are called Feral Warriors—an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release . . . Shattered by recent nightmarish events, Hawke feels his bond with his animal spirit weakening—and once it breaks, he’s finished. The arrival of Faith sends his life spinning even further out of control, for although she delights him and enflames his deepest primal passions, she’s promised to Maxim, the newest Feral Warrior. Faith is drawn to Hawke from the start, but Maxim holds her in his thrall and has secretly bent her to his malevolent will. Though gravely damaged, Hawke is the only one who can end Faith’s slavery and protect the Feral Warriors from Maxim’s evil designs. But first they both must embrace the wild . . . and surrender body and soul to a forbidden, all-consuming ecstasy.", "hash": "68cfa995-03e7-4c96-8885-c3028a5715d1"}]