[{"title": "A Love Untamed (Feral Warriors #7)", "author": "Pamela Palmer", "pgs": 34, "sum": "Storyline: \nA Love Untamed (Feral Warriors #7) The newest member of the elite Feral Warriors brotherhood, Fox is eager to prove himself on the frontlines of battle against the Daemons. When paired with the legendary Ilina warrior, Melisande, he expects the fierce beauty to quickly fall under the spell of his quite considerable charm. Instead, he finds himself spellbound by a woman who's his match in every way. Beneath Melisande's brittle exterior lies centuries of pain and a violent hatred of all shape-shifters—a hatred that slowly crumbles after they're caught in a deadly and cunning Mage trap and she glimpses a surprising depth in her far-too-seductive partner. Their survival demands unconditional trust—and their salvation surrender to a wild, untamed love.", "hash": "ede6d526-6d36-4b3e-9b15-3a2a91cf3dc7"}, {"title": "Wulfe Untamed (Feral Warriors #8)", "author": "Pamela Palmer", "pgs": 37, "sum": "Storyline: \nWulfe Untamed (Feral Warriors #8) They are called Feral Warriors—an elite band of immortals who can change shape at will. Sworn to rid the world of evil, consumed by sorcery and seduction, their wild natures are primed for release... The most enigmatic and tortured of the Feral Warriors, Wulfe is haunted by the quiet beauty of a human woman who no longer remembers him. Once a captive of both the Mage and the Ferals, Natalie stole a piece of his heart before he took her memories and sent her safely back to her fiancé. But now the Mage are threatening her again, and Wulfe will risk anything to protect her. Natalie Cash is stunned when she's saved by a wolf who shifts suddenly into a splendidly built, if badly scarred, man, a man with the kindest eyes. Swept into a world of intrigue and danger beyond her comprehension, she turns to the powerful Wulfe, finding a passion she'd only dreamed of. But when time runs out, they must trust one another and surrender to a wild, untamed love.", "hash": "5c5ce25b-249d-489f-93eb-1d7891205545"}, {"title": "Dark Skye (Immortals After Dark #14)", "author": "Kresley Cole", "pgs": 52, "sum": "Storyline: \nDark Skye (Immortals After Dark #14) ETERNAL OBSESSION As a boy, Thronos, prince of Skye Hall, loved Lanthe, a mischievous Sorceri girl who made him question everything about his Vrekener clan. But when the two got caught in the middle of their families’ war, tragedy struck, leaving Thronos and Lanthe bitter enemies. Though centuries have passed, nothing can cool his seething need for the beautiful enchantress who scarred his body—and left an even deeper impression on his soul. ENDLESS YEARNING Lanthe, a once-formidable sorceress struggling to reclaim her gifts, searches for love and acceptance with all the wrong immortal suitors. But she’s never forgotten Thronos, the magnificent silver-eyed boy who protected her until she was ripped from the shelter of his arms. One harrowing night changed everything between them. Now he’s a notorious warlord with a blood vendetta against Lanthe, hunting her relentlessly. CAN THE HEAT OF DESIRE BURN BRIGHTER THAN VENGEANCE? With their families locked in conflict and battles raging all around them, will Thronos and Lanthe succumb to the brutal chaos that threatens everything they cherish? Or will the fragile bond they formed so long ago spark a passion strong enough to withstand even the darkest doubts?", "hash": "4c3c47e5-1978-4de3-a109-35dc5dc1afad"}, {"title": "A Touch of Midnight (Midnight Breed #0.5)", "author": "Lara Adrian", "pgs": 17, "sum": "Storyline: \nA Touch of Midnight (Midnight Breed 0.5) Savannah Dupree is halfway across the country from her Louisiana bayou hometown, a freshman studying at Boston University on a full scholarship. But academic excellence is only one of Savannah’s gifts. She possesses something even more remarkable than her quick mind and insatiable curiosity for learning. With a simple touch, Savannah can see an object’s past—a skill that puts her life in danger, when her studies bring her into contact with a centuries-old English sword and the secret hidden within the blade’s history: the vicious murders of twin boys by a group of fanged creatures borne of the worst kind of nightmare. In all his three hundred years of living as one of the Breed, vampire warrior Gideon never dreamed he’d see the blade again that spilled his young brothers’ lives ages ago on that blood-soaked night in London. Ever since the boys’ deaths, Gideon’s been on a personal quest to rid the world of Rogue vampires, but now he can’t help wondering if the brutal slayings of his only kin was something more sinister—an act perpetrated by an unknown enemy. An enemy who is apparently living in hiding somewhere in Boston. There’s one certain way to prove Gideon’s suspicion, but it will mean using innocent, gifted Savannah to help uncover the full truth—a truth that will shatter everything she knows about herself and the world around her. And with danger closing in from all sides, the passion that ignites between Gideon and Savannah will tempt them to risk their hearts and lives for a love that might just last an eternity…", "hash": "8d35fed3-6cc4-4acf-abf0-26309922eae4"}, {"title": "Kiss of Crimson (Midnight Breed #2)", "author": "Lara Adrian", "pgs": 39, "sum": "Storyline: \nKiss of Crimson (Midnight Breed #2) He comes to her more dead than alive, a towering black-clad stranger riddled with bullets and rapidly losing blood. As she struggles to save him, veterinarian Tess Culver is unaware that the man calling himself Dante is no man at all, but one of the Breed, vampire warriors engaged in a desperate battle. In a single erotically charged moment Tess is plunged into his world--a shifting, shadowed place where bands of Rogue vampires stalk the night, cutting a swath of terror. Haunted by visions of a dark future, Dante lives and fights like there is no tomorrow. Tess is a complication he does not need--but now, with his brethren under attack, he must shield Tess from a growing threat that includes Dante himself. For with one reckless, irresistible kiss, she has become an inextricable part of his underworld realm...and his touch awakens her to hidden gifts, desires, and hungers she never knew she possessed. Bonded by blood, Dante and Tess must work together to thwart deadly enemies, even as they discover a passion that transcends the boundaries of life itself....", "hash": "609bdb02-4220-4108-bc99-75e9f9d8aec2"}, {"title": "Midnight Awakening (Midnight Breed #3)", "author": "Lara Adrian", "pgs": 37, "sum": "Storyline: \nMidnight Awakening (Midnight Breed #3) With a dagger in her hand and vengeance on her mind, Darkhaven beauty Elise Chase prowls Bostons streets in search of retribution against the Rogue vampires who took from her everything she cherished. Using an extraordinary psychic gift, she tracks her prey, well aware that the power she possesses is destroying her. She must learn to harness this gift, and for that she can turn to only one man the deadliest of the Breed warriors, Tegan. No stranger to loss, Tegan knows Elises pain. He knows fury, but when he slays his enemies it is with ice in his veins. He is perfect in his self-control, until Elise seeks his aid in her personal war. An unholy alliance is forged a bond that will link them by blood and vow and plunge them into a tempest of danger, desire, and the darkest passions of the heart. . . .", "hash": "83557887-c1be-4981-8024-31a7d23fee44"}, {"title": "Midnight Rising (Midnight Breed #4)", "author": "Lara Adrian", "pgs": 37, "sum": "Storyline: \nMidnight Rising (Midnight Breed #4) In a world of shadows and dark, cosuming hungers, desire is the deadliest weapon... For journalist Dylan Alexander, it began with the discovery of a hidden tomb, thrusting her into the center of a gathering storm of violence and secrets. But nothing is as dangerous as the scarred, lethally seductive man who rises from the shadows to draw her into his world of dark desire and endless night. Fueled by pain and rage over a shattering betrayal, the warrior Rio has pledged his life to the war against the Rogues. He will let nothing stand in his way—least of all a mortal woman with the power to expose the entire vampire race. For an ancient evil has been awakened, and a stunning darkness is on the rise. Suddenly Dylan is powerless to resist Rio’s touch, even as she uncovers a shocking link to her own past. And now she must choose: Leave Rio’s midnight realm, or risk it all for the man who has shown her true passion and the infinite pleasures of the heart. . . .", "hash": "1550a397-11dc-4da3-a29b-fb0b676e49ac"}, {"title": "Veil of Midnight (Midnight Breed #5)", "author": "Lara Adrian", "pgs": 38, "sum": "Storyline: \nVeil of Midnight (Midnight Breed #5) Bound by blood, addicted to danger, they'll enter the darkest—and most erotic—place of all. A warrior trained in bullets and blades, Renata cannot be bested by any man—vampire or mortal. But her most powerful weapon is her extraordinary psychic ability—a gift both rare and deadly. Now a stranger threatens her hard-won independence—a golden-haired vampire who lures her into a realm of darkness…and pleasure beyond imagining. A combat-loving adrenaline junkie, Nikolai dispenses his own justice to enemies of the Breed—and his latest quarry is a ruthless assassin. One woman stands in his way: the seductive, cool-as-ice bodyguard, Renata. But Renata’s powers are put to the test when a loved one, a child, is threatened and she’s forced to turn to Niko for help. As the two join forces, as desire fans the flames of a deeper hunger, Renata’s life is under siege by a man who offers the exquisite pleasure of a blood bond—and a passion that could save or doom them both forever.…", "hash": "12e66f9e-ac81-4de8-8b78-898524c071a9"}, {"title": "Ashes of Midnight (Midnight Breed #6)", "author": "Lara Adrian", "pgs": 34, "sum": "Storyline: \nAshes of Midnight (Midnight Breed #6) A woman driven by blood. A man thirsting for vengeance. A place where darkness and desire meet... As night falls, Claire Roth flees, driven from her home by a fiery threat that seems to come from hell itself. Then, from out of the flames and ash, a vampire warrior emerges. He is Andreas Reichen, her onetime lover, now a stranger consumed by vengeance. Caught in the cross fire, Claire cannot escape his savage fury--or the hunger that plunges her into his world of eternal darkness and unending pleasure. Nothing will stop Andreas from destroying the vampire responsible for slaughtering his Breed brethren . . . even if he must use his former lover as a pawn in his deadly mission. Blood-bonded to his treacherous adversary, Claire can lead Andreas to the enemy he seeks, but it is a journey fraught with danger--and deep, unbidden desires. For Claire is the one woman Andreas should not crave, and the only one he's ever loved. A dangerous seduction begins--one that blurs the lines between predator and prey, and stokes the flames of a white-hot passion that may consume all in its path. . . .", "hash": "1dd117b5-660c-4bb8-b32b-95a222d96181"}, {"title": "Shades of Midnight (Midnight Breed #7)", "author": "Lara Adrian", "pgs": 39, "sum": "Storyline: \nShades of Midnight (Midnight Breed #7) In a frozen wilderness steeped in darkness, the lines between good and evil, lover and enemy, are never black or white but drawn in Shades of Midnight. Something inhuman is stalking the frigid Alaskan wilds, leaving unspeakable carnage in its wake. For bush pilot Alexandra Maguire, the killings stir memories of a horrific event she witnessed as a child and evoke in her the inexplicable sense of otherness she has long felt within herself but never fully understood . . . until a darkly seductive stranger with secrets of his own enters her world. Sent from Boston on a mission to investigate the savage attacks and stop the slaughter, vampire warrior Kade has his own reasons for returning to the frigid, forbidding place of his birth. Haunted by a secret shame, Kade soon realizes the stunning truth of the threat he faces–a threat that will jeopardize the fragile bond he has formed with the courageous, determined young woman who arouses his deepest passions and most primal hungers. But in bringing Alex into his world of blood and darkness, Kade must confront both his own personal demons and the even greater evil that could destroy all he holds dear.", "hash": "01386ebf-49f5-4a00-819c-d8bbe2a5d431"}]