[{"title": "Taken by Midnight (Midnight Breed #8)", "author": "Lara Adrian", "pgs": 39, "sum": "Storyline: \nTaken by Midnight (Midnight Breed #8) AT THE CROSSROADS OF DEATH AND DESIRE, A WOMAN TASTES A PLEASURE NO MORTAL IS MEANT TO SURVIVE. In the frozen Alaskan wilderness, former state trooper Jenna Darrow survives an unspeakable breach of body and soul. But with her narrow escape comes an even greater challenge. For strange changes are taking place within her, as she struggles to understand—and control—a new hunger. To do so, she will seek shelter in the Boston compound of the Order, an ancient race of vampire warriors whose very existence is shrouded in mystery. Perhaps the most mysterious of them all is Brock, a brooding, dark-eyed alpha male whose hands hold the power to comfort, heal . . . and arouse. As she recovers under Brock’s care, Jenna finds herself drawn to the Order’s mission: to stop a ruthless enemy and its army of assassins from subjecting Earth to a reign of terror. Yet in spite of their resolve, a purely physical relationship without strings soon binds Brock and Jenna together with a desire fiercer than life and stronger than death itself—until a secret from Brock’s past and Jenna’s own mortality challenges their forbidden love to the ultimate trial by fire.", "hash": "5884641b-118c-4292-b4eb-740854d6075b"}, {"title": "Deeper Than Midnight (Midnight Breed #9)", "author": "Lara Adrian", "pgs": 42, "sum": "Storyline: \nDeeper Than Midnight (Midnight Breed #9) DELIVERED FROM THE DARKNESS, A WOMAN FINDS HERSELF PLUNGED INTO A PASSION THAT IS DEEPER THAN MIDNIGHT. At eighteen, Corinne Bishop was a beautiful, spirited young woman living a life of privilege as the adopted daughter of a wealthy family. Her world changed in an instant when she was stolen away and held prisoner by the malevolent vampire Dragos. After many years of captivity and torment, Corinne is rescued by the Order, a cadre of vampire warriors embroiled in a war against Dragos and his followers. Her innocence taken, Corinne has lost a piece of her heart as well—the one thing that gave her hope during her imprisonment, and the only thing that matters to her now that she is free. Assigned to safeguard Corinne on her trip home is a formidable golden-eyed Breed male called Hunter. Once Dragos’s most deadly assassin, Hunter now works for the Order, and he’s hell-bent on making Dragos pay for his manifold sins. Bonded to Corinne by their mutual desire, Hunter will have to decide how far he’ll go to end Dragos’s reign of evil—even if carrying out his mission means shattering Corinne’s tender heart.", "hash": "0df2a8a3-5694-49c7-8967-f7d75cd333f9"}, {"title": "A Taste of Midnight (Midnight Breed #9.5)", "author": "Lara Adrian", "pgs": 10, "sum": "Storyline: \nA Taste of Midnight (Midnight Breed #9.5) A shimmering holiday gala lights up an ancient castle in the Scottish Highlands, but beautiful widowed Breedmate Danika MacConn feels alone in the crowd. Even among the friends and festivity of the Darkhaven celebration, she can't forget her lost love, a fallen warrior of the Order. Her brief return to her mate's homeland has become treacherous after rejecting the advances of a dangerous Edinburgh crime boss with a taste for blood sport. As Danika seeks to expose the vampire and his dark trade, she discovers an unexpected ally in his forbidding, enigmatic henchman, Brannoc, a man who exudes heat, danger, and dark menace--and seems somehow achingly familiar. Bran has his own reasons for wanting to keep Dani out of his employer's business . . . and his own secrets he means to keep buried. The last thing he needs is to get tangled up with a woman who tempts the wildest part of his Breed nature--especially when that woman is Danika MacConn, the one woman capable of bringing him to his knees.", "hash": "4285539b-19cf-4543-8200-faa6309322d2"}, {"title": "Darker After Midnight (Midnight Breed #10)", "author": "Lara Adrian", "pgs": 49, "sum": "Storyline: \nDarker After Midnight (Midnight Breed #10) After existing in secret for centuries, maintaining a fragile peace with the humans who walk beside them, one single act of retaliation has put the entire vampire nation at risk of discovery. It falls to the Order to stop Dragos, the vampire at the centre of the conflict, before his lust for domination can explode into catastrophe.", "hash": "1ace21e7-308c-48f6-977c-d7d545d438b4"}, {"title": "Edge of Dawn (Midnight Breed #11)", "author": "Lara Adrian", "pgs": 40, "sum": "Storyline: \nEdge of Dawn (Midnight Breed #11) In this pulse-pounding and thrillingly sensual novel, New York Times bestselling author Lara Adrian returns to the mesmerizing world of the Midnight Breed, following new characters into a dark future where an uneasy peace can unravel into war—and a great betrayal can mask an all-consuming love. Twenty years after the terror of First Dawn—when mankind learned that vampires lived secretly among them—the threat of violence reigns as the two species struggle to coexist. The only group preserving the fragile harmony is the Order, an elite cadre of Breed warriors dedicated to protecting humans and vampires alike. And in this precarious world of torn loyalties and shattered trust, Mira, a fiery squad captain, finds that every fight bears an intensely personal cost. Raised among the Order, Mira has always believed in the warrior’s code of swift—and even lethal—justice. But the one thing she desires more than the Order’s hard-won acceptance is Kellan Archer, a sexy but troubled Breed fighter. In love with him since childhood, Mira once broke through his tough exterior during an unexpected night of rapture, but the next day he mysteriously disappeared, never to return. Kellan didn’t think he would ever see Mira again—or have to confront the truth of why he left. After abandoning the Order years ago, he now leads a band of human rebels intent on carrying out their own vigilante rule of law. Yet a high-profile kidnapping assignment brings him face-to-face with the past he sought to avoid, and the striking woman he has tried desperately to forget. And as tensions mount and the risk of bloodshed grows, Kellan and Mira must take sides—between the competing missions that dominate their lives, and the electrifying passion that claims their hearts.", "hash": "981d802a-221f-4acb-978c-c4c40efbad68"}, {"title": "Marked by Midnight (Midnight Breed #11.5)", "author": "Lara Adrian", "pgs": 11, "sum": "Storyline: \nMarked by Midnight (Midnight Breed #11.5) MARKED BY MIDNIGHT (A Midnight Breed Novella) Midnight Breed Series: Book 11.5 Determined to solve a string of brutal slayings in London, vampire warrior Mathias Rowan is forced to seek the help of Nova, a fiery tattoo artist who ignites an unexpected, yet undeniable, passion in the grim Order enforcer. Nova’s shadowy connections and dark talents may be Mathias’s best hope of unmasking a treacherous enemy . . . but falling for a woman with her dangerous past will risk both their hearts and their lives.", "hash": "bf97010f-32c9-4027-b73c-952e66c0c274"}, {"title": "Crave The Night (Midnight Breed #12)", "author": "Lara Adrian", "pgs": 38, "sum": "Storyline: \nCrave The Night (Midnight Breed #12) Born and raised to be an emotionless killing machine, Nathan is one of the most lethal Breed vampires in existence. A key member of the Order—an elite group of warriors charged with protecting both mortals and vampires—Nathan executes each mission with flawless precision and a total lack of mercy. Now he must pursue a powerful, hidden enemy. But Nathan’s hard discipline and training are no match for the fierce pull he feels toward a young woman he has no right to desire—a woman of wealth and high social standing who has long been promised to another Breed male, and who may also prove to be the key to rooting out Nathan’s elusive quarry. Jordana lives a life of glittering privilege as a member of a prominent Breed family in Boston. Surrounded by fine things and fawning admirers, Jordana wants for nothing—until she crosses paths with a dark, intense warrior from the Order and finds herself swept into an impulsive, sizzling kiss that neither of them will forget. As much as she tries to deny her deep feelings for Nathan, Jordana cannot resist the craving to be near him, to break through his forbidding walls and see the man he truly is. But getting close to Nathan will thrust Jordana into a treacherous new world, forcing her to risk all she has and all she knows about herself and her past. And loving this seductive man could be the most dangerous temptation of all.", "hash": "508c9b20-4665-42da-868d-081903dac6cb"}, {"title": "The Rush (The Siren #1)", "author": "Rachel Higginson", "pgs": 43, "sum": "Storyline: \nThe Rush (The Siren #1) A life not her own—A future already decided. Every facet of Ivy Pierce’s life is meticulously planned out and plotted. Cynical and jaded by sixteen, Ivy’s only hope is to escape the legacy she was born into. She has a plan, a carefully thought out, feasible plan. She just has to play by the rules until everything falls into place. Unfortunately as predictable as her life can be, she never sees Ryder Sutton coming. He tumbles into her life unimpressed and untouched by her and the life she lives. He’s an enigma to her. A gorgeous, frustrating, sincere mystery and a complete phenomenon in the ugly world she lives in. What blooms between them is a fiercely intense attraction that cannot be ignored. Even though they would both be better off without each other—Even if both their lives depend on staying apart.", "hash": "b61bafb3-2e84-4b1a-a069-a2d226d6a371"}, {"title": "Night Veil (Indigo Court #2)", "author": "Yasmine Galenorn", "pgs": 39, "sum": "Storyline: \nNight Veil (Indigo Court #2) Eons ago, vampires tried to turn the Dark Fae in order to harness their magic, only to create a demonic energy more powerful than they could have imagined. Quietly amassing their strength for centuries, the Vampiric Fae — led by the merciless Myst, Queen of the Indigo Court — are determined to enslave the world. Only one witch stands in her way.... Cicely Waters had always thought she was simply one of the magic-born — a witch who can control the wind — but when she returned home to New Forest, Washington, she discovered she's also one of the shifting Fae. Now she must perfect her gift. For Myst, Queen of the Indigo Court, has captured Grieve, the Fae prince who holds Cicely's heart. To save both her beloved Grieve and her friend Kaylin — whose demon is waking — Cicely must journey into the heart of the Indigo Court. But even as Cicely gathers strength, old alliances are breaking faith. And new allies, like the hedonistic vampire Lannan Altos, promise to take Cicely down a far darker path than she's ever travelled before.", "hash": "08e9c09e-d60c-4da8-aa0c-fe6b1a4ab277"}, {"title": "Archangel's Kiss (Guild Hunter #2)", "author": "Nalini Singh", "pgs": 48, "sum": "Storyline: \nArchangel's Kiss (Guild Hunter #2) Vampire hunter Elena Deveraux wakes from a year-long coma to find herself changed—an angel with wings the colors of midnight and dawn—but her fragile body needs time to heal before she can take flight. Her lover, the stunningly dangerous archangel, Raphael, is used to being in control—especially when it comes to the woman he considers his own. But Elena has never done well with authority. They've barely begun to understand each other when Raphael receives an invitation to a ball from the archangel, Lijuan. To refuse would be a sign of fatal weakness, so Raphael must ready Elena for the flight to Beijing—and to the nightmare that awaits them there. Ancient and without conscience, Lijuan holds a power that lies with the dead. And she has organized the most perfect and most vicious of welcomes for Elena.", "hash": "0856b210-f64d-4ab8-9442-5d7ab2dc9dc0"}]