[{"title": "Archangel's Consort (Guild Hunter #3)", "author": "Nalini Singh", "pgs": 51, "sum": "Storyline: \nArchangel's Consort (Guild Hunter #3) Nalini Singh steps back into the shadows of her heartbreakingly original world where angels rule, vampires serve, and the innocent can pay the greatest price of all ...Vampire hunter Elena Deveraux and her lover, the lethally beautiful archangel Raphael, have returned home to New York only to face an uncompromising new evil ...A vampire has attacked a girls' school - the assault one of sheer, vicious madness - and it is only the first act. Rampant bloodlust takes vampire after vampire, threatening to make the streets run with blood. Then Raphael himself begins to show signs of an uncontrolled rage, as inexplicable storms darken the city skyline and the earth itself shudders. The omens are suddenly terrifyingly clear. An ancient and malevolent immortal is rising. The violent winds whisper her name: Caliane. She has returned to reclaim her son, Raphael. Only one thing stands in her way: Elena, the consort who must be destroyed ...", "hash": "6e6a68bc-c3bc-4498-b5b6-e35865de316d"}, {"title": "Archangel's Storm (Guild Hunter #5)", "author": "Nalini Singh", "pgs": 51, "sum": "Storyline: \nArchangel's Storm (Guild Hunter #5) With wings of midnight and an affinity for shadows, Jason courts darkness. But now, with the Archangel Neha’s consort lying murdered in the jewel-studded palace that was his prison and her rage threatening cataclysmic devastation, Jason steps into the light, knowing he must unearth the murderer before it is too late. Earning Neha’s trust comes at a price—Jason must tie himself to her bloodline through the Princess Mahiya, a woman with secrets so dangerous, she trusts no one. Least of all an enemy spymaster. With only their relentless hunt for a violent, intelligent killer to unite them, Jason and Mahiya embark on a quest that leads to a centuries-old nightmare… and to the dark storm of an unexpected passion that threatens to drench them both in blood.", "hash": "ae7a44a9-2398-4448-88a2-d3ec1815948a"}, {"title": "Tempting the Beast (Breeds #1)", "author": "Lora Leigh", "pgs": 34, "sum": "Storyline: \nTempting the Beast (Breeds #1) Callan Lyons is a genetic experiment. One of six fighting for freedom and the survival of their Pride. Merinus Tyler is the reporter who will tempt him, draw him, until the fury of the \"mating frenzy\" locks them into a battle of sexual heat there is no escape from. Deception, blood, and the evil Genetics Council are hot on their trail. Callan will use his strength to try and save them both...and do all in his power to keep his woman in the process.", "hash": "8972033b-0e6c-4669-bbc8-725c59142b65"}, {"title": "The Man Within (Breeds #2)", "author": "Lora Leigh", "pgs": 31, "sum": "Storyline: \nThe Man Within (Breeds #2) He had protected her as a child, filled all her teenaged fantasies, and as a woman, he stole her heart. Only to break it. Now, fifteen months later, the news has released. The man she loves is one of the genetically altered Feline Breeds who have shocked the world with their presence. He's also her mate. The mark on her neck attests to that. The fire that rages in her heart and in her body further proves it. But he hadn't wanted her then; does he really want her now? Deceit and treachery, born in the past, now haunt the present as Taber and Roni fight to make sense of a sudden bonding. The mating of heart, body and soul as the man and the beast within merge; both battling the forces raging against the union and dominance over the woman he claimed.", "hash": "4c750325-cd86-4804-bc33-688b3b05ec5f"}, {"title": "Elizabeth's Wolf (Breeds #3)", "author": "Lora Leigh", "pgs": 41, "sum": "Storyline: \nElizabeth's Wolf (Breeds #3) She brought him back from death and made him live again. Dash thought himself alone, a soldier, a fighting machine and no more. Elizabeth made him realize he was a man. Danger surrounds the woman his soul marked as his mate, death and blood and a treachery that goes beyond even his worst nightmares. But he will protect her and what she claims as her own. He was created to kill, trained to do it efficiently, and only a man bound to her, heart and soul, will have the strength to save Elizabeth and her prized possession. He is a lone wolf. A man alone. No pack, no family, no one to call his own until one single, innocent letter awoke Elizabeth's wolf.", "hash": "06a80a11-b3ff-4410-8c9f-4403c648a379"}, {"title": "Kiss of Heat (Breeds #4)", "author": "Lora Leigh", "pgs": 30, "sum": "Storyline: \nKiss of Heat (Breeds #4) They've waited a decade to come together. Long years filled with unbearable pain, and soul-wrenching torment that have changed them both and left wounds that have laid their souls bare. Wounds that stand one chance of healing -- if only they could stop fighting each other long enough for the truth to work its healing balm. Kane, a relentless warrior, lost more than his heart to Sherra in a night of mating passion that marked them both for life. But news of her death ripped his soul apart. For years he has fought to avenge the death of the woman he loved more than his own life, by revealing the deceit and cruelty of the Council that created the Breeds. But Sherra didn't die. In a cruel and evil twist she was convinced by her sadistic handlers that the man she had given her body, heart and soul to had betrayed not only her, but the child she carried -- and lost. Amid the rapidly escalating violence against the Feline Breeds, Kane and Sherra learn that there's more to mating than just the \"heat\", just as there's more to love than just the sex...", "hash": "c31c4666-48c7-4a53-b9fa-7a67af3ddd34"}, {"title": "Soul Deep (Breeds #5)", "author": "Lora Leigh", "pgs": 24, "sum": "Storyline: \nSoul Deep (Breeds #5) Mother Nature has a way of making the most unlikely couples ‘fit’. And what could be more unlikely than a sassy, independent President’s daughter who doesn’t know when to keep her mouth shut and a loner Coyote Breed with a hunger for a cute rosebud mouth that he’s determined to still. The vote for Breed Law is coming down the pike. Kiowa’s job is to watch Amanda, the President’s daughter—look, but not touch. Just make sure the Goof Troop, the Secret Service detail assigned to protect her, do their job until the law is passed. But when they don’t and the bad guys move in to take her out, Kiowa reluctantly slips in to the rescue, snatching her away to safety. But she isn’t going to come easy and it takes more than smooth talking to make her see his point of view. For a man who’s had nothing, Amanda Marion is food for the hunger that has tortured him, the reality to every dream Kiowa never dared believe in. What he feels for her is more than heat, more than love. She breathes life into his hardened heart, melting the icy chill that has protected him all his life, and touches a part of him that he thought had died—his soul. And now he’ll kill anyone who tries to take her away from him. But the one person he can’t fight is Amanda, and when she wants to leave…", "hash": "7fb8f3f6-fcaf-48a3-a085-5a5cc6827397"}, {"title": "The Breed Next Door (Breeds #6)", "author": "Lora Leigh", "pgs": 12, "sum": "Storyline: \nThe Breed Next Door (Breeds #6) An erotic thrill ride through the world of the Breeds from New York Times bestselling author Lora Leigh. New York Times bestselling author Lora Leigh takes the reader on an erotic thrill ride into the world of genetically altered Breeds—and the humans who stir their fiercest desires. An act of violence brings neighbors Lyra and Tarek together, igniting a burning passion that awakens Tarek to his true nature as a Lion Breed. However, Lyra isn’t certain she can handle the mating heat.", "hash": "055b59e8-32c2-4090-89f3-84ab8d155866"}, {"title": "Megan's Mark (Breeds #7)", "author": "Lora Leigh", "pgs": 41, "sum": "Storyline: \nMegan's Mark (Breeds #7) In the first book of her erotic new series, Lora Leigh invites you to an intriguing world where genetically altered Breeds and the humans who created them commingle—and sometimes cross the boundaries of desire… Cursed with the extraordinary power to feel other peoples’ emotions, Megan Fields has tucked herself away in a remote corner of New Mexico, working as a small-town sheriff’s deputy. She finds solace in the silence and heat of the desert. But when Breeds begin dying on her watch, Megan realizes that the secrets from her past can’t stay buried forever. Someone is out for blood—her blood. An arrogant Feline Breed, Braden Arness broods with feral intensity. His mission to solve the mysterious murders brings him to Megan, a woman who accosts his senses like no other. Only with him can she let down her guard—and surrender to the insatiable hunger that wracks her body. But as they team up to hunt the elusive killers, Braden and Megan find themselves becoming the prey…", "hash": "5c7a1dc9-29d7-4a9b-832b-6532faf90be9"}, {"title": "Harmony's Way (Breeds #8)", "author": "Lora Leigh", "pgs": 42, "sum": "Storyline: \nHarmony's Way (Breeds #8)  Sink your fangs into Lora Leigh's series about genetically altered humans with feline DNA. When the Breeds desire the passions of the flesh, they can't help but get frisky... Harmony Lancaster is of the Lion Breed, created to be a huntress with a thirst to kill. But the way she seeks justice outside the law makes her a liability to her own kind. Yet she also possesses information that they need on the existence of the first Leo - who holds the precious secrets of desire. To save her life, Harmony is paired with Sheriff Lance Jacobs, who tries to tame the killer within her, while protecting the gentle woman he longs to possess. But a dangerous cult leader, bent on destroying the Breeds, could change the way Lance looks at Harmony forever...", "hash": "f429b9c4-0543-471f-8c10-63704bd8429b"}]