[{"title": "Tanner's Scheme (Breeds #9)", "author": "Lora Leigh", "pgs": 50, "sum": "Storyline: \nTanner's Scheme (Breeds #9) A sexy paranormal series set in a world where genetically altered Breeds and the humans who created them sometimes come together in the fiercest of passions. After the Feline Breeds' main base is attacked, Tanner desires revenge. So he kidnaps Scheme Tallant-the daughter of a one-time high-ranking member of the Genetics Council. But when Tanner discovers that Scheme herself is a target of her father's ruthless mission, his vengeance takes a back seat to saving the life of the woman he hopes to claim as his mate.", "hash": "b0c0ff8c-62cf-4bf7-9f9c-44bd86c51ad1"}, {"title": "Wolfe's Hope (Breeds #10)", "author": "Lora Leigh", "pgs": 6, "sum": "Storyline: \nWolfe's Hope (Breeds #10) Hope believed Wolfe was dead, but he was only waiting for the right time to claim her. The scientist who created him, Hope's mother, has forced his hand. She wants her creation back, and she wants any children he may breed on her daughter. He is a man whose DNA was altered, infused with the genetic code of the wolf. His unique genetic makeup has created a male unlike any other and will make itself known in the most surprising ways. Now Hope must convince her mate she hasn't betrayed him, and they must defeat the plans of a scientist gone mad.", "hash": "8d1e9a92-496d-4ab9-ab2e-75efd6eaa0bb"}, {"title": "Jacob's Faith (Breeds #11)", "author": "Lora Leigh", "pgs": 34, "sum": "Storyline: \nJacob's Faith (Breeds #11) They are a new breed, a new race. Engineered rather than born, trained rather than raised, and their unique genetics have created more than one surprise... Jacob left Faith six years before, unaware that the mark he left on her also left her in an agony of sexual heat that never dimmed. Now Jacob and Faith are together again, but surprises lurk around every corner and dangers as dark and deadly as their very creation surround them in more ways than one.", "hash": "aa47e0c1-8bdc-493a-b58f-4061a9365be4"}, {"title": "Aiden's Charity (Breeds #12)", "author": "Lora Leigh", "pgs": 29, "sum": "Storyline: \nAiden's Charity (Breeds #12) The forces of survival and destruction swirl in the darkest corners of men's minds. The nature of the beast cannot be harnessed, and survival is the purest of all instincts. Survival of the species itself goes soul deep. But can the human heart accept and adapt as easily? Can Charity bestow the love and the acceptance that has always been a part of her, to the man whose very survival depended on the hardening of his heart, of his soul? And can Aiden maintain that cruelty now, in the face of the sacrifices she made? Only time and nature can tell.", "hash": "43572ce2-8f0e-4a8b-a1d1-1df70550137a"}, {"title": "In a Wolf's Embrace (Breeds #13)", "author": "Lora Leigh", "pgs": 17, "sum": "Storyline: \nIn a Wolf's Embrace - Beyond the Dark (Includes: Tale of the Demon World, #5; Breeds, #13) A daring collection of never-before-published erotic desire from four of the hottest names in paranormal romance. Four of the most sizzling authors of paranormal romance take readers beyond their wildest fantasies, to a seductive midnight world of erotic suspense, demons, mages, vampires, and knights. A world of queens with devilish secrets, and of demons with secret desires. So dangerous and fun, readers may never want to come back down to earth again...", "hash": "9160af51-b9e9-4bcc-abc5-17e5e6fe2f96"}, {"title": "Kiss The Night Goodbye (Nikki & Michael #4)", "author": "Keri Arthur", "pgs": 31, "sum": "Storyline: \nKiss The Night Goodbye (Nikki & Michael #4) Sometimes the past not only haunts, but destroys... One hundred years ago, Michael Kelly hunted down and killed the sorcerer responsible for murdering his lover. Now the brother of that man is out for revenge, and he intends to destroy all that Michael holds dear in the process. Nikki James wants nothing more than to pass the Circle's strict entry exams so she can get on with the business of planning her wedding to Michael. But when one of the testers attempts to kill her, she realises buying a wedding dress is the least of her worries. Especially when Michael is shot and kidnapped. The trail leads her to the ghost town where Michael had once killed a madman. She's not surprised to discover that Weylin Dunleavy, the brother of that long ago murderer, has set in place events that will mirror the past in order to raise his brother's spirit from hell. Nor is she truly surprised to discover that a barrier of magic surrounds the old town, leaving her to battle Weylin with only her wits, strength and the one psychic gift she cannot fully control. The one thing that does surprise, the one thing she cannot accept, is the fact that Michael no longer remembers who she is...", "hash": "74bb68c9-fdc2-4a26-a3fb-c49757ba96b9"}, {"title": "Hotter After Midnight (Midnight #1)", "author": "Cynthia Eden", "pgs": 35, "sum": "Storyline: \nHotter After Midnight (Midnight #1) A Seductive Nighttime World. . . Dr. Emily Drake's psychotherapy patients tend to be a little unusual. Instead of midlife crises and mother fixations, Emily treats vampires with blood phobias and sex-demons looking for meaningful relationships. But healing these powerful beings requires an important rule: Never trust a shifter. Especially not one like Detective Colin Gyth, whose gold-flecked eyes and predatory air make Emily realize how much she longs to lose control. . . A Dark And Dangerous Hunger. . . Colin can't believe the doctor he has to work with on the Night Butcher murder case is the one person who could expose his true identity as a wolf shifter. Smart and sexy, Emily brings out the alpha male in Colin, unleashing a wild desire that takes them both over the edge. . . But in the shadows, the Night Butcher waits, eager to spill Emily's blood and taste her terror. And he'll use any means to destroy her, including the one person she has grown to trust. . . \"Highly sensual and definitely dangerous.\" --Shannon McKenna \"A cross between \"CSI\" and \"Medium, \" only hotter and with a hero that truly has bite!\" --Jacquelyn Frank", "hash": "501c0ab4-29fd-4ba4-acb4-07a2a3e75b34"}, {"title": "Midnight Sins (Midnight #2)", "author": "Cynthia Eden", "pgs": 41, "sum": "Storyline: \nMidnight Sins (Midnight #2) Cara Maloan doesn’t look like a monster. In fact, the gorgeous blond nightclub singer possesses heavenly attributes that make Atlanta detective Todd Brooks sure there’s a higher power somewhere. But a twisted killer is leaving a trail of bodies in seedy hotel rooms across town. The male victims show no wounds–it’s as if the life was simply drained from them. And right now, mysterious Cara is Todd’s only suspect. Cara knows it’s foolish to be so drawn to a man who thinks she’s a murderer. She also knows Detective Brooks would find the truth even harder to swallow. Cara is one of the Other, a race of powerful, paranormal creatures who live among humans. Cara’s particular abilities make men putty in her hands–all except this rugged, sexy-as-hell detective. But now someone, or something, has singled Cara out for serious payback… As uneasy trust gives way to mind-blowing desire, Cara and Todd will go head-to-head with a killer whose mission is deeply personal, and who’s determined to serve up revenge that’s hotter than hellfire, and just as deadly…", "hash": "2710f126-41fd-44d5-98a9-bfebeff8dc82"}, {"title": "Midnight's Master (Midnight #3)", "author": "Cynthia Eden", "pgs": 37, "sum": "Storyline: \nMidnight's Master (Midnight #3) In a world of shadows, desire conquers all… Tall, dark, and formidable, Niol Lapen is the last demon on earth most people would ask for a favor, yet the sexy little reporter who wanders into his club dares to do exactly that. Holly Storm already knows too much about his kind, and Niol has no wish to help her get in deeper over her head. But working alongside her may be the only way to stop a killer, even as it ignites a primal desire unlike anything he’s known. Holly has seen firsthand what Niol is capable of, but that doesn’t frighten her nearly as much as her body’s instinctive reaction to him, or the wild, fierce passion that would tempt her to follow him through hell itself. Something evil and relentless is prowling the streets of Atlanta. And as Holly’s search leads her into danger that even Niol could never have predicted, she’ll uncover a secret that could rip her world apart…", "hash": "cee79b2e-bc22-4fd2-93af-e55298b2c804"}, {"title": "Bound By Blood (Bound #1)", "author": "Cynthia Eden", "pgs": 12, "sum": "Storyline: \nBound By Blood (Bound #1) It’s an Immortal War… Vampires and werewolves have been blood enemies for centuries, but now a new threat is rising...demons are escaping from hell and those demons are intent on wiping out both the vamps and the werewolves. When you have no one to trust… In order to stop the demons, pureblood vampire princess Morgan LaBeaux agrees to the treaty offered by werewolf alpha Jace Vaughn. She'll mate with him, share her blood with him...and in return, the wolves will aid the vampires in this battle. The enemy of my enemy is my husband… But Morgan doesn’t realize just how dangerous the wolves can truly be. Jace has been waiting years to claim her. He’s set a trap for his princess, and now that he has her, Jace doesn’t plan to let her go. He’ll send the demons back to hell, and he’ll keep his vampiress—forever. Because the blood binds all. Warning: This novella is a sexy paranormal romance. As such, it contains vampires, werewolves, and demons—oh, my! It also contains hot sex and adult language. You have been warned!", "hash": "f681da9e-9016-4e3e-a82c-5a0db8295e6e"}]