[{"title": "Bound in Darkness (Bound #2)", "author": "Cynthia Eden", "pgs": 10, "sum": "Storyline: \nBound in Darkness (Bound #2) Hunter... When it comes to killing vampires, werewolf Cade Thain is the best slayer in the Northwest. So when a witch hires him to take out a pureblood vamp, the assassin thinks it will be just business as usual. One less vicious vamp on the streets... one more undead parasite gone from the earth. Then he meets her. Protector... Allison Gray isn't the prey that Cade expects. Beautiful, innocent, she stirs a dark desire within him. Allison hasn't transformed fully into a vampire, not yet, and it's Cade's job to make sure that she never does. Allison thinks that he's at her side to keep her safe, but Cade is supposed to pick the right moment --and kill her. Lover... Killing Allison is soon the last thing that Cade plans. As she begins the transformation that will turn her into a vampire, her bloodlust and their desire merge in an explosion of need that neither can control. But Allison's enemies are closing in, and the coming battle will take Cade and Allison beyond life, beyond love... and into a deadly darkness that waits to claim them both. Bound in Darkness. Warning: This novella is a sexy paranormal romance. As such, it contains blood, sex, vampires, and a hot alpha werewolf. Violence and adult language? Yes, those are included, too.", "hash": "9ed098de-a0ac-4cf2-8fcc-4f137a5cfed7"}, {"title": "Bound in Sin (Bound #3)", "author": "Cynthia Eden", "pgs": 10, "sum": "Storyline: \nBound in Sin (Bound #3) What’s the price of sin? Human Paige Sloan once loved werewolf Drake Wyler more than life, but then that life was taken away from her. Attacked by vampires, Paige was bitten, and, on a cold, dark night, the life she’d known ended. She was reborn as a vampire—a werewolf’s deadliest enemy. Paige ran from the vampires who attacked her, and she ran away from her lover. She didn’t want Drake to know what she’d become, and she didn’t want to face the fury of his pack. But a girl can only run for so long until the past catches up with her. Some sins mark your soul. When Paige learns that Drake is being targeted for death, she knows that she can’t hide in the shadows any longer. She has to return to him, and she will do anything—anything—in order to make sure that he keeps living. The vampires might have destroyed her chance to live and love Drake, but they won’t take him. Not over her undead body. She’ll slay them all…and maybe, just maybe…she’ll even have the chance to sin—one more time--with the werewolf who’d marked her as his mate. Some sins are worth dying for…", "hash": "fe7a2a74-7341-4337-98e8-3f6b36288a09"}, {"title": "Bound by the Night (Bound #4)", "author": "Cynthia Eden", "pgs": 14, "sum": "Storyline: \nBound by the Night (Bound #4) For the last fifteen years, vampire queen Iona has been dead to the world. Trapped under the power of a brutal curse, she has been helpless. A prisoner, locked within her own still body. Then alpha werewolf Jamie O’Connell fights his way to her side. After defeating the guards that surround her, Jamie gives Iona his blood…and she rises. The world has changed a great deal in the last fifteen years, and Iona has changed, too. Once known as the Blood Queen because of her dark reputation, she now finds herself longing for the blood of only one man…only he isn’t just a man. She wants the blood of her werewolf—Jamie’s blood. But Iona doesn’t realize that Jamie has been keeping secrets from her. Very dark, dangerous secrets. And Iona may have traded one curse for another. Now that he has Iona, Jamie vows to never let her go. He needs his Blood Queen in order to defeat his enemy, he needs her to make his own beast stronger, and…he just needs her. Jamie has risked his life to claim Iona, and he won’t let anything break their bond. Not time. Not spells. Not even a wild and reckless vampire queen… Warning: This is a hot vampire and werewolf romance novella...so in this story, you will find danger, lust, adult language and adult sexy times.", "hash": "c0e53ea1-7a14-412b-9520-6c55aacf984e"}, {"title": "Bound In Death (Bound #5)", "author": "Cynthia Eden", "pgs": 27, "sum": "Storyline: \nBound In Death (Bound #5) She can’t remember him… He can never forget her. For over two hundred years, alpha werewolf Alerac O’Neill has been searching for his mate, Keira McDonough, a woman who was taken from him and imprisoned by a dark vampire master. He’s hunted for her, endlessly, using vampire blood to extend his life. He has become a vicious predator, feared by all the supernaturals. His hold on reality seems to slip more each day because he is consumed by her. Only…the woman he discovers in a small Miami bar isn’t the Keira that he remembers. In fact, this woman doesn’t remember anything. She calls herself Jane Smith, and she has no memory at all of Alerac—or of her own past. Now that she’s been found, Alerac knows that his enemies are going to start closing in on her. Jane may try to act human, but she’s not. She’s a pureblood vampire princess, incredibly powerful and incredibly valuable. His enemies want to use her, her enemies want to destroy her, and Alerac—he just wants her. If he can’t make her remember him, then Alerac has to seduce Jane into loving him once again. Because now that he’s found her, he’ll fight hell—and every sadistic vampire that stalks the night—in order to keep her safe at his side. Some bonds go deeper than the flesh. Some go beyond life. Beyond death. Jane will soon learn that a werewolf’s claiming…is forever", "hash": "f17aa17b-16f8-4c74-8f8b-51f07b14b47d"}, {"title": "The Darkest Kiss (Riley Jenson Guardian #6)", "author": "Keri Arthur", "pgs": 36, "sum": "Storyline: \nThe Darkest Kiss (Riley Jenson Guardian #6) Danger turns her on. Desire turns her dangerous... Riley Jenson hunts evildoers- and does it with a style all her own. With vamp blood coursing her through her veins, and a werewolf's uncanny instinct for danger, Riley wears snakeskin stilettos and pure, in-your-face attitude when she plunges into her latest case: hunting down a killer whose victims are high-society strumpets- and the rich and powerful men they've dated. But for Riley, the case takes a chilling turn when a second killer starts trailing mutilated bodies of his own: a crazed young vamp choosing victims from a past marked by tragedy. Riley knows she's got the skill and cunning to catch two serial killers at once... until one of them strikes inside her own tight-knit clan and a sexy beast of a vampire reenters her life to aid in the hunt. His name is Quinn. He's lived forever, shed blood, and shared pleasure... and he's the only man over whom Riley has absolutely no control...", "hash": "3157386b-c5e4-4a6c-beb8-afff76527997"}, {"title": "Deadly Desire (Riley Jenson Guardian #7)", "author": "Keri Arthur", "pgs": 36, "sum": "Storyline: \nDeadly Desire (Riley Jenson Guardian #7) Seduction that kills. Pleasure to die for. She just can't resist.... Guardian Riley Jensen always seems to face the worst villains. And this time's no different. For it's no ordinary sorceress who can raise the dead to do her killing. But that's exactly what Riley expects to find at the end of a trail of female corpses used - and discarded - in a bizarre ritual of evil. With pressure mounting to catch one fiend, another series of brutal slayings shocks the vampire world of her lover, Quinn. So the last thing Riley needs is the heat of the upcoming full moon bringing her werewolf hormones to a boil---or the reappearance of a sexy bounty hunter, the rogue wolf Kye Murphy. Riley has threatened Murphy with arrest if he doesn't back off the investigation, but it's Riley who feels handcuffed by Kye's lupine charm. Torn between her vamp and wolf natures, between her love for Quinn and her hots for Kye, Riley knows she's courting danger and indulging the deadliest desires. For her hunt through the supernatural underworld will bring her face-to-face with what lurks in a darkness - where even monsters fear to tread.", "hash": "0b4ece99-bb8c-46d1-a8f1-b817be00a4ae"}, {"title": "Bound to Shadows (Riley Jenson Guardian #8)", "author": "Keri Arthur", "pgs": 35, "sum": "Storyline: \nBound to Shadows (Riley Jenson Guardian #8) In the darkness, demons come out to play . . . and someone must bring their sins to light. Part vampire, part werewolf, Riley Jenson knows what can happen when vamps don't play well with others. But she's never seen anything like this: a series of brutal murders surrounding the latest hot spot for vampire-human hookups—and the victims aren't just killed, they're beheaded. Now Riley is launching into action, toying with a seductive—and highly suspicious—club owner, and finding herself in the middle of another mystery: women being killed one by one without a trace of violence. For Riley, solving multiple cases—in a world going mad with human and vampire passions—would have been tough enough. Instead, she has two jealous lovers on her hands: Kye Murphy, the amber-eyed werewolf who makes Riley's wolf blood howl—and Quinn, the cool, elegant vamp who has over a thousand years' experience at fulfilling women's desires. While she's busy juggling these two sexy beasts, Riley's detective work takes a stunningly violent turn. Finding a murderer is now a matter of life and death. Especially since the killer has long since found her...", "hash": "358334e7-3234-450a-86fa-796eb1746b35"}, {"title": "Moon Sworn (Riley Jenson Guardian #9)", "author": "Keri Arthur", "pgs": 41, "sum": "Storyline: \nMoon Sworn (Riley Jenson Guardian #9) Some nights never end. Some desires never die. . . . She ventures where no one else dares—into realms of peril and pleasure. But will this next journey be her last? Shape-shifting werewolf and vampire Riley Jenson is through with death–causing it, solving it, surviving it. Her soul mate, Kye Murphy, is dead–and at Riley’s own hands. Not even the seductive embrace of her vampire lover, Quinn, can fully ease her mind, for she has begun questioning everything that makes her Riley–including her job at the Directorate. Now, the ritualistically slain bodies of ex-cons have started turning up. Reluctantly, Riley takes the case, but something even worse is waiting in the wings. For a vicious enemy from her past is determined to strip Riley of everything that gives her life any meaning: her lover, her brother–and even her own identity. Can Riley survive this ultimate assault? All she knows is, she must fight one last time to find answers, before everything goes dark forever…", "hash": "633e1bc3-6bcd-408d-a816-6ec25395d6af"}, {"title": "Nice Girls Don't Have Fangs (Jane Jameson #1)", "author": "Molly Harper", "pgs": 50, "sum": "Storyline: \nNice Girls Don't Have Fangs (Jane Jameson #1) Maybe it was the Shenanigans gift certificate that put her over the edge. When children's librarian and self-professed nice girl Jane Jameson is fired by her beastly boss and handed twenty-five dollars in potato skins instead of a severance check, she goes on a bender that's sure to become Half Moon Hollow legend. On her way home, she's mistaken for a deer, shot, and left for dead. And thanks to the mysterious stranger she met while chugging neon-colored cocktails, she wakes up with a decidedly unladylike thirst for blood. Jane is now the latest recipient of a gift basket from the Newly Undead Welcoming Committee, and her life-after-lifestyle is taking some getting used to. Her recently deceased favorite aunt is now her ghostly roommate. She has to fake breathing and endure daytime hours to avoid coming out of the coffin to her family. She's forced to forgo her favorite down-home Southern cooking for bags of O negative. Her relationship with her sexy, mercurial vampire sire keeps running hot and cold. And if all that wasn't enough, it looks like someone in Half Moon Hollow is trying to frame her for a series of vampire murders. What's a nice undead girl to do?", "hash": "763ccc2c-3df6-4ccb-ac58-b39c8098e04d"}, {"title": "Nice Girls Don't Date Dead Men (Jane Jameson #2)", "author": "Molly Harper", "pgs": 40, "sum": "Storyline: \nNice Girls Don't Date Dead Men (Jane Jameson #2) Following Nice Girls Dont Have Fangs, the second in a hilarious, smart, sexy romantic series about an out-of-work librarian who is turned into a vampire. With her best friend Zebs Titanic-themed wedding looming ahead, new vampire Jane Jameson struggles to develop her budding relationship with her enigmatic sire, Gabriel. It seems unfair that shes expected to master undead dating while dealing with a groom heading for a nuptial nervous breakdown, his hostile werewolf in-laws, and the ugliest bridesmaid dress in the history of marriage. Meanwhile, the passing of Janes future step-grandpa puts Grandma Ruthie back on the market. Her new fiance;, Wilbur, has his own history of suspiciously dead spouses, and he may or may not have died ten years ago. Half-Moon Hollows own Black Widow has finally met her match. Should Jane warn her grandmother of Wilburs marital habits or let things run their course? Will Jane always be an undead bridesmaid, never the undead bride? Combining Mary Janice Davidsons sass and the charm of Charlaine Harris's Sookie Stackhouse novels, this is an incredibly satisfying read for fans of paranormal romantic comedy.", "hash": "f0396b23-8973-498f-8509-695ad2b27612"}]