[{"title": "Nice Girls Don't Live Forever (Jane Jameson #3)", "author": "Molly Harper", "pgs": 40, "sum": "Storyline: \nNice Girls Don't Live Forever (Jane Jameson #3) Nothing sucks the romance out of world travel like a boyfriend who may or may not have broken up with you in a hotel room in Brussels. Jane Jameson’s sexy sire, Gabriel, has always been unpredictable. But the seductive, anonymous notes that await him at each stop of their international vacation, coupled with his evasive behavior over the past few months, finally push Jane onto the next flight home to Half Moon Hollow — alone, upset, and unsure whether Gabriel just ended their relationship without actually telling her. Now the children’s-librarian-turned-vampire is reviving with plenty of Faux Type O, some TLC from her colorful friends and family, and her plans for a Brave New Jane. Step One: Get her newly-renovated occult bookstore off the ground. Step Two: Support her best friend, Zeb, and his werewolf bride as they prepare for the impending birth of their baby . . . or litter. Step Three: Figure out who’s been sending her threatening letters, and how her hostile pen pal is tied to Gabriel. Because for this nice girl, surviving a broken heart is becoming a matter of life and undeath...", "hash": "e65ce445-efe8-415d-a8e4-27b536cc7e74"}, {"title": "How to Flirt with a Naked Werewolf (Naked Werewolf #1)", "author": "Molly Harper", "pgs": 42, "sum": "Storyline: \nHow to Flirt with a Naked Werewolf (Naked Werewolf #1) Northern Exposure Even in Grundy, Alaska, it's unusual to find a naked guy with a bear trap clamped to his ankle on your porch. But when said guy turns into a wolf, recent southern transplant Mo Wenstein has no difficulty identifying the problem. Her surly neighbor Cooper Graham, who has been openly critical of Mo's ability to adapt to life in Alaska, has trouble of his own. Werewolf trouble. For Cooper, an Alpha in self-imposed exile from his dysfunctional pack, it's love at first sniff when it comes to Mo. But Cooper has an even more pressing concern on his mind. Several people around Grundy have been the victims of wolf attacks, and since Cooper has no memory of what he gets up to while in werewolf form, he's worried that he might be the violent canine in question. If a wolf cries wolf, it makes sense to listen, yet Mo is convinced that Cooper is not the culprit. Except if he's not responsible, then who is? And when a werewolf falls head over haunches in love with you, what are you supposed to do anyway? The rules of dating just got a whole lot more complicated. . . .", "hash": "5e28047f-b296-4606-973a-2127d1cbe860"}, {"title": "The Art of Seducing a Naked Werewolf  (Naked Werewolf #2)", "author": "Molly Harper", "pgs": 39, "sum": "Storyline: \nThe Art of Seducing a Naked Werewolf (Naked Werewolf #2) Baring It All Generations of werewolves have been secretly residing in a secluded valley a stone's throw from Grundy, Alaska. So when a snooping Outsider comes to Grundy to investigate rumors of lycanthropic shenanigans in the area, the valley's pack alpha, Maggie Graham, resolves to chase him away, even if doing so takes a quick bite on the butt. What a pity that researcher Nick Thatcher turns out to be so drool-worthy, and that his kisses make Maggie want to sit up and beg. Maggie just can't seem to convince Nick to leave . . . and even worse, she can't convince \"herself \"to stay away from \"him. \"Cross-species dating is problem enough for a harried alpha female, but on top of that, a rival group of werewolves is trying to move into the valley. With interpack war threatening, Maggie can't afford to be distracted. Combining romance and a career can be tough for anyone; for a werewolf in love with a human, it may be disastrous. . . .", "hash": "121de1ad-38aa-4c02-b102-023600ba73dc"}, {"title": "How to Run with a Naked Werewolf (Naked Werewolf #3)", "author": "Molly Harper", "pgs": 32, "sum": "Storyline: \nHow to Run with a Naked Werewolf (Naked Werewolf #3) Down, Boy Anna Moder has just witnessed a shooting, seen her car pulverized, and rescued a wounded stranger only to discover he's really a werewolf. And by her recent standards, things are actually looking up. Lycanthropes don't faze Anna. Doctoring a wolf pack outside Grundy, Alaska, is the closest thing to home life she's known in years. But hitching a ride to Anchorage with long-absent pack member Caleb Graham that's a risk. Part of her itches to whack his nose with a newspaper. The rest is trying unsuccessfully to keep her own paws off every delicious inch of him. The problem is, Caleb employs his lupine tracking abilities as a notquite-legal bounty hunter, and Anna is suspicious of both him and his profession. On the run from her past, with old problems closing in, she'd like to stay far, far away from anybody with connections to the law. Caleb, however, seems determined to keep her close. Are his intentions noble, or is he working a more predatory angle? Anna's been dreaming of returning to a semi-normal life, but now she's experiencing a strange new urge . . . to join Caleb in running with the wolves.", "hash": "daf9c836-16e5-44a4-8cad-76d895dc9d11"}, {"title": "The Care and Feeding of Stray Vampires (Half Moon Hollow #1)", "author": "Molly Harper", "pgs": 43, "sum": "Storyline: \nThe Care and Feeding of Stray Vampires (Half Moon Hollow #1) Iris Scanlon, Half-Moon Hollow’s only daytime vampire concierge, knows more about the undead than she’d like. Running all their daylight errands—from letting in the plumber to picking up some chilled O neg—gives her a look at the not-so-glamorous side of vampire life. Her rules are strict; relationships with vamps are strictly business, not friendship—and certainly not anything else. But then she finds her newest client, Cal, poisoned on his kitchen floor, and only Iris can help. Cal - who would be devastatingly sexy, if Iris allowed herself to think that way - offers Iris a hefty fee for hiding him at her place until he figures out who wants him permanently dead. Even though he’s imperious, unfriendly and doesn't seem to understand the difference between \"employee\" and \"servant,\" Iris agrees, and finds herself breaking more and more of her own rules to help him - particularly those concerning nudity. Turns out what her quiet little life needed was some intrigue & romance—in the form of her very own stray vampire.", "hash": "03ea57f7-b976-4a42-8fc9-7084de97dd55"}, {"title": "Driving Mr. Dead (Half Moon Hollow #1.5)", "author": "Molly Harper", "pgs": 24, "sum": "Storyline: \nDriving Mr. Dead (Half Moon Hollow #1.5) HELL ON WHEELS After failing as a magician's assistant, a photographer, and most recently, a bride, Miranda Puckett takes a position as a driver for Beeline, Half-Moon Hollow's premiere vampire concierge service. Miranda's assignment? Driving Collin Sutherland, the world's most fastidious vampire from Washington to Kentucky, so he can deliver a mysterious black case to Council official Ophelia Lambert. Collin, a paranoid, aristocratic vampire with a debilitating fear of flying, refuses to let the case out of his sight. Miranda needs this time on the road to decide whether to permanently cut her ties with the fiance that had an \"emotional affair\" with a childhood pal, but Collin’s neatnik tendencies are driving her around the bend. The man acts as if leaving a fast food wrapped on the passenger seat is reason for a full-on CDC de-contamination scrub-down of the car. All she can do is promise to stop intentionally doing the things that make his stiff upper lip twitch with irritation. As more and more mishaps occur on the road trip from hell, Miranda and Collin work together to meet his delivery deadline. Hotel rooms are destroyed. Beloved cars are defiled. And somewhere along the line, client-driver hostilities become snarky flirtation. Will Collin and Miranda make it to the Hollow in one piece? And if they do, will Miranda leave old, safe relationships behind for something new and well, just plain weird?", "hash": "52250f41-74ad-4905-bfc2-9bd4e45d8f4c"}, {"title": "A Witch's Handbook of Kisses and Curses (Half Moon Hollow #2)", "author": "Molly Harper", "pgs": 41, "sum": "Storyline: \nA Witch's Handbook of Kisses and Curses (Half Moon Hollow #2) Nola Leary would have been content to stay in Kilcairy, Ireland, healing villagers at her family’s clinic with a mix of magic and modern medicine. But a series of ill-timed omens and a deathbed promise to her grandmother have sent her on a quest to Half-Moon Hollow, Kentucky, to secure her family’s magical potency for the next generation. Her supernatural task? To unearth four artifacts hidden by her grandfather before a rival magical family beats her to it. Complication One: Her grandfather was Mr. Wainwright and the artifacts are lost somewhere in what is now Jane Jameson's book shop. Complication Two: her new neighbor, Jed Trudeau, who keeps turning up half naked at the strangest times, a distraction Nola doesn't need. And teaming up with a real-life Adonis is as dangerous as it sounds, especially when he’s got the face of an angel and the abs of a washboard—can Nola complete her mission before falling completely under his spell?", "hash": "ab2ebb11-7890-4978-aa36-27c5a3b39c2a"}, {"title": "Undead Sublet (Half Moon Hollow #2.5)", "author": "Molly Harper", "pgs": 19, "sum": "Storyline: \nUndead Sublet (Half Moon Hollow #2.5) by Molly Harper , Sophie Eastlake (Narrator) In \"Undead Sublet\" by Molly Harper, executive chef Tess Maitland is banned from her five-star kitchen in Chicago to recover from \"exhaustion\". Choosing a random rental house in Half-Moon Hollow to spend time in, she's unaware that the house comes with a strange man. Even though Sam Masden's ex-wife has rented the house out from under him, the divorce settlement allows him access to it for another ninety days. With Tess unable to go anywhere else, and Sam unwilling, a war of epic proportions is declared - and romantic sparks and heavy pots fly.", "hash": "5c85ec5e-98fa-4672-9daf-c1cb06e4e491"}, {"title": "Immortal Danger (Night Watch #0.5)", "author": "Cynthia Eden", "pgs": 33, "sum": "Storyline: \nImmortal Danger (Night Watch 0.5) Sexy shapeshifters and lots of suspense combine in this scintillating new paranormal novel from the author of \"Midnight Sins\" and \"Hotter After Midnight.\" Being Bullet Proof Sucks--Literally Once, Maya Black was a kick-ass cop patrolling the streets of L.A. She still keeps the city safe, but nowadays her bad guys of choice include demons, werewolves, and assorted nocturnal scum. Something Maya knows a thing or two about. She's a vampire--and not thrilled about it. Payback meet bitch. Adam Brody hopes Maya is as dangerous as they say she is. He needs her to help rescue his niece Cammie from a ruthless band of vamps, and he's willing to pay--in blood. Trusting her is another matter. Adam has never met a vampire who doesn't lie. Then again, he's never met anyone like Maya, who fills him with a desperate need that ignites into explosive, no-holds-barred encounters. . .", "hash": "eeac6d19-5302-4d50-bee5-b11640555778"}, {"title": "Eternal Hunter (Night Watch #1)", "author": "Cynthia Eden", "pgs": 43, "sum": "Storyline: \nEternal Hunter (Night Watch #1) Cynthia Eden delves into the dark realms of the Others, where desires and dangerous games await the unsuspecting in Baton Rouge, Louisiana. Assistant DA Erin Jerome has a secret. Make that two. One: She’s not entirely human–she’s Other, desperately trying to keep her supernatural strength under wraps. Two: she’s got a killer stalking her–an Other rogue set on “gifting” her bloody corpses, not to mention nights lying awake in terror. Small wonder she’s been having bad luck with men. But the bounty hunter on her new case isn’t worried about any of that. Jude Donovan is a shapeshifter himself, and the new DA’s midnight hair and addictive scent tell him all he thinks he needs to know: She’s gorgeous, she’s definitely not human, and she’s bringing out the animal in him in a really good way. He might have to track a psychotic Other stalker through half of Louisiana. But he might also get the chance to watch Erin’s wild side come out and play.", "hash": "90060442-032f-4645-9946-247cb76e795e"}]