[{"title": "I'll Be Slaying You (Night Watch #2)", "author": "Cynthia Eden", "pgs": 35, "sum": "Storyline: \nI'll Be Slaying You (Night Watch #2) Cynthia Eden returns to the realm of the Other, where the supernatural bounty hunters of Night Watch work hard and play harder. . .Sandra \"Dee\" Daniels is a vampire's worst nightmare. Sure, she couldn't get up to five-six in the highest heels money can buy--not that she ever wears heels. But the monsters in her past and the stake in her boot are enough to keep most bloodsuckers interested in staying undead out of Baton Rouge. But there are changes afoot on her turf. Rumors of a Born Master in town--a vampire so powerful he can make the streets run with blood. And a new face in Dee's dive bars and alleyways--Simon Chase, a strong, sexy shadow with a haunted past of his own. Simon knows a lot about the dark side of Dee's work. He knows even more about how to make her body spark with desire. But the hot lust shimmering between them is only the beginning. Because Simon also knows a secret that will change Dee's life--if she can live long enough to uncover it.", "hash": "6a20d690-ed72-490c-af20-f5dbc8b6e32a"}, {"title": "Eternal Flame (Night Watch #3)", "author": "Cynthia Eden", "pgs": 42, "sum": "Storyline: \nEternal Flame (Night Watch #3) Cynthia Eden invites you into the world of the Others - supernatural creatures who are sexy, powerful, and more than human in every way... No one that deadly should look that good. Hybrid demon Zane Wynter specializes in tracking the most lethal criminals, whether human or Other. But Jana Carter is nothing like his previous targets. She's an Ignitor, able to conjure and control fire. She's also sexy beyond belief - and used to playing dirty. Jana knows she's being set up. She even knows who's responsible: Project Perseus, a secretive group that plans to rid the world of paranormals by any means necessary. From Louisiana's sultry swamps to its desolate cemeteries, Jana and Zane must race to destroy the mastermind behind Perseus before their world goes up in flames - and with it, a desire that burns too hot to resist.", "hash": "7b476d85-492e-4a37-a5b3-5048b0d4e640"}, {"title": "Never Cry Wolf (Night Watch #4)", "author": "Cynthia Eden", "pgs": 41, "sum": "Storyline: \nNever Cry Wolf (Night Watch #4) RUNNING WITH A DANGEROUS CROWD Lucas Simone is not the kind of guy you mess with. He’s big, he’s strong, and his eyes hint at a wilder side most women can’t handle. Of course, that’s because his predatory instincts are no metaphor–he’s a genuine Grade-A top-quality werewolf, tough enough to fight his way to dominance over the scariest pack on the West Coast. There’s only one chink in his armor. Unlike most alpha dogs, Lucas has a reputation for protecting the weak and innocent. Sarah King is counting on that protective impulse–it’s the only thing standing between her and certain death. There are only two problems: one, she’s not quite as innocent as she’d like Lucas to believe. And two, if he doesn’t stop stoking Sarah’s animal lust, it’s only a matter of time before her own wild side gets unleashed…", "hash": "ade78d31-e22e-4271-a881-a214f8c5a08c"}, {"title": "Witchling (Otherworld/Sisters of the Moon #1)", "author": "Yasmine Galenorn", "pgs": 36, "sum": "Storyline: \nWitchling (Otherworld/Sisters of the Moon #1) We’re the D’Artigo sisters: Half-human, half-Faerie, we’re savvy—and sexy—operatives for the Otherworld Intelligence Agency.  But our mixed-blood heritage short-circuits our talents at all the wrong times.  My sister Delilah shapeshifts into a tabby cat whenever she’s stressed.  Menolly’s a vampire who’s still trying to get the hang of being undead.  And me?  I’m Camille—a wicked-good witch.  Except my magic’s as unpredictable as the weather, as my enemies are about to find out the hard way... At the Wayfarer Inn, a portal to Otherworld and the local hangout for humans and beasties alike, a fellow operative, Jocko, has been murdered.  Every clue points to Shadow Wing, the soul-munching, badass leader of the Subterranean Realms.  He’s made it clear that he aims to raze humankind to the ground, turning both Earth and Otherworld into his private playground.  Our assignment:  Keep Shadow Wing and his minions from creeping into Earth via the Wayfarer.  The demons figure they’re in like Flynn.  After all, with only my bumbling sisters and me standing in the way, how can they miss?  But we’ve got a secret for them:  Faulty wiring or not, nobody kicks ass like the D’Artigo girls...", "hash": "a43f1e0d-562f-403b-a11b-3d0081419eeb"}, {"title": "Changeling (Otherworld/Sisters of the Moon #2)", "author": "Yasmine Galenorn", "pgs": 39, "sum": "Storyline: \nChangeling (Otherworld/Sisters of the Moon #2) We're the D'Artigo Sisters: Half-human, half-Faerie, we're savvy--and sexy--operatives for the Otherworld Intelligence Agency. But our mixed-blood heritage short-circuits our talents at all the wrong times. My sister Camille is a wicked-good witch whose magic is as unpredictable as the weather. My sister Menolly is a vampire trying to get the hang of being undead. And me? I'm Delilah. When I'm under stress, I transform into a tabby cat--and a series of violent murders is really getting me bent out of shape... \"Someone's been slaughtering the Weres of the Rainier Puma Pride, and my sisters and I have been enlisted to investigate by Zachary Lyonnesse, golden boy of the werepumas. Right away we smelled demon trouble, and we tracked it directly into the snare of the Hunters Moon Clan, sworn enemies of Puma Pride. But there's more than Were rivalry at work. It's that old demon Shadow Wing who is setting a deadly snare for the pumas. We have to find out why, which means a visit one to of the Immortals. Unfortunately, for my sisters and me, our half-human blood is just enough to put us in mortal danger.\" \"At the Wayfarer Inn, a portal to Otherworld and the local hangout for humans and beasties alike, our fellow operative Jocko's been murdered. Every clue points to Shadow Wing, the soul-munching, bad-ass leader of the Subterranean Realms. He's made it clear that he aims to raze humankind to the ground, turning both Earth and Otherworld into his private playground. Our assignment: keep Shadow Wing and his minions from creeping into Earth via the Wayfarer. The demons figure they're in like Flynn. After all, with only my 'bumbling' sisters and me standing in the way, how can they miss? But we've got a secret for them: faulty wiring or not, nobody kicks ass like the D'Artigo girls.\"", "hash": "52272111-0650-494c-a6b0-0cc472bb8a87"}, {"title": "The Ghost and the Graveyard (Knight Games #1)", "author": "Genevieve Jack", "pgs": 32, "sum": "Storyline: \nThe Ghost and the Graveyard (Knight Games #1) **The Ghost and The Graveyard is a funny, exciting, and sexy read intended for adults. Due to sexual content, language, and violence this book is recommended for ages 18+** Grateful Knight isn't looking for love when she moves into a rent-free house on the edge of a graveyard. At twenty-two, all she wants is to recover financially so she can move back to the city where she belongs. But sparks fly when the gorgeous cemetery caretaker, Rick, introduces himself and mentions his suspicion that her new house might be haunted. Her attraction to him seems supernatural, and despite her resolve to not get involved, she literally can't keep her hands off him. When things in Grateful's house start moving on their own, another man enters her life, Logan, a sexy ghost with a dark secret. He says Rick isn't what he seems, and indulging her passion for him could cost her soul. One thing's for sure, magical forces are at work in the tiny town of Red Grove, and they're converging on Grateful. Life will never be the same once she's forced to choose between the ghost and the graveyard.", "hash": "53de51fa-d133-43b1-8db5-e64f99e71346"}, {"title": "Kick the Candle (Knight Games #2)", "author": "Genevieve Jack", "pgs": 32, "sum": "Storyline: \nKick the Candle (Knight Games #2) Commitment phobic, Grateful Knight has her hands full. While she struggles to understand her new role as Monk's Hill Witch, evil isn't waiting for her to come up to speed. Not only is there an increase in supernatural activity in her ward, she’s being evicted from her home, breaking in a snarky new familiar, and trying to sort out her feelings for her metaphysically connected and immortal boyfriend, Rick. When Grateful foils a murder at a fae bordello, she uncovers a plot by a local vampire coven to obtain a secret weapon with the power to control both the living and the dead. History is threatening to repeat itself. And if Grateful doesn't give herself over to her role completely, it could cost her everything.", "hash": "fac894a1-ef5f-4124-b7ec-548d7c4001db"}, {"title": "Pride Mates (Shifters Unbound #1)", "author": "Jennifer Ashley", "pgs": 41, "sum": "Storyline: \nPride Mates (Shifters Unbound #1) Defense attorney Kim Fraser has to venture into the dark and dangerous Shiftertown to get answers for a client accused of murder, but the secrets she learns from the enticing lips of Liam Morrissey might just get her killed if the shifter doesn't claim her for his mate.", "hash": "67b0f5a4-c6e4-492f-9593-0a50fe6b05dd"}, {"title": "Vampire Most Wanted (Argeneau #20)", "author": "Lynsay Sands", "pgs": 24, "sum": "Storyline: \nVampire Most Wanted (Argeneau #20) For Basha Argeneau, anything is better than facing her estranged family. Even hiding out in sweltering southern California. But when a sexy immortal in black shows up determined to bring her back to the clan, she'll do anything to keep far, far away from the past she can't outrun. Marcus Notte isn't here to play games—especially not with someone as crazy as the infamous blonde. Asked by Lucian Argeneau to bring her back for questioning, Marcus is determined to carry out Lucian's request—no matter how the seductive little mind-reading vamp feels about it. Basha doesn't mind fighting fire with fire, especially with a hot immortal involved. But if he wants to take her away, he'll have to catch her first . . .", "hash": "1447d2a6-864c-4a7e-8cbc-74c06a48422d"}]