[{"title": "Timber Creek (Sierra Falls #2)", "author": "Veronica Wolff", "pgs": 48, "sum": "Storyline: \nTimber Creek (Sierra Falls #2)  In love and war, something’s gotta give…  For Laura Bailey it wasn’t easy weathering her teen years at her quaint family lodge in a boondock town at the foothills of the Sierra Nevadas. Fleeing for San Francisco the minute she graduated high school seemed like a good idea—until she lost her job and her fiancé. The blow to her pride sent her back to Sierra Falls to figure out her life. But her hometown is undergoing a bit of renovation. A new Sierra Falls resort is posing a threat to the Bailey family business. Even worse, the construction company developing the property is run by Eddie Jessup, Laura’s cocky high school nemesis who delighted in locking horns with the little spitfire. Some things never change. But their battle isn’t the only thing heating up between Laura and Eddie, and before long they realize that getting to know each other all over again has its rewards. But fate isn’t through with them. Nor are the games men and women play in the name of love.", "hash": "014d4481-536e-41fe-a244-bea658154a93"}, {"title": "First Ink (Wicked Ink Chronicles #1)", "author": "Laura Wright", "pgs": 11, "sum": "Storyline: \nFirst Ink (Wicked Ink Chronicles #1) Rush Women in his bed, celebs and rockers in his chair and a killer bank account at his disposal, life is pretty freaking swell. Then she walks back into it again. With her mismatched eyes, perfect pink mouth and a laugh that still haunts him, she gave him nothing but marvelous misery. Now she wants his hands on her again. Not for pleasure, but for pain. For Ink. A bleeding heart to match the one she left him with five years ago. Addison She can’t forget him. No matter how hard she’s tried. The pain she caused him in the past eats at her daily, and she can’t move on with her life. But she has a plan, a hope for redemption – a way for him to take his revenge out on her flesh. But it’ll only work if he lets her inside his exclusive world, under his famous artist’s needle and into his bed—and heart-once again.", "hash": "959881d6-e474-4780-94c0-5e08cfa3f68e"}, {"title": "Shattered Ink (Wicked Ink Chronicles #2)", "author": "Laura Wright", "pgs": 12, "sum": "Storyline: \nShattered Ink (Wicked Ink Chronicles #2) Addison She is totally and utterly in love. She can’t focus, can’t sleep. She doesn’t want to hang out with friends, doesn’t even care if she graduates from college in a week. All she wants is Rush, and her obsession for him is scaring her. Unable to handle the fear that brings up ugly memories of being abandoned as a child, Addison withdraws to protect herself. But that may backfire when an old flame of Rush's reappears in his life. Rush Addison is the only woman he wants in his bed. Hell, he’s inked her name into his skin, and he plans on asking her to move in with him. Problem is, she’s acting like she doesn’t feel the same way about him. It’s like something’s changed between them. And when an old girlfriend comes back into the picture – stirring up memories and fears about his past – Rush knows that if he and Addison are ever going to have a chance at happiness, it’s time to shatter the walls between them once and for all.", "hash": "9ec4458a-5bd2-49b1-80f4-d82e85e12054"}, {"title": "Razor's Edge (Shadow Stalkers #1)", "author": "Sylvia Day", "pgs": 8, "sum": "Storyline: \nRazor's Edge (Shadow Stalkers #1) It wasn’t her fault he was strung out from wanting her… It was a cool night in Carmel but for Deputy US Marshal Jack Killigrew, thoughts of Rachel were generating a lot of heat and sweat. But having her could never be more than a fantasy. She was his best friend’s widow. He promised to look after her should anything happen. And there’s no way Jack could betray the memory of his buddy by making moves on the guy’s wife—no matter how long he’s desired her. Rachel’s marriage had been perfect. So had her husband. But fate had a different plan. Now Rachel’s a single mother, resilient and independent. It’s time for her to move on and let a new man into her life. Jack’s been there for her in the past but now she needs him in a different way. All Rachel has to do in convince him that it’s right, that it’s the best thing for both of them, and that it’s about time…", "hash": "8ef7f870-9684-4023-ab5e-3ada89cfffd0"}, {"title": "Taking the Heat (Shadow Stalkers #2)", "author": "Sylvia Day", "pgs": 15, "sum": "Storyline: \nTaking the Heat (Shadow Stalkers #2) He had three days to fix everything. Three days to remind her of how good they were together. She was a captive audience… Layla Creed and Deputy US Marshal Brian Simmons have a history that is as hot and heartbreaking as it is unforgettable. Now their paths have crossed once again. This time things are twice as hot. Layla—a protected witness—has been persuaded to come out of hiding and testify in a sensational murder trial. But as far as Brian’s concerned, there’s an even more pressing problem. Once Layla testifies she’ll get sucked back into the Witness Protection Program. A new identity, a new location, a new occupation—and a new inspector to check up on her. In other words, out of his life forever. There is one more option—take Layla and go on the run. Rekindling what they once had should be easy. But a stranger in their shadow has plans of his own, forcing Brian and Layla to risk everything in the name of love.", "hash": "f136d1cb-bc07-4c9a-bc1c-582167798aaa"}, {"title": "Blood and Roses (Shadow Stalkers #3)", "author": "Sylvia Day", "pgs": 7, "sum": "Storyline: \nBlood and Roses (Shadow Stalkers #3) When insurance investigator Anastasia Miller sets out to retrieve the rose- hued pink diamonds stolen in a recent heist, she finds herself working alongside former flame, deputy U.S. Marshal Jake Monroe-the man she loved enough to leave behind.", "hash": "2fec33b4-b9cf-4654-891c-550018a76fb3"}, {"title": "All Revved Up (Dangerous #1)", "author": "Sylvia Day", "pgs": 7, "sum": "Storyline: \nAll Revved Up (Dangerous #1) On the eve of his thirtieth birthday, Miguel Santos leaves his high-powered life behind for a visit to the small town he grew up in… and the high school sweetheart whose wild passion he's never stopped craving. Faith Bennett loved Miguel the moment she saw him. But she always knew his future was in New York, while hers was tied to the auto shop that was her close-knit family's livelihood. Pushing him away nearly broke her, but when he took her heart with him, he left something precious behind. Now he's back, demanding her body, her desire, her very soul as retribution for the pain he still carries. He won't settle for anything less than everything she’s got, but she still can't leave with him and he still can't stay, and their past has secrets too explosive to share.", "hash": "b5447140-a0d3-42f5-b6da-b766bcd668da"}, {"title": "On Fire (Shadow Stalkers #4)", "author": "Sylvia Day", "pgs": 24, "sum": "Storyline: \nOn Fire (Shadow Stalkers #4) Every time she opened her mouth, his mind went straight into the gutter… When Deputy US Marshal Jared Cameron started investigating a series of arson attacks in the small seaside town of Lion’s Bay, he had no idea that the biggest blast of heat would come from the fire inspector. Her name was Darcy Michaels—and if there was anyone that Jared wanted to get down and sweaty with, it was Darcy. Darcy knew what she was bringing out in Jared. In fact, she liked it. She reveled in making his dirty dreams come true. Stripped down for a scorching after-hours affair, Jared was her fantasy, too. A hard-driving man who knew exactly what to do to please her. But as hot as their nights were, they had no idea just how wild it was going to get. Because Darcy has a secret. And a past. And it’s drawing them right into the flames…", "hash": "4fbb8a76-e2df-4692-a303-409d1893a213"}, {"title": "Bared to You (Crossfire #1)", "author": "Sylvia Day", "pgs": 97, "sum": "Storyline: \nDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: Bared to You (Crossfire #1) Gideon Cross came into my life like lightning in the darkness… He was beautiful and brilliant, jagged and white-hot. I was drawn to him as I’d never been to anything or anyone in my life. I craved his touch like a drug, even knowing it would weaken me. I was flawed and damaged, and he opened those cracks in me so easily… Gideon knew. He had demons of his own. And we would become the mirrors that reflected each other’s most private wounds…and desires.The bonds of his love transformed me, even as i prayed that the torment of our pasts didn't tear us apart...", "hash": "0218614c-a3d5-4dc6-8897-7e7452c91247"}, {"title": "Reflected in You (Crossfire #2)", "author": "Sylvia Day", "pgs": 58, "sum": "Storyline: \nReflected in You (Crossfire #2) Gideon Cross. As beautiful and flawless on the outside as he was damaged and tormented on the inside. He was a bright, scorching flame that singed me with the darkest of pleasures. I couldn't stay away. I didn't want to. He was my addiction... my every desire... mine. My past was as violent as his, and I was just as broken. We’d never work. It was too hard, too painful... except when it was perfect. Those moments when the driving hunger and desperate love were the most exquisite insanity. We were bound by our need. And our passion would take us beyond our limits to the sweetest, sharpest edge of obsession...", "hash": "b5f29c7f-0d61-4a2b-9bdc-63598af83aac"}]