[{"title": "Entwined with You (Crossfire #3)", "author": "Sylvia Day", "pgs": 61, "sum": "Storyline: \nEntwined with You (Crossfire #3) The worldwide phenomenon continues as Eva and Gideon face the demons of their pasts, and accept the consequences of their obsessive desires… From the moment I first met Gideon Cross, I recognized something in him that I needed. Something I couldn’t resist. I saw the dangerous and damaged soul inside–so much like my own. I was drawn to it. I needed him as surely as I needed my heart to beat. No one knows how much he risked for me. How much I’d been threatened, or just how dark and desperate the shadow of our pasts would become. Entwined by our secrets, we tried to defy the odds. We made our own rules and surrendered completely to the exquisite power of possession…", "hash": "736b3732-e08e-4c1a-ac1b-5209aaa78d32"}, {"title": "Masquerade ", "author": "Amanda Ashley", "pgs": 12, "sum": "Storyline: \nA talented beauty... A tormented soul... A tortured love... He must see her again. Her resemblance to his long-ago love and her beauty lures him to Leanne, a singer in the cast of \"The Phantom of the Opera\". Jason Blackthorne pretends to be a cop when, in truth, he must live forever in the shadows as he seeks to satisfy his unholy thirst for blood. Unable to stay away after being alone for three hundred years, he approaches Leanne for an autograph one evening and begins an affair he never meant to allow. When Leanne declares her love for the handsome man she believes him to be, Jason is forced to make life-altering decisions. Will he hold back his demons and spare her from his hunger? Or will her love end the \"Masquerade\" and free them both?", "hash": "7303b69b-4cd4-41a5-96d8-42a3cc7ae59c"}, {"title": "In Flight (Up in the Air #1)", "author": "R.K. Lilley", "pgs": 44, "sum": "Storyline: \nIn Flight (Up in the Air #1) When reserved flight attendant Bianca gets one look at billionaire hotel owner James Cavendish, she loses all of her hard-won composure. For a girl who can easily juggle a tray of champagne flutes at 35,000 feet in three inch heels, she finds herself shockingly weak-kneed from their first encounter. The normally unruffled Bianca can't seem to look away from his electrifying turquoise gaze. They hold a challenge, and a promise, that she finds impossible to resist, and she is a girl who is used to saying no and meaning it. Bianca is accustomed to dealing with supermodels and movie stars in her job as a first class flight attendant, but James Cavendish puts them all to shame in the looks department. If only it were just his looks that she found so irresistible about the intimidating man, Bianca could have ignored his attentions. But what tempts her like never before is the dominant pull he seems to have over her from the moment they meet, and the promise of pleasure, and pain, that she reads in his eyes.", "hash": "6972d584-8b7c-4f59-9947-00e7433e31ce"}, {"title": "Mile High (Up in the Air #2)", "author": "R.K. Lilley", "pgs": 45, "sum": "Storyline: \nMile High (Up in the Air #2) James and Bianca’s tumultuous story continues in the sequel to In Flight. James has initiated Bianca into a dark and drugging world of passion and pain. He taught her about her own submissive, masochistic nature, and she fell swiftly and deeply in love with the undeniably charming and impossibly beautiful Mr. Cavendish, but a painful misunderstanding and the return of the brutally violent demon of her past have combined to overwhelm Bianca, and, confused and hurt, she pushes him away. It’s been over a month since the shocking attack that hospitalized her, and since she told a distraught James that she needed space, but her feelings haven’t gone away. Even she knew that it was only a matter of time before he would cast his spell on her again…", "hash": "2a15c3fe-ec7a-4b17-a825-ac045c2bb25c"}, {"title": "Grounded (Up in the Air #3)", "author": "R.K. Lilley", "pgs": 54, "sum": "Storyline: \nGrounded (Up in the Air #3) James and Bianca’s story draws to a close in the explosive conclusion to the Up In The Air Trilogy. After a short but earnest courtship, Bianca can no longer deny her feelings for James, and though she’s tried her hardest, she can’t help but see that he cares deeply for her, as well. In a completely uncharacteristic move, she has put aside her misgivings and agreed to live with the enigmatic billionaire. Is her leap of faith the beginning of something wonderful, or is it too much, too fast? As James and Bianca feel a growing need for each other that neither can deny, circumstances beyond their control intervene, trying to tear them apart. Amidst the ever mounting threat of a monster who wants Bianca dead, and the constant pitfalls of an indiscreet past that James can’t seem to escape, can these two passionate lovers manage to find their happily ever after?", "hash": "cf78f98c-af4e-4d3a-9c5b-e06db8a38dfa"}, {"title": "Bad Things (Tristan & Danika #1)", "author": "R.K. Lilley", "pgs": 51, "sum": "Storyline: \nBad Things (Tristan & Danika #1) Danika hasn’t had an easy life. Being insanely attracted to bad boys has never helped make it easier. One look at Tristan, and every brain cell she possessed went up in smoke. This man was trouble with a capital T. It was a given. She knew better. Bad boys were bad. Especially for her. Considering her history, it was crazy to think otherwise. So why did crazy have to feel so damn fine? For as long as she could remember, Danika had been focused on the future with single-minded purpose. Tristan came along and taught her everything there was to know about letting go, and living in the present. She fell, hard and deep. Of course, that only made her impact with the ground that much more devastating. Bad Things is about Tristan and Danika, and their train wreck of a love story. This series can be read as a standalone, or with the Up in the Air series.", "hash": "a78a7a1a-f828-44fa-9fd0-3802805b0dd5"}, {"title": "Rock Bottom (Tristan & Danika #2)", "author": "R.K. Lilley", "pgs": 38, "sum": "Storyline: \nRock Bottom (Tristan & Danika #2) Their love had the power of a runaway freight train, and the potential to be just as destructive. The tempestuous sequel to Bad Things picks up where the first book left off. Reeling from a profound loss, Tristan and Danika struggle to pick up the pieces and build a life together, but the hard habits of a lifetime are not so easy to escape. Rock Bottom takes us on a dual point of view journey through addiction and desire, through love and agony, and answers the question we’ve been asking since these characters were introduced in Grounded: “What happened between Tristan and Danika?” DANIKA Even love couldn’t cushion a fall like ours. My love for Tristan was so big that I felt consumed by it, and even so, it was not enough to overpower our combined demons. I struggled. I yelled and screamed. I scratched and kicked. I fought like hell, but even the most determined fighters have to stop before they break. No one could say I didn’t fight for him. “I love you,” I spoke softly into his ear. He gripped me harder. “I can’t ever lose you, Danika. I’m not sure I’d survive it.” “You’ve got me. And I’m not going anywhere. Not ever.” I meant the words when I said them, but life had other plans for us. I’d have given my life for that fight. In fact, I very nearly did. TRISTAN She was the one. If I’d ever had a doubt, I didn’t now. She was the one I’d be thinking about, longing for, until I took my last breath. If I lost her tomorrow, I’d pine for her like a lovesick fool. This was the kind of love that only hit you once in your life.", "hash": "a0961199-f775-4d0b-9434-c81e6bda5d35"}, {"title": "Lana ", "author": "R.K. Lilley", "pgs": 15, "sum": "Storyline: \nLana can’t remember a time when she wasn’t hopelessly in love with Akira. Even knowing that he viewed her as a kid sister had never helped to dampen her feelings. One night together only made it worse. After seducing Akira, it became apparent that their love affair was hopelessly one-sided, and heartbroken, Lana fled her beloved island paradise. Eight years later, Lana finally returns home, planning to stay briefly, and only for business, but her plans go quickly awry when she runs into the man she could never get over.", "hash": "787a85dc-4bb4-47f7-9ee6-e375702e5ebf"}, {"title": "Last Day of Love: A Teardrop Story (Teardrop #0)", "author": "Lauren Kate", "pgs": 7, "sum": "Storyline: \nLast Day of Love: A Teardrop Story (Teardrop 0.5) Don't miss this beautiful original digital story by Lauren Kate, the #1 New York Times bestselling author of the Fallen series, set in the romantic world of Teardrop, a place of  devastating secrets and dark magic . . . a world where everything you love can be washed away.", "hash": "fb07c1cc-bcc9-4e97-9d98-01052a8e3a21"}, {"title": "The Shop on Blossom Street (Blossom Street #1)", "author": "Debbie Macomber", "pgs": 51, "sum": "Storyline: \nThe Shop on Blossom Street (Blossom Street #1) Bestselling romance author and ardent knitter Debbie Macomber combines both her skills in this novel about a newly opened Seattle yarn shop and the knitting class that brings four women together to make baby blankets. The owner of the shop and her three students produce more than blankets, knitting together bonds of solidarity, friendship, love, hope, and renewal. The book even includes the pattern for the blanket, which was created by premier knitting designer Ann Norling. When Lydia Hoffman, a cancer survivor and owner of A Good Yarn, starts a knitting class for her patrons, she forms a special friendship and bond with three extraordinary women--Jacqueline, Carol, and Alix--and together they share laughter, heartbreak, and dreams.", "hash": "afe250dd-8b6d-4e39-a5a9-4d3750ef8be7"}]