[{"title": "A Good Yarn (Blossom Street #2)", "author": "Debbie Macomber", "pgs": 53, "sum": "Storyline: \nA Good Yarn (Blossom Street #2) Lydia Hoffman owns the shop on Blossom Street. In the year since it opened, A Good Yarn has thrived-and so has Lydia. A lot of that is due to Brad Goetz. But when Brad's ex-wife reappears, Lydia is suddenly afraid to trust her newfound happiness.Three women join Lydia's newest class. Elise Beaumont, retired and bitterly divorced, learns that her onetime husband is reentering her life. Bethanne Hamlin is facing the fallout from a much more recent divorce. And Courtney Pulanski is a depressed and overweight teenager, whose grandmother's idea of helping her is to drag her to seniors' swim sessions-and to the knitting class at A Good Yarn.", "hash": "43078e65-0f6e-4e06-b018-1a136f5ab8b6"}, {"title": "Susannah's Garden (Blossom Street #3)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \nSusannah's Garden (Blossom Street #3) When Susannah Nelson turned eighteen, she said goodbye to her boyfriend, Jake--and never saw him again. She never saw her brother, Doug, again, either. He died unexpectedly that same year. Now, at fifty, Susannah finds herself regretting the paths not taken. Long married, a mother and a teacher, she \"should\" be happy. But she feels there's something missing in her life. Not only that, she's balancing the demands of an aging mother and a temperamental twenty-year-old daughter. Her mother, Vivian, a recent widow, is having difficulty coping and living alone, so Susannah goes home to Colville, Washington. In returning to her parents' house, her girlhood friends and the garden she's always loved, she also returns to the past--and the choices she made back then. What she discovers is that things are not always as they once seemed. Some paths are dead ends. But some gardens remain beautiful....", "hash": "f33582f5-8778-4e59-bd56-75a0d3d21596"}, {"title": "Back on Blossom Street (Blossom Street #4)", "author": "Debbie Macomber", "pgs": 54, "sum": "Storyline: \nBack on Blossom Street (Blossom Street #4) There's a new shop on Seattle's Blossom Street--a flower store called Susannah's Garden, right next door to A Good Yarn. Susannah Nelson, the owner, has just hired a young widow named Colette Blake. A couple of months earlier, Colette had abruptly quit her previous job--after a brief affair with her boss. To her dismay, he's suddenly begun placing weekly orders for flower arrangements! Susannah and Colette both join Lydia Goetz's new knitting class. Lydia's previous classes have forged lasting friendships, and this one is no exception. But Lydia and her sister, Margaret, have worries of their own. Margaret's daughter, Julia, has been the victim of a random carjacking, and the entire family is thrown into emotional chaos. Then there's Alix Townsend. Her wedding to Jordan Turner is only months away--but she's not sure she can go through with it. Her love for Jordan isn't in question; what she can't handle is the whole wedding extravaganza engineered by her mentor, Jacqueline, with the enthusiastic cooperation of her future mother-in-law. A reception at the country club and hundreds of guests she's never even met--it's just not Alix. Like everyone else in Lydia's knitting class, Alix knows there's a solution to every problem...and that another woman can usually help you find it!", "hash": "6746376d-6801-475f-8816-1b97d1285d70"}, {"title": "Twenty Wishes (Blossom Street #5)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \nTwenty Wishes (Blossom Street #5) What do you want most in the world? What Anne Marie Roche wants is to find happiness again. At thirty-eight, she's childless, a recent widow, alone. She owns a successful bookstore on Seattle's Blossom Street, but despite her accomplishments, there's a feeling of emptiness. On Valentine's Day, Anne Marie and several other widows get together to celebrate…hope. They each begin a list of twenty wishes—things they always wanted to do but never did. Anne Marie's list includes learning to knit, falling in love again, doing good for someone else. When she volunteers at a local school, an eight-year-old girl named Ellen enters her life. It's a relationship that becomes far more involving—and far more important—than Anne Marie had ever imagined. As Ellen helps Anne Marie complete her list of twenty wishes, they both learn that wishes can come true…but not necessarily in the way you expect.", "hash": "58fd221f-7797-4dd2-86b9-22d94f49f021"}, {"title": "Summer on Blossom Street (Blossom Street #6)", "author": "Debbie Macomber", "pgs": 49, "sum": "Storyline: \nSummer on Blossom Street (Blossom Street #6) Knitting and life. They're both about beginnings--and endings. That's why it makes sense for Lydia Goetz, owner of A Good Yarn on Seattle's Blossom Street, to offer a class called Knit to Quit. It's for people who want to quit something--or someone!--and start a new phase of their lives.First to join is Phoebe Rylander. She recently ended her engagement to a man who doesn't know the meaning of \"faithful, \" and she's trying to get over him. Then there's Alix Turner. She and her husband, Jordan, want a baby, which means she \"has\" to quit smoking. And Bryan Hutchinson joins the class because he needs a way to deal with the stress of running his family's business--not to mention the lawsuit brought against him by an unscrupulous lawyer. Life can be as complicated as a knitting pattern. Just ask Anne Marie Roche. She and her adopted daughter, Ellen, finally have the happiness they wished for. And then a stranger comes to her bookstore asking questions. Or ask Lydia herself. Not only is she coping with her increasingly frail mother, but she and Brad have unexpectedly become foster parents to an angry, defiant twelve-year-old. But as Lydia already knows, when life gets difficult and your stitches are snarled, your friends can \"always\" help!", "hash": "482c9d54-81cd-4086-ad3e-fec85829a8bf"}, {"title": "Hannah's List (Blossom Street #7)", "author": "Debbie Macomber", "pgs": 47, "sum": "Storyline: \nHannah's List (Blossom Street #7) My darling Michael, I know this letter will come as a shock to you&hellip;. On the anniversary of his beloved wife's death, Dr. Michael Everett receives a letter Hannah had written him. In it she reminds him of her love and makes one final request. An impossible request&mdash;I want you to marry again. She tells him he shouldn't spend the years he has left grieving her. And to that end she's chosen three women she asks him to consider. First on Hannah's list is her cousin, Winter Adams, a trained chef who owns a caf&#233; on Seattle's Blossom Street. The second is Leanne Lancaster, Hannah's oncology nurse. Michael knows them both. But the third name is one he's not familiar with&mdash;Macy Roth. Each of these three women has her own heartache, her own private grief. More than a year earlier, Winter broke off her relationship with another chef. Leanne is divorced from a man who defrauded the hospital for which she works. And Macy lacks family of her own, the family she craves, but she's a rescuer of strays, human and animal. Macy is energetic, artistic, eccentric&mdash;and couldn't be more different from Michael. During the months that follow, he spends time with Winter, Leanne and Macy, learning more about each of them&hellip;and about himself. Learning what Hannah already knew. He's a man who needs the completeness only love can offer. And Hannah's list leads him to the woman who can help him find it.", "hash": "6d302126-0a7b-4379-9b32-6fb58e1d5cf1"}, {"title": "A Turn in the Road (Blossom Street #8)", "author": "Debbie Macomber", "pgs": 51, "sum": "Storyline: \nA Turn in the Road (Blossom Street #8) Six years after he had walked out on his wife and kids, Grant was freshly single again and looking to reconcile with Bethanne Hamlin. To forgive the betrayal was one thing, she did that for herself. To forget was something that she didn’t think she could ever do and she wasn’t sure if she could ever trust him again either. Being willing to at least think about it for the sake of the grown kids, herself, him, she wasn’t sure, but think about it she was. Hearing that her ex-mother-in-law was planning a road trip across the country to her 50th class reunion in Florida was the perfect excuse to get away and do that thinking. With the addition of her daughter Annie, Ruth and Bethanne set out to see America. Even though Ruth had made plans, the addition of Annie added spontaneity to the group, taking them off the plotted course early in the trip. Helping out in a diner for an old friend of Ruth’s was the fist of may changes to come. Then they have trouble with the rental car with only one source of help, and that coming from a group of motorcycle riders they met at the diner. Offering a ride to the nearest town was the best way for Max to help, but the connection they found while offering confessions may make some decisions more difficult.", "hash": "ccc205bb-08a1-44f4-91b1-728ef9122be9"}, {"title": " 16 Lighthouse Road (Cedar Cove #1)", "author": "Debbie Macomber", "pgs": 49, "sum": "Storyline: \n16 Lighthouse Road (Cedar Cove #1) Olivia Lockhart 16 Lighthouse Road Cedar Cove, Washington Dear Reader, You don't know me yet, but in a few hours that's going to change. You see, I'm inviting you to my home and my town of Cedar Cove because I want ou to meet my family, friends, and neighbors. Come and hear their stories - maybe even their secrets! I have to admit that my own secrets are pretty open. My marriage failed some years ago, and I have a rather ... difficult relationship with my daughter, Justine. Then there's my mother, Charlotte, who has plenty of opinions and is always willing to share them. Here's an example: I'm a family court judge and she likes to drop in on my courtroom. Recently I was hearing a divorce petition. In Charlotte's view, young Cecilia and Ian Randall hadn't tried hard enough to make their marriage work - and I agreed. So I rendered my judgement: Divorce Denied. Well, you wouldn't believe the reaction! Thanks to an article by Jack Griffin, the editor of our local paper (and a man I wouldn't mind seeing more of!), everyone's talking. Cedar Cove - people love it and sometimes they leave it, but they never forget it! See you soon ... Olivia", "hash": "b3a830c9-80cd-4994-ba9c-95de7c24f41c"}, {"title": " 204 Rosewood Lane (Cedar Cove #2)", "author": "Debbie Macomber", "pgs": 52, "sum": "Storyline: \n204 Rosewood Lane (Cedar Cove #2) Grace Sherman 204 Rosewood Lane Cedar Cove, Washington Dear Listener, If you've been to Cedar Cove before we've probably met. You can usually find me either at home or at the public library, where I work. I've lived in this town all my life and raised two daughters here. But my husband and I - well, about six months ago, he disappeared. Just…disappeared. Where's Dan? Why did he go? Who's he with? Will I ever find out? My hometown, my family and friends, bring me comfort during this difficult time. Comfort and a sense of shelter. I'm continually reminded that life can and does go on. For instance, everyone's been discussing weddings and babies lately. Justine - the only daughter of my best friend, Olivia Lockhart - impulsively got married a little while ago. My own daughter Kelly recently had a baby. Unfortunately, she refuses to accept that Dan might not return to see his first grandchild. My older daughter, Maryellen, is more realistic. I think she's seeing a new man, but for some reason she won't tell me who it is. Then there's Jack, who's been pursuing a romance with Olivia, and his son, Eric, and Eric's girlfriend, Shelly (I think she's pregnant), and Zach and Rosemary Cox, whose marriage is reputedly on the skids and…Well, just come on over and we'll talk! Grace", "hash": "9aca1da3-6783-4b4d-8f44-6a38fb3aa893"}, {"title": " 311 Pelican Court (Cedar Cove #3)", "author": "Debbie Macomber", "pgs": 54, "sum": "Storyline: \n311 Pelican Court (Cedar Cove #3) Rosie Cox 311 Pelican Court Cedar Cove, Washington Dear Reader, One thing about Cedar Cove \u0097 people sure are interested in what other people are doing. Take me, for instance. Everybody in the town knows that my husband, Zach, and I recently got a divorce. Everybody also know that Judge Olivia Lockhard decreed a pretty unusual custody arrangement. It won't be the kids moving between my place and Zach's. We're the ones who'll be going back and forth! Olivia isn't immune to gossip herself. Will she stay with Jack, the guy who runs our local paper, or will she get back with her ex? Inquiring minds want to know! But the really big gossip has to do with the dead guy \u0097 the man who died at a local bed-and-breakfast. Who is he and why did he show up there in the middle of the night? Roy McAfee, our local private investigator, is absolutely determined to find out. I hope he does \u0097 and then I'll let you know! See you soon. . . Rosie", "hash": "c9d9301c-055c-4929-bf5b-72ad54fd935a"}]