[{"title": " 44 Cranberry Point (Cedar Cove #4)", "author": "Debbie Macomber", "pgs": 48, "sum": "Storyline: \n44 Cranberry Point (Cedar Cove #4) Dear Reader, I love living in Cedar Cove, but things haven't been the same since a man died at our B and B. Turns out his name was Max Russell, and Bob had known him briefly in Vietnam.We still don't have any idea why he came here and—most important of all—who killed him. Because it now appears that he was poisoned. I sure hope somebody figures it out soon! Not that we're providing the only news in Cedar Cove these days. I heard that Jon Bowman and Maryellen Sherman are getting married. And Maryellen's mom, Grace, has more than her share of interested men! The question is: Which one is she going to choose? Olivia—I guess it's Olivia Griffin now— is back from her honeymoon, and her mother, Charlotte (who's in her mid-seventies at least), seems to have a man in her life, too. I'm not sure Olivia's too pleased…. There's lots of other gossip I could tell you. Come by for a cup of tea and one of my blueberry muffins and we'll talk. Peggy Beldon", "hash": "1bcac32a-4579-479f-9cf8-3d52b9da40cf"}, {"title": " 50 Harbor Street (Cedar Cove #5)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \n50 Harbor Street (Cedar Cove #5) Welcome to Cedar Cove – a small town with a big heart! There’s a mystery to be solved in Cedar Cove. Local private detective Roy McAfee and his wife Corrie have been receiving anonymous postcards with messages asking if they “regret the past. ” What does it mean? On a more positive note, Roy and Corrie’s daughter Linette is now working at the new medical clinic and is very taken with the new doctor. But where does this leave doting Cal Washburn, who works for Cliff at the horse farm? Speaking of Cliff, it looks like the romance between him and Grace Sherman is back on. Could a wedding be on the cards? There’s so much to discover in Cedar Cove. Make time for friends. Make time for Debbie Macomber.", "hash": "f1ada995-3767-4770-9f0b-60a7bcc89d0c"}, {"title": "Hearts Divided (Cedar Cove #0)", "author": "Debbie Macomber", "pgs": 38, "sum": "Storyline: \nHearts Divided: 5-B Poppy Lane\\The Apple Orchard\\Liberty Hall (Cedar Cove #5.5) by Debbie Macomber , Katherine Stone , Lois Faye Dyer Three acclaimed authors team up for this collection of three brand-new contemporary romances about past and present love. Includes Macomber's \"5-B Poppy Lane,\" Stone's \"The Apple Orchard,\" and Dyer's \"Liberty Hall.\" Original.", "hash": "fb055e0a-33c0-4d78-acc6-23df3dd4840c"}, {"title": " 6 Rainier Drive (Cedar Cove #6)", "author": "Debbie Macomber", "pgs": 52, "sum": "Storyline: \n6 Rainier Drive (Cedar Cove #6) 6 RAINER DRIVE CEDAR COVE, WASHINGTON DEAR READER, As you may have heard, we've recently had quite a shock. My husband, Seth, and I lost our business, The Lighthouse restaurant --- to arson. The investigation continues. The prime suspect is a young ex-employee named Anson Butler, who disappeared right after the fire. So Seth and I are trying to sort out our lives. (And let me tell you, this kind of crisis is not good for a marriage.) In the meantime, life goes on for everyone else in Cedar Cove --- with marriages, births, reunions and even the occasional scandal. One of the most interesting pieces of news is that Cal, who works on Cliff Harding's ranch, is now rescuing wild mustangs from Wyoming. I have to run --- I'm meeting an old friend, Warren Saget, for lunch. Let's talk soon, and I'll fill you in on everything that's happening in town! JUSTINE", "hash": "140941c3-11ce-4013-a949-b4c8b3a2b78e"}, {"title": " 74 Seaside Avenue (Cedar Cove #7)", "author": "Debbie Macomber", "pgs": 52, "sum": "Storyline: \n74 Seaside Avenue (Cedar Cove #7) Dear Reader, I'm living a life I couldn't even have\" dreamed\" of a few years ago. I'm married to Bobby Polgar now (you know, the famous chess champion who just happens to be the man I love!). And we've got this beautiful house with a view of Puget Sound. Lately something's been worrying Bobby, though. When I asked, he said he was 'protecting his queen' and I got the oddest feeling he wasn't talking about chess but about \"me.\" He wouldn't say anything else. Do you remember Get Nailed, the beauty salon in Cedar Cove? I still work there. I'll tell you about my friend Rachel, who's got two men interested in her (count 'em, \"two\"). And I'll let you in on what I've heard about Linnette McAfee, who left town when her love life fell apart. (\"That\" kind of trouble I know all about.) Come in soon for a manicure and a chat, okay? Teri ( Miller) Polgar", "hash": "395372bf-2151-4b96-83a8-bc2171cdf5c2"}, {"title": " 8 Sandpiper Way (Cedar Cove #8)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \n8 Sandpiper Way (Cedar Cove #8) 8 SANDPIPER WAY CEDAR COVE, WASHINGTON DEAR READER: I have something to confide in you. I think my husband, Dave, might be having an affair. I found an earring in his pocket, and it's not mine. I'm also worried because some jewelry was recently stolen from an old woman --- and Dave used to visit her a lot. You see, he's a pastor. And a good man. I can't believe he's guilty of anything, but why won't he tell me where he's been when he comes home so late? Reader, I'd love to hear what you think. I also want to tell you what's going on with your other friends in Cedar Cove. Like Sheriff Troy Davis, to mention one. His long-ago love, Faith Beckwith, just moved here! So come on in and join me for a cup of tea. EMILY FLEMING", "hash": "bc27bc8c-a35c-4756-aed5-30083c286c83"}, {"title": "A Cedar Cove Christmas (Cedar Cove #0)", "author": "Debbie Macomber", "pgs": 25, "sum": "Storyline: \nA Cedar Cove Christmas (Cedar Cove #8.5) Mother-to-be Mary Jo Wyse arrives in Cedar Cove on Christmas Eve, searching for her baby's father. David Rhodes had said he'd be in town. But he isn't. Which leaves Mary Jo stranded, pregnant and alone. And there's no room at the local inn.... So Grace Harding brings Mary Jo home to her nearby ranch. She and her husband, Cliff, have a houseful of guests, but they offer her a room over their stable (currently sheltering the animals--including a donkey and a camel--for Cedar Cove's Nativity pageant!). When Mary Jo goes into labor that night, a young man named Mack McAfee, a paramedic, comes to her rescue, just as her brothers--the three Wyse men--show up in town. The people of Cedar Cove join them in celebrating the birth of baby Noel. But no one has more to celebrate than Mack. Because this Christmas brings him faith, hope and love...", "hash": "9b393d7c-806d-4fbb-8317-8edf53d14072"}, {"title": " 92 Pacific Boulevard (Cedar Cove #9)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \n92 Pacific Boulevard (Cedar Cove #9) Olivia Lockhart-GriffinCedar Cove, Washington Dear Listener, I'm sorry to say that our good sheriff, Troy Davis, has suffered a disappointment in love. He was hoping to marry his onetime girlfriend, Faith Beckwith, who recently moved back to town. Well, the latest is that Faith ended the relationship last month, even though both of them are widowed and available. According to Troy, there were a few misunderstandings between them?some inadvertently caused, it seems, by his daughter, Megan. Troy's got plenty to keep him occupied, though?like the unidentified remains found in a cave outside town. And the break-ins at 204 Rosewood Lane, the house Faith just happens to be renting from Grace Harding?. All of that's a distraction from what's happening in my life. I'm going through chemo right now, and I'm so grateful for my husband, Jack, my family and my friends, who give me the strength and support I need to beat this. But beat it I will! I'd suggest meeting at Troy's place, 92 Pacific Boulevard, so we can all talk, but the Pancake Palace is probably a better choice if you want a decent cup of coffee! Olivia", "hash": "21b12789-9c14-483d-b8c6-2f3e9fe662e4"}, {"title": " 1022 Evergreen Place (Cedar Cove #10)", "author": "Debbie Macomber", "pgs": 50, "sum": "Storyline: \n1022 Evergreen Place (Cedar Cove #10) 1022 Evergreen Place, Unit B, Cedar Cove, Washington Dear Reader, Guess what? I’m falling in love! With Mack McAfee. My baby daughter, Noelle, and I have been living next door to Mack since the spring. I’m still a little wary about our relationship, because I haven’t always made good decisions when it comes to men. My baby’s father, David Rhodes, is testament to that. I’m so worried he might sue for custody. In the meantime, the World War II letters I found are a wonderful distraction. Both Mack and I are trying to learn what happened to the soldier who wrote them and the woman he loved. Come by sometime for a glass of iced tea and I’ll show you the letters. Plus I’ll tell you the latest about Grace and Olivia, my brother Linc and his wife, Lori (who tied the knot about five minutes after they met!), and all our other mutual friends. Oh, and maybe Mack can join us. Mary Jo Wyse", "hash": "c14dca45-9425-488f-9d5b-95d49094f5c2"}, {"title": " 1105 Yakima Street (Cedar Cove #11)", "author": "Debbie Macomber", "pgs": 49, "sum": "Storyline: \n1105 Yakima Street (Cedar Cove #11) 1105 Yakima Street Cedar Cove, Washington Dear Reader, You’ve probably heard that my wife has left me. Rachel’s pregnant, and she says that she can’t handle the stress in our household anymore. My thirteen-year-old daughter, Jolene, is jealous of her. Maybe it’s my fault. As a widower I spoiled her – Jolene was reading over my shoulder just now and says that’s not true. She claims Rachel ruined everything. But that’s not true. The real question is: How can I get my wife back? I don’t even know where she is. She’s not with Teri Polgar or any of her other friends from the salon. The other question is. . . when will Jolene grow up and stop acting like such a brat? Of course, I’m not the only one in town with problems. Linc Wyse’s father-in-law is trying to destroy his business. And you know Charlotte Rhodes? Seems she’s becoming forgetful, and the family’s worried about her and Ben. Lots of other stuff going on – but Rachel is better at keeping up with it than I am. If you have any idea where my wife is, please give me a call. Please. —Bruce Peyton", "hash": "91133738-d1fa-44ba-8784-f07bb65d6d80"}]