[{"title": "Tattered Love (Needle's Kiss #1)", "author": "Lola Stark", "pgs": 25, "sum": "Storyline: \nTattered Love (Needle's Kiss #1) When ex-Special Ops bad-ass Mace walks into Needle's Kiss tattoo parlour, he never expected to find the girl who would turn his life upside down. Hard as nails Scarlett has been unlucky in love: she’s been burnt, chewed up and spat out. Reluctant to have another relationship, can she keep her wits about her when hot-as-sin Mace walks into her tattoo parlor? Or will he break her down and leave his mark within her ink? What starts out as a little fun, turns into something so much more. Can Scarlett look beyond Mace's devastating past or will his demons come back to haunt them both? Content warning: contains steamy, anywhere-goes sex, an alcohol induced embarrassing night out and two headstrong lovers taken on a whirlwind of crazy.", "hash": "a9c0955c-21e7-408f-b22b-5f5fec41cc50"}, {"title": "Conflicted Love (Needle's Kiss #2)", "author": "Lola Stark", "pgs": 24, "sum": "Storyline: \nConflicted Love (Needle's Kiss #2) Trip’s life motto is simple: get in, get off, get out. His lifestyle works for him, that is until he finds himself in an unexpected situation with the one girl he can't seem to get out of his mind. Teeny has been strong for too long. One amazing crazy night, with her best friend's cocky colleague, leaves her with more than just unwanted feelings and cravings she just can’t seem to quench. She's knocked up. He's freaked out. Life is about to get crazy for two people who can't stand to be close, yet can't seem to pull apart. Tension and confusion turn into mood swings and midnight snacks. How can things ever go back to simple times when every direction leads to chaos?", "hash": "b460d512-3c0a-4d70-b68b-dd572033845d"}, {"title": "Navy Wife (Navy #1)", "author": "Debbie Macomber", "pgs": 32, "sum": "Storyline: \nNavy Wife (Navy Series #1) Impulsive, wounded, vulnerable, Lindy Kyle was unprepared for a roommate like Rush Callaghan. Strong, sensitive and sexy, the temporarily dry-docked naval officer was everything she'd ever dreamed of in a man…in a husband. But Rush placed duty to his country above all else. Though he and Lindy were swept away on a tide of passion, he was called back to sea. They say absence makes the heart grow fonder—but will their marriage survive their partings?", "hash": "5c32e444-dc77-4b61-93db-396bbd21ebc3"}, {"title": "Navy Blues (Navy #2)", "author": "Debbie Macomber", "pgs": 31, "sum": "Storyline: \nNavy Blues (Navy Series #2) From New York Times bestselling author Debbie Macomber comes Navy Blues, a poignant and emotional tale in her popular Navy series. After many years, Silhouette Books is proud to give readers the chance to enjoy Debbie Macomber's famous Navy series. Spanning five books, this emotional series brought fans Debbie's trademark humor, poignancy and affable characters. Navy Blues follows the February rerelease of the first title, Navy Wife, and will pave the way for the remaining three Navy titles coming in 2004. Carol Kyle hadn't spoken to her bullheaded ex-husband in nearly a year, so luring him into her bed for one tempestuous night would be no mean feat. But even if it required strategy skills befitting a Navy admiral, she would manage. Because Carol wanted a child, and only Lieutenant Commander Steve Kyle would do as father-to-be. Somehow she'd break through the wall of bitterness Steve was hiding behind. Shameless seduction wasn't forthright Carol's style, but her slinky red dress and an unsteady Christmas tree seemed to be working to sultry perfection...until her carefully wrought baby-trap suddenly slammed shut--on her own unsuspecting heart!", "hash": "b861d790-d549-471a-acf7-2c8b1324a6a4"}, {"title": "Navy Brat (Navy #3)", "author": "Debbie Macomber", "pgs": 34, "sum": "Storyline: \nNavy Brat (Navy Series #3) New York Times bestselling author Debbie Macomber will capture readers' hearts with the third title in her popular Navy series.\" After more than 12 years, Silhouette Books is proud to bring readers Debbie's greatly anticipated \"Navy\" stories once again. Erin MacNamera had one hard-and-fast rule: never, never, never fall for a navy man. From birth through college, Erin had lived and breathed the navy as her father's career moved her family countless times. Now all Erin wants is to put down roots and live a normal life. But then she meets navy man Brand Davis...and falls in love.", "hash": "c50710c5-ef0f-4afd-b99b-9ad3fb7eaa08"}, {"title": "Navy Woman (Navy #4)", "author": "Debbie Macomber", "pgs": 31, "sum": "Storyline: \nNavy Woman (Navy Series #4) Despite the strictly taboo laws of naval fraternizing, navy attorney Catherine Fredrickson and her new boss, Royce Nyland, find themselves strongly attracted. For how long will they be able to resist each other...?", "hash": "140250c1-aeb0-42e9-a95f-ebb03da4718a"}, {"title": "Navy Baby (Navy #5)", "author": "Debbie Macomber", "pgs": 34, "sum": "Storyline: \nNavy Baby (Navy Series #5) Forced into marriage by Hannah Raymond's preacher father, naval seaman Riley Murdock vows to be a good husband and give his children everything he never had. But is this enough to lead to love?", "hash": "86d85602-4898-44f0-8042-9507661016de"}, {"title": "Navy Husband (Navy #6)", "author": "Debbie Macomber", "pgs": 32, "sum": "Storyline: \nNavy Husband (Navy #6) Hi Ali, Just a quick note from your ever-loving sister. Wanted to bring you up to date on how things are going with Jazmine. After all, I am — according to the Navy — your official \"parenting plan.\" I adore Jazmine. But who knew that a nine-year-old had so many opinions? Including an opinion on my love life (or lack thereof). I'm pretty sure she's trying to set me up with that friend of yours, Adam Kennedy. Excuse me Lieutenant Commander Adam Kennedy. Yeah, yeah, I know. He's great looking and very helpful(if a little dictatorial), but I am not in the market for a Navy husband. Do me a favor — tell your daughter that, okay? Love you. Miss you. Shana", "hash": "f2e47a21-dc48-41b2-a190-58b1beceed49"}, {"title": "Right Next Door ", "author": "Debbie Macomber", "pgs": 54, "sum": "Storyline: \nRight Next Door (The Courtship of Carol Sommars & Father's Day) The Courtship of Carol Sommars Peter Sommars is fifteen, and what he needs is a little more independence. Which is why he'd like his mom, Carol, to start dating. He even knows the perfect man Alex Preston, his best friend's dad. As it turns out, Alex is interested, but Carol's doing everything she can to sidestep his pursuit. Which only makes Alex and the boys more determined! Father's Day Robin Masterson's ten-year-old son, Jeff, figures he needs a dog more than anything in the world. And there just happens to be one right next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighborhood. Still, Jeff persists…and soon his mom and Cole are looking at each other in a whole new way.", "hash": "57244426-585c-4f06-9aa2-b58fb56879d3"}, {"title": "A Mother's Wish ", "author": "Debbie Macomber", "pgs": 46, "sum": "Storyline: \nTwo stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg's teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - 'Wanted: Perfect Partner. I'm dating-shy, divorced and seeking a man with marriage in mind.' Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? In the second story, \"Father's Day\", Robin Masterton's young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there's a chance he'll have a dog, and a dad in time for Father's Day...", "hash": "0a6a7168-02a3-4380-aec3-1010c58022a0"}]