[{"title": "A Hathaway Wedding (The Hathaways #2.5)", "author": "Lisa Kleypas", "pgs": 10, "sum": "Storyline: \nThis is a free Hathaway short story about Win Hathaway and Kev Merripen's wedding.", "hash": "5c9484ab-a79a-4dd1-91c6-87ffd6b605e0"}, {"title": "Seduce Me at Sunrise (The Hathaways #2)", "author": "Lisa Kleypas", "pgs": 93, "sum": "Storyline: \nHe has tried hard to forget her. Kev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation... and before long Win is torn from him by a devastating twist of fate. Can she remember the man he once was? Then, Win returns to England... only to find that Kev has hardened into a man who will deny love at all costs. Meantime, an attractive, seductive suitor has set his sights on Win. It’s now or never for Kev to make his move. But first, he must confront a dangerous secret about his destiny—or risk losing the only woman he has lived for...", "hash": "5af3dd35-3c57-4013-ad6d-dc40efda3d13"}, {"title": "Tempt Me at Twilight (The Hathaways #3)", "author": "Lisa Kleypas", "pgs": 99, "sum": "Storyline: \nHe was everything she'd sworn to avoid. Poppy Hathaway loves her unconventional family, though she longs for normalcy. Then fate leads to a meeting with Harry Rutledge, an enigmatic hotel owner and inventor with wealth, power, and a dangerous hidden life. When their flirtation compromises her own reputation, Poppy shocks everyone by accepting his proposal—only to find that her new husband offers his passion, but not his trust. And she was everything he needed. Harry was willing to do anything to win Poppy—except to open his heart. All his life, he has held the world at arm’s length…but the sharp, beguiling Poppy demands to be his wife in every way that matters. Still, as desire grows between them, an enemy lurks in the shadows. Now if Harry wants to keep Poppy by his side, he must forge a true union of body and soul, once and for all...", "hash": "2aa606c3-87b3-459e-bb53-3e4347646928"}, {"title": "Mine Till Midnight (The Hathaways #1)", "author": "Lisa Kleypas", "pgs": 97, "sum": "Storyline: \nWhen an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...", "hash": "35e14b4d-abd8-4952-8fc8-977580f5ab50"}, {"title": "Castles (Crown's Spies #4)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nOrphaned and besieged Princess Alesandra knew that only hasty marriage to an Englishman could protect her from the turmoil in her own land. To the amusement of her makeshift guardian, Colin, younger brother of the Marquess of Caineswood, the bold raven-haired beauty instantly captivated London society. But when Alesandra was nearly abducted by her unscrupulous countrymen, the fighting instincts that won Colin a knighthood for valor were rekindled. Deceiving himself that he wanted only to protect her, Colin swept her into a union meant to be a marriage in name alone ... yet Alesandra's tender first kiss and hesitant caress ignited a wildfire in his soul. As the lovely princess dashed headlong into unforeseen dangers, Colin would follow, knowing he must claim her as his own forever. Now he would risk life itself before he would lose this sweet, tempestuous angel...", "hash": "91c2dcbf-23b1-4634-a29d-fdd84ef08eda"}, {"title": "The Gift (Crown's Spies #3)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nA child bride, Sara Winchester had grown into a winsome beauty, joyfully anticipating the day when her husband Nathan, Marquess of St. James, would return to claim her heart at last. Charmingly innocent, she dismissed the ancient feud that divided Nathan's family from her own...and she was totally unaware of his past exploits as the notorious pirate, Pagan. The man who now stood before her was perplexing, arrogant and powerfully handsome...a warrior-gentleman whose gentle touch aroused her to the wildest, deepest pleasures of love. Nathan had never bared his soul to any woman, but he was soon utterly beguiled and exasperated by Sara's sweet, defiant ways. Aboard his ship, The Seahawk, she was brave, imperious and determined to win his heart completely -- yet upon their return to England, her love would be sorely tested as a vile conspiracy tried to tear them apart. With their future at stake, they would discover the true destiny of their passion...for all time!", "hash": "c4a7fb53-8dae-4212-860f-0eed81405fc6"}, {"title": "Guardian Angel (Crown's Spies #2)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nThe Emerald flew across the seas, carrying the pirate Pagan -- despised by the ton, whose riches he plundered, and beloved by the poor, whose plight was eased by his gifts. The Marquess of Cainewood vows to hunt down the pirate wretch in revenge for his brother's death. But when Jade, an enchanting vision of rippling red hair and eyes of jewel-green, appears at his door to beg desperately for his protection, the Marquess agrees to keep her safe from the villains who want her dead. Jade is infuriating, exasperating, and gorgeous; Caine is noble, strong-willed, and powerful. No woman has ever befuddled him so, nor so deeply aroused his desire. But as Jade answers his knowing caresses with an innocent, wild abandon, they are drawn into a web of treachery that will test the very heart of their love!", "hash": "1609cd49-9158-46a0-854e-6425ff8bc956"}, {"title": "The Lion's Lady (Crown's Spies #1)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nChristina Bennett had taken London society by storm. The ravishing beauty guarded the secret of her mysterious past until the night Lyon, Marquis of Lyonwood, stole a searching, sensuous kiss. An arrogant nobleman with a pirate's passions, he tasted the wild fire smoldering beneath Christina's cool charm and swore to possess her... But the feisty and defiant Christina would not be so easily conquered. Mistress of her heart and of her fortune, she resisted Lyon's sensuous caresses. She dared not surrender to his love...for then, she must also forsake her precious secret...and her promised destiny!", "hash": "5afbf18c-e329-4b6d-bb55-d907852e0ed1"}, {"title": "Summer in Eclipse Bay (Eclipse Bay #3)", "author": "Jayne Ann Krentz", "pgs": 75, "sum": "Storyline: \nWord gets around fast in Eclipse Bay. Nick Harte should know - his family's legendary feud with the Madisons fueled the local gossip mill for years before finally cooling off. But people are still talking - and rumor has it Nick's involved with someone new... Art gallery owner Octavia Brightwell doesn't take chances - especially on handsome, charming men. But that's only part of the reason why she turned Nick down six times before - finally - agreeing to a date. Octavia's related to the woman who sparked the long-time family feud - and fears that falling hard for Nick would only ignite the flames again. Octavia knows her family's past is best kept hidden. But her secret isn't safe in Eclipse Bay - and neither is her heart...", "hash": "8425def6-fe6b-4b17-9d28-77f4ebe2721a"}, {"title": "Dawn in Eclipse Bay (Eclipse Bay #2)", "author": "Jayne Ann Krentz", "pgs": 78, "sum": "Storyline: \nFrom New York Times bestselling author Jayne Ann Krentz—the second novel in a dramatic trilogy set in breathtaking Eclipse Bay, a town filled with rivalries as fierce and compelling as the rugged Oregon coast….Nothing was ever simple between a Madison and a Harte. The feud that had divided their families still simmered. Now, only months after their siblings’ wedding, Lilian Harte and Gabe Madison are at each other’s throats. Successful CEO Gabe had insisted on becoming a client of Lilian’s matchmaking service. And after five disastrous dates, Lilian is at her wit’s end. If she hadn’t already decided to close her business and move home to Eclipse Bay, Gabe would have been the final straw. But when she finds Gabe at her door demanding she fulfill their business contract, the sparks between them suddenly turn personal. Once again, Eclipse Bay will witness a showdown—between a relentless Madison and an irresistible Harte…", "hash": "dd58e5fa-748d-4868-92cb-0854ebfef24a"}]