[{"title": "An Engagement in Seattle ", "author": "Debbie Macomber", "pgs": 60, "sum": "Storyline: \nAn Engagement in Seattle: Groom Wanted\\Bride Wanted (From This Day Forward #1-2) Aleksandr Berinksi is a Russian biochemist in the U.S. on a visa that is about to expire. Marriage will allow him to stay&#151;marriage to Julia Conrad. If Julia's going to save her Seattle-based company, she needs him as much as he needs her. There's a Groom Wanted in Julia's life. And not just any groom! A billboard on the side of a Seattle road is common enough&#151;but one advertising for a bride? It's Chase Goodwin's solution to the problem of finding a wife quickly, a wife to bring home to Alaska. Lesley Campbell has her own reasons for responding&#133;and in no time she's the Bride Wanted in Chase's life!", "hash": "069b1ade-9e84-4ce3-86b7-f249918eec30"}, {"title": "Buffalo Valley ", "author": "Debbie Macomber", "pgs": 25, "sum": "Storyline: \nBuffalo Valley (Dakota #4) In this charming volume, Buffalo Valley faces a new challenge. Everyone thinks Vaughn Kyle has come to town to meet Hassie Knight. After all, Vaughn was named after Hassie's dead son, and this is the first time he's come to town. What the folks in town don't know is that Vaughn's fiancée, Natalie Nichols, works for the Value-X conglomerate, and that Natalie has asked Vaughn to use this visit as a scouting trip to evaluate Buffalo Valley as a location for one of their superstores. If that store gets built, it will be goodbye Main Street, including Hassie Knight's drugstore. Once Vaughn meets Hassie's assistant, Carrie Hendrickson, it doesn't take long for him to realize that he's facing one of the most important choices of his life. He's caught between Value-X and Buffalo Valley, between Natalie's corporate savvy and Carrie's country-girl smarts, and between the future he always envisioned for himself and the appealing way of life that he glimpsed in the unique little town.", "hash": "48a83e62-cbc6-4bba-b80a-bcb0fd588f96"}, {"title": "Catching Jordan (Hundred Oaks #1)", "author": "Miranda Kenneally", "pgs": 38, "sum": "Storyline: \nCatching Jordan (Hundred Oaks #1) ONE OF THE BOYS What girl doesn't want to be surrounded by gorgeous jocks day in and day out? Jordan Woods isn't just surrounded by hot guys, though-she leads them as the captain and quarterback of her high school football team. They all see her as one of the guys and that's just fine. As long as she gets her athletic scholarship to a powerhouse university. But everything she's ever worked for is threatened when Ty Green moves to her school. Not only is he an amazing QB, but he's also amazingly hot. And for the first time, Jordan's feeling vulnerable. Can she keep her head in the game while her heart's on the line?", "hash": "f7484002-f7d5-4358-bf62-0bc9e5ea8aa2"}, {"title": "Stealing Parker (Hundred Oaks #2)", "author": "Miranda Kenneally", "pgs": 34, "sum": "Storyline: \nStealing Parker (Hundred Oaks #2) Red-hot author Miranda Kenneally hits one out of the park in this return to Catching Jordan's Hundred Oaks High. Parker Shelton pretty much has the perfect life. She’s on her way to becoming valedictorian at Hundred Oaks High, she’s made the all-star softball team, and she has plenty of friends. Then her mother’s scandal rocks their small town and suddenly no one will talk to her. Now Parker wants a new life. So she quits softball. Drops twenty pounds. And she figures why kiss one guy when she can kiss three? Or four. Why limit herself to high school boys when the majorly cute new baseball coach seems especially flirty? But how far is too far before she loses herself completely?", "hash": "57d55dfa-4b84-4b2c-ac15-61a43fd4ecb2"}, {"title": "Things I Can't Forget (Hundred Oaks #3)", "author": "Miranda Kenneally", "pgs": 34, "sum": "Storyline: \nThings I Can't Forget (Hundred Oaks #3) Companion to Catching Jordan and Stealing Parker. Kate has always been the good girl. Too good, according to some people at school—although they have no idea the guilty secret she carries. But this summer, everything is different… This summer she’s a counselor at Cumberland Creek summer camp, and she wants to put the past behind her. This summer Matt is back as a counselor too. He’s the first guy she ever kissed, and he’s gone from a geeky songwriter who loved The Hardy Boys to a buff lifeguard who loves to flirt--with her. Kate used to think the world was black and white, right and wrong. Turns out, life isn’t that easy…", "hash": "a5d100ea-6f12-457c-b44f-70dd8568b77c"}, {"title": "Racing Savannah (Hundred Oaks #4)", "author": "Miranda Kenneally", "pgs": 34, "sum": "Storyline: \nRacing Savannah (Hundred Oaks #4) They’re from two different worlds. He lives in the estate house, and she spends most of her time in the stables helping her father train horses. In fact, Savannah has always been much more comfortable around horses than boys. Especially boys like Jack Goodwin—cocky, popular and completely out of her league. She knows the rules: no mixing between the staff and the Goodwin family. But Jack has no such boundaries. With her dream of becoming a horse jockey, Savannah isn’t exactly one to follow the rules either. She’s not going to let someone tell her a girl isn’t tough enough to race. Sure, it’s dangerous. Then again, so is dating Jack…", "hash": "93395b8f-0ecf-463b-8c38-497c1cb01826"}, {"title": "The Forever of Ella and Micha (The Secret #2)", "author": "Jessica Sorensen", "pgs": 44, "sum": "Storyline: \nThe Forever of Ella and Micha (The Secret #2) Ella and Micha have survived tragedy and heartbreak. When they're together, anything seems possible. But now they are thousands of miles apart, and managing their long distance relationship will put their love to the test. Ella is back at school, trying hard not worry so much about her future. But with her father in and out of rehab, she's having a hard time making it through the days. All she wants is Micha by her side, but she refuses to let her problems get in the way of his dreams. Micha spends his days touring the country with his band, but deep down he knows something is missing. Being away from Ella is harder than he thought it would be. He wants her closer to him-needs her with him. But he won't ask her to leave college, just to be with him. The few moments they do spend together are intense and passionate, but it only makes it more difficult when they have to part. They know they want to be together, but is wanting something enough to get them to their forever?", "hash": "471b9454-dbce-4f1f-994f-4d51182c4bd4"}, {"title": "The Temptation of Lila and Ethan (The Secret #3)", "author": "Jessica Sorensen", "pgs": 53, "sum": "Storyline: \nThe Temptation of Lila and Ethan (The Secret #3) On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She'll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there's only one person who's there to pull her out: Ethan Gregory. Ethan set the rules a long time ago: he and Lila are just friends. He doesn't do relationships. Although his tattooed, bad boy exterior is a far cry from Lila's pretty princess image, Ethan can't deny they have a deeper connection than he's used to. If he's not careful, he could be in serious danger of becoming attached-and he's learned the hard way that attachment only leads to heartbreak. When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?", "hash": "a459530b-0175-4577-969a-b4fe105b8f60"}, {"title": "The Ever After of Ella and Micha (The Secret #4)", "author": "Jessica Sorensen", "pgs": 36, "sum": "Storyline: \nThe Ever After of Ella and Micha (The Secret #4) The day Ella has waited for is just around the corner. It's the day she'll marry Micha, the love of her life, the light that guided her out of the darkness. It looks like it will be the perfect Christmas-until an unexpected package arrives with a harsh reminder of Ella's past. Suddenly Ella doesn't feel as confident about her future. Can she really have a \"happily-ever-after\" if she's never even seen one? Micha will stand by Ella no matter what she's going through-though he worries that she might leave him standing at the altar again. When he's offered a once-in-a-lifetime chance to tour with his favorite bands for three months, Micha knows he can't leave Ella behind. But can he ask her to uproot her life to join him on the road? Now Ella and Micha must find a way to balance their fears, their dreams, and their love . . . if they ever want to hear wedding bells.", "hash": "421d269e-c1fb-491c-987c-016923021558"}, {"title": "Lila and Ethan: Forever and Always (The Secret #0)", "author": "Jessica Sorensen", "pgs": 16, "sum": "Storyline: \nLila and Ethan: Forever and Always (The Secret #4.5) Lila Summers just wants to know one thing for certain: that Ethan Gregory will be with her always. Once her friend, he's become so much more, melting the pain of her past away with each kiss. Now Lila is on a road trip with Ethan, in the wilderness under the stars, and she can't imagine her life without him. But when she talks about the future, something in Ethan changes . . . Ethan has no doubts about his feelings for Lila. His life with her gets better every day-and that's the scary part. How can he walk into a future where he has everything to lose? With Lila, his whole heart is on the line for the very first time. But if Ethan can't give her the promise she needs, his greatest fear might come true: he'll lose Lila for good.", "hash": "4c2ece0a-d736-4940-b85a-f3af2e2fc44e"}]