[{"title": "The Coincidence of Callie & Kayden (The Coincidence #1)", "author": "Jessica Sorensen", "pgs": 43, "sum": "Storyline: \nThe Coincidence of Callie & Kayden (The Coincidence #1) For Kayden, suffering in silence was the only way to survive. If he was lucky, he could keep his head down, do as he was told, and make it through the day. But one night it seemed like his luck -- and his life -- might finally end... until an angel named Callie appeared just in time to rescue him. Callie has never believed in luck. Not since her twelfth birthday when everything was taken from her. After the worst was over, she locked up her feelings and vowed never to tell anyone what happened. Now, six years later, she continues to struggle with the painful secret that threatens to consume her. When fate lands Kayden and Callie at the same college, Kayden is determined to get to know the beautiful girl who changed his destiny. Quiet and reserved, Callie still fears letting anyone else into her world. But Kayden is certain that Callie has come back into his life for a reason. And the more he tries to be a part of her life, the more he realizes that, this time, it's Callie who needs to be saved...", "hash": "f3443ecd-3cc8-483b-94f5-327650f799c8"}, {"title": "The Redemption of Callie & Kayden (The Coincidence #2)", "author": "Jessica Sorensen", "pgs": 47, "sum": "Storyline: \nThe Redemption of Callie & Kayden (The Coincidence #2) The dark secret Kayden has kept hidden for years is out. Worse, he's facing charges for battery. The only way he stands a chance against the charges is if Callie speaks up, something he'll never ask her to do. Callie knows Kayden is going back to his dark place and desperately wants to save him. But saving him means admitting her secrets aloud. Callie and Kayden are stronger than they think, especially when they're together. Together they move forward, face their demons, and finally start to heal from their traumatic pasts.", "hash": "92cd05fc-3d3a-4ed0-9c60-128fdb34e74c"}, {"title": "Shattered Promises (Shattered Promises #1)", "author": "Jessica Sorensen", "pgs": 44, "sum": "Storyline: \nShattered Promises (Shattered Promises #1) For twenty-one year-old Gemma, life has never been normal. She knows nothing about her past and has been haunted by the same monsters in her nightmares for the last few months. Unemotional and numb to life, she feels disconnected from everyone. Until the very first day she cries. After that, nothing in her life is the same. Her emotions slowly surface and she starts experiencing love, happiness, and anger, feelings she never knew existed. But they leave her confused and she doesn’t know whether to embrace them or run away from them. Her life only gets more complicated when she meets Alex. Sexy, arrogant, and secretive, Alex can get under Gemma’s skin like no one can. Yet she’s drawn to him by an invisible connection she has no control over. She’s also seen him before. In her nightmares. Every part of Gemma’s mind is screaming at her to stay away from Alex, but every other part of her is begging to get close to him. But the closer she gets, the more she realizes Alex knows more about her than he originally let on. As secrets about her past unravel, Gemma’s life becomes threatened. She needs to figure out what’s going on, before she winds up dead. But the only person she can turn to for answers is the one person she isn’t sure she can trust.", "hash": "bcb70fa8-6272-4e4d-b414-ecab5bea7261"}, {"title": "Fractured Souls (Shattered Promises #2)", "author": "Jessica Sorensen", "pgs": 42, "sum": "Storyline: \nFractured Souls (Shattered Promises #2) Gemma thought she had said her good-byes and had felt every possible emotion she could before her soul was detached again. Deep down inside, she hoped she’d never wake up from it because, in her eyes, life without emotion and memories isn’t worth living. But she does wake up and discovers she can still feel and remember everything she experienced over the last few months. Alex is also telling her that everything’s okay, that he didn’t betray her, and that what she thought happened really didn’t. Gemma isn’t sure if she can trust Alex, so she tries to keep her distance from him, even though the electric connection and her desire make it nearly impossible. The only person she can trust is Laylen, but even that becomes complicated when the lines of their friendship begin to blur. While Gemma struggles with her emotions and relationships, she searches for her mother, entering a dangerous world of secrets, seduction, and evil. The further she digs into her mother’s secrets and past, the more she wonders what waits for her at the end of her search and if maybe some things are better left in the dark.", "hash": "61f68b01-5dd4-4f9d-8d2f-a0e7b0eb54d1"}, {"title": "Breaking Nova (Nova #1)", "author": "Jessica Sorensen", "pgs": 43, "sum": "Storyline: \nBreaking Nova (Nova #1) Nova Reed used to have dreams-of becoming a famous drummer, of marrying her true love. But all of that was taken away in an instant. Now she's getting by as best she can, though sometimes that means doing things the old Nova would never do. Things that are slowly eating away at her spirit. Every day blends into the next . . . until she meets Quinton Carter. His intense, honey brown eyes instantly draw her in, and he looks just about as broken as she feels inside. Quinton once got a second chance at life-but he doesn't want it. The tattoos on his chest are a constant reminder of what he's done, what he's lost. He's sworn to never allow happiness into his life . . . but then beautiful, sweet Nova makes him smile. He knows he's too damaged to get close to her, yet she's the only one who can make him feel alive again. Quinton will have to decide: does he deserve to start over? Or should he pay for his past forever?", "hash": "490a34c1-b623-42aa-9e4e-402ebb08274c"}, {"title": "Orchard Valley Grooms (Orchard Valley #0)", "author": "Debbie Macomber", "pgs": 46, "sum": "Storyline: \nOrchard Valley Grooms: Valerie\\Stephanie (Orchard Valley #1-2) Valerie rushes home to Orchard Valley, Oregon, when her father, David, suffers a heart attack. She and her two younger sisters, Stephanie and Norah, are gathering at his side, praying he'll live, fearing he'll die&hellip;. At a time like this, falling in love is the last thing on Valerie's mind. And with Dr. Colby Winston, of all people! He's David's heart surgeon, a renowned specialist who enjoys small-town living, while Valerie is a high-powered businesswoman who prefers city life. They're complete opposites in every way. Yet David keeps insisting she and Colby are a perfect couple. Meanwhile Stephanie has other worries besides her father's health. She'd fled Orchard Valley three years earlier after her humiliating rejection by local journalist Charles Tomaselli. Now she's home, and it's not long before they begin reliving past battles&mdash;and renewing old feelings. He was the reason she left. This time, will he give her a reason to stay? David seems to think so&hellip;.", "hash": "6997acf6-5275-4957-ba03-faec7970411c"}, {"title": "Born in a Small Town (Patton's Daughters #4)", "author": "Debbie Macomber", "pgs": 36, "sum": "Storyline: \nBorn in a Small Town (Patton's Daughters, #4) In this three-in-one story collection, fans of Macomber's \"Midnight Sons\" series meet a whole new generation of family members and get updates on original characters in \"Midnight Sons and Daughters\". In addition, Bowen welcomes readers back to Glory, Alberta, in \"The Glory Girl\" and Johnson continues her \"Patton's Daughter's\" tale with \"Promise Me Picket Fences\".", "hash": "7cdb4b7f-8f74-4fc3-be49-a9a93d7ff741"}, {"title": "Marriage of Inconvenience (Those Manning Men #1)", "author": "Debbie Macomber", "pgs": 31, "sum": "Storyline: \nMarriage of Inconvenience (Those Manning Men #1) Rich Manning had known Jamie Warren forever. And he loved her--strictly as a friend. But all that changed the day Jamie asked him to be the father of her as-yet-unconceived child! Rich agreed on one condition: they marry. Suddenly, Rich was discovering a side of Jamie he'd never seen before, and was swept away by a passion sweeter than anything he'd ever known ... a passion that stunned his senses. But could he prove to the headstrong Mrs. Manning that it was time to let the world in on their secret--that their love was truly here to stay?", "hash": "2bf8b811-27f5-4fa5-907e-6ac03428d24f"}, {"title": "The Manning Grooms (Those Manning Men #0)", "author": "Debbie Macomber", "pgs": 59, "sum": "Storyline: \nThe Manning Grooms (Those Manning Men #3-4) Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason's feelings start to change once he gets to know his Bride on the Loose.", "hash": "26630454-ee99-4eb9-b9f4-e6bc476ca71c"}, {"title": "A Touch of Crimson (Renegade Angels #1)", "author": "Sylvia Day", "pgs": 37, "sum": "Storyline: \nA Touch of Crimson (Renegade Angels #1) Adrian Mitchell is a powerful angel leading an elite Special Ops unit of Seraphim. His task is to punish the Fallen-angels who have become vampires-and command a restless pack of indentured lycans. But Adrian has suffered his own punishment for becoming involved with mortals- losing the woman he loves again and again. Now, after nearly two hundred years, he has found her-Shadoe-her soul once more inhabiting a new body, with no memory of him. And this time, he won't let her go.", "hash": "c7908c5a-d22d-42eb-bde3-e4abda24dd56"}]