[{"title": "Afterburn (Afterburn & Aftershock #1)", "author": "Sylvia Day", "pgs": 14, "sum": "Storyline: \nAfterburn (Afterburn & Aftershock #1) The realization that Jax still affected me so strongly was a jagged pill to swallow. He’d only been part of my life for five short weeks two years ago. But now he was back. Walking into a deal I’d worked hard to close. And God, he was magnificent. His eyes were a brown so dark they were nearly black. Thickly lashed, they were relentless in their intensity. Had I really thought they were soft and warm? There was nothing soft about Jackson Rutledge. He was a hard and jaded man, cut from a ruthless cloth. In that moment I understood how badly I wanted to unravel the mystery of Jax. Bad enough that I didn’t mind how much it was going to cost me...", "hash": "42e90219-7785-4a45-a20a-6a0e15def13f"}, {"title": "Breathe (Sea Breeze #1)", "author": "Abbi Glines", "pgs": 0, "sum": "Storyline: \nDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: Breathe (Sea Breeze #1) Sadie White's summer job isn't going to be on the beach life-guarding or working at rental booths like most kids her age. With her single mother's increasing pregnancy and refusal to work, Sadie has to take over her mother's job as a domestic servant for one of the wealthy summer families on a nearby island. When the family arrives at their summer getaway, Sadie is surprised to learn that the owner of the house is Jax Stone, one of the hottest teen rockers in the world. If Sadie hadn't spent her life raising her mother and taking care of the house she might have been normal enough to be excited about working for a rock star. Even though Sadie isn't impressed by Jax's fame, he is drawn to her. Everything about Sadie fascinates Jax but he fights his attraction. Relationships never work in his world and as badly as he wants Sadie, he believes she deserves more. By the end of the summer, Jax discovers he can't breathe without Sadie.", "hash": "dcd5e56b-386a-486b-9e70-d16d4823adfa"}, {"title": "Because of Low (Sea Breeze #2)", "author": "Abbi Glines", "pgs": 28, "sum": "Storyline: \nBecause of Low (Sea Breeze #2) In my debut novel, Breathe, Sadie may have fallen in love with the teen rock star, Jax Stone, but readers fell head over heels for Marcus Hardy. This is his story… Marcus Hardy had hoped to enjoy a year away at college while he put the summer he’d rather forget behind him. But instead, he’s jerked right back to the coastal town of Sea Breeze, Alabama due to a family crisis. His dear ol' dad found himself a girlfriend only a few years older than Marcus. So now his sister needs help dealing with their mother who is mentally falling apart. The only bright spot to returning is the fascinating red head who sleeps over several times a week. The problem is she's sleeping in bed with his new roommate, Cage York. Willow “Low” Foster needs a place to live. Running to Cage’s apartment every time her sister kicks her out isn’t exactly a long term solution. Juggling her courses at the local community college and a part time job doesn’t produce excess income. But Cage has a new roommate and suddenly sleeping over at her best friend’s apartment isn’t such a bad thing. Not when she gets to see those sexy green eyes of Marcus Hardy’s twinkle when he smiles at her like he wants her there. Even though Cage seems a little territorial where Low is concerned, Marcus finds time to spend with Low without upsetting his roommate. Cage may use his small college baseball star persona to sleep with every hot female in his path but he’s still under the disillusion that when he’s through sowing his wild oats, he’s going to marry Low. Marcus intends to change that assumption for both Cage and Low. Until his carefully laid plans come crashing down with a revelation he never expected. He’ll have to choose between Low or his family. Because once the truth comes out.... there’s no other choice.", "hash": "a1ff4f1f-50f8-4b07-9950-afeb2c59d7af"}, {"title": "While It Lasts (Sea Breeze #3)", "author": "Abbi Glines", "pgs": 26, "sum": "Storyline: \nWhile It Lasts (Sea Breeze #3) Maybe driving home after a few (or more) shots of tequila had been a bad idea, but hell, he did it all the time. The cops had to have been freaking bored to have pulled him over. He wasn’t even swerving! That’s Cage York’s story and he’s sticking to it. Unfortunately, his baseball coach isn’t buying it. Cage has a free ride to the local junior college for baseball -- or he did, until he’d gotten a DUI. Now, Cage has to decide: does he drop out and give up his dream of getting noticed by a college in the SEC, and possibly making it into the Major Leagues -- or does he give in to his coach’s demands and spend his summer baling hay? Eva Brooks planned out her life step by step when she was eight years old. Not once over the years had she lost sight of her goals. Josh Beasley, her next door neighbor, had been the center of those goals. He’d been her first boyfriend at seven, her first kiss at ten, her first date at fifteen, and her first tragedy at eighteen. The moment she’d received the phone call from Josh’s mother saying he’d been killed along with four other soldiers just north of Baghdad, Eva’s carefully planned life imploded in the worst way possible. Cage isn’t real happy with his closet-sized bedroom in the back of a foul smelling barn, or his daily interactions with cows, but he knows that if he doesn’t make his coach happy then he can kiss his scholarship goodbye. Only a sick and twisted man would decide his punishment was to be working on a farm all summer. No hot babes in bikinis waiting to meet a Southern boy to make her vacation complete. Just him and the damned cows. Oh -- and an uptight, snarky brunette with the biggest blue eyes he’s every seen. But she doesn’t count, because as hard as he’s tried to charm her out of her panties - he’s pretty sure she’d rather see him hung from the rafters than let him get a taste of her pretty little lips.", "hash": "d16b6e92-2ed1-40ef-9a9e-83dd83f281e4"}, {"title": "Just for Now (Sea Breeze #4)", "author": "Abbi Glines", "pgs": 28, "sum": "Storyline: \nJust for Now (Sea Breeze #4) The day Preston Drake figured out that wealthy women paid well for a set of tight abs and a pretty face his life turned around. The run down rat-infested trailer he had shared with his alcoholic mother and three younger siblings was now only a place he visited to pay the bills and stock the pantry with food. He no longer worried about his family starving or living without electricity. The money he made entertaining rich older women more than covered his family’s needs and his own. He had it all figured out. Except… There was this girl. She was as innocent as he was tainted. Amanda Hardy wished her knees didn’t get weak when Preston walked into a room. She hated the fact her heart raced when he flashed his smile in her direction. He had a different girl in his bed every night. He was the kind of boy a smart girl ran from. So, why was she coming up with ways to get close to him? Even when it was obvious he wanted to keep her at a distance. Maybe her heart knew something the world didn’t. Maybe Preston Drake was more than just a pretty face.", "hash": "3f1ef88f-e9cb-4141-bb77-2e9f54292b3e"}, {"title": "Sometimes It Lasts (Sea Breeze #5)", "author": "Abbi Glines", "pgs": 27, "sum": "Storyline: \nSometimes It Lasts (Sea Breeze #5) Cage York has to choose between a love of the game and a love of the girl in this sultry Sea Breeze novel from New York Times bestselling author Abbi Glines. After waiting for his big break, bad boy Cage York is finally called up to prove his worth in the college baseball arena. But when Cage’s girlfriend, Eva, mourns the sudden loss of her father, it’s not Cage’s comforting arms she runs to, but those of her former fiancé’s twin brother, Jeremy. Torn between his baseball dream and the girl of his dreams, Cage must prove he’s worthy of Eva’s love, or risk losing her to Jeremy forever.", "hash": "35c19fef-bbc3-4480-8a1e-201ac92f619e"}, {"title": "Misbehaving (Sea Breeze #6)", "author": "Abbi Glines", "pgs": 36, "sum": "Storyline: \nMisbehaving (Sea Breeze #6) An unexpected affair leads to mind-blowing harmony in this Sea Breeze novel from New York Times bestselling author Abbi Glines. Jason is sick of living in his rock star brother’s shadow. So when he ships off to Sea Breeze, Alabama, he’s looking for a much deserved escape and a chance to blow off some envious steam. Falling for the local bad girl was definitely not the plan. But as the new duo enjoys some naughty fun in the Alabama sun, Jason learns that even though Jax is the musician in the family, he’s not the only brother who can rock someone’s world.", "hash": "4592b6f8-8fd7-4151-8bcd-275fa8371397"}, {"title": "Twisted Perfection (Perfection #1)", "author": "Abbi Glines", "pgs": 41, "sum": "Storyline: \nTwisted Perfection (Perfection #1) Life outside of her house was a new experience for Della Sloane. The dark secrets of her past weren’t something she ever intended to share with anyone. They would never understand. No one would ever get close enough to find out. There was always a chance she’d go crazy sooner than they expected… Woods Kerrington had never been one to be attracted to fragile females. They seemed like too much work. He wasn’t in it for the work just the pleasure. A night full of naughty fun had been exactly what was on his mind when he’d laid eyes on the hot little number that didn’t know how to pump gas and needed some help. What he didn’t know was she was as fragile as they came. The carefree girl who spoke her mind and didn’t care what the world thought of her was more breakable than he could ever imagine…", "hash": "aa7b8834-8877-4078-9f3f-19fd7ed5c0ca"}, {"title": "Simple Perfection (Perfection #2)", "author": "Abbi Glines", "pgs": 49, "sum": "Storyline: \nSimple Perfection (Perfection #2) Woods had his perfect life mapped out for him. Rise up the ranks of the family business. Marry the rich girl of his parents’ dreams. Pretend that wealth and privilege was all he’d ever wanted. Then a girl named Della breezed into town, a beautifully imperfect stranger who captured his heart and opened his eyes to a new kind of future. Woods is ready and willing to sacrifice everything for her when the sudden death of his father leaves him with his mother to care for and a business to manage. Della is determined to be strong for Woods, even as she’s quietly falling to pieces. No matter how far from home she’s run, the ghosts of her past have never stopped haunting her. Struggling to hide her true feelings from Woods, Della fears she can’t be his rock without dragging him down into the darkness with her. But is she strong enough to let go of the last thing holding her together?", "hash": "7bc74c8a-b340-4781-91e7-5d4f0017cdc9"}, {"title": "Fallen Too Far (Too Far #1)", "author": "Abbi Glines", "pgs": 26, "sum": "Storyline: \nFallen Too Far (Too Far, #1; Rosemary Beach, #1) To want what you’re not supposed to have… She is only nineteen. She is his new stepfather’s daughter. She is still naïve and innocent due to spending the last three years taking care of her sick mother. But for twenty-four year old Rush Finlay, she is the only thing that has ever been off limits. His famous father’s guilt money, his mother’s desperation to win his love, and his charm are the three reasons he has never been told no. Blaire Wynn left her small farmhouse in Alabama, after her mother passed away, to move in with her father and his new wife in their sprawling beach house along the Florida gulf coast. She isn’t prepared for the lifestyle change and she knows she’ll never fit into this world. Then there is her sexy stepbrother who her father leaves her with for the summer while he runs off to Paris with his wife. Rush is as spoiled as he is gorgeous. He is also getting under her skin. She knows he is anything but good for her and that he’ll never be faithful to anyone. He is jaded and has secrets Blaire knows she may never uncover but even knowing all of that… Blaire just may have fallen too far.", "hash": "f1433e9e-95d8-494a-9ce9-845e48e2cb23"}]