[{"title": "Never Too Far (Too Far #2)", "author": "Abbi Glines", "pgs": 44, "sum": "Storyline: \nNever Too Far (Too Far, #2; Rosemary Beach, #2) He had held a secret that destroyed her world. Everything she had known was no longer true. Blaire couldn’t stop loving him but she knew she could never forgive him. Now, she was back home and learning to live again. Moving on with life… until something happened to send her world spinning once again. What do you do when the one person you can never trust again is the one that you need to trust so desperately? You lie, hide, avoid, and pray that your sins never find you out.", "hash": "2cb960b8-c43f-4680-a22b-8a6ded5d864f"}, {"title": "Forever Too Far (Too Far #3)", "author": "Abbi Glines", "pgs": 44, "sum": "Storyline: \nForever Too Far (Too Far, #3; Rosemary Beach, #3) Rush promised her forever... but promises can be broken. Torn between his love for his family and his love for Blaire, Rush has to find a way to save one without losing the other. In the end one has to be more important. Letting go isn’t easy. Blaire believed in her fairytale... but no one can live in a fantasy. Her love for Rush and desire to have a family keep her believing that they can find a way for this to work. Until she has to make the right decision for her and the baby. Even if it breaks her heart. Can they find the forever that they both want or has it all just gone... too far?", "hash": "fed224e2-9450-4bbe-9385-2e66f56b21d5"}, {"title": "The Vincent Boys (The Vincent Boys #1)", "author": "Abbi Glines", "pgs": 29, "sum": "Storyline: \nThe Vincent Boys (The Vincent Boys #1) Ashton is getting tired of being good, of impressing her parents and playing ideal girlfriend to Sawyer Vincent. Sawyer is perfect, a regular Prince Charming, but when he leaves town for the summer, it’s his cousin Beau who catches Ashton’s eye. Beau is the sexiest guy she’s ever seen, and even though he’s dangerous, Ashton is drawn to him. Beau loves his cousin like a brother, so the last thing he wants to do is make a move on Sawyer’s girl. Ashton is off-limits, absolutely. That’s why he does his best to keep his distance, even though he’s been in love with her forever. When Ashton wants to rekindle their childhood friendship in Sawyer’s absence, Beau knows he should say no. Ashton and Beau don’t want to hurt Sawyer. But the more they try to stay away from each other, the more intense their urges become. It’s getting way too hard to resist....", "hash": "476cfbd2-def1-4edd-a857-757f895beda8"}, {"title": "The Vincent Brothers (The Vincent Boys #2)", "author": "Abbi Glines", "pgs": 27, "sum": "Storyline: \nThe Vincent Brothers (The Vincent Boys #2) Getting a boy to fall head-over-heels in love with you isn’t easy. Especially when he’s been in love with your cousin for as long as you can remember. Lana has lived her life in her cousin’s shadow. Ashton always made perfect grades, had tons of friends, and looks model-perfect. And she’s always had Sawyer Vincent—the only boy Lana’s ever wanted—wrapped around her finger. But now things are different. Lana has a chance to make Sawyer see her, and she’s taking it. If only he’d get over Ashton—because Lana is sick of second-best. Sawyer’s heart is broken. He’s lost his best girl to his best friend. And then Lana comes to town. Ashton’s cousin has always been sweet and soft-spoken, but now she’s drop-dead gorgeous as well. Sawyer doesn’t know if Lana can heal his broken heart, but spending time with her might at least make Ashton jealous. What starts as a carefree fling becomes a lusty game of seduction. Sawyer and Lana may have different motives, but their scintillating hookups are the same kind of steamy. . . .", "hash": "a83dc544-f15d-46e8-80a6-9caff4653368"}, {"title": "The Mighty Storm (The Storm #1)", "author": "Samantha Towle", "pgs": 68, "sum": "Storyline: \nThe Mighty Storm (The Storm #1) It's been twelve years since Tru Bennett last saw Jake Wethers, her former best friend and boy she once loved. Jake Wethers, sexy, tattooed and deliciously bad lead singer, and brains behind The Mighty Storm, one of the biggest bands in the world, left Tru with a broken heart when he moved from England to America with his family when they were both fourteen. Sent to interview Jake for her music column by the magazine she works for, they are both unprepared for the sparks that fly the instant they reconnect. Only, there’s a complication to their instant feelings for one another—Will, Tru’s boyfriend of two years. Then Jake makes Tru a job offer she can't refuse—travelling the world with him and his band. But taking the job means leaving Will behind, and being on the road with the band means spending an inordinate amount of time with Jake. Is Tru strong enough to resist the delectable bad boy who once held her heart so completely, or will she willingly risk it all for one night with the world's most notorious womanizer?", "hash": "6534fc47-c505-458b-b967-dee6d3fcc591"}, {"title": "Wethering the Storm (The Storm #2)", "author": "Samantha Towle", "pgs": 48, "sum": "Storyline: \nWethering the Storm (The Storm #2) Music journalist Tru Bennett has done the impossible: capture the heart of rock-star bad boy Jake Wethers. Now they’re busy planning a wedding and navigating their new life together in the US. Of course Tru misses London and her best friend, Simone, but living happily ever after with Jake in LA is going to be great…right? Wrong. Even the bright California sun can’t whitewash the dark side of celebrity coupledom. Greedy music execs, merciless paparazzi, and Jake’s wild past are lurking around every corner. Making matters worse, Jake announces he doesn’t want kids, which just may be a deal breaker. Tru loves Jake more than anything. But when a devastating crisis threatens to destroy everything they’ve fought for, the couple must face the hard truth: What if, this time, love is not enough?", "hash": "99ead622-c63e-456f-84be-99bdce8bcd14"}, {"title": "Trouble ", "author": "Samantha Towle", "pgs": 47, "sum": "Storyline: \nMia Monroe is running. Running from a person she doesn’t ever want to find her. Running from a past she doesn’t ever want anyone to know. Desperate to find a future, that yesterday, she could only dream of having. Jordan Matthews likes easy. Easy women. Easy life. Then he meets Mia. She’s damaged, troubled and has more baggage than any person can carry. But the more Jordan gets to know Mia-for the first time in his life-he finds himself wanting to try hard for something … for someone … for her. And then life isn’t so easy anymore. Jordan is everything Mia shouldn’t want. A whole bunch of dirty hotness, tattooed, cocky bad boy, who made his money at poker tables and picked his women up in bars. Yet, Mia finds herself falling for him. Then the past Mia was running from, quickly starts to catch up with her. Because that’s the problem with running … you have to stop sometime. And when you stop, you get caught.", "hash": "7927e074-3131-47f7-aad6-9f85a6eb2c16"}, {"title": "Wait for You (Wait for You #1)", "author": "Jennifer L. Armentrout", "pgs": 54, "sum": "Storyline: \nWait for You (Wait for You #1) by J. Lynn, Jennifer L. Armentrout Some things are worth waiting for… Traveling thousands of miles from home to enter college is the only way nineteen-year-old Avery Morgansten can escape what happened at the Halloween party five years ago—an event that forever changed her life. All she needs to do is make it to her classes on time, make sure the bracelet on her left wrist stays in place, not draw any attention to herself, and maybe—please God—make a few friends, because surely that would be a nice change of pace. The one thing she didn’t need and never planned on was capturing the attention of the one guy who could shatter the precarious future she’s building for herself. Some things are worth experiencing… Cameron Hamilton is six feet and three inches of swoon-worthy hotness, complete with a pair of striking blue eyes and a remarkable ability to make her want things she believed were irrevocably stolen from her. She knows she needs to stay away from him, but Cam is freaking everywhere, with his charm, his witty banter, and that damn dimple that’s just so… so lickable. Getting involved with him is dangerous, but when ignoring the simmering tension that sparks whenever they are around each other becomes impossible, he brings out a side of her she never knew existed. Some things should never be kept quiet… But when Avery starts receiving threatening emails and phone calls forcing her to face a past she wants silenced, she’s has no other choice but to acknowledge that someone is refusing to allow her to let go of that night when everything changed. When the devastating truth comes out, will she resurface this time with one less scar? And can Cam be there to help her or will he be dragged down with her? And some things are worth fighting for…", "hash": "50ab9d57-1107-4f2f-a76f-f4c1cabb00a9"}, {"title": "Trust in Me (Wait for You #0)", "author": "Jennifer L. Armentrout", "pgs": 40, "sum": "Storyline: \nTrust in Me (Wait for You #1.5) by J. Lynn, Jennifer L. Armentrout It’s Wait for You as you’ve never seen it. Trust in Me lets you in on Cam’s side of the #1 New York Times Bestselling story. Cameron Hamilton is used to getting what he wants, especially when it comes to women. But when Avery Morgansten comes crashing into his life – literally – he finally meets the one person who can resist his soulful baby blues. But Cam’s not ready to give up. He can’t get the feisty and intriguing girl out of his head. Avery has secrets, secrets that keep her from admitting the feelings Cam knows she has for him. Will persistence (and some delicious homemade cookies) help him break down her barriers and gain her trust? Or will he be shut out of Avery's life, losing his first real shot at the kind of love that lasts forever?", "hash": "66e7a4a2-9474-4490-92b7-3685a5480473"}, {"title": "Tempting the Best Man (Gamble Brothers #1)", "author": "Jennifer L. Armentrout", "pgs": 21, "sum": "Storyline: \nTempting the Best Man (Gamble Brothers #1) by J. Lynn, Jennifer L. Armentrout A sexy category romance from Entangled's Brazen imprint... She'll make him lose control... Madison Daniels has worshipped her brother's best friend since they were kids. Everyone thinks she and Chase Gamble would make the perfect couple, but there are two major flaws in their logic. 1) Chase has sworn off relationships of any kind, and 2) after blurring the line between friends and lovers for one night four years ago, they can't stop bickering. Forced together for her brother's wedding getaway, Chase and Madison decide to call a truce for the happy couple. Except all bets are off when they're forced to shack up in a tacky 70’s honeymoon suite and survive a multitude of \"accidents\" as the family tries to prove their \"spark\" can be used than for more than fighting. That is, if they don't strangle each other first…", "hash": "80e55d55-77fd-41bb-b178-3a072462d46a"}]