[{"title": "Tempting the Player (Gamble Brothers #2)", "author": "Jennifer L. Armentrout", "pgs": 34, "sum": "Storyline: \nTempting the Player (Gamble Brothers #2) by J. Lynn, Jennifer L. Armentrout A sexy category romance from Entangled's Brazen imprint... He's a player on and off the field... Chad Gamble, all-star pitcher for the Nationals, is one of the best players on—and off—the field. And right now, the notorious bad boy wants Bridget Rodgers. But with her lush curves and snappy comebacks, the feisty redhead is the kind of woman a man wants to settle down with…and that’s the last thing Chad needs. When the paparazzi catch them in a compromising position, Chad’s manager issues an ultimatum: clean up his act or kiss his multi-million dollar contract goodbye. To save his career, his meddling publicist says he'll have to convince everyone Bridget isn’t just his flavor of the week, but his girlfriend. Being blackmailed into a fake relationship with Chad Gamble isn’t easy, especially when the sizzling physical attraction between them is undeniable. With a month to go on their arranged pretense, it's going to take every ounce of willpower they have not to fall into bed together...or in love.", "hash": "26ee8ebc-8e9b-4e7d-a98e-a8dc9bd0db35"}, {"title": "Frigid (Frigid #1)", "author": "Jennifer L. Armentrout", "pgs": 40, "sum": "Storyline: \nFrigid (Frigid #1) by J. Lynn, Jennifer L. Armentrout For twenty-one-year-old Sydney, being in love with Kyler isn't anything new. They'd been best friends ever since he pushed her down on the playground and she made him eat a mud pie. Somewhere over the years, she fell for him and fell hard. The big problem with that? Kyler puts the 'man' in man-whore. He's never stayed with a girl longer than a few nights, and with it being their last year in college, Syd doesn't want to risk their friendship by declaring her love. Kyler has always put Syd on a pedestal that was too high for him to reach. To him, she's perfect and she's everything. But the feelings he has for her, he's always hidden away or focused on any other female. After all, Kyler will always be the poor boy from the wrong side of tracks, and Syd will always be the one girl he can never have. But when they're stranded together at a posh ski resort due to a massive Nor'easter, there's nothing stopping their red-hot feelings for each other from coming to the surface. Can their friendship survive the attraction? Better yet, can they survive at all? Because as the snow falls, someone is stalking them, and this ski trip may be a life-changer in more ways than one.", "hash": "5a467731-cdc0-4baa-9245-2298aa7add3f"}, {"title": "The Billionaire Wins the Game (Billionaire Bachelors #1)", "author": "Melody Anne", "pgs": 24, "sum": "Storyline: \nThe Billionaire Wins the Game (Billionaire Bachelors #1) Joseph Anderson has decided it's time for his three successful sons to find brides. Joseph wants grandchildren to fill his mansion, and he wants them immediately. His eldest son, Lucas, is successful in all areas of his life, except love, and Joseph begins matchmaking. He finds Amy Harper and deems her the perfect daughter-in-law. He just needs to get her and Lucas to both realize they're made for each other. Lucas Anderson is wealthy, sexy, and stubborn. He has no desire to have any woman enter his life, causing chaos, or using his family's name. Many women have tried, and he's been successful in finding out who they are beneath their false smiles. Amy Harper was raised in tragic circumstances and doesn't like pampered, rich men who have been handed everything with a silver spoon. She spent years finishing her education and then received a job with the Anderson Corporation. She instantly doesn't like her incredibly sexy boss, who is arrogant and thinks every woman should fall at his feet. When Amy becomes pregnant after one reckless night of passion, she's scared he'll take the baby and run. Lucas is demanding, and used to getting his way, but Amy has just the right amount of spark to ignite his fuse, and challenges him each step of the way. Lucas's father, Joseph, and his brothers Alex and Mark, offer laughter, love, and support. With the love of Lucas's family, who aren't only rich and successful, but also kind and giving, Amy starts to realize that being wealthy doesn't make or break a man, and starts to picture the happily ever after she never believed in for herself.", "hash": "27e3f1ef-aa07-4e2e-95ed-b1e3b58b9220"}, {"title": "The Billionaire's Dance (Billionaire Bachelors #2)", "author": "Melody Anne", "pgs": 23, "sum": "Storyline: \nThe Billionaire's Dance (Billionaire Bachelors #2) Joseph Anderson has decided it is time his three successful sons find brides. Joseph wants grandchildren to fill his huge mansion, and he wants them immediately. He was successful in his eldest son's match, and in this book, his scheming brings Alex and Jessica together. Alex is a confirmed Bachelor who loves to travel all around the globe and romance as many women as possible. That is until he meets Jessica Sanders. One night with her and he is changing his views of bachelorhood and starting to think that married life is the new way for him. Jessica comes from a wealthy family, and has had one too many good looking men take advantage of her family's money. When she meets confirmed bachelor and known playboy Alex Anderson, she is distrustful of his flirting, and tries to avoid him at all costs. That is until they end up trapped in an elevator, and her fear of the dark, tight space is greater than her fear of the man she is trapped with. Alex comforts her by making steamy love in the elevator, and when she runs away once they are free, he walks away wanting more. One year later he finds out he is a father, and he makes sure Jessica has no other choice than to let him do the honorable thing. They have passion, romance, love and family to help guide them through the chaos.", "hash": "1852c95f-d87d-4f93-9c8f-0b57efe89483"}, {"title": "The Billionaire Falls (Billionaire Bachelors #3)", "author": "Melody Anne", "pgs": 24, "sum": "Storyline: \nThe Billionaire Falls (Billionaire Bachelors #3) Joseph Anderson has been successful in finding brides for his two eldest sons. In this book he finds the perfect bride for his youngest son Mark. Mark has a billion dollar ranch operation that takes many employees to run successfully. He loses his cook and leaves it to his father to find a new one. Little does Mark know that Joseph is far more interested in her marriage potential than her cooking skills. Luckily he finds a woman who can cook and will make the perfect bride for his son. Emily Jackson is on the run from people who want to take her five year old son from her. She ends up in a small town in Washington and is excited to find an ad in the paper for a live in cook. When she starts work at the beautiful ranch, sparks fly with her new boss who is sexier than any cowboy has the right to be. She does not want to risk having an affair with her boss and losing her job so she will fight the attraction until passion overcomes them both. Take the journey with Mark and his family as the youngest Anderson finds his bride.", "hash": "adce5482-9b7d-4292-a49c-bb724ef4769f"}, {"title": "The Billionaire's Marriage Proposal (Billionaire Bachelors #4)", "author": "Melody Anne", "pgs": 22, "sum": "Storyline: \nThe Billionaire's Marriage Proposal (Billionaire Bachelors #4) George Anderson lost his wife five years ago, and then his family fell apart. He needs to make a drastic change to bring his family back together. He gets together with his twin brother Joseph Anderson and the two men make plans to do some matchmaking for George’s stubborn children. George will get his grandkids and his family all together again. Trenton Anderson is furious with his father, when the man decides to move the corporation he runs from Chicago to Seattle. He arrives in Seattle and meets Jennifer Stellar and the sparks immediately fly. He decides he likes what he sees and immediately begins chasing her. Jennifer had a horrible tragedy, and lost her sister and brother-in-law in an auto accident. She has temporary custody of her niece, and needs to do whatever it takes to gain full custody. She gets a great job working for Trenton, and can’t seem to resist the man’s advances, though she continually tries. Both Trenton and Jennifer are stubborn, and charming, and along with Trenton’s siblings and cousins, you will fall in love with the Anderson’s all over again.", "hash": "fd519c23-fec7-428f-9e25-756c61a249df"}, {"title": "Blackmailing the Billionaire (Billionaire Bachelors #5)", "author": "Melody Anne", "pgs": 25, "sum": "Storyline: \nBlackmailing the Billionaire (Billionaire Bachelors #5) Cassandra, or Cassie, as everyone calls her is trying to get her big break into the journalism world. She wants an exclusive interview with the famous Max Anderson. But, the man refuses to return her calls. She isn’t willing to give up, but fate steps in and helps her out. She’s out taking a walk one afternoon, when everything goes dark. She wakes up in the hospital to find out that she’s been hit by a car by none other than Max Anderson. He offers to pay her off, but there’s only one thing she wants from Max, and that’s to get her exclusive interview. Max agrees to Cassie’s interview, but only because she intrigues him. He wants to spend time with her to find out why he can’t get her out of his mind, day or night.", "hash": "8b8dd237-3767-437c-9ada-d449e88bac92"}, {"title": "Runaway Heiress (Billionaire Bachelors #6)", "author": "Melody Anne", "pgs": 27, "sum": "Storyline: \nRunaway Heiress (Billionaire Bachelors #6) Joseph and George Anderson are once again back to match-making in the sixth book in The Billionaire Bachelors Series. Bree has had enough of over-protective brothers and a meddling father, so she decides to run to a small town, where she can prove she can make it on her own. The only thing wrong with that situation is there’s a stalker after her, determined to make her his – or else end her life. George hires Chad, Mark’s best friend and ex-Navy Seal to guard Bree. She is furious about her father sending her a babysitter.", "hash": "ce0c9564-10ce-4ed3-b37b-aecad020457d"}, {"title": "The Billionaire's Final Stand (Billionaire Bachelors #7)", "author": "Melody Anne", "pgs": 43, "sum": "Storyline: \nThe Billionaire's Final Stand (Billionaire Bachelors #7) When the head of the Anderson family, Joseph, gets into a life-changing automobile accident, his family struggles to find a way to survive if he doesn’t come out of the coma the accident has placed him in. Austin Anderson is used to being single, but slowly he's watched his siblings and cousins find true love, leaving him the final Anderson without a spouse. That's all about to change when he meets Kinsey, who has him chasing her all across town. This couple has passion, love, and excitement, and both are determined to make it on their own, though, they are so much better together. Listen to the heartfelt reminiscing of Katherine as she tells the story of her romance with Joseph as she sits by his bedside, never losing faith that he’ll come back to her. Laugh along with the large family as they turn the tables and start plotting against George as he tries to hide his growing feelings for Esther. This final chapter in the Anderson family will leave you laughing, crying, and on a roller coaster of emotion as you once again step back into the world of the Anderson’s. Family always comes first to the Multi-Billionaire’s of Seattle.", "hash": "1916ae30-67ed-4438-bee2-851597bdeade"}, {"title": "Unexpected Treasure (Billionaire Bachelors #8)", "author": "Melody Anne", "pgs": 32, "sum": "Storyline: \nUnexpected Treasure (Billionaire Bachelors #8) The Andersons are back in this exciting new line of the bestselling series everyone is talking about. In this new series, you will meet Richard Storm and his five children, and the circumstances that ripped him away from his brothers, Joseph and George Anderson. See how they finally meet. The bonds of an Anderson bloodline are too strong to keep their family apart forever. Richard Storm is saddened by the fact that his children are throwing away their lives, and offers them an ultimatum. They have two years to take a failing business and make it a success or they lose their trust funds, and are on their own. His stubborn children think he’s gone insane, but they don’t know the powerful secret that can knock them to their knees and tear their family apart. Will they come together as they should, or will self-centeredness consume their hearts, ripping their family apart forever? Crew Storm opens an exclusive resort in the Catalina Islands off the coast of California, and pride swells within him as he accomplishes the impossible. Everything is going on track with his life until a blonde stranger steps into his life and asks him to teach her how to be the perfect seductress. Haley Sutherland is done with her fears, done being a wallflower and done being invisible. She comes up with a brilliant idea to find the perfect person to teach her how to seduce the man she truly wants. Though, the person she’s chosen to be her teacher is Crew Storm, soon she finds she’s forgetting her first love’s name.", "hash": "689ea1d9-ac78-4033-9f08-d137e7136056"}]