[{"title": "The Tycoon's Revenge (Baby for the Billionaire #1)", "author": "Melody Anne", "pgs": 23, "sum": "Storyline: \nThe Tycoon's Revenge (Baby for the Billionaire #1) Jasmine Freeman’s world is about to tumble down around her and the one responsible for it is none other than her first love, Derek Titan. She hasn't seen him in ten years, and they are both going to learn the truth of what happened back then. Jasmine grew up wealthy and oblivious to the destruction her father caused all around him. Derek was from the wrong side of the tracks. In ten years their lives will be reversed. He is now a multi-billionaire tycoon and she works hard, but barely gets by due to her father’s unethical business practices. Derek comes seeking revenge and instead finds out he has a half grown son and the woman he's been angry with for so many years is not who he thought she was. They both fight against the passion they still feel for each other, but in the end it is irresistible. Come take the journey with Derek and Jasmine as they rediscover a passion that never died and the lies that kept them apart.", "hash": "4afbdd07-a6a7-4cf3-a7fa-769fc4e870cd"}, {"title": "The Tycoon's Vacation (Baby for the Billionaire #2)", "author": "Melody Anne", "pgs": 23, "sum": "Storyline: \nThe Tycoon's Vacation (Baby for the Billionaire #2) This is the second book in the Baby for the Billionaire series. Drew Titan decides it is time to take a vacation at one of his exotic resorts, and ends up literally running into Trinity Mathews while he is surfing. They end up having a steamy romance over the week long vacation, until she finds out he is the resorts owner, and had lied to her. She has sworn off all business men, since she couldn't seem to find one who knew how to remain faithful to her, which is what landed her at the resort in the first place. She goes back home to discover that her first impulsive thing she has done in her life has left her pregnant and alone, that is until Drew finds her and will not go away until she agrees to marry him. Come enjoy the adventures Drew and Trinity take together in this fun filled story that has love, passion, fighting, and making up. Drew's cousins Derek and Ryan add humor and even more love to the adventure, and will leave you wanting a hunk of your own.Coming in October, the final story in the series, The Tycoon's Proposal.", "hash": "96711221-0317-4894-8a4a-de5284807218"}, {"title": "The Tycoon's Proposal (Baby for the Billionaire #3)", "author": "Melody Anne", "pgs": 21, "sum": "Storyline: \nThe Tycoon's Proposal (Baby for the Billionaire #3) Nicole Lander has no choice but to contact Ryan Titan, the boy she had deeply loved when she was a teenager. Her sister was in desperate need of a heart operation, or she wouldn’t live more than six months. Nicole lied to Ryan when they were teen’s because she hadn’t wanted him to find out about the abuse she was going through from her father. When Ryan gets the phone call from Nicole, needing his help, he’s ecstatic. He’d finally get to exact his revenge for her leaving him for not being good enough for her. He’ll help her sister but Nicole will also give him what he wants. The problem is that he’s never felt about any other woman the way he feels about Nicole, and his revenge quickly turns into him wanting to walk her down the aisle.", "hash": "3b0d504f-46e9-4a3c-9980-c68875f84eca"}, {"title": "The Tycoon's Secret (Baby for the Billionaire #4)", "author": "Melody Anne", "pgs": 30, "sum": "Storyline: \nThe Tycoon's Secret (Baby for the Billionaire #4) Damien Whitfield lost his father when he was an infant, and then lost his mother when he was a young teenager. The only thing his mother left him was a thirst for vengeance. On her deathbed she made him promise to seek revenge for those she held responsible for her death. Damien grows up fast and conquers the business world, going from a homeless boy to a billionaire bachelor. He has no time for love in his quest for righting wrongs of the past. What he doesn’t know is that love isn’t something he can hide from. Sierra grew up with a monster of a father after losing her mother at the tender age of six. Her dad punishes her for sins he assumes his deceased wife made against him. Finally, her father does a business deal with Damien Whitfield, selling Sierra to the highest bidder. Damien and Sierra may both be running from old demon’s and forging ahead to what they think are their perfect futures, but fate has a way of changing everything. Take the journey with Damien and Sierra as they fight a passion that won’t be denied.", "hash": "557a2e8c-33de-4a0a-a735-6b71627ab865"}, {"title": "The Tycoon's Proposal (Baby for the Billionaire #3)", "author": "Melody Anne", "pgs": 21, "sum": "Storyline: \nThe Tycoon's Proposal (Baby for the Billionaire #3) Nicole Lander has no choice but to contact Ryan Titan, the boy she had deeply loved when she was a teenager. Her sister was in desperate need of a heart operation, or she wouldn’t live more than six months. Nicole lied to Ryan when they were teen’s because she hadn’t wanted him to find out about the abuse she was goi", "hash": "d149f7dc-eb70-4b7c-8704-fa10246bcc00"}, {"title": "Countdown To A Kiss A New Year's Eve Anthology ", "author": "Colleen Gleason", "pgs": 42, "sum": "Storyline: \nCountdown To A Kiss: A New Year's Eve Anthology (Heroes of Henderson 0.5 included) by Colleen Gleason , Holli Bertram, Mara Jacobs , Liz Kelly Four stories by four authors…one fateful New Year’s Eve Four kisses at midnight… Three different sisters… Two old flames… One bet that drives it all! The Devine sisters return to their hometown for New Year’s Eve each year to attend the annual ball. Part of the tradition is their decade-old bet: whoever has no date at midnight has to kiss their nerdy neighbor Lewis. Tess –burned by love, the glamorous Broadway star isn’t interested in a repeat performance…until she encounters an old flame. Grace-- the tough FBI agent has an easy time being one of guys, but is she woman enough to keep a man? Annabelle– when the local etiquette expert gets caught breaking the law, her heart might have to pay the price. Lewis—the shy nerd has made millions over the years…but is he smart enough to catch the woman of his dreams? Who will lose the bet but win out in love? Four charming stories written by four different authors about one fateful New Year’s Eve. The champagne is poured. The clock is ticking. Join the countdown!", "hash": "8186e671-0ca8-4151-a13f-84b0f0475dfc"}, {"title": "Rule (Marked Men #1)", "author": "Jay Crownover", "pgs": 51, "sum": "Storyline: \nRule (Marked Men #1) Opposites in every way . . . except the one that matters Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight--A pre-med student like Shaw shouldn’t want--and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart just won’t listen. To a rebel like Rule Archer, Shaw Landon is a stuck-up, perfect princess-and his dead twin brother’s girl. She lives by other people’s rules; he makes his own. He doesn’t have time for a good girl like Shaw-even if she’s the only one who can see the person he truly is. But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule have to figure out how a girl like her and a guy like him are supposed to be together without destroying their love . . . or each other.", "hash": "4dd4191d-2d85-40f9-950c-60119b526d33"}, {"title": "Jet (Marked Men #2)", "author": "Jay Crownover", "pgs": 48, "sum": "Storyline: \nJet (Marked Men #2) With his tight leather pants and a sharp edge that makes him dangerous, Jet Keller is every girl’s rock and roll fantasy. But Ayden Cross is done walking on the wild side with bad boys. She doesn’t want to give in to the heat she sees in Jet’s dark, haunted eyes. She’s afraid of getting burned from the sparks of their spontaneous combustion, even as his touch sets her on fire. Jet can’t resist the Southern Belle with mile-long legs in cowboy boots who defies his every expectation. Yet the closer he feels to Ayden, the less he seems to know her. While he’s tempted to get under her skin and undo her in every way, he knows firsthand what happens to two people with very different ideas about relationships. Will the blaze burn into an enduring love. . . or will it consume their dreams and turn them to ashes?", "hash": "4a2fa529-7beb-4a2d-a71f-07c1e64dacd6"}, {"title": "On Every Street (The Artists Trilogy #0)", "author": "Karina Halle", "pgs": 24, "sum": "Storyline: \nOn Every Street (The Artists Trilogy 0.5) When young con artist Ellie Watt decides to call herself Eden White and go after the drug lord who ruined her as a child, she never expects to fall for one of his henchmen. But Javier Bernal is no ordinary man. Subtly dangerous and overwhelmingly seductive, Eden finds herself passionately in love with Javier, the very person she's set-up to betray. With her body and heart in a heated battle against her deep need for revenge, no one will walk away from this con a winner. Takes place six years before Sins & Needles. It can be read before or after Sins & Needles and may also be read as a standalone.", "hash": "40cd67b8-8572-4d4f-a989-763889c1bd65"}, {"title": "Sins & Needles (The Artists Trilogy #1)", "author": "Karina Halle", "pgs": 43, "sum": "Storyline: \nSins & Needles (The Artists Trilogy #1) Ellie Watt is used to starting over. The daughter of a grifting team, Ellie spent her childhood being used as a pawn in her parents' latest scam. Now she’s much older, wiser and ready to give her con artist life a rest. But returning to the dry desert town of Palm Valley, California means one more temptation than she bargained for – Camden McQueen. Once known as the high school weirdo, Camden is bigger and badder than the boy he used to be and a talented tattoo artist with his own thriving business. Ellie’s counting on Camden still being in love with her but what she’s not counting on is how easily unrequited love can turn into obsession over time. When Camden discovers Ellie’s plan to con him, he makes her a deal she doesn’t dare refuse, but her freedom comes with a price and it’s one that takes both Ellie and Camden down a dangerous road.", "hash": "c86da259-7064-4ff3-88a2-5996d9c8b341"}]