[{"title": "Easy (Contours of the Heart #1)", "author": "Tammara Webber", "pgs": 40, "sum": "Storyline: \nEasy (Contours of the Heart #1) Rescued by a stranger. Haunted by a secret Sometimes, love isn't easy... He watched her, but never knew her. Until thanks to a chance encounter, he became her savior... The attraction between them was undeniable. Yet the past he'd worked so hard to overcome, and the future she'd put so much faith in, threatened to tear them apart. Only together could they fight the pain and guilt, face the truth - and find the unexpected power of love. A groundbreaking novel in the New Adult genre, Easy faces one girl's struggle to regain the trust she's lost, find the inner strength to fight back against an attacker, and accept the peace she finds in the arms of a secretive boy.", "hash": "ee6379d4-b264-464b-8a51-73ee23d8d075"}, {"title": "Until November (Until #1)", "author": "Aurora Rose Reynolds", "pgs": 38, "sum": "Storyline: \nUntil November (Until #1) November is looking forward to getting to know her father and the safety of a small town. After leaving the Big Apple and her bad memories for Tennessee, November starts working for her dad at his strip club doing the books. The one time she’s allowed there during club hours she runs into Asher Mayson. He’s perfect until he opens his mouth and makes assumptions. November wants nothing to do with Asher but too bad for November, fate has other plans. Asher Mayson has never had a problem getting a woman, that is until November. Now all he can think about is making November his and keeping her safe. Warning 18+ sexual content and a strong Alpha Male.", "hash": "aa55dde4-aa83-470b-b204-00e2559a3b5e"}, {"title": "Until Trevor (Until #2)", "author": "Aurora Rose Reynolds", "pgs": 36, "sum": "Storyline: \nUntil Trevor (Until #2) Trevor Mayson had his life planned out - make the family business successful and play the field for a few more years before eventually settling down. Then he sees her. Liz Hayes was beautiful, shy and everything that he could ever want...but she didn't fit into his plans. After Trevor painfully rejects her, Liz finally starts to move on, but Trevor is finding it difficult to truly let her go. It seems the more he tries to stay away, the more intense his feelings for her become. Like a stretched rubber band, he can only take so much before snapping. Liz Hayes is done waiting for Trevor and isn't interested in getting her heart broken by him again, but Trevor is making it difficult for her to forget him when he shoves his way back into her life. Can Trevor prove to her that he is worth falling in love with again, and is he ready to change his life plan to let her into his heart?", "hash": "aecc062f-6960-41cc-9c8a-2411eb729432"}, {"title": "Colters' Woman (Colters' Legacy #1)", "author": "Maya Banks", "pgs": 29, "sum": "Storyline: \nColters' Woman (Colters' Legacy #1) Adam, Ethan and Ryan aren't looking for women. They're looking for a woman. One woman to share their lives and their beds. They don't want a casual romp in the hay, they want the woman who will complete them and they're losing hope of finding her. That is until Adam finds Holly lying in the snow just yards from their cabin. He knows she's different the minute he holds her in his arms. But before Adam gets his hopes up, he knows he has to gauge his brothers reactions. Soon its evident that she's the one. There are a few problems, however, like convincing her she belongs with them and keeping her safe from the man who wants her dead. Warning, this title contains the following: explicit sex, graphic language, menage a quatre, violence.", "hash": "6f4be499-b986-4c4f-9549-88623790076a"}, {"title": "Colters' Lady (Colters' Legacy #2)", "author": "Maya Banks", "pgs": 36, "sum": "Storyline: \nColters' Lady (Colters' Legacy #2) Can their love give her the strength to overcome the tragedy in her past? Colters' Legacy, Book 2 When police officer Seth Colter sees the delicate, shabbily dressed beauty in line at the soup kitchen where he's serving, he's gut shot over the idea of her being on the streets cold and alone. More baffling is the dark, possessive instinct that tells him she belongs to him. For Lily Weston, home is a secluded nook in a back alley until Seth offers her a place to stay. She's wary of his offer, but even one night out of the cold is too much temptation to resist. Seth is convinced Lily is his. The problem is, when his brothers lay eyes on her, the same primitive instinct comes roaring to the surface. The Colters never imagined they'd follow the unconventional path of their fathers, but they can't ignore their mutual need to offer Lily their protection and their love. But before Lily and the brothers can forge a future together, they must heal the deep wounds of her past. Warning, this title contains the following: explicit sex, graphic language, multiple partners, menage a quatre, violence.", "hash": "226c16bd-a865-4084-bb66-499f3e8f3e54"}, {"title": "Colters' Daughter (Colters' Legacy #3)", "author": "Maya Banks", "pgs": 27, "sum": "Storyline: \nColters' Daughter (Colters' Legacy #3) He let her go once. This time he's playing for keeps. \"Colters' Legacy, Book 3\" Callie Colter once chased sunsets all over the world. Until Max. Together they were a perfect storm of desire, and she reveled in the beautiful power. Then he disappeared without a word, and the betrayal drove her home to lick her wounds. Who knew he'd have the gall to show his face in her brother's bar. Max Wilder figures he deserves Callie's right hook to the jaw, but it changes nothing. He had his reasons for pursuing her across Europe, for making her fall in love with him. But when she took everything he gave and offered \"more, \" she changed all the rules. He had no choice leaving her, but he's back. This time for the right reasons. Callie is angry and hurt, yet powerless against Max's relentless onslaught. He'll settle for nothing less than her complete surrender-and her love. Only when she's back in his arms will he be truly happy. And the damning truth can stay safely tucked away. Except the truth has a way of creeping to the surface, and Max may just be out of second chances. Warning: This title contains adult language, explicit sex, rough sex, anal sex. In other words...sex Also contains themes of D/s which might offend some readers. Lots of angst, emotion and betrayal. Second chances and lots of warm fuzzies", "hash": "01c35dc0-6db7-4410-809b-cc47b3107213"}, {"title": "Colters' Promise (Colters' Legacy #4)", "author": "Maya Banks", "pgs": 17, "sum": "Storyline: \nColters' Promise (Colters' Legacy #4) When it came to overcoming the odds of a tragic past, Lily was determined to move on. The three Colter brothers helped her do it. They taught her new ways to love, new dreams to share, and offered her a new life that she never thought possible. Now is a time for celebration, and what better way than with a long-awaited family reunion, a homecoming that will bring together the entire Colter family and a few surprises no one anticipated. But first, there’s something from Lily’s past she still needs to reconcile—even when all the while she is holding close to her heart a newfound secret that will change her future, forever enrich the Colter legacy, and make every promise come true.", "hash": "c045a331-5274-4199-9646-b46d3e957f8d"}, {"title": "Colters' Gift (Colters' Legacy #5)", "author": "Maya Banks", "pgs": 38, "sum": "Storyline: \nColters' Gift (Colters' Legacy #5) Lauren Wilder fell for the wrong man, trusted the wrong man, and she paid a very dear price for it. Now broken and wounded, she's retreated to the bosom of the Colter family and the unshakeable love and support they offer. But the man she once loved and trusted is not without his own power, and he'll use every bit of his money and resources to make sure he gets Lauren back, no matter whom he destroys doing it. Liam and Noah were hired by Lauren's brother to watch over her. But with danger looming, they head to the Colorado mountain—where Lauren has found temporary sanctuary. In her wounded eyes, Liam and Noah see the woman she once was—and could be again. They’re determined to show her everything a man can be—someone who will love her, cherish her, satisfy her, and when the time comes, put their very lives on the line for her.", "hash": "570c1806-2ea4-4336-a55d-e66d3f0a8175"}, {"title": "Billionaire's Contract Engagement ", "author": "Maya Banks", "pgs": 23, "sum": "Storyline: \nBillionaire's Contract Engagement (Kings of the Boardroom #3) He'd wanted her for six months. And the opportunity had finally arrived to make Celia Taylor his--at least temporarily. Billionaire businessman Evan Reese knew she was desperate to get him to sign with Maddox Communications. Perhaps he would. But first Celia needed to accompany him to beautiful Catalina for a family wedding. There he would wine, dine and seduce the stunning ad executive...for he knew she desired him, as well. Yet would she still want him when Evan told her she'd be playing the role of his fake fiancee?", "hash": "35788867-f8f0-4f95-bdd5-04d5a33ed96e"}, {"title": "The Darkest Hour (KGI #1)", "author": "Maya Banks", "pgs": 43, "sum": "Storyline: \nThe Darkest Hour (KGI #1) It’s been one year since ex-Navy SEAL Ethan Kelly last saw his wife Rachel alive. Overwhelmed by grief and guilt over his failures as a husband, Ethan shuts himself off from everything and everyone. His brothers have tried to bring Ethan into the KGI fold, tried to break through the barriers he’s built around himself, but Ethan refuses to respond… until he receives anonymous information claiming Rachel is alive. To save her, Ethan will have to dodge bullets, cross a jungle, and risk falling captive to a deadly drug cartel that threatens his own demise. And even if he succeeds, he’ll have to force Rachel to recover memories she can’t and doesn’t want to relive—the minute by minute terror of her darkest hour—for their love, and their lives, may depend on it.", "hash": "7d995eaa-3be9-4dcf-9d36-6e167bbbe216"}]