[{"title": "No Place to Run (KGI #2)", "author": "Maya Banks", "pgs": 35, "sum": "Storyline: \nNo Place to Run (KGI #2)  Sam Kelly was her first love. The last person Sam Kelly expected to pull wounded from the lake was Sophie Lundgren. Once they shared a brief, intense affair while Sam was undercoverand then she vanished.She’s spent the last months on the run, knowing that any mistake would cost her life and that of her unborn child—Sam’s child. Now she’s resurfaced with a warning for Sam: this time, he’s the one in danger. Now he’s her last chance. Sam has too many questions to let her slip away again—like why she disappeared in the first place. This time he vows not to be seduced. But one look in her eyes, and the passion burns again, and Sam knows he’ll do anything to keep her and his child safe. However, Sophie’s dark past is more dangerous than he imagines, and the only way for either to survive it is to outrun it.", "hash": "da31b8d4-f333-4499-a787-097dd0c8c05d"}, {"title": "Hidden Away (KGI #3)", "author": "Maya Banks", "pgs": 46, "sum": "Storyline: \nHidden Away (KGI #3) A man who shoots first and asks questions later… Most people would take an all-expenses-paid trip to the beach in a heartbeat. Garrett Kelly only accepts to keep tabs on Sarah Daniels, who’s in hiding after witnessing a murder by Marcus Lattimer, her half-brother—and a personal enemy of KGI. This gig may be beneath a disciplined soldier like Garrett, but if he gets a shot at Lattimer, it will all be worth it… …and the ultimate moving target. But Garrett hadn’t counted on falling for Sarah. He’d considered seduction as a tactical maneuver, but when he glimpses Sarah’s dark past, he feels an urgent desire to keep her safe—even after she disappears on him. Garrett doesn’t know exactly who, or what, Sarah’s running from, but whatever it is, she’s running for her life…", "hash": "f025d70d-320b-42c1-bea0-935c649d5f44"}, {"title": "Whispers in the Dark (KGI #4)", "author": "Maya Banks", "pgs": 46, "sum": "Storyline: \nWhispers in the Dark (KGI #4) She came to him when he needed her the most She came to him at his lowest point. The voice of an angel, a whisper in the dark. She’s the only thing that gets Nathan Kelly through his captivity, the endless days of torture and the fear that he’ll never return to his family. With her help, he’s able to escape. But he isn’t truly free, because now she’s disappeared and he’s left with an all-consuming emptiness as he struggles to pick up the pieces of his life. Did he imagine his angel? Or is she out there, needing his help as he’d once needed hers? Now he rushes to save her before it’s too late Shea has been on the run from people who will stop at nothing to exploit her unique abilities. She never wanted to drag Nathan, who’d already suffered so much, into danger, but she doesn’t have a choice so she reaches out to him for help. Finally face-to-face after having already formed a soul-deep bond in hell, their emotional connection is even more powerful than their telepathic one. Nathan refuses to consider ever letting her go again, but she worries they can never have a life free of the dangers that dog her every step. He’ll protect her with his every breath, but can he convince her that they are meant to face these threats together?", "hash": "611815e4-a369-48ab-86c2-0680148fdb17"}, {"title": "Echoes at Dawn (KGI #5)", "author": "Maya Banks", "pgs": 40, "sum": "Storyline: \nEchoes at Dawn (KGI #5) Grace Peterson is desperate, in hiding, and on the run after escaping a shadowy group determined to exploit her extraordinary ability to heal others. Her only lifeline—an unerring telepathic ability she shares with her sister—has been severed, leaving her alone and vulnerable. And time is fast running out... Enlisted to bring Grace home is Rio, relentless member of the KGI. He’s unprepared for his reaction to this wounded, damaged woman, and he’s fiercely determined to protect her from those who nearly destroyed her. In Rio, she finds a safe haven, and for the first time...hope. But the mission is far from over. The danger Grace has eluded is fast closing in. And now it’s pitching two lovers toward an unfamiliar horizon, with no place left to hide.", "hash": "32c09fbc-3d6b-4c78-90ef-af435e891089"}, {"title": "Softly at Sunrise (KGI #5.5)", "author": "Maya Banks", "pgs": 14, "sum": "Storyline: \nSoftly at Sunrise (KGI #5.5) Rachel Kelly has traveled a long, hard road in her journey back to her husband, Ethan, and the Kelly family. Now, as she and Ethan are poised to move into their new home, safe behind the walls of the Kelly compound, Rachel wonders if she’ll finally be free of the ghosts that have haunted her for so long and if she’ll step into the sun after a past steeped in darkness. “I adored seeing the Kelly family do what it does best: be there for each other to support and lean on through the good and the bad. SOFTLY AT SUNRISE portrayed that perfectly and brought the love I have for this series back to the forefront.” – Pearl’s World of Romance “Anyone picking up this book for the first time will want to read the rest of the series. \"Softly at Sunrise\" pulls the reader into the characters’ circle of friends and holds them tight.” – Affair de Coeur “If you’re like so many other Maya Banks fans who read THE DARKEST HOUR and hungered to learn more about what happens to Rachel and Ethan in the future then you have to pick up a copy of SOFTLY AT SUNRISE.” – Romance Junkies", "hash": "563937dc-f46e-4346-8aa5-cf240d21db7b"}, {"title": "Shades of Gray (KGI #6)", "author": "Maya Banks", "pgs": 36, "sum": "Storyline: \nShades of Gray (KGI #6) The Kelly Group International (KGI): A super-elite, top secret, family-run business. Qualifications: High intelligence, rock-hard body, military background. Mission: Hostage/kidnap victim recovery. Intelligence gathering. Handling jobs the U.S. government can't... P.J. and Cole were sharpshooting rivals on the same KGI team and enjoyed a spirited, uncomplicated camaraderie. Until the night they gave in to their desires and suddenly took their relationship one step further. In the aftermath of their one-night stand, they're called out on a mission that goes terribly wrong, and P.J. walks away from KGI, resolved not to drag her teammates into the murky shadows she's poised to delve into. Six months later, Cole hasn't given up his search for P.J., and he's determined to bring her back home where she belongs. Bent on vengeance, P.J. has plunged into a serpentine game of payback that will make her question everything she's ever believed in. But Cole-and the rest of their team-refuse to let her go it alone. Even if it means sacrificing their loyalty to KGI, and their lives...", "hash": "aff2c4f9-83bf-400f-bf68-373311ba71da"}, {"title": "Forged in Steele (KGI #7)", "author": "Maya Banks", "pgs": 49, "sum": "Storyline: \nForged in Steele (KGI #7) The Kelly Group International (KGI): A super-elite, top secret, family-run business. Qualifications: High intelligence, rock-hard body, military background. Mission: Hostage/kidnap victim recovery. Intelligence gathering. Handling jobs the U.S. government can’t… Steele, a KGI team leader, is an enigma not even his team mates understand. His emotions are tightly locked down and nothing can break that icy exterior. Nothing except Maren Scofield, a doctor on a mission, a woman who has gotten under Steele’s skin and threatens to crack that unflappable cool he’s legendary for. Steele is determined not to allow Maren past his carefully guarded defenses, but when she’s in danger, there’s no way he’ll allow anyone else to protect her. She’s hiding something. He’s sure of it. But he isn’t prepared for the shocking discovery her secrets reveal. Or how they will forever alter the course of his destiny. He has a decision to make. Hold tight and shut her out. Or take a chance on something more powerful than he’s ever faced. Love.", "hash": "672ab440-b9cc-4df6-ae8a-96d15f6f83aa"}, {"title": "After the Storm (KGI #8)", "author": "Maya Banks", "pgs": 55, "sum": "Storyline: \nAfter the Storm (KGI #8) Over the years, Donovan Kelly has fought relentlessly for justice, women and children always holding a special place in his heart. Working side by side with his brothers, Donovan has witnessed firsthand the toll it’s taken—physically, mentally, and emotionally—on his loved ones, and the innocent lives caught in the crossfire. What he never expects is for his next mission to happen right on his home turf—or for it to take a very personal turn. Picturesque Kentucky Lake is the perfect place for a soul in search of safe harbor. A beautiful stranger has arrived—desperate, breathless, and on the run from a dark past closing in on her and the younger siblings she has vowed to protect. Donovan must now draw on every resource at his disposal—if he wants to save a woman and the children who may prove to be his destiny.", "hash": "e67cf0b9-393d-4bd9-8542-f473614593a0"}, {"title": "Sweet Surrender (Sweet #1)", "author": "Maya Banks", "pgs": 38, "sum": "Storyline: \nSweet Surrender (Sweet #1) Dallas cop Gray Montgomery is on a mission: find the guy who killed his partner and bring him to justice. So far, he's found a link between the killer and Faith—and if Gray has to get close to her to catch the killer, so be it. Faith is sweet and feminine, everything Gray wants and desires in a woman, but he suspects she's playing games. No way would she allow a man to call the shots in their relationship. Or would she? Faith sees in Gray the strong, dominant man she needs, but he seems determined to keep her at a distance. So she takes matters into her own hands to prove to him it's no game she's playing. She's willing to surrender to the right man. Gray would like to be that man. But catching his partner's killer has to be his first priority—until Faith is threatened and Gray realizes he will do anything to protect her...", "hash": "cf8a378a-477a-4869-ba05-40d2350f7e87"}, {"title": "Sweet Persuasion (Sweet #2)", "author": "Maya Banks", "pgs": 37, "sum": "Storyline: \nSweet Persuasion (Sweet #2) The man of her dreams would give the orders. For him, she had two words that satisfied them both...\"Take me.\" For five years, Serena has run Fantasy Incorporated and has devoted her time to fulfilling her clients' fantasies. Never her own. Until now... Her most secret desire is to give ownership of her body to a man. Someone who will command her, pleasure her, and have complete authority over her. So she seeks out Damon Roche, owner of an exclusive sex club and a man strong enough to make her do anything he wants. Anything. Together they'll journey into a world she's only dreamed of. She's given the opportunity to immerse herself in a different life while her normal one waits for her to return whenever she wishes. Damon has no desire to let her go, however. Serena is the woman he's long searched for, and it's up to him to convince her to stay when the game is all over with. He wants their fantasy to become their reality and for Serena to remain his pampered, cherished submissive.", "hash": "9f191037-c7be-45ac-80ec-55fd519ad920"}]