[{"title": "Sweet Seduction (Sweet #3)", "author": "Maya Banks", "pgs": 32, "sum": "Storyline: \nSweet Seduction (Sweet #3) He was the stuff erotic dreams are made of Salon owner Julie Stanford wanted Nathan Tucker ever since she gave him his first massage. Getting paid to feel every inch of his body, stripped, oiled, and spread out in front of her. Stuff dreams are made of. But the sexy guy was oblivious to the signals she was sending; until she finished off his final rub-down with something extra. In fact, the best extra he ever had. Unfortunately, he came around too late. Now Julie's moving on. She was everything he'd dreamed of The woman was driving him crazy.  She lit fire to his insides then ran like a scalded cat.  And now she's going to someone else to have all her fantasies fulfilled? Over his dead body. He's more than willing to give her what she wants, and as soon as he pins the little minx down, he'd show her his own brand of sweet seduction. It's all fun and games until someone falls in love.", "hash": "a0892cf7-8fe0-45e0-ab40-cb39d1528b48"}, {"title": "Sweet Temptation (Sweet #4)", "author": "Maya Banks", "pgs": 41, "sum": "Storyline: \nSweet Temptation (Sweet #4) He was a by-the-book cop who broke the rules in the bedroom... Micah Hudson has painful secrets he's run hard from. He has new friends, a new life, but he's about to be confronted with the one person who reminds him of all he's tried to forget--Angelina, the sister of his oldest friend David. She knows everything about his past, including how he and David fell in love with the same woman, and how they decided the best way to prevent her from tearing them apart was to share her between them. But then a terrible accident left Micah alone... She was willing to do anything to make him see the woman she'd become... Micah lost the two people who meant the most in the world to him. Angelina lost her only family. And she kept her deepest secret close to her heart. Her love for Micah. No longer willing to wait, she decides it's time to go after him and bring him to his knees. She knows his secrets, his desires, his kinks and fetishes, and she'll use whatever it takes to reel him in. Behind the easygoing, loves women exterior lies a man with dark needs and passions. She can give him what he wants. But will he decide she's what he needs?", "hash": "c8fe8ad3-a409-40ed-aedc-9f57bd8752d1"}, {"title": "Sweet Possession (Sweet #5)", "author": "Maya Banks", "pgs": 38, "sum": "Storyline: \nSweet Possession (Sweet #5) She’s a singer who lives for the spotlight—and can’t resist her adoring fans… Outrageous and out-of-control, Lyric Jones is a spoiled pop star who lives hard and fast, always outrunning her past and the nightmares that haunt her. She’s used to getting what she wants—groupies included—because she can’t stand to be alone. So in bed, it’s the more the merrier, even if it means closing off the deepest part of herself… He’s a hands-on bodyguard—and a one-woman man. There is nothing Connor Malone wants to do less than babysit the celebratty songstress while she’s on vacation. But part of him relishes taming Lyric and showing her what it’s like to be possessed—body and soul—by one man. And though Lyric’s crazy antics nearly drive Connor to the edge, his quiet intensity penetrates her defenses, leaving them both vulnerable to the secrets that could topple Lyric from the stage.", "hash": "fa293cd6-fca3-497d-b9a0-b0ec44670f66"}, {"title": "Sweet Addiction (Sweet #6)", "author": "Maya Banks", "pgs": 39, "sum": "Storyline: \nSweet Addiction (Sweet #6) He awakened a need within her… Cole is successful beyond his dreams. He can have any woman he wants, but there’s only one he can’t stop thinking about. His childhood sweetheart, Renita. He’s never forgotten his first taste of innocent love and the desire that consumed them—or the pain he brought upon her… But now she belongs to another… Her long ago brush with submission awakened a longing in Ren that drove her to walk the darker edge of desire. She’s become a beautiful woman at ease with her sexuality and unapologetic about her need for a dominant man. When Cole finds her again, he’s gutted that she belongs to another. Ren’s current master agrees to give her to Cole for a short time, but then she must return to his keeping. And though Cole agrees to this bargain, he knows he will never be able to let Ren go again…", "hash": "86ccd87c-d537-494c-bfe2-256ad2df7c20"}, {"title": "Rush (Breathless #1)", "author": "Maya Banks", "pgs": 50, "sum": "Storyline: \nRush (Breathless #1) Gabe, Jace, and Ash: three of the wealthiest, most powerful men in the country. They’re accustomed to getting anything they want. Anything at all. For Gabe, it’s making one particular fantasy come true with a woman who was forbidden fruit. Now she’s ripe for the picking... When Gabe Hamilton saw Mia Crestwell walk into the ballroom for his hotel’s grand opening, he knew he was going to hell for what he had planned. After all, Mia is his best friend’s little sister. Except she’s not so little anymore. And Gabe has waited a long time to act on his desires. Gabe has starred in Mia’s fantasies more than once, ever since she was a teenager with a huge crush on her brother’s best friend. So what if Gabe’s fourteen years older? Mia knows he’s way out of her league, but her attraction has only grown stronger with time. She’s an adult now, and there’s no reason not to act on her most secret desires. As Gabe pulls her into his provocative world, she realizes there’s a lot she doesn’t know about him or how exacting his demands can be. Their relationship is intense and obsessive, but as they cross the line from secret sexual odyssey to something deeper, their affair runs the risk of being exposed—and vulnerable to a betrayal far more intimate than either expected.", "hash": "26f7c9f5-9842-42ea-b738-bb301278ef1d"}, {"title": "Fever (Breathless #2)", "author": "Morgan Rice", "pgs": 55, "sum": "Storyline: \nFever (Breathless #2) Jace, Ash, and Gabe: three of the wealthiest, most powerful men in the country. They’re accustomed to getting anything they want. Anything at all. For Jace, it’s a woman whose allure takes him completely by surprise... Jace Crestwell, Ash McIntyre, and Gabe Hamilton have been best friends and successful business partners for years. They’re powerful, they’re imposing, they’re irresistibly sexy, and Jace and Ash share everything—including their women. When they meet Bethany, Jace begins to feel things he’s never experienced before: jealousy, and a powerful obsession that threatens him, overwhelms him—and excites him beyond control. Jace isn’t sharing Bethany—with anyone. He’s determined to be the only man in her life, and it’s jeopardizing a lifelong friendship with Ash. Bethany will be his and his alone. Even if it means turning his back on his best friend.", "hash": "8a6160f7-6110-4707-94fe-5bf65012a207"}, {"title": "Burn (Breathless #3)", "author": "Morgan Rice", "pgs": 46, "sum": "Storyline: \nBurn (Breathless #3) Ash, Jace, and Gabe: three of the wealthiest, most powerful men in the country. They’re accustomed to getting anything they want. Anything at all. For Ash, it’s the woman who changes everything he’s ever known about dominance and desire... When it comes to sex, Ash McIntyre has always explored his wilder side — extreme and uncompromising. He demands control. And he prefers women who want it like that. Even the women he’s shared with his best friend, Jace. But Jace is involved with a woman he has no intention of sharing. And now even Gabe has settled into a relationship with a woman who gives him everything he needs, leaving Ash feeling restless and unfulfilled. Then Ash meets Josie, who seems immune to his charms and his wealth. Intrigued, he begins a relentless pursuit, determined she won’t be the one who got away. He never imagined the one woman to tell him no would be the only woman who’d ever drive him to the edge of desire.", "hash": "625eee18-5f78-43c6-a7aa-81d2d1bbfa66"}, {"title": "Beneath This Man ", "author": "Jodi Ellen Malpas", "pgs": 34, "sum": "Storyline: \nBeneath This Man (This Man #2) Jesse Ward drowned her with his intensity and blindsided her with his passion, but he kept her away from his dark secrets and broken soul. Leaving him was the only way Ava O'Shea could survive. She should have known that Jesse Ward is impossible to escape--and now he's back in her life, determined to remind her of the sensual pleasures they had shared. Ava is equally determined to get at the truth beneath this man's steely exterior. That means letting herself get close to the Lord of the Manor once more. And it's exactly where Jesse wants her--within touching distance...", "hash": "197f97f9-c5f6-48db-b955-a44a517bf52a"}, {"title": "I'd Tell You I Love You, But Then I'd Have to Kill You (Gallagher Girls #1)", "author": "Ally Carter", "pgs": 33, "sum": "Storyline: \nI'd Tell You I Love You, But Then I'd Have to Kill You (Gallagher Girls #1) Cammie Morgan is a student at the Gallagher Academy for Exceptional Young Women, a fairly typical all-girls school-that is, if every school taught advanced martial arts in PE and the latest in chemical warfare in science, and students received extra credit for breaking CIA codes in computer class. The Gallagher Academy might claim to be a school for geniuses but it's really a school for spies. Even though Cammie is fluent in fourteen languages and capable of killing a man in seven different ways, she has no idea what to do when she meets an ordinary boy who thinks she's an ordinary girl. Sure, she can tap his phone, hack into his computer, or track him through town with the skill of a real \"pavement artist\"-but can she maneuver a relationship with someone who can never know the truth about her? Cammie Morgan may be an elite spy-in-training, but in her sophomore year, she's on her most dangerous mission-falling in love.", "hash": "1a64193d-b841-46eb-9880-63ec5032dbb2"}, {"title": "Cross My Heart and Hope to Spy (Gallagher Girls #2)", "author": "Ally Carter", "pgs": 28, "sum": "Storyline: \nCross My Heart and Hope to Spy (Gallagher Girls #2) Cammie Morgan is back, and it's clear that her life hasn't calmed down since the events of I'd Tell You I Love You, But Then I'd Have to Kill You. At first, giddy anticipation is in the air. Gallagher Academy, Cammie's elite spy school, is hosting a visit from a covert training center for boys. Soon after the boys' arrival, though, everything goes dangerously awry when a series of security breaches are discovered at the academy. Worse yet, teenage agent-in-training Cammie is being blamed for the penetration. With the school's top-secret status at risk, the Gallagher Girls have to work quickly to save their beloved school.", "hash": "60161444-63b8-4bf8-83d3-bacfa97706b2"}]