[{"title": "Eclipse Bay (Eclipse Bay #1)", "author": "Jayne Ann Krentz", "pgs": 80, "sum": "Storyline: \nEclipse Bay has grown and flourished on the rugged Oregon coast, where the shore can be rocky and forbidding, full of sharp cliffs and hidden coves. In Eclipse Bay by Jayne Ann Krentz, this small town is also filled with secrets as treacherous as the landscape and rivalries as fierce as an ocean storm. Their grandfathers hated each other. Their fathers hated each other. And as the next generation of the Hartes and Madisons, Hannah and Rafe are expected to hate each other too. But Hannah Harte, a successful wedding consultant with a skeptical view of marriage, remembers the long-ago night on the beach that revealed Rafe as much more than just \"that disreputable Madison boy.\" And Rafe remembers the heroic gesture that proved Hannah's fierce spirit was stronger than any feud and saved him from near-certain imprisonment. Now reunited by a surprising inheritance after years of living their separate lives, Rafe and Hannah return to Eclipse Bay, and the hostilities that still divide, and bind, their families. And they are discovering something that is at once delightful and deeply disturbing ... They don't hate each other. Not at all.", "hash": "e416dc01-2dd3-42d9-9916-a1dfb3322924"}, {"title": "Gift of Fire (Gift #2)", "author": "Jayne Ann Krentz", "pgs": 85, "sum": "Storyline: \nHE FIGURES ONE AND ONE EQUAL TWO. SHE KNOWS HE'S WRONG...IF BABY MAKES THREE. Jonas Quarrel was lean, sexy, and equally capable of quoting Renaissance poetry or wielding a dagger. Verity Ames knew Jonas was the perfect partner for an affair--and that he was not the marrying kind. Before long he would be looking for a new excitement, leaving Verity behind to run her gourmet restaurant in a California resort, hold on to misty colored memories, and wonder what she was going to do if she were pregnant with his child. Sure enough, her adventuring lover was soon off to an Italian villa rebuilt on a Pacific Northwest island. Jonas went to hunt for missing Renaissance jewels. Verity went along to snare a husband. A big, soft, four-poster bed might be the ideal place to try out her lures! But in this ancient mansion of hidden passageways and mysterious perils, there were some deadly traps for those blinded by love...unless Verity could help Jonas discover the most precious treasure a woman and man can find.", "hash": "f3e4aa0d-01b9-4d8e-9dd6-0eed24f8d357"}, {"title": "Gift of Gold (Gift #1)", "author": "Jayne Ann Krentz", "pgs": 100, "sum": "Storyline: \nDestiny found them, and rapture, wild and free, opened their hearts... As she fled to safety in the dark of the Mexican night, Verity Ames could not see the man who had saved her from attack... but he was determined to see her again. Two months later, Jonas Quarrel appeared at her California restaurant. He was a scholar--looking for work as a dishwasher! Yet the stranger on her doorstep was also a man with a special gift and a hidden mission. What was the subtle, mysterious power he exuded? How and why had he found her? All Verity knew was that his lips burned hers, awakening a passion far beyond her fantasies . . . and that soon, she and Jonas would have to face the secret fury that threatened their love.", "hash": "cb281c0b-269f-4539-a03d-66f9a0ef2fe8"}, {"title": "Thief (Breeding #3)", "author": "Alexa Riley", "pgs": 47, "sum": "Storyline: \nSean Sparrow has one more job to pull: break into the bank, steal what he was hired to take, and get out. He plans everything to the very last detail, sure of success... until he sees Tessa. Tessa Martin lives a humdrum life. With a boring job and a crappy roommate, she's sure there must be more to life than this. She's not prepared for the muscle-bound bearded man who walks into her life, offering her everything she's ever wanted. When Sean breaks down all of Tessa's walls, she has no choice but to fall hard and fast. But when the truth comes out, and Sean is fully revealed to her, will their instalove be enough to hold them together? Warning: This book hero is over- the-top obsessed, totally head over heels in love, and desperate to make babies with the heroine ASAP. If you want a fun read with SUPER hot steam, Kindle-melting love, and a beard to rub between thighs, then this book is for you.", "hash": "a3b824ab-cdc5-4136-aa7e-ce302166c537"}, {"title": "Mechanic (Breeding #2)", "author": "Alexa Riley", "pgs": 40, "sum": "Storyline: \nEverything was fine until that innocent little rich girl walked into my garage. Since the second I laid my eyes on her, all I've wanted to do is get my dirty hands on her pure body. There's one minor obstacle standing in my way, but I've got a plan. All I've got to do is claim her, and she’ll be mine forever. Warning: This book is over-the-top, insta-love. There's nothing but steamy scenes, babies trying to be made, and an obsessed bearded alpha hero claiming a virgin who will be his forever. If you want it hot and dirty, this is it! *whispers* There's a sweet smutty surprise at the end!", "hash": "c175bcc8-2b6d-42da-9447-2963a7ed9333"}, {"title": "Coach (Breeding #1)", "author": "Alexa Riley", "pgs": 20, "sum": "Storyline: \nRetiring from the NFL was the right decision, and at thirty years old, I've done things most people could only dream of. After all I've accomplished, coaching high school football should be easy...but when you've got a distraction in the form of a nerdy girl with curves, things can get complicated. She's a student, she's barely legal, and she's my best friend’s daughter. I didn't know what desire was until Megan. I had no idea obsession could drive someone insane, until I saw her. I wasn't prepared for the fact that once I laid eyes on Megan my life would really begin. I have to have her, no matter what the cost. I have to breed her and bind her to me so tightly she can't ever get away. She'll be mine, even if I have to take her. Warning: this book is ridiculous, over the top, completely unbelievable, and pretty much just about breeding the heroine. If you're okay with that, welcome to my dirty, dirty book! Just remember, I warned you.", "hash": "2e4acb4a-18e6-44f6-947a-6db737617fe2"}, {"title": "Shield's Lady (Lost Colony #3)", "author": "Jayne Ann Krentz", "pgs": 91, "sum": "Storyline: \nSarianna was a cool, confident businesswoman, an outcast from the East determined to regain her rightful status. Gryph was an intense mercenary respected and feared throughout the opulent cities and savage frontiers of the West. But from the moment they met, fate made them one. Was it their destiny to be bound to a force that both captivated and frightened them?", "hash": "6e83e8a0-82b1-47a3-af9e-95dfa45ed304"}, {"title": "Sweet Starfire (Lost Colony #1)", "author": "Jayne Ann Krentz", "pgs": 96, "sum": "Storyline: \nBeautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.", "hash": "8279baa2-c2fd-4bd8-a924-83eaae3bca32"}, {"title": "Until You (Westmoreland Saga #3)", "author": "Judith McNaught", "pgs": 114, "sum": "Storyline: \nSheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family's country. But somehow everything went wrong. For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger's care, not knowing who she was. It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.", "hash": "54cd506e-7a0f-4a00-9d04-52266f3a6b3e"}, {"title": "Whitney, My Love (Westmoreland Saga #2)", "author": "Judith McNaught", "pgs": 149, "sum": "Storyline: \nFresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.", "hash": "884c2aa1-a38c-4803-bcb8-4a48cbd60630"}]