[{"title": "Don't Judge a Girl by Her Cover (Gallagher Girls #3)", "author": "Ally Carter", "pgs": 30, "sum": "Storyline: \nDon't Judge a Girl by Her Cover (Gallagher Girls #3) When Cammie \"The Chameleon\" Morgan visits her roommate Macey in Boston, she thinks she's in for an exciting end to her summer break. After all, she's there to watch Macey's father accept the nomination for vice president of the United States. But when you go to the world's best school (for spies), \"exciting\" and \"deadly\" are never far apart. Cammie and Macey soon find themselves trapped in a kidnappers' plot, with only their espionage skills to save them. As her junior year begins, Cammie can't shake the memory of what happened in Boston, and even the Gallagher Academy for Exceptional Young Women doesn't feel like the safe haven it once did. Shocking secrets and old flames seem to lurk around every one of the mansion's corners as Cammie and her friends struggle to answer the questions, Who is after Macey? And how can the Gallagher Girls keep her safe? Soon Cammie is joining Bex and Liz as Macey's private security team on the campaign trail. The girls must use their spy training at every turn as the stakes are raised, and Cammie gets closer and closer to the shocking truth.", "hash": "b8cc69d3-c0db-475e-8c4b-0cd7feb8adfb"}, {"title": "Only the Good Spy Young (Gallagher Girls #4)", "author": "Ally Carter", "pgs": 28, "sum": "Storyline: \nOnly the Good Spy Young (Gallagher Girls #4) When Cammie Morgan enrolled at the Gallagher Academy, she knew she was preparing for the dangerous life of a spy. What she didn’t know was that the serious, real-life danger would start during her junior year of high school. But that’s exactly what happened two months ago when Cammie faced off against an ancient terrorist organization dead set on kidnapping her. Now the danger follows her everywhere, and even Cammie “The Chameleon” can’t hide. When a terrifying encounter in London reveals that one of her most-trusted allies is actually a rogue double-agent, Cammie no longer knows if she can trust her classmates, her teachers—or even her own heart. In this fourth installment of the New York Times best-selling series, the Gallagher Girls must hack, spy, steal, and lie their way to the truth.as they go searching for answers, recognizing that the key to Cammie’s future may lie deep in the past.", "hash": "fc0ac7b7-7294-4088-862f-f1bc832e4cfe"}, {"title": "United We Spy (Gallagher Girls #6)", "author": "Ally Carter", "pgs": 34, "sum": "Storyline: \nUnited We Spy (Gallagher Girls #6) Cammie Morgan has lost her father and her memory, but in the heart-pounding conclusion to the best-selling Gallagher Girls series, she finds her greatest mission yet. Cammie and her friends finally know why the terrorist organization called the Circle of Cavan has been hunting her. Now the spy girls and Zach must track down the Circle’s elite members to stop them before they implement a master plan that will change Cammie—and her country—forever.", "hash": "93c4d060-5ee6-45a4-aca3-eb050f20b086"}, {"title": "Cheating at Solitaire (Cheating at Solitaire #1)", "author": "Ally Carter", "pgs": 30, "sum": "Storyline: \nCheating at Solitaire (Cheating at Solitaire #1) Self-help guru Julia James is so good at being single that she's become famous for it-advising women that they don't need a man to be happy. Then the unthinkable happens. Just when her newest book, 101 Ways to Cheat at Solitaire, is about to hit stores, a trumped-up piece of gossip linking her to a gorgeous actor hits the papers. Their pictures are splashed all over the tabloids, and now Julia's credibility is about to hit rock bottom. But she isn't going down without a fight. Unless, that is, the actor is going down with her.", "hash": "ee669c23-6818-42e3-bf49-9d2c1f263048"}, {"title": "Weekends Required (Danvers #1)", "author": "Sydney Landon", "pgs": 27, "sum": "Storyline: \nWeekends Required (Danvers #1) Claire Walters has worked for Jason Danvers as his assistant for three years, but he’s never appreciated her as a woman—until the day she jumps out of a cake at his friend’s bachelor party.… To support her ailing mother, Claire is forced to work a second job at a party-planning company. But when her handsome boss ends up with a front-row seat to the action, she’s mortified—and he’s intrigued. With Danvers International in the middle of an important merger, Jason asks Claire to accompany him on weekend business trips—and suddenly all her fantasies are coming true. Her outspoken best friend thinks that getting a little “executive attention” will solve everything. But Claire sees more in Jason than just sex. Jason is determined to know how the beautiful, sexy woman in the cake could also be his mousy assistant. The more time they spend together, the more he realizes how much fun it can be to mix business with pleasure. And how much he wants to offer her a happily ever after of her own….", "hash": "ec710e16-cdb1-4fe8-b0b0-b570bdfe9112"}, {"title": "Not Planning on You (Danvers #2)", "author": "Sydney Landon", "pgs": 30, "sum": "Storyline: \nNot Planning on You (Danvers #2) Suzy Denton thought she had it all: a great job as an event planner for Danvers International and a committed relationship to her high school sweetheart... But now her life has gone to hell in a hand-basket. Not only did she discover her fiancé cheating, but a recent corporate merger is making her job very difficult—mostly due to Grayson Merimon, wealthy CEO. Gray is a man who goes after what he wants. And, after their first meeting, he wants Suzy. Even though he looks like every fantasy she’s ever had, Suzy is wary of the powerful businessman. She likes her newfound independence, even if her best friend thinks it’s an excuse not to risk her heart again. Besides, she doesn’t think Gray could ever be interested in a relationship with someone like her. When he calls her bluff, Suzy agrees to one night together. But when circumstances continue to throw them together—and with Gray determined to show her that two opposites can be a perfect fit—Suzy realizes that she might just have found the one man who can give her what she always needed…", "hash": "256faea7-2452-48c0-8d94-dbff66a20268"}, {"title": "Fall for Me (Danvers #3)", "author": "Sydney Landon", "pgs": 27, "sum": "Storyline: \nFall for Me (Danvers #3) Beth has always lived in her outgoing sister’s shadow, plagued by her own insecurity about her body. It’s time for her to step out from the sidelines and experience what life has to offer—then she’s laid off from her teaching job, and has to rely on her sister to get her a job at Danvers International. Nick Merimon is gorgeous, wealthy, and a well-known playboy—just the sort of man Beth has always avoided. But even she can’t deny the sparks that are flying between them. He could be just the man to show her what she’s been missing all these years. And after they share one heart-stopping night together, she is surprised when it leads to a relationship. But as their connection grows, and the realities of their romance begin to show, Beth will have to overcome both her own insecurities and her doubts about Nick’s intentions if she’s ever going to find lasting happiness…", "hash": "d4ca38fb-73ec-48f5-9906-b8ca56a4fbd1"}, {"title": "Fighting For You (Danvers #4)", "author": "Sydney Landon", "pgs": 28, "sum": "Storyline: \nFighting For You (Danvers #4) Ella Webber has spent years uncomfortable around the opposite sex... But as soon as she meets handsome Declan Stone, she is smitten. Quickly they become friends, finding frequent reasons to see each other around the office, and Ella longs for even more. So-with a little help from her friends-Ella resorts to performing a little seduction. One that Declan will never be able to resist. Burdened by emotional baggage from his time in the army, Declan refuses to believe he's the right man for sweet Ella. Even if she makes him long for normal things, like marriage and family....But in his attempts to close off his heart from her love, could he have underestimated Ella's powers of persuasion?", "hash": "55e76788-25ab-4bf6-b508-e0a1be5fe197"}, {"title": "Betting on You: A Danvers Novella (Danvers #4.5)", "author": "Sydney Landon", "pgs": 11, "sum": "Storyline: \nBetting on You: A Danvers Novella (Danvers #4.5) Living the life of a rich socialite was never in Mia’s plans, much to the chagrin of her wealthy parents. She’s made her own way, studying computer science at Brown and snagging a coveted position with Danvers International after graduation. Her plan to avoid parental involvement seems to be going well until her mother buys her a date at a charity auction—with the hot resort owner who she’s been eyeing on her latest work project. Seth never mixes business with pleasure, but something about Mia drives him to distraction. Giving into his desires for just one night will hopefully clear his head enough to keep his hands off her during office hours. But when one mind-blowing night turns into weeks of flirtation, frustration, and companionship, Mia realizes that their workplace fling may be developing into more—and that Seth might be the perfect man she’s been waiting for…", "hash": "76dd843c-561b-41ab-be1d-056c0634a01e"}, {"title": "Wicked Ties (Wicked Lovers #1)", "author": "Shayla Black", "pgs": 51, "sum": "Storyline: \nWicked Ties (Wicked Lovers #1) She didn’t know what she wanted until he made her beg for it... Morgan O’Malley has seen a lot of kinky things as the hostess of a cable sex talk show. But she’s never met a man like Jack Cole before. A self-proclaimed dominant, he’s as alpha as a male can get–and good for Morgan to have around when an obsessed stalker ratchets up his attempts to get to her. Though Jack is a bodyguard, Morgan feels anything but safe in his presence. Because slowly and seductively, Jack is bringing her deepest fantasies to the surface. And when he bends her to his will, what’s more shocking than her surrender is how much she enjoys it–and starts to crave his masterful touch. A willing player in Jack’s games, Morgan knows that his motives aren’t pure, but she has no idea how personal they are…", "hash": "3a4c33da-c242-4ccc-a07f-8acd40ec788e"}]