[{"title": "Decadent (Wicked Lovers #2)", "author": "Shayla Black", "pgs": 51, "sum": "Storyline: \nDecadent (Wicked Lovers #2) Two men are better than one… How can a virgin seeking happily-ever-after with a hot pop star who has a penchant for threesomes win her fantasy man? Kimber Edgington desperately needs a plan to convince Jesse McCall, who’s been her friend and secret crush since they spent a summer together as teenagers, that they are meant for each other. But all the tabloid stories about his sexual escapades make her feel oh-so inadequate. Determined to prove she’s woman enough for Jesse, Kimber turns to bodyguard Deke Trenton for sexual education. Bold and brash, Deke warns Kimber that playing with him is playing with fire. But he can’t bear to imagine the innocent beauty in someone else’s arms. So Deke and his super-sexy friend, Luc, take Kimber under their wings and dangerously close to the edge of ecstasy. Though she’s saved herself for Jesse, Kimber soon learns, he’s not the man adept at stoking her aching, endless need. That’s Deke, and he can’t resist when Kimber begs for more–and more…", "hash": "e75cd88e-52d0-4a66-a057-ae88bcb21a8e"}, {"title": "Delicious (Wicked Lovers #3)", "author": "Shayla Black", "pgs": 45, "sum": "Storyline: \nDelicious (Wicked Lovers #3) He can’t control his desire. Luc Traverson’s entire future is planned out—but there is one very sexy obstacle in his path: Alyssa Devereaux . She’s a former exotic dancer turned strip club owner and restaurateur. Recently, Alyssa and Luc shared one night of wild abandon that left Luc terrified by his loss of self-control—and Alyssa desperate for more. And that’s just the way she wants it. Fulfilling a promise, Luc is the guest chef for Alyssa’s restaurant debut. The sight of her makes Luc wild, so how can he survive a week without letting loose and ravaging her—especially when she’s begging for it? Luc’s desire for her explodes when he realizes he isn’t the only man desperate to have her. But one of the others is deadly. And that’s not the end of Alyssa’s secrets…which are as dark and mysterious and enticing as her fantasies.", "hash": "abb47b39-d468-4e1c-aa1a-673b5aa39350"}, {"title": "Surrender to Me (Wicked Lovers #4)", "author": "Shayla Black", "pgs": 50, "sum": "Storyline: \nSurrender to Me (Wicked Lovers #4) A secret fantasy. Hunter had everything until a bullet put his career as a Navy SEAL on hold. Restless and uncertain about his future, he accepts an intriguing proposition: share an acquaintance’s girlfriend and fulfill her fantasy of a ménage. It should have been just a night of sexual adventure between three consenting adults. But Kata is like no other girl Hunter has ever met. By turns audacious and sexy, then vulnerable and aloof, she’s a heartbreaker he’s determined to master. But he needs more than one night. And he wants to do it alone. An uncontrollable obsession. Kata never expected to leave her comfortable relationship and explore something so dangerously forbidden with a stranger. Hard as she tries to resist, the guilty pleasure overwhelms her, and she surrenders herself, inch by inch, to the hardcore man who wants her for himself. Consumed by blazing desire, they’re soon threatened by the shadows of the past. And now to keep Kata safe, Hunter makes her a bold proposition of his own. Saying yes will destroy her heart. But saying no could cost Kata her life.", "hash": "812fa3e6-547a-4126-8ab2-8e20fb677b56"}, {"title": "Belong to Me (Wicked Lovers #5)", "author": "Shayla Black", "pgs": 52, "sum": "Storyline: \nBelong to Me (Wicked Lovers #5) She’s undercover and in over her head… When FBI analyst Tara Jacobs’ fellow agent and best friend goes missing while investigating a sex ring, Tara goes undercover as a submissive in a Dallas BDSM club called Dominion. But no man can top a woman with Tara’s moxie convincingly enough—until an edgy, dangerous Dom takes control of the scene and sets her heart racing with a single, commanding glance. Too bad he’s also the man who stole her innocence years ago—and the one to whom she will never submit. He’s got everything under control…until he falls for her again. Navy SEAL Logan Edgington once left the woman he loved to save her life. He knows Tara will never forgive him, but he has no doubt that he possesses the knowledge to master her fears and the strength to guide her through an unfamiliar world of pleasure and pain. He alone can protect her on a dangerous mission that reveals both wicked depravities and terrible secrets. Logan relishes the exquisite torture of holding her again, feeling her uninhibited response. No matter how much Tara insists their fling will end after this mission, he’s determined that she will be his again—and this time, he’ll never let her go.", "hash": "bcd53cdb-c79c-4169-83fe-78c7bb9e7f40"}, {"title": "Mine to Hold (Wicked Lovers #6)", "author": "Shayla Black", "pgs": 45, "sum": "Storyline: \nMine to Hold (Wicked Lovers #6) A friend’s duty. Tyler Murphy was an LAPD detective, single and happy—until a near-fatal tragedy crippled his friend, fellow detective Eric Catalano. While Tyler supported Eric, he also became a shoulder for Eric’s wife, Delaney, to lean on. But with one naughty suggestion from Eric, a drunken night with Delaney spilled into erotic abandon. Before it was over, Tyler saw his best friend’s wife as a woman and yearned for more. When Eric struggled to deal with the aftermath, Delaney begged Tyler to leave. Crushed, he fled to Louisiana, hoping to escape his longing for the one woman he could never have again…and unaware of what he’d left behind. A lover’s desire. After two years of living with regret, Tyler finds Delaney on his doorstep, her husband having abandoned her long ago. She’s protecting a shocking secret and desperately needs refuge from a stalker determined to see her dead. As they fight to stay alive and catch the killer, they struggle to resolve the guilt of their past pleasures. But they can’t deny that what was once a spark is now a flame burning out of control. To possess Delaney—body and soul—Tyler must heal her pain and thwart the evil that’s a mere breath behind her…", "hash": "11b6db23-3c0a-44b9-86a7-1072260feba7"}, {"title": "Wicked All the Way (Wicked Lovers #6.5)", "author": "Shayla Black", "pgs": 13, "sum": "Storyline: \nWicked All the Way (Wicked Lovers #6.5) Retired military colonel Caleb Edgington has spent two long years trying to achieve the most important mission objective of his life—but not behind enemy lines. He’s trying to capture a woman with a broken heart. Having lost at love once, he understands being gun shy. The residual fears from Carlotta Buckley’s nasty divorce have stood between them, but he’s done with that. And he’s got the perfect strategy to lure her in… Carlotta never thought she’d fall in love again. Once bitten, she’s now more than twice shy. And Caleb is everything she can’t handle—fierce, relentless, uncompromising…sexual. She’s managed to mostly avoid him, but now his son and her daughter need their help. Can Caleb and the spirit of the season convince her that she’s ready to take a chance on love again?", "hash": "d3b798e3-c37b-4c3a-9b97-51d1369b56f9"}, {"title": "Ours to Love (Wicked Lovers #7)", "author": "Shayla Black", "pgs": 55, "sum": "Storyline: \nOurs to Love (Wicked Lovers #7) Between two brothers... Xander Santiago spent years living it up as a billionaire playboy. Never given a chance to lead his family business in the boardroom, he became a Master in the bedroom instead. His older brother inherited the company and worked tirelessly to make it an empire. But while the cutthroat corporate espionage took its toll on Javier, nothing was as devastating as the seemingly senseless murder of his wife. It propelled him into a year of punishing rage and guilt...until Xander came to his rescue. Comes an irresistible woman... Eager to rejuvenate Javier’s life, Xander shanghais him to Louisiana where they meet the beautiful London McLane. After surviving a decade of tragedy and struggle, London is determined to make a fresh start—and these sexy billionaire brothers are more than willing to help. In every way. And London is stunned to find herself open to every heated suggestion...and desperately hoping that her love will heal them. And inescapable danger... But a killer with a hidden motive is watching, on a single-minded mission to destroy everything the Santiago brothers hold dear, especially London. And as fear and desire collide, every passionate beat of her heart could be her last.", "hash": "1683e109-df4d-4919-bdf2-fc023870587a"}, {"title": "Wicked and Dangerous (Wicked Lovers #7.5)", "author": "Shayla Black", "pgs": 37, "sum": "Storyline: \nWicked and Dangerous (Wicked Lovers, #7.5; Dangerous Tides, #1.5) by Shayla Black , Rhyannon Byrd In the anthology: Wicked All Night by Shayla Black A sweet school teacher who changed towns, jobs, and lives after her divorce decides to take a lover. She hooks up with a bodyguard whose talents under the sheets make her melt. Until she learns that his motives are just as dangerous as they are wicked… Make Me Yours by Rhyannon Byrd After her father is murdered, a woman finds herself next on the kill list—and forced to reconnect with the one man who can keep her alive. And as danger stalks her, she’ll surrender herself to the lawman whose every touch leaves her breathless and exposed…", "hash": "1a773703-87d3-45f8-a72e-6567e08280ac"}, {"title": "Forever Wicked (Wicked Lovers #7.8)", "author": "Shayla Black", "pgs": 21, "sum": "Storyline: \nForever Wicked (1001 Dark Nights, #1; Wicked Lovers, #7.8) They had nothing in common but a desperate passion… Billionaire Jason Denning lived life fast and hard in a world where anything could be bought and sold, even affection. But all that changed when he met “Greta,” a beautiful stranger ready to explore her hidden desires. From a blue collar family, Gia Angelotti wore a badge, fought for right—and opened herself utterly to love him. Blindsided and falling hard, Jason does the first impulsive thing of his life and hustles her to the altar. Until a second chance proved that forever could be theirs. Then tragedy ripped Jason’s new bride from his arms and out of his life. When he finds Gia again, he gives her a choice: spend the three weeks before their first anniversary with him or forfeit the money she receives from their marriage. Reluctantly, she agrees to once again put herself at his mercy and return to his bed. But having her right where he wants her is dangerous for Jason’s peace of mind. No matter how hard he tries, he finds himself falling for her again. Will he learn to trust that their love is real before Gia leaves again for good?", "hash": "61840fe7-144b-464e-84f9-1109ffcdbd39"}, {"title": "Theirs to Cherish (Wicked Lovers #8)", "author": "Shayla Black", "pgs": 54, "sum": "Storyline: \nTheirs to Cherish (Wicked Lovers #8) The perfect place for a woman on the run to disappear… Accused of a horrific murder she didn’t commit, former heiress Callie Ward has been a fugitive since she was sixteen—until she found the perfect hideout, Club Dominion. The only problem is she’s fallen for the club’s Master, Mitchell Thorpe, who keeps her at arm’s length. Little does she know that his reasons for not getting involved have everything to do with his wounded heart…and his consuming desire for her. To live out her wildest fantasies… Enter Sean Kirkpatrick, a Dom who’s recently come to Dominion and taken a pointed interest in Callie. Hoping to make Thorpe jealous, she submits to Sean one shuddering sigh at a time. It isn’t long before she realizes she’s falling for him too. But the tender lover who’s slowly seducing her body and earning her trust isn’t who he claims… And to fall in love. When emotions collide and truths are exposed, Sean is willing to risk all to keep Callie from slipping through his fingers. But he’s not the only man looking to stake a claim. Now Callie is torn between Sean and Thorpe, and though she’s unsure whom she can trust, she’ll have to surrender her body and soul to both—if she wants to elude a killer…", "hash": "6cf3d8e8-9944-44fe-8f15-c32396016239"}]