[{"title": "One Dom to Love (The Doms of Her Life #1)", "author": "Shayla Black", "pgs": 34, "sum": "Storyline: \nOne Dom to Love (The Doms of Her Life #1) by Shayla Black , Jenna Jacob , Isabella LaPearl Raine Kendall has been in love with her boss, Macen Hammerman, for years. Determined to make the man notice that she’s a grown woman with desires and needs, she pours out her heart and offers her body to him—only to be crushingly rejected. But when his friend, very single, very sexy Liam O’Neill watches the other Dom refuse to act on his obvious feelings for Raine, he resolves to step in and do whatever it takes to help Hammer find happiness again, even rousing his friend’s possessive instincts by making the girl a proposition too tempting to refuse. But he never imagines that he’ll end up falling for her himself. Hammer has buried his lust for Raine for years. After rescuing the budding runaway from an alley behind his exclusive BDSM Dungeon, he has come to covet the pretty submissive. But tragedy has taught him that he can never be what she needs. So he watches over her while struggling to keep his distance. Liam’s crafty plan blindsides Hammer, especially when he sees how determined his friend is to possess Raine for his own. Hammer isn’t ready to give the lovely submissive over to any other Dom, but can he heal from his past and fight for her? Or will he lose Raine if she truly gives herself—heart, body, and soul—to Liam?", "hash": "f89bbfb7-6811-4187-b899-701147af3546"}, {"title": "The Young and the Submissive (The Doms of Her Life #2)", "author": "Shayla Black", "pgs": 52, "sum": "Storyline: \nThe Young and the Submissive (The Doms of Her Life #2) by Shayla Black , Jenna Jacob , Isabella LaPearl Raine Kendall has everything a woman could want…almost. Sexy, tender Dom Liam O’Neill is her knight in shining armor, but Raine is constantly pinching herself. Is he too good to be true or is this growing connection one that could last a lifetime? She’s constantly torn by her abiding feelings for her commanding boss, Macen “Hammer” Hammerman, especially in the wake the mind-blowing night he cast aside the barriers between them and ravaged every inch of her body. Hammer, Liam’s former best friend, can’t stop coveting Raine. But Liam is determined to hold and guide the woman he loves and see if she can be the submissive of his dreams. However, he’s finding that her trust is hard won and he needs a bloody crowbar to pry open her scarred soul. So he risks everything to win her once and for all. But once he’s put his daring plan in motion, will it cost Liam his heart if he loses Raine to Hammer for good?", "hash": "69a3bbad-12fc-4ad0-b618-219ab019cfc9"}, {"title": "Their Virgin Captive (Masters of Ménage #1)", "author": "Shayla Black", "pgs": 29, "sum": "Storyline: \nTheir Virgin Captive (Masters of Ménage #1) by Shayla Black , Lexi Blake Brothers Gavin, Slade, and Dex, fall hard for Gavin’s new secretary, beautiful Hannah Craig. The oil executives know they must give her time to get to know them before she can choose one . . . who will seduce the virgin and keep her for his own. But when a dangerous predator begins stalking the small-town beauty, they work together to protect her, abducting Hannah and spiriting her to an isolated hideaway. Once alone with her, none of them can contain their burning desire. Though Slade and Dex don’t mind sharing, Gavin’s tragic past has put distance between him and his brothers. Now, they’re hoping that not only will Hannah love them back . . . but maybe mend their fractured family. After overcoming her initial fears, the men teach her wild pleasure she’s never imagined. She grows closer to each, their devotion melting her inhibitions. Hannah finds herself embracing love with all three men—and hoping she can heal Gavin’s wounded soul. But her new found happiness turns to terror when her stalker finds her. Will Gavin, Slade and Dex lose their woman to a menace that threatens everything they hold dear, or will they finally unite to make Hannah theirs forever?", "hash": "8fcc7f78-2518-4d74-9bee-8cc3656803e8"}, {"title": "Their Virgin's Secret (Masters of Ménage #2)", "author": "Shayla Black", "pgs": 28, "sum": "Storyline: \nTheir Virgin's Secret (Masters of Ménage #2) by Shayla Black , Lexi Blake Two Men on a Mission Security Professionals Burke and Cole Lennox have shared women before but never meant to fall in love with one. Their lives are precarious, always on the edge of trouble. But Jessa Wade is too tempting, too perfect to let go. They’re on a dangerous mission, but they can’t help but get close to the beautiful, innocent artist. When their mission takes them to a foreign land, they reluctantly leave their love behind, promising to return for her one day. A Woman with a Secret After her lovers disappeared, Jessa Wade bravely moves on with her life, protecting her secret. But when she becomes the target of one of Burke and Cole’s enemies, the men leap into action, vowing to save their woman and to never leave again. As danger stalks all three, they must come together and face the mistakes of their past. On the run and out of time, Burke and Cole will fight for their future with Jessa. But will Jessa’s secret bring them together…or tear them apart?", "hash": "9bb9b19c-ca7b-41f7-8df4-8e272b5c9f6e"}, {"title": "Their Virgin Concubine (Masters of Ménage #3)", "author": "Shayla Black", "pgs": 36, "sum": "Storyline: \nTheir Virgin Concubine (Masters of Ménage #3) by Shayla Black , Lexi Blake The country of Bezakistan – renowned for its wealth and the beauty of its deserts Piper Glen is thrilled when Rafe and Kade al Mussad ask her to visit their country on a business trip. Madly attracted to both, the virginal secretary knows that neither of her intensely handsome bosses desires her. But every night she dreams of having them both in her bed, fulfilling her every need. Rafe and Kade have finally found the perfect woman in Piper. Sweet and funny. Intelligent and strong. Before they can reveal their feelings, the brothers must fulfill an ancient tradition. Every sheikh must steal his bride and share her with his brothers. They have thirty days to convince Piper to love them all forever. The country of Bezakistan – notorious for its danger… Sheikh Talib al Mussad knows his villainous cousin seeks to take his throne. If Talib and his brothers fail to convince the beautiful Piper to love them, all will be lost. After meeting Piper, he knows he would risk everything to possess her heart. Khalil al Bashir has long coveted his cousin’s rule. Without a bride to seal their birthright, his every wish will come true. If Piper falls for them, he will lose everything but Piper can’t love them if she’s dead…", "hash": "81ee1c93-59f7-4cad-8178-bd3f49ca3e81"}, {"title": "Their Virgin Princess (Masters of Ménage #4)", "author": "Shayla Black", "pgs": 43, "sum": "Storyline: \nTheir Virgin Princess (Masters of Ménage #4) by Shayla Black , Lexi Blake A broken woman… Alea Binte al Mussad, Princess of Bezakistan, was abducted from her university, mentally tortured and forced to witness the worst of humanity. She was rescued, but not before fear and her shattered soul made her retreat into herself. Two years later, she’s living behind the palace’s locked gates and the walls she’s built surrounding her heart. Alea is comforted by the joyous family around her, but inside feels so alone—except when she’s with the steady trio of guards who relentlessly keep her safe. And tempt her with a passion she isn’t sure she’ll survive. Three stalwart warriors determined to claim her… Dane Mitchell, Cooper Evans, and Landon Nix wanted Alea from the moment they laid eyes on her. Held back by their duty and her fragility, they worship the Princess from afar, determined to claim her if the chance ever comes. When Alea learns that someone may still be hunting her, she plots to escape both danger and her guards’ simmering, overwhelming passion. Dane, Coop, and Lan aren’t about to let her go. When they find themselves in paradise and all boundaries are stripped away, the ice begins to melt around Alea’s heart. But when reality comes crashing in, will she learn to accept love before a killer strikes again?", "hash": "78127f12-657f-4c4d-a4a7-43bb8da83a97"}, {"title": "Their Virgin Hostage (Masters of Ménage #5)", "author": "Shayla Black", "pgs": 42, "sum": "Storyline: \nTheir Virgin Hostage (Masters of Ménage #5) by Shayla Black , Lexi Blake One Hostage Bride Kinley Kohl agrees to marry wealthy Greg Jansen to save her family. Her wedding day should be the happiest of her life…except that she doesn’t love him. And she can’t help but wonder if she’s making a mistake. Even so, she refuses to let her loved ones down. Then moments before her nuptials, she’s kidnapped—and her whole life changes. Three Determined Mercenaries Dominic Anthony has waited years to avenge his sister’s murder. He knows Greg Jansen is dirty, but he needs a witness to help prove his case. Jansen’s new bride is the perfect hostage. Kinley Kohl will tell him everything…or else. But his two business partners aren’t so sure. Law and Riley Anders worry that Kinley isn’t as guilty as she seems. And Law suspects she might be the one woman who can handle them all. From Target to Treasure In the wilds of Alaska, the three men try to pry Kinley open, only to discover she’s both stronger and more innocent than they imagined. Her sweet beauty melts their suspicion and steals their hearts. Together, they awaken her passion and brand her as their own. When danger strikes, the men realize they must save Kinley or lose the love of their lives forever.", "hash": "df29162f-9976-46c1-9d92-c42dbc763623"}, {"title": "Pushing the Limits (Pushing the Limits #1)", "author": "Katie McGarry", "pgs": 51, "sum": "Storyline: \nPushing the Limits (Pushing the Limits #1) So wrong for each other …and yet so right. No one knows what happened the night Echo Emerson went from popular girl with jock boyfriend to gossiped-about outsider with \"freaky\" scars on her arms. Even Echo can't remember the whole truth of that horrible night. All she knows is that she wants everything to go back to normal. But when Noah Hutchins, the smoking-hot, girl-using loner in the black leather jacket, explodes into her life with his tough attitude and surprising understanding, Echo's world shifts in ways she could never have imagined. They should have nothing in common. And with the secrets they both keep, being together is pretty much impossible. Yet the crazy attraction between them refuses to go away. And Echo has to ask herself just how far they can push the limits and what she'll risk for the one guy who might teach her how to love again.", "hash": "5e9fbe42-e0d9-427e-a421-256c0108b854"}, {"title": "Dare You To (Pushing the Limits #2)", "author": "Katie McGarry", "pgs": 57, "sum": "Storyline: \nDare You To (Pushing the Limits #2) Ryan lowers his lips to my ear. \"Dance with me, Beth.\" \"No.\" I whisper the reply. I hate him and I hate myself for wanting him to touch me again.... \"I dare you...\" If anyone knew the truth about Beth Risk's home life, they'd send her mother to jail and seventeen-year-old Beth who knows where. So she protects her mom at all costs. Until the day her uncle swoops in and forces Beth to choose between her mom's freedom and her own happiness. That's how Beth finds herself living with an aunt who doesn't want her and going to a school that doesn't understand her. At all. Except for the one guy who shouldn't get her, but does.... Ryan Stone is the town golden boy, a popular baseball star jock-with secrets he can't tell anyone. Not even the friends he shares everything with, including the constant dares to do crazy things. The craziest? Asking out the Skater girl who couldn't be less interested in him. But what begins as a dare becomes an intense attraction neither Ryan nor Beth expected. Suddenly, the boy with the flawless image risks his dreams-and his life-for the girl he loves, and the girl who won't let anyone get too close is daring herself to want it all....", "hash": "58426bae-d7c6-446e-8916-0e6773f87693"}, {"title": "Crash into You (Pushing the Limits #3)", "author": "Katie McGarry", "pgs": 56, "sum": "Storyline: \nCrash into You (Pushing the Limits #3) The girl with straight As, designer clothes and the perfect life—that's who people expect Rachel Young to be. So the private-school junior keeps secrets from her wealthy parents and overbearing brothers...and she's just added two more to the list. One involves racing strangers down dark country roads in her Mustang GT. The other? Seventeen-year-old Isaiah Walker-a guy she has no business even talking to. But when the foster kid with the tattoos and intense gray eyes comes to her rescue, she can't get him out of her mind. Isaiah has secrets, too. About where he lives, and how he really feels about Rachel. The last thing he needs is to get tangled up with a rich girl who wants to slum it on the south side for kicks-no matter how angelic she might look. But when their shared love of street racing puts both their lives in jeopardy, they have six weeks to come up with a way out. Six weeks to discover just how far they'll go to save each other.", "hash": "13389d1e-b870-4ce4-a349-3f7e4a908107"}]