[{"title": "Crossing the Line (Pushing the Limits #1.1)", "author": "Katie McGarry", "pgs": 10, "sum": "Storyline: \nCrossing the Line (Pushing the Limits #1.1) Katie McGarry captivated readers with her “riveting, emotional”* Young Adult debut, Pushing the Limits. In this gripping novella, she tells the story of Lila and Lincoln, who discover that sometimes it’s worth crossing the line for love… Lila McCormick, Echo's best friend from Pushing the Limits, first met Lincoln Turner when tragedy struck both their lives. But she never expected their surprise encounter would lead to two years of exchanging letters—or that she’d fall for the boy she’s only seen once. Their relationship is a secret, but Lila feels closer to Lincoln than anyone else. Until she finds out that he lied to her about the one thing she depended on him for the most. Hurting Lila is the last thing Lincoln wanted. For two years, her letters have been the only thing getting him through the day. Admitting his feelings would cross a line he’s never dared breach before. But Lincoln will do whatever it takes to fix his mistakes, earn Lila’s forgiveness—and finally win a chance to be with the girl he loves.", "hash": "07a2f117-cddb-4a3c-836b-22fd26fed7ed"}, {"title": "Drowning Instinct ", "author": "Ilsa J. Bick", "pgs": 45, "sum": "Storyline: \nThere are stories where the girl gets her prince, and they live happily ever after. (This is not one of those stories.) Jenna Lord’s first sixteen years were not exactly a fairytale. Her father is a controlling psycho and her mother is a drunk. She used to count on her older brother—until he shipped off to Afghanistan. And then, of course, there was the time she almost died in a fire. There are stories where the monster gets the girl, and we all shed tears for his innocent victim. (This is not one of those stories either.) Mitch Anderson is many things: A dedicated teacher and coach. A caring husband. A man with a certain... magnetism. And there are stories where it’s hard to be sure who’s a prince and who’s a monster, who is a victim and who should live happily ever after. (These are the most interesting stories of all.) Drowning Instinct is a novel of pain, deception, desperation, and love against the odds—and the rules.", "hash": "e69932c7-1bc9-4288-97f5-6e63d574fa54"}, {"title": "The Marriage Bargain (Marriage to a Billionaire #1)", "author": "Jennifer Probst", "pgs": 31, "sum": "Storyline: \nThe Marriage Bargain (Marriage to a Billionaire #1) A marriage in name only... To save her family home, impulsive bookstore owner, Alexa Maria McKenzie, casts a love spell. But she never planned on conjuring up her best friend's older brother—the powerful man who once shattered her heart. Billionaire Nicholas Ryan doesn’t believe in marriage, but in order to inherit his father’s corporation, he needs a wife and needs one fast. When he discovers his sister’s childhood friend is in dire financial straits, he offers Alexa a bold proposition. A marriage in name only with certain rules: avoid entanglement. Keep things all business. Do not fall in love. The arrangement is only for a year so the rules shouldn’t be that hard to follow, right? Except fate has a way of upsetting the best-laid plans…", "hash": "293ad45d-6a62-4acf-ac57-1cacdd8d27b5"}, {"title": "The Marriage Trap (Marriage to a Billionaire #2)", "author": "Jennifer Probst", "pgs": 33, "sum": "Storyline: \nThe Marriage Trap (Marriage to a Billionaire #2) To satisfy his late father’s wishes, hot and single billionaire Michael Conte must find a bride—someone who will fit into his traditional family back home in Italy—and fast, so his engaged sister will be allowed to wed. With no intention of being tied down, Michael “proposes” to fiery, free-spirited photographer Maggie Ryan: if she will play the part of his fiancée during her trip to Milan for a photo shoot, he will keep away from her married best friend, Alexa, and stop making Maggie nuts with their too-close-for- comfort flirtations. But once in Italy, sexual tension sparks the hottest no-strings- attached arrangement on any continent. Could marriage be the most enticing trap of all?", "hash": "405529dd-192f-48cc-a870-854844dccca1"}, {"title": "The Marriage Mistake (Marriage to a Billionaire #3)", "author": "Jennifer Probst", "pgs": 38, "sum": "Storyline: \nThe Marriage Mistake (Marriage to a Billionaire #3) Carina Conte has had a crush on her brother Michael’s best friend, Max Gray, since she was a teenager. Now she’s earned her MBA and come to work at Michael’s new venture, America’s fastest-growing bakery empire. But some things never change: her family still treats her like a child. With three drop-dead gorgeous siblings, she’s still the ugly duckling of the bunch. And Max, the company’s new CEO, still barely notices her. Max knows Carina Conte is strictly off limits. But hot-blooded lust wins out at a conference when the two share a scorching one-night stand—and are busted by her mother! Now, forced by old-world Italian tradition into a marriage he’s not ready for, Max is miserable—and Carina is furious. Her new husband is about to realize that hell hath no fury like a woman transformed….", "hash": "f0f98999-4a50-41af-83b3-33df34ebab49"}, {"title": "The Marriage Merger (Marriage to a Billionaire #4)", "author": "Jennifer Probst", "pgs": 46, "sum": "Storyline: \nThe Marriage Merger (Marriage to a Billionaire #4) Her sisters have found wedded bliss with their wealthy,wonderful dream men, but not Julietta Conte. She’s stayed on terra firma as top executive of the family’s corporation, La Dolce Famiglia bakery. Work is her passion, and her trendy Milan apartment her sanctuary . . . until Sawyer Wells, a masculine masterpiece in a suit, lures her out of hiding with an irresistible offer: an exclusive partnership with his international chain of boutique hotels. Julietta’s been burned before—and trusting her brother-in-law’s friend, whose powerful gaze alone has her rethinking the best use of a conference room, is the riskiest proposition. But with a once-in-a-career chance to take the bakery global, will she mix stone-cold business with red-hot seduction?", "hash": "b6dcc3d3-8a19-4d22-93da-3ae37652d501"}, {"title": "All the Way ", "author": "Jennifer Probst", "pgs": 31, "sum": "Storyline: \nThe food critic… Miranda Storme never expected to see Gavin Luciano again. Three years ago, they had an intense affair—and then he bolted. Now he’s back, and Miranda has the pleasure of a little payback: a scathing review of his restaurant. Revenge is a dish best served the first chance you get… And the restaurateur… With three months to make his family’s struggling Italian restaurant successful, a bad review is Gavin’s worst nightmare. But this isn’t just about the meal. He's finally realized what he left behind and is determined to spend the next eight weeks proving himself to her in the kitchen…and in the bedroom! This is one dish she won’t be able to refuse...", "hash": "a3b7af9c-c8cd-464f-afa0-ffe8100be16e"}, {"title": "Catch Me (Steele Brothers Trilogy #1)", "author": "Jennifer Probst", "pgs": 7, "sum": "Storyline: \nCatch Me (Steele Brothers Trilogy #1) Rick Steele has avoided relationships since he caught his fiancée cheating, but when he’s talked into a one night stand through Madame Eve, he’s not prepared for his emotional and physical reaction to his date. Tara shows him a raw passion and honesty he’s never encountered. For the first time, Rick wants more than one night, but he needs to catch her first... Tara Denton escaped a brutal past and needs one night with a stranger to get beyond her sexual and emotional limitations. On the brink of recovering her strength and independence, she wants nothing to do with a relationship. But Rick Steele does more than rock her body…he rocks her heart. Tara has to make a choice, but is she ready to get caught?", "hash": "3ef73d69-ba1c-46a8-99cb-585153ae6fe3"}, {"title": "Play Me (Steele Brothers Trilogy #2)", "author": "Jennifer Probst", "pgs": 6, "sum": "Storyline: \nPlay Me (Steele Brothers Trilogy #2) Professional gambler Sloane Keller is tired of dating weak willed men and longs to meet a man who challenges her dominant personality and forces her to submit. As the Queen of Cards, she’s used to making her own rules and craves the excitement of Vegas. But her inner heart cries out for someone who can be her match, both inside the casino and in the bedroom. As the new dealer in town, Roman Steele is burnt out on women looking for a quick penny and a man to follow. He craves a woman with fire in her soul and a keen intellect who can challenge him. When his brother recruits Madame Eve to help, Rome is amazed at the complicated woman he gets to spend the night with. But when the evening is over, will she be gutsy enough to offer him forever?", "hash": "954508ab-c1b8-45cb-ae2c-32ca1912827a"}, {"title": "Dare Me (Steele Brothers Trilogy #3)", "author": "Jennifer Probst", "pgs": 7, "sum": "Storyline: \nDare Me (Steele Brothers Trilogy #3) As a military leader back from the war, and the youngest of his two dominant older brothers, Rafe Steele struggles with a secret. He craves surrender in the bedroom under the controlled hands of a Dominatrix. When his brothers offer him a one-night stand through Madame Eve’s dating service, he jumps at the chance to enact his fantasy. After one experiment, he’s sure he’ll be able to move on. But he never counted on Summer Preston to strip down his walls and make him want more than one night... An elementary school teacher with a girl next door, fresh face, Summer is constantly barraged by men who want to take care of her, but she longs to meet a strong man who can handle her dominant ways in the bedroom. Trapped in her own storybook life, she books a one-night stand with Madame Eve to finally experience her fantasy. But she never counted on Rafe Steele to push her boundaries in both the bedroom...and her heart.", "hash": "1a0a3d71-9605-493b-be11-96fcd6732577"}]