[{"title": "The Holiday Hoax ", "author": "Jennifer Probst", "pgs": 8, "sum": "Storyline: \nAidan Hunter is tired of city living and shallow women who only want to date him for his money and family legacy. Dubbed “The Pasta King” and named most eligible bachelor in New York City, he escapes to his cabin upstate to figure out what he wants. He hopes to meet a woman who will love him for who he is…but he never counted on a certain schoolteacher to throw his world into chaos. Isabella Summers is shocked at the sexual attraction she feels for the rude worker on the Christmas tree farm. But when he shows up at a friend’s party and seeks her out, she finds she no longer wants to fight their attraction…but she never counted on love with a stranger carrying a secret. Can love and truth triumph?", "hash": "68e235f1-5270-4c01-b5b0-99684fcdbc12"}, {"title": "Passion Fruit ", "author": "Imari Jade", "pgs": 10, "sum": "Storyline: \nTwenty-five year old, Satoshi Hayashi, the pianist for the Japanese pop-group, Aomori refuses to give up hope that his close friend Shaundra Yoshida has perished in a killer earthquake and tsunami in the Miyagi Prefecture of Japan. Hundreds and maybe thousands of lives have been reported lost, but Satoshi feels that he would know if Shaundra was dead. Over the last year they had this special bond. He knew when she wasn’t feeling well or when she was in a frisky mood. If she were dead, he’d know it, and he didn’t give a damn what the other members of Aomori thought. He was going to find her if that was the last thing he did. Depressed and despondent over the loss of his wife, Shaundra, Ichiro Yoshida turns to alcohol to console his troubled mind. He neglects his looks, doesn’t want to write another song, and he sure does not want to go on a scheduled tour of Europe that has been arranged by their boss. Shaundra was his life. Why can’t anyone see that he stopped living the moment she disappeared? And why had she walked out on him just hours before leaving for Aomori’s China tour? Was she that unhappy with their marriage? Or had some other man captured her fancy and taken her away? He doesn’t know what the future has in store for him, but he won’t stop trying until he finds out the answers.", "hash": "dbfe6152-e453-430e-bc71-c4338b2c7176"}, {"title": "Kiss Tomorrow Goodbye  ", "author": "Imari Jade", "pgs": 20, "sum": "Storyline: \nTwenty-five year old dhampire Isabella Denning is pissed that the world did not end on December 21, 2012 as the ancient Mayan's predicted. She is tired of battling demons, fussing with her vampire father and his people and fighting off the advances of Alesandro Roma, an eight hundred year old vampire who fancies himself in love with her. As if having a contract on her head isn't bad enough, a portal has opened between the mortal world and the Underworld and unleashed unspeakable horrors on the fair city of New Orleans. Isabella might be the only person who can save the world, but at the moment she just doesn't give a damn.", "hash": "73f48ad4-787c-4762-b265-3c0dc02ebef4"}, {"title": "In Deep Kimchi ", "author": "Imari Jade", "pgs": 21, "sum": "Storyline: \nErotic romance author Shaundra Morrison thought there was nothing in the world her handsome white boss Harper Kehoe could offer her to get her on a plane bound for Tokyo, including free use of his body for the duration of the trip. Becoming a member of the mile high club intrigued her but not enough to conquer her fear of flying. Harper Kehoe had money, power, and everything his heart desired except for the affections of his best selling author Shaundra Morrison. He jumped at the idea of forming a partnership with Japanese mogul Goro Niigata because to Harper business came before pleasure. And what a perfect way to have both than by inviting Shaundra and three of his other successful authors to accompany him to Tokyo to promote the opening of NIKII Publishing. So what if it meant having one of his doctor friends prescribe Shaundra a sedative to knock her sexy ass out for twenty-five hours. Shaundra wasn’t too keen on the idea of being drugged just to fly halfway around the world to help Harper promote his new business, until her senior editor showed Shaundra a picture of Aomori, a group of four J-Pop singers who Mr. Niigata managed and planned to use to help promote his new business. All it took was one look at those beautiful faces, sexy young bodies, and all that long black hair to get her to reconsider. The worst thing that could happen to her would be she’d be turned into a junkie before she returned to New York. The dampening of the panties between her legs assured her that it would be well worth it.", "hash": "ffbddd7b-8772-448e-b9f3-dda95b2b66f1"}, {"title": "Saranghae ", "author": "Imari Jade", "pgs": 23, "sum": "Storyline: \nSaranghae (I Love You) Shaundra and Ichiro have returned to Asia after their spectacular wedding, but things are far from perfect. Shaundra still has a fear of flying and Ichiro is worried that she might become addicted to the drugs the doctor prescribe. Shaundra is less than happy that her now successful restaurateur husband is too busy to spend time with her and the Takumijo and Satoshi still hasn’t moved out of the farmhouse. And to make matters worse, Yori and his new bride Amaya has moved in, along with Aomori’s new publicist Cristal Gentry, a striking biracial female who seems to have Satoshi and his best friend Yi-jun Lee, and a popular Korean actor wrapped around her fingers. What’s a poor girl to do to get her husband alone? Marriage is nothing what Yori Morika expected. His new bride Amaya not only spends money like crazy but she’s back to her old tricks starting mess with Shaundra. He hasn’t helped matters any by continuing perusing Shaundra, who now seems to have a very close friendship with Satoshi. Are there some lines that friends should not cross and was it wise to move himself in the farmhouse with so much temptation just there for the taking? Cristal Gentry never knew what she was getting herself into when she agreed to become the new publicist for Aomori. Satoshi and Takumijo are bad enough, getting her in trouble with their manager Masaaki, but then she meets Yori and Ichiro and she thinks that maybe she’s in way over her head. Things heat up in her life when her boss sends her to get an interview with the reclusive Korean actor Yi-jun Lee, who just happens to be a friend of Satoshi. Although she’s strictly business with him Yi-jun has plans of his own as he whisks her away to Paris to show her the time of her life. Yi-jun is everything she despises in a man, so why does her heart do a double beat at just the mention of his name? And why does Satoshi’s steamy looks leave her simply breathless?", "hash": "2eea1412-87c8-4276-a1f3-380ad09c98f7"}, {"title": "Black Rose (In the Garden #2)", "author": "Nora Roberts", "pgs": 22, "sum": "Storyline: \nBlack Rose (In the Garden #2) A Harper has always lived at Harper House, the centuries-old mansion just outside of Memphis. And for as long as anyone alive remembers, the ghostly Harper Bride has walked the halls, singing lullabies at night... At forty-seven, Rosalind Harper is a woman whose experiences have made her strong enough to bend without breaking--and weather any storm. A widow with three grown sons, she survived a disastrous second marriage and built her In The Garden nursery from the ground up. Through the years, In The Garden has become more than just a thriving business--it is a symbol of hope and independence to Roz, and to the two women she shares it with. Newlywed Stella and new mother Hayley are the sisters of her heart, and together the three of them are the future of In The Garden. But now the future is under attack, and Roz knows they can't fight this battle alone. Hired to investigate Roz's Harper ancestors, Dr. Mitchell Carnegie finds himself just as intrigued with Roz herself. And as they being to unravel the puzzle of the Harper Bride's identity, Roz is shocked to find herself falling for the fascinating genealogist. Now it is a desperate race to discover the truth before the unpredictable apparition lashes out at the one woman who can help her rest in peace...", "hash": "d8468cf2-9094-4328-b76c-19f6802ef284"}, {"title": "Blue Dahlia (In the Garden #1)", "author": "Nora Roberts", "pgs": 23, "sum": "Storyline: \nBlue Dahlia (In the Garden #1) Recently widowed Stella Rothschild has found a new love in Logan Kitridge. But there is someone who isn't happy about Stella's growing feelings for Logan: the Harper Bride, an unidentified woman whose grief and rage have kept her spirit alive long past the death of her body.", "hash": "97aed9e8-e841-463a-807a-a5f878f1fd40"}, {"title": "Dance Upon the Air ( Three Sisters Island #1)", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nDance Upon the Air (Three Sisters Island #1) When Nell Channing arrives on charming Three Sisters Island, she believes that she’s finally found refuge from her abusive husband—and from the terrifying life she fled so desperately eight months ago… But even in this quiet, peaceful place, Nell never feels entirely at ease. Careful to conceal her true identity, she takes a job as a cook at the local bookstore café—and begins to explore her feelings for the island sheriff, Zack Todd. But there is a part of herself she can never reveal to him—for she must continue to guard her secrets if she wants to keep the past at bay. One careless word, one misplaced confidence, and the new life she’s created so carefully could shatter completely. Just as Nell starts to wonder if she’ll ever be able to break free of her fear, she realizes that the island suffers under a terrible curse—one that can only be broken by the descendants of the Three Sisters, the witches who settled the island back in 1692. And now, with the help of two other strong, gifted women—and with the nightmares of the past haunting her every step—she must find the power to save her home, her love…and herself…", "hash": "30335ba0-c37f-49ba-89a6-692970f6be98"}, {"title": "Face the Fire ( Three Sisters Island #3)", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nFace the Fire (Three Sisters Island #3) The conclusion of the Three Sisters Island trilogy. The new owner of the island's only hotel, Sam has returned to Three Sisters with hopes of winning back Mia's affections. But Mia needs his help to face her greatest challenge, and the deadline for breaking a centuries-old curse draws near.", "hash": "4312b1bb-1bbc-4e38-8a59-4c6c5e5b308d"}, {"title": "Holding the Dream ", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nHolding the Dream (Dream Trilogy #2) On the fast track to a partnership with her accountancy firm, Kate is stunned when she is fired for suspected embezzlement.Forced to cope with the sudden reversal of fortune, Kate returns to Pretenses, the exquisite boutique run by her friend Margo and sister Laura. But when persistent, persuasive Byron de Witt enters her life, the flames of passion he ignites begin to burn as brightly as her all-consuming career ambitions...", "hash": "11d9c2d5-8636-4d74-93e5-54f5b5f9ab6d"}]