[{"title": "A Man for Amanda ", "author": "Nora Roberts", "pgs": 11, "sum": "Storyline: \nA Man for Amanda (The Calhouns #2) On the rocky coast of Maine sits the Towers, a magnificent family mansion that is home to a legend of long-lost love, hidden emeralds - and four sisters determined to save their home against all odds. Amanda was known as the responsible Calhoun sister. But when irresistible architect Sloan O'Riley came to town, it was Amanda's turn to be rescued - from falling head over heels in love.", "hash": "0dbf1c03-f920-4ef3-bf67-86be7fcf9f53"}, {"title": "All the Possibilities ", "author": "Nora Roberts", "pgs": 12, "sum": "Storyline: \nAll The Possibilities (The MacGregors: Chronological order #3) Former First Daughter, and current potter/shop owner Shelby Campbell is wary of U.S. Senator Alan MacGregor's attention. She knows all too well what life in the public eye is like, and the life of a politician. But Alan is persistent. He's determined to win her over and show her that their future is worth all the potential drawbacks.", "hash": "a84ccc0c-3c29-4417-93d6-def0b2fef7dd"}, {"title": "Bed of Roses ", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nBed of Roses (Bride Quartet #2) As little girls MacKensie, Emma, Laurel, and Parker spent hours acting out their perfect make believe “I do” moments. Years later their fantasies become reality when they start their own wedding planning company to make every woman’s dream day come true. With perfect flowers, delicious desserts, and joyful moments captured on film, Nora Roberts’s Bride Quartet shares each woman’s emotionally magical journey to romance. In Bed of Roses, florist Emma Grant is finding career success with her friends at Vows wedding planning company, and her love life appears to be thriving. Though men swarm around her, she still hasn’t found Mr. Right. And the last place she’s looking is right under her nose. But that’s just where Jack Cooke is. He’s so close to the women of Vows that he’s practically family, but the architect has begun to admit to himself that his feelings for Emma have developed into much more than friendship. When Emma returns his passion—kiss for blistering kiss—they must trust in their history…and in their hearts.", "hash": "a17fb702-a9ef-4a36-89b6-f6bb24adf9c9"}, {"title": "Best Laid Plans ", "author": "Nora Roberts", "pgs": 13, "sum": "Storyline: \nBest Laid Plans (Love by Design: Jack's Stories #2) When Cody Johnson first caught sight of structural engineer Abra Wilson, he thought of endless possibilities. She had style and confidence--and was distracting as hell. She'd called his design an impractical piece of fancy, but then he'd always preferred frankness to subtleties. Abra had met men like Cody before. They usually thought they could smile their way out of trouble, and this overconfident East Coast architect was no exception. She'd told him to back off, but he wasn't listening. Sparks ignited in the desert building site, and then passion soon followed. But was it enough to stop someone from trying to destroy their first project together? Would they be able to find out who it is before any more damage is done?", "hash": "8c952af7-bfae-4920-84cb-3aa19dc99488"}, {"title": "Reckless (Renegades #1)", "author": "Skye Jordan", "pgs": 44, "sum": "Storyline: \nReckless (Renegades #1) A couture wedding dress designer to the rich and famous, Lexi LaCroix’s image means everything. But crossing paths with a sexier-than-sin, bad-boy biker makes Lexi realize how much living she’s sacrificed for her success and one touch is all it takes to threaten her carefully choreographed life. When that touch fills far more than just Lexi’s physical needs, she finds herself torn between the career she needs and the bad-boy she craves. Jax Chamberlin gave up the superficial life of acting for the thrill of running his own stunt company years ago. But a recent betrayal proves he’s still too close to the limelight to find a woman who doesn’t plan to use him as a stepping-stone to success. When the charming and mysterious Lexi offers him a totally anonymous hook-up during an out of town trip, Jax accepts. Only Lexi is more sextacular than charming, and Jax wants more. But Lexi’s got a major hang-up over his renegade lifestyle, and Jax isn’t willing to change his ways. Especially not when he discovers who she really is. Because if she finds out his connections could catapult her to the top of her career, he’s afraid the fantasy woman he’s falling for might just end up like all the other gold-diggers. And this time, it’s not just his bad-boy reputation at risk, but his heart, too.", "hash": "b9c0ea49-fb43-4379-8dd9-fc9a301382e7"}, {"title": "Rebel (Renegades #2)", "author": "Skye Jordan", "pgs": 59, "sum": "Storyline: \nRebel (Renegades #2) Sassy, smart, and sexy, former supermodel-turned-tech guru Rubi Russo has it all—looks, money, confidence and freedom. Her life is a whirlwind of fast cars and fleeting affairs—and she likes it that way. With a past like Rubi’s, forever isn’t part of her vocabulary. So when studly Renegade stuntman Wes Lawson wants to take their friendship to the next level, she’s all out. Raised a simple country-boy, Wes knows the brazen Rubi isn’t his type. But after spending time with her, he discovers she’s everything he’s ever wanted in a woman. To win her wild rebel heart, he’ll have to prove he sees behind her smokescreen to all the goodness she tries to hide. Then it’s just a matter of crushing her fears, shattering her barriers, and convincing her that loving him is everything she’s been missing in her life, too. Piece of cake.", "hash": "e0e23e43-c5ce-4a1a-a727-bf0bc9c93197"}, {"title": "Maliciously Obedient (Obedient #1)", "author": "Julia Kent", "pgs": 33, "sum": "Storyline: \nMaliciously Obedient (Obedient #1) Getting caught reading Fifty Shades of Grey in the parking lot at work wasn't the best way for 25-year-old Lydia Charles to meet her boss. A boss she didn't know she had. Matt Jones now had the job she had been waiting to apply for (and win) for the past year, and to add insult to injury, he's the kind of guy her parents would adore. Damn it. The only kid of six to choose to run off to Boston and leave behind her idyllic family in Maine, Lydia's determined to prove herself in the big city, but she has to keep Matt at arm's length. After a steamy elevator encounter that leaves her missing her panties – and most of her resolve – she decides that maybe it's time to let him get inside her. In more ways than one. But when Matt suddenly closes off she's upset and confused. When he also acts like he owns the place, she decides that malicious obedience – following his every command to the letter – will prove how much the department needs her creativity after he insists he knows best. What Lydia doesn't know is that “Matt” is really Michael Bournham, the CEO of the company, part of an undercover reality television stunt. Keeping his hands off Lydia's luscious curves was becoming an exercise in restraint, but what was harder? Keeping his heart from her. For Michael, Lydia's malicious obedience ignited a night of unbridled passion in the office that made him forget everything – including the rolling cameras – until it was too late. When unscrupulous producers make their lovemaking viral, Michael pulls out all the stops and calls in every favor as Lydia...maliciously obeys.", "hash": "329d1891-a35f-4921-897f-a43608779f91"}, {"title": "Suspiciously Obedient (Obedient #2)", "author": "Julia Kent", "pgs": 34, "sum": "Storyline: \nSuspiciously Obedient (Obedient #2) AFTER A BILLION PEOPLE WATCH YOU MAKE LOVE, WHERE DO YOU HIDE? A fake persona with very real emotions... As \"Matt Jones,\" CEO playboy Michael Bournham has just stumbled into his wildest dream and worst nightmare while playing a middle-management employee role for a reality television stunt. Getting caught making love with his administrative assistant, Lydia Charles, on camera let unscrupulous Hollywood producers blackmail him before launching the video on YouTube. Fired from his job and ridiculed on social media, Mike needs to hit \"reboot\" on his life. Hiding Lydia away in Iceland with a made-up job, he sends his best friend Jeremy to watch over her. Meanwhile, he disguises himself once more and booked a cabin at Lydia's family's campground in Maine, to immerse himself in her world. A best friend with deeper intentions... After more than a decade of world travel and hedonistic fun, dot-com millionaire Jeremy wants more out of his friendship with Mike, but more than that – he wants Lydia. Struck by her beauty and essence, he follows Mike's order and obeys, courting her with a friendship that quickly becomes a deeper bond, charged by Lydia's fantasies about him – and Mike. Unable to resist, he becomes her confidante and bedmate, helping her to come to grips with her impulsive decisions and to find her way back home to Maine. A woman torn by desire... Lydia accepts the move to Iceland to become the Director of Communications for European Operations not realizing it's a sham position Michael Bournham created to help hide her from the firestorm of the viral sex tape. Living in a new country should be fun, but side glances and whispers from her new Icelandic employees dig at her. Ignored by her new boss at Bournham Industries, Lydia's disenchantment with her bold move is softened only by Jeremy's appearance. Wild and loose, he fills a void in her life – and soon fills her bed. When she decides there's no place like home, the new couple embarks for her family's campground – and Jeremy's suspicious obedience will be revealed.", "hash": "8a98c50f-e3cb-4d3e-ba4d-4410773498f8"}, {"title": "Random Acts of Crazy (Random #1)", "author": "Julia Kent", "pgs": 41, "sum": "Storyline: \nRandom Acts of Crazy (Random #1) I never intended to pick up a naked hitchhiker wearing nothing but a guitar. A guitar. Really. I don't collect guys like that (don't ask what kind of guys I do collect), but when you spot a blonde, tanned, sculpted man with a gorgeous smile and his thumb poking up and practically begging you to stop – you stop. And I definitely never thought I'd be staring into the bright blue eyes of Trevor Connor, the lead singer for Random Acts of Crazy, an indie rock star I followed like the slobbering fileshare fangirl I am. How he came to be nude and lost six hundred miles from home is quite the tale, but how we fell in love is even more unreal. Because someone like Trevor Connor, headed to Harvard Law next year, isn't supposed to want someone like me, a rural Ohio chick majoring in Boredom at Convenience Store University who is all curves and frizzy blonde hair and manners so unpolished they have sharp edges that make you bleed. But he did. When his best friend, Joe Ross, the bass player for Random Acts of Crazy and a man who makes Calvin Klein models look like Shrek, drove eleven hours through the night to rescue him, though, it got real complicated. It's one thing to like two different guys and be torn. What do you do, though, when maybe – just maybe – you don't have to choose? As my Aunt Josie says sometimes, \"It's always complicated.\"", "hash": "d58c83ff-4598-42cc-9549-965b9846ed7b"}, {"title": "Random Acts of Trust (Random #2)", "author": "Julia Kent", "pgs": 42, "sum": "Storyline: \nRandom Acts of Trust (Random #2) Giving up is hard...but giving in is even harder. When did my life become a demented episode from The Mindy Project? Moving to Boston to begin grad school meant I was supposed to start a new life--not dig through a past I thought I'd left behind four years ago. But when I saw the poster for Random Acts of Crazy, all I could think about was the drummer, Sam Hinton, the boy I'd loved in high school and who disappeared with my heart. Who knew I'd become the living version of Magic Mike? Seeing Amy Smithson at my gig and watching her win a kiss from my bandmate, Liam, was a gut punch. Four years ago we squared off in a high school debate that had higher stakes than we ever imagined, and here I was...wanting what I'd walked away from. Are there too many secrets between us to allow her to trust me again? And can I trust myself?", "hash": "36c1ca90-a148-430d-b465-6b5f085ee548"}]