[{"title": "Her First Billionaire (Her Billionaires #1)", "author": "Julia Kent", "pgs": 11, "sum": "Storyline: \nHer First Billionaire (Her Billionaires #1) COULD SHE REALLY FIND THE RIGHT GUY ON THE INTERNET? \"Hot, luscious piece of ass who can suck a golf ball through forty feet of garden hose seeks rippling-ab'd firefighter who has a tongue that thrums like a hummingbird and enjoys painting my toenails and eating Ben & Jerry's out of the carton while watching Mad Men.\"", "hash": "d75a67b8-7cd4-4e5e-8726-754befc1165f"}, {"title": "Her Second Billionaire (Her Billionaires #2)", "author": "Julia Kent", "pgs": 12, "sum": "Storyline: \nHer Second Billionaire (Her Billionaires #2) SHE DREW A LINE WITH A ONE NIGHT STAND When Laura Michaels got one hot firefighter pinging her for a date after joining a popular online dating service, she thought she had won the lottery. A night with Dylan Stanwyck, professional (firefighting) hunk and former model, had been too much. Fearful her curves would turn him off like so many other guys, her pleasant surprise turned to white-hot passion as she broke her own rule and slept with him on the first date.", "hash": "5328913b-f373-40ce-b52d-af33ce64c758"}, {"title": "Her Two Billionaires (Her Billionaires #3)", "author": "Julia Kent", "pgs": 15, "sum": "Storyline: \nHer Two Billionaires (Her Billionaires #3) TWO MEN WITH TWO ENORMOUS...SECRETS Dylan Stanwyck and Mike Pine are looking for a certain kind of woman. The firefighter and ski instructor aren't picky - blonde, brunette, Asian, African-American, Caucasian, athletic, Rubenesque, boyish - any type will do, but there is one pesky little deal breaker - she needs to want a long-term threesome. So far, that's caused some problems as Dylan took to the dating field and found no takers, search for someone he and Mike could share. Laura Michaels fits the bill - they hope. Working class stiffs who become accidental billionaires in a mysterious turn of events involving their dearly departed longtime lover's estate, the men are looking now for a third to complete them.", "hash": "31b7a4af-40e7-4daa-9896-7032bf1f52bd"}, {"title": "Her Two Billionaires and a Baby (Her Billionaires #4)", "author": "Julia Kent", "pgs": 33, "sum": "Storyline: \nHer Two Billionaires and a Baby (Her Billionaires #4) WHEN IS A LIE REALLY A LIE? Laura flees after an amazing encounter with Dylan and Mike, a threesome lovemaking experience that sets her senses on fire and her heart ablaze. But hopes are quickly extinguished when reality settles in and she feels duped. Had they set her up just to get her in bed? Was she the butt of some elaborate sexual joke? Running for the safety of her best friend, Josie, she pours her heart out and learns that Josie has a few secrets of her own involving threesomes...", "hash": "cf9b3d66-98f1-4d0c-abe3-43cc40235b04"}, {"title": "Before I Fall ", "author": "Lauren Oliver", "pgs": 59, "sum": "Storyline: \nFor popular high school senior Samantha Kingston, February 12—\"Cupid Day\"—should be one big party, a day of valentines and roses and the privileges that come with being at the top of the social pyramid. And it is…until she dies in a terrible accident that night. However, she still wakes up the next morning. In fact, Sam lives the last day of her life seven times, until she realizes that by making even the slightest changes, she may hold more power than she ever imagined.", "hash": "50dabc7d-3396-4ab4-9c50-a19a3526ffe9"}, {"title": "If You Stay (Beautifully Broken #1)", "author": "Courtney Cole", "pgs": 27, "sum": "Storyline: \nIf You Stay (Beautifully Broken #1) 24-year old Pax Tate is an asshole. Seriously. He’s a tattooed, rock-hard bad-boy with a bad attitude to match. But he’s got his reasons. His mother died when Pax was seven, leaving a hole in his heart filled with guilt although he doesn’t understand why. What he does know is that he and his dad are left alone and with more issues than they can count. As Pax grew up, he tried to be the kid his father always wanted; the perfect golden boy, but it didn’t work. His dad couldn’t overcome his grief long enough to notice and Pax couldn’t keep up the impossible perfect façade. So he slipped far, far from it. Now, he uses drugs and women to cope with the ugliness, the black void that he doesn’t want to deal with. If he pretends that the emptiness isn’t there, then it isn’t, right? Wrong. And it’s never more apparent than when he meets Mila. Sweet, beautiful Mila Hill is the fresh air to his hardened frown, the beauty to his ugly heart. He doesn’t know how to not hurt her, but he quickly realizes that he’s got to figure it out because he needs her to breathe. When memories of his mother’s death resurface from where he’s repressed them for so long, Mila is there to catch him when the guilt starts making sense. Mila is the one…the one who can save him from his broken troubled heart; from his issues, from the emptiness. But only if he can stop being an asshole long enough to allow it. He knows that. And he’s working on it. But is that enough to make her stay?", "hash": "c481013c-d34a-4a23-b0e5-a3f1f80bae36"}, {"title": "If You Leave (Beautifully Broken #2)", "author": "Courtney Cole", "pgs": 50, "sum": "Storyline: \nIf You Leave (Beautifully Broken #2) 26-year old Gabriel Vincent is a badass hero. Or he used to be, anyway. As an ex-Army Ranger, Gabe never thought he needed anyone. But after one horrible night in Afghanistan scars him in a way that he can't get past, he needs someone who can help him heal...even if he doesn't realize it. 25-year old Madison Hill doesn't need anybody...or so she thinks. She grew up watching her parents' messed-up abusive relationship and she knows there's no way in hell that she's ever letting that happen to her. They don't know it in the beginning, but Gabriel and Madison will soon develop a weakness: Each other. But Gabriel's got a secret, a hidden monster that he's afraid Maddy could never overcome... And Maddy's got issues that she's afraid Gabe will never understand. They quickly realize that they need each other to be whole, but at the same time they know that they've got demons to fight. And the problem with demons is that they never die quietly.", "hash": "aa97ca68-416d-40de-888d-24eb3edc9d6b"}, {"title": "Until We Burn (Beautifully Broken #2.5)", "author": "Courtney Cole", "pgs": 9, "sum": "Storyline: \nUntil We Burn (Beautifully Broken #2.5) Dominic Kinkaide does bad, bad things. As a 24-year old actor with the world on a string, not many women tell Dominic no. In a life where no doesn’t exist, he stretches the boundaries between what is right, what is wrong and what is downright depraved. Dark and damaged, Dom wants no commitments. He wants no attachments. He only wants to disappear into the taboo, into a place where he feels something. Anything. But when the aching need to disappear into the darkness is the only thing he has left, Dominic flounders. In a world that is hollow and sexual, without a guiding light or a reason to breathe, Dominic is lost and broken. He knows he’ll never be fixed. So he makes a decision. If he’s going to hell, he might as well make it worth it.", "hash": "39df7f9f-6fdc-466a-9332-23587152041d"}, {"title": "Before We Fall (Beautifully Broken #3)", "author": "Courtney Cole", "pgs": 49, "sum": "Storyline: \nBefore We Fall (Beautifully Broken #3) Sometimes, one dark moment is all it takes to turn your world black... For 24-year old Dominic Kinkaide, that moment took place on the night of his high school graduation. One dark incident changed him forever. He's a hardened actor now, famous in the eyes of the world, but tortured in his own. He doesn't care about much of anything, except for losing himself in the roles that he plays. 23-year old Jacey Vincent doesn't realize how much her father's indifference has affected her. She is proof that sometimes it isn't one specific moment that wrecks a person, but rather it's an absence of moments. She's like a bird with a broken wing-strong yet fragile, as she tries to float through life, finding acceptance in the arms of random guys, one after the other... to fill the void that her father left in her. Until she meets Dominic. After jaded Dominic and strong-willed Jacey are thrown together, his secret and her issues create a dark and damaged energy that will soon turn their attraction to each other into an explosive storm. Even though when the clouds have cleared and the dust has settled, both of them are almost obliterated... they've learned a priceless lesson. Sometimes, before we fall... we fly.", "hash": "635e0ad2-2ba3-449b-a13d-4abf17794c9a"}, {"title": "Mia's Heart ", "author": "Courtney Cole", "pgs": 30, "sum": "Storyline: \nMia's Heart (The Paradise Diaries #2) My name is Mia Giannis. I am seventeen years old. I live in Valese, Caberra. This has become my mantra and my lifeline, having recently lost my memory due to a scary natural disaster. Yeah. I have amnesia. Messed up, right? You don't know the half of it. Not remembering anything has turned my world upside down. My parents try their hardest to “remind” me of who I was, but it doesn't feel right. Or, if what they're saying is true and that really was me, I'm not sure I like that person very much. And then there’s my love life. Apparently, Gavin Ariastasis is my oldest and best friend in the world. Also, apparently, we’ve never dated. But now, noticing him for what feels like the first time, he’s making my heart do somersaults. He knows me inside and out—the real me. Plus, he’s sexy and charming as hell. Sounds perfect, right? But then... there’s the new guy. Quinn McKeyen – tall, gorgeous and deliciously American. His mischievous grin and slow Midwestern drawl turn my insides to mush in two seconds flat making me question who I really am and what I really want. Seriously. What am I supposed to do with all that?! I feel torn between them, but I barely even know who I am, let alone what I want. I just hope my indecisive heart will clue me in. And sooner rather than later…before I lose what little of my mind that I have left.", "hash": "dbb92e56-1828-452a-9bd4-f4dfce175d51"}]