[{"title": "Gabriel's Inferno (Gabriel's Inferno #1)", "author": "Sylvain Reynard", "pgs": 98, "sum": "Storyline: \nGabriel's Inferno (Gabriel's Inferno #1) Enigmatic and sexy, Professor Gabriel Emerson is a well respected Dante specialist by day, but by night he devotes himself to an uninhibited life of pleasure. He uses his notorious good looks and sophisticated charm to gratify his every whim, but is secretly tortured by his dark past and consumed by the profound belief that he is beyond all hope of redemption. When the sweet and innocent Julia Mitchell enrolls as his graduate student, his attraction and mysterious connection to her not only jeopardizes his career, but sends him on a journey in which his past and his present collide. An intriguing and sinful exploration of seduction, forbidden love and redemption, \"Gabriel's Inferno\" is a captivating and wildly passionate tale of one man's escape from his own personal hell as he tries to earn the impossible...forgiveness and love.", "hash": "cc86ec77-fbc0-44f8-a1ca-8c0c498ee215"}, {"title": "Gabriel's Rapture (Gabriel's Inferno #2)", "author": "Sylvain Reynard", "pgs": 68, "sum": "Storyline: \nGabriel's Rapture (Gabriel's Inferno #2) Professor Gabriel Emerson has embarked on a passionate, yet clandestine affair with his former student, Julia Mitchell. Sequestered on a romantic holiday in Italy, he tutors her in the sensual delights of the body and the raptures of sex. But when they return, their happiness is threatened by conspiring students, academic politics, and a jealous ex-lover. When Gabriel is confronted by the university administration, will he succumb to Dante's fate? Or will he fight to keep Julia, his Beatrice, forever? In Gabriel's Rapture, the brilliant sequel to the wildly successful debut novel, Gabriel's Inferno, Sylvain Reynard weaves an exquisite love story that will touch the reader's mind, body, and soul, forever.", "hash": "35927735-706d-4d51-ae23-47fa2ad16aa0"}, {"title": "Gabriel's Redemption (Gabriel's Inferno #3)", "author": "Sylvain Reynard", "pgs": 75, "sum": "Storyline: \nGabriel's Redemption (Gabriel's Inferno #3) Professor Gabriel Emerson has left his position at the University of Toronto to embark on a new life with his beloved Julianne. Together, he’s confident that they can face any challenge. And he’s eager to become a father. But Julianne’s graduate program threatens Gabriel’s plans, as the pressures of being a student become all consuming. When she is given the honor of presenting an academic lecture at Oxford, Gabriel is forced to confront her about the subject of her presentation – research that conflicts with his own. And in Oxford, several individuals from their past appear, including an old nemesis intent on humiliating Julia and exposing one of Gabriel’s darkest secrets. In an effort to confront his remaining demons, Gabriel begins a quest to discover more about his biological parents, beginning a chain of events that has startling repercussions for himself, Julianne, and his hope of having a family.", "hash": "fc157b57-3876-4f6c-a6b1-2eb7d2f257ce"}, {"title": "Virgin River (Virgin River #1)", "author": "Robyn Carr", "pgs": 54, "sum": "Storyline: \nVirgin River (Virgin River #1) \"Wanted: Midwife/nurse practitioner in Virgin River, population six hundred. Make a difference against the backdrop of towering California redwoods and crystal-clear rivers. Rent-free cabin included.\" When the recently widowed Melinda Monroe sees this ad she quickly decides that the remote mountain town of Virgin River might be the perfect place to escape her heartache, and to reenergize the nursing career she loves. But her high hopes are dashed within an hour of arriving: the cabin is a dump, the roads are treacherous and the local doctor wants nothing to do with her. Realizing she's made a huge mistake, Mel decides to leave town the following morning. But a tiny baby, abandoned on a front porch, changes her plans...and a former marine cements them into place. Melinda Monroe may have come to Virgin River looking for escape, but instead she finds her home.", "hash": "f596c32b-0b52-4083-aa00-f317c7ef6c2a"}, {"title": "Shelter Mountain (Virgin River #2)", "author": "Robyn Carr", "pgs": 55, "sum": "Storyline: \nShelter Mountain (Virgin River #2) John “Preacher” Middleton is about to close the bar when a young woman and her three-year-old son come in out of a wet October night. A marine who has seen his share of pain, Preacher knows a crisis when he sees one—the woman is covered in bruises. He wants to protect them, and he wants to punish whoever did this to her, but he knows immediately that this inclination to protect is something much more. Paige Lassiter has stirred up emotions in this gentle giant of a man—emotions that he has never allowed himself to feel. But when Paige’s ex-husband turns up in Virgin River, Preacher knows his own future hangs in the balance. And if there’s one thing in the marines’ motto of Semper Fidelis—always faithful—has taught him, it’s that some things are worth fighting for.", "hash": "9616562c-1b5d-4697-8ecc-5059db85c399"}, {"title": "Whispering Rock (Virgin River #3)", "author": "Robyn Carr", "pgs": 50, "sum": "Storyline: \nWhispering Rock (Virgin River #3) A decorated U.S. Marine reservist, LAPD officer Mike Valenzuela was badly wounded in the line of duty, but has found hope and healing in Virgin River. When he agrees to become the town's first cop, he does so knowing it's time he settled down. Twice divorced and the lover of too many women, he secretly longs for the kind of commitment and happiness his marine buddies have found--a woman who can tie up his heart forever. He finds that woman in Brie Sheridan, a Sacramento prosecutor who understands his drive to protect and serve. Virgin River becomes a safe haven for Brie after nearly losing her life at the hands of a crazed criminal. Though tough and courageous, she's got some fears she can't escape--but now she has someone who will show her just what it means to trust again. Mike will do anything to help Brie free herself from painful memories. Passionate, strong and gentle, he vows to give back to her what she's so selflessly given him--her heart, and with it, a new beginning.", "hash": "31c66f75-2050-4e62-88f1-92fcf9a9140e"}, {"title": "A Virgin River Christmas (Virgin River #4)", "author": "Robyn Carr", "pgs": 38, "sum": "Storyline: \nA Virgin River Christmas (Virgin River #4) Last Christmas Marcie Sullivan said a final goodbye to her husband, Bobby. This Christmas she's come to Virgin River to find the man who saved his life and gave her three more years to love him.Fellow marine Ian Buchanan dragged Bobby's shattered body onto a medical transport in Fallujah four years ago, then disappeared as soon as their unit arrived stateside. Since then, Marcie's letters to Ian have gone unanswered. Marcie tracks Ian to the tiny mountain town of Virgin River and finds a man as wounded emotionally as Bobby was physically. But she is not easily scared off. As Marcie pushes her way into his rugged and reclusive life, she discovers a sweet but damaged soul beneath a rough exterior. Ian doesn't know what to make of the determined young widow who forces him to look into the painful past and, what's worse, the uncertain future. But it is, after all, a season of miracles and maybe, just maybe, it's time to banish the ghosts and open his heart.", "hash": "234aebe1-1055-4d23-8956-f24b2121f2a5"}, {"title": "Second Chance Pass (Virgin River #5)", "author": "Robyn Carr", "pgs": 58, "sum": "Storyline: \nSecond Chance Pass (Virgin River #5) In the space of a few months Vanessa buried her husband, Matt, and gave birth to their son--breaking her heart while filling it with a whole new kind of love. But the one man she longs to share this love with now acts as if she doesn't exist. Paul Haggerty lives by the marine motto: Semper Fi. Ever faithful to his best friend, he's done right by Matt's widow as best he can...considering he's been secretly in love with her for years. Now, just as he's about to make his move, another woman has staked her claim on him--a claim that will be tough to escape. With courage, humility and not a little meddling from the good folks of Virgin River, Vanni and Paul might just get a second chance to have the love they both desire and deserve.", "hash": "6223c8cf-85ae-4c39-9ddb-699747ce161a"}, {"title": "Temptation Ridge (Virgin River #6)", "author": "Robyn Carr", "pgs": 58, "sum": "Storyline: \nTemptation Ridge (Virgin River #6) At twenty-five, after five years as her mother's caregiver, it's time for Shelby to experience freedom and adventure. Time for travel, college and romance. But when she visits Virgin River, she runs into Luke Riordan, decidedly \"not\" whom she has in mind. A handsome Blackhawk pilot, Luke exited the army after twenty years, four wars and having been shot out of the sky three times. At thirty-eight he's tough and jaded. His major was in one-night stands, with a minor in commitment avoidance. Technically, these two are all wrong for one another. But sometimes what you want and what you need are two different things...two very \"good\" things.", "hash": "a0bfcc1c-0cfa-4aab-896c-e332b9ceda85"}, {"title": "Paradise Valley (Virgin River #7)", "author": "Robyn Carr", "pgs": 51, "sum": "Storyline: \nParadise Valley (Virgin River #7) Marine corporal Rick Sudder is home early from Iraq--his tour ended abruptly on the battlefield. The carefree boy is gone, replaced by a man who believes his future is as bleak as his mirror image. But can the passion and commitment of a young woman who has never given up on him mend his broken body and shattered heart? As the people of Virgin River rally around Rick, another recent arrival tests the tightly knit mountain town's famous welcoming spirit. Dan Brady has a questionable past, and he's looking for a place to start over. He'd like it to be Virgin River...if he can find a way in. But he never expects to find it in the arms of a woman who was as much an outcast as himself. For a favorite son returned from war and an outsider looking for a home, Virgin River offers them a chance to make peace with the men they once were...and to find the dreams they thought they'd lost.", "hash": "8467ad7d-d0a9-4e17-99c4-a4649018add9"}]