[{"title": "Forbidden Falls (Virgin River #9)", "author": "Robyn Carr", "pgs": 52, "sum": "Storyline: \nForbidden Falls (Virgin River #9) Noah Kincaid arrives ready to roll up his sleeves and revitalize his new purchase, but he's going to need some help. An ad in the local paper brings and improbably candidate his way. \"Pastor's assistant\" is not a phrase that springs to mind when Noah meets brassy, beautiful Ellie Baldwin. With her colorful clothes and even more colorful past, Ellie needs a respectable job so she can regain custody of her children. Noah can't help but admire her spunk and determination, and she may just be the breath of fresh air he needs. The unlikely duo may come from two different worlds, but they have more in common than anyone would have expected. And in Virgin River lasting happiness is never out of the question.", "hash": "b6d56105-96c0-493b-bc77-d0a91d2fa073"}, {"title": "Angel's Peak (Virgin River #10)", "author": "Robyn Carr", "pgs": 46, "sum": "Storyline: \nAngel's Peak (Virgin River #10) FOUR YEARS AGO, AIR FORCE SWEETHEARTS FRANCI DUNCAN AND SEAN RIORDAN REACHED AN IMPASSE. SHE WANTED MARRIAGE AND A FAMILY. HE DIDN'T. BUT A CHANCE MEETING PROVES THAT THE BITTER BREAKUP HASN'T COOLED THEIR SIZZLING CHEMISTRY. Sean has settled down in spite of himself --- he's not the cocky young fighter pilot he was when Franci left, and he wants them to try again. After all, they have a history ... but that's not all they share. Franci's secret reason for walking away when Sean refused to commit is now three and a half: a redheaded cherub named Rosie who shares her daddy's emerald-green eyes. Sean is stunned --- and furious with Franci for the deception. News travels fast in Virgin River, and soon the whole town is taking sides. Rebuilding their trust could take a small miracle --- and the kind of love that can move mountains.", "hash": "f263ecba-e690-423d-af86-521250bb50a3"}, {"title": "Working It (Love by Design #1)", "author": "Kendall Ryan", "pgs": 34, "sum": "Storyline: \nWorking It (Love by Design #1) Emmy Clarke is out of her depth in New York City’s fashion world, but when she lands a job as an assistant at a modeling agency it seems like the perfect mix of business and pleasure. Working under the notorious Fiona Stone is a nightmare, but there’s one distinct perk: ogling the ridiculously hot male models who parade through the office—particularly rising star Ben Shaw. Ben is everything Emmy’s not: exquisitely gorgeous, highly paid, and well-traveled. He’s also got more issues than Vogue. Emmy looks after Ben on photo shoots, but she refuses to become another one of his lusting groupies. Ben finds Emmy’s refreshingly real attitude to be surprisingly attractive. Against a backdrop of the most fashionable cities in the world, casual flirting turns into an illicit affair, but when Ben’s twisted past is revealed, and the bitter Fiona catches wind of their relationship, their careers and hearts are threatened.", "hash": "c1c48364-298e-4bec-a003-8810529271d0"}, {"title": "How to Ruin a Summer Vacation (How to Ruin #1)", "author": "Simone Elkeles", "pgs": 25, "sum": "Storyline: \nHow to Ruin a Summer Vacation (How to Ruin #1) Moshav? What’s a moshav? Is it “shopping mall” in Hebrew? I mean, from what Jessica was telling me, Israeli stores have the latest fashions from Europe. That black dress Jessica has is really awesome. I know I’d be selling out if I go with the Sperm Donor to a mall, but I keep thinking about all the great stuff I could bring back home. Unfortunately for 16-year-old Amy Nelson, “moshav” is not Hebrew for “shopping mall.” Not even close. Think goats, not Gucci. Going to Israel with her estranged Israeli father is the last thing Amy wants to do this summer. She’s got a serious grudge against her dad, a.k.a. “Sperm Donor,” for showing up so rarely in her life. Now he’s dragging her to a war zone to meet a family she’s never known, where she’ll probably be drafted into the army. At the very least, she’ll be stuck in a house with no AC and only one bathroom for seven people all summer—no best friend, no boyfriend, no shopping, no cell phone… Goodbye pride—hello Israel.", "hash": "bdfa6315-e695-47f9-945c-56738b6d8d5d"}, {"title": "How to Ruin My Teenage Life (How to Ruin #2)", "author": "Simone Elkeles", "pgs": 32, "sum": "Storyline: \nHow to Ruin My Teenage Life (How to Ruin #2) In this sequel to How to Ruin a Summer Vacation, EVERYTHING in sixteen-year-old Amy Nelson Barak's life is going wrong! Her mom got married and moved to the suburbs, and now they are going to have a baby. Amy moves in with her dad in Chicago and signs him up for an online dating service. His first four dates are that night . . . What else? Her dog Mutt impregnated her grumpy neighbor's prized poodle, so Amy will actually have to get a part-time job to pay for half the veterinary bill. And there's this totally annoying boy, Nathan Rubin, who just moved into her apartment building. Luckily, Amy has a cute boyfriend named Avi. Only he's more like a non-boyfriend considering Avi is in the Israeli army for the next three years. What's a girl to do when everyone is conspiring to ruin her life?", "hash": "a8acf55e-5030-4793-adda-98bf0fc9c3ed"}, {"title": "How to Ruin Your Boyfriend's Reputation (How to Ruin #3)", "author": "Simone Elkeles", "pgs": 28, "sum": "Storyline: \nHow to Ruin Your Boyfriend's Reputation (How to Ruin #3) Amy Nelson-Barak, 17, is back in this third installment about a Jewish-American teen learning how to live and love in peace. She signs up for 10 days of training with the Israel Defense Force as soon as she finds out that her long-distance boyfriend, Avi, will be on base as well. But things turn out to be different from what she'd hoped for. She sleeps in a bunk bed underneath coils that look ready to give way, she's being worked to the bone, and the bathrooms are hardly up to her standards. Worst of all, Avi doesn't seem remotely thrilled that she's there. Is something going on between him and a fellow soldier? Strong, beautiful, and able to be with Avi all the time, Liron is everything Amy wants to be. Even though the plot is predictable, readers can't help but get drawn in by Amy's fun way of telling her story, and they learn a lot about Israeli teens' mandatory military service. Elkeles catches new readers up to speed in no time.", "hash": "753f0f00-c417-48f9-81cb-553e049301df"}, {"title": "Perfect Chemistry (Perfect Chemistry #1)", "author": "Simone Elkeles", "pgs": 45, "sum": "Storyline: \nPerfect Chemistry (Perfect Chemistry #1) A fresh, urban twist on the classic tale of star-crossed lovers. When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created 'perfect' life is about to unravel before her eyes. She's forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she's worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more. In a passionate story about looking beneath the surface, Simone Elkeles breaks through the stereotypes and barriers that threaten to keep Brittany and Alex apart.", "hash": "a4f464f2-6529-4c8b-a353-8b7164417bb5"}, {"title": "Rules of Attraction (Perfect Chemistry #2)", "author": "Simone Elkeles", "pgs": 43, "sum": "Storyline: \nRules of Attraction (Perfect Chemistry #2) When Carlos Fuentes returns to America after living in Mexico for a year, he doesn’t want any part of the life his older brother, Alex, has laid out for him at a high school in Colorado. Carlos likes living his life on the edge and wants to carve his own path—just like Alex did. Then he meets Kiara Westford. She doesn’t talk much and is completely intimidated by Carlos’ wild ways. As they get to know one another, Carlos assumes Kiara thinks she’s too good for him, and refuses to admit that she might be getting to him. But he soon realizes that being himself is exactly what Kiara needs right now.", "hash": "43573638-1b40-4806-824d-6aaf89dfbdc1"}, {"title": "Chain Reaction (Perfect Chemistry #3)", "author": "Simone Elkeles", "pgs": 42, "sum": "Storyline: \nChain Reaction (Perfect Chemistry #3) Like his brothers, Luis Fuentes is a risk taker; whether he's scaling the Rocky Mountains or dreaming of a future as an astronaut, Luis is always looking for the next thrill. Nikki Cruz lives her life by certain rules ― don't trust a boy who says \"I love you\", boys lie to get their own way and never date a boy from the south side of Fairfield. Then she meets Luis at his brother Alex's wedding and suddenly she's tempted to break all her rules. Getting Nikki to give him a chance is Luis's biggest challenge, until he finds himself targeted by the head of the gang that nearly destroyed his brothers' lives. Will Luis's feelings for Nikki be enough to stop him from entering a dark and violent world that could prove to be the ultimate risk?", "hash": "95ec026a-6515-4efc-a371-cc15aa411a3c"}, {"title": "Wild Cards (Wild Cards #1)", "author": "Simone Elkeles", "pgs": 41, "sum": "Storyline: \nWild Cards (Wild Cards #1) After getting kicked out of boarding school, bad boy Derek Fitzpatrick has no choice but to live with his ditzy stepmother while his military dad is deployed. Things quickly go from bad to worse when he finds out she plans to move them back to her childhood home in Illinois. Derek’s counting the days before he can be on his own, and the last thing he needs is to get involved with someone else’s family drama. Ashtyn Parker knows one thing for certain--people you care about leave without a backward glance. A football scholarship would finally give her the chance to leave. So she pours everything into winning a state championship, until her boyfriend and star quarterback betrays them all by joining their rival team. Ashtyn needs a new game plan, but it requires trusting Derek—someone she barely knows, someone born to break the rules. Is she willing to put her heart on the line to try and win it all?", "hash": "9371b2c2-7f8b-4075-b3fa-08397e310e66"}]