[{"title": "Leaving Paradise (Leaving Paradise #1)", "author": "Simone Elkeles", "pgs": 31, "sum": "Storyline: \nLeaving Paradise (Leaving Paradise #1) Nothing has been the same since Caleb Becker left a party drunk, got behind the wheel, and hit Maggie Armstrong. Even after months of painful physical therapy, Maggie walks with a limp. Her social life is nil and a scholarship to study abroad—her chance to escape everyone and their pitying stares—has been canceled. After a year in juvenile jail, Caleb’s free . . . if freedom means endless nagging from a transition coach and the prying eyes of the entire town. Coming home should feel good, but his family and ex-girlfriend seem like strangers. Caleb and Maggie are outsiders, pigeon-holed as \"criminal\" and \"freak.\" Then the truth emerges about what really happened the night of the accident and, once again, everything changes. It’s a bleak and tortuous journey for Caleb and Maggie, yet they end up finding comfort and strength from a surprising source: each other.", "hash": "39b13aa8-fd4a-4fd1-b18e-d5b617178e1a"}, {"title": "Return to Paradise (Leaving Paradise #2)", "author": "Simone Elkeles", "pgs": 30, "sum": "Storyline: \nReturn to Paradise (Leaving Paradise #2) Caleb Becker left Paradise eight months ago, taking with him the secret he promised to take to his grave. If the truth got out, it would ruin everything. Maggie Armstrong tried to be strong after Caleb broke her heart and disappeared. Somehow, she managed to move on. She's determined to make a new life for herself. But then Caleb and Maggie are forced together on a summer trip. They try ignoring their passion for each other, but buried feelings resurface. Caleb must face the truth about the night of Maggie's accident, or the secret that destroyed their relationship will forever stand between them.", "hash": "6f5f14b6-ba62-4dbf-a04a-4b24918a7bae"}, {"title": "Secrets (Secrets #1)", "author": "H.M. Ward", "pgs": 16, "sum": "Storyline: \nSecrets (Secrets #1) Sex is supposed to be sexy, tantalizing, and completely erotic, but Anna never seems to find the right guy. This one seems to be a germ-a-phobe, and the previous boyfriend wasn't much better. Anna just wants to be wanted. Is that too much to ask? As Anna tries to wiggle out of one relationship, a new one surfaces, but it's forbidden. Cole Stevens is twice her age, arrogant, rich, sexy as hell, and her boss. When Anna's internship plans derail, she ends up interning at Cole's elite New York City studio. Close proximity leads Anna to discover that the billionaire bachelor is emotionally scarred. Everyone has secrets, but Cole's run deeper, cutting him to his core. Cole is trouble in a sexy shell. He's nothing Anna needs and everything she wants.", "hash": "0656bf23-3718-4af3-b55e-414d075fa6df"}, {"title": "Secrets Vol. 3 (Secrets #3)", "author": "H.M. Ward", "pgs": 11, "sum": "Storyline: \nSecrets Vol. 3 (Secrets #3) When Anna admits she's falling for Cole she can't believe his response. He pushes her away with an excuse that seems too flimsy to be real. Crushed, Anna continues working at Cole's Long Island studio, but she can't stop thinking about him. It isn't until Anna is called into the dean's office that the real trouble starts. To make matters worse, Edward keeps popping up at the worst times reminding her of everything she wants to forget.", "hash": "64514f67-75ea-477b-9e25-a31e3ec8aab5"}, {"title": "Secrets Vol. 4 (Secrets #4)", "author": "H.M. Ward", "pgs": 10, "sum": "Storyline: \nSecrets Vol. 4 (Secrets #4) At night, when Anna closes her eyes, everything comes rushing back; the sensuous sound of Cole’s voice, his scalding touch, and the way his eyes roved over her body like he could never get enough. Flirtation, promises of passionate sex, and nights filled with Cole’s sexy smile are gone. Anna worries that her crush on Cole was something more, because her life is total agony without him. Anna realizes she’s at a turning point. Someone burned her. This isn’t a little blister that would go away on its own, it’s an inferno that destroyed everything it touched. In a matter of minutes, Anna lost her future and the man who holds her heart. Anna has to decide how and when to get even with the person who destroyed her life—Sophia Sottero.", "hash": "5bf9921d-7a42-463a-a4f9-d7cea7f69487"}, {"title": "Secrets Vol. 5 (Secrets #5)", "author": "H.M. Ward", "pgs": 12, "sum": "Storyline: \nSecrets Vol. 5 (Secrets #5) The pounding in Anna's heart rings in her ears as she sits naked in the tub. The bath water sloshes around her bare hips, even though she tries to stand without making a sound. All this time, Anna thought someone was following her, but every time she turned around no one was there. The chills that climbed up her spine those few times seemed silly, but not now. Now, they seem horrific. Cole is gone, Emma is at work, and Anna is completely alone. A shadow darkens the space under the door. The metallic clink of a hand touching the knob sends Anna out of her mind. Pulse pounding in her ears, Anna has no other option, but to open the bathroom door and come face to face with her stalker.", "hash": "e53c51e5-34d5-4d0a-a68c-1f3c3e2105e2"}, {"title": "Collide (The Secret Life of Trystan Scott #1)", "author": "H.M. Ward", "pgs": 11, "sum": "Storyline: \nCollide (The Secret Life of Trystan Scott #1) When Mari accidentally overhears that Trystan is in love, she can't believe it. He's pining over some girl that doesn't know he's alive. The confident swagger and endless stream of girls is a facade. It conceals his loneliness and hides how messed up he's really become trying to flee from a life that's battered him to his core. Trystan tries to figure out how to make it clear how much he loves Mari, but every insincere kiss and every broken promise haunts him, because she knows them all. Now, Trystan has to prove to the one girl he's actually fallen in love with that she's not just another conquest. Mari has no idea who Trystan loves, but she can tell that whoever it is has captured his heart entirely. Soon Mari sees the man behind the mask, the guy that Trystan tries so hard to hide. Everything about him is appealing, and too hard to resist. In a moment of desperation, Trystan uploads a love song he wrote for Mari, but before he can show it to her, the video goes viral. Everyone wants to know who he is, and the only thing shielding him is an anonymous account name and some thick shadows hiding his face. Tyrstan realizes that the consequences of revealing his identity will be disastrous. Everything he's tried so hard to hide will be exposed. It's a secret that is impossible to keep and the only girl who he wanted to hear it will never believe him.", "hash": "254f3257-8fac-4126-b75b-971c2f4c4ca3"}, {"title": "Backdraft (The Secret Life of Trystan Scott #2)", "author": "H.M. Ward", "pgs": 10, "sum": "Storyline: \nBackdraft (The Secret Life of Trystan Scott #2) When Mari realizes that Trystan is the internet megastar, Day Jones, she can’t speak. Every time she listens to his song, it leaves her feeling so much. That song is bewitching. Everyone she knows heard it. As soon as it appeared on YouTube, it went viral, and then the guy who wrote it disappeared. Despite agents and record labels trying to lure Day5705 out, he remains anonymous. No one knows who Day Jones really is—except Mari. To Trystan’s relief, Mari agrees to keep his secret. Part of him regrets uploading the song, but when he sings to Mari the song that once brought him solace, it fills him joy. In a life like his, joy is fleeting and Trystan plans on grabbing hold whenever a shot at happiness appears. To his surprise, Mari doesn’t realize the song is about her. When Trystan tries to push her to see, he jeopardizes losing her entirely. One misplaced kiss topples the fragile relationship, leaving Trystan reeling, trying to assemble the pieces and convincing Mari that she’s not just another conquest, even though everything he did—everything he said—makes it seem like she is. It isn’t until Mari decides that being the good girl isn’t working that things steam up. Trystan knows she wants to hook up with someone, and he doesn’t know if he should stop her. Every attempt he makes to win her over goes bad and pushes her further away. As the world gets one day closer to tracking down Day Jones, Trystan is one day closer to graduation and leaving this life forever. If Mari doesn’t realize he loves her by then, she never will.", "hash": "998924e0-9f09-4c46-bffb-33e59163c5ae"}, {"title": "Riptide (The Secret Life of Trystan Scott #3)", "author": "H.M. Ward", "pgs": 11, "sum": "Storyline: \nRiptide (The Secret Life of Trystan Scott #3) A random hook-up isn't enough for Trystan, not anymore. After everything Trystan went through to tell Mari that he loves her, there is no way that he's letting her walk away without knowing how he really feels. Every mask is stripped away making Trystan completely vulnerable. Mari's the one girl he wants, that he knew he'd never have. But, the look on Mari's face--the way she kissed him--makes Trystan think that confessing his feelings was worth the risk. Shocked, Mari stands there staring at Trystan. As if it weren't enough that Trystan is internet super star, Day Jones, but the song he wrote was about her. That was her name on the music. It was her name etched into his heart. Trystan Scott loves her. Everything Mari wants is within reach. She just has to have enough guts to reach out and take it.", "hash": "e02f9857-7851-4685-b824-df984e721869"}, {"title": "Revealed (The Secret Life of Trystan Scott #5)", "author": "H.M. Ward", "pgs": 10, "sum": "Storyline: \nRevealed (The Secret Life of Trystan Scott #5) Fame has a price and Trystan doesn't want to pay it. Everything he worked so hard to hide is about to be revealed. Nothing he can do will stop it. Within a few short hours everyone will know about his father and the sordid details of his past. Brie is by his side, sputtering things that she shouldn't know. Did Mari stab him in the back? After everything they've been through, he can't believe it, but where is she? There are four words Trystan's father said that haunt him—four words that he ignored—never fall in love.", "hash": "defbbb42-bf49-46b6-9d77-389f2f76dce8"}]