[{"title": "The Things We Do for Love ", "author": "Kristin Hannah", "pgs": 57, "sum": "Storyline: \nThe youngest of three daughters, Angela DeSaria Malone was always “the princess” of the family, a girl who thought she knew how her life would unfold. High School. College. Marriage. Motherhood. That was how it had gone for her sisters, her cousins, her friends. But it didn’t work out that way for Angie. She and her husband tried desperately to have a child; year after year, their perfectly decorated nursery remained empty. Finally, their marriage collapsed under the weight of lost dreams. After the divorce, Angie moved back to her hometown and rejoined her loud, loving, slightly crazy family. In West End, a place where life rises and falls in time with the tides, she will find the man who once again will open her heart to love . . . and meet the girl who will change Angie’s life. Lauren Ribido lives in a rundown apartment in a bad part of town with a mother who cares more about her next drink than about her daughter. At seventeen, Lauren knows that her aspirations in life may never come to pass. From the moment they meet, Angie sees something special in Lauren. They form a quick connection, this woman who is desperate for a daughter and the girl who has never known a mother’s love. When Lauren is abandoned by her mother, Angie doesn’t hesitate to offer the girl a place to stay. But nothing could have prepared Angie for the far-reaching repercussions of this act of kindness. In a dramatic turn of events, she and Lauren will be tested in a way that mothers and daughters seldom are. Together they will embark on an intensely moving, deeply emotional journey to the very heart of what it means to be a family.", "hash": "a34667b0-45dd-4530-9ff4-9010583a9a99"}, {"title": "Winter Garden ", "author": "Kristin Hannah", "pgs": 61, "sum": "Storyline: \nMeredith and Nina Whitson are as different as sisters can be. One stayed at home to raise her children and manage the family apple orchard: the other followed a dream and traveled the world to become a famous photojournalist. But when their beloved father falls ill, Meredith and Nina find themselves together again, standing alongside their cold, disapproving mother, Anya, who even now, offers no comfort to her daughters. As children, the only connection between them was the Russian fairy tale Anya sometimes told the girls at night. On his deathbed, their father extracts a promise from the women in his life: the fairy tale will be told one last time - and all the way to the end. Thus begins an unexpected journey into the truth of Anya's life in war-torn Leningrad, more than five decades ago. Alternating between the past and present, Meredith and Nina will finally hear the singular, harrowing story of their mother's life, and what they learn is a secret so terrible and terrifying that it will shake the very foundation of their family and change who they believe they are.", "hash": "1276bdd5-2dab-4ffe-8dcc-146ddd2300e7"}, {"title": "The Sparkling One (Marcelli #1)", "author": "Susan Mallery", "pgs": 43, "sum": "Storyline: \nThe Sparkling One (Marcelli #1) A party planner extraordinaire, Katie Marcelli loves her big, boisterous family -- even when their chronic matchmaking drives her crazy! In the Marcelli household, fine wine and good food are as celebrated as true love, so when her eighteen-year-old sister announces her engagement, Katie promises her the perfect wedding. There's only one hitch: the father of the groom, Zach Stryker, who is adamantly opposed to his son marrying so young. Now, despite her instant attraction to the handsome, arrogant attorney, Katie must approach with caution: Zach, who hired Katie for a major fund-raiser, holds the fate of her business in his hands -- and how can she trust a man who is willing to break her sister's heart? It will take a passionate battle of wills to determine if wedding bells will ring for a Marcelli bride, and to unlock the deepest desires -- for family, love, and home -- inside a strong-willed man's heart.", "hash": "94e884d3-6525-4107-aa8e-169948b17d9c"}, {"title": "The Sassy One (Marcelli #2)", "author": "Susan Mallery", "pgs": 43, "sum": "Storyline: \nThe Sassy One (Marcelli #2) Francesca Marcelli married at eighteen -- right on schedule, according to her warm, colorful family, who have always said a beauty like Francesca need never worry about finding love. But a few years later, finding herself on her own with a wide open future ahead of her, she pursues her educational passions -- with a risky experiment that takes her straight into the arms of playboy CEO Sam Reese. Delighted by Francesca's interest in a no-strings relationship, Sam suddenly finds himself needing her outside the bedroom when a secret from his past lands on his doorstep. But Francesca soon has a secret of her own to tell -- a bombshell that will force the diehard bachelor to show his true colors. Are there \"I do\"s in Sam and Francesca's future? Only if she can persuade him that home truly is where the heart finds happiness.", "hash": "33137524-d5c5-4973-bb48-12f2b71cac5a"}, {"title": "The Seductive One (Marcelli #3)", "author": "Susan Mallery", "pgs": 42, "sum": "Storyline: \nThe Seductive One (Marcelli #3) For the Marcelli sisters of California wine country, the season is ripe for romance! Of all the Marcelli sisters, the one who dreams of running the family's winery is Brenna -- and she's about to get her chance. But taking the helm at Marcelli Winery is tougher than she bargained for -- especially when she butts heads with her grandfather, whose Old World ways dictate that a male should inherit the business. In need of some fast capital in order to prove her grandfather wrong, Brenna turns to Nic Giovanni, her family's nemesis....Years ago, she ended her secret relationship with Nic, choosing loyalty to her family over the hot passion they shared. But now he's back in her life, he's loaned her a million dollars, and their feelings for each other are stronger than ever. Brenna must find out for herself: is Nic the love of her life? Or the schemer who could topple the Marcelli dynasty -- and break her heart? Meet three unforgettable sisters in a wonderful trilogy that's vintage Susan Mallery -- warm, witty, and stunningly sensual. Look for The Sparkling One and The Sassy One, available from Pocket Star Books!", "hash": "bb6b6535-7df0-4994-aa9c-0e9b3f55c3ef"}, {"title": "The Marcelli Bride (Marcelli #4)", "author": "Susan Mallery", "pgs": 40, "sum": "Storyline: \nThe Marcelli Bride (Marcelli #4) The rebel of the Marcelli family, Joe never joined his sisters Katie, Francesca, and Brenna in running the winery business. Instead, he chose a life of military service. But now that this handsome, headstrong former Navy SEAL has received a new, undercover assignment -- protecting none other than the commander in chief's daughter -- he finds himself stationed back at the California vineyard he defiantly left behind. First-daughter Darcy Jensen has been placed in hiding at the Marcelli Winery after surviving a kidnapping attempt . . . and now it's Joe's job to keep the fearful, fiery beauty out of harm's way. Begrudgingly, Joe heeds his presidential order -- until \"babysitting\" Darcy proves to be the greatest pleasure he's ever known. How can Joe protect Darcy from danger, when he's falling dangerously in love? And can Darcy trust that Joe's intentions are true -- when no one else's have ever been?", "hash": "ad2d1a54-0f55-4e6d-9513-366c73d8afdf"}, {"title": "The Marcelli Princess (Marcelli #5)", "author": "Susan Mallery", "pgs": 40, "sum": "Storyline: \nThe Marcelli Princess (Marcelli #5) A smart, independent woman with a gorgeous four-year-old son, Mia Marcelli lost her one true love. Four years ago, while working undercover for the CIA, she watched Diego, the father of her unborn child, perish before her very eyes -- crumbling the world around her. But one morning she awakens to find Diego lying next to her, alive and well with an unbelievable confession: he is really Rafael, Prince of Calandria, and he had been working covertly on the same mission when they met -- his death had been staged. Utterly stunned, Mia is wary and delighted -- she may have suffered a broken heart, but her breathtakingly handsome lover is back to reignite the passion that existed between them. Little does she know that Rafael has returned to give his newfound son a proper upbringing back in Calandria -- even if it means seducing Mia into marriage. But when Rafael finds himself truly falling for this luscious beauty, he must decide between his royal duties and the woman who has claimed his heart.", "hash": "7ee0a990-2b50-4fe1-b1f8-0fc4614b79c3"}, {"title": "Someone Like You (Los Lobos #1)", "author": "Susan Mallery", "pgs": 44, "sum": "Storyline: \nSomeone Like You (Los Lobos #1) Sometimes even a city girl needs the comforts of home. . . Jill Strathern left town for the big city and never looked back-until she returned home years later to run a small law practice. It turns out her childhood crush, Mac Kendreck, a burned-out LAPD cop, has also come back to sleepy Los Lobos. Even though Mac had rejected her back in high school, Jill can't deny the attraction she still feels for him. Now Jill and Mac are tangled up in enough drama to satisfy the most jaded L.A. denizens-Mafia dons, social workers, angry exes and one very quirky eight-year-old can make even the simplest romance complicated. And it all goes to prove that when it comes to affairs of the heart, there's no place like home.", "hash": "aa846555-2037-420f-8d34-12d57e7c62f3"}, {"title": "Falling For Gracie (Los Lobos #2)", "author": "Susan Mallery", "pgs": 43, "sum": "Storyline: \nFalling For Gracie (Los Lobos #2) Years ago, Gracie Landon loved Riley Whitefield with a desperation that made her a town legend. Now a successful wedding-cake caterer, she's back in town for her sister's wedding. Riley is also back, and the one-time bad boy is seeking respectability through his mayoral bid. When the two meet, sparks begin to fly...and they're anything but respectable!", "hash": "28c090dc-b0cb-401f-bc66-d65d419c8f9e"}, {"title": "The Wanderer (Thunder Point #1)", "author": "Robyn Carr", "pgs": 46, "sum": "Storyline: \nThe Wanderer (Thunder Point #1) From Robyn Carr, #1 New York Times bestselling author of the popular Virgin River novels, comes Thunder Point-the highly anticipated new series that will make you laugh, make you sigh, and make you fall in love with a small town filled with people you'll never forget. Nestled on the Oregon coast is a small town of rocky beaches and rugged charm. Locals love the land's unspoiled beauty. Developers see it as a potential gold mine. When newcomer Hank Cooper learns he's been left an old friend's entire beachfront property, he finds himself with a community's destiny in his hands. Cooper has never been a man to settle in one place, and Thunder Point was supposed to be just another quick stop. But Cooper finds himself getting involved with the town. And with Sarah Dupre, a woman as complicated as she is beautiful. With the whole town watching for his next move, Cooper has to choose between his old life and a place full of new possibilities. A place that just might be home.", "hash": "217e79dc-4a94-437e-bfef-2cfc50703176"}]