[{"title": "The Newcomer (Thunder Point #2)", "author": "Robyn Carr", "pgs": 47, "sum": "Storyline: \nThe Newcomer (Thunder Point #2) Single dad and Thunder Point's deputy sheriff \"Mac\" McCain has worked hard to keep everyone safe and happy. Now he's found his own happiness with Gina James. The longtime friends have always shared the challenges and rewards of raising their adolescent daughters. With an unexpected romance growing between them, they're feeling like teenagers themselves-suddenly they can't get enough of one another. And just when things are really taking off, their lives are suddenly thrown into chaos. When Mac's long-lost-and not missed-ex-wife shows up in town, drama takes on a whole new meaning. They're wondering if their new feelings for each other can withstand the pressure...but they are not going down without a fight.", "hash": "560f51d3-9d14-4f82-9308-f8ba91ba2cb8"}, {"title": "The Hero (Thunder Point #3)", "author": "Robyn Carr", "pgs": 40, "sum": "Storyline: \nThe Hero (Thunder Point #3) In a moment of desperation, Devon McAllister takes her daughter and flees a place where they should have been safe and secure. She has no idea what is around the next bend, but she is pretty certain it can't be worse than what they've left behind. Her plan is to escape to somewhere she can be invisible. Instead, an unexpected offer of assistance leads her to Thunder Point, a tiny Oregon town with a willingness to help someone in need. As the widowed father of a vulnerable young boy, Spencer Lawson knows something about needing friendship. But he's not looking for anything else. Instead, he's thrown his energy into his new role as Thunder Point's high school football coach. Tough and demanding to his team, off the field he's gentle and kind...just the kind of man who could heal Devon's wounded heart. Devon thought she wanted to hide from the world. But in Thunder Point, you find bravery where you least expect it...and sometimes, you find a hero.", "hash": "cdcfe054-0290-46f2-a58c-ce516e1ad6cb"}, {"title": "The Chance (Thunder Point #4)", "author": "Robyn Carr", "pgs": 45, "sum": "Storyline: \nThe Chance (Thunder Point #4) With its breathtaking vistas and down-to-earth people, Thunder Point is the perfect place for FBI agent Laine Carrington to recuperate from a gunshot wound and contemplate her future. The locals embraced Laine as one of their own after she risked her life to save a young girl from a dangerous cult. Knowing her wounds go beyond the physical, Laine hopes she'll fit in for a while and find her true self in a town that feels safe. She may even learn to open her heart to others, something an undercover agent has little time to indulge. Eric Gentry is also new to Thunder Point. Although he's a man with a dark past, he's determined to put down roots and get to know the daughter he only recently discovered. When Laine and Eric meet, their attraction is obvious to everyone. But while the law enforcement agent and the reformed criminal want to make things work, their differences may run too deep…unless they take a chance on each other and find that deep and mysterious bond that belongs to those who choose love over fear.", "hash": "976bb108-f071-4627-af7c-192cbd6f4734"}, {"title": "Axel (Corps Security #1)", "author": "Harper Sloan", "pgs": 43, "sum": "Storyline: \nAxel (Corps Security #1) Fate hasn’t always been friends with Isabelle West. In fact, fate has been a downright bitch. Isabelle has learned the hard way how hard life can be when fate isn’t by your side. It can hand you dreams on silver platters, but it can snatch them right back and hand you nightmares. One thing Isabelle knew for sure fate was consistent with was taking away everything she ever loved. For the last two years Isabelle has been slowly clearing the clouds of her past. Happiness is finally on the horizon. She has a thriving business, great friends, and her life back. All she has to do is jump over the last hurdle…her ex-husband. When problems start causing her to fear her new life, and memories that are better left forgotten start rushing to the surface the last thing she needs is a ghost from her past to come knocking on her door. Axel never thought he would look into the eyes of Isabelle West again, and he wasn’t sure he wanted to now. He’s carried his anger for so long he isn’t sure he can just turn it off, but when he is faced with protecting her and an unexpected desire to have her again, life gets a little more complicated. How will Axel and Isabelle deal when all their cards are put on the table and everything they thought was true blows up in their faces? Note from the author--This book is intended for a mature reading audience and isn't suitable for younger readers.", "hash": "c2ed330b-5aeb-42aa-a644-837a51c6e511"}, {"title": "Cage (Corps Security #2)", "author": "Harper Sloan", "pgs": 31, "sum": "Storyline: \nCage (Corps Security #2) Greg Cage was born to protect. While growing up, he was his mother and sister's shield against the world... until he failed. For the last decade, he has carried that guilt and need for vengeance around... until it was stripped from him. Now, with his best friend getting married and no longer needing his protection, he is even more lost, completely adrift, and desperate for some control. All he has ever known was how to protect: his family, his friends, and his country. Can he go against everything he has ever known, and give up that control? Melissa Larson will never let anyone hold the reins in her life. She has been the rock in her family for more years than she can remember, and the fight to keep them together is her main priority right now. She has always been fiercely independent and proud. The last thing she will ever do is ask for someone else's help. But when that choice is out of her control, forcing her to rely on others to save her and her family, and pick up the pieces that are left, will she be able to let someone else be her strength? The second Greg locks eyes with Meli, he knows that she is someone he needs. Someone he craves. Meli knew the second she met Greg that he would be nothing but trouble and heartache. Her life takes an unexpected turn, and that bitch Fate is back to wreak more havoc on another member of the Corps family. All hell breaks loose, leaving Greg no choice but to call in a favor. He hooks back up with his old friend Braxxon Breaker from the Breakneck MC. Together, they make sure that nothing threatens anyone Greg loves again.", "hash": "b4ba61b0-420c-4cf7-9c26-e20c4d055a52"}, {"title": "Beck (Corps Security #3)", "author": "Harper Sloan", "pgs": 39, "sum": "Storyline: \nBeck (Corps Security #3) ~DEE~ I’ve always been good at wearing masks. Not letting anyone see the real me. I’m content being the happy-go-lucky best friend. The strong willed boss. The independent woman who doesn’t need a man. But the truth is I’m just as broken as the rest of you. I’m terrified that all it will take is one person to make all my carefully constructed walls crumble into fine dust. So I guard my heart with everything I have. Determined to never let anyone get close enough to hurt me again. All is perfect until HE walks into my life. No… he doesn’t just walk. He struts his good-looking, sex-oozing self right into my space and demands that I see HIM. Making me want what I know I can’t have. So I did the only thing I know how to do. I run. But he just won’t let me go. ~BECK~ The second I see her, I know she will be mine. I see past the gorgeous smiles and heart-stopping laughter. I see HER. She doesn’t want me to know her secrets or the past that haunts her, but I make it my mission to find out. To make her mine. She can run all she wants, but it will never be far enough to stop me from coming after her. She’s it for me and she knows it. She’s just too scared to admit it.", "hash": "6fcf2b51-b4e6-4bfb-a5b8-710fac0492be"}, {"title": "Night Owl (The Night Owl Trilogy #1)", "author": "M. Pierce", "pgs": 36, "sum": "Storyline: \nNight Owl (The Night Owl Trilogy #1) At twenty-eight, Matt Sky has the perfect life. He has a beautiful girlfriend, a massive inheritance, and four national bestsellers -- all penned under his airtight alias, M. Pierce. At twenty-seven, Hannah Catalano is a train wreck. Her boyfriend is a deadbeat and her job is abysmal. Matt and Hannah meet online as writing partners. Their relationship is safe, anonymous, and innocent... Until Matt sees a picture of Hannah. Hannah's picture sparks an attraction Matt is powerless to ignore. When circumstance brings Matt and Hannah together, the strangers begin a love story that's passionate, poignant, unforgettable, and unstoppable.", "hash": "dab000c4-3cb0-4536-8b50-233e6689b057"}, {"title": "Damaged (Damaged #1)", "author": "H.M. Ward", "pgs": 32, "sum": "Storyline: \nDamaged (Damaged #1) Life sucks. And, as soon as Sidney picks up the pieces something always knocks her back onto her butt. It's never pretty, but this time is different. This time pretty isn't even the right word. Peter is the personification of perfection. It's like he fell off his angel perch in purgatory, because let's face it--any guy that hot has got to be naughty. He was probably sent here to ruin her life. Peter is beyond beautiful with his sexy blue eyes, dark hair, and toned body. Add in his charming wit and Peter is everything Sidney ever wanted in a man, but when things get hot and heavy Peter shows her the door. Sidney takes the walk of shame and leaves. It's the end of the worst blind date ever. Her life couldn't possibly reach higher levels of suckage, but it does. The next morning everything comes crashing down. The insanely hot guy from last night, the one that saw her half naked, is teaching at the front of the class room.", "hash": "0083f97b-54d5-464e-8cf0-c4c7a7249040"}, {"title": "Damaged 2 (Damaged #2)", "author": "H.M. Ward", "pgs": 28, "sum": "Storyline: \nDamaged 2 (Damaged #2) Home isn't supposed to be dangerous, but for Sidney it is. Returning home means that she has to face her past. It's not just the man who hurt Sidney that makes it horrible, but the family that didn't believe her. They were dead to her, but now that her mom is really dying things seem different. It's a chance to set things right. What Sidney doesn't realize is that she's dragging Peter into a collision course with his past. Peter must deal with the demons haunting him if he wants to move forward with Sidney. He's willing to give up everything for her, even wade deeper into his past life to help her move forward. But, Peter isn't sure if he can get over what happened to him in New York.", "hash": "be76c1f5-fe77-4a01-bb6f-d449fd1a2d1a"}, {"title": "Scandalous (Scandalous #1)", "author": "H.M. Ward", "pgs": 32, "sum": "Storyline: \nScandalous (Scandalous #1) by Ella Steele \"I see it, Jack. Your muse is back. The thing that gave you passion, tormented you, and haunted you is back. You're reeling in ecstasy and dread. It's something you want, but can't ever have. And the one that brings the pain is pure, white as snow... and standing in front of you.\" One kiss could have changed Abby's life, but when it didn't happen, she ran. Jack was everything to her and when he didn't respond, Abby couldn't bear it. Everything about that night--leaning in close to his face, feeling the night breeze teasing her hair, the way his scent filled her head--was burned vividly into her mind, including the moment when Jack pulled away. There was no kiss. Abby was wrong. She was wrong about him, wrong about them. Maybe she didn't have to go to college two thousand miles away, but she did. She had to forget about him. Abby threw herself off the grid, disappearing completely from the life she knew. After completing her undergraduate degree, she enrolled in seminary. All contact with her old life was severed and she never looked back, until she was forced to. When Abby puts idealism into practice, her congregation throws her out. If she can survive a year on her own, they'll take her back, and continue to pay off her student loans--but if she fails, Abby is on her own with enough debt to fund a small town. Seminary wasn't cheap. With no place left to go, Abby returns to New York and her best friend takes her in. Desperate to make it on her own and prove she was right, Abby follows a job lead to an art studio on Long Island. It isn't until she hears Jack's voice that she freezes. The hairs on the back of her neck prickle as she turns to see Jack, ten years later, looking even more tempting than before. Fate is cruel. Abby left this life behind, but she's thrown back into it, head first. It's like someone hit rewind on her life and its ten years earlier. She's the cotton-mouthed girl that she always was around Jack, and now her future relies on the man who rejected her.", "hash": "fb7f5295-36b8-4a4a-990f-56c2f65d1149"}]