[{"title": "The Perfect Wife ", "author": "Lynsay Sands", "pgs": 33, "sum": "Storyline: \n It was to be hoped that her groom was partial to cherries. For Avelyn feared she would very much resemble one at their wedding feast. Too round, too red in the scarlet gown that was all she could fit into\u0085and perhaps too tart for his taste? No doubt he longed for a sweet, biddable bride, one who was tiny and trim as she was trying to appear. Paen Gerville longed for a lively, well-rounded woman, one whose plump breast would cushion his head after the lonely, harsh life of a knight. At first his wife-to-be- promised no such delights-her form was unbending, her health apparently fragile as she fainted in his arms after their first kiss. But one split bridal gown later, her assets were eye-poppingly apparent and Paen could only grin as he anticipated the surprises yet to come on his wedding night with\u0085the perfect wife.", "hash": "f5714547-0e76-4b29-af10-f9ce20de1d24"}, {"title": "Lady Pirate ", "author": "Lynsay Sands", "pgs": 43, "sum": "Storyline: \nA wild and passionate love affair brings our hero and heroine together. Neither can resist the attraction they feel for one another and everything else takes second place.", "hash": "4d2539a9-9b78-409b-9d08-b63821defeff"}, {"title": "Don't Let Go ", "author": "Sharla Lovelace", "pgs": 26, "sum": "Storyline: \nNoah Ryan and Jules Doucette spent every moment together, first as best friends and later as young lovers. The two had planned a life together—until one unspeakable decision tore them apart for good. Twenty-six years later, Jules is still carefully living the life her mother planned out for her. She’s running her mother’s store, living in her mother’s house, following her mother’s rules, and keeping the secrets her mother made her bury. Then Noah comes home and any sense of an ordered life flies out the window. Noah’s return does more than just stir up old memories—it forces Jules to see her life in a whole new way and uncovers secrets even she didn’t know were buried. Secrets that could easily destroy her world once more.", "hash": "33726618-fbc2-41cf-a49e-a7a4c404643d"}, {"title": "Consumed (Consumed #1)", "author": "Skyla Madi", "pgs": 43, "sum": "Storyline: \nConsumed (Consumed #1) Olivia James has never been one to walk on the wild side, at least not until she meets Seth Marc—a cocky, sexy fighter at her father’s gym. He’s infuriating, nauseatingly addictive and she just can’t seem to shake him. He’s only been in town a short while and his name is already on everyone’s lips. He's the kind of guy moms’ warn their daughters about—the kind that leaves a trail of shattered hearts behind him and he has Olivia in his sights. Olivia has never met anyone as confusing as Seth and his hot and cold attitude constantly sends her reeling. She’s never wanted anyone’s touch so badly in her life, but having recently come out of a long term relationship diving into another is something she'd prefer to avoid. Determined for his touch, but not to let him under her skin, Olivia embarks on the most thrilling ride of her life.", "hash": "c6bc3329-272a-432b-b96b-fea7b6ea5a76"}, {"title": "Too Consumed (Consumed #2)", "author": "Skyla Madi", "pgs": 43, "sum": "Storyline: \nToo Consumed (Consumed #2) Olivia did the impossible. She tamed the over-confident Casanova, Seth Marc, turning him into a one woman Romeo. With Seth's first professional fight coming up, she does her best to keep him focused and driven... even if that means withholding sex from him. As sexual tensions rise, so do past discrepancies the couple thought buried, putting extra stress on both their romantic and professional lives. Stuck in the center of the action, Olivia and Seth fight for air as they collide face first with the tough world of professional MMA.", "hash": "a6b644b5-7687-420b-ab91-f02e9a421dc7"}, {"title": "Forever Consumed (Consumed #3)", "author": "Skyla Madi", "pgs": 32, "sum": "Storyline: \nForever Consumed (Consumed #3) This is it. My revenge. I can taste it on my tongue, it's sweet and it's addictive. I've worked way too hard to settle for second best and I will come out on top. ------ Seth Marc is back and training harder than ever before to redeem his loss to Don Russell. Tensions are high but stakes are higher as MMAC founder, Matt Somers, forces Seth and Don to train under the same roof. Though Matt Somers believes it's only good fun to provoke the two for publicity, he doesn't realize just how serious the situation is. With Olivia by his side, Seth Marc pushes himself to his limits and struggles to keep opponent, Don Russell, out of his head as they fight it out one last time.", "hash": "ecb7827f-8b19-4db9-b6fe-bf8318cff5e9"}, {"title": "Shock & Awe (Sidewinder #1)", "author": "Abigail Roux", "pgs": 14, "sum": "Storyline: \nShock & Awe (Sidewinder #1) After barely surviving a shootout in New Orleans, Sidewinder medic Kelly Abbott has to suffer through a month of recovery before he can return home to Colorado. He’s not surprised when fellow Sidewinder Nick O’Flaherty stays with him in New Orleans. Nor is he surprised when Nick travels home with him to help him get back on his feet—after all, years on the same Marine Force Recon team bonded the men in ways that only bleeding for a brother can. He’s very surprised, though, when Nick humors his moment of curiosity and kisses him. Nick knows all of Kelly’s quirks and caprices, so the kiss was a low-risk move on his part . . . or so he thought. But what should’ve been a simple moment unleashes a flood of confusing emotions and urges that neither man is prepared to address. Now, Kelly and Nick must figure out what they mean to each other—friends and brothers in arms, or something even deeper?—before the past can come back to ruin their tenuous future.", "hash": "a74cd86b-9df8-4f9b-9bdc-154b20b9cf58"}, {"title": "Cross & Crown (Sidewinder #2)", "author": "Abigail Roux", "pgs": 29, "sum": "Storyline: \nCross & Crown (Sidewinder #2) When Nick O'Flaherty arrives at the scene of a double homicide to find he has a witness to the crime, he thinks it’s his lucky day. But when he realizes his witness is suffering from amnesia and can’t even remember his own name, Nick wishes he’d gone with his gut and put in for vacation time. Then Nick’s boyfriend and former Recon teammate, Kelly Abbott, joins him in Boston, and Nick finds his hands a little too full as the case and his personal life collide. The witness he’s dubbed “JD” is being tailed by Julian Cross, a retired CIA hitman. To complicate matters further, JD forms an attachment to Nick that Nick struggles not to respond to as they search for the key to JD’s identity. Trying to determine whether JD is friend or foe as they investigate the crime puts them on the trail of a much older mystery. When multiple attempts are made on their lives, Nick is forced to turn to old enemies and new allies to solve a centuries-old crime before he and Kelly get added to the history books.", "hash": "d9a22ebb-fac9-44e9-9539-c9170348f43b"}, {"title": "A Beautiful Lie (Playing with Fire #1)", "author": "Tara Sivec", "pgs": 55, "sum": "Storyline: \nA Beautiful Lie (Playing with Fire #1) He saw her first, but his friend made the move. She settled for the safer choice, but her heart knew the truth. They love, they crave, they lie. Garrett McCarthy, Annabelle Parker, and Milo Roberts were as close as friends could get. They shared in each other's joy during graduations, promotions, and engagements. They consoled one another through heartache and loss. When one of the friend's life is tragically cut short, it's up to the two left behind to pick up the pieces and find out the truth - no matter the cost. As they slowly start to uncover the nature of his deception, and the very powerful people behind it, they begin to question everyone and everything, even themselves. Everyone has secrets - some do it for love while others do it for power. Those secrets can change perceptions, alter reality and sometimes destroy lives. What do you do when you find out your whole life has been a lie?", "hash": "661a562a-ca27-4641-957e-66fa1fd4d83a"}, {"title": "Because of You (Playing with Fire #2)", "author": "Tara Sivec", "pgs": 35, "sum": "Storyline: \nBecause of You (Playing with Fire #2) Brady Marshall has made a career of playing it safe. When he decides to do something rash and becomes a Navy SEAL, he thinks he's finally escaped the rigid structure of the high society life his parents forced down his throat. All he does is trade in one set of rules for another. He follows military protocol to a T, but it still results in the death of an entire team of Navy SEALS and puts his best friends directly in harm's way. He’s struggled to stay afloat and not drown in grief, guilt, and booze, but he's losing that battle quickly. When his baby sister flees her abusive husband and shows up on his doorstep with his young niece in tow, he has no choice but to clean up his act. He will stop at nothing to protect them and never let them down again, even if it means taking a job that goes against everything he believes in. If protecting a pop star princess who thinks she's better than everyone means he can keep a roof over their head, what other choice does he have? Layla Carlysle has lived a life of luxury. She's been a star since the young age of fifteen, and every record she releases shoots straight to the top of the charts. She has people surrounding her every single day telling her how amazing she is, how beautiful she is, and how lucky she is, but she’s never felt more alone in her entire life. She wants nothing more than to break free and do what she really wants to do: write her own music, sing her own songs, and find a way to finally be happy with her life. The only thing standing in her way is her mother, Eve Carlysle. Eve has controlled every single aspect of her daughter’s life and will stop at nothing to achieve fame and fortune, even if that means using her daughter to get there. When an overly-amorous fan’s letters become increasingly more sinister, Brady will have to suck up his opinion of how the other half lives to take the job seriously. The pair will need to learn to trust each other and put aside their differences before the letters become a reality and someone’s life is in jeopardy. Brady has been to hell and back, and he refuses to let anyone else get close to him again. Layla has never lived her life for herself, and the emptiness is threatening to break her for good. Sometimes our lives are already planned for us, but because of you, all of that could change in an instant.", "hash": "6a97111c-d221-440d-b536-70707b0a6e44"}]