[{"title": "Worn Me Down (Playing with Fire #3)", "author": "Tara Sivec", "pgs": 25, "sum": "Storyline: \nWorn Me Down (Playing with Fire #3) “Worn me down like a road. I did everything you told. Worn me down to my knees. I did everything to please.” Austin Conrad has never taken his personal life seriously. As a Navy SEAL, he spends all of his time in dangerous, life-threatening situations. The only way to leave behind the horrors he’s seen throughout his career, is to turn it all off when he gets home. He’s too much of a playboy to settle down; even if he did find a woman he could stand to be around for more than one night, he would never taint her life with the demons of his past. When his best friend and SEAL team member, Brady Marshall asks him to keep an eye on his baby sister, Gwen, Austin figures it will be a walk in the park. The only thing Austin likes more than flirting his way under a beautiful woman’s skin, is walking away with a smile on his face. Austin never expects that the single mom and her little girl will be the ones getting under his skin. Gwen Stratford knows all too well about living in a nightmare. After taking her daughter and fleeing from her abusive husband in the middle of the night several months ago, she’s worked hard to get her life back on track and forget about the man who tried to break her. Growing up under the iron thumb of her parents and then moving right on with a man who ruled their marriage with his fists, Gwen is finally able to breathe and live her life the way she wants. When scary, mysterious things begin to happen to Gwen and her daughter, she realizes you can never outrun your past; it always has a way of catching up with you. As she struggles with the desire to keep her newfound independence, she knows she won’t be able to protect herself and her child alone. She’ll need to lean on the one man who drives her crazy. Can Gwen really put her trust in a man who thinks life is one big joke, or will he be just another man in her life who tries to wear her down?", "hash": "26144475-9d43-4df0-82e5-fb2931c6d023"}, {"title": "Burned ", "author": "Tara Sivec", "pgs": 22, "sum": "Storyline: \nBurned (The Ignite Trilogy #1) Seventeen years old when he broke my heart. Seventeen days later when another picked up the pieces. Seventeen years together. Seventeen thousand problems. Seventeen days of reliving my past and finding a new future. Seventeen minutes until it all went up in flames. Seventeen breaths until I took my last. This is my story…and it’s going to burn.", "hash": "8b83d774-3754-4c2c-ab11-22ede7077a9e"}, {"title": "Drive Me Crazy (Holland Springs #1)", "author": "Marquita Valentine", "pgs": 21, "sum": "Storyline: \nDrive Me Crazy (Holland Springs #1) Twenty-four year old Troublemaker Extraordinaire, Melanie Ann Smith, isn’t asking for much out of life: a house without wheels, to travel further than her home state and her best friend’s older brother, Carter Ambrose. Only three things stand in her way: juggling all of her odd jobs, keeping her daddy from gambling away all of their money and getting Carter to see her as a woman. NASCAR racer, Carter Ambrose, has finally decided to take his doctor’s advice and find a new occupation before another wreck on the track kills him. Only his doctor hadn’t counted on his little sister’s best friend, Melanie Ann Smith, crashing his weeks of solitude with her short skirts and platform heels. And that’s not the least of his problems. His mother has decided that she wants grandchildren and the only woman that's good enough for the job-his ex-fiance. Soon Melanie and Carter agree to a temporary relationship. One with benefits that is mutually satisfying in every way, or so each believes. And just when they are ready admit their feelings, family secrets are exposed, threatening Melanie and Carter's fragile relationship. Will Carter risk it all for love, or will Melanie be left holding the trophy for second place?", "hash": "873b855d-fafc-48dc-acb8-9c7ea21700da"}, {"title": "Driving to You (Holland Springs #1.5)", "author": "Marquita Valentine", "pgs": 7, "sum": "Storyline: \nDriving to You (Holland Springs #1.5) Finn was supposed to be the rebound guy, the one that got April Billingsworth over her breakup with her fiancé. Only one night turned into two, two nights turned into a week, then months of pure happiness. Now this former bad girl's ready to settle down and go the distance with the man she loves, until the secret Finn's been keeping from her comes to light. There was only one rule, Private Investigator, Finn Kennedy lived by: Do not, under any circumstances, get involved with a client. That is, until he met his latest assignment, April Billingsworth, the current governor's daughter and Charlotte's most notorious bad girl. Not only has he broken his rule, but April has discovered his secret-he's been keeping tabs on her and reporting back to her father. Devastated by the truth, April leaves Finn and tries to go on with her life, without the lying bastard. But Finn has other plans, he's determined to win April back. And this time, nothing's going to stand in his way.", "hash": "d0a84139-60a6-4c72-8270-3530a79ffe0d"}, {"title": "Twice Tempted (Holland Springs #2)", "author": "Marquita Valentine", "pgs": 37, "sum": "Storyline: \nTwice Tempted (Holland Springs #2) Born into wealth and power, Christian Romanov is Hollywood’s favorite bad boy with a golden touch…until the day his agent receives pictures of the movie star celebrating his birthday in a not-so-legal way. Now he’s been ordered to find a small-town girl to be seen with in order to improve his partying image. He agrees, but for an entirely different reason-to protect the reputation of an organization that helps get teens off the street and back into the school. Not only is he the anonymous donor that's been solely supporting the organization since its inception, he's slated to be their newest spokesman. Zoe Ambrose is a hopeless romantic masquerading as a realist. But she’s also a successful novelist, trying to fit herself into a staid life when what she craves is the adventure she found one night in the arms of a playboy who never knew her name. When her successful crime series is optioned by a major studio, she travels to Las Vegas to find that the prince of her fantasies and single night of pleasure is the main contender for the male lead. But for four years Zoe has been publicly eviscerating the man who left her stranded that night—he’s the villain in her series! Now the movie star doesn't recognize her, and Zoe is determined to protect her heart this time. When Christian braves the small town of Holland Springs and Zoe’s overprotective family to win the girl of his dreams, he finds that his Hollywood skills might not cut it—and learns a shocking truth he never imagined. Can he can tempt her again and finally give her the epic love story she has refused to write for herself?", "hash": "9362ea31-99af-453e-ad98-5b361862c799"}, {"title": "Third Time's a Charm (Holland Springs #3)", "author": "Marquita Valentine", "pgs": 37, "sum": "Storyline: \nThird Time's a Charm (Holland Springs #3) To the world, Alexander \"Sasha\" Romanov is a sexy, globe-trotting playboy that parties with the very rich and famous. But behind the façade exists a ruthless man willing and able to destroy anyone and anything standing in the way of his ultimate goal ...until he meets Rose Holland. Twenty-three year old Rose Holland is perfectly content with her role as Holland Springs' most notorious woman. Despite her less than stellar reputation, themen and women of her small town can't help but shop in her store and ask for love advice. It's tradition, after all. Then Sasha Romanov appears in town, with his heated looks and charming smiles that seem to be for Rose only. A series of unfortunate events leads to close quarters for Rose and Sasha. Extremely close. And neither can stop themselves from giving into their secret desires. But when the real reason Sasha is in Holland Springs comes to light, Rose's world comes crashing down. Can these two enemies-to-lovers and then back-to-enemies again come together to save one another?", "hash": "6632a594-e55d-4240-b84f-342ef455ec59"}, {"title": "His Christmas Wish (Holland Springs #3.5)", "author": "Marquita Valentine", "pgs": 10, "sum": "Storyline: \nHis Christmas Wish (Holland Springs #3.5) There's no time like the Present... War Hero, Joaquin Morales, returns to Holland Springs after years of estrangement from his family...and his wife. His new mission: To convince his wife that they have a Future together. Falling in love with her husband for the second time was *not* a part of Sage Caswell's plans for the Holiday Season. She's convinced that what they had belongs in the Past. With the help of a little Christmas magic (and a well-timed snowstorm), can Joaquin and Sage's dreams come true?", "hash": "b91e1a28-9928-44a9-9c74-9831d6016322"}, {"title": "Just Desserts (Holland Springs #4)", "author": "Marquita Valentine", "pgs": 37, "sum": "Storyline: \nJust Desserts (Holland Springs #4) British Billionaire and modern day earl of Spenserfield, Sebastian Romanov only wants one thing in life: To reclaim his position as president of Romanov Industries. But first he has to clean up his reputation to convince the Board that he's a dependable bloke who's willing to put the company above everything, including his personal life. Finally given an excuse to sort things out with his estranged twin brother, he boards a jet to Holland Springs, North Carolina, never dreaming he'd find the solution to his all his problems in the town's sexy caterer, Daisy Barnes. Daisy Barnes, owner of The Sweet Spot, has plans. Plans that don't include posing as some arrogant-yet sexy as hell-earl's fiancee. But when unexpected insurance bills -to the tune of two hundred and fifty thousand dollars-from her mother's unsuccessful battle with cancer come due, she's forced to accept his offer and his money. Only problem for Daisy-underneath that cold exterior is a man that can set her on fire with just one touch. As Sebastian and Daisy spend more time together, they find it harder and harder to not give into temptation. Soon neither can tell where the fake romance ends and true love begins...", "hash": "230c26eb-4079-4f4d-ac19-23cd49ba21ff"}, {"title": "Not Over You (Holland Springs #5)", "author": "Marquita Valentine", "pgs": 23, "sum": "Storyline: \nNot Over You (Holland Springs #5) Summer Holland is set on one thing--convincing her childhood sweetheart *and* local preacher's son, Gabriel Edwards, to marry her so she can get back the daughter she gave up for adoption. She’s always been able to count on him to rescuing her when she needed it most, but this time is different… there’s a new woman in Gabriel’s life. Only, Summer's not going to let a little thing like that get in her way. It would be a marriage of *major* inconvenience… There’s only been one woman for Gabriel Edwards—Summer Holland, the daughter of Holland Spring's most notorious woman. But unless Summer needs cash, food or a place to stay, she wants nothing to do with him. He’s done playing her knight in shining armor. He’s finally found the woman to settle down with—the town’s newest librarian. She’s smart and sweet, and wholly in love with him. Nothing and no one will get in the way of his plans... until, that is, Summer comes home to Holland Springs, and needs his help once more. Determined to protect her heart, Summer tries to keep Gabriel at arm's length, but with one hot kiss, she realizes that not only did she get more than she bargained for, but she might not be over him.", "hash": "b86a1f20-bb25-4eaa-bfdb-747c27b47acd"}, {"title": "Hopeless (Hopeless #1)", "author": "Colleen Hoover", "pgs": 55, "sum": "Storyline: \nHopeless (Hopeless #1) Sometimes discovering the truth can leave you more hopeless than believing the lies… That’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried. Sky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever.", "hash": "1b57f748-9c66-4521-92d0-27490d49da4f"}]