[{"title": "Losing Hope (Hopeless #2)", "author": "Colleen Hoover", "pgs": 43, "sum": "Storyline: \nLosing Hope (Hopeless #2) In Hopeless, Sky left no secret unearthed, no feeling unshared, and no memory forgotten, but Holder’s past remained a mystery. Still haunted by the little girl he let walk away, Holder has spent his entire life searching for her in an attempt to finally rid himself of the crushing guilt he has felt for years. But he could not have anticipated that the moment they reconnect, even greater remorse would overwhelm him… Sometimes in life, if we wish to move forward, we must first dig deep into our past and make amends. In Losing Hope, bestselling author Colleen Hoover reveals what was going on inside Holder’s head during all those hopeless moments—and whether he can gain the peace he desperately needs.", "hash": "70ca577a-182a-4fdc-9d8f-6e010e310345"}, {"title": "Finding Cinderella (Hopeless #2.5)", "author": "Colleen Hoover", "pgs": 17, "sum": "Storyline: \nFinding Cinderella (Hopeless #2.5) A chance encounter in the dark leads eighteen-year-old Daniel and the girl who stumbles across him to profess their love for each other. But this love comes with conditions: they agree it will only last one hour and it will only be make-believe. When their hour is up and the girl rushes off like Cinderella, Daniel tries to convince himself that what happened between them only seemed perfect because they were pretending it was perfect. Moments like that with girls like her don’t happen outside of fairytales. One year and one bad relationship later, his disbelief in insta-love is stripped away the day he meets Six: a girl with a strange name and an even stranger personality. Daniel soon realizes the way he pretended to feel about Cinderella and the way he really feels about Six may not be so different after all. Especially when the two loves of his life end up being one in the same. Unfortunately for Daniel, finding Cinderella doesn’t guarantee their happily ever after…it only further threatens it.", "hash": "1aed301b-b70c-4fce-b278-7447a52a6c12"}, {"title": "Slammed (Slammed #1)", "author": "Colleen Hoover", "pgs": 33, "sum": "Storyline: \nSlammed (Slammed #1) Following the unexpected death of her father, 18-year-old Layken is forced to be the rock for both her mother and younger brother. Outwardly, she appears resilient and tenacious, but inwardly, she's losing hope. Enter Will Cooper: The attractive, 21-year-old new neighbor with an intriguing passion for slam poetry and a unique sense of humor. Within days of their introduction, Will and Layken form an intense emotional connection, leaving Layken with a renewed sense of hope. Not long after an intense, heart-stopping first date, they are slammed to the core when a shocking revelation forces their new relationship to a sudden halt. Daily interactions become impossibly painful as they struggle to find a balance between the feelings that pull them together, and the secret that keeps them apart.", "hash": "f55b6471-c790-4bdd-b809-570c281bec29"}, {"title": "Point of Retreat (Slammed #2)", "author": "Colleen Hoover", "pgs": 36, "sum": "Storyline: \nPoint of Retreat (Slammed #2) Hardships and heartache brought them together… now it will tear them apart. Layken and Will have proved their love can get them through anything; until someone from Will’s past re-emerges, leaving Layken questioning the very foundation on which their relationship was built. Will is forced to face the ultimate challenge…how to prove his love for a girl who refuses to stop ‘carving pumpkins.’", "hash": "b234a142-ab0b-4187-86c9-fe0f3fbbddd4"}, {"title": "This Girl (Slammed #3)", "author": "Colleen Hoover", "pgs": 39, "sum": "Storyline: \nThis Girl (Slammed #3) Layken and Will’s love has managed to withstand the toughest of circumstances and the young lovers, now married, are beginning to feel safe and secure in their union. As much as Layken relishes their new life together, she finds herself wanting to know everything there is to know about her husband, even though Will makes it clear he prefers to keep the painful memories of the past where they belong. Still, he can’t resist his wife’s pleas and so he begins to untangle his side of the story, revealing for the first time his most intimate feelings and thoughts, retelling both the good and bad moments, and sharing a few shocking confessions of his own from the time when they first met.", "hash": "9ef85061-e5c9-4de2-a532-c0aaf686844c"}, {"title": "Flukes ", "author": "Nichole Chase", "pgs": 22, "sum": "Storyline: \nMeena has a secret guarded closely by her family—a secret as dangerous as the sea and buried just as deep. When court-appointed community-service workers are assigned to Flukes, the family-owned animal sanctuary, everyone is on high alert. It doesn’t help that Meena finds herself attracted to sexy-as-sin Blake Weathering, one of the new workers. If he wasn’t so distracting, she might be able to land Flukes a much-needed cruise-line contract. Blake Weathering, the first in his family to attend public school, has developed a tough image. Unfortunately, it lands him in trouble. Now banned from his high school graduation ceremony, getting his diploma is dependent upon a community-service gig cleaning up fish crap. No diploma, no trust fund fortune—and no way to escape his overbearing father. The last thing he needs is the distraction of a mysterious girl with teal eyes who pulls at his heartstrings. When Blake discovers Meena’s secret, they are both thrown into a desperate search for information about her past. Two worlds pull them in opposite directions, and they will have to fight to hold on to all that really matters.", "hash": "abb307a1-63e7-4006-b2cb-8b4527dc3e2f"}, {"title": "The Write Stuff ", "author": "Tiffany King", "pgs": 24, "sum": "Storyline: \nThe Write Stuff (A Write Stuff Novel) Twenty-two-year-old historical romance writer Nicole Blake, or N.S. Blake to her readers, hasn't taken an official poll, mind you, but she is convinced she may be the only romance author on the planet who is still a card-carrying member of the virgin club.Not that she hasn't tried to end her membership. Life just keeps finding pesky ways to interfere. With no prospects on the horizon, Nicole begins to feel like the closest she will ever get to experiencing a man is within her own stories. Opportunity presents itself in the form of hot-as-sin-on-a-lollipop-stick bartender/premed student Alec Petropoulos, who agrees to be the cover model for her upcoming book. Sparks fly instantly between them, and Nicole begins to entertain the possibility that she's finally found the right guy to hand over her tattered V-card. Alec has all the makings for a perfect one-night-stand candidate except, much to Nicole's surprise, he seems to be the only man in existence not interested in bagging a virgin. Stuck between a rock and a stubborn male, what's a virgin to do? Seduce him, of course. How hard could it be? If it works for the characters in her stories, why wouldn't it work for her? After all, what happens under the cover…stays under the cover.", "hash": "a8ab553a-6bf8-480f-b34a-52a2e65a0846"}, {"title": "Miss Me Not ", "author": "Tiffany King", "pgs": 25, "sum": "Storyline: \nMiss Me Not is a beautiful story of self-discovery, forgiveness, caring, and love. Madison Hanson's past demons have given her a shadow of an existence with little hope. With the sudden tragic death of a fellow student, Madison questions her own life choices, and is now forced to evaluate everything she thought she believed in. When fate intervenes and partners her with Dean Jackson, a popular \"all around good guy\" from school, Madison gets a glimpse of a life that is filled with sunshine that has the power to break through the darkness she has cloaked herself in. With Dean's help, Madison discovers a desire to finally step out of the shadows, and embrace life and all its gifts.", "hash": "0eb53674-5191-455d-9824-92fbea6c3e80"}, {"title": "No Attachments (Woodfalls Girls #1)", "author": "Tiffany King", "pgs": 24, "sum": "Storyline: \nNo Attachments (Woodfalls Girls #1) ** Recommended for ages 17+ due to sexual situations, language and mature subject matter ** Ashton Garrison walked away from a privileged life in order to hide from the one thing she's not willing to face. She knows she left behind a trail of pain, but in the long run, her betrayal will hurt less than the truth. She now has one goal: Live life to the fullest with no regrets and no attachments. She has high hopes that a move to new surroundings will provide the escape she desires, but what Ashton doesn't count on is how fate always seems to find a way to screw up any good plan. Sometimes, when love comes knocking, the pull is too strong not to answer. Suddenly, what she thought she wanted to escape from is what Ashton now wants more than anything. Nathan Lockton has one mission: find his target and complete the task he was hired to do—no attachments and no emotion necessary. He's done it over and over again. What he thought was a typical lost-and-found job has turned into a life examining moment as Nathan is forced to deal with something he has always ignored--his feelings. Now faced with a decision, Nathan must choose to either follow his heart or complete the job. Love can come when you least expect it. The question is: If the odds are stacked against you, how far are you willing to go for the one you love?", "hash": "3612c724-2050-4499-89d8-dabca2002a8b"}, {"title": "Cross Country Christmas (Woodfalls Girls #1.5)", "author": "Tiffany King", "pgs": 10, "sum": "Storyline: \nCross Country Christmas (Woodfalls Girls #1.5) With the holiday season upon her, Jamie Foster is once again stressed about making her yearly visit back home to Woodfalls, still single. Fate intervenes in the form of Grant Johnson, a boy she grew up with, who catches the same flight while returning home from a business trip. When a malfunction sends their plane crashing down on the runway upon takeoff, Jamie and Grant decide to rent a car and make the nine-hundred-mile drive home together. Ironically for them, anything that can go wrong does as they face one hysterical hurdle after another. Christmas may finally bring Jamie the gift of love she has always wanted if she and Grant can manage to overcome a few obstacles along the way. Ho-ho-ho!", "hash": "bf32c9b5-bdc6-428c-8ad1-0f781bcbef67"}]