[{"title": "Misunderstandings (Woodfalls Girls #2)", "author": "Tiffany King", "pgs": 25, "sum": "Storyline: \nMisunderstandings (Woodfalls Girls #2) Just when she thought things were going up… Two years after a devastating breakup, Brittni Mitchell has moved on from Justin Avery—or so she tells herself. But when she returns to Seattle for her best friend’s engagement party, Brittni finds herself the victim of a disastrously timed elevator breakdown. She’s trapped with the last person she wants to face, and forced to recount the past she desperately wants to forget. She’s going to have to look back… When Brittni left her podunk hometown for a big city college experience at the University of Washington, hooking up with a guy like Justin Avery was not part of her plan. Between Justin’s attention-grabbing tattoos, cigarette smoking, and bad boy attitude Brittni quickly chalked him up as \" Mr. Wrong.” But his charm was unrelenting, and Brittni’s decision to give Justin a chance quickly turned into the worst choice she ever made. So that she might be able to move forward. Now she’s stuck with Justin—literally—and the complicated web of misunderstandings that tied up the truth for two years is about to unravel.", "hash": "eb428133-f148-4263-b111-9f8e31ed18b6"}, {"title": "The Perfect Game (The Perfect Game #1)", "author": "J. Sterling", "pgs": 42, "sum": "Storyline: \nThe Perfect Game (The Perfect Game #1) He's a game she never intended to play. And she's the game changer he never knew he needed. The Perfect Game tells the story of college juniors, Cassie Andrews & Jack Carter. When Cassie meets rising baseball hopeful Jack, she is determined to steer clear of him and his typical cocky attitude. But Jack has other things on his mind... like getting Cassie to give him the time of day. They're both damaged, filled with mistrust and guarded before they find one another (and themselves) in this emotional journey about love and forgiveness. Strap yourselves for a ride that will not only break your heart, but put it back together. Sometimes life gets ugly before it gets beautiful... This is a MATURE YOUNG ADULT/NEW ADULT novel Suitable for ages 17+ Contains strong language, sexual situations and references", "hash": "b6645d00-5873-4432-9e88-ea641b2ffb03"}, {"title": "The Game Changer (The Perfect Game #2)", "author": "J. Sterling", "pgs": 43, "sum": "Storyline: \nThe Game Changer (The Perfect Game #2) Jack appeared at my door last night after six months of no communication wearing a Mets jersey and holding a dozen red roses. He told me he was sorry, that he loved me, and that he would earn my trust again. It took everything in me to not fall apart at the mere sight of him. I wanted to take him back into my life, but I needed to know that this time it would be forever… In J. Sterling’s highly anticipated follow-up to her USA Today bestselling novel The Perfect Game, Jack and Cassie quickly realize that their new lifestyle can often be cruel and unforgiving. Their happiness is put to the test as the past is never truly far behind. How do you stay together when the world's trying to tear you apart?", "hash": "cfe9d5e9-6e59-4a5a-8108-4e4a2e63d46b"}, {"title": "The Sweetest Game (The Perfect Game #3)", "author": "J. Sterling", "pgs": 34, "sum": "Storyline: \nThe Sweetest Game (The Perfect Game #3) This is the third (and final) installment in Jack & Cassie's story! “It’s one hell of a sledgehammer to the chest when your baseball career comes to an end. It’s like you finally realize that baseball never loved you back. All the sleepless nights, the hours spent at the gym trying to stay fit, the conditioning, the training, the mental preparation, the holiday’s missed, the birthday’s passed, the memories you didn’t get to make with your family…all for what? It’s not like baseball lost any sleep over you. She didn’t stay awake for nights on end trying to figure out how to make you a better player. She didn’t care. Baseball’s a business. A sport. A game. And as much as my entire life has been wrapped up in it, it’s time to let it go.” - Jack Carter", "hash": "5305ce25-b1a6-4ad4-8c35-cd96bec184f3"}, {"title": "In Dreams (The Dream #1)", "author": "J. Sterling", "pgs": 31, "sum": "Storyline: \nIn Dreams (The Dream #1) When Katherine Johns starts dreaming about a boy she doesn't know, her college roommate Taylor is determined to find him. Convinced he must exist, Taylor is relentless... until she finds out exactly WHO the mysterious stranger really is. The realization rocks the girls to their core and sends them down a path of unimaginable heartbreak as they learn to navigate their new reality. Follow Katherine & Taylor's journey through love, friendship and tragedy in the first book of this emotionally captivating Young Adult series.", "hash": "1b93458c-b7b0-457b-a4ff-436407a423b3"}, {"title": "Crash into You (Loving on the Edge #1)", "author": "Roni Loren", "pgs": 44, "sum": "Storyline: \nCrash into You (Loving on the Edge #1) Brynn LeBreck has dedicated herself to helping women in crisis, but she never imagined how personal her work would get, or where it would take her. Her younger sister is missing, suspected to be hiding from cops and criminals alike at a highly secretive BDSM retreat-a place where the elite escape to play out their most extreme sexual fantasies. To find her, Brynn must go undercover as a sexual submissive. Unfortunately, The Ranch is invitation only. And the one master who can get her in is from the darkest corner of Brynn's past. Brynn knows what attorney Reid Jamison is like once stripped of his conservative suit and tie. Years ago she left herself vulnerable only to have him crush her heart. Now she needs him again. Back on top. And he's all too willing to engage. But as their primal desires and old wounds are exposed, the sexual games escalate-and so does the danger. Their hearts aren't the only things at risk. Someone else is watching, playing by his own rules. And his game could be murder.", "hash": "2c224da8-5d4d-4b94-a0a9-099e930a6c1b"}, {"title": "Melt into You (Loving on the Edge #2)", "author": "Roni Loren", "pgs": 49, "sum": "Storyline: \nMelt into You (Loving on the Edge #2) Her first love has returned, and he's brought a friend... After running away from home and the boy who broke her heart, Evan Kennedy has kick-started the perfect new life with her celebrity fiancé. So what if said fiancé prefers guys? She knew the deal when they got engaged. And with her ticket to The Ranch, an exclusive resort where any fantasy can be satisfied, she can find someone to fulfill her less-than-traditional desires on the side. She just never expected that man to be Jace Austin, her old heart-breaker—all grown up, hard-bodied, and holding out a collar. She knows it’s a world-class bad idea—especially since Jace has brought along his buddy Andre, who’s every bit as irresistible. But if they can stick to the no-strings rules, so can she. Too bad Jace has never been so good with rules. Evan is convinced “forever” is a word used only in greeting cards, but Jace and Andre have one last fantasy of hers left to fulfill. It’s time to go big or go home. And neither man has ever been a fan of going home.", "hash": "7559a07f-a3e0-442d-8b64-605a13f43bbf"}, {"title": "Fall into You (Loving on the Edge #3)", "author": "Roni Loren", "pgs": 45, "sum": "Storyline: \nFall into You (Loving on the Edge #3) He’ll do anything for you. But you’d better say please. When tomboy sports reporter Charli Beaumonde loses a dream TV job because she’s not girly enough for primetime, she’s determined to land a big scoop and prove her boss made a mistake. But when she gets too close to a football scandal and finds her life threatened, Charli accepts an offer from family friend Grant Waters to hide out at his place—even if Grant predicts nothing but trouble from his buddy’s hard-headed, uncompromising, irrepressible, younger sister. There’s one more problem… Grant’s “place” is The Ranch, a BDSM resort in Texas, and he’s used to being in charge —even if that means trying to keep Charli in line. But much to Grant’s surprise, she’s intrigued—even envious—of his trainees. They’re the epitome of what she’s never been: sexy, beguiling, and totally irresistible to a man. Still, Grant doesn’t believe for a minute that the sharp-tongued Charli has it in her to be anyone’s submissive. But Charli’s already on her knees vying for the chance to prove that even the Master can be wrong sometimes.", "hash": "87b4b02b-bdd3-402f-8267-011f28f0014e"}, {"title": "Caught Up in You (Loving on the Edge #4)", "author": "Roni Loren", "pgs": 46, "sum": "Storyline: \nCaught Up in You (Loving on the Edge #4) The girl who has spent her life running is about to be caught . . . by love. After a shaky past, Kelsey LeBreck’s future is looking good. She’s been saving money for culinary school with her earnings from The Ranch, a private BDSM resort. Even better, she’s landed a day job where she can practice baking and flirt with her favorite customer. However, having secret fantasies about Wyatt Austin is where it has to end. If there’s one thing Kelsey knows can derail her, it’s a relationship. But when a danger from her past threatens to steal her fresh start, the intense executive may be the only one who can help her. Wyatt doesn’t have room on his agenda for dating, but something about the pretty young waitress stirs desires he thought were long buried. So when he needs someone to pose as his girlfriend at an important business retreat and finds out Kelsey needs to go off the grid for a while, he can’t resist making her an offer. Soon, Kelsey learns that Wyatt’s power in the boardroom is no match for his power in the bedroom, and she wonders if her heart will survive. Because Wyatt Austin is a man who gets what he wants, and now he wants her.", "hash": "bec2dc46-92f2-416e-8904-14340b4c48f1"}, {"title": "One Dance with a Duke (Stud Club #1)", "author": "Tessa Dare", "pgs": 54, "sum": "Storyline: \nOne Dance with a Duke (Stud Club #1) In One Dance with a Duke--the first novel in Tessa Dare's delightful new trilogy--secrets and scandals tempt the irresistible rogues of the Stud Club to gamble everything for love. A handsome and reclusive horse breeder, Spencer Dumarque, the fourth Duke of Morland, is a member of the exclusive Stud Club, an organization so select it has only ten members--yet membership is attainable to anyone with luck. And Spencer has plenty of it, along with an obsession with a prize horse, a dark secret, and, now, a reputation as the dashing \"Duke of Midnight.\" Each evening he selects one lady for a breathtaking midnight waltz. But none of the women catch his interest, and nobody ever bests the duke--until Lady Amelia d'Orsay tries\"\"her luck. In a moment of desperation, the unconventional beauty claims the duke's dance and unwittingly steals his heart. When Amelia demands that Spencer forgive her scapegrace brother's debts, she never imagines that her game of wits and words will lead to breathless passion and a steamy proposal. Still, Spencer is a man of mystery, perhaps connected to the shocking murder of the Stud Club's founder. Will Amelia lose her heart in this reckless wager or win everlasting love?", "hash": "08dfc5ae-b0b1-49ab-b9a2-f769f49569c6"}]