[{"title": "Twice Tempted by a Rogue (Stud Club #2)", "author": "Tessa Dare", "pgs": 50, "sum": "Storyline: \nTwice Tempted by a Rogue (Stud Club #2) The daring members of the Stud Club are reckless gamblers and no strangers to risk--until love raises the stakes in Twice Tempted by a Rogue. Luck is a double-edged sword for brooding war hero Rhys St. Maur. His death wish went unanswered on the battlefield, while fate allowed the murder of his good friend in the elite gentlemen's society known as the Stud Club. Out of options, Rhys returns to his ancestral home on the moors of Devonshire, expecting anything but a chance at redemption in the arms of a beautiful innkeeper who dares him to take on the demons of his past--and the sweet temptation of a woman's love. Meredith Maddox believes in hard work, not fate, and romance isn't part of her plan. But when Rhys returns, battle-scarred, world-weary, and more dangerously attractive than ever, the lovely widow is torn between determination and desire. As a deep mystery and dangerous smugglers threaten much more than their passionate reckoning, Meredith discovers that she must trust everything to a wager her heart placed long ago.", "hash": "0a39608b-556f-4619-a8a1-d935a6f1c3ef"}, {"title": "Three Nights with a Scoundrel (Stud Club #3)", "author": "Tessa Dare", "pgs": 50, "sum": "Storyline: \nThree Nights with a Scoundrel (Stud Club #3) In Tessa Dare’s dazzling new trilogy, the men of the Stud Club live and play by their own rules—until passion changes the game. The bastard son of a nobleman, Julian Bellamy is now polished to perfection, enthralling the ton with wit and charm while clandestinely plotting to ruin the lords, ravish the ladies, and have the last laugh on a society that once spurned him. But after meeting Leo Chatwick, a decent man and founder of an elite gentlemen’s club, and Lily, Leo’s enchanting sister, Julian reconsiders his wild ways. And when Leo’s tragic murder demands that Julian hunt for justice, he vows to see the woman he secretly loves married to a man of her own class. Lily, however, has a very different husband in mind.  She’s loved Julian forever, adores the man beneath the rakish façade, and wants to savor the delicious attraction they share—as his wife. His insistence on marrying her off only reinforces her intent to prove that he is the only man for her. Obsessed with catching a killer, Julian sinks back to the gutters of his youth, forcing Lily to reach out with a sweet, reckless passion Julian can’t resist. Can her desire for a scoundrel save them both—or will dangerous secrets threaten more than their tender love?", "hash": "a55da60e-bbdb-410c-bf1f-c581fbd587fb"}, {"title": "Romancing the Duke (Castles Ever After #1)", "author": "Tessa Dare", "pgs": 40, "sum": "Storyline: \nRomancing the Duke (Castles Ever After #1) In the first in Tessa Dare's captivating Castles Ever After series, a mysterious fortress is the setting for an unlikely love . . . As the daughter of a famed author, Isolde Ophelia Goodnight grew up on tales of brave knights and fair maidens. She never doubted romance would be in her future, too. The storybooks offered endless possibilities. And as she grew older, Izzy crossed them off. One by one by one. Ugly duckling turned swan? Abducted by handsome highwayman? Rescued from drudgery by charming prince? No, no, and… Heh. Now Izzy’s given up yearning for romance. She’ll settle for a roof over her head. What fairy tales are left over for an impoverished twenty-six year-old woman who’s never even been kissed? This one.", "hash": "7414d018-6fe5-4f9f-b6fa-197a13dcad9b"}, {"title": "Goddess of the Hunt (The Wanton Dairymaid Trilogy #1)", "author": "Tessa Dare", "pgs": 51, "sum": "Storyline: \nGoddess of the Hunt (The Wanton Dairymaid Trilogy #1) In this lush and seductive novel, exciting new author Tessa Dare takes desire to brazen heights. Ever the bold adventuress, Lucy Waltham has decided to go hunting for a husband. But first she needs some target practice. So she turns to her brother's best friend, Jeremy Trescott, the Earl of Kendall, to hone her seductive wiles on him before setting her sights on another man. But her practice kisses spark a smoldering passion-one that could send all her plans up in smoke. Jeremy has an influential title, a vast fortune, and a painful past full of long-buried secrets. He keeps a safe distance from his own emotions, but to distract Lucy from her reckless scheming, he must give his passions free rein. Their sensual battle of wills is as maddening as it is delicious, but the longer he succeeds in managing the headstrong temptress, the closer Jeremy comes to losing control. When scandal breaks, can he bring himself to abandon Lucy to her ruin? Or will he risk his heart and claim her for his own?", "hash": "523c4ef0-1812-4201-81d7-3510194d3cea"}, {"title": "Surrender of a Siren (The Wanton Dairymaid Trilogy #2)", "author": "Tessa Dare", "pgs": 53, "sum": "Storyline: \nSurrender of a Siren (The Wanton Dairymaid Trilogy #2) New author Tessa Dare takes passion to the high seas in this steamy tale of a runaway bride and a devilishly disarming privateer. Desperate to escape a loveless marriage and society’s constraints, pampered heiress Sophia Hathaway jilts her groom, packs up her paints and sketchbook, and assumes a new identity, posing as a governess to secure passage on the Aphrodite. She wants a life of her own: unsheltered, unconventional, uninhibited. But it’s one thing to sketch her most wanton fantasies, and quite another to face the dangerously handsome libertine who would steal both her virtue and her gold. To any well-bred lady, Benedict “Gray” Grayson is trouble in snug-fitting boots. A conscienceless scoundrel who sails the seas for pleasure and profit, Gray lives for conquest–until Sophia’s perception and artistry stir his heart. Suddenly he’ll brave sharks, fire, storm, and sea just to keep her at his side. She’s beautiful, refined, and ripe for seduction. Could this counterfeit governess be a rogue’s redemption? Or will the runaway heiress’s secrets destroy their only chance at love?", "hash": "dcba5762-8a4b-42d5-b397-e692e1b76efc"}, {"title": "A Lady of Persuasion (The Wanton Dairymaid Trilogy #3)", "author": "Tessa Dare", "pgs": 49, "sum": "Storyline: \nA Lady of Persuasion (The Wanton Dairymaid Trilogy #3) The third novel in the new Regency romance trilogy by the author of Surrender of a Siren finds an incorrigible rake and a husband-hunting lady scheming to seduce each other, but never expecting to fall in love. Original.", "hash": "f2029060-96d7-4480-8dce-16bb9590c7b1"}, {"title": "A Night to Surrender (Spindle Cove #1)", "author": "Tessa Dare", "pgs": 51, "sum": "Storyline: \nA Night to Surrender (Spindle Cove #1) Welcome to Spindle Cove, where the ladies with delicate constitutions come for the sea air, and men in their prime are... nowhere to be found. Or are they? Spindle Cove is the destination of choice for certain types of well-bred young ladies: the painfully shy, young wives disenchanted with matrimony, and young girls too enchanted with the wrong men; it is a haven for those who live there. Victor Bramwell, the new Earl of Rycliff, knows he doesn't belong here. So far as he can tell, there's nothing in this place but spinsters... and sheep. But he has no choice, he has orders to gather a militia. It's a simple mission, made complicated by the spirited, exquisite Susanna Finch—a woman who is determined to save her personal utopia from the invasion of Bram's makeshift army. Susanna has no use for aggravating men; Bram has sworn off interfering women. The scene is set for an epic battle... but who can be named the winner when both have so much to lose?", "hash": "1b143103-4bdf-44f0-87be-5c64d8fbb3fc"}, {"title": "Once Upon a Winter's Eve (Spindle Cove #1.5)", "author": "Tessa Dare", "pgs": 15, "sum": "Storyline: \nOnce Upon a Winter's Eve (Spindle Cove #1.5) Some wallflowers bloom at night... Violet Winterbottom is a quiet girl. She speaks six languages, but seldom raises her voice. She endured bitter heartbreak in perfect silence. The gentlemen aren't beating down her door. Until the night of the Spindle Cove Christmas ball, when a mysterious stranger crashes into the ballroom and collapses at Violet's feet. His coarse attire and near-criminal good looks would put any sensible young lady on her guard. He's wet, chilled, bleeding, and speaking in an unfamiliar tongue. Only Violet understands him. And she knows he's not what he seems. She has one night to draw forth the secrets of this dangerously handsome rogue. Is he a smuggler? A fugitive? An enemy spy? She needs answers by sunrise, but her captive would rather seduce than confess. To learn his secrets, Violet must reveal hers and open herself to adventure, passion, and the unthinkable... Love. Warning: The heroine packs a pistol, the hero curses in multiple languages, and together they steam up a cold winter s night.", "hash": "cca96865-f8f1-4210-a5a9-2e873a4da539"}, {"title": "A Week to Be Wicked (Spindle Cove #2)", "author": "Tessa Dare", "pgs": 49, "sum": "Storyline: \nA Week to Be Wicked (Spindle Cove #2)  When a devilish lord and a bluestocking set off on the road to ruin...time is not on their side. Minerva Highwood, one of Spindle Cove's confirmed spinsters, needs to be in Scotland. Colin Sandhurst, Lord Payne, a rake of the first order, needs to be...anywhere but Spindle Cove. These unlikely partners have one week to     • fake an elopement     • convince family and friends they're in \"love\"     • outrun armed robbers     • survive their worst nightmares     • travel four hundred miles without killing each other All while sharing a very small carriage by day and an even smaller bed by night. What they don't have time for is their growing attraction. Much less wild passion. And heaven forbid they spend precious hours baring their hearts and souls. Suddenly one week seems like exactly enough time to find a world of trouble. And maybe...just maybe...love.", "hash": "2aebc222-0ffe-45cb-93d2-d6aa500f8812"}, {"title": "A Lady by Midnight (Spindle Cove #3)", "author": "Tessa Dare", "pgs": 49, "sum": "Storyline: \nA Lady by Midnight (Spindle Cove #3) A temporary engagement, a lifetime in the making . . . After years of fending for herself, Kate Taylor found friendship and acceptance in Spindle Cove—but she never stopped yearning for love. The very last place she'd look for it is in the arms of Corporal Thorne. The militia commander is as stone cold as he is brutally handsome. But when mysterious strangers come searching for Kate, Thorne steps forward as her fiancé. He claims to have only Kate's safety in mind. So why is there smoldering passion in his kiss? Long ago, Samuel Thorne devoted his life to guarding Kate's happiness. He wants what's best for her, and he knows it's not marriage to a man like him. To outlast their temporary engagement, he must keep his hands off her tempting body and lock her warm smiles out of his withered heart. It's the toughest battle of this hardened warrior's life . . . and the first he seems destined to lose.", "hash": "4ef0c210-a879-42e9-a73c-d5e1cf061737"}]