[{"title": "One with You (Crossfire #5)", "author": "Sylvia Day", "pgs": 149, "sum": "Storyline: \nGideon Cross. Falling in love with him was the easiest thing I've ever done. It happened instantly. Completely. Irrevocably. Marrying him was a dream come true. Staying married to him is the fight of my life. Love transforms. Ours is both a refuge from the storm and the most violent of tempests. Two damaged souls entwined as one. We have bared our deepest, ugliest secrets to one another. Gideon is the mirror that reflects all my flaws ... and all the beauty I couldn't see. He has given me everything. Now, I must prove I can be the rock, the shelter for him that he is for me. Together, we could stand against those who work so viciously to come between us. But our greatest battle may lie within the very vows that give us strength. Committing to love was only the beginning. Fighting for it will either set us free ... or break us apart.", "hash": "b6564b70-886c-425c-8ede-d252f3031fbd"}, {"title": "Captivated by You (Crossfire #4)", "author": "Sylvia Day", "pgs": 47, "sum": "Storyline: \nCaptivated By You: by Sylvia Day (Book 4) | Summary & Analysis This is a Summary & Analysis. The fourth in a series, Sylvia Day’s novel covers the time between Eva's and Gideon Cross' elopement and their official, \"real\" wedding. During this time, only a few close friends know they're already married. While the novel can be read alone, there are many references to events and characters that occur in previous books; reading this instalment would be a richer experience in the context of the other novels. It is much more sophisticated than a traditional romance. The novel examines how a couple reconciles their powerful sexual attraction and their very complex personal needs. Gideon Cross has everything he wants: the most successful business in the world, amazing looks and a gorgeous wife he loves more than anything. However, because of his horrible nightmares and awful flashbacks to childhood abuse, it is hard for him to enjoy any of it. What's more, his psychological demons have made him need to control everything and everyone around him, and this need is threatening to drive away the woman he loves. They try to use sex to solve their problems, but it’s even more complicated than they thought. This companion also includes the following: • Book Review • Story Setting Analysis • Story elements you may have missed as we decipher the novel • Details of Characters & Key Character Analysis • Summary of the text, with some analytical comments interspersed • Discussion & Analysis of Themes, Symbols… • And Much More! This Analysis of the novel fills the gap, making you understand more while enhancing your reading experience.", "hash": "adb5dd62-4c14-4084-98d4-4bf3dd911b7f"}, {"title": "Collin (Forever #4)", "author": "Sandi Lynn", "pgs": 62, "sum": "Storyline: \nThe Forever Trilogy hasn't ended yet...now it's time for Connor & Ellery's son to tell his story... I’d like to introduce myself. My name is Collin Black, and I’m the future CEO of Black Enterprises. At twenty-two years old, I’m living the American dream, or at least my version of it. I’m rich, fit, sexy, and no matter where I go, women are always throwing themselves at me. I love to party, and when I do, it can sometimes lead to trouble. Women. What can I say? One woman broke my heart which led me to close myself off so it could never happen again. I’ve become one of New York’s most eligible bachelors and bad boy. I leave a trail of broken hearts wherever I go. Until her. This is my journey of going through the ups and downs of life as I climb the corporate ladder, heal a broken heart, and discover that there’s more life than what I thought. She. Changed. Everything.", "hash": "454bc8e0-dfbd-459c-ab4c-34fd7dabecc8"}, {"title": "Being Julia (Forever #3.5)", "author": "Sandi Lynn", "pgs": 18, "sum": "Storyline: \nMy name is Julia, and I’m the daughter of Connor and Ellery Black. I may look like Daddy’s little princess, but I’m far from it. My life consists of lying to my parents and sneaking out of the penthouse. My CEO millionaire father seems to think that at the tender age of sixteen, I’m too young to date boys. My mother, the artist, tries to stay neutral and doesn’t say too much. My best friend London and I hang out almost every day. We love to shop, and we try to pick up all the bad boys that our parents wouldn’t approve of. We occasionally get into trouble, but I can usually talk my way out of it, except for the time my father caught me and Brody Sullivan having sex in my bedroom. This is the story of my journey through life, in which I try to figure out who I am, from the time of my sixteenth birthday until the day I marry the man of my dreams, Jake Jensen. My aspirations, dreams, hard work, defiance, and smart mouth are all woven into one thing – me, being Julia!", "hash": "910ed1f1-bb53-4a9a-9543-78fe18d45f49"}, {"title": "Forever Us (Forever #3)", "author": "Sandi Lynn", "pgs": 35, "sum": "Storyline: \nThe story of Connor and Ellery Black continues in the last installment of the Forever Black Trilogy, Forever Us. You took Connor and Ellery’s journey of love, courage, and strength as Ellery’s illness threatened their future in Forever Black. You continued their journey through the eyes of Connor Black in Forever You as you watched them get their happily ever after through marriage and planning for their first child. Join Connor and Ellery once again as they face the challenges of parenthood. Take their journey in Forever Us as they learn to cope with the demands of a new baby, a demanding career, and the onset of new challenges in which Connor and Ellery must confront for the sake of their family.", "hash": "7856f720-70d5-41d0-9386-d67e4d3d35ab"}, {"title": "Forever You (Forever #2)", "author": "Sandi Lynn", "pgs": 42, "sum": "Storyline: \nNew York Times bestselling novel, Forever You is the highly demanded sequel to USA Today’s Bestseller, Forever Black. Connor Black’s life consisted of his company and his use of multiple women. There was never going to be love, relationships, or a fairy-tale life. Emotionally dead and damaged, that stemmed from a personal tragedy, Connor Black vowed never to feel any emotion or fall in love with a woman. That was true until Ellery Lane walked into his life by accident and changed his life forever. He begins experiencing feelings and emotions that he never felt before and finds himself being drawn into her world. You took the journey with Connor and Ellery as their love, courage, and strength were put to the test. You watched their worlds come together through her eyes in Forever Black, and now it's time to take the journey through his in Forever You.", "hash": "94941b34-a7e4-4c21-8108-6d8a75c8318f"}, {"title": "Forever Black (Forever #1)", "author": "Sandi Lynn", "pgs": 35, "sum": "Storyline: \nWhen Ellery moved to New York with her boyfriend, she thought they’d live happily ever after in their small New York apartment. She never thought he’d pack his bags and leave because he “needed space.” With her newfound single status and fear of being alone, Ellery buries herself in her artwork and paintings until one night she helps a mysterious intoxicated stranger get home safely. Little did she know the mysterious stranger is none other than CEO and millionaire Connor Black. After finding Ellery in his kitchen the next morning and assuming she broke his #1 rule about sleepovers, he becomes intrigued, not only by her stubbornness and defiance, but by her kindness. Connor Black, emotionally dead and damaged, that stemmed from a personal tragedy, made a vow to never love or fall in love with a woman, until Ellery Lane walked into his life by accident. After she opens up and shows him her world, Connor starts to feel emotions and feelings he never knew existed. Despite the rumors and warnings regarding Connor Black and his use and misuse of women, Ellery finds herself being drawn into his world. Ellery knows they can never be together because she is harboring a deep secret that could destroy Connor emotionally forever. Join Connor and Ellery as they embark on a journey of courage, love and strength. Will it be enough to save them?", "hash": "850357ee-4eb5-43bc-8b8d-059602d4d2c4"}, {"title": "Storm and Silence", "author": "Robert Thier", "pgs": 248, "sum": "Storyline: \nFreedom—that is what Lilly Linton wants most in life. Not marriage, not a brood of squalling brats, and certainly not love, thank you very much! But freedom is a rare commodity in 19th-century London, where girls are expected to spend their lives sitting at home, fully occupied with looking pretty. Lilly is at her wits’ end—until a chance encounter with a dark, dangerous and powerful stranger changes her life forever... Enter the world of Mr Rikkard Ambrose, where the only rule is: Knowledge is power is time is money!", "hash": "a7f471d5-8259-439a-ac52-06ac55cccd1e"}, {"title": "It Ends with Us", "author": "Colleen Hoover", "pgs": 99, "sum": "Storyline: \nInstant New York Times Bestseller The newest, highly anticipated novel from beloved #1 New York Times bestselling author, Colleen Hoover. Sometimes it is the one who loves you who hurts you the most. Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up—she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true. Ryle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place. As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan—her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.", "hash": "a4efbc1c-7385-4210-abcc-bc57a1f6a736"}, {"title": "Wired (Buchanan-Renard #13)", "author": "Julie Garwood", "pgs": 110, "sum": "Storyline: \nA beautiful computer hacker and a bad-boy FBI agent must collaborate—in more ways than one—in the sizzling new novel from #1 New York Times bestselling author Julie Garwood. Allison Trent doesn’t look like a hacker. In fact, when she’s not in college working on her degree, she models on the side. But behind her gorgeous face is a brilliant mind for computers and her real love is writing—and hacking—code. Her dream is to write a new security program that could revolutionize the tech industry. Hotshot FBI agent Liam Scott has a problem: a leak deep within his own department. He needs the skills of a top-notch hacker to work on a highly sensitive project: to secretly break into the FBI servers and find out who the traitor is. But he can’t use one of his own. He finds the perfect candidate in Allison. Only, there’s one problem—she wants nothing to do with his job and turns him down flat. What Liam doesn’t know is that Allison is hiding secrets that she doesn’t want the FBI to uncover. But Liam will do nearly anything to persuade her to join his team, even break a few rules if that’s what it takes. A temptation that could put his job—and both of their futures—on the line… and longing for more . . .", "hash": "562039c8-5023-44b0-a783-88b4c910d4ab"}]