[{"title": "Surrender (Bound Hearts #1)", "author": "Lora Leigh", "pgs": 12, "sum": "Storyline: \nSurrender (Bound Hearts #1) Book 1 in the Bound Hearts series Cole has wanted Tess for years. And he's warned her of this several times. He's also warned her HOW he wants her. Tied down in his bed, under his domination, surrendering to his desires...", "hash": "67c9c9cc-fe65-41c6-a41e-d79ce938dc77"}, {"title": "Submission (Bound Hearts #2)", "author": "Lora Leigh", "pgs": 11, "sum": "Storyline: \nSubmission (Bound Hearts #2) In her desperation to repair the rift between herself and her daughter, Ella moves back to Virginia, and agrees to allow the ghost of her past back into her life. As a favor to her daughter, she allows James Wyman, Jesse's twin, to stay the week in her new home. James. Dominating. Sexy. Younger. The man that has filled her most secret fantasies, her most forbidden desires. And James is determined Ella won't escape him again. This time, she will submit.", "hash": "9b1dcd1c-89f1-4bdf-91c1-0f42bf1b2797"}, {"title": "Seduction (Bound Hearts #3)", "author": "Lora Leigh", "pgs": 14, "sum": "Storyline: \nSeduction (Bound Hearts #3) Book 3 in the Bound Hearts series Jesse Wyman knows Terrie's reluctance to accept the desires that are a natural part of him. Desires he sees lurking in the darkest depths of her eyes. But Terrie must accept those needs herself. In a bold and risky turn, Jesse dares her to seduce him. Challenges her to accept her needs, to push her own boundaries. She must convince him. She must be willing to risk her heart, her very soul, for the ultimate prize. But is Terrie more daring than even Jesse knew?", "hash": "0b255f26-bcb5-47a0-9f39-b197055dbdf4"}, {"title": "Wicked Intent (Bound Hearts #4)", "author": "Lora Leigh", "pgs": 20, "sum": "Storyline: \nWicked Intent (Bound Hearts #4) Book 4 in the Bound Hearts series. Control has meant everything to Tally Raines. Control of the office she ran as Jesse Wyman's secretary, and now control of Lucian Conover's office as well. But Lucian isn't content to be controlled by his fiery secretary. As a matter of fact, Lucian thinks she needs to loosen up and let the sexy, sensual woman hiding beneath her cool exterior free. And he will dare her to do just that... With a little help.", "hash": "e1916da6-8cd8-4814-b5f7-cb93b3f61a41"}, {"title": "Sacrifice (Bound Hearts #5)", "author": "Lora Leigh", "pgs": 19, "sum": "Storyline: \nSacrifice (Bound Hearts #5) Book 5 of the Bound Hearts series Kimberly has run from Jared for a year now, sensing the weakness he could be to her future. But she never expected the sacrifice he would make for her. One that will rock her soul, and destroy the very foundations of all her beliefs. Her sexuality, her heart, and all she's fought for in the last six years will be tested when an assignment takes her to Jared's farm, and into his bed. There she will learn the true meaning of hunger, of love...as well as the deception and the lies that have governed her life for so long. Anything worth having is worth sacrificing for. Kimberly is about to find out if she can pay the price, and risk not only the inheritance that should be hers, but also her heart to the one man who can still the fires that rage in her soul.", "hash": "bed61566-1a8a-4ef9-9b41-6753008d71b4"}, {"title": "Embraced (Bound Hearts #6)", "author": "Lora Leigh", "pgs": 17, "sum": "Storyline: \nEmbraced (Bound Hearts #6) Marey has run from herself and from Sax for over three years. Lost years, hiding in the home her parents left her, living on the fantasy, too wary to reach out and make real the dreams of the life and man that torment her. Sax Brogan is the embodiment of sinful and sexy-tall, dark, handsome and every inch of him the fantasy of Marey's dreams come to hot, throbbing life. And he's more than ready to claim his woman. Now the time has come for Marey to stop running and embrace not just the fantasy he represents, but also the reality. That is, if her ex-husband will let her live long enough to enjoy it.", "hash": "31115bc1-a4cb-44ba-ae61-f1e6e6158c3b"}, {"title": "Shameless (Bound Hearts #7)", "author": "Lora Leigh", "pgs": 31, "sum": "Storyline: \nShameless (Bound Hearts #7) \"She's a temptation he can't afford.\" Ian Sinclair, the man with no heart, the ultimate Trojan, the untouchable, the unreachable, may just have met his match. As wild as the untamed winds, as innocent as love itself, Courtney's vivacious spirit shines as brilliantly as the brightest star. And he wants nothing more in life than to see the sweet innocence that is so much a part of her survive. That can never happen if he allows her to be drawn into the wicked, sexual excesses of his life. \"He's a hunger she can't deny.\" Courtney Mattlaw has understood her destiny her whole life. Her lifetime of happiness hangs on this moment in time, and forcing a man who feels he is unable to love, to trust his heart. Haunted. Filled with loneliness. Incomplete. Ian is the very breath of her soul. She knows the battle to steal his heart could ultimately destroy them both, but it's a risk she must take. When these two come together, sparks fly and the lust simmering between them ignites in a conflagration that will burn them to their souls and leave them.Shameless.", "hash": "e27fc234-893c-4b74-ad63-71c6625de896"}, {"title": "Forbidden Pleasure (Bound Hearts #8)", "author": "Lora Leigh", "pgs": 50, "sum": "Storyline: \nForbidden Pleasure (Bound Hearts #8) People have heard fleeting rumors about The Club. But only its members—many of them Washington insiders—know the truth: That it’s a place where men can share their women with a carefully selected male partner. Former FBI John “Mac” McCoy resigned his Club membership when he married Keiley Hardin. Tempting and innocent, sweet and sexy, she would never accept Mac’s desire to share her with another man. Still, Mac’s fantasies of sharing Keiley haunt his dreams. And his passions… Unable to wait any longer, Mac invites his best friend, Jethro Riggs, to his home with the intention of drawing Keiley into the pleasures that only be achieved when two men love the same woman. But there’s more going on in Mac’s neck of the woods than he could have possibly imagined. A past case involving a stalker who likes to play games has turned up again—and this time, Keiley is the target. Passion, pleasure, and fear combine as the forbidden becomes an addiction—and none of them can escape…", "hash": "dfb150c5-90cb-41e7-aa80-2dbac00630ae"}, {"title": "Wicked Pleasure (Bound Hearts #9)", "author": "Lora Leigh", "pgs": 54, "sum": "Storyline: \nWicked Pleasure (Bound Hearts #9) Jaci Wright has been running from the Falladay twins, Chase and Cam, for seven years now.  Fears of the desires they arouse in her, and the knowledge of the relationship they wanted with her, spurred her to run, to find a life that kept her traveling the globe and out of their reach. But now life has come full circle.  A new job has placed Jaci in the Sinclair mansion with Chase and Cam.  And they're tired of waiting.  It's hard enough to face accepting a relationship with two men rather than just one, but gossip and the tattered tales of juicy secrets fill the society she now moves within.  Can Jaci face the world knowing she's a lover to both men, or will her hesitancy and her fears destroy her chance of happiness forver?", "hash": "86ffe44e-8d35-40db-9528-745fc16e63ce"}, {"title": "Only Pleasure (Bound Hearts #10)", "author": "Lora Leigh", "pgs": 50, "sum": "Storyline: \nOnly Pleasure (Bound Hearts #10) ince Chase Falladay came to her rescue two years ago, Kia Stanton has never been able to forget the powerful man or the kind of life he leads. So two years later when she runs into Chase and his friend, Khalid, and leaves with them that night, she knows exactly where it is all heading. However, little prepares her for what it is like to be in Chase’s arms, and in his bed. After years of holding back, Kia is finally able to be the woman she’s always dreamed of being in his arms. Kia is a dream Chase has not allowed himself to entertain. Now that he has her, it’s her heart he’s after and he’s determined to win it, no matter the cost. And even though they both agreed that it would only be for pleasure, somewhere along the way it becomes and all-consuming love. Only Pleasure is a sizzling hot, sexy, erotic romance novel from bestselling author Lora Leigh.", "hash": "41f5d84c-c9cf-4549-b6f1-633fca20983b"}]