[{"title": "Guilty Pleasure (Bound Hearts #11)", "author": "Lora Leigh", "pgs": 45, "sum": "Storyline: \nGuilty Pleasure (Bound Hearts #11) Marty Mathews had always known about the secret, forbidden pleasures that the women she had grown up with enjoyed. Women whose husbands or lovers were members of the exclusive “Club,” where they took a selected “third” into their beds.  And there is one man—a dangerous, forbidden man—who is part of this world and who has haunted Marty’s dreams for years.  But she had been the FBI agent assigned to shadow him, making him completely off limits. . .That is until Khalid is cleared and Marty is released from her assignment.  Now, all bets are off. . . The beautiful, fierce Marty Mathews is the one woman Khalid hungers for like no other and is the one woman he dare not let himself have.  His past dogs his every step and danger lurks around every corner.  If he wants to keep her safe, he must stay away from her.  But the power of their desire is something they cannot deny—and once Marty is his, Khalid will do whatever it takes to keep her in his bed and in his arms.", "hash": "8b8f00e1-77f4-4d70-a556-e876f2dc9cc8"}, {"title": "Dangerous Pleasure (Bound Hearts #12)", "author": "Lora Leigh", "pgs": 28, "sum": "Storyline: \nDangerous Pleasure (Bound Hearts #12) Abram Mustafa faces the test of his life and his heart when his terrorist father kidnaps Paige Galbraithe, the one woman who has always been able to touch Abram’s soul. With Paige’s life now in danger, Abram knows that his plans for escape from the only home he has ever known have suddenly become more imperative than ever. Paige has always wondered if the dark, cool and mysterious Abram el Hamid Mustafa is hiding a wicked side. . . . a wicked side that will allow her to explore the kind of pleasure she has dreamed of. But when she is kidnapped by his father, she finds that she must trust Abram with more than her fantasies. Paige must trust him with her life…and her heart. Secret, dangerous desires will bind Abram and Paige together as the forces surrounding them try to tear them apart.", "hash": "03148999-5b1a-4d70-8424-54d6edfb83c9"}, {"title": "Beautiful Disaster (Beautiful #1)", "author": "Jamie McGuire", "pgs": 66, "sum": "Storyline: \nBeautiful Disaster (Beautiful #1) INTENSE. DANGEROUS. ADDICTIVE. Abby Abernathy is a good girl. She doesn’t drink or swear, and she has the appropriate number of cardigans in her wardrobe. Abby believes she has enough distance from the darkness of her past, but when she arrives at college with her best friend, her path to a new beginning is quickly challenged by Eastern University’s Walking One-Night Stand. Travis Maddox, lean, cut, and covered in tattoos, is exactly what Abby wants—and needs—to avoid. He spends his nights winning money in a floating fight ring, and his days as the ultimate college campus charmer. Intrigued by Abby’s resistance to his appeal, Travis tricks her into his daily life with a simple bet. If he loses, he must remain abstinent for a month. If Abby loses, she must live in Travis’s apartment for the same amount of time. Either way, Travis has no idea that he has met his match.", "hash": "df3007a7-b54a-4846-a3c8-a57c5679d50b"}, {"title": "Walking Disaster (Beautiful #2)", "author": "Jamie McGuire", "pgs": 47, "sum": "Storyline: \nWalking Disaster (Beautiful #2) Finally, the highly anticipated follow-up to the New York Times bestseller Beautiful Disaster. Can you love someone too much? Travis Maddox learned two things from his mother before she died: Love hard. Fight harder. In Walking Disaster, the life of Travis is full of fast women, underground gambling, and violence. But just when he thinks he is invincible, Abby Abernathy brings him to his knees. Every story has two sides. In Beautiful Disaster, Abby had her say. Now it’s time to see the story through Travis’s eyes.", "hash": "c96b3f2b-a46e-473e-a8fb-e147a1d940e2"}, {"title": "A Beautiful Wedding (Beautiful #2.5)", "author": "Jamie McGuire", "pgs": 15, "sum": "Storyline: \nA Beautiful Wedding (Beautiful #2.5) You know that Abby Abernathy unexpectedly became Mrs. Maddox. But what do you really know? Why did Abby pop the question? What secrets were shared before the ceremony? Where did they spend their wedding night? Who else knew about it . . . and didn’t tell? Everything about Abby and Travis’s elopement was top-secret . . . until now. Fans of Beautiful Disaster and Walking Disaster will get all of their questions answered in this whirlwind tale of the wedding day (and night!)—and as with all good stories, this one will definitely have been worth the wait.", "hash": "3c0270d7-43e3-4d91-b10a-e92183b7dab4"}, {"title": "Dear Rockstar (Dear Rockstar #1)", "author": "Emme Rollins", "pgs": 33, "sum": "Storyline: \nDear Rockstar (Dear Rockstar #1) Sara is obsessed with rock star Tyler Vincent, and as she works to complete her senior year, she’s determined to find a way to meet him—although her best friend, Aimee, keeps telling her to find a different escape from her desperately violent home life. Complications arise when Dale, the mysterious new transfer student, sets his sights on Sara, and she falls for this rock-star-in-the-making in spite of her better judgment. When Sara wins a contest, she is faced with a choice—travel to Tyler Vincent’s home town to meet him, or stay and support Dale in a Battle-of-the-Bands hosted by MTV. Their triangulated relationship is pushed to its breaking point, but there is another, deeper secret that Dale’s been keeping that just may break things wide open... Turn up your collar, feather your hair, and splash on some Polo, because we’re going back to the ‘80’s when MTV played music videos, there was no such thing as American Idol, and becoming a star meant doing nothing short of crazy for that one, big break.", "hash": "0826e6ee-97ec-4405-a51a-3aafa9c54d79"}, {"title": "Lucky Girl (Dear Rockstar #2)", "author": "Emme Rollins", "pgs": 30, "sum": "Storyline: \nLucky Girl (Dear Rockstar #2) ~~DEAR ROCKSTAR SEQUEL~~ Who knew loving a real rock star could be so hard? Sara is Dale Diamond's biggest fan--and one of his biggest secrets. Catapulted to fame, Dale and his band, Black Diamond, are learning to deal with the grueling realities of the music business... including frenzied groupies. Dale's agent, determined to preserve the musician's image as a sexy single man, won't let fans know he has a girlfriend. All Dale wants is to make music and love Sara. But he's caught up in the demands of recording and touring, while Sara has graduated art school and found a job. She and her rocker boyfriend are starting down different paths. Sara knows she's the luckiest girl in the world to have Dale in her life--but luck is about to run out. A lurking, dark past will come back to haunt them both, forcing two young lovers to face harsh realities about life and each other. When the weight of the world is on their shoulders, will Dale and Sara be able to hold it all together for the sake of their love?", "hash": "17447a70-bbd5-4f06-a02e-e7e3686b4d3a"}, {"title": "Callum & Harper (Sleepless #1)", "author": "Fisher Amelie", "pgs": 48, "sum": "Storyline: \nCallum & Harper (Sleepless #1) Life sucks for orphans Callum Tate and Harper Bailey. Kicked out of their foster homes because they suffer the 'eighteen disease' with nothing but a hundred dollar check from the government and a pat on the back, they're forced to rely on a system that failed them miserably. So they sit. They sit inside Social Services, waiting for their social workers to call their names and offer them the miracle they know will never come but they sit anyway because they have nowhere else to go, no other options on their very literal and figurative empty plates. But as they sit, they notice the other. Although captivated, they each come to the conclusion that life is complicated enough without throwing in a boiling tension that can't ever be acted upon because they're both too busy thinking about where their next meal will come from but when their names are called and both are placed on a year long waiting list for permanent housing, suddenly relying on each other seems like a very viable plan B. And, oh, how lovely Plan B's can be. Well, except for the psycho from Harper's past that haunts her and, oh, yeah, there's the little issue that neither of them knows they're in love with the other. Needless to say, Callum & Harper's life just got a bit more complicated. “One day, you and I are gonna’ wake up and be alright. Maybe not today, maybe not tomorrow but one day. One day. I promise you.” - Callum Tate", "hash": "53586067-ba16-4f2e-ba35-9046e5612cf2"}, {"title": "Thomas & January (Sleepless #2)", "author": "Fisher Amelie", "pgs": 34, "sum": "Storyline: \nThomas & January (Sleepless #2) Thomas Eriksson thinks he has it all figured out. \"People crossed the street when they saw me. I’m not really sure why that was. I mean, okay, I might have looked a bit intimidating if I was being truthful with you. I’d changed since New York. New York represented a life that wasn’t real, not truthfully, anyway. No, New York was the “young, immature, in love, idiot\" side of Tom. The “Tie-Dye Tom of New York City” didn’t exist anymore. Tie-Dye Tom was dead.\" January Mac Lochlainn thinks she’s her own worst enemy. \"I quit Berkeley. Threw away a full scholarship. Plans, you ask? What plans?\" But they’re both wrong. Tom approached me slowly and met me under the light on the stone walkway. He leaned over me so closely, my neck craned to see his face. His expression was one of confusion as he studied my own. “What is it about you?” he asked me. I gulped. “What do you mean?” I whispered, closing my eyes and swallowing again, my breaths becoming labored. He lifted his hand and dragged the backs of his fingers across my jaw so lightly I barely felt them, but they made me feel dizzy all the same. “How can you be this extraordinary, January MacLochlainn?” He leaned closer, a look of pure frustration and anger lit his eyes and pressed his lips. “And why couldn’t I have met you before I realized I didn’t want anyone... ever?” Life for Thomas and January will never be the same again... whether they like it or not.", "hash": "ac1cc6be-35c5-46ed-a7c5-d604f60734e1"}, {"title": "Vain (The Seven Deadly #1)", "author": "Fisher Amelie", "pgs": 39, "sum": "Storyline: \nVain (The Seven Deadly #1) If you’re looking for a story about a good, humble girl, who’s been hurt by someone she thought she could trust, only to find out she’s not as vulnerable as she thought she was and discovers an empowering side of herself that falls in love with the guy who helps her find that self, blah, blah, blah...then you’re gonna’ hate my story. Because mine is not the story you read every time you bend back the cover of the latest trend novel. It’s not the “I can do anything, now that I’ve found you/I’m misunderstood but one day you’ll find me irresistible because of it” tale. Why? Because, if I was being honest with you, I’m a complete witch. There’s nothing redeeming about me. I’m a friend using, drug abusing, sex addict from Los Angeles. I’m every girlfriend’s worst nightmare and every boy’s fantasy. I’m Sophie Price...And this is the story about how I went from the world’s most envied girl to the girl no one wanted around and why I wouldn’t trade it for anything in the world.", "hash": "00cd16bd-320b-4636-a587-c93c05062fea"}]