[{"title": "Greed (The Seven Deadly #2)", "author": "Fisher Amelie", "pgs": 46, "sum": "Storyline: \nGreed (The Seven Deadly #2) Gather ‘round, love, because I want you. I want what you have, I want what you don’t have, I want more of what I already have. I want. But if you so much as ask for something in return, go ahead and walk away. Know if you want to play in my world, it’s every man for themselves and the weak become mine. Leeches will be obliterated because I make it my job to destroy them. I protect what’s mine and I take what’s yours…because that’s what I do. I want. My story will not endear me to you and, frankly, I could care less if it does because I’m in this for the money and nothing else. There’s nothing redeeming about me. I’m a corrupt, money hungry, immoral asshole from Los Angeles. I’m every man’s worst nightmare and every girl’s fantasy. I’m Spencer Blackwell…And this is the story about how I went from the world’s most coveted guy to the guy no one wanted around and why I wouldn’t trade it for anything in the world.", "hash": "1c947992-8196-44c7-8370-aea25a67d52f"}, {"title": "Long Hard Ride (Rough Riders #1)", "author": "Lorelei James", "pgs": 43, "sum": "Storyline: \nLong Hard Ride (Rough Riders #1) Channing Kinkaid itches for a wild western adventure with an untamed man. Enter Colby McKay, bull rider, saddle bronc buster and calf roper. He knows he's found a woman who's up to the challenge of cutting loose. Intrigued by Channing's bold proposition to \"horse around\" on the road, Colby proposes sexual escapades not only in his bed, but in those of his two rodeo traveling partners. Can Channing give up total control? Especially when not all is as it seems with the sexy trio?", "hash": "558fbd50-fa47-4478-a675-e23a58561aaf"}, {"title": "Rode Hard, Put Up Wet (Rough Riders #2)", "author": "Lorelei James", "pgs": 52, "sum": "Storyline: \nRode Hard, Put Up Wet (Rough Riders #2) Workin up a hot, sticky sweat is pure pleasure with a hard-ridin cowboy or two. Struggling stock contractor Gemma Jansen swallows her pride and tracks down circuit rider Cash Big Crow to offer him a job managing her ranch. Cash agrees on one condition: theirs won't be strictly a working relationship. She's the boss during the day, but once she's corralled in the bedroom, Cash calls the shots. Despite concerns about their age difference, Gemma consents. Cash suspects the sexy widow hides an untapped wild streak. He intends to loosen her tightly held reins of control even if he has to break out his horsewhip to do it. But Cash is in for a surprise. Gemma proves a rough and ready participant in any leather-n-lace game Cash dreams up. Between riding herd on his wayward daughter, Macie, and rowdy cowboy Carter McKay doggin Macie's every boot step, Cash struggles to hide his true feelings for Gemma except this time, Gemma's grabbed the bull by the horns and she's playing for keeps. Summer's going to be a hot one at the Bar 9.", "hash": "db2e5f8e-6d8e-49d6-8f9b-f5dff749a0f5"}, {"title": "Cowgirl Up and Ride (Rough Riders #3)", "author": "Lorelei James", "pgs": 45, "sum": "Storyline: \nCowgirl Up and Ride (Rough Riders #3) Ridin' the edge of lust is fun--until someone falls in love. Goody-two boots AJ Foster has waited her entire life for her dream cowboy Cord McKay to see her as more than the neighbor girl in pigtails. Now that she's old enough to stake her claim on him, she's pulling out all the sexual stops and riding hell-bent for leather--straight for his libido. Divorced rancher Cord has sworn off all women...until innocent AJ suggests he teach her how to ride bareback--and he realizes she doesn't mean horses or bulls. Between his responsibilities running his massive ranch, missing his young son and dealing with the sexual shenanigans of his brother and cousins, Cord is more than willing to take AJ up on her offer. On a trial basis. The fun and games tie them both up in knots. AJ isn't willing to settle for less than the whole shootin' match with her western knight. But for Cord, even though the sexy cowgirl sets his blood ablaze, he's determined to resist her efforts to lasso his battered heart. Sweet, determined AJ has the power to heal--or heel--the gruff cowboy...unless Cord's pride keeps him from admitting their relationship is more than a simple roll in the hay.", "hash": "72dbe099-cc69-4575-a29e-a42f3a0e5a2a"}, {"title": "Tied Up, Tied Down (Rough Riders #4)", "author": "Lorelei James", "pgs": 47, "sum": "Storyline: \nTied Up, Tied Down (Rough Riders #4) The strongest bonds are the ones unseen. Businesswoman Skylar Ellison is firmly in control of her life. So getting tangled up with a sexy Wyoming cowboy--and conceiving a baby in the parking lot of a honky-tonk--wasn't in her plan. Since it appears the daddy has taken off for greener pastures, the only thing to do is pull up her bootstraps and carry on alone. Cattle rancher Kade McKay returns home after a year on the range, and is knocked for a loop when he learns he's the father of a three-month-old baby girl. When Skylar refuses to marry him, Kade grits his teeth, moves in and plays house by her rules to prove he's a man in for the long haul. Despite Skylar's insistence they are to remain strictly parenting partners, their old passions flare hot as a brush fire, spurring Kade to demand absolute sexual surrender from the headstrong woman. Skylar willingly submits her body to the hot-blooded cowboy but she's leery of handing Kade the reins to her heart. Can Kade convince Skylar the wicked sex games aren't a temporary distraction? Or will he have to bust out the ropes to show her he wants to be tied to her...forever?", "hash": "20288f20-bea4-4d9b-9f96-01040e82d21f"}, {"title": "Rough, Raw, and Ready (Rough Riders #5)", "author": "Lorelei James", "pgs": 54, "sum": "Storyline: \nRough, Raw, and Ready (Rough Riders #5) Torn between the love he has...and the love he's always wanted. Chassie West Glanzer hasn't been a stranger to drama and tragedy. A year of wedded bliss to sexy-as-sin cowboy Trevor Glanzer has brought her the happiness and contentment she never thought she'd find, and mellowed Trevor's rodeo wanderlust. Then Trevor's old roping partner ambles up the driveway--and Chassie's life changes drastically. Trevor never expected to see Edgard Mancuso again, after it became clear he couldn't be the man Edgard needed. Now Edgard is back from Brazil to sort out their tangled past, and Trevor is plagued with feelings he thought he'd buried over three years ago. Although Trevor is hat-over-bootheels in love with his sweet, feisty wife, the sense his life is missing a piece has always gnawed at him. Chassie's shock that Edgard and Trevor were once lovers turns to fear of losing her husband. Or worse, fear that Trevor will stay with her only out of a sense of duty. Yet as the three of them spend time together, the sins of the past blur and fade, leaving raw emotion--and unbridled passion. Passion that could heal...or cause irreparable damage to their future.", "hash": "f899ad8a-5b1b-46cb-a8c1-db076ab86625"}, {"title": "Branded as Trouble (Rough Riders #6)", "author": "Lorelei James", "pgs": 46, "sum": "Storyline: \nBranded as Trouble (Rough Riders #6) It's hard to trust the future when you've been branded by the past. Rough Riders, Book 6 As a walking advertisement for the tattoo shop she's set up in a small Wyoming town, India Ellison is well acquainted with preconceived notions. Despite the odd looks and off-color comments about her off-color hair, life is good. She's clean and sober, dotes on her sister's kids and, best of all, spends most of her free time with her best buddy, cowboy Colt McKay. Reformed bad boy Colt never expected three years of sobriety to lead to three years of abstinence. Curbing his craving for booze and random sexual encounters is nothing compared to the ever-increasing craving for his hot-tempered, hot-bodied best friend, India. Too bad she's his A.A. sponsor. Too bad she hasn't a clue that Colt's been head-over-bootheels in love with her from day one. After an unexpected, steamy interlude, all India can think about is riding the sexy cowboy instead of her motorcycle, even when Colt is determined to show her a slower ride is worth the wait. Or are they risking their friendship for a fling that could burn them both?", "hash": "975027f6-1fa6-4ab3-80b8-b15d814b9160"}, {"title": "Strong, Silent Type (Rough Riders #6.5)", "author": "Lorelei James", "pgs": 18, "sum": "Storyline: \nStrong, Silent Type (Rough Riders #6.5) Tough. Taciturn. And a fool for letting her go... A Wild Ride story. Wyoming rancher Quinn McKay thought he'd only have to bide time until his levelheaded wife came to her senses and called a halt to this \"trial separation.\" He never believed the marital rough patch would drag on for a coon's age. Libby McKay knew when she married the gruff, laid-back cowboy that he wasn't prone to blathering about his feelings. But three months have passed and her stubborn-as-a-mule husband is still living by himself in the horse trailer. It seems he'd rather hold onto his pride than hold onto her. Quinn realizes Libby is determined to move on if he doesn't loosen his tongue and he'll lose the only woman he's ever loved. In a last-ditch effort to keep her in his life, he offers her one weekend of uninterrupted sexual decadence. Reigniting the passion is easy. The hard part comes after the sheets have cooled and they find out if what remains is strong enough to survive past mistakes.", "hash": "20efab16-d625-4344-abbe-d4eb0cfc8dab"}, {"title": "Cover Me (Elite Force #1)", "author": "Catherine Mann", "pgs": 40, "sum": "Storyline: \nCover Me (Elite Force #1) It should have been a simple mission... Pararescueman Wade Rocha fast ropes from the back of a helicopter into a blizzard to save a climber stranded on an Aleutian Island, but Sunny Foster insists she can take care of herself just fine... But when it comes to passion, nothing is ever simple. With the snowstorm kicking into overdrive, Sunny and Wade hunker down in a cave and barely resist the urge to keep each other warm... until they discover the frozen remains of a horrific crime. Unable to trust the local police force, Sunny and Wade investigate, while their irresistible passion for each other gets them more and more dangerously entangled...", "hash": "0a783245-edff-4f00-a636-ae0d1284a9d0"}, {"title": "Hot Zone (Elite Force #2)", "author": "Catherine Mann", "pgs": 40, "sum": "Storyline: \nHot Zone (Elite Force #2) \"Catherine Mann delivers an emotional and action-packed story that leaves you wanting more.\" -- Sherrilyn Kenyon, #1 New York Times Bestselling Author HE'LL TAKE ANY MISSION, THE RISKIER THE BETTER... The haunted eyes of pararescueman Hugh Franco should have been her first clue that deep pain roiled beneath the surface. But if Amelia couldn't see the damage, how could she be expected to know he'd break her heart? SHE'LL PROVE TO BE HIS BIGGEST RISK YET... Amelia Bailey's not the kind of girl who usually needs rescuing...but there are anything but usual circumstances. \"A powerful, passionate read not to be missed!\" -- Lori Foster, New York Times Bestselling Author of When You Dare USA Today bestselling author Catherine Mann delivers another hero from the Air Force's celebrated Pararescue Jumpers-\"The PJs\"- an ultra-elite force who put themselves at extreme risk in the most dangerous emergancies so that others may live. A sizzling thrill-rise of action and attraction, Hot Zone will leave your pulse pounding.", "hash": "a24517d7-64cf-44c8-9d9e-6a7c2e055563"}]