[{"title": "Under Fire (Elite Force #3)", "author": "Catherine Mann", "pgs": 44, "sum": "Storyline: \nUnder Fire (Elite Force #3) A decorated hero, pararescueman Liam McCabe lives to serve. Six months ago, he and Rachel Flores met in the horrific aftermath of an earthquake in the Bahamas. They were tempted by an explosive attraction, yet parted ways. Still, Liam has thought about Rachel every day—and night—since. Now, after ignoring all his phone calls for six months, Rachel has turned up on base with a wild story about a high-ranking military traitor. She claims no one but Liam can help her—and she won’t trust anyone else. With nothing but her word and the testimony of a discharged military cop to go on, Liam would be insane to risk his career—even his life—to help this woman who left him in the dust.", "hash": "e9b21e06-6cf8-4b5d-921b-db96bc609644"}, {"title": "Free Fall (Elite Force #4)", "author": "Catherine Mann", "pgs": 40, "sum": "Storyline: \nFree Fall (Elite Force #4) On This Mission, There Are No Accidents... Pararescueman Jose \"Cuervo\" James is the guy they call for the most dangerous assignments. He lives for his job. On a high-risk rescue deep in the African jungle, Jose encounters sexy, smart Interpol agent Stella Carson. They'd once had an affair that burned hot and fast, but family is everything to Stella, and Jose just can't go there. Fate has thrown them into the deadly hot zone together, and sparks will fly...but only if they can live to tell about it.", "hash": "0e156097-a48e-47ae-8c8d-f33294808bef"}, {"title": "Grayson's Surrender (Wingmen Warriors #1)", "author": "Catherine Mann", "pgs": 33, "sum": "Storyline: \nGrayson's Surrender (Wingmen Warriors, #1) Nothing frightened Grayson \"Cutter\" Clark. Yet the sight of Lori Rutledge had the Air Force flight surgeon almost dropping to his knees. After a year without her, Grayson was now her partner. Suddenly, rescuing a group of orphans from a war-torn country seemed easy compared to keeping his feelings for Lori locked safely away. He was the only man she'd ever wanted, but Lori dared not forget Grayson's need for emotional distance. She'd accepted they would never share a family...until fate delivered a heart-tugging orphan into their care. Now Lori had reason to keep him beside her. But could she settle for anything less than Grayson's ultimate surrender?", "hash": "41ad2d1b-bb26-47eb-8244-413fee23d5c5"}, {"title": "Taking Cover (Wingmen Warriors #2)", "author": "Catherine Mann", "pgs": 33, "sum": "Storyline: \nTaking Cover (Wingmen Warriors #2) Dr. Kathleen O'Connell's years in the air force had taught her a thing or two about handling arrogant top-gun pilots. But there was one hotshot flyboy who'd always gotten past her defenses. And now he was her unwelcome partner--on the most dangerous mission of her career. Captain Tanner \"Bronco\" Bennett had always known how to break through her cool, professional exterior and touch the passionate, sensuous woman beneath. But they had a deadly mystery to solve--and she had to keep things strictly business. She thought she could keep him in line--maybe--but she wasn't so sure about her own traitorous heart....", "hash": "90b746c9-bb49-4818-b6f9-abf4e8cd5a70"}, {"title": "Under Siege (Wingmen Warriors #3)", "author": "Catherine Mann", "pgs": 33, "sum": "Storyline: \nUnder Siege (Wingmen Warriors #3) \"This edition published by arrangement with Harlequin Books S.A.\"--T.p. verso.", "hash": "1fdf889c-a820-4dde-b9c9-91403fbe3f58"}, {"title": "Private Maneuvers (Wingmen Warriors #4)", "author": "Catherine Mann", "pgs": 29, "sum": "Storyline: \nPrivate Maneuvers (Wingmen Warriors #4) \"This edition published by arrangement with Harlequin Books S.A.\"--T.p. verso.", "hash": "fdae9312-059c-4f94-adb4-8b93aac799cc"}, {"title": "Strategic Engagement (Wingmen Warriors #5)", "author": "Catherine Mann", "pgs": 31, "sum": "Storyline: \nStrategic Engagement (Wingmen Warriors #5) Flying a dangerous rescue into a war-torn country to save his two little orphaned brothers was all in a day's work for air force hero Daniel Baker. But finding Mary Elise McRae stowed away on board—scared, alone and living her life on the run from an ex-husband who wanted her dead—was the last thing he'd ever expected. She'd been his best friend, his lover and nearly his wife. Danny would stop at nothing to keep her safe...even if it meant falling in love with her all over again.", "hash": "e2ed5307-8cbb-40d0-8037-b6df0eba813d"}, {"title": "Anything, Anywhere, Anytime (Wingmen Warriors #6)", "author": "Catherine Mann", "pgs": 38, "sum": "Storyline: \nAnything, Anywhere, Anytime (Wingmen Warriors #6) With one week to complete a top-secret mission, Major Jack Korba did not need emotional distractions. But that's exactly what he got when flight surgeon Monica Hyatt was added to his team!", "hash": "fcbc8c74-4523-4692-ae7c-32e3d384de15"}, {"title": "Joint Forces (Wingmen Warriors #7)", "author": "Catherine Mann", "pgs": 33, "sum": "Storyline: \nJoint Forces (Wingmen Warriors #7) After being held prisoner, Senior Master Sergeant J.T. \"Tag\" Price returned home to find his marriage nearly dissolved. Then his wife, Rena, dropped a bomb of her own: she was pregnant. After more than twenty years of marriage they were expecting a new baby...and J.T. realized his second chance had arrived. Then sudden danger loomed. Someone was out to destroy those he loved...someone willing to resort to murder. Now Rena and J.T. would need to call on the joint forces of their history, their love and their devotion to their family. But would the cost be higher than anyone dared imagine?", "hash": "82e1830f-b2a7-4828-b13a-2246c8259bb4"}, {"title": "Explosive Alliance (Wingmen Warriors #9)", "author": "Catherine Mann", "pgs": 34, "sum": "Storyline: \nExplosive Alliance (Wingmen Warriors #9) He'd come to seek out a woman. But Captain Bo Rokowsky had no intention of adding Paige Haugen to his list of conquests. Her eyes had tormented him for months, because he felt responsible for her husband's death, and Bo had to be certain she and her little girl were safe, secure. So when ghosts of the past threatened all of their lives, Bo knew he would take a bullet for them both. But he never imagined he would want the very woman he'd come to protect. Or that Paige would want him--a man with battle scars both inside and out. Suddenly this mission put more than just his life at stake....", "hash": "1214b426-60d3-40fb-b254-dc80e621671b"}]