[{"title": "The Captive's Return (Wingmen Warriors #10)", "author": "Catherine Mann", "pgs": 29, "sum": "Storyline: \nThe Captive's Return (Wingmen Warriors #10) Five years ago, Lieutenant Colonel Lucas Quade had watched his wife of mere moments die. Forced to flee from a war-torn country, he'd had to leave her body behind. The guilt had nearly consumed him. Five years ago, Sarafina Quade's death had been faked. Forced to live under the protection of a \"family friend,\" she'd agreed in order to protect Lucas's baby. The hope of eventual freedom had kept her alive. Now fate had brought husband and wife face-to-face. On a dangerous trek through the jungle a man would learn he was a father, a woman would learn her past was a lie and a child might finally have the family she always craved. If they survived the journey.", "hash": "77bb1093-9166-4874-a3f8-6e282499dab1"}, {"title": "Awaken to Danger (Wingmen Warriors #11)", "author": "Catherine Mann", "pgs": 29, "sum": "Storyline: \nAwaken to Danger (Wingmen Warriors #11) She awoke with a dead body beside her and no memory of the night before. Suddenly Nikki Price was the prime suspect in a murder. Even worse, working the case was air force major Carson \"Scorch\" Hunt--the wingmen warrior she'd been pining for...forever. They'd spent one night together months ago and Carson hadn't said a word to her since. But now with the real murderer out to silence Nikki, he was the only one who could keep her safe. She agreed to his protecting her, but she wouldn't let their mutual attraction take over. Nikki had awoken to danger once before and barely survived.... Sleeping with Carson could prove more lethal.", "hash": "8e8c6a52-131c-48f1-8ccd-a30ace853b54"}, {"title": "Fully Engaged (Wingmen Warriors #12)", "author": "Catherine Mann", "pgs": 25, "sum": "Storyline: \nFully Engaged (Wingmen Warriors #12) They'd shared one wild weekend of passion, then she'd left without a word. Five years later, Nola Seabrook tracked down Captain Rick DeMassi to apologize for her hasty departure, not realizing this fresh encounter would lead to Rick moving in with her... as her bodyguard. Playing protector to his ex-lover had not been Rick's plan. But disturbing letters and a nearly fatal car bomb soon had him jumping into action. He fully intended to protect Nola with his life, find out why she'd been so quick to leave his bed... and do \"whatever\" was necessary to get her back in it.", "hash": "f4dd93db-71ec-485b-941c-914b7392fc4a"}, {"title": "Holiday Heroes (Wingmen Warriors #13)", "author": "Catherine Mann", "pgs": 12, "sum": "Storyline: \nHoliday Heroes (Wingmen Warriors #13) by Rachel Lee, Catherine Mann U.S. Marine Jon Erikson needed to find peace this holiday season. But attraction sparked when he met park ranger Melinda Hawthorne--a woman also haunted by secrets. Venturing into a perilous wilderness would test their survival skills and growing desire....Keeping Senator Ginger Landis safe was General Hank Renshaw's top priority. He wouldn't let anything put her at risk--including his growing feelings for her. Danger threw them intimately together, taking them to a passionate point of no return.", "hash": "a20103dd-280e-4400-abc8-635d402c9d8e"}, {"title": "Out of Uniform (Wingmen Warriors #14)", "author": "Catherine Mann", "pgs": 27, "sum": "Storyline: \nOut of Uniform (Wingmen Warriors #14) Natural-born warrior Jacob Stone never ignored a lady in distress. So when a stunning brunette clad only in a cocktail dress stumbled to his doorstep, the off-duty air force sergeant went into protector mode. But could he really believe \"Dee's\" claims that she'd lost her memory...or was her amnesia a ruse to hide a dangerous secret?For someone had certainly set their sights on getting rid of Dee. Yet they hadn't counted on Jacob's resolve. Dee was his responsibility. Even more...she'd become integral to his next breath. And no one messed with his lady.", "hash": "6aa327cc-b001-4287-b0df-7d99b592d242"}, {"title": "Unravel Me (Unravel Me #1)", "author": "Kendall Ryan", "pgs": 0, "sum": "Storyline: \nUnravel Me (Unravel Me #1) Psychology student Ashlyn Drake’s neat, orderly life takes a turn for the crazy when she finds the perfect subject for her amnesia thesis – a young man without any memory of his previous life, including the murder he’s accused of committing. Against all common sense, Ashlyn’s drawn to him like a moth to a flame. Perhaps it’s that he’s so incredibly male, and even handcuffed to his hospital bed he could pass for a cologne ad – Scent de Insanity. Or perhaps it’s because she’s spent too many lonely nights studying. Either way, she’s determined to help him solve the mystery of his past. She begins to unravel who he was before, using his cryptic tattoos, and his paintings that scream of a dark past as her only clues. When she finally learns his secret there’s no telling which one is the real him, the gentle lover she’s fallen for or the troubled man with a dark past.", "hash": "ecb3a3df-21d0-4ecf-907d-4a1dc67542dc"}, {"title": "Make Me Yours (Unravel Me #2)", "author": "Kendall Ryan", "pgs": 0, "sum": "Storyline: \nMake Me Yours (Unravel Me #2) Emotionally crippled Liz isn’t looking for a relationship when she meets delish boy-next-door, Cohen. He’s a few years younger, a volunteer firefighter, oh…and a virgin, making him totally off limits. But never one to back away from a challenge, she’s drawn to him even while she continues to satisfy her physical needs elsewhere. Even as she spends her evenings in another man’s arms, she somehow finds herself curled up in Cohen’s bed each night. It’s been a long time since she had a true honest-to-goodness make out session, but Cohen’s showing her just how much fun not having sex can be. When Cohen’s injured, her real feelings for him rise to the surface, and she has to decide if she’s willing to take a risk on love after enduring so much heartbreak in her past.", "hash": "ba0aff72-99f8-41be-bf7a-3f04fe90189d"}, {"title": "The Impact of You ", "author": "Kendall Ryan", "pgs": 0, "sum": "Storyline: \nNeeding an escape from her past, Avery chooses a college where no one knows her. Keeping a low profile was the plan, falling for the intense frat boy, Jase wasn’t. Yet she can’t deny how alive she feels when he’s near. Even as common sense implores her to stay away, her body begs her to get closer. Jase, numb from his own family drama, has grown bored with weekends fueled by nameless girls and countless bottles when he meets Avery. Helping her cope with her past is better than dealing with the bullshit his own life’s served up. Determined to drive away the painful secret she’s guarding, he appoints himself her life coach, and challenges her to new experiences. Getting close to her and being the one to make her smile are simply perks of the job. But when Avery’s past boldly saunters in, refusing to be forgotten, can Jase live with the truth about the girl he’s fallen for? Recommended for 17+ due to mature themes and sexual content.", "hash": "95063155-f231-44ac-be64-89f93aa406c9"}, {"title": "Hard to Love ", "author": "Kendall Ryan", "pgs": 0, "sum": "Storyline: \nCade’s always taken risks… Cade takes cares of his sick younger sister by doing what he does best--cage fighting and starring in adult movies, his newest harebrained moneymaking scheme designed to pay for his sister’s growing medical bills. But when his latest gig finds him admitted to the ER sporting an erection from hell, thanks to the little pill given to him by the director, he can’t get the pretty little nurse who treated him out of his head, even though he knows she’s so far out of his league it should be illegal. Alexa’s always played it safe… Tired of being pigeonholed as the sweet, innocent one, hardworking nursing student Alexa has been looking for ways to break out of her Goody Two-shoes image. When her friend suggests the outlandish idea of losing her virginity to the sexy and sure-to-be-skilled porn star, Alexa is mortified. But then when Cade refuses her proposition, she finds herself pissed off and embarrassed. When she tracks him down to give him a piece of her mind, she isn’t prepared for what she finds. Watching him care for his little sister tugs at her heart, and suddenly it’s no longer just about losing her virginity, but about helping Cade. Because Lord help her, she might actually be falling for a porn star…", "hash": "80c45dd7-7109-4ed2-a576-850923be120e"}, {"title": "Resisting Her ", "author": "Kendall Ryan", "pgs": 0, "sum": "Storyline: \nAgent Cole Fletcher lives for his job at the FBI, and he’s more than ready for his next assignment—raiding a cult compound and putting their leader behind bars. But he isn’t prepared for Savannah and her knock you on your ass good looks. At nineteen, she’s too old for foster care and too damaged to live on her own. With nowhere else to go, and against his better judgment Cole takes her in. But helping her out won’t be easy. He comforts her through screaming nightmares and escaping the lingering fears of her past, but that’s the easy part. Her preference to sleep cuddled up next to his warm body, and her desire to please him in every way makes her harder and harder to resist.", "hash": "d7941ea1-eaea-46df-a46b-cdee086ffea7"}]