[{"title": "Forgotten ", "author": "Cat Patrick", "pgs": 44, "sum": "Storyline: \nEach night at precisely 4:33 am, while sixteen-year-old London Lane is asleep, her memory of that day is erased. In the morning, all she can \"remember\" are events from her future. London is used to relying on reminder notes and a trusted friend to get through the day, but things get complicated when a new boy at school enters the picture. Luke Henry is not someone you'd easily forget, yet try as she might, London can't find him in her memories of things to come. When London starts experiencing disturbing flashbacks, or flash-forwards, as the case may be, she realizes it's time to learn about the past she keeps forgetting-before it destroys her future.", "hash": "3504aff1-8b88-49fb-a1ca-c4ed5084496e"}, {"title": "Skin Deep (Skin Deep #1)", "author": "J.M. Stone", "pgs": 65, "sum": "Storyline: \nSkin Deep (Skin Deep #1) Oh, who was she kidding? Emma knew that going to the tattoo shop with her best friend, Allie, would result in getting badgered until she ended up with some sort of needle piercing her flesh in one way or another. What she didn’t plan on was ending up face-first on the floor of the shop with a busted lip. Or doing it in front of the hottest guy she’d seen since…well, ever. Mortified, Emma never thought she’d ever step foot back in Skin Deep again. But fate, with a little help from Emma’s flighty best friend and a chance encounter with a fudge bar, steps in. Now Emma’s torn between taking a chance on getting her heart broken by the enigmatic, gorgeous Lucas, and playing it safe with good ol’ trusty B.O.B. Lucas lets Emma know that he gets what he wants, and what he wants is her. When Emma gives in and quits pushing him away, she’s surprised at how quickly the walls around her heart crumble. She’s even more surprised that her unconventional, zany family just endears her even more to him. But no one knows there’s someone that wants her more, and they’ll stop at nothing to get her. Recommended for readers 18+ due to HOT sexual encounters, adult situations, and language.", "hash": "d0bb5697-4b75-4f7a-8497-f744c720acef"}, {"title": "Under My Skin (Skin Deep #2)", "author": "J.M. Stone", "pgs": 52, "sum": "Storyline: \nUnder My Skin (Skin Deep #2) One little piercing. That’s all Allie wanted when she dragged her best friend into Skin Deep. She never imagined that it would result in a busted lip and an engagement ring for Emma, or that it would come with a double side of six-foot plus, tattooed, sexy-as-sin, H.O.T. maleness for her! Now she’s torn because Brandon and Jackson have both let it be known that they want her. And both are used to getting what they want. But what about what Allie wants? Brandon is hot for Allie. So is Jackson. Neither of them are willing to step aside for the other and they’re tired of Allie running. So they hatch a plan… Add in wedding bells, a dog named Doug, and you’ve got a recipe for a good time. Or a disaster. Recommended for readers 18+ due to HOT sexual encounters, adult situations, and language. This is book two of the Skin Deep Series; recommended to read after Skin Deep, book one of the series.", "hash": "e33dd59d-8392-45d2-80a0-e40046cff9f4"}, {"title": "Skin to Skin (Skin Deep #3)", "author": "J.M. Stone", "pgs": 58, "sum": "Storyline: \nSkin to Skin (Skin Deep #3) “I kissed Brandon.” Three little words. One drunken night. And everything changed. Starting over is never easy to do, and Chloe made it that much harder on herself when she lip-locked Brandon. Guilt-ridden, she confesses to Allie about the kiss. Instead of the black eye she figured was coming, she gets way more than she bargained for in the form of an Allie-sized reality check...but she still can’t shake the haunting memory of a certain toe-curling, leave-you-breathless, wet-your-panties kiss. With Brandon and Chloe walking on egg-shells around each other, fate, this time in the form of two scheming, hormonal, pregnant women and three funny furballs, steps in once more, forcing them to face the fact that things have definitely changed between them… But is it for better or worse? Recommended for readers 18+ due to HOT sexual encounters, adult situations, and language. This is book three of the Skin Deep Series; recommended to read after Skin Deep, book one of the series, and Under My Skin, book two of the series.", "hash": "9f87b7b4-93df-4c83-9823-19a695486a48"}, {"title": "Skin Tight (Skin Deep #4)", "author": "J.M. Stone", "pgs": 43, "sum": "Storyline: \nSkin Tight (Skin Deep #4) Who would have thought that she’d ever have to thank her brother (and the drunken ogre who didn’t know when to sit down and shut up, of course) for literally dropping her into the arms of the man of her dreams? Not Leah, that’s for sure. But now she’s had to thank Calland a thousand times over for taking her and Chloe with him to the UFC fight that landed her in the arms (and bed) of the tall, tattooed, sexy-as-sin, Ian. Ever since, Leah and Ian have been inseparable; they’re happy and in love. But there’s someone who’s determined to see that happiness end. Victoria has been a pain in Ian’s ass all his life, though a harmless one. Family “friends” since childhood, he’s laughed off her random visits and claims of undying love. Now with Leah in the picture, Victoria has upped the ante and it’s no longer a laughing matter. Victoria may claim to be crazy in love (or just plain crazy), but Ian and Leah, with all the usual suspects at their backs to offer love and support…and lots of laughs along the way… make it known that they’re in it for the long haul and Victoria can’t change that. But Victoria is used to getting what she wants…and what she wants is Ian. And she’s made it clear that she’ll do whatever it takes to have him… *Recommended for readers 18+ due to HOT sexual encounters, adult situations, and language. **This is book four of the Skin Deep Series; recommended to read after Skin Deep, book one of the series, Under My Skin, book two of the series, and Skin to Skin, book three of the series.", "hash": "37fd8328-948c-4816-a893-f7e9985efd9e"}, {"title": "Just One Day (Just One Day #1)", "author": "Gayle Forman", "pgs": 44, "sum": "Storyline: \nJust One Day (Just One Day #1) Allyson Healey's life is exactly like her suitcase—packed, planned, ordered. Then on the last day of her three-week post-graduation European tour, she meets Willem. A free-spirited, roving actor, Willem is everything she’s not, and when he invites her to abandon her plans and come to Paris with him, Allyson says yes. This uncharacteristic decision leads to a day of risk and romance, liberation and intimacy: 24 hours that will transform Allyson’s life. A book about love, heartbreak, travel, identity, and the “accidents” of fate, Just One Day shows us how sometimes in order to get found, you first have to get lost. . . and how often the people we are seeking are much closer than we know. The first in a sweepingly romantic duet of novels. Willem’s story—Just One Year—is coming soon!", "hash": "60ead22c-69a4-4b34-baf0-6d73acf7d960"}, {"title": "Just One Year (Just One Day #2)", "author": "Gayle Forman", "pgs": 36, "sum": "Storyline: \nJust One Year (Just One Day #2) Just One Day. Just One Year. Just One Read. Before you find out how their story ends, remember how it began.... When he opens his eyes, Willem doesn’t know where in the world he is—Prague or Dubrovnik or back in Amsterdam. All he knows is that he is once again alone, and that he needs to find a girl named Lulu. They shared one magical day in Paris, and something about that day—that girl—makes Willem wonder if they aren’t fated to be together. He travels all over the world, from Mexico to India, hoping to reconnect with her. But as months go by and Lulu remains elusive, Willem starts to question if the hand of fate is as strong as he’d thought. . . . The romantic, emotional companion to Just One Day, this is a story of the choices we make and the accidents that happen—and the happiness we can find when the two intersect.", "hash": "517992ac-e71a-42fc-9d5e-58854be9a606"}, {"title": "Just One Night (Just One Day #2.5)", "author": "Gayle Forman", "pgs": 10, "sum": "Storyline: \nJust One Night (Just One Day #2.5) After spending one life-changing day in Paris with laid-back Dutch actor Willem De Ruiter, sheltered American good girl Allyson “Lulu” Healey discovered her new lover had disappeared without a trace. Just One Day followed Allyson’s quest to reunite with Willem; Just One Year chronicled the pair’s year apart from Willem’s perspective. Now, back together at last, this delectable e-novella reveals the couple’s final chapter.", "hash": "83968b94-6ed3-49f1-8b7f-bcea52743655"}, {"title": "If I Stay (If I Stay #1)", "author": "Gayle Forman", "pgs": 23, "sum": "Storyline: \nIf I Stay (If I Stay #1) Librarian note: an alternate cover for this edition can be found here. Just listen, Adam says with a voice that sounds like shrapnel. I open my eyes wide now. I sit up as much as I can. And I listen. Stay, he says. Choices. Seventeen-year-old Mia is faced with some tough ones: Stay true to her first love—music—even if it means losing her boyfriend and leaving her family and friends behind? Then one February morning Mia goes for a drive with her family, and in an instant, everything changes. Suddenly, all the choices are gone, except one. And it's the only one that matters. If I Stay is a heartachingly beautiful book about the power of love, the true meaning of family, and the choices we all make.", "hash": "ee2de5f2-4554-43c3-909e-74871d0e4ff0"}, {"title": "Where She Went (If I Stay #2)", "author": "Gayle Forman", "pgs": 26, "sum": "Storyline: \nWhere She Went (If I Stay #2) It's been three years since the devastating accident . . . three years since Mia walked out of Adam's life forever. Now living on opposite coasts, Mia is Juilliard's rising star and Adam is LA tabloid fodder, thanks to his new rock star status and celebrity girlfriend. When Adam gets stuck in New York by himself, chance brings the couple together again, for one last night. As they explore the city that has become Mia's home, Adam and Mia revisit the past and open their hearts to the future - and each other. Told from Adam's point of view in the spare, lyrical prose that defined If I Stay, Where She Went explores the devastation of grief, the promise of new hope, and the flame of rekindled romance.", "hash": "f350e413-158d-42b0-bcfe-5565fc36a494"}]