[{"title": "Reasonable Doubt: Volume 1 (Reasonable Doubt #1)", "author": "Whitney G Williams", "pgs": 10, "sum": "Storyline: \nReasonable Doubt: Volume 1 (Reasonable Doubt #1) My cock has an appetite. A huge and very particular appetite: Blonde, curvy, and preferably not a fucking liar... (Although, that's a story for another day.) As a high profile lawyer, I don't have time to waste on relationships, so I fulfill my needs by anonymously chatting and sleeping with women I meet online. My rules are simple: One dinner. One night. No repeats. This is only casual sex. Nothing more. Nothing less. At least it was , until \"Alyssa\"... She was supposed to be a 27 year old lawyer, a book hoarder, and completely unattractive. She was supposed to be someone I shared law advice with late at night, someone I could trust with details of my weekly escapades. But then she came into my firm for an interview—a college-intern interview, and everything fucking changed...", "hash": "6a5c7d47-02dd-45a2-850f-3e3f008ec372"}, {"title": "Reasonable Doubt: Volume 2 (Reasonable Doubt #2)", "author": "Whitney G Williams", "pgs": 9, "sum": "Storyline: \nReasonable Doubt: Volume 2 (Reasonable Doubt #2) She lied to me... She betrayed the one rule that I'm most adamant about: Honesty. Complete and utter fucking honesty. I really wish she was someone else—someone who didn't have the ability to make me feel, someone I could easily discard like the hundreds of women before her. She isn't. I'm drawn to her like I've never been drawn to a woman before—completely captivated by the very sight of her. But unfortunately, with my past slowly re-surfacing for all of the world to see, I'll have to find a way to let her go. She can never be mine.", "hash": "a9118075-8817-4164-927c-8f6919e6dc2e"}, {"title": "Reasonable Doubt: Volume 3 (Reasonable Doubt #3)", "author": "H.M. Ward", "pgs": 24, "sum": "Storyline: \nReasonable Doubt: Volume 3 (Reasonable Doubt #3) I hate him… I hate that I fell in love with him, I hate that he didn’t love me back, and I hate the fact that I just made a life-altering decision just so I could get the hell away from him. He’d always said that he was unchangeable, heartless, and cold… I really should’ve believed him…", "hash": "8a1d9381-19b0-4fb3-9b50-3834cdf61962"}, {"title": "Without You (Love Wanted in Texas #1)", "author": "Kelly Elliott", "pgs": 125, "sum": "Storyline: \nAlex and Will have spent months keeping their relationship hidden from their families. Getting caught prematurely causes them to admit their love for each other to their parents.  One decision made by Alex's father changes her entire world, shattering her plans for the future. Alex always thought Will was the very air she breathed, but life has a way of causing doubts for the one thing she thought was absolute…their love.  Can Will's promise to Alex be enough for her to hold on to or will she find herself moving down a different path that she never imagined for herself?  Without You is book one in the Love Wanted in Texas series.", "hash": "82901958-e51d-49a1-bfa5-0fe05238e450"}, {"title": "Holding You (Love Wanted in Texas #3)", "author": "Kelly Elliott", "pgs": 108, "sum": "Storyline: \nLauren Reynolds wanted only two things in life—to run her father’s horse breeding business and Colt Matthews. Fearing Colt would take her position within the family business, she tried to push him far away from her heart.  When life could no longer keep Lauren and Colt apart, their two worlds became one. Every second of every moment, they spent together. Their love bloomed into something neither of them imagined—a bond so strong Lauren and Colt believed nothing would ever stand in their way. However, life threw a cruel twist into Colt and Lauren’s planned happily ever after. Will fate let them live out the life they dreamed of, or will one of them be left alone, lost and angry?  “I’ll spend forever holding you … even if it’s only in my memory.”", "hash": "64751a5e-4c29-4dfb-a243-1407dcc58619"}, {"title": "Finding You (Love Wanted in Texas #4)", "author": "Kelly Elliott", "pgs": 87, "sum": "Storyline: \nIf Grace Johnson knew one thing at all, it was that all men were dirtbags.  All men … except Noah Bennet. “I was lost in his eyes. Lost in his tears. My goal was to pull him out of the darkness … even if it dragged me in as well.”  If Noah Bennet knew one thing at all, it was he needed Grace Johnson.  Needed her … desperately. “My pain was pulling me under … she was my only saving grace.”  Grace is willing to put everything on the line to help bring back the man she is hopelessly in love with. Even if it costs her the future she’s been longing for.  “If finding you means losing a part of me … I’ll do it.”", "hash": "420358eb-1c5d-493b-9271-c9d80a8a06a5"}, {"title": "Promised (One Night #1)", "author": "Jodi Ellen Malpas", "pgs": 61, "sum": "Storyline: \nLivy notices him the moment he walks into the coffee shop. He's heart-stoppingly stunning, with a blue-eyed gaze so piercing she's almost too distracted to take his order. When he walks out the door, she thinks she'll never see him again. Then she finds the note he left on his napkin . . . signed M. All he wants is one night to worship her. No feelings, no commitment, nothing but pleasure. Every defense mechanism Livy has adopted during her solitary life is at risk of being obliterated by this confounding man. He's obnoxious but well-mannered. He's a gentleman but aloof. He's passionate but emotionless. Yet the fascination is so powerful, Livy can't deny him... or herself. M awakens something in Livy, something deep and addictive that she never knew existed -- and that she fears only he can satisfy. But she senses that behind the fast cars, fancy suits, and posh apartment, he's aching inside. To have him, body and soul, she'll have to brave his dark secrets. Delving into his world and breaking down his defenses become her obsession - an obsession that could shatter her heart beyond repair..", "hash": "d75c8b9d-f708-477f-b5ab-9e2b322ad116"}, {"title": "Denied (One Night #2)", "author": "Jodi Ellen Malpas", "pgs": 64, "sum": "Storyline: \nThe passion that burned between Livy and Miller in One Night: Promised may end up destroying them both in this new novel of overwhelming desire and shocking discoveries... He's amazingly wealthy, sinfully gorgeous, and can bring her to heights of pleasure she's never before known. For Livy, there's no turning back. She's determined to be the light in Miller Hart's dark world. Yet this new life comes with a steep price...  Miller knows that the power he possesses hasn't come without sacrifices-but he won't let Livy be one of them. Though he wants nothing more than to have her in every way, his first duty is to protect her at all costs...from his sins, his enemies, and especially himself. But as their insatiable affair intensifies, the two attract the attention of an obsessive-and dangerous-third party. Discovering new revelations about Miller that rock her to the core, Livy will have to decide whether he's ruined beyond repair. And he must face his fear that in order to save her, he may have to lose her after all...", "hash": "1c7c7549-b416-4db5-b4c1-6d3fcba51ced"}, {"title": "The Raven Prince (Princes #1)", "author": "Elizabeth Hoyt", "pgs": 43, "sum": "Storyline: \nThere comes a time in a lady's life... Widowed Anna Wren is having a wretched day. After an arrogant male on horseback nearly squashes her, she arrives home to learn that she is in dire financial straits. When she must do the unthinkable... The Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad temper and boorish behavior. And find employment. When Anna becomes the earl's secretary, it would seem that both their problems are solved. Then she discovers he plans to visit the most notorious brothel in London for his \"manly\" needs. Well! Anna sees red—and decides to assuage her \"womanly\" desires...with the earl as her unknowing lover.", "hash": "3cd85348-b0e4-4127-9299-54c899389999"}, {"title": "The Leopard Prince (Princes #2)", "author": "Elizabeth Hoyt", "pgs": 44, "sum": "Storyline: \nThe One Thing a Lady Must Never Do... Wealthy Lady Georgina Maitland doesn't want a husband, though she could use a good steward to run her estates. One look at Harry Pye, and Georgina knows she's not just dealing with a servant, but a man. Is Fall In Love... Harry has known many aristocrats—including one particular nobleman who is his sworn enemy. But Harry has never met a beautiful lady so independent, uninhibited, and eager to be in his arms.  With Her Servant. Still, it's impossible to conduct a discreet liaison when poisoned sheep, murdered villagers, and an enraged magistrate have the county in an uproar. The locals blame Harry for everything. Soon it's all Georgina can do to keep her head above water and Harry's out of the noose…without missing another night of love.", "hash": "38abe6c3-8a06-4371-809b-70599febd0e5"}]