[{"title": "The Serpent Prince (Princes #3)", "author": "Elizabeth Hoyt", "pgs": 47, "sum": "Storyline: \nWhen the devil meets an angel... Country bred Lucy Craddock-Hayes is content with her quiet life. Until the day she trips over an unconscious man—a naked unconscious an—and loses her innocence forever. He can take her to heaven... Viscount Simon Iddesleigh was nearly beaten to death by his enemies. Now he’s hell-bent on vengeance. But as Lucy nurses him back to health, her honesty startles his jaded sensibilities—even as it ignites a desire that threatens to consume them both. Or to hell... Charmed by Simon’s sly wit, urbane manners, and even his red-heeled shoes, Lucy falls hard and fast for him. Yet as his honor keeps him from ravishing her, his revenge sends his attackers to her door. As Simon wages war on his foes, Lucy wages her own war for his soul using the only weapon she has—her love…", "hash": "2e94176a-9899-4908-ad55-719292b5498c"}, {"title": "The Ice Princess (Princes #3.5)", "author": "Elizabeth Hoyt", "pgs": 11, "sum": "Storyline: \nSEVEN NIGHTS OF SIN  As the madam of Aphrodite's Grotto, the most infamous brothel in London, Coral Smythe knows everything possible about men's needs and desires. Yet she's never experienced the love of a single man-not even that of Captain Isaac Wargate whose hawk-like eyes stare at her with both condemnation...and lust. SEVEN NIGHTS OF ECSTASY  Captain Wargate heartily disapproves of the sensuous madam who always wears a golden mask. She lures his officers from both his ship and their duty. But when Coral herself is offered up as the prize in a game of chance, Wargate impulsively enters...and wins. SEVEN NIGHTS OF LOVE  Now the puritanical navy captain has just seven nights to learn everything he can about the mysterious madam and what she knows of a man's desires. But when Coral is threatened by the new owner of Aphrodite's Grotto, will Wargate take a chance on the woman beneath the mask...and on love?", "hash": "0781d2aa-5c1a-4cc2-b1d7-c9fa7c068133"}, {"title": "To Taste Temptation (Legend of the Four Soldiers #1)", "author": "Elizabeth Hoyt", "pgs": 46, "sum": "Storyline: \nThe ton loves nothing more than a good scandal, and they're giddy with the appearance of wealthy Samuel Hartley. Not only is he self-made, American, and in the habit of wearing moccasins, but he is also notorious for fleeing a battle in which several English gentlemen lost their lives. What the ton doesn't know, though, is that Samuel is in London because of this massacre. He believes his regiment was given up to the enemy and won't rest until he finds the traitor. Lady Emeline Gordon is captivated with Samuel. Not only does he defy convention with his unusual dress, his sensual smile, and his forthright manner, but he survived the battle that killed her beloved brother. Samuel suspects that the person responsible for her brother's death is Jasper Renshaw, Viscount Vale, a family friend since childhood—and Emeline's fiancé. Despite Emeline's belief in Vale's innocence and her refusal to break off her betrothal, she and Samuel begin a passionate affair. But can their relationship survive the fallout from Samuel's investigation?", "hash": "f1889547-0d48-48dc-9254-f7bd33149967"}, {"title": "To Seduce a Sinner (Legend of the Four Soldiers #2)", "author": "Elizabeth Hoyt", "pgs": 45, "sum": "Storyline: \nJasper Renshaw, Viscount Vale, has a problem: he needs to marry and produce an heir to the title. All Jasper wants is to find a lady who will put up with him long enough to wed so he can retreat to his life of debauchery—a life that keeps the haunting memories of his past at bay. Knowing that Jasper is under pressure to marry, Melisande Fleming grasps her fate with both hands and volunteers to wed him. Although Jasper is initially only interested in producing an heir, he soon becomes entranced by his wife—prim and proper by day, wanton by night—and vows to learn her secrets. Melisande, however, is determined to keep her husband at a distance. She has loved, and lost, before, and will do anything to keep him from learning her terrible weakness: she's secretly been in love with him for years. But to her chagrin, her husband pursues her, wooing her as if she were a paramour, not his lady wife. As Melisande and Jasper embark on a passionate game of cat and mouse, secrets from the past begin to resurface...threatening to tear them asunder.", "hash": "3a2f4c78-dd08-4426-9a0f-468f5015b193"}, {"title": "To Beguile a Beast (Legend of the Four Soldiers #3)", "author": "Elizabeth Hoyt", "pgs": 42, "sum": "Storyline: \nCAN A WOUNDED BEAST . . .  Reclusive Sir Alistair Munroe has hidden in his castle ever since returning from the Colonies, scarred inside and out. But when a mysterious beauty arrives at his door, the passions he's kept suppressed for years begin to awaken.  TRUST A BEAUTY WITH A PAST . . .  Running from past mistakes has taken legendary beauty Helen Fitzwilliam from the luxury of the ton to a crumbling Scottish castle . . . and a job as a housekeeper. Yet Helen is determined to start a new life and she won't let dust-or a beast of a man-scare her away.  TO TAME HIS MOST SECRET DESIRES?  Beneath Helen's beautiful façade, Alistair finds a courageous and sensual woman. A woman who doesn't back away from his surliness-or his scars. But just as he begins to believe in true love, Helen's secret past threatens to tear them apart. Now both Beast and Beauty must fight for the one thing neither believed they could ever find-a happy ever after.", "hash": "75d4237e-a4b0-4aea-9531-314cdf467030"}, {"title": "To Desire a Devil (Legend of the Four Soldiers #4)", "author": "Elizabeth Hoyt", "pgs": 42, "sum": "Storyline: \nNothing Is More Intoxicating Reynaud St. Aubyn has spent the last seven years in hellish captivity. Now half mad with fever he bursts into his ancestral home and demands his due. Can this wild-looking man truly be the last earl's heir, thought murdered by Indians years ago?  Or Dangerous Beatrice Corning, the niece of the present earl, is a proper English miss. But she has a secret: No real man has ever excited her more than the handsome youth in the portrait in her uncle's home. Suddenly, that very man is here, in the flesh—and luring her into his bed.  Than Surrendering to a Devil. Only Beatrice can see past Reynaud's savagery to the noble man inside. For his part, Reynaud is drawn to this lovely lady, even as he is suspicious of her loyalty to her uncle. But can Beatrice's love tame a man who will stop at nothing to regain his title—even if it means sacrificing her innocence?", "hash": "a5daacb6-7084-4a65-bd35-4dfebfadcd3b"}, {"title": "Wicked Intentions (Maiden Lane #1)", "author": "Elizabeth Hoyt", "pgs": 49, "sum": "Storyline: \nA man controlled by his desires... Infamous for his wild, sensual needs, Lazarus Huntington, Lord Caire, is searching for a savage killer in St. Giles, London's most notorious slum. Widowed Temperance Dews knows St. Giles like the back of her hand— she's spent a lifetime caring for its inhabitants at the foundling home her family established. Now that home is at risk. A woman haunted by her past... Caire makes a simple offer—in return for Temperance's help navigating the perilous alleys of St. Giles, he will introduce her to London's high society so that she can find a benefactor for the home. But Temperance may not be the innocent she seems, and what begins as cold calculation soon falls prey to a passion that neither can control—one that may well destroy them both. A bargain neither could refuse.", "hash": "15e402c3-07b9-491f-9479-64eb52bf1f8a"}, {"title": "Notorious Pleasures (Maiden Lane #2)", "author": "Elizabeth Hoyt", "pgs": 47, "sum": "Storyline: \nTheir lives were perfect...  Lady Hero Batten, the beautiful sister of the Duke of Wakefield, has everything a woman could want, including the perfect fiancé. True, the Marquis of Mandeville is a trifle dull and has no sense of humor, but that doesn't bother Hero. Until she meets his notorious brother...  Until they met each other. Lord Griffin Reading is far from perfect - and he likes it that way. How he spends his days is a mystery, but all of London knows he engages in the worst sorts of drunken revelry at night. Hero takes an instant dislike to him, and Griffin thinks that Hero, with her charities and faultless manners, is much too impeccable for society, let alone his brother. Yet their near-constant battle of wits soon sparks desire—desire that causes their carefully constructed worlds to come tumbling down. As Hero's wedding nears, and Griffin's enemies lay plans to end their dreams forever, can two imperfect people find perfect true love?", "hash": "6ce77cc8-df1b-4578-a05d-97b2238fb0df"}, {"title": "Scandalous Desires (Maiden Lane #3)", "author": "Elizabeth Hoyt", "pgs": 49, "sum": "Storyline: \nCan a pirate learn that the only true treasure lies in a woman's heart? Widowed Silence Hollingbrook is impoverished, lovely, and kind--and nine months ago she made a horrible mistake. She went to a river pirate for help in saving her husband and in the process made a bargain that cost her her marriage. That night wounded her so terribly that she hides in the foundling home she helps run with her brother. Except now that same river pirate is back...and he's asking for her help. \"Charming\" Mickey O'Connor is the most ruthless river pirate in London. Devastatingly handsome and fearsomely intelligent, he clawed his way up through London's criminal underworld. Mickey has no use for tender emotions like compassion and love, and he sees people as pawns to be manipulated. And yet he's never been able to forget the naive captain's wife who came to him for help and spent one memorable night in his bed...talking.  When his bastard baby girl was dumped in his lap--her mother having died--Mickey couldn't resist the Machiavellian urge to leave the baby on Silence's doorstep. The baby would be hidden from his enemies and he'd also bind Silence to him by her love for his daughter.", "hash": "5803202d-97b1-47f9-81af-71061428f110"}, {"title": "Thief of Shadows (Maiden Lane #4)", "author": "Elizabeth Hoyt", "pgs": 47, "sum": "Storyline: \nA MASKED MAN . . .  Winter Makepeace lives a double life. By day he's the stoic headmaster of a home for foundling children. But the night brings out a darker side of Winter. As the moon rises, so does the Ghost of St. Giles-protector, judge, fugitive. When the Ghost, beaten and wounded, is rescued by a beautiful aristocrat, Winter has no idea that his two worlds are about to collide. A DANGEROUS WOMAN . . . Lady Isabel Beckinhall enjoys nothing more than a challenge. Yet when she's asked to tutor the Home's dour manager in the ways of society-flirtation, double-entendres, and scandalous liaisons-Isabel can't help wondering why his eyes seem so familiar-and his lips so tempting. A PASSION NEITHER COULD DENY During the day Isabel and Winter engage in a battle of wills. At night their passions are revealed . . . But when little girls start disappearing from St. Giles, Winter must avenge them. For that he might have to sacrifice everything-the Home, Isabel . . . and his life.", "hash": "5468f9d2-8210-423f-a6dc-9bb41a9b4324"}]