[{"title": "Lord of Darkness (Maiden Lane #5)", "author": "Elizabeth Hoyt", "pgs": 46, "sum": "Storyline: \nWhen Strangers In The Night He lives in the shadows. As the mysterious masked avenger known as the Ghost of St. Giles, Godric St. John's only goal is to protect the innocent of London. Until the night he confronts a fearless young lady pointing a pistol at his head—and realizes she is his wife. Become Lovers... Lady Margaret Reading has vowed to kill the Ghost of St. Giles—the man who murdered her one true love. Returning to London, and to the man she hasn't seen since their wedding day, Margaret does not recognize the man behind the mask. Fierce, commanding, and dangerous, the notorious Ghost of St. Giles is everything she feared he would be—and so much more. Desire Is The Ultimate Danger When passion flares, these two intimate strangers can't keep from revealing more of themselves than they had ever planned. But when Margaret learns the truth—that the Ghost is her husband—the game is up and the players must surrender...to the temptation that could destroy them both.", "hash": "421ff42f-7a50-4261-9671-6e539396d9f3"}, {"title": "Duke of Midnight (Maiden Lane #6)", "author": "Elizabeth Hoyt", "pgs": 46, "sum": "Storyline: \nWHEN A MASKED MAN . . . Twenty years ago Maximus Batten witnessed the brutal murders of his parents. Now the autocratic Duke of Wakefield, he spends his days ruling Parliament. But by night, disguised as the Ghost of St. Giles, he prowls the grim alleys of St. Giles, ever on the hunt for the murderer. One night he finds a fiery woman who meets him toe-to-toe—and won't back down . . .  MEETS HIS MATCH . . . Artemis Greaves toils as a lady's companion, but hiding beneath the plain brown serge of her dress is the heart of a huntress. When the Ghost of St. Giles rescues her from footpads, she recognizes a kindred spirit-and is intrigued. She's even more intrigued when she realizes who exactly the notorious Ghost is by day . . .  DESIRE IGNITES A DANGEROUS PASSION Artemis makes a bold move: she demands that Maximus use his influence to free her imprisoned brother-or she will expose him as the Ghost. But blackmailing a powerful duke isn't without risks. Now that she has the tiger by the tail, can she withstand his ire-or the temptation of his embrace?", "hash": "b6d18bb3-c44b-4f8b-a3d7-39392cba695f"}, {"title": "Darling Beast (Maiden Lane #7)", "author": "Elizabeth Hoyt", "pgs": 41, "sum": "Storyline: \nA MAN CONDEMNED . . . Falsely accused of murder and mute from a near-fatal beating, Apollo Greaves, Viscount Kilbourne has escaped from Bedlam. With the Crown's soldiers at his heels, he finds refuge in the ruins of a pleasure garden, toiling as a simple gardener. But when a vivacious young woman moves in, he's quickly driven to distraction . . .  A DESPERATE WOMAN . . . London's premier actress, Lily Stump, is down on her luck when she's forced to move into a scorched theatre with her maid and small son. But she and her tiny family aren't the only inhabitants—a silent, hulking beast of a man also calls the charred ruins home. Yet when she catches him reading her plays, Lily realizes there's more to this man than meets the eye. OUT OF ASH, DESIRE FLARES Though scorching passion draws them together, Apollo knows that Lily is keeping secrets. When his past catches up with him, he's forced to make a choice: his love for Lily . . . or the explosive truth that will set him free.", "hash": "8cba93a1-0f50-4327-aa1a-1d52ddd58dbb"}, {"title": "Confessions of a Shopaholic (Shopaholic #1)", "author": "Sophie Kinsella", "pgs": 113, "sum": "Storyline: \nMEET BECKY BLOOMWOOD, AN IRRESISTIBLE HEROINE WITH A BIG HEART, BIG DREAMS --- AND JUST ONE LITTLE WEAKNESS ... Becky Bloomwood has what most twenty-five-year-olds only dream of: a flat in London's trendiest neighborhood, a troupe of glamorous socialite friends, and a closet brimming with the season's must-haves. The only trouble is, she can't actually afford it --- not any of it. Her job writing at Successful Saving magazine not only bores her to tears, it doesn't pay much at all. Still, how can she resist that perfect pair of shoes? Or the divine silk blouse in the window of that ultra-trendy boutique? But lately Becky's been chased by dismal letters from Visa and the Endwich Bank --- letters with large red sums she can't bear to read --- and they're getting ever harder to ignore. She tries cutting back; she even tries making more money. But none of her efforts succeeds. Her only consolation is to buy herself something ... just a little something ... Finally, a story arises that Becky actually cares about, and her front-page article catalyzes a chain of events that will transform her life --- and the lives of those around her --- forever.", "hash": "8457f78d-771a-466e-8b48-ba6ec00ce8dc"}, {"title": "Shopaholic Takes Manhattan (Shopaholic #2)", "author": "Sophie Kinsella", "pgs": 130, "sum": "Storyline: \nThe irresistible heroine of Confessions of a Shopaholic and Shopaholic Ties the Knot is back! And this time Becky Bloomwood and her credit cards are headed across the Atlantic....  With her shopping excesses (somewhat) in check and her career as a TV financial guru thriving, Becky's biggest problem seems to be tearing her entrepreneur boyfriend, Luke, away from work for a romantic country weekend. And worse, figuring out how to pack light. But packing takes on a whole new meaning when Luke announces he's moving to New York for business--and he asks Becky to go with him! Before you can say \"Prada sample sale,\" Becky has landed in the Big Apple, home of Park Avenue penthouses and luxury boutiques.  Surely it's only a matter of time until she becomes an American TV celebrity, and she and Luke are the toast of Gotham society. Nothing can stand in their way, especially with Becky's bills miles away in London. But then an unexpected disaster threatens her career prospects, her relationship with Luke, and her available credit line! Shopaholic Takes Manhattan--but will she have to return it?", "hash": "64c4bb34-d23c-4dbf-8ab1-4e80a8876322"}, {"title": "Shopaholic Ties the Knot (Shopaholic #3)", "author": "Sophie Kinsella", "pgs": 142, "sum": "Storyline: \nLife has been good for Becky Bloomwood: She’s become the best personal shopper at Barneys, she and her successful entrepreneurial boyfriend, Luke, are living happily in Manhattan’s West Village, and her new next-door neighbor is a fashion designer! But with her best friend, Suze, engaged, how can Becky fail to notice that her own ring finger is bare? Not that she’s been thinking of marriage (or diamonds) or anything . . . Then Luke proposes! Bridal registries dance in Becky’s head. Problem is, two other people are planning her wedding: Becky’s overjoyed mother has been waiting forever to host a backyard wedding, with the bride resplendent in Mum’s frilly old gown. While Luke’s high-society mother is insisting on a glamorous, all-expenses-paid affair at the Plaza. Both weddings for the same day. And Becky can’t seem to turn down either one. Can everyone’s favorite shopaholic tie the knot before everything unravels?", "hash": "216f449d-fca3-40f2-915b-71086325ba2b"}, {"title": "Shopaholic and Sister (Shopaholic #4)", "author": "Sophie Kinsella", "pgs": 129, "sum": "Storyline: \nIrresistible, one-woman shopping phenomenon Becky Bloomwood is back in this hilarious, heartwarming, New York Times bestselling tale of married life, best friends, and long-lost sisters (and the perils of simply having to own an Angel handbag!", "hash": "e27f235b-e753-4af6-b9e2-f057f09c8c64"}, {"title": "Shopaholic & Baby (Shopaholic #5)", "author": "Sophie Kinsella", "pgs": 139, "sum": "Storyline: \nBecky Brandon (nee Bloomwood) is pregnant! She couldn't be more overjoyed-especially since discovering that shopping cures morning sickness. Everything has got to be perfect for her baby: from the designer nursery . . . to the latest, coolest pram . . . to the celebrity, must-have obstetrician.  But when the celebrity obstetrician turns out to be her husband Luke's glamorous, intellectual ex-girlfriend, Becky's perfect world starts to crumble. She's shopping for two . . . but are there three in her marriage?", "hash": "7934587b-db55-41a2-8cc3-d3ed2d26796c"}, {"title": "Mini Shopaholic (Shopaholic #6)", "author": "Sophie Kinsella", "pgs": 154, "sum": "Storyline: \nSophie Kinsella has dazzled readers with her irresistible Shopaholic novels--sensational international bestsellers that have garnered millions of devoted fans and catapulted her into the first rank of contemporary storytellers. Now her beloved heroine Becky Brandon (nee Bloomwood) returns in a hilarious tale of married life, toddlerhood, and the perils of trying to give a fabulous surprise party--on a budget!  Becky Brandon thought motherhood would be a breeze and that having a daughter was a dream come true: a shopping friend for life! But it's trickier than she thought. Two-year-old Minnie has a quite different approach to shopping.  Minnie creates havoc everywhere she goes, from Harrods to her own christening. Her favorite word is \"Mine!\" and she's even trying to get into eBay! On top of everything else, Becky and Luke are still living with her parents (the deal on house #4 has fallen through), when suddenly there's a huge financial crisis.  With people having to \"cut back,\" Becky decides to throw a surprise party for Luke to cheer everyone up. But when costs start to spiral out of control, she must decide whether to accept help from an unexpected source--and therefore run the risk of hurting the person she loves.  Will Becky be able to pull off the celebration of the year? Will she and Luke ever find a home of their own? Will Minnie ever learn to behave? And . . . most important . . . will Becky's secret wishes ever come true?", "hash": "88c7e5ff-3680-47bf-867c-21989dd59907"}, {"title": "Shopaholic to the Stars (Shopaholic #7)", "author": "Sophie Kinsella", "pgs": 155, "sum": "Storyline: \nSophie Kinsella returns to her beloved Shopaholic series with Becky Brandon (née Bloomwood) newly arrived in Hollywood and starry-eyed. She and her two-year-old daughter, Minnie, have relocated to L.A. to join Becky’s husband, Luke, who is there to handle PR for famous actress Sage Seymour. Becky can’t wait to start living the A-list lifestyle, complete with celebrity sightings, yoga retreats, and shopping trips to Rodeo Drive. But she really hopes to become a personal stylist—Sage’s personal stylist—if only Luke would set up an introduction. Then, unexpectedly, Becky is offered the chance to dress Sage’s archrival, and though things become a bit more complicated, it’s a dream come true! Red carpet premieres, velvet ropes, paparazzi clamoring for attention—suddenly Becky has everything she’s ever wanted. Or does she?", "hash": "23fb2713-cbc0-4cab-a675-23757b5d320d"}]