[{"title": "Fast Track (Buchanan-Renard #12)", "author": "Julie Garwood", "pgs": 34, "sum": "Storyline: \nA corrupt congressman, a mother’s secrets, and a sizzling romance ignite passion and suspense in the new novel from #1 New York Times bestselling author Julie Garwood. Cordelia Kane has always been a daddy’s girl—her father raised her alone after her mother died in a car crash when Cordelia was just two years old. So when he has a serious heart attack, Cordelia is devastated, and the emotion is only intensified by the confusion she feels when he reveals the shocking truth about her mother. Cordelia can’t suppress her curiosity about the woman who gave birth to her, and when she discovers the answers to her questions lie in Sydney, Australia, she travels there to get them. Hotel magnate Aiden Madison is Cordelia’s best friend’s older brother. He’s oblivious to the fact that she’s had a crush on him for years. When he gets railroaded into taking her along to Sydney on his company jet, he unknowingly puts her life at risk. He’s recently angered a powerful congressman by refusing to purchase overvalued land. Congressman Chambers is not a man to let such an offense slide, and he has the resources to get even and to get what he wants. In Australia sparks are flying between Cordelia and Aiden, but multiple attempts on Aiden’s life are made while Cordelia is with him, and he realizes he must put a stop to the madness before he loses the thing he values most.", "hash": "f394b198-4217-4ccb-8cf9-892563cd98f2"}, {"title": "Hotshot (Buchanan-Renard #11)", "author": "Julie Garwood", "pgs": 41, "sum": "Storyline: \n#1 New York Times bestselling author Julie Garwood returns with a novel of family drama, suspense, and—of course—romance. Peyton Lockhart and her sisters have inherited Bishop’s Cove, a small, luxurious oceanfront resort, but it comes with a condition: The girls must run the resort for one year and show a profit—only then will they own it. A graduate of a prestigious French culinary school, Peyton has just lost her job as a food critic. Out of work and in a bad place personally, a year doing something completely different sounds wonderful. There are countless challenges and too many people who want to stop the sisters from succeeding. Among them are Peyton’s contentious cousins, who are outraged that they didn’t inherit the resort, as well as a powerful group of land developers who have been eyeing the coveted beachfront property. It’s soon apparent to Peyton that their efforts are being sabotaged, but she refuses to let the threats scare her—until she’s nearly killed. She calls on her childhood friend and protector, Finn MacBain, now with the FBI, and asks for his help. He saved her life once; he can do it again.", "hash": "d76fd13f-b2de-4a60-bad1-f19e2bb06191"}, {"title": "Sweet Talk (Buchanan-Renard #10)", "author": "Julie Garwood", "pgs": 41, "sum": "Storyline: \nAttorney and IRS agent Olivia Mackenzie is the kind of tough, wise-cracking, powerful woman fans expect from a Garwood protagonist—but this time she has outdone herself. Olivia is not just any woman, she is every woman; flawed in the familiar ways so many of us are. On the trail of an elaborate Ponzi scheme, one that threatens to ruin the lives of naïve and unsuspecting victims, Olivia suddenly finds her own life is in danger after she asks questions of the wrong people. She is accustomed to fighting for the underdog, but being vulnerable herself is a very different story. Smart enough to know when enough is enough, Olivia calls for reinforcements. When she meets FBI Agent Grayson Kincaid there is an immediate and obvious attraction, palpable on both sides. Together they make an excellent team to fight corruption but Olivia is also fighting the immediate and intense attraction she feels for Agent Kincaid, and that may be a battle she is bound to lose.", "hash": "7cb88244-6e8b-46a1-addf-00a83395d452"}, {"title": "The Ideal Man (Buchanan-Renard #9)", "author": "Julie Garwood", "pgs": 34, "sum": "Storyline: \nNew York Times bestselling author Julie Garwood delivers a contemporary romance that's pulse-pounding in every sense of the word. Dr. Ellie Sullivan has just completed her residency at a large urban hospital. While jogging in a park nearby, she witnesses the shooting of an FBI agent in pursuit of wanted criminals, a couple identified as the Landrys. The only person to see the shooter's face, Ellie is suddenly at the center of a criminal investigation. Agent Max Daniels takes over the Landry case. A no-nonsense lawman, he's definitely not the ideal man that Ellie has always imagined, yet she's attracted to him in a way she can't explain. Ellie heads home to Winston Falls, South Carolina, to attend her sister's wedding. Shortly after she arrives, though, she receives a surprise visitor: Max Daniels. The Landrys have been captured, and she'll be called to testify. But they've been captured before, and each time the witnesses are scared into silence-or disappear before they can take the stand. Max vows to be Ellie's shadow until the trial, and it isn't long before sparks fly.", "hash": "4e681fc7-bfba-4d79-9b11-d730cfc040d1"}, {"title": "Sizzle (Buchanan-Renard #8)", "author": "Julie Garwood", "pgs": 34, "sum": "Storyline: \nNew York Times-bestselling author Garwood weaves magnificent stories of passion, adventure, and intrigue. Now she raises the heat and spices up the action with a sexy, smart, daring new heroine and a smoldering thriller.", "hash": "53f0423f-8cf1-4ae9-9923-45875a806b1f"}, {"title": "Fire and Ice (Buchanan-Renard #7)", "author": "Julie Garwood", "pgs": 34, "sum": "Storyline: \nFresh from her incredible smash-hit historical romance Shadow Music, \"New York Times\" bestselling author Julie Garwood returns to contemporary romantic suspense with this wonderfully sexy, exhilarating blockbuster. Filled with sizzling passion and breathless adventure, Fire and Ice features a feisty heroine whom Garwood's devoted readers already know and love from her hugely popular novel Murder List. Sophie Rose, a tough and determined newspaper reporter, is the daughter of Bobby Rose, a suave, charming, and handsome gentleman who also happens to be a notorious big-time thief sought by every law-enforcement agency in the country. When the major Chicago daily where she works insists she write an expose about her roguish father, Sophie refuses, quits her job, and goes to work at a small newspaper. Far from her onetime high-powered crime beat, she now covers local personalities such as the quirky winner of several area 5K runs whose trademark is goofy red socks. Those red socks-with Sophie's business card neatly tucked inside-are practically all that's found after runner William Harrington is killed near Prudhoe Bay, Alaska, seemingly the victim of a brutal death by polar bear. The Alaska cops want to know why Harrington carried Sophie's card. With an unerring nose for a good story, she heads north. What Sophie doesn't realize is that on her journey from Chicago to Prudhoe Bay, danger follows in her wake. After one attempt on her life, she's been assigned brash but sexy Jack MacAlister as a bodyguard by the cautious FBI. Amid great peril and deadly intrigue in the unforgiving Alaskan terrain, she and Jack form an uneasy alliance sparked with sensual attraction. But they will soon be fighting more than their growing passion for each other. Powerful forces will stop at nothing to prevent the exposure of the sinister conspiracy Sophie and Jack are about to uncover. Captivating mystery, unyielding desire, unrelenting action in a setting both beautiful and lethal-Julie Garwood weaves these thrilling elements into a heat-generating masterpiece of romantic suspense.", "hash": "f23cf8a8-de5c-40f7-ace8-cfde772d3a39"}, {"title": "Shadow Dance (Buchanan-Renard #6)", "author": "Julie Garwood", "pgs": 37, "sum": "Storyline: \nJordan Buchanan is thrilled that her brother and best friend are tying the knot. The wedding is a lavish affair–for the marriage of Dylan Buchanan and Kate MacKenna is no ordinary occasion. It represents the joining of two family dynasties. The ceremony and reception proceed without a hitch–until a crasher appears claiming to be a MacKenna guest. The disheveled and eccentric professor of medieval history warns that there’s “bad blood” between the couple’s clans, stemming from an ancient feud that originated in Scotland, and involving the Buchanan theft of a coveted MacKenna treasure. Jordan has always led a cautious life and has used her intelligence and reason to become a successful businesswoman. So she is intrigued but skeptical of the professor’s claims that the feud has been kept alive by the grave injustices the Buchanans have perpetrated over the centuries. But when Noah Clayborne, a close family friend and a man who has never let a good time or a pretty girl pass him by, accuses Jordan of being trapped in her comfort zone, she determines to prove him wrong and sets out on a spontaneous adventure to the small, dusty town of Serenity, Texas, to judge the professor’s research for herself. Maneuvering through a close-knit community in which everyone knows everyone else’s business, Jordan never anticipates the danger and intrigue that lie in her path, nor the threat that will shadow her back to Boston, where even in familiar surroundings, her life is at risk. A powerful thug who rules by fear, a man who harbors a simmering secret, and an unexpected romance that pierces all defenses–beloved author Julie Garwood weaves these dazzling elements into a brilliant novel of romantic suspense. Shadow Dance is a searing tango of passion and peril.", "hash": "8b772751-12bd-4e57-beae-49441da51a45"}, {"title": "Slow Burn (Buchanan-Renard #5)", "author": "Julie Garwood", "pgs": 35, "sum": "Storyline: \nEvery fire begins with a little heat–and in Slow Burn, bestselling author Julie Garwood provides the spark, skillfully blending pulse-pounding action, intense emotion, and characters with grit and heart. The result is an electrifying novel of romantic suspense that will have readers burning through the pages. An unpretentious beauty who radiates kindness, Kate MacKenna doesn’t have a bad bone in her body–or an enemy in the world. So why are bombs igniting everywhere she goes? The first explosion brings her face-to-face with a handsome Charleston police detective. The second sends her into the arms of her best friend’s brother–a Boston cop who’s a little too reckless and way too charming for comfort. But Dylan Buchanan won’t let emotion prevent him from doing his job: Someone is trying to kill Kate, and Dylan is the only one standing between her and the monster who wants her dead.", "hash": "65682c83-4480-4d59-8932-52b537b98853"}, {"title": "Killjoy (Buchanan-Renard #3)", "author": "Julie Garwood", "pgs": 49, "sum": "Storyline: \nAvery Delaney has always tried to put the past far behind her. Abandoned by her rapacious, conniving mother when she was only three days old, Avery was raised by her grandmother and beloved aunt Carolyn. Then, when she was eleven, she witnessed her grandmother's violent death, before Avery herself was shot and left for dead. Miraculously she survived. The man responsible is serving time in a Florida prison. This traumatic experience propels Avery into a life of law and order. Her razor-sharp mind and ability to gather data and decipher evidence has made Avery an expert crime analyst for the FBI. But soon she will have to use every one of her adroit skills on a case that hits painfully close to home. Avery's workaholic aunt, Carolyn Salvetti, is certain her (hopefully soon-to-be ex) husband sent her the gold embossed reservation to the posh Utopia Spa in the mountains of Colorado. At first she is resistant, but then figures it will be a welcome respite from the cutthroat advertising business, not to mention a networking extravaganza. Plus she persuades her niece to join her for the two weeks of luxury and decadence. But Carolyn never makes it to Utopia. Under false pretenses, she is taken to an isolated retreat by a handsome stranger with a dazzling smile, suave demeanor, and the darkest of motives. His name is Monk, a hired assassin. Now, with scant clues and fewer resources, Avery must track down and save Carolyn--and outmaneuver a brilliant killer who is part of an elaborate plot of madness and lethal vengeance.", "hash": "cd55672c-4a83-490a-a2be-0f66b9e7b417"}, {"title": "Mercy (Buchanan-Renard #2)", "author": "Julie Garwood", "pgs": 50, "sum": "Storyline: \n#1 New York Times bestselling author Julie Garwood takes readers from New Orleans' exclusive Garden District to the backwoods of Louisiana's mysterious bayou country in an unforgettable novel of passion and suspense that cuts straight to the heart. When esteemed Justice Department attorney Theo Buchanan is struck ill at a New Orleans gala, Dr. Michelle Renard works fast to save his life. Soon, Theo finds himself in a race to save her when Michelle is targeted by a deadly crime ring. They call themselves the Sowing Club, a devious foursome driven by greed to accumulate millions in a secret bank account. Now they're dead set on silencing Michelle, who might know the secret behind the killing of one of their wives. Dodging a world-class hit man and a band of cunning criminals, Michelle and Theo walk a narrow path between passion and survival", "hash": "3781f207-41f0-43de-acfa-333c16832c03"}]