[{"title": "Wedding Night ", "author": "Sophie Kinsella", "pgs": 149, "sum": "Storyline: \nLottie just knows that her boyfriend is going to propose, but then his big question involves a trip abroad — not a trip down the aisle. Completely crushed, Lottie reconnects with an old flame, and they decide to take drastic action. No dates, no moving in together, they’ll just get married . . . right now. Her sister, Fliss, thinks Lottie is making a terrible mistake, and will do anything to stop her. But Lottie is determined to say “I do,” for better, or for worse.", "hash": "768eea4a-4bca-422f-a6d8-e743477bc216"}, {"title": "Twenties Girl ", "author": "Sophie Kinsella", "pgs": 168, "sum": "Storyline: \nLara Lington has always had an overactive imagination, but suddenly that imagination seems to be in overdrive. Normal professional twenty-something young women don't get visited by ghosts. Or do they? When the spirit of Lara's great-aunt Sadie-a feisty, demanding girl with firm ideas about fashion, love, and the right way to dance-mysteriously appears, she has one request: Lara must find a missing necklace that had been in Sadie's possession for more than seventy-five years, because Sadie cannot rest without it. Lara and Sadie make a hilarious sparring duo, and at first it seems as though they have nothing in common. But as the mission to find Sadie's necklace leads to intrigue and a new romance for Lara, these very different \"twenties\" girls learn some surprising truths from and about each other. Written with all the irrepressible charm and humor that have made Sophie Kinsella's books beloved by millions, Twenties Girl is also a deeply moving testament to the transcendent bonds of friendship and family.", "hash": "41ca9cb9-9ea1-4d2a-8723-1a92e303c2d7"}, {"title": "The Undomestic Goddess ", "author": "Sophie Kinsella", "pgs": 134, "sum": "Storyline: \nWorkaholic attorney Samantha Sweeting has just done the unthinkable. She’s made a mistake so huge, it’ll wreck any chance of a partnership.  Going into utter meltdown, she walks out of her London office, gets on a train, and ends up in the middle of nowhere. Asking for directions at a big, beautiful house, she’s mistaken for an interviewee and finds herself being offered a job as housekeeper. Her employers have no idea they’ve hired a lawyer–and Samantha has no idea how to work the oven. She can’t sew on a button, bake a potato, or get the #@%# ironing board to open. How she takes a deep breath and begins to cope–and finds love–is a story as delicious as the bread she learns to bake.  But will her old life ever catch up with her? And if it does…will she want it back?", "hash": "f1be35ee-0320-447e-95ec-c168d7852494"}, {"title": "Can You Keep a Secret? ", "author": "Sophie Kinsella", "pgs": 110, "sum": "Storyline: \nMeet Emma Corrigan, a young woman with a huge heart, an irrepressible spirit, and a few little secrets: Secrets from her boyfriend: I've always thought Connor looks a bit like Ken. As in Barbie and Ken. Secrets from her mother: I lost my virginity in the spare bedroom with Danny Nussbaum while Mum and Dad were downstairs watching Ben-Hur. Secrets she wouldn't share with anyone in the world: I have no idea what NATO stands for. Or even what it is. Until she spills them all to a handsome stranger on a plane. At least, she thought he was a stranger.…Until Emma comes face-to-face with Jack Harper, the company's elusive CEO, a man who knows every single humiliating detail about her...", "hash": "85bfc170-07c9-4e38-9b7b-4a610531d0ed"}, {"title": "Finding Audrey ", "author": "Sophie Kinsella", "pgs": 72, "sum": "Storyline: \nAn anxiety disorder disrupts fourteen-year-old Audrey’s daily life. She has been making slow but steady progress with Dr. Sarah, but when Audrey meets Linus, her brother’s gaming teammate, she is energized. She connects with him. Audrey can talk through her fears with Linus in a way she’s never been able to do with anyone before. As their friendship deepens and her recovery gains momentum, a sweet romantic connection develops, one that helps not just Audrey but also her entire family.", "hash": "4eb47783-79d4-4e76-bff1-4cdafd2ae988"}, {"title": "I've Got Your Number ", "author": "Sophie Kinsella", "pgs": 138, "sum": "Storyline: \nI’ve lost it. :( The only thing in the world I wasn’t supposed to lose. My engagement ring. It’s been in Magnus’s family for three generations. And now the very same day his parents are coming, I’ve lost it. The very same day! Do not hyperventilate, Poppy. Stay positive :) !! Poppy Wyatt has never felt luckier. She is about to marry her ideal man, Magnus Tavish, but in one afternoon her “happily ever after” begins to fall apart. Not only has she lost her engagement ring in a hotel fire drill but in the panic that follows, her phone is stolen. As she paces shakily around the lobby, she spots an abandoned phone in a trash can. Finders keepers! Now she can leave a number for the hotel to contact her when they find her ring. Perfect! Well, perfect except that the phone’s owner, businessman Sam Roxton, doesn’t agree. He wants his phone back and doesn’t appreciate Poppy reading his messages and wading into his personal life. What ensues is a hilarious and unpredictable turn of events as Poppy and Sam increasingly upend each other’s lives through emails and text messages. As Poppy juggles wedding preparations, mysterious phone calls, and hiding her left hand from Magnus and his parents . . . she soon realizes that she is in for the biggest surprise of her life.", "hash": "2a639194-64ba-4f45-ac84-5817b8147fbe"}, {"title": "Remember Me? ", "author": "Sophie Kinsella", "pgs": 97, "sum": "Storyline: \nWhen twenty-eight-year-old Lexi Smart wakes up in a London hospital, she’s in for a big surprise. Her teeth are perfect. Her body is toned. Her handbag is Vuitton. Having survived a car accident—in a Mercedes no less—Lexi has lost a big chunk of her memory, three years to be exact, and she’s about to find out just how much things have changed. Somehow Lexi went from a twenty-five-year-old working girl to a corporate big shot with a sleek new loft, a personal assistant, a carb-free diet, and a set of glamorous new friends. And who is this gorgeous husband—who also happens to be a multimillionaire? With her mind still stuck three years in reverse, Lexi greets this brave new world determined to be the person she…well, seems to be. That is, until an adorably disheveled architect drops the biggest bombshell of all. Suddenly Lexi is scrambling to catch her balance. Her new life, it turns out, comes complete with secrets, schemes, and intrigue. How on earth did all this happen? Will she ever remember? And what will happen when she does? With the same wicked humor and delicious charm that have won her millions of devoted fans, Sophie Kinsella, author of the #1 New York Times bestseller Shopaholic & Baby, returns with an irresistible new novel and a fresh new heroine who finds herself in a life-changing and utterly hilarious predicament…", "hash": "85a71530-ebe3-44b2-8d65-19d3ab00e5cd"}, {"title": "Club Shadowlands (Masters of the Shadowlands #1)", "author": "Cherise Sinclair", "pgs": 27, "sum": "Storyline: \nHer car disabled during a tropical storm, Jessica Randall discovers the isolated house where she's sheltering is a private bondage club. At first shocked, she soon becomes aroused watching the interactions between the Doms and their subs. But she's a professional woman--an accountant--and surely isn't a submissive...is she? Master Z hasn't been so attracted to a woman in years. But the little sub who has wandered into his club intrigues him. She's intelligent. Reserved. Conservative. After he discovers her interest in BDSM, he can't resist tying her up and unleashing the passion she hides within.", "hash": "8be23dbe-eaad-4ead-bda3-435101f9c1ab"}, {"title": "Dark Citadel (Masters of the Shadowlands #2)", "author": "Cherise Sinclair", "pgs": 33, "sum": "Storyline: \nAfter Kari breaks up with her date during Beginner's Night at Club Shadowlands, she's given the option to continue with an experienced dominant. Despite her steamy fantasies about BDSM, the inexperienced schoolteacher plans to simply observe. Yet under the unyielding hands of Master Dan, she not only participates, but gives him everything he asks for. There is nothing she can hide from him. Not her passion...or her love. Publisher's Note: This book contains explicit sexual content, graphic language, and situations some readers may find objectionable: Anal play/intercourse, BDSM theme and content (including/not limited to bondage, caning, restraint, spanking, tethering) exhibitionism, voyeurism.", "hash": "5e6442f6-c7e7-4c30-ade8-0bd5875f1197"}, {"title": "Breaking Free (Masters of the Shadowlands #3)", "author": "Cherise Sinclair", "pgs": 37, "sum": "Storyline: \nBeth must yield to become aroused, but she's too scared to give up control. The last thing she wants is a ruthless, powerful Dom. But that's just what she gets, and exactly what she needs... A sadistic husband left Beth scarred, inside and out. Only at the Shadowlands BDSM club does she feel like a woman. But her fears limit her to Doms who won't overwhelm her? the very ones who cannot arouse her. The Master of the Shadowlands gives her an ultimatum: accept the Dom he assigns or lose her membership. The last thing Beth wants is a ruthless, powerful Dom, but that's just what she gets. Asked to take on a problem sub, Nolan sees the issue immediately? although truly submissive, the little redhead is too scared to relinquish control and her Doms have let her get away with it. That will change right now. As Master Nolan takes Beth under command, compelling her submission, she's terrified, but the experienced Dom brings her pleasure, not pain. His only demand is that she never lie to him. Under his capable hands, her body comes alive, and she begins to heal. As he pushes her limits, she learns to trust...and then to love. And she realizes he is beginning to care for her in return. But now her cruel husband has found her, and Master Nolan discovers she's been lying and lying and lying... Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, BDSM theme and elements (including/not limited to bondage, caning, domination, restraint, paddling, spanking, submission, tethering); exhibitionism, ménage, violence.", "hash": "6e57816b-711d-4f42-9601-2a6c34d897d6"}]