[{"title": "Lean on Me (Masters of the Shadowlands #4)", "author": "Cherise Sinclair", "pgs": 45, "sum": "Storyline: \nAndrea wants to submit, but not to just any so-called Dom. He has to be tougher than the slum-bred bullies she grew up with. She'd given up finding a true Dom when her friend finagles her a place as a trainee in an exclusive BDSM club with the powerful Shadowlands Masters. Andrea's thrilled...and terrified. Forced to accept an unknown submissive into his carefully run trainee program, Master Cullen is furious. Not only is the young woman new to BDSM, but she's unsuited to her role--armoured in leather like a Domme, she's more liable to punch a Dom than kneel. He decides to push her right back out the door. But as he ruthlessly intimidates her, punishes her, then comforts her, his glimpses of the woman inside the emotional armour intrigue him and her utter surrender captures his heart. Although Master Cullen is famous for his unfettered lifestyle, Andrea believes he might be interested in her, until she discovers he's not just a bartender--he's a cop. Maybe he'd overlook her past brush with the law, but when another trainee accuses her of stealing money, Andrea's sure she's lost the Master she wanted with all her heart. Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: BDSM theme and content (includes/not limited to: bondage, spanking, tethering), voyeurism.", "hash": "35e85830-4feb-4c10-9ceb-6fb55209b76d"}, {"title": "Make Me, Sir (Masters of the Shadowlands #5)", "author": "Cherise Sinclair", "pgs": 68, "sum": "Storyline: \nHer job is to make his life miserable. His job is to make her submit. Whose heart will surrender first? Across the country, rebellious BDSM submissives are being systematically kidnapped, one from each club. When her friend falls prey to the slavers, FBI victim specialist Gabrielle volunteers to be bait in a club not yet hit: the Shadowlands. She finds that being a bratty sub comes naturally, especially when she gets to twit the appallingly conservative Master of the trainees. But she soon discovers he's not as stuffy as she'd thought. Or as mean. She'd expected punishment, even humiliation, but she sure never expected to fall in love with a damned lawyer. Courtesy of a prima donna ex-wife, Marcus loathes disobedient submissives. When the club owner insists he admit an incredibly bratty trainee, he's furious. But as he comes to know Gabrielle and sees the alluring sweetness beneath the sass, he starts to fall for her. Unfortunately, Marcus isn't the only one who believes the feisty redhead is a prize worth capturing. And in the world of the slaver, such treasure is worth a hefty fee. Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, strong BDSM theme and elements, violence.", "hash": "bedc2249-5572-49c7-b4e2-569d529b3f27"}, {"title": "To Command and Collar (Masters of the Shadowlands #6)", "author": "Cherise Sinclair", "pgs": 72, "sum": "Storyline: \nDetermined to find the human traffickers preying on Shadowlands’ submissives, Master Raoul gets himself invited to a small slave auction. Once informed, the FBI orders him to reject the limited choices so the slavers will invite him to the big auction. To Raoul’s shock, one of the slaves is the kidnapped friend of a Shadowlands sub. She has a scarred body…and an unbroken spirit. He can’t leave her behind. Ruining the FBI’s carefully laid plans, he buys her. Kimberly’s freedom has come at a devastating price: the other women are still slaves. An FBI raid is their only hope for rescue. Desperate to help the Feds locate the big auction, she agrees to pose as Master Raoul’s slave. Wearing a collar again is terrifying, but under the powerful dominant’s care, Kim starts to heal and then to blossom. This is what she’s been drawn to—and fled from—her entire life. She escaped the slavers who captured her body—can she escape the master who’s captured her heart?", "hash": "30c6c202-8abb-4585-8216-ac565ec03a43"}, {"title": "This is Who I Am (Masters of the Shadowlands #7)", "author": "Cherise Sinclair", "pgs": 67, "sum": "Storyline: \nWhen trying to save a woman from slavers, Sam screwed up. Royally. Now Linda wants nothing to do with him. Or with BDSM. She won’t even admit she’s a masochist. As a dominant and sadist, he can give her what she needs, and when an opportunity arises, he slips into her life, intending to make amends. She’s everything he knew she would be…except for her bullheaded determination to be ‘normal’. Now the horrible time is past, Linda just wants to return to her small conservative town, pick up her quiet life, and be normal. But how can someone who likes pain be ‘normal’? To her dismay, when someone spray-paints her home with obscenities, Sam shows up to rescue her. Again. Doesn’t he understand that the last thing she needs in her life is a sadist? He’s amused by her objections. But his dry sense of humor can’t disguise that he’s tough as nails and dominant and stubborn. He’s not going to let her drive him off this time. Soon she realizes she wants him to stay. When he takes her to the Shadowlands, she feels as if she’s found a home…until she hears a voice from out of her nightmares.", "hash": "bfd6a368-ad5c-4f49-bd19-eca19d0eae68"}, {"title": "If Only (Masters of the Shadowlands #8)", "author": "Cherise Sinclair", "pgs": 86, "sum": "Storyline: \nAfter the last fiasco, Sally gives up. She’ll never find a Dom of her own. Instead the computer whizz is job hunting in between bending the law—just a bit—to unearth the bastards who’d enslaved her friends. The clueless cops and Feds obviously need help. FBI special agents, Galen and Vance, have waited to play with Sally for a long time. When the mischievous submissive returns to the exclusive Shadowlands BDSM club after an ugly relationship, the experienced co-tops are pleased. Realizing she’s suppressing her emotions, the powerful Doms push her—only to find that her sassiness conceals a scarred and vulnerable heart. Shaken by the unexpected emotional exposure, Sally flees the demanding Masters and the Shadowlands. Both Galen and Vance have reasons not to seek a long-term submissive, but when a brutal attack by her ex-Dom sends Sally into their home, the two agents are driven to protect her. To help her. To take her under command. Falling in love isn’t in the plans. But as the little imp brings light into their lives, they begin to want more…until they discover she’s hacked into an organization that delights in burning people alive.", "hash": "dde57837-c804-4c82-8f2e-78f30679d73c"}, {"title": "Show Me, Baby (Masters of the Shadowlands #9)", "author": "Cherise Sinclair", "pgs": 41, "sum": "Storyline: \nA Masters of the Shadowlands Novella After his last lover chose her career over him, Jake knows he wants a woman who will put him at the top of her priorities—as he would with her. One of the trainees, Rainie, has caught his attention. Lush body, a gift for living life to the fullest, always laughing or smiling. Yeah. She trips all his switches. But she’s never given him a second look and that’s damned annoying.  Rainie has been burned enough times that she’s not going to get serious about any man. Sure, the BDSM club trainees are supposed to be looking for a permanent Dom, but no harm, no foul—they don’t need to know she lied. Trainees get to be involved in everything—and with everyone. But there’s one she avoids. Master Jake is always frowning at her. No matter how gorgeous he is, she doesn’t need any disapproving Dom up in her business.  Unfortunately, her best friends are having a double wedding. Little hearts are floating in the air. Every breath is filled with romance. Rainie is doomed.", "hash": "84f53191-345b-4ff2-98af-f31f02dfc73e"}, {"title": "Captive in the Dark (The Dark Duet #1)", "author": "C.J. Roberts", "pgs": 41, "sum": "Storyline: \nCaleb is a man with a singular interest in revenge. Kidnapped as a young boy and sold into slavery by a power-hungry mobster, he has thought of nothing but vengeance. For twelve years he has immersed himself in the world of pleasure slaves searching for the one man he holds ultimately responsible. Finally, the architect of his suffering has emerged with a new identity, but not a new nature. If Caleb is to get close enough to strike, he must become the very thing he abhors and kidnap a beautiful girl to train her to be all that he once was. Eighteen-year-old Olivia Ruiz has just woken up in a strange place. Blindfolded and bound, there is only a calm male voice to welcome her. His name is Caleb, though he demands to be called Master. Olivia is young, beautiful, naïve and willful to a fault. She has a dark sensuality that cannot be hidden or denied, though she tries to accomplish both. Although she is frightened by the strong, sadistic, and arrogant man who holds her prisoner, what keeps Olivia awake in the dark is her unwelcome attraction to him. WARNING: This book contains very disturbing situations, dubious consent, strong language, and graphic violence.", "hash": "87cb4a48-7278-4305-a35a-10b78241d265"}, {"title": "Seduced in the Dark (The Dark Duet #2)", "author": "C.J. Roberts", "pgs": 74, "sum": "Storyline: \nBOOK TWO OF THE DARK DUET The exciting, titillating, and action-filled conclusion to Captive in the Dark. What is the price of redemption? Rescued from sexual slavery by a mysterious Pakistani officer, Caleb carries the weight of a debt that must be paid in blood. The road has been long and fraught with uncertainty, but for Caleb and Livvie, it’s all coming to an end. Can he surrender the woman he loves for the sake of vengeance?  Or will he make the ultimate sacrifice? Quote:  It seemed to Caleb, the nature of human beings revolved around one empirical truth: we want what we cannot have. For Eve, it was the fruit of the forbidden tree. For Caleb, it was Livvi", "hash": "52e0e64d-8da8-483f-9d1e-179f5d42fe33"}, {"title": "Epilogue (The Dark Duet #3)", "author": "C.J. Roberts", "pgs": 35, "sum": "Storyline: \nI'm writing this because you begged. You know how I love the begging. In fact, you probably know too many things and know them far too well. Who am I? Well, that's what I'm trying to figure out. I was a whore in my youth, a killer since my adolescence, and a monster as a man. I am the man who kidnapped Livvie. I am the man who held her in a dark room for weeks. But, most importantly, I am the man she loves. She loves me. It's quite sick, isn't it? Of course, there's more to our story than can be surmised in a few short sentences, but I'm at a loss for justifying my behavior back then. I assume if you're reading this, I don't need to make those justifications. You've already made your own. You're reading this because you want to know about the rest of the story. You want to know what happened that warm summer night in September of 2010, the night I met Livvie at The Paseo. It was the night my life changed all over again. It didn't happen exactly as Livvie said. She's been very kind to me in the retelling of our story. The truth is far more...complicated.", "hash": "5ce4b2f9-084f-4e5f-b169-5ad7e1a9e213"}, {"title": "Connected (Connections #1)", "author": "Kim Karr", "pgs": 51, "sum": "Storyline: \nWhat if a ‘Once in a Lifetime’ could happen twice?  Suffering from a past full of tragedy, Dahlia London's soul has been left completely shattered. Happily ever after is a far cry from reality in her world. But, when she is reconnected with her past, the bonds that form are irrefutable. When River Wilde, lead singer of The Wilde Ones, comes back into Dahlia’s life, the intensity that fires their relationship combined with underlying feelings that have never died lead her to believe she has met her soulmate.  Struggling with confusion as old connections fade and new ones begin, Dahlia's grief begins to lift—but guilt remains. River wants to be the one to mend all that is torn within her.  But with a past that is never really gone, can their future survive?", "hash": "ca294127-a851-4652-83ed-6a7903e9a1ff"}]