[{"title": "Torn (Connections #2)", "author": "Kim Karr", "pgs": 45, "sum": "Storyline: \nRock star River Wilde brought Dahlia London back from the brink of hopelessness with his unwavering love and devotion. But their entangled history is about to test the strength of their relationship? Dahlia was certain she had found true love and met her 'Once in a Lifetime’ when she reconnected with River. But Dahlia’s world comes crashing down when someone from her past resurfaces, and all of River’s carefully hidden secrets are exposed. River wants to show Dahlia that life isn’t about waiting for the storm to pass—it’s about dancing in the rain. But how many times can one broken heart be mended?  Will River and Dahlia be able to stay together or will they be torn apart?", "hash": "b3980d3a-c6db-4254-a41e-1408c3fdf898"}, {"title": "Dazed (Connections #2.5)", "author": "Kim Karr", "pgs": 19, "sum": "Storyline: \nA Connection Series Novella featuring Aerie Daniels and Jagger Kennedy (River Wilde's cousin) Jagger Kennedy never went looking for fame, he just fell into it. After scoring a major modeling contract, his clean-cut good looks and charm catapulted his career. But when his actress girlfriend breaks his heart, he moves to L.A. to try his hand at acting. He needs to make a change, and the last thing he’s looking for is love… Aerie Daniels is a woman in control … until she meets Jagger. Her surprising connection with him leaves her stunned, and it’s unlike anything she’s ever felt. But just when she lets her walls fall, she makes a startling discovery about him that breaks her fragile heart into a million pieces. To keep from losing the one woman he can’t bear to be without, Jagger is willing to give up anything—including his career. But even that might not be enough to regain Aerie’s shattered trust…", "hash": "68ee43eb-560a-4924-87b0-0306c18aa156"}, {"title": "Mended (Connections #3)", "author": "Kim Karr", "pgs": 42, "sum": "Storyline: \nMUSIC HAS THE POWER TO HEAL ALL…BUT NOT ALL BROKEN HEARTS CAN BE MENDED. Always in control, Xander Wilde considered life on the road to be a perfect fit for him. But when disaster strikes on the Wilde Ones’ latest tour, fate intervenes…and a newly single Ivy Taylor, the only girl he has ever loved, steps back into his life. After moving past her painful breakup with Xander years ago, Ivy was poised to become the next big name in pop music…when suddenly she withdrew from the limelight—the same day she announced her engagement to her controlling agent, Damon Wolf. Xander knows he should keep his distance. But once they’re on the road, he can’t resist pursuing her for a second chance. Yet a jealous Damon can’t let her go—and he’s keeping dangerous secrets that could destroy them all.  When the three of them come together, everything falls apart. But if Xander and Ivy can hold tight to the bond that connects them, they just might have a chance at reclaiming the powerful love they thought they had lost forever...", "hash": "65b1b28c-e90b-4c61-80fb-760909ed3b82"}, {"title": "Blurred (Connections #3.5)", "author": "Kim Karr", "pgs": 19, "sum": "Storyline: \nA Connection Series Novella featuring Ben Covington The story before the love story…. When he lost the only woman he’d ever loved, it seemed there was nothing left to live for. Even as a boy, all Ben Covington ever wanted was to spend forever with Dahlia London, the beautiful girl next door...then one life-altering decision tore them apart and he was forced to leave her. Now, despite having returned to win her back, he’s still alone. She’s with someone else—someone she’s never going to leave. Resigned to a future without his former girlfriend, Ben numbs his broken heart in a haze of liquor and women. But then the only woman who ever even turned his head while he was with his girl reappears unexpectedly. And he’s never forgotten their one incredible night together. But will Ben’s destructive behavior destroy his future with her before it even begins?", "hash": "a957c8ff-77d8-4be7-b951-09100582554b"}, {"title": "Frayed (Connections #4)", "author": "Kim Karr", "pgs": 55, "sum": "Storyline: \nThe Connections series continues with this spin-off novel. He didn’t think, he didn’t question—he just acted. What she wanted, she took—without regard. It was only one night, but it changed everything. After losing his fiancée, Ben Covington is unsure he’ll ever love again. But when he sees Bell Wilde, he’s so deeply drawn to her, that he’s thrown for a loop. Maybe it’s purely sexual chemistry that’s igniting this spark between them...or maybe it’s his second chance at love. Bell has just gotten her life back on track and may not be up for the challenge of Ben Covington. But once they’re reunited, there’s no holding back—even if a secret from Bell’s past just might shatter them both.", "hash": "6c40300d-990e-4942-94ad-f0e76a1b5807"}, {"title": "The Best Man (Blue Heron #1)", "author": "Kristan Higgins", "pgs": 55, "sum": "Storyline: \nSometimes The Best Man Is The One You Least Expect... Faith Holland left her hometown after being jilted at the altar. Now a little older and wiser, she’s ready to return to the Blue Heron Winery, her family’s vineyard, to confront the ghosts of her past, and maybe enjoy a glass of red. After all, there’s some great scenery there.... Like Levi Cooper, the local police chief - and best friend of her former fiancé. There’s a lot about Levi that Faith never noticed, and it’s not just those deep green eyes. The only catch is she’s having a hard time forgetting that he helped ruin her wedding all those years ago. If she can find a minute amidst all her family drama to stop and smell the rosé, she just might find a reason to stay at Blue Heron, and finish that walk down the aisle.", "hash": "64657668-9d59-44d8-8ec2-b05e03a6d3ce"}, {"title": "Waiting On You (Blue Heron #3)", "author": "Kristan Higgins", "pgs": 58, "sum": "Storyline: \nDoes being nobody's fool mean that you're nobody's love? Colleen O'Rourke is in love with love... just not when it comes to herself. Most nights, she can be found behind the bar at the Manningsport, New York, tavern she owns with her twin brother, doling out romantic advice to the lovelorn, mixing martinis and staying more or less happily single. See, ten years ago, Lucas Campbell, her first love, broke her heart... an experience Colleen doesn't want to have again, thanks. Since then, she's been happy with a fling here and there, some elite-level flirting and playing matchmaker to her friends. But a family emergency has brought Lucas back to town, handsome as ever and still the only man who's ever been able to crack her defenses. Seems like maybe they've got some unfinished business waiting for them—but to find out, Colleen has to let her guard down, or risk losing a second chance with the only man she's ever loved.", "hash": "1454dde8-baea-4bb6-8878-da9c19299e8e"}, {"title": "Catch of the Day (Gideon's Cove #1)", "author": "Kristan Higgins", "pgs": 47, "sum": "Storyline: \nFirst date à la Maggie: Take one lovelorn diner owner (me), a generous helping of nosy local gossips, a dollop of envy at married sister's perfect life, a splash of divine intervention (my matchmaking priest). Combine ingredients with one adorable puppy, add a strong but silent lobsterman with a hidden heart of gold and watch the sparks fly.", "hash": "10ac93d1-22b0-4fda-9c5a-34946f15207a"}, {"title": "Somebody to Love (Gideon's Cove #3)", "author": "Kristan Higgins", "pgs": 55, "sum": "Storyline: \nNew York Times and USA Today bestselling author Kristan Higgins is back with a hilarious and heartwarming new story about a rich girl who discovers that a little hard work may be just the thing she needs... After her father loses the family fortune in an insider-trading scheme, single mom Parker Welles is faced with some hard decisions. First order of business: go to Gideon's Cove, Maine, to sell the only thing she now owns—a decrepit house in need of some serious flipping. When her father's wingman, James Cahill, asks to go with her, she's not thrilled...even if he is fairly gorgeous and knows his way around a toolbox. Having to fend for herself financially for the first time in her life, Parker signs on as a florist's assistant and starts to find out who she really is. Maybe James isn't the glib lawyer she always thought he was. And maybe the house isn't the only thing that needs a little TLC.", "hash": "909ed9bc-f99d-49ac-9f50-3388925981cd"}, {"title": "Bully (Fall Away #1)", "author": "Penelope Douglas", "pgs": 43, "sum": "Storyline: \nMy name is Tate. He doesn't call me that, though. He would never refer to me so informally, if he referred to me at all. No, he'll barely even speak to me. But he still won't leave me alone. We were best friends once. Then he turned on me and made it his mission to ruin my life. I've been humiliated, shut out, and gossiped about all through high school. His pranks and rumors got more sadistic as time wore on, and I made myself sick trying to stay out of his way. I even went to France for a year, just to avoid him. But I'm done hiding from him now, and there's no way in hell I'll allow him to ruin my senior year. He might not have changed, but I have. It's time to fight back.  I'm not going to let him bully me anymore. ***This novel contains adult/mature young adult situations. It is only suitable for ages 18+ due to language, violence, and sexual situations.", "hash": "6348cdcf-9669-47ff-a31a-2dfca487c136"}]