[{"title": "Until You (Fall Away #1.5)", "author": "Penelope Douglas", "pgs": 46, "sum": "Storyline: \n***This novel contains graphic sexual content and harsh language. It is only appropriate for adult readers age 18+.  Have you ever been so angry that hitting things felt good? Or so numb that you actually felt high? The past few years have been like that for me. Traveling between fury and indifference with no stops in between. Some people hate me for it, while others are scared of me. But none of them can hurt me, because I don't care about anything or anyone. Except Tatum. I love her so much that I hate her. We used to be friends, but I found out that I couldn't trust her or anyone else. So I hurt her. I pushed her away. But I still need her. The sight of her centers me, and I can pool all of my anger into her. Engaging her, challenging her, bullying her...they are my food, my air, and the last part of me that feels anything human. But she left. She went to France for a year, and came back a different girl. Now, when I push, she pushes back.", "hash": "2d22369e-ef22-42fd-9434-5ba269a3692d"}, {"title": "Rival (Fall Away #2)", "author": "Penelope Douglas", "pgs": 44, "sum": "Storyline: \nFrom the New Adult sensation and New York Times bestselling author of Until You Madoc and Fallon. Two estranged teenagers playing games that push the boundaries between love and war… She’s back. For the two years she’s been away at boarding school, there was no word from her. Back when we lived in the same house, she used to cut me down during the day and then leave her door open for me at night. I was stupid then, but now I’m ready to beat her at her own game… I’m back. Two years and I can tell he still wants me, even if he acts like he’s better than me. But I won’t be scared away. Or pushed down. I’ll call his bluff and fight back. That’s what he wants, right? As long as I keep my guard up, he’ll never know how much he affects me…", "hash": "5be146f2-99b0-4a73-9b25-28607f08bc1a"}, {"title": "The Next Best Thing (Gideon's Cove #2)", "author": "Kristan Higgins", "pgs": 55, "sum": "Storyline: \nLucy Lang isn't looking for fireworks... She's looking for a nice, decent man. Someone who'll mow the lawn, flip chicken on the barbeque, teach their future children to play soccer. But most important... someone who won't inspire the slightest stirring in her heart...or anywhere else. A young widow, Lucy can't risk that kind of loss again. But sharing her life with a cat named Fat Mikey and the Black Widows at the family bakery isn't enough either. So it's goodbye to Ethan, her hot but entirely inappropriate \"friend with privileges\" and hello to a man she can marry. Too bad Ethan Mirabelli isn't going anywhere. As far as he's concerned, what she needs might be right under her nose. But can he convince her that the next best thing can really be forever?", "hash": "5abd7052-2e27-417c-8b2e-759e10e3e0b6"}, {"title": "In Your Dreams (Blue Heron #4)", "author": "Kristan Higgins", "pgs": 59, "sum": "Storyline: \nEmmaline Neal needs a date. Just a date—someone to help her get through her ex-fiancé's wedding without losing her mind. But pickings are slim in Manningsport, New York, population 715. In fact, there's really only one option: local heartthrob Jack Holland. Everyone loves Jack, and he won't get the wrong idea…. After all, Jack Holland would never actually be interested in a woman like Em. Especially not with his beautiful ex-wife creeping around, angling to reunite ever since he rescued a group of teens and became a local hero.  But when the wedding festivities take an unexpectedly passionate turn, Em figures it was just one crazy night. Jack is too gorgeous, too popular, to ever end up with her. So why is she the one he can talk to about his deep, dark feelings? If Em is going to get her dream man, she'll have to start by believing in him…", "hash": "23f08ef5-96ab-411e-a9ba-a7db3154192e"}, {"title": "To All the Boys I've Loved Before (To All the Boys I've Loved Before #1)", "author": "Jenny Han", "pgs": 70, "sum": "Storyline: \nTo All the Boys I’ve Loved Before is the story of Lara Jean, who has never openly admitted her crushes, but instead wrote each boy a letter about how she felt, sealed it, and hid it in a box under her bed. But one day Lara Jean discovers that somehow her secret box of letters has been mailed, causing all her crushes from her past to confront her about the letters: her first kiss, the boy from summer camp, even her sister's ex-boyfriend, Josh. As she learns to deal with her past loves face to face, Lara Jean discovers that something good may come out of these letters after all.", "hash": "a2af1c7f-0e80-4f04-a19b-7c57336df047"}, {"title": "P.S. I Still Love You (To All the Boys I've Loved Before #2)", "author": "Jenny Han", "pgs": 68, "sum": "Storyline: \nLara Jean didn’t expect to really fall for Peter. She and Peter were just pretending. Except suddenly they weren’t. Now Lara Jean is more confused than ever. When another boy from her past returns to her life, Lara Jean’s feelings for him return too. Can a girl be in love with two boys at once? In this charming and heartfelt sequel to the New York Times bestseller To All the Boys I've Loved Before, we see first love through the eyes of the unforgettable Lara Jean. Love is never easy, but maybe that’s part of what makes it so amazing.", "hash": "16c4f85b-533f-4a81-a84e-4b72d4decdcf"}, {"title": "Uncaged (Corps Security #3.5)", "author": "Harper Sloan", "pgs": 24, "sum": "Storyline: \nGreg Cage’s life is more fulfilling than he ever could have imagined. He’s married to the love of his life, has an amazing son, and in a few short months, his family will grow again with the birth of his twin girls. The past year has been a tough one for the Cage family, but they are now on the road to healing by learning to let go of the past and looking forward to their future. When situations beyond his control threaten to take away so much of what Greg holds close to his heart, he has to learn that he doesn't always have the control he tries to maintain in their lives. Will he be able to handle the stress of knowing his wife and newborn daughters are beyond his protection? Join the Cage family as they embark on yet another one of life’s journeys with a rambunctious four-year-old, pregnancy complications, and the fear of the unknown. Will the love that Greg and Melissa share hold true as they fight to overcome the obstacles that face them?", "hash": "6a0df67a-3c21-45a2-8ee2-e15b6c6a709b"}, {"title": "Cooper (Corps Security #4)", "author": "Harper Sloan", "pgs": 55, "sum": "Storyline: \nDo you take me seriously? Because I don’t. I use my jokes and easygoing personality to hide the pain I’ve felt since he took his last breath. I’m adrift without my partner in crime, my best friend…my brother. I can taste the vengeance just within my grasp.  Until she barges into my life. Promising me happiness and a peace I’ve been craving for years. She is the sun to my darkness, the happy to my despair.  But she holds secrets. Just like I do. She holds hers close, where I just pray mine don’t rock the walls we’re trying to build.  Now I’m stuck at a crossroads between my desire for revenge and my craving for her and the life we could have together—and I have no idea which road I should travel.  All I know with crystal clear certainty is that the past has the power to destroy it all.  No cliffhanger. This book is not suitable for younger readers. There is strong language, adult situations, and some violence.", "hash": "c5b881cd-13f8-4f20-9150-951857dcf3a7"}, {"title": "Locke (Corps Security #5)", "author": "Harper Sloan", "pgs": 59, "sum": "Storyline: \nDarkness is the only thing I see. Ever since the day my life changed. The day that everything and everyone I held close to me ceased to exist. The day I lost it all and the demons of my past consumed my every waking moment. I tried to keep others at arm's length. Tried not to let my darkness taint them. Ruin them. Harm them. And whether I want to admit it or not, as much as I wish I could keep them locked out, they refuse to leave. Refuse to let me suffer alone. If I hadn't been so focused on keeping those demons from flying free, I wouldn't have missed how one perfect angel was able to sneak her way under my skin-refusing to let go. Making me want things I don't deserve. She consumes me. Her beauty knows no end. The love she promises tempts me every time she's near. But that pure heart that makes her MY Emmy is the one thing I'm convinced I'll destroy if I ever let her close. I'm a broken man. A broken man with too much darkness in his soul to ever let her light shine upon me. But even that doesn't stop me from craving her with every single breath in my body. **This is the final book in the Corps Security series. This book is not suitable for younger readers. There is strong language, adult situations, and some violence.", "hash": "8ba8fc82-8c36-4101-9bec-0e6d0f686b86"}, {"title": "Unexpected Fate (Hope Town #1)", "author": "Harper Sloan", "pgs": 67, "sum": "Storyline: \nHave you ever felt like you were living your life for a future that was predetermined? Like there was some bigger picture you just prayed you would someday see clearly? That picture has been crystal clear to me since I was old enough to recognize it for just what it was. Or I should say recognize him for who he was. I’ve loved Cohen Cage since I was a small child. He’s been my everything for the last twenty-two years. I’ve loved him through every girlfriend he’s ever brought home. Through his college years and then mine. I’ve loved him through two deployments. And ever since the day I told him how I felt, he’s acted like I’m a stranger. My name is Danielle Reid, and it’s time for me to get my man.  Our future is an unexpected fate, and no matter what our parents, siblings, and friends say…it’s going to be worth every second of the fight to make it happen.", "hash": "9641e2bb-0bfa-4c31-8b08-2b01cbcabed0"}]