[{"title": "Until Lilly (Until #3)", "author": "Aurora Rose Reynolds", "pgs": 66, "sum": "Storyline: \nWhen Cash Mayson was forced to choose between the love of his life and his unborn child, he knew exactly what he had to do. No matter how broken it left him.  When Lilly Donovan was forced to accept that the guy she loved wasn’t who she thought he was and became a single mother, she knew exactly what she had to do. Proving just how strong she was.  What happens when years later you find out that everything you thought you knew was a lie?  Can two people who once loved each other overcome the obstacles that are thrown at them and fall in love all over again? Cash Mayson had forgotten how it felt to be loved Until Lilly came back into his life. And now that he remembers, he will do everything within his power to keep not only the woman that he loves, but also his children.  The power of love is a beautiful thing.", "hash": "c438f7b9-e041-4170-975e-0b750b601968"}, {"title": "Until Nico (Until #4)", "author": "Aurora Rose Reynolds", "pgs": 63, "sum": "Storyline: \nSophie Grates has never had it easy, but she’s finding her way through life one step and one day at a time. That is, Until Nico comes in and flips her world upside-down. He forces her to see you cannot live life from the outside looking in, and sometimes you have to step out onto the ledge so you can really enjoy the view.  Nico Mayson knew the moment he saw Sophie Grates that she was the one. His whole life, he has been judged by what’s on the outside, so finding a beautiful woman who sees the real him only makes his feelings that much stronger.  Nico knows the kind of man he is, and the things he is capable of, and he will do everything in his power to help Sophie fight her demons so they can have their happily ever after. Everything in life worth having is worth fighting for.", "hash": "51e66a2c-9744-47da-b920-53c880a2bcc4"}, {"title": "Second Chance Holiday (Until #4.5)", "author": "Aurora Rose Reynolds", "pgs": 23, "sum": "Storyline: \nMike Rouger isn't looking for love. He decided long ago that he would rather stay single than get mixed up with a woman again. Then Kathleen Mullings comes back into his life with her teenage son and changes everything. What happens when a man set in his ways meets a sassy woman who knows what she wants? Mix in the Mayson clan and the Christmas season and you’re sure to enjoy the ride of Second Chance Holiday.", "hash": "293247cc-8a0b-4d31-ab18-501b6e1d77cf"}, {"title": "Assumption (Underground Kings #1)", "author": "Aurora Rose Reynolds", "pgs": 60, "sum": "Storyline: \na thing that is accepted as true or as certain to happen, without proof They say when you assume that you make an ass out of you and me.  Kenton Mayson learned this lesson firsthand when he made assumptions about Autumn Freeman and the kind of woman she is based on what little information he had. What he finds out is she’s not only beautiful, but also smart, funny, a fighter, and exactly the kind of woman he wants to share his life with. Autumn made assumptions of her own about Kenton, and now he needs to prove her wrong in order to protect her and their future.", "hash": "b1f5c935-8286-4014-8234-abf61a4e0111"}, {"title": "Obligation (Underground Kings #2)", "author": "Aurora Rose Reynolds", "pgs": 59, "sum": "Storyline: \nAn obligation is a course of action that someone is required to take, whether legal or moral.  At six years old, Myla was sent to a family her father and mother had chosen for her when they knew their time on earth was almost up. What they were unaware of was what they thought would be her safe haven would become her living hell.  Kai has been watching Myla from afar since he took over the family business from his father and inherited the responsibility of keeping her safe. When word gets back to Kai that Myla is not only in danger, but that his assets are being compromised, he immediately jumps into action and does the only thing that can be done at the time by marrying her.  Neither Myla nor Kai would have thought that something that started off as a farce would become the most important thing either of them could've ever done.", "hash": "a97f35d9-1afc-4632-a314-51113c957e5c"}, {"title": "Justified (Alfha Law Firm #1)", "author": "Aurora Rose Reynolds", "pgs": 23, "sum": "Storyline: \nAfter the first sighting, he’s fascinated. After the first smile, he’s infatuated. By the first kiss, he’s obsessed.  Nolan sees Chloe through a window of a bakery in downtown Manhattan. At first sight, something about her calls to a piece of him he thought was lost. Without thinking, he begins watching her, and when the moment presents itself, he strikes, claiming Chloe for himself. For a man who is used to getting what he wants Nolan wont let anyone or anything stand in his way.", "hash": "a2e1c895-fd50-4c75-ad97-664817b8ad2a"}, {"title": "Until July (Until Her #1)", "author": "Aurora Rose Reynolds", "pgs": 59, "sum": "Storyline: \nWes Silver wasn’t looking for love, but when July Mayson literally knocks him on his ass during their first encounter, his world is turned upside down by the quirky blonde, and every moment with her makes him more determined to protect her.  July Mayson doesn’t understand the pull she feels toward the bad boy biker Wes Silver, but she knows being with him is like nothing she’s ever felt before. Now all she has to do is tell her overprotective father, Asher Mayson, that she’s found her boom.", "hash": "a22b2890-d5d4-41d8-b1e9-f216a84c15db"}, {"title": "Just Listen ", "author": "Sarah Dessen", "pgs": 82, "sum": "Storyline: \nLast year, Annabel was \"the girl who has everything\" — at least that's the part she played in the television commercial for Kopf's Department Store. This year, she's the girl who has nothing: no best friend because mean-but-exciting Sophie dropped her, no peace at home since her older sister became anorexic, and no one to sit with at lunch. Until she meets Owen Armstrong. Tall, dark, and music-obsessed, Owen is a reformed bad boy with a commitment to truth-telling. With Owen's help, maybe Annabel can face what happened the night she and Sophie stopped being friends.", "hash": "5035d514-4c12-4c7a-a801-9eb3dc0c44ab"}, {"title": "Saint Anything ", "author": "Sarah Dessen", "pgs": 106, "sum": "Storyline: \nPeyton, Sydney's charismatic older brother, has always been the star of the family, receiving the lion's share of their parents' attention and—lately—concern. When Peyton's increasingly reckless behavior culminates in an accident, a drunk driving conviction, and a jail sentence, Sydney is cast adrift, searching for her place in the family and the world. When everyone else is so worried about Peyton, is she the only one concerned about the victim of the accident? Enter the Chathams, a warm, chaotic family who run a pizza parlor, play bluegrass on weekends, and pitch in to care for their mother, who has multiple sclerosis. Here Sydney experiences unquestioning acceptance. And here she meets Mac, gentle, watchful, and protective, who makes Sydney feel seen, really seen, for the first time. The uber-popular Sarah Dessen explores her signature themes of family, self-discovery, and change in her twelfth novel, sure to delight her legions of fans.", "hash": "2685f356-b182-44ca-bf59-c23009f28355"}, {"title": "Along for the Ride ", "author": "Sarah Dessen", "pgs": 88, "sum": "Storyline: \nIt’s been so long since Auden slept at night. Ever since her parents’ divorce—or since the fighting started. Now she has the chance to spend a carefree summer with her dad and his new family in the charming beach town where they live. A job in a clothes boutique introduces Auden to the world of girls: their talk, their friendship, their crushes. She missed out on all that, too busy being the perfect daughter to her demanding mother. Then she meets Eli, an intriguing loner and a fellow insomniac who becomes her guide to the nocturnal world of the town. Together they embark on parallel quests: for Auden, to experience the carefree teenage life she’s been denied; for Eli, to come to terms with the guilt he feels for the death of a friend. In her signature pitch-perfect style, Sarah Dessen explores the hearts of two lonely people learning to connect.", "hash": "bed8b32e-ee91-4b28-b2cd-f3af5dd21640"}]