[{"title": "Dreamland ", "author": "Sarah Dessen", "pgs": 54, "sum": "Storyline: \nWake up, Caitlin Ever since she started going out with Rogerson Biscoe, Caitlin seems to have fallen into a semiconscious dreamland where nothing is quite real. Rogerson is different from anyone Caitlin has ever known. He's magnetic. He's compelling. He's dangerous. Being with him makes Caitlin forget about everything else--her missing sister, her withdrawn mother, her lackluster life. But what happens when being with Rogerson becomes a larger problem than being without him?", "hash": "5a505cce-aa69-4545-a258-8042a3ebc4d0"}, {"title": "Someone Like You ", "author": "Sarah Dessen", "pgs": 59, "sum": "Storyline: \nHalley has always followed in the wake of her best friend, Scarlett. But when Scarlett learns that her boyfriend has been killed in a motorcycle accident, and that she's carrying his baby, she was devastated. For the first time ever, Scarlett really needs Halley. Their friendship may bend under the weight, but it'll never break--because a true friendship is a promise you keep forever.", "hash": "9f63dfc6-de2d-4622-a7f7-08d83c7ca104"}, {"title": "The Truth About Forever ", "author": "Sarah Dessen", "pgs": 91, "sum": "Storyline: \nA long, hot summer... That's what Macy has to look forward to while her boyfriend, Jason, is away at Brain Camp. Days will be spent at a boring job in the library, evenings will be filled with vocabulary drills for the SATs, and spare time will be passed with her mother, the two of them sharing a silent grief at the traumatic loss of Macy's father. But sometimes, unexpected things can happen—things such as the catering job at Wish, with its fun-loving, chaotic crew. Or her sister's project of renovating the neglected beach house, awakening long-buried memories. Things such as meeting Wes, a boy with a past, a taste for Truth-telling, and an amazing artistic talent, the kind of boy who could turn any girl's world upside down. As Macy ventures out of her shell, she begins to question her sheltered life.  Is it really always better to be safe than sorry?", "hash": "2cdf000e-54ec-432c-a851-64b00092fcd0"}, {"title": "This Lullaby ", "author": "Sarah Dessen", "pgs": 82, "sum": "Storyline: \nWhen it comes to relationships, Remy doesn't mess around. After all, she's learned all there is to know from her mother, who's currently working on husband number five. But there's something about Dexter that seems to defy all of Remy's rules. He certainly doesn't seem like Mr. Right. For some reason, however, Remy just can't seem to shake him. Could it be that Remy's starting to understand what those love songs are all about?", "hash": "c889a65a-cc54-4eba-bbb7-2e7bf6fa160a"}, {"title": "Hardwired (Hacker #1)", "author": "Meredith Wild", "pgs": 59, "sum": "Storyline: \nDetermined to overcome a difficult past, Erica Hathaway learns early on how to make it on her own. Days after her college graduation she finds herself face to face with a panel of investors who will make or break her fledgling startup. The only thing she didn't prepare for was going weak in the knees over an arrogant and gorgeous investor who's seemingly determined to derail her presentation.  Billionaire and rumored hacker Blake Landon has already made his fortune in software, and he's used to getting what he wants with very little resistance. Captivated by Erica's drive and unassuming beauty, he's wanted nothing more since she stepped into his boardroom. Determined to win her over, he breaks down her defenses and fights for her trust, even if that means sacrificing a level of control he's grown accustomed to. But when Blake uncovers a dark secret from Erica's past, he threatens not just her trust, but the life she's fought so hard to create.", "hash": "7b989672-4176-4812-b5db-636ac1eeb75f"}, {"title": "Hardpressed (Hacker #2)", "author": "Meredith Wild", "pgs": 66, "sum": "Storyline: \nIn HARDPRESSED, the highly anticipated second book of the Hacker Series that began with Hardwired, Blake and Erica face threats that put both their love and their lives on the line.  Despite Blake Landon's controlling ways, the young and wealthy hacker finally won the trust of the woman he loves. Internet entrepreneur Erica Hathaway broke down the walls that kept her from opening her heart and her business to Blake.  Ready to start this new chapter in her life, Erica is determined not to let anything come between them, even if that means giving Blake back some of the control he craves in and out of the bedroom.  But when demons from her past threaten their future, Erica makes a decision that could change their lives forever.", "hash": "6a6251a6-7e81-43bb-ab75-fdc511e4a429"}, {"title": "Hardline (Hacker #3)", "author": "Meredith Wild", "pgs": 61, "sum": "Storyline: \nSoftware mogul Blake Landon has met his match in headstrong Erica Hathaway. While his controlling nature and her independent spirit continue to battle, Blake has no intention of letting her out of his life again. Erica has given Blake her trust and her love, determined that they will conquer any challenges together. But when he demands more and tests the boundaries of her commitment, she is forced to face the dark desires he's kept hidden.  As their bonds grow tighter, their enemies close in. With Erica's start-up in danger, Blake's frustration grows as he tries to protect her from those who would ruin her only to get to him. Can their relationship survive when Blake's enemies cross the line and threaten more than her livelihood?", "hash": "e6c84197-f239-4529-bf04-d5064327dbb6"}, {"title": "Hard Limit (Hacker #4)", "author": "Meredith Wild", "pgs": 63, "sum": "Storyline: \nBlake Landon is a man who has everything-wealth, good looks, and the love of Erica Hathaway. The power couple has been through hell and back, and when life has torn them apart, somehow they have always found their way back to each other, more in love and stronger than ever.  Erica has never been more ready to say I do. On the verge of making the ultimate commitment, she uncovers an unsettling chapter of Blake's history. As she makes peace with her own past and the family who left her behind, she presses Blake to tear down the last walls between them. Determined to know the man he once was, she opens a door to a world beyond her wildest imagination-a world that has her questioning the limits of her own desires.  As danger lurks and dark secrets come to light, will the past destroy their promise of forever?", "hash": "5e076b41-0e04-42d6-9755-87869e3e9884"}, {"title": "Reaper's Property (Reapers MC #1)", "author": "Joanna Wylde", "pgs": 77, "sum": "Storyline: \nMarie doesn’t need a complication like Horse. The massive, tattooed, badass biker who shows up at her brother’s house one afternoon doesn’t agree. He wants Marie on his bike and in his bed. Now. But Marie just left her abusive jerk of an ex-husband and she’s not looking for a new man. Especially one like Horse—she doesn’t know his real name or where he lives, she’s ninety percent certain he’s a criminal and that the “business” he talks with her brother isn’t website design. She needs him out of her life, which would be a snap if he’d just stop giving her mind-blowing orgasms. Horse is part of the Reapers Motorcycle Club, and when he wants something, he takes it. What he wants is Marie, but she’s not interested in becoming “property of”. Then her brother steals from the club. Marie can save him by giving Horse what he wants—at home, in public, on his bike… If she’s a very, very good girl, she’ll get lots more of those orgasms only he can offer, and he’ll let her brother live. Maybe.", "hash": "0e799b73-6dcc-4416-8170-0f445aa0d756"}, {"title": "Reaper's Legacy (Reapers MC #2)", "author": "Joanna Wylde", "pgs": 93, "sum": "Storyline: \nReaper's Legacy is a raw and intensely erotic tale in Joanna Wylde's Reapers Motorcycle Club series. Eight years ago, Sophie gave her heart-and her virginity-to Zach Barrett on a night that couldn't have been less romantic or more embarrassing. Zach's step-brother, a steely-muscled, tattooed biker named Ruger, caught them in the act, getting a peep show of Sophie he's never forgotten. She may have lost her dignity that fateful night, but Sophie also gained something precious-her son Noah. Unfortunately, Zach's a deadbeat dad, leaving Ruger to be Noah's only male role model. When he discovers Sophie and his nephew living in near poverty, Ruger takes matters into his own hands-with the help of the Reapers Motorcycle Club-to give them a better life. Living with outlaw bikers wasn't Sophie's plan for her son, but Ruger isn't giving her a choice. He'll be there for Noah, whether she wants him or not. But Sophie does want him, has always wanted him. Now she'll learn that taking a biker to bed can get a girl dirty in every way.", "hash": "fcd10116-3ea0-4290-81ff-ddd34e6d27ed"}]