[{"title": "Reaper's Stand (Reapers MC #4)", "author": "Joanna Wylde", "pgs": 89, "sum": "Storyline: \nAs Reapers Motorcycle Club president, Reese “Picnic” Hayes has given his entire life to the club. After losing his wife, he knew he’d never love another woman. And with two daughters to raise and a club to manage, that was just fine with him. These days, Reese keeps his relationships free and easy—he definitely doesn’t want to waste his time on a glorified cleaning lady like London Armstrong. Too bad he’s completely obsessed with her. Besides running her own business, London’s got her junkie cousin’s daughter to look after—a more reckless than average eighteen-year-old. Sure she’s attracted to the Reapers’ president, but she’s not stupid. Reese Hayes is a criminal and a thug. But when her young cousin gets caught up with a ruthless drug cartel, Reese might be the only man who can help her. Now London has to make the hardest decision of her life—how far will she go to save her family?", "hash": "1883fcdc-b55f-4734-8b40-52ea845fa1a7"}, {"title": "Crazy Little Thing (Bell Harbor #1)", "author": "Tracy Brogan", "pgs": 25, "sum": "Storyline: \nCrazy Little Thing (Bell Harbor #1) If Sadie Turner is good at anything, it's putting stuff in order. So when she finds her \"perfect\" life in disarray, she hopes a summer vacation at her aunt's lake house will help her piece it back together. She wants to relax, reboot, and heal the wounds left by her cheating ex-husband. And that requires time away from men. All men. Or so she thinks. With two slobbering dogs and two cousins living there - one a flamboyant decorator intent on making over Sadie - it's hard to get a moment's peace at eccentric Aunt Dody's house, especially with everyone so determined to set her up with Desmond, the sexy new neighbor. Desmond is Sadie's worst nightmare. Tall, tanned, muscular...and to top it off, he's great with her kids. But he must have a flaw - he's a man - so Sadie vows to keep her distance. As summer blazes on, the life Sadie is trying so hard to simplify only becomes more complicated - a new career presents itself, her evil ex haunts her, and Aunt Dody reveals a tragic secret - but maybe a little chaos is just what Sadie needs to get her life back in order.", "hash": "7faaee21-8d39-4357-b78b-cba33cabe1c6"}, {"title": "The Royal Treatment (Alaskan Royal Family #1)", "author": "MaryJanice Davidson", "pgs": 37, "sum": "Storyline: \nThe Royal Treatment (Alaskan Royal Family #1) In this delightful and dazzling erotic novel, MaryJanice Davidson creates an alternate contemporary world nearly identical to ours in which Russia never sold the Alaskan territory to the United States. Instead, Alaska has won its independence and established itself as a constitutional monarchy...and now, the King of Alaska badly needs a bride for his son and heir... The country of Alaska is as forbidding as it is beautiful. And the royal family is as rough-around-the-edges as they are coolly civilized. Other royal families may find them shocking, but after all, in this wilderness kingdom, being a crack shot and expert trapper is just as important as knowing your salad fork from your dessert fork. Unfortunately, when the rest of the royals find you mildly savage, marrying off your royal brood can be a royal pain. King Alexander II is desperate. Why, he'd settle for any girl. A commoner. An American, even! Stranded tourist Christina Krabbe is American, and a commoner, but she has zero interest in enduring a royal wedding, producing royal heirs, and becoming Queen of Alaska...until she gets a good look at Prince David. He may be a bit unruly--actually, the words untamed and slightly dangerous come to mind--but Christina's no delicate flower herself. And when His Highness discovers Christina can give as good as she gets, he's Prince Charmed, if not quite charming. But can a wild man Prince and a modern American girl make a life together? And will the palace still be standing when the dust clears?", "hash": "795eea03-c32b-47a5-b0fe-a02d9665c3ba"}, {"title": "The Royal Pain (Alaskan Royal Family #2)", "author": "MaryJanice Davidson", "pgs": 30, "sum": "Storyline: \nThe Royal Pain (Alaskan Royal Family #2) PMarine biologist Dr. Shel (\"Never Sheldon\") Rivers has a problem. Some princess expects him to wait on her, hand and dimpled foot. His boss is taken with the royal redhead -- brunette, whatever, it's not like he keeps track of that stuff -- and nobody realizes that he just wants to be left alone in his lab. All alone. All the time. Weekends, holidays -- it's all good. Now here's Miss Royalpants, insisting that he escort her around the marine institute, explain what he s doing, kiss her until her toes curl -- no, wait, that was his idea. She's not even apologetic about being born into a royal family! Says it's his problem to overcome, not hers. Which leaves him with one option: to kiss her again. And again. And... So she's nothing like he expected. In fact, Dr. Rivers can see that this fantastic, exasperating woman has problems no princess should ever have to deal with. And he has an idea to help her get some much-needed sleep. Of course, it involves getting very, very tired beforehand, but if she's up to it, then so is he...", "hash": "6754e51a-2151-4ec2-9de2-860538d173b3"}, {"title": "The Royal Mess (Alaskan Royal Family #3)", "author": "MaryJanice Davidson", "pgs": 24, "sum": "Storyline: \nThe Royal Mess (Alaskan Royal Family #3) Jeffrey Rodinov is descended from one of the oldest families in Alaska, and a Rodinov has been protecting a Baranov for generations. It's a job Jeffrey takes VERY seriously. Six feet four inches, 220 fatless lbs., black hair, and blue eyes;weapon of choice: the 9 mm Beretta. In a pinch? His fists. IQ: 157. (Yes, crossword puzzle, in ink, just after taking out the guy behind you. No thanks necessary.) No one ever sees Jeffrey Rodinov coming, and no one--not even a mouthy, illegitimate princess--is going to keep him from playing bodyguard when his king decrees it. Right. But no Rodinov ever had to protect Princess Nicole Krenski. Her credentials? Hunting guide in the Alaskan wilderness. Smart. Stubborn bordering on exasperating. Five-seven. Blue eyes. Very kissable mouth. Very kissable neck, back, legs, wrists, earlobes. The lady says she doesn't need a bodyguard, but that's where she's wrong. Someone needs to watch her and show her the royal ropes (and cuffs. . .and scarves. . .). Someone who can make her feel like a queen--in and out of bed. And that's a job Jeffrey Rodinov takes very seriously as well. . .", "hash": "28a43433-8e87-4bff-b0f5-4705eb0d68f3"}, {"title": "My Side  ", "author": "Tara Brown", "pgs": 42, "sum": "Storyline: \nErin Benson felt like she'd won the lottery when she arrived all the way from North Dakota with the keys to her first home in hand. Crisp white walls: Check. Breathtaking view of downtown Boston: Check. Minutes from Northeastern School of Law: Check. But home is not always where the heart is. Sometimes it’s where you find Mr. Random shacked up and sprawled out on what was supposed to be your new bed. Between the bear spray and the handcuffs, she discovers a terrible mistake has been made. Lochlan hasn't broken into her new home to sleep with a seedy barmaid...he owns half. With emotions running on high, Erin is determined to tough it out until a solution can be found. The tight quarters seem smaller with his accumulated clutter and bizarre sleeping schedule. It also doesn't help that he's the new lead singer for Thin Ice, an indie band on its rise to fame. What happens when a quiet bookworm gets stuck with a relentless rocker? What happens when the things you see are not the things you get?", "hash": "495daff8-f485-4034-ba38-f8d5b80adfb4"}, {"title": "Friend-Zoned (Friend-Zoned #1)", "author": "Belle Aurora", "pgs": 42, "sum": "Storyline: \nFriend-Zoned (Friend-Zoned #1) Nikolai Leokov never thought he'd fall in love with the only girl he's ever befriended. Valentina Tomic has issues with commitment after the ultimate betrayal. When Tina decides to make broody Nik's day better, she never thought she would end up friends with the hard man. Nik has never had a woman be so affectionate to him without expecting something in return. Nik and Tina cordially invite you to read Friend-zoned. A story of friendship, humour and love.", "hash": "fffff0d4-9df4-46a5-b43c-d6e8df31ad90"}, {"title": "Love Thy Neighbour (Friend-Zoned #2)", "author": "Belle Aurora", "pgs": 38, "sum": "Storyline: \nLove Thy Neighbour (Friend-Zoned #2) Asher 'Ghost' Collins and Natalie Kovac shared a passionate night together. One neither of them can forget. So why is it so hard for them to be around each other? With no hope of the two getting along they decide to go their separate ways. And somehow end up closer than they've ever been. Will friendship ever be enough for the pair?", "hash": "8601f9e2-3711-4c37-b656-ff806f5e5b64"}, {"title": "Willing Captive ", "author": "Belle Aurora", "pgs": 29, "sum": "Storyline: \nDelilah “Lily” Flynn is used to her drab existence. Lily’s been living it for twenty two years. Her boring life is suddenly turned on its head when she’s rudely kidnapped from her bedroom. Or so she thinks. Nox Taylor is far too high up in his field to be assigned a babysitting job. There’s nothing more he wants than to complete his mission so he can be rid of the smartass tomboy, Lily. Day after day, Nox watches Lily and her strange ways. She’s unlike any woman he’s ever met. Getting close to the girl is purely for her own protection…right? Lily never imagined she’d make her first real friends in captivity. What lengths would she go through to keep them?", "hash": "00f353b4-a5cf-4872-b623-aaa3ea689f80"}, {"title": "Shame on You (Fool Me Once #1)", "author": "Tara Sivec", "pgs": 15, "sum": "Storyline: \nShame on You (Fool Me Once #1) War veteran Kennedy O’Brien is in the business of sticking it to the man—or at least any man who tries to cross a woman. After she returned home from Afghanistan and caught her husband in bed with the nanny, Kennedy lost her faith in men and started Fool Me Once Investigations with her two best friends. After all, there’s no better bounty hunter than a woman scorned. When Kennedy takes a case to slap cuffs on a bail jumper turned dog-napper, she figures it’ll be an easy paycheck. But trouble has a way of finding Kennedy. Enter the last man on the planet she’d willingly choose as a partner: her cheating ex-husband’s best friend, Griffin Crawford. As gorgeous as he is unwelcome, Griffin has always had a thing for Kennedy, and after keeping quiet about her ex’s cheating, he’ll do anything to earn back her trust. Whether or not she wants to admit it, Kennedy will need help as the case of the Chihuahua thief spirals out of control. Griffin may be just her man—in more ways than one.", "hash": "c2004edd-8fba-4ec5-be53-0f009b406341"}]