[{"title": "What She Wants ", "author": "Lynsay Sands", "pgs": 22, "sum": "Storyline: \nA formidable Scottish knight used to getting his way, Earl Hugh Dulonget of Hillcrest has gotten himself into a bind. His uncle's will clearly states that Hugh must marry— yet he has just insulted his would-be bride by calling her a peasant! Now he must do whatever it takes to win back the fair Willa . . . Everyone has advice, it seems. His comrades-in-arms believe gifts and baubles will earn her love. The old witch who was her guardian wants Hugh to crawl back to Willa on his belly. And his castle priest suggests he read De Secretis Mulierum, a book on the secrets of women. But Hugh knows only one sure way to overcome her reluctance: he must convince Willa that his passion and devotion are not only what she needs, but what she wants more than anything else in the world.", "hash": "b9252e51-c2e1-4772-915f-708fc616d470"}, {"title": "The Brat ", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nWho would marry\u0097all the knights had heard tales of Lady Murie, King Edward III's goddaughter and much feted favorite. It was said she was stunningly beautiful, with bright blue eyes, golden hair and a sweet smile. It was also said that the king had doted on the girl and spoiled her rotten. Despite his need, when Sir Balan saw her howling and sobbing, Murie was the last person he wanted to wed. The brat? But all that glitters is not gold, and sometimes diamonds look very, very rough. There was more to Murie than met the eye, and Balan soon learned that he'd be lucky indeed to deserve such a bride. Yet he was not the only one to discern the truth, and the other hopeful hubby was not quite as honorable. A plot was afoot. Soon would come a reckoning, a time to show who was chivalrous, who was a cad and who had won the love of a heart unspoiled.", "hash": "ffe78c55-1616-4886-817f-bfc8eeb67e4e"}, {"title": "Devil's Highlander (Clan MacAlpin #1)", "author": "Veronica Wolff", "pgs": 52, "sum": "Storyline: \nDevil's Highlander (Clan MacAlpin #1) After Scotland's Civil Wars, the orphaned brothers and sisters of the MacAlpin clan reclaimed the abandoned Dunnochen Castle as their birthright. Now they must rely on each other as they right the wrongs of their troubled history... Tormented war hero Cormac MacAlpin gets a chance at redemption-and romance-when former love Marjorie Keith asks him to help her find the missing child who was in her care.", "hash": "dbd83241-fe49-4a89-ad93-0efd92d1c3eb"}, {"title": "Devil's Own (Clan MacAlpin #2)", "author": "Veronica Wolff", "pgs": 54, "sum": "Storyline: \nDevil's Own (Clan MacAlpin #2) After surviving slavery, Aiden MacAlpin has nothing but thoughts of vengeance. When his tutor Elspeth learns a secret to his past, it thrusts them both into a game of passion and deception that neither may survive.", "hash": "b27ccb7a-c9ae-47fe-9ddb-abf2b52c35ef"}, {"title": "Ask For It (Georgian #1)", "author": "Sylvia Day", "pgs": 36, "sum": "Storyline: \nAsk For It (Georgian #1) Fearless Surrender Nothing incites Marcus more than the primal hunger roused by his former fiancée, Elizabeth. It's been years since she jilted him for another man, but that only means there's a lot to catch up on, a lot to make up for, and that he's going to enjoy every sweet moment... The same drive and passion that sent her into another man's arms is what brings Elizabeth back to Marcus. Her attraction to him is the one thing she fears, but she's run out of options. Resisting is impossible. But does she have the courage to surrender everything?", "hash": "64554fe1-c9e2-40e5-9a71-5b9b58985b7d"}, {"title": "Passion for the Game (Georgian #2)", "author": "Sylvia Day", "pgs": 45, "sum": "Storyline: \nPassion for the Game (Georgian #2) Match Point Infamous for satisfying his limitless wants and desires, Christopher is a free man again. And this time he’s on a mission to engage, deceive and seduce the one woman as ruthless as he is when it comes to games of passion… Far from innocent in the ways of men, Maria is one step ahead of Christopher’s every move. It doesn’t mean she isn’t enjoying every delicious look, every unbridled kiss, every moment of abandon. But she never saw her own feelings coming into play. She never imagined the moment would come when she would meet her match—and that she would surrender to him again and again…", "hash": "a336599b-9c53-44fa-b473-687d14d0539d"}, {"title": "A Passion for Him (Georgian #3)", "author": "Sylvia Day", "pgs": 32, "sum": "Storyline: \nA Passion for Him (Georgian #3) Stranger He wears a mask…and he is following her. Staring at her like no other man since Colin. But Colin is dead and Amelia believes she will never again shiver with pleasure, never again sigh his name. Lover Until her masked pursuer lures her into a moonlit garden and a single, reckless kiss. Now she is obsessed with discovering his identity. Perfectly attuned to his every desire, his every thought, she will not stop until she knows his every secret.", "hash": "1dff29a5-fd35-4e84-a59c-525cae242ae8"}, {"title": "Don't Tempt Me (Georgian #4)", "author": "Sylvia Day", "pgs": 44, "sum": "Storyline: \nDon't Tempt Me (Georgian #4) Sometimes Temptation... A hardened mercenary as adept in bed as in battle, Simon Quinn can have any woman he wants, but he prefers those who know the rules of the game. That way it's easier to leave them behind... Can't Be Avoided But Lysette Rousseau is one female he can't figure out. Beautiful, sensual, seductive, she should be the perfect match for Simon, yet something about her ties him in knots. Bold and manipulative one time, sweetly innocent the next, she is an enigma bound to bring trouble... impossible to resist.", "hash": "e8c9feb6-dbdf-47f8-aa17-a038a373b804"}, {"title": "Seven Years to Sin (Historical #1)", "author": "Sylvia Day", "pgs": 38, "sum": "Storyline: \nSeven Years to Sin (Historical #1) The longer the resistance… Seven years ago, on the eve of her wedding, proper Lady Jessica Sheffield witnessed a licentious scene no innocent young miss could imagine. Shocked, yet strangely titillated, she’d held her silence regarding scandalous Alistair Caulfield, and walked down the aisle as expected. But through years of serene, unremarkable marriage, Caulfield’s image remained burned into her imagination, fueling very illicit dreams… …the sweeter the reward Alistair ran far from the temptation of the prim debutante with the fire of passion in her eyes–all the way to the West Indies. As a successful merchant, he has little in common with the rakehell youth she knew. But when newly widowed Jessica steps aboard his ship for a transatlantic passage, seven years’ worth of denied pleasures are held in check by nothing more than a few layers of silk–and the certainty that surrender will consume them both…", "hash": "ad122edc-36ee-4e81-b5d5-6531c774d2fb"}, {"title": "The Stranger I Married (Historical #2)", "author": "Sylvia Day", "pgs": 35, "sum": "Storyline: \nThe Stranger I Married (Historical #2) EVERY MARRIAGE HAS ITS SURPRISES... Gray was beautiful before, four years ago when he asked Isabel to wed him in a marriage of convenience. Now there are no words to describe him. He is no longer a boyish rogue, not by any stretch of the imagination, but a tormented man, driven by secrets, silent about what he’s done since he disappeared. Isabel knew how to handle the reckless youth he’d been, but this new husband of hers... this darkly passionate man is not tamable. Does she dare explore the places inside herself that Gray demands to possess? Does she trust him enough to bare herself completely to a lover who is an irresistible stranger?", "hash": "3eee3b55-e204-46a3-a2b1-01350c386839"}]