[{"title": "Pride and Pleasure (Historical #3)", "author": "Sylvia Day", "pgs": 33, "sum": "Storyline: \nPride and Pleasure (Historical #3) Wealth has its dangers... There are disadvantages to being an heiress, as Eliza Martin knows well. Fortune hunters flock to her, acquaintances lie and pander, and lately, someone is engineering \"accidents\" to propel her to the altar. But Eliza will not be bullied, and she will get to the bottom of this plot. All she needs is a man to infiltrate her assemblage of suitors and find the culprit. Someone not easily noticed; a proficient dancer, quiet, and even-tempered. ...so do certain men Thief-taker Jasper Bond is entirely too large, too handsome, and too dangerous. Who would believe that an intellectual like Eliza would be seduced by a man of action? But the combination of her stubbornness and the mystery makes the case one Jasper can't resist. Client satisfaction is a point of pride and it's his pleasure to prove he's just the man she needs after all...", "hash": "c9dcbe61-dd92-47ec-ba10-e714795d1ef4"}, {"title": "Scandalous Liaisons (Historical #4)", "author": "Sylvia Day", "pgs": 42, "sum": "Storyline: \nScandalous Liaisons (Historical #4) Oh, those naughty rakes. With their wicked winks, sensual smiles, and bad boy habits, you just can t take them out in polite society. But who wants to go out when you can stay in...? STOLEN PLEASURES Sebastian Blake, Earl of Merrick, long ago fled the responsibilities of his title to become the infamous pirate, Captain Phoenix. But the booty he s just captured on a merchant ship is a fierce tempered minx who claims to be a bride...his bride, married to him by proxy on behest of their fathers. He could shame his hated family and return his beautiful wife untouched, but no treasure has ever proved more tempting to Sebastian, and making their marriage a true one-in every sense-is his one urgent desire ... LUCIEN'S GAMBLE Lucien Remington s reputation as a debauched libertine who plays by no one s rules-in business or the bedroom-is well deserved. He gets what he wants, social repudiation be damned. But society can keep from him the one thing he truly desires, the untouchable Lady Julienne La Coeur. Until she sneaks into his club dressed as a man and searching for her irresponsible brother. Suddenly she s in Lucien s grasp, his to take, and his mind is filled with the most wickedly sinful thoughts. A gentleman would walk away from the temptation she presents. But then, Lucien has never claimed to be a gentleman... HER MAD GRACE Hugh La Coeur never wanted to be the Earl of Montrose. Wine, women, and a hefty wager are preferable to responsibility of any kind. It s certainly preferable to spending the night in an eerie, neglected mansion owned by a legendary madwoman. The duchess s companion, the fiercely independent Charlotte, is another matter altogether. Hugh would be happy to spend as many nights in her bed as possible. He knows she s hiding terrible secrets, but for once in his life, Hugh has the desire to take on someone else s burden as his own, no matter what the danger... They re mad, bad, and totally irresistible...", "hash": "a79f9641-00a2-45af-99f6-ca5555f1ce77"}, {"title": "Lavender Vows (Medieval Herb Garden #1)", "author": "Colleen Gleason", "pgs": 11, "sum": "Storyline: \nLavender Vows (Medieval Herb Garden #1) Gruff, brooding Lord Bernard of Derkland needs to find a wife, if for no other reason than to satisfy his father and his incessant badgering. He has no interest in marrying, but when he meets the beautiful and gentle Joanna of Swerthmore, he immediately knows she is the one. The only problem is: she's already wed...to a monster. Readers who like Roberta Gellis, Catherine Coulter, Tina St. John, and Paula Quinn will enjoy this book of romance about ladies, lords, knights and castles.", "hash": "52bf29f3-dd02-4278-8a14-2f08f95b4e09"}, {"title": "Sanctuary of Roses (Medieval Herb Garden #2)", "author": "Colleen Gleason", "pgs": 32, "sum": "Storyline: \nSanctuary of Roses (Medieval Herb Garden #2) Passionate romance and court intrigue, lords and ladies, knights and castles... Madelyne de Belgrume has lived in secrecy in a hidden abbey for years. Her mad, abusive father, Fantin, believes she is dead. Lord Gavin Mal Verne wants nothing more than to seek revenge on Fantin de Belgrume...and he has the king's blessing to bring the man to heel. After a battle with Fantin that leaves Gavin nearly dead, he accidentally comes upon a hidden abbey...and the beautiful, serene nun who helps to heal him...and touches his heart in more ways than one. When Gavin discovers Madelyne's true identity, she is forced to leave the sanctuary of the abbey and appeal to King Henry for succor. To her horror, Madelyne learns she must either marry...or be returned to her father's custody.", "hash": "59793641-f047-4046-b3fb-6bed606e2651"}, {"title": "A Whisper Of Rosemary (Medieval Herb Garden #3)", "author": "Colleen Gleason", "pgs": 53, "sum": "Storyline: \nA Whisper of Rosemary (Medieval Herb Garden #3) Knights in shining armor...damsels in distress...adventure, romance and intrigue.... Dirick of Derkland, man of the king, sets off on a mission of revenge after his father’s brutal murder. His mind is bent solely on vengeance until he meets the beautiful Maris of Langumont…. Maris of Langumont has vowed never to wed…but her father must do his duty to protect her, and he promises her to Victor D’Arcy—a man who makes her blood run cold. Bon de Savrille rests his eyes upon Maris only once, and decides she must be his. He whisks her away just before her betrothal ceremony, determined to force her into marriage. When Dirick appears at the castle where Maris is held captive, she believes he is part of the plot…and ’tis nearly his death she causes during her chance to escape.", "hash": "e7f5d0ab-a2fd-48a7-bed4-2b785fdab3c9"}, {"title": "A Lily on the Heath (Medieval Herb Garden #4)", "author": "Colleen Gleason", "pgs": 52, "sum": "Storyline: \nA Lily on the Heath (Medieval Herb Garden #4) Passion and deception amid the turbulent court of Eleanor of Aquitaine and Henry II. An honorable man: Malcolm de Monde, Lord of Warwick needs a wife. He reluctantly journeys to the royal court where his plan is simple: find a dutiful woman, gain the king’s approval for his choice and return to Warwick with his chosen lady wedded, bedded, and carrying his heir—all before winter. An independent woman: Judith of Kentworth, Royal Falconer and lady-in-waiting, is a woman from Malcolm’s past. Although she is a confidante of the queen, Judith’s beauty and vivacity attract the unwanted attentions of the king—and the woman who commands winged predators becomes prey herself. A simple plan that goes awry when Malcolm encounters Judith, once betrothed to his friend—and a woman who is nothing like the meek wife he seeks…but who may be exactly the type of woman he needs. An impossible choice: Malcolm offers Judith a chance to escape her predicament…But can she risk entangling her own personal white knight in a dangerous web of royal intrigue?", "hash": "36485f67-b0ff-4182-95b0-17c9b7ff3ec6"}, {"title": "Never Seduce a Scot (The Montgomerys and Armstrongs #1)", "author": "Maya Banks", "pgs": 43, "sum": "Storyline: \nNever Seduce a Scot (The Montgomerys and Armstrongs #1) Eveline Armstrong is fiercely loved and protected by her powerful clan, but outsiders consider her “touched.” Beautiful, fey, with a level, intent gaze, she doesn’t speak. No one, not even her family, knows that she cannot hear. Content with her life of seclusion, Eveline has taught herself to read lips and allows the outside world to view her as daft. But when an arranged marriage into a rival clan makes Graeme Montgomery her husband, Eveline accepts her duty—unprepared for the delights to come. Graeme is a rugged warrior with a voice so deep and powerful that his new bride can hear it, and hands and kisses so tender and skilled that he stirs her deepest passions. Graeme is intrigued by the mysterious Eveline, whose silent lips are ripe with temptation and whose bright, intelligent eyes can see into his soul. As intimacy deepens, he learns her secret. But when clan rivalries and dark deeds threaten the wife he has only begun to cherish, the Scottish warrior will move heaven and earth to save the woman who has awakened his heart to the beautiful song of a rare and magical love.", "hash": "4db2d49f-9f6b-4083-9fa3-65b7730d47f7"}, {"title": "Highlander Most Wanted (The Montgomerys and Armstrongs #2)", "author": "Maya Banks", "pgs": 42, "sum": "Storyline: \nHighlander Most Wanted (The Montgomerys and Armstrongs #2) In Highlander Most Wanted, a reclusive woman content to live in the shadows shows a Highland warrior the true meaning of love. Genevieve McInnes is locked behind the fortified walls of McHugh Keep, captive of a cruel laird who takes great pleasure in ruining her for any other man. Yet when Bowen Montgomery storms the gates on a mission of clan warfare, Genevieve finds that her spirit is bent but not broken. Still, her path toward freedom remains uncertain. Unable to bear the shame of returning to a family that believes her dead or to abandon others at the keep to an imposing new laird, Genevieve opts for the peaceful life of an abbess. But Bowen’s rugged sensuality stirs something deep inside her that longs to be awakened by his patient, gentle caress—something warm, wicked, and tempting. Bowen seizes his enemy’s keep, unprepared for the brooding and reclusive woman who captures his heart. He’s enchanted by her fierce determination, her unusual beauty, and her quiet, unfailing strength. But wooing her will take more than a seasoned seducer’s skill. For loving Genevieve, he discovers, means giving her back the freedom that was stolen from her—even if it means losing her forever.", "hash": "f1af96c2-72f1-4cf3-b106-a20acc822fe8"}, {"title": "In Bed with a Highlander (McCabe Trilogy #1)", "author": "Maya Banks", "pgs": 43, "sum": "Storyline: \nIn Bed with a Highlander (McCabe Trilogy #1) Maya Banks' beguiling new trilogy features three unforgettable brothers risking everything to save their clan and their legacy—and to surrender their hearts to love. Ewan McCabe, the eldest, is a warrior determined to vanquish his enemy. Now, with the time ripe for battle, his men are ready and Ewan is poised to take back what is his—until a blue-eyed, raven-haired temptress is thrust upon him. Mairin may be the salvation of Ewan's clan, but for a man who dreams only of revenge, matters of the heart are strange territory to conquer. The illegitimate daughter of the king, Mairin possesses prized property that has made her a pawn—and wary of love. Her worst fears are realized when she is rescued from peril only to be forced into marriage by her charismatic and commanding savior, Ewan McCabe. But her attraction to her ruggedly powerful new husband makes her crave his surprisingly tender touch; her body comes alive under his sensual mastery. And as war draws near, Mairin's strength, spirit, and passion challenge Ewan to conquer his demons—and embrace a love that means more than revenge and land.", "hash": "e4cfb0d3-30b5-48f6-aad5-d163b6e1e025"}, {"title": "Seduction of a Highland Lass (McCabe Trilogy #2)", "author": "Maya Banks", "pgs": 39, "sum": "Storyline: \nSeduction of a Highland Lass (McCabe Trilogy #2) Fiercely loyal to his elder brother, Alaric McCabe leads his clan in the fight for their birthright. Now he is prepared to wed for duty, as well. But on his way to claim the hand of Rionna McDonald, daughter of a neighboring chieftain, he is ambushed and left for dead. Miraculously, his life is saved by the soft touch of a Highland angel, a courageous beauty who will put to the test his fealty to his clan, his honor, and his deepest desires. An outcast from her own clan, Keeley McDonald was betrayed by those she loved and trusted. When the wounded warrior falls from his horse, she is drawn to his strong, lean body. The wicked glint in his green eyes ignites a passion that will follow them back to Alaric's keep, where their forbidden love draws them deeper into the pleasures of the flesh. But as conspiracy and danger circle closer, Alaric must make an impossible choice: Will he betray his blood ties for the woman he loves?", "hash": "02c0f571-4398-46e0-bceb-e8d733531a54"}]