[{"title": "Heartbreaker (Buchanan-Renard #1)", "author": "Julie Garwood", "pgs": 53, "sum": "Storyline: \nBless me father, for I will sin... In the still shadows of the confessional, a madman tauntingly reveals his plan for a murder he is going to commit, pulling Father Thomas Madden into a twisted game by disclosing his next intended victim: Tom's sister, Laurant. In a frantic race to protect her, Tom calls upon his best friend, elite FBI agent Nick Buchanan, to track the predator who is closing in on Laurant. Now, as an electrifying attraction grows between Laurant and Nick, so does the danger -- and one false move will cost both of them everything that matters. Let New York Times bestselling author Julie Garwood take you on a thrilling excursion into the soaring heights -- and the darkest impulses -- of the human heart.", "hash": "7afa4b5d-f15c-4287-b1ec-a7b15d0d25f7"}, {"title": "His Unlikely Lover (Unwanted #3)", "author": "Natasha Anders", "pgs": 84, "sum": "Storyline: \nBobbi Richmond has always been in love with her best friend, Gabe Braddock, even if Gabe, who works for her media mogul father, has always treated Bobbi like a kid sister, calling her “Runt.” After a tipsy Bobbi kisses Gabe at a party, Gabe is surprised to find “Runt” becoming the object of his fantasies, and Bobbi is shocked to find her advances suddenly reciprocated. When Gabe suggests adding “benefits” to their friendship—while keeping their new arrangement secret from their families, of course—should Bobbi feel flattered, or insulted by his insistence on casual sex? Are they even a match? Slick and conservative Gabe dates coiffed blondes, while the tomboyish Bobbi spends much more time fixing cars than her hair. When Gabe’s twin brother, Chase, senses something’s up between the old friends, he forces Gabe to confront his real feelings for Bobbi—and decide whether or not he could live without her.", "hash": "fb1192de-f37a-4ed7-abba-1246ce2e9854"}, {"title": "A Husband's Regret (Unwanted #2)", "author": "Natasha Anders", "pgs": 91, "sum": "Storyline: \nTall and thin, twenty-eight-year-old Bronwyn Palmer has become positively gaunt, a ghost of her former self. That self was?and still is?the wife of a rich, handsome executive with an ocean-view house and his own security staff. It was in that house, two years ago, that Bryce Palmer learned Bronwyn was pregnant with their first child. But Bryce's rage over his impending fatherhood touched off a chain reaction of emotional and physical traumas that wounded them both. For Bronwyn, it meant fleeing the perfect marriage to start over with nothing but a precocious daughter named Kayla to care for. For Bryce, it meant a tortuous two years spent blaming his wife for deserting him, and living with the pain of not knowing his child. Now a chance encounter has brought Bronwyn back into Bryce's life, both bearing scars?and neither knowing the whole truth of that fateful night that drove them apart.", "hash": "fe96a079-7bab-4da0-881d-4e1afc1a0a96"}, {"title": "A Ruthless Proposition", "author": "Natasha Anders", "pgs": 101, "sum": "Storyline: \nThe last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.", "hash": "63cb7d48-91fd-4b1c-9007-0bc92b0181c7"}, {"title": "Saving Grace", "author": "Julie Garwood", "pgs": 55, "sum": "Storyline: \nWhen Lady Johanna learned that she was a widow, she vowed she would never marry again. Only sixteen, already she possessed a strength of will that impressed all who looked past her golden-haired beauty. Yet when King John demanded that she remarry and selected a bridegroom for her—it seemed she must acquiesce, until her beloved foster brother suggested she wed his friend, the handsome Scottish warrior Gabriel MacBain. At first Johanna was shy, but as Gabriel tenderly revealed the splendid pleasures they would share, she came to suspect that she was falling in love with her gruff new husband. And it was soon apparent to the entire Highlands clan that their brusque, gallant laird had surrendered his heart completely. But now a desperate royal intrigue threatened to tear her from his side—and to destroy the man whose love meant more to her than she had ever dreamed!", "hash": "58fa8248-6151-4ea5-86ee-2c9e96fa96b3"}, {"title": "The Prize", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nIn the resplendence of William the Conqueror's London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride. In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa revelled in their precious new love ... a fervent bond soon to be disrupted by the call of blood, kin and country!", "hash": "608f129a-d23f-44db-8fc7-c19a29114eab"}, {"title": "Honor's Splendour", "author": "Julie Garwood", "pgs": 50, "sum": "Storyline: \nThis classic medieval romance from New York Times bestselling author Julie Garwood is a fan favorite—a beautiful lady needs rescue from a knight in shining armor, and gets an alpha warrior instead. In the feuding English court, gentle Lady Madelyne suffered the cruel whims of her ruthless brother, Baron Louddon. Then, in vengeance for a bitter crime, Baron Duncan of Wexton—the Wolf—unleashed his warriors against Louddon. Exquisite Madelyne was the prize he catured... but when he gazed upon the proud beauty, he pledged to protect her with his life. In his rough-hewn castle, Duncan proved true to his honor. But when at last their noble passion conquered them both, she surrendered with all her soul. Now, for love, Madelyne would stand fast... as bravely as her Lord, the powerful Wolf who fought for... Honor’s Splendour.", "hash": "3965dc87-ad33-4290-a544-c805d34c46bc"}, {"title": "Shadow Music (Highlands' Lairds #3)", "author": "Julie Garwood", "pgs": 40, "sum": "Storyline: \nFor Princess Gabrielle of St. Biel, Scotland is a land of stunning vistas, wild chieftains, treacherous glens, and steep shadows--skullduggery, betrayal, and now murder. Prized for her exquisite beauty, the daughter of one of England's most influential barons, Gabrielle is also a perfect bargaining chip for a king who needs peace in the Highlands: King John has arranged Gabrielle's marriage to a good and gentle laird. But this marriage will never take place. For Gabrielle, everything changes in one last burst of freedom--when she and her guards come upon a scene of unimaginable cruelty. With one shot from her bow and arrow, Gabrielle takes a life, saves a life, and begins a war. Within days, the Highlands are aflame with passions as a battle royal flares between enemies old and new. Having come to Scotland to be married, Gabrielle is instead entangled in Highland intrigue. For two sadistic noblemen, underestimating Gabrielle's bravery and prowess may prove fatal. But thanks to a secret Gabrielle possesses, Colm MacHugh, the most feared man in Scotland, finds a new cause for courage. Under his penetrating gaze, neither Gabrielle's body nor heart is safe.", "hash": "3792faca-76ea-4b72-9642-8c23aef2e99d"}, {"title": "Ransom (Highlands' Lairds #2)", "author": "Julie Garwood", "pgs": 59, "sum": "Storyline: \nAs a child, Gillian lost her sister and saw her father killed by Baron Alford, a man driven by greed, determined to obtain a jewelled box belonging to King John. Years later, while searching for her sister, Gillian enlists the aid of Scottish Lairds Ramsey Sinclair and Brodick Buchanan, as well as a new friend, Brigid Kirk Connel. The four unite to face the terrifying and powerful baron who has stolen Gillian's home. But in the process of regaining her heritage, will Gillian lose her heart?", "hash": "3c5ac9d3-6123-40fb-9656-1b8e2da11097"}, {"title": "The Secret (Highlands' Lairds #1)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nJudith Hampton was as beautiful as she was proud, as purposeful as she was loyal. The dear Scottish friend of her childhood was about to give birth, and Judith had promised to be at her side. But there was another, private reason for the journey from her bleak English home to the Highlands to meet the father she had never known, the Laird Maclean. Nothing prepared her for the sight of the Scottish barbarian who was to escort her into his land...Iain Maitland, Laird of his clan, a man more powerfully compelling than any she had ever encountered. In a spirited clash of wills and customs, Judith revelled in the melting bliss of Iain's searching kisses, his passionate caresses. Perplexed by her sprightly defiance, bemused by her tender nature, Iain felt his soul growing into the light and warmth of her love. Surely nothing would wrench her from the affection and trust of Iain and his clan...not even the truth about her father, a devastating secret that could shatter the boldest alliance, and the most glorious of loves.", "hash": "c853df65-2cbb-4ea1-a573-4823aca2fc21"}]