[{"title": "Never Love a Highlander (McCabe Trilogy #3)", "author": "Maya Banks", "pgs": 36, "sum": "Storyline: \nNever Love a Highlander (McCabe Trilogy #3) Caelen McCabe’s young, reckless heart nearly destroyed his clan. Now, putting family loyalty above all else, he steps up to marry his older brother’s jilted bride and salvage the uneasy alliance between two clans. While beautiful Rionna McDonald is a fit wife for any man, Caelen trusts no woman, especially not this sweet temptress who torments him with white-hot longing. As the sacrificial lamb in her father’s power game, Rionna will do her duty but vows to protect her heart and her pride from humiliation. Despite everything, though, the heat in Caelen’s touch melts her defenses, and she craves the sensual delights of a husband who guards his emotions as fiercely as his clan. But when the ultimate battle for the McCabe legacy is upon them, Rionna’s true warrior spirit emerges. She will risk the wrath of her father, the fury of her enemies, and her life to prove to Caelen that his wife’s love is too precious to lose.", "hash": "94420a58-7f93-437c-b6d9-1522c5a1e74d"}, {"title": "Pride and Prejudice ", "author": "Jane Austen", "pgs": 46, "sum": "Storyline: \nPride and Prejudice by Jane Austen, Anna Quindlen (Introduction) \"It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.\" So begins Pride and Prejudice, Jane Austen's witty comedy of manners--one of the most popular novels of all time--that features splendidly civilized sparring between the proud Mr. Darcy and the prejudiced Elizabeth Bennet as they play out their spirited courtship in a series of eighteenth-century drawing-room intrigues. Introduction by Anna Quindlen. Commentary by Margaret Oliphant, George Saintsbury, Mark Twain, A.C. Bradley, Walter A. Raleigh, and Virginia Woolf. Includes a Modern Library Reading Group Guide", "hash": "bcc1a86a-fb2b-4631-9663-f0a893dd795a"}, {"title": "Emma ", "author": "Jane Austen", "pgs": 60, "sum": "Storyline: \nEmma by Jane Austen, Fiona Stafford (Introduction, Notes) 'I never have been in love; it is not my way, or my nature; and I do not think I ever shall.' Beautiful, clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr Knightley and attempts to arrange a suitable match for her protegee Harriet Smith, her carefully laid plans soon unravel and have consequences that she never expected. With its imperfect but charming heroine and its witty and subtle exploration of relationships, Emma is often seen as Jane Austen's most flawless work. This edition includes a new chronology and additional suggestions for further reading.", "hash": "6dfd30f8-bb1d-43ba-9df6-855ac1ce76e6"}, {"title": "Lady Susan ", "author": "Jane Austen", "pgs": 8, "sum": "Storyline: \nLady Susan by Jane Austen, R.W. Chapman (Editor) Beautiful, flirtatious, and recently widowed, Lady Susan Vernon seeks an advantageous second marriage for herself, while attempting to push her daughter into a dismal match. A magnificently crafted novel of Regency manners and mores that will delight Austen enthusiasts with its wit and elegant expression.", "hash": "3fa1fd5b-0d62-42f5-961e-44501ffcd11e"}, {"title": "Sense and Sensibility ", "author": "Jane Austen", "pgs": 45, "sum": "Storyline: \nSense and Sensibility by Jane Austen, Tony Tanner (Introduction), Ros Ballaster (Introduction/Editor) 'The more I know of the world, the more am I convinced that I shall never see a man whom I can really love. I require so much!' Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elinor, always sensitive to social convention, is struggling to conceal her own romantic disappointment, even from those closest to her. Through their parallel experience of love—and its threatened loss—the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love. This edition includes explanatory notes, textual variants between the first and second editions, and Tony Tanner's introduction to the original Penguin Classic edition.", "hash": "1bc26f8c-d918-47c2-b049-c77dbff8f3a5"}, {"title": "Persuasion ", "author": "Jane Austen", "pgs": 32, "sum": "Storyline: \nTwenty-seven-year old Anne Elliot is Austen's most adult heroine. Eight years before the story proper begins, she is happily betrothed to a naval officer, Frederick Wentworth, but she precipitously breaks off the engagement when persuaded by her friend Lady Russell that such a match is unworthy. The breakup produces in Anne a deep and long-lasting regret. When later Wentworth returns from sea a rich and successful captain, he finds Anne's family on the brink of financial ruin and his own sister a tenant in Kellynch Hall, the Elliot estate. All the tension of the novel revolves around one question: Will Anne and Wentworth be reunited in their love? Jane Austen once compared her writing to painting on a little bit of ivory, 2 inches square. Readers of Persuasion will discover that neither her skill for delicate, ironic observations on social custom, love, and marriage nor her ability to apply a sharp focus lens to English manners and morals has deserted her in her final finished work.", "hash": "11d8f922-6ad2-4d3a-bb83-5de8e64e56c7"}, {"title": "Mansfield Park ", "author": "Jane Austen", "pgs": 48, "sum": "Storyline: \nMansfield Park by Jane Austen, Kathryn Sutherland (Editor, Introduction & Notes by), Tony Tanner (original Penguin Introduction by), Claire Lamont (Textual Adviser) 'We have all been more or less to blame ... every one of us, excepting Fanny' Taken from the poverty of her parents' home, Fanny Price is brought up with her rich cousins at Mansfield Park, acutely aware of her humble rank and with only her cousin Edmund as an ally. When Fanny's uncle is absent in Antigua, Mary Crawford and her brother Henry arrive in the neighbourhood, bringing with them London glamour and a reckless taste for flirtation. As her female cousins vie for Henry's attention, and even Edmund falls for Mary's dazzling charms, only Fanny remains doubtful about the Crawfords' influence and finds herself more isolated than ever. A subtle examination of social position and moral integrity, Mansfield Park is one of Jane Austen's most profound works.", "hash": "084222b6-698a-44f8-9a21-756fe7442d1f"}, {"title": "Desperate Duchesses (Desperate Duchesses #1)", "author": "Eloisa James", "pgs": 77, "sum": "Storyline: \nDesperate Duchesses (Desperate Duchesses #1)  \"Welcome to a world of reckless sensuality and glittering sophistication...of dangerously handsome gentlemen and young ladies longing to gain a title . . . of games played for high stakes, including--on occasion--a lady's virtue.\" A marquess's sheltered only daughter, Lady Roberta St. Giles falls in love with a man she glimpses across a crowded ballroom: a duke, a game player of consummate skill, a notorious rakehell who shows no interest in marriage--until he lays eyes on Roberta. Yet the Earl of Gryffyn knows too well that the price required to gain a coronet is often too high. Damon Reeve, the earl, is determined to protect the exquisite Roberta from chasing after the wrong destiny. Can Damon entice her into a high-stakes game of his own, even if his heart is likely to be lost in the venture?", "hash": "d4ef4f0f-b0c9-4bc0-89cd-5b7f77d59397"}, {"title": "An Affair Before Christmas (Desperate Duchesses #2)", "author": "Eloisa James", "pgs": 79, "sum": "Storyline: \nAn Affair Before Christmas (Desperate Duchesses #2) Magic under the mistletoe... One spectacular Christmas, Lady Perdita Selby, known to her friends and family as Poppy, met the man she thought she would love forever. The devilishly attractive Duke of Fletcher was the perfect match for the innocent, breathtakingly beautiful young Englishwoman, and theirs was the most romantic wedding she had ever seen. Four years later, Poppy and the duke have become the toast of the ton... but behind closed doors the spark of their love affair has burned out. Unwilling to lose the woman he still lusts after, the duke is determined to win back his beguiling bride's delectable affections...and surpass the heady days of first love with a truly sinful seduction.", "hash": "d37a0b1c-59ec-4f7b-b384-fc93d1381776"}, {"title": "Duchess By Night (Desperate Duchesses #3)", "author": "Eloisa James", "pgs": 77, "sum": "Storyline: \nDuchess By Night (Desperate Duchesses #3) One night's disguise could lead to a lifetime of passion... A Mischievous Charade... Harriet, Duchess of Berrow, is tired of her title and the responsibilities that come along with it. Enough with proper tea parties and elegant balls; what Harriet really wants is to attend an outrageous soiree where she can unleash her wildest whims and desires. But to attend such an event—especially if the event in question is Lord Justinian Strange's rollicking fete, filled with noble rogues and rotters, risqué ladies and illicit lovers—would be certain scandal. That's why she must disguise herself . . . Looking forward to a night of uninhibited pleasure, Lord Strange is shocked to discover that beneath the clothes of a no-good rake is the most beautiful woman in the room. Why is a woman like her risking her reputation at his notorious affair? And can he possibly entice her to stay . . . forever?", "hash": "bd2ea6db-7764-4bf5-96cb-09f23a75bf19"}]