[{"title": "When the Duke Returns (Desperate Duchesses #4)", "author": "Eloisa James", "pgs": 74, "sum": "Storyline: \nWhen the Duke Returns (Desperate Duchesses #4) The Duchess of Cosway yearns for a man she has never met . . . her husband. Married by proxy as a child, Lady Isidore has spent years fending off lecherous men in every European court while waiting to meet her husband. She's determined to accept him, no matter how unattractive the duke turns out to be. When she finally lures Simeon Jermyn back to London, his dark handsomeness puts Isidore's worst fears to rest—until disaster strikes. The duke demands an annulment. Forsaking his adventuresome past, Simeon has returned to London ready to embrace the life of a proper duke, only to find that his supposed wife is too ravishing, too headstrong, and too sensual to be the docile duchess he has in mind. But Isidore will not give up her claim to the title—or him—without a fight. She will do whatever it takes to capture Simeon's heart, even if it means sacrificing her virtue. After all, a consummated marriage cannot be annulled. Yet in forcing Simeon into a delicious surrender, will Isidore risk not only her dignity—but her heart?", "hash": "89732c45-2c57-495b-ab30-ab40702da5bd"}, {"title": "This Duchess of Mine (Desperate Duchesses #5)", "author": "Eloisa James", "pgs": 75, "sum": "Storyline: \nThis Duchess of Mine (Desperate Duchesses #5) No man can resist Jemma's sensuous allure . . . Except her own husband! Wedding bells celebrating the arranged marriage between the lovely Duchess of Beaumont and her staid, imperturbable duke had scarcely fallen silent when a shocking discovery sent Jemma running from the ducal mansion. For the next nine years she cavorted abroad, creating one delicious scandal after another (if one is to believe the rumors). Elijah, Duke of Beaumont, did believe those rumors. But the handsome duke needs an heir, so he summons his seductive wife home. Jemma laughs at Elijah's cool eyes and icy heart—but to her secret shock, she doesn't share his feelings. In fact, she wants the impossible: her husband's heart at her feet. But what manner of seduction will make a man fall desperately in love . . . with his own wife?", "hash": "2c2ea51c-be42-4d06-8fb5-5d0c2bc52c74"}, {"title": "A Duke of Her Own (Desperate Duchesses #5)", "author": "Eloisa James", "pgs": 82, "sum": "Storyline: \nA Duke of Her Own (Desperate Duchesses #6) A DUKE MUST CHOOSE WISELY... Leopold Dautry, the notorious Duke of Villiers, must wed quickly and nobly—and his choices, alas, are few. The Duke of Montague's daughter, Eleanor, is exquisitely beautiful and fiercely intelligent. Villiers betroths himself to her without further ado. After all, no other woman really qualifies. Lisette, the outspoken daughter of the Duke of Gilner, cares nothing for clothing or decorum. She's engaged to another man, and doesn't give a fig for status or title. Half the ton believes Lisette mad—and Villiers is inclined to agree. Torn between logic and passion, between intelligence and imagination, Villiers finds himself drawn to the very edge of impropriety. But it is not until he's in a duel to the death, fighting for the reputation of the woman he loves, that Villiers finally realizes that the greatest risk may not be in the dueling field... But in the bedroom. And the heart.", "hash": "0107fc53-2f1e-4e91-8ae9-e1c74b956ed5"}, {"title": "Three Weeks With Lady X (Desperate Duchesses #7)", "author": "H.M. Ward", "pgs": 77, "sum": "Storyline: \nThree Weeks With Lady X (Desperate Duchesses #7) Having made a fortune, Thorn Dautry, the powerful bastard son of a duke, decides that he needs a wife. But to marry a lady, Thorn must acquire a gleaming, civilized façade, the specialty of Lady Xenobia India. Exquisite, head-strong, and independent, India vows to make Thorn marriageable in just three weeks. But neither Thorn nor India anticipate the forbidden passion that explodes between them. Thorn will stop at nothing to make India his. Failure is not an option. But there is only one thing that will make India his—the one thing Thorn can't afford to lose... His fierce and lawless heart.", "hash": "38d5f9de-8084-44ec-a229-85edb92e9b40"}, {"title": "Four Nights With the Duke (Desperate Duchesses #8)", "author": "Eloisa James", "pgs": 74, "sum": "Storyline: \nFour Nights With the Duke (Desperate Duchesses #8) As a young girl, Emilia Gwendolyn Carrington told the annoying future Duke of Pindar that she would marry any man in the world before him—so years later she is horrified to realize that she has nowhere else to turn. Evander Septimus Brody has his own reasons for agreeing to Mia's audacious proposal, but there's one thing he won't give his inconvenient wife: himself. Instead, he offers Mia a devil's bargain... he will spend four nights a year with her. Four nights, and nothing more. And those only when she begs for them. Which Mia will never do. Now Vander faces the most crucial challenge of his life: he must seduce his own wife in order to win her heart—and no matter what it takes, this is the one battle he can't afford to lose.", "hash": "ecf0196c-6499-4514-8b3a-c8fddbf2a183"}, {"title": "Outlander (Outlander #1)", "author": "Diana Gabaldon", "pgs": 88, "sum": "Storyline: \nThe year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743. Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives.", "hash": "d342453a-fd07-4153-a756-90feb237920b"}, {"title": "Dragonfly in Amber (Outlander #2)", "author": "Diana Gabaldon", "pgs": 100, "sum": "Storyline: \nNOW THE STARZ ORIGINAL SERIES OUTLANDER With her now-classic novel Outlander, Diana Gabaldon introduced two unforgettable characters—Claire Randall and Jamie Fraser—delighting readers with a story of adventure and love that spanned two centuries. Now Gabaldon returns to that extraordinary time and place in this vivid, powerful follow-up to Outlander. DRAGONFLY IN AMBER For nearly twenty years Claire Randall has kept her secrets. But now she is returning with her grown daughter to Scotland’s majestic mist-shrouded hills. Here Claire plans to reveal a truth as stunning as the events that gave it birth: about the mystery of an ancient circle of standing stones . . . about a love that transcends the boundaries of time . . . and about Jamie Fraser, a Scottish warrior whose gallantry once drew a young Claire from the security of her century to the dangers of his. Now a legacy of blood and desire will test her beautiful copper-haired daughter, Brianna, as Claire’s spellbinding journey of self-discovery continues in the intrigue-ridden Paris court of Charles Stuart . . . in a race to thwart a doomed Highlands uprising . . . and in a desperate fight to save both the child and the man she loves. Praise for Dragonfly in Amber “Diana Gabaldon is a born storyteller. . . . The pages practically turn themselves.”—The Arizona Republic “A triumph! A powerful tale layered in history and myth. I loved every page.”—Nora Roberts “Compulsively readable.”—Publishers Weekly From the Hardcover edition.", "hash": "285d517b-2e40-4414-a485-4fe3139b6ae8"}, {"title": "Voyager (Outlander #3)", "author": "Diana Gabaldon", "pgs": 194, "sum": "Storyline: \nFrom the author of the breathtaking bestsellers Outlander and Dragonfly in Amber, the extraordinary saga continues. Their passionate encounter happened long ago by whatever measurement Claire Randall took. Two decades before, she had traveled back in time and into the arms of a gallant eighteenth-century Scot named Jamie Fraser. Then she returned to her own century to bear his child, believing him dead in the tragic battle of Culloden. Yet his memory has never lessened its hold on her... and her body still cries out for him in her dreams. Then Claire discovers that Jamie survived. Torn between returning to him and staying with their daughter in her own era, Claire must choose her destiny. And as time and space come full circle, she must find the courage to face the passion and pain awaiting her...the deadly intrigues raging in a divided Scotland... and the daring voyage into the dark unknown that can reunite or forever doom her timeless love.", "hash": "b47c9550-d41a-49f7-aa5d-13a6c26db27f"}, {"title": "Drums of Autumn (Outlander #4)", "author": "Diana Gabaldon", "pgs": 202, "sum": "Storyline: \nIn this breathtaking novel—rich in history and adventure—The New York Times bestselling author Diana Gabaldon continues the story of Claire Randall and Jamie Fraser that began with the now-classic novel Outlander and continued in Dragonfly in Amber and Voyager. Once again spanning continents and centuries, Diana Gabaldon has created a work of sheer passion and brilliance....  It began at an ancient Scottish stone circle. There, a doorway, open to a select few, leads into the past—or the grave. Dr. Claire Randall survived the extraordinary passage, not once but twice. Her first trip swept her into the arms of Jamie Fraser, an eighteenth-century Scot whose love for her became a legend—a tale of tragic passion that ended with her return to the present to bear his child. Her second journey, two decades later, brought them together again in the American colonies. But Claire had left someone behind in the twentieth century—their daughter, Brianna.... Now Brianna has made a disturbing discovery that sends her to the circle of stones and a terrifying leap into the unknown. In search of her mother and the father she has never met, she is risking her own future to try to change history ... and to save their lives. But as Brianna plunges into an uncharted wilderness, a heartbreaking encounter may strand her forever in the past ... or root her in the place she should be, where her heart and soul belong...", "hash": "706d8f38-7be1-4aa9-a588-6f57b9819450"}, {"title": "A Breath of Snow and Ashes (Outlander #6)", "author": "Diana Gabaldon", "pgs": 102, "sum": "Storyline: \nEagerly anticipated by her legions of fans, this sixth novel in Diana Gabaldon’s bestselling Outlander saga is a masterpiece of historical fiction from one of the most popular authors of our time. Since the initial publication of Outlander fifteen years ago, Diana Gabaldon’s New York Times bestselling saga has won the hearts of readers the world over — and sold more than twelve million books. Now, A Breath of Snow and Ashes continues the extraordinary story of 18th-century Scotsman Jamie Fraser and his 20th-century wife, Claire. The year is 1772, and on the eve of the American Revolution, the long fuse of rebellion has already been lit. Men lie dead in the streets of Boston, and in the backwoods of North Carolina, isolated cabins burn in the forest. With chaos brewing, the governor calls upon Jamie Fraser to unite the backcountry and safeguard the colony for King and Crown. But from his wife Jamie knows that three years hence the shot heard round the world will be fired, and the result will be independence — with those loyal to the King either dead or in exile. And there is also the matter of a tiny clipping from The Wilmington Gazette, dated 1776, which reports Jamie’s death, along with his kin. For once, he hopes, his time-traveling family may be wrong about the future.", "hash": "41b7c84d-b6bb-4e4c-9829-68d7468e5c1d"}]