[{"title": "An Echo in the Bone (Outlander #7)", "author": "Diana Gabaldon", "pgs": 164, "sum": "Storyline: \nThe Seventh Outlander novel from #1 National Bestselling author Diana Gabaldon. Jamie Fraser, erstwhile Jacobite and reluctant rebel, knows three things about the American rebellion: the Americans will win, unlikely as that seems in 1778; being on the winning side is no guarantee of survival; and he’d rather die than face his illegitimate son — a young lieutenant in the British Army — across the barrel of a gun. Fraser’s time-travelling wife, Claire, also knows a couple of things: that the Americans will win, but that the ultimate price of victory is a mystery. What she does believe is that the price won’t include Jamie’s life or happiness — not if she has anything to say. Claire’s grown daughter Brianna, and her husband, Roger, watch the unfolding of Brianna’s parents’ history — a past that may be sneaking up behind their own family.", "hash": "02c9f6c4-18f2-4673-8fbc-c6abd7d7e3f7"}, {"title": "Written in My Own Heart's Blood (Outlander #8)", "author": "Diana Gabaldon", "pgs": 161, "sum": "Storyline: \nWRITTEN IN MY OWN HEART’S BLOOD is the eighth novel in the world-famous OUTLANDER series. In June of 1778, the world turns upside-down. The British army withdraws from Philadelphia, George Washington prepares to move from Valley Forge in pursuit, and Jamie Fraser comes back from the dead to discover that his best friend has married Jamie’s wife. The ninth Earl of Ellesmere discovers to his horror that he is in fact the illegitimate son of the newly-resurrected Jamie Fraser (a rebel _and_ a Scottish criminal!) and Jamie’s nephew Ian Murray discovers that his new-found cousin has an eye for Ian’s Quaker betrothed. Meanwhile, Claire Fraser deals with an asthmatic duke, Benedict Arnold, and the fear that one of her husbands may have murdered the other. And in the 20th century, Jamie and Claire’s daughter Brianna is thinking that things are probably easier in the 18th century: her son has been kidnapped, her husband has disappeared into the past, and she’s facing a vicious criminal with nothing but a stapler in her hand. Fortunately, her daughter has a miniature cricket bat and her mother’s pragmatism. The best of historical fiction with a Moebius twist, WRITTEN IN MY OWN HEART’S BLOOD weaves the fibers of a family’s life through the tapestry of historical drama.", "hash": "b42a313b-46f4-4eef-b649-ee165b1eca7b"}, {"title": "A Leaf on the Wind of All Hallows (Outlander #8.5)", "author": "Diana Gabaldon", "pgs": 14, "sum": "Storyline: \nAvailable for the first time as an exclusive eBook in this original Outlander novella, Diana Gabaldon reveals what really happened to Roger MacKenzie Wakefield’s parents. Orphaned during World War II, Roger believed that his mother died during the London Blitz, and that his father, an RAF pilot, was killed in combat. But in An Echo in the Bone, Roger discovers that this may not be the whole story. Now, in “A Leaf on the Wind of All Hallows,” readers finally learn the truth.", "hash": "11c61259-0b3b-4735-873a-ace0a0a990ee"}, {"title": "A Season of Angels (Angels Everywhere #1)", "author": "Debbie Macomber", "pgs": 45, "sum": "Storyline: \nA Season of Angels (Angels Everywhere #1) A heartwarming story of love and joy from bestselling author Debbie Macomber. Three angels are each given a prayer request to answer during the four weeks before Christmas. But there's a catch: each angel must teach her charge a memorable lesson before the wish is granted.", "hash": "5e32c87c-82e1-4c23-9d96-d1fc8e12bddc"}, {"title": "The Trouble with Angels (Angels Everywhere #2)", "author": "Debbie Macomber", "pgs": 45, "sum": "Storyline: \nThe Trouble with Angels (Angels Everywhere #2) Macomber follows her nationally bestselling A Season of Angels with a delightful sequel featuring three heavenly but feather-brained angelic messengers. Inspired by their success last Christmas, Shirley, Goodness, and Mercy return to answer the prayers of three troubled mortals and ensure a holiday season filled with love and joy.", "hash": "5b77ed11-239a-4c14-b846-355a41b86a92"}, {"title": "Touched by Angels (Angels Everywhere #3)", "author": "Debbie Macomber", "pgs": 46, "sum": "Storyline: \nTouched by Angels (Angels Everywhere #3) In Touched by Angels, the beloved author of Mrs. Miracle, showcases three of her most popular characters: the well-meaning if somewhat dizzy heavenly helpers, Shirley, Goodness, and Mercy. Macomber’s delightful angelic trio alights in New York City in Touched by Angels, and before they re-enter the Pearly Gates, they need to answer the prayers of a troubled school teacher, a shy and lonely young woman, and a wannabe Broadway actress a long way from home.", "hash": "08142eda-baec-4f06-8f90-2409b6e0f8fc"}, {"title": "Shirley, Goodness and Mercy (Angels Everywhere #4)", "author": "Debbie Macomber", "pgs": 14, "sum": "Storyline: \nShirley, Goodness and Mercy (Angels Everywhere #4) Alone at Christmas, Greg Bennett feels his life has been a waste. Sixty years old and he has no one to spend the holiday with - and no one who cares. Greg knows he's made mistakes, hurt people, failed in all the ways that matter. As a young man, he fathered a child he never acknowledged. He deserted a friend in his hour of need. He abandoned his own brother, who he hasn't seen in years. And he and his wife are in the midst of an acrimonious divorce. Listlessly wandering through the streets of San Francisco, Greg finds himself in a church - and he whispers a simple, heartfelt prayer. His prayer finds its way to the Archangel Gabriel, who assigns his favorite angels - Shirley, Goodness, and Mercy - to Greg Bennet's case. Gabriel knows that very soon, Greg will to need all three.", "hash": "b5a1fa76-904d-4ca8-b563-07d622038c56"}, {"title": "Those Christmas Angels (Angels Everywhere #5)", "author": "Debbie Macomber", "pgs": 59, "sum": "Storyline: \nThose Christmas Angels (Angels Everywhere #5) New York Times bestselling author Debbie Macomber brings readers a much-awaited NEW angel story this month! This tale brings back reader favorites Shirley, Goodness and Mercy, who are matchmaking angels playing havoc on an unsuspecting couple. Combining elements of comedy and fantasy with the added joy of the Christmas season, THOSE CHRISTMAS ANGELS will make the perfect holiday gift! This new angel book follows Debbie's three HarperCollins novels and one MIRA book, SHIRLEY, GOODNESS AND MERCY (10/99), and will be in great demand.", "hash": "c7a05f4f-818e-423e-bf05-1f8708df89cb"}, {"title": "Where Angels Go (Angels Everywhere #6)", "author": "Debbie Macomber", "pgs": 21, "sum": "Storyline: \nWhere Angels Go (Angels Everywhere #6) Christmas is a time for angel. Shirley, Goodness and Mercy are back! These three irresistible angels love their assignments on Earth. They especially love helping people who send prayer requests to Heaven (even though the Archangel Gabriel, their boss, knows they're going to break his rules)! This Christmas, Mercy is assigned to bring peace of mind to an elderly man&#151; who discovers an unexpected answer to his prayer. Goodness is sent to oversee the love life of a young woman afraid to risk commitment a second time. And Shirley has the task of granting a little boy's fondest Christmas wish.", "hash": "604d6f3b-b2d5-4bdc-b21d-e159d4b05b78"}, {"title": "Glad Tidings ", "author": "Debbie Macomber", "pgs": 53, "sum": "Storyline: \nGlad Tidings (Here Comes Trouble & There's Something About Christmas) CHRISTMAS NEWS! READ ALL ABOUT IT! This is a time for families, for togetherness, for memories. On Christmas Eve, Maryanne and Nolan Adams tell their kids the story they most want to hear --- how Mom and Dad met and fell in love. It all started when they were reporters on rival Seattle papers ... and next thing you know, Here Comes Trouble! Christmas is also a time for ... fruitcake. Rookie reporter Emma Collins hates fruitcake; for that matter, she hates Christmas, too. When three Washington State women are finalists in a national fruitcake contest, the story is assigned to her. That's bad enough. It gets worse when she has to fly in a small plane (scary!) with a smart-aleck pilot named Oliver Hamilton (sexy!) and his scruffy dog (cute!). In the end she meets three wise women, falls in love and learns There's Something About Christmas.", "hash": "3a77bb93-8c9a-4e38-85db-c8d5d4ce4161"}]