[{"title": "That Holiday Feeling (Virgin River #8)", "author": "Debbie Macomber", "pgs": 44, "sum": "Storyline: \nThat Holiday Feeling (Virgin River #8) by Debbie Macomber , Sherryl Woods, Robyn Carr Silver Bells by Debbie Macomber In this classic story, Debbie brings those Manning men and Manning sisters home for a mistletoe marriage when a single dad finally says \"I do.\" The Perfect Holiday by Sherryl Woods Will bachelor Trace Franklin become a groom-to-be by Christmastime? He sure will ... if Savannah Holiday's aunt Mae as anything to do with it. Under the Christmas Tree by Robyn Carr When the folks of Virgin River discover a box of adorable puppies under the town's Christmas tree they call on local vet Nathaniel Jensen for help. But it's his budding romance with Annie McCarty that really has tongues --- and tails --- wagging!", "hash": "46877452-836e-48dc-bc96-019a742181c4"}, {"title": "The Perfect Christmas ", "author": "Debbie Macomber", "pgs": 22, "sum": "Storyline: \nWHAT WOULD MAKE YOUR CHRISTMAS PERFECT? For Cassie Beaumont, it's meeting her perfect match. Cassie, at thirty-three, wants a husband and kids, and so far, nothing's worked. Not blind dates, not the Internet and certainly not leaving love to chance. What's left? A professional matchmaker. He's Simon Dodson, and he's very choosy about the clients he takes on. Cassie finds Simon a difficult, acerbic know-it-all, and she's astonished when he accepts her as a client. Claiming he has her perfect mate in mind, Simon assigns her three tasks to complete before she meets him. Three tasks that are all about Christmas: being a charity bell ringer, dressing up as Santa's elf at a children's party and preparing a traditional turkey dinner for her neighbors (whom she happens to dislike). Despite a number of comical mishaps, Cassie does it all --- and she's finally ready to meet her match.", "hash": "76f275fa-5a66-4572-a35d-e98a878d823a"}, {"title": "Starry Night ", "author": "Debbie Macomber", "pgs": 25, "sum": "Storyline: \n’Tis the season for romance, second chances, and Christmas cheer with this new novel from Debbie Macomber. Carrie Slayton, a big-city society-page columnist, longs to write more serious news stories. So her editor hands her a challenge: She can cover any topic she wants, but only if she first scores the paper an interview with Finn Dalton, the notoriously reclusive author. Living in the remote Alaskan wilderness, Finn has written a mega-bestselling memoir about surviving in the wild. But he stubbornly declines to speak to anyone in the press, and no one even knows exactly where he lives. Digging deep into Finn’s past, Carrie develops a theory on his whereabouts. It is the holidays, but her career is at stake, so she forsakes her family celebrations and flies out to snowy Alaska. When she finally finds Finn, she discovers a man both more charismatic and more stubborn than she even expected. And soon she is torn between pursuing the story of a lifetime and following her heart. Filled with all the comforts and joys of Christmastime, Starry Night is a delightful novel of finding happiness in the most surprising places.", "hash": "30c67bdd-059f-4957-9b0c-1171a92891d0"}, {"title": "Comfort & Joy ", "author": "Kristin Hannah", "pgs": 31, "sum": "Storyline: \nJoy Candellaro once loved Christmas more than any other time of the year. Now, as the holiday approaches, she is at a crossroads in her life; recently divorced and alone, she can’t summon the old enthusiasm for celebrating. So without telling anyone, she buys a ticket and boards a plane bound for the beautiful Pacific Northwest. When an unexpected detour takes her deep into the woods of the Olympic rainforest, Joy makes a bold decision to leave her ordinary life behind--to just walk away--and thus begins an adventure unlike any she could have imagined. In the small town of Rain Valley, six-year-old Bobby O’Shea is facing his first Christmas without a mother. Unable to handle the loss, Bobby has closed himself off from the world, talking only to his invisible best friend. His father Daniel is beside himself, desperate to help his son cope. Yet when the little boy meets Joy, these two unlikely souls form a deep and powerful bond. In helping Bobby and Daniel heal, Joy finds herself again. But not everything is as it seems in quiet Rain Valley, and in an instant, Joy’s world is ripped apart, and her heart is broken. On a magical Christmas Eve, a night of impossible dreams and unexpected chances, Joy must find the courage to believe in a love--and a family--that can’t possibly exist, and go in search of what she wants . . . and the new life only she can find.", "hash": "ec21e839-3578-45da-b105-29c4580995fc"}, {"title": "Soldier's Christmas (Wingmen Warriors #8)", "author": "Catherine Mann", "pgs": 13, "sum": "Storyline: \nSoldier's Christmas (Wingmen Warriors #8) by Rachel Lee, Merline Lovelace, Catherine Mann \"I'll Be Home\" by \"USA TODAY\" bestselling author Rachel Lee Seth Hardin is devoted to his career as a Navy SEAL, but his ex couldn't handle the pressures of being a military wife. Now he's resigned to spending the holidays alone... until he gets snowed in with Maria Hoskins and finds there are far greater gifts than just the material kind. \"A Bridge for Christmas\" by \"USA TODAY\" bestselling author Merline Lovelace As commander of her combat engineering team, Air Force reservist Abby Trent has a job to do--and Special Ops major Dan Maxwell is determined to get in her way. But as they work together on a crucial bridge, Abby discovers there's a lot more to the major than meets the eye. \"The Wingman's Angel\" by RITA(R) Award-winning author Catherine Mann There's just one thing keeping Air Force officers Joshua and Alicia Rosen from finalizing their divorce--the Arctic survival course they must pass together. But when they find themselves chased by armed pursuers, even the frozen tundra is no match for the heat of their desire.", "hash": "3f9e5d81-5d5a-4582-928f-e4fe97c1722e"}, {"title": "Lawless ", "author": "Nora Roberts", "pgs": 15, "sum": "Storyline: \nLawless (Love by Design: Jack's Stories 0.5) Filled with Nora's exquisite storytelling and memorable characters, this rare Western historical romance is a unique treat for Nora's many fans. Lawless is editorially connected to Loving Jack and Best Laid Plans, which will be published in September 2003 in Love by Design.", "hash": "be351520-3d8b-4456-9237-9f26ff509fb2"}, {"title": "Shoulda Been a Cowboy (Rough Riders #7)", "author": "Lorelei James", "pgs": 53, "sum": "Storyline: \nShoulda Been a Cowboy (Rough Riders #7) The bigger they are, the harder they fall--in love. Soldier Cameron McKay has found his niche, and it ain't ropin' steers and wearin' spurs. His deputy sheriff job, plus battle injuries that ended his military career, keep him right where he wants to be: Off the ranch and away from his family's pity. His darkest war memories are on lockdown, leaving him skeptical he'll ever find a woman who wants a man who's less than whole. Domini Katzinski has had to control every aspect of her life since age eleven, when she was orphaned in the Ukraine. Watching others' relationships crumble has convinced her to focus on the short-term and find a take-charge man to whom she can relinquish total sexual control. Cam fits the bill: gorgeous, with a brooding vulnerability no one else seems to see. Plus, he has his own handcuffs. Once Cam gets over his surprise that sweet, shy Domini wants to be dominated, he is back to issuing orders. Their passion is as hot as a rocket-propelled grenade--and if Domini has her way, it's a one-shot deal. Cam wants more, and launches a full-out sensual assault...until tragedy strikes, forcing him to change tactics as he tries to keep past demons from blowing their future together all to hell...", "hash": "3188cbd6-240a-44c7-a798-31954e8d0d84"}, {"title": "All Jacked Up (Rough Riders #8)", "author": "Lorelei James", "pgs": 52, "sum": "Storyline: \nAll Jacked Up (Rough Riders #8) Pulling off the ultimate con...if they can keep from pulling off their clothes Keely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she's left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. Jack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He'll oversee her project if she acts the part of his loving fiance. Their sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they're as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn't measure up to Jack's big-city lifestyle. When the dust settles, Jack and Keely must face the fact they're not fooling anyone but themselves or they'll risk losing the real deal. Warning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.", "hash": "3b958afc-29da-49ee-af3a-bfb18641fba2"}, {"title": "Raising Kane (Rough Riders #9)", "author": "Lorelei James", "pgs": 48, "sum": "Storyline: \nRaising Kane (Rough Riders #9) She surrendered the reins. Now he's raising the stakes. When a patch of ice sends attorney Ginger Paulson head-over-high-heels down a flight of stairs, she has no one to care for her young son and her invalid father - until lethally sexy Kane McKay shows up at the hospital, determined to prove his cowboy chivalry. Past experience has inoculated her against take-charge men, but even Ginger isn't immune to Kane's invasive charm and Built Ford Tough body. For two years rancher Kane McKay has followed the Little Buddies mentoring program's cardinal rule - hands off his Little Buddy Hayden's mama. But one look at Ginger's bruised body and Kane is through watching the stubborn woman take care of everyone but herself. The feisty, curvy redhead needs his help, and he'll give her the hands-on type whether she likes it or not. After Kane throws out doctor's orders and issues his own demands - her full sexual submission - Ginger realizes Kane's caring nature extends beyond just fulfilling her physical needs. Can the former hell-raiser convince the gun-shy single mom to look beyond his past - toward a shared future? Warning: Contains one sweet and hot hunk of cowboy manflesh who uses every sexual trick in the book to render a sassy, fast-talking attorney speechless and put a new twist on the term \"binding arbitration\".", "hash": "d6c9c3d0-7e91-4cf6-8fbe-894e3b21896f"}, {"title": "Slow Ride (Rough Riders #9.5)", "author": "Lorelei James", "pgs": 6, "sum": "Storyline: \nSlow Ride (Rough Riders #9.5) A Rough Riders free read. Keely McKay Donohue is enduring the longest wedding reception of her life: her own. The only saving grace is that Jack Donohue is finally hers. Usually her hunky man gives her everything she wants, so why is her groom denying her the one thing she wants right now? Jack thought his secretive wait-for-the-honeymoon plan was romantic, until he realizes he's only put Keely in a fighting mood. If he wants to get back on his temperamental bride's good side, he'd better find a way to sweep his cowgirl off her boots...fast.", "hash": "fea57cf7-d2e9-4ea0-8536-ae3a14fa9980"}]