[{"title": "Cowgirls Don't Cry (Rough Riders #10)", "author": "Lorelei James", "pgs": 57, "sum": "Storyline: \nCowgirls Don't Cry (Rough Riders #10) Good girls can play rough too... Rough Riders, Book 10 Jessie McKay has accepted her marriage to Luke McKay wasn't perfect. After two years of widowhood, she's ready to kick up her bootheels-until Luke's younger brother shows up to spoil her fun. But if Brandt thinks she'll ever take orders from another McKay male, he's got manure for brains. Brandt McKay has avoided his sweet, sexy sister-in-law ever since the night he confessed his feelings for her weren't the brotherly type. Unexpectedly faced with proof of Luke's infidelity, Brandt is forced to ask for Jessie's help in taking care of Luke's young son. Jessie agrees on one condition-she wants Brandt's boots exclusively under her bed for the duration. The sexual heat that's always simmered between them ignites. Brandt is determined to make the temporary situation permanent, proving to Jessie he's a one-woman man. And Jessie is shaken by feelings she's sworn never to have again for any man...especially not a McKay.Warning: Contains branding-iron-hot sex, the one McKay on earth who wants to be tamed, and a woman who's decided tame is for nice girls who finish last.", "hash": "76664531-625d-4c59-bb6e-2def4db00601"}, {"title": "Chasin' Eight (Rough Riders #11)", "author": "Lorelei James", "pgs": 64, "sum": "Storyline: \nChasin' Eight (Rough Riders #11)  The chase is on… Rough Riders, Book 11 Bull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. Hollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. But Chase has sworn off women. Forever. Or at least a month. Whichever comes first. When they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?", "hash": "ddf316a9-f43b-40fb-b064-fc7ee98ebf51"}, {"title": "Cowboy Casanova (Rough Riders #12)", "author": "Lorelei James", "pgs": 61, "sum": "Storyline: \nCowboy Casanova (Rough Riders #12) His rough touch makes her lose control... In Sundance, Wyoming, you can't throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he's Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. As for the curvy brunette eying him from across the room? He'll eat his Stetson if she's the experienced Domme she claims to be. Bennett offers her a deal he'll let her call the shots for one night. But the next night he gets to prove to her how freeing it'll be when he takes the reins. Ainsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she's stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben's urging her to explore her submissive side outside the club, and there's something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. Can Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won't survive the light of day? Warning: This book contains a lot of kinky sex. No, seriously, there's A LOT of kinky cowboy sex in this Rough Riders installment. You've been warned.", "hash": "2070e066-b4bf-4120-9e63-21b5b134ece4"}, {"title": "Kissin' Tell (Rough Riders #13)", "author": "Lorelei James", "pgs": 62, "sum": "Storyline: \nKissin' Tell (Rough Riders #13) She once led him around by a string. Now he's the one holding the reins. Georgia Hotchkiss swore wild horses couldn't drag her back to Sundance, Wyoming. So it's ironic she's forced to take a rodeo PR job in her former hometown right before her ten-year class reunion. The only thing worse than facing her cheating ex-husband and his pregnant wife? Showing up to the reunion without a date. Fate smiles on her when she runs into her former classmate and current cowboy hottie Tell McKay. With his infectious smile and fun-loving ways not to mention his banging body he's the perfect solution to her problem. Tell McKay had it so bad for Hot Lips Hotchkiss during high school that he let her run roughshod over him. But he is no longer that easily manipulated boy these days he's earned a reputation with the ladies that lives up to the McKay last name. He agrees to escort her to the reunion with one stipulation; that Georgia proves she has left behind the goody-goody cheerleader of the past by sharing his bed. Their sexual chemistry flashes so bright, they barely notice that the reunion has come and gone, and now they're tangled up in another dreaded R word \"relationship.\" But if Tell wants to get the girl this go-around, he'll have to come up with a whole new set of knots to tie up her heartstrings. Warning: Contains a sweet talkin wild cowboy with a wagon load of crazy-hot sex fantasies and the mad bedroom skills to back up his claims.", "hash": "e0b09263-5184-4d25-8d39-c3736b975985"}, {"title": "Gone Country (Rough Riders #14)", "author": "Lorelei James", "pgs": 75, "sum": "Storyline: \nGone Country (Rough Riders #14) She’s a little bit country, and he’s…not. Arizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. Rielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B&B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. Sharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. Warning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong", "hash": "34da7dca-1dae-4c2b-b8c6-94de69e00647"}, {"title": "Short Rides (Rough Riders #14.5)", "author": "Lorelei James", "pgs": 26, "sum": "Storyline: \nShort Rides (Rough Riders #14.5) Short Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character's lives after the happily ever after... The stories included in the Short Rides anthology are: King of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine's Day. Rough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. All Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely's raging pregnancy hormones, will Jack need to wear a cup in the delivery room?", "hash": "ea05b182-42c1-46eb-87f9-1c1141f2f014"}, {"title": "Redneck Romeo (Rough Riders #15)", "author": "Lorelei James", "pgs": 70, "sum": "Storyline: \nRedneck Romeo (Rough Riders #15) The last McKay standing is knocked to his knees… Three years ago, Dalton McKay looked across the altar and saw the woman he knew he’d love for the rest of his life…only it wasn’t his bride. That’s when he took the McKays’ love-’em-and-leave-’em reputation to new heights—fleeing the ceremony and Wyoming. Now a family issue has brought Dalton back to Sundance, giving him a chance to prove to everyone—especially the woman he thought he lost—that he’s a changed man. Aurora “Rory” Wetzler has fallen for cowboy hottie Dalton’s smooth-talkin’ ways too many times. So he’s determined to convince her he’s playing for keeps this go around? Fine. She’ll call that bluff—she can’t ignore their intense chemistry or resist smokin’ hot sex, but she’s not willing to gamble her heart again. Dalton has plenty of fences to mend with the McKays, but his biggest fear is that Rory doesn’t believe they have a future. He’ll have to pull out all the stops to show her they belong together for the long haul. Warning: Contains a sexy cowboy who tames his sassy lady love with his romantic and his kinky side. In explicit detail.", "hash": "247e8f00-7103-4efc-b5dd-58bfa28a6de2"}, {"title": "My Lady Quicksilver (London Steampunk #3)", "author": "Bec McMaster", "pgs": 48, "sum": "Storyline: \nMy Lady Quicksilver (London Steampunk #3) Determined to destroy the Echelon she despises, Rosalind Fairchild is on seemingly easy mission. Get in. Uncover the secrets of her brother's disappearance. And get out. In order to infiltrate the Nighthawks and find their leader, Sir Jasper Lynch, Rosalind will pose as their secretary. But she doesn't count on Lynch being such a dangerously charismatic man, challenging her at every turn, forcing her to re-evaluate everything she knows about the enemy. He could be her most dangerous nemesis—or the ally she never dreamed existed.", "hash": "e144c6ba-b959-4101-b089-42cd494b76d1"}, {"title": "Heart of Iron (London Steampunk #2)", "author": "Bec McMaster", "pgs": 48, "sum": "Storyline: \nHeart of Iron (London Steampunk #2) Lena Todd makes the perfect spy. Nobody suspects the flirtatious debutante could be a sympathizer for the humanist movement haunting London’s vicious blue blood elite. Not even the ruthless Will Carver, the one man she can’t twist around her little finger, and the one man whose kiss she can’t forget…", "hash": "9b9b2b61-8474-45cf-9737-9d8dcc908dfc"}, {"title": "Tarnished Knight (London Steampunk #2)", "author": "Bec McMaster", "pgs": 17, "sum": "Storyline: \nTarnished Knight (London Steampunk #1.5) After a vicious vampire attack left him struggling to leash the dark urges of the craving virus, John \"Rip\" Doolan thinks he's finally starting to master the darkness within. The only thing that threatens to shatter his hard-won control is Esme, his closest friend and the only woman he's ever wanted. If the stubborn beauty ever realized precisely what was going through his mind, their friendship would be ruined. For six months, Esme has waited for Rip to recover and take her as his thrall, not daring to hope for more. Too afraid to put her heart on the line, she is devastated when Rip reveals that he never had any intentions of making her his. But when a savage gang of Slashers start causing havoc in Whitechapel, Rip and Esme have no choice. They must face up to the depth of the passion that burns between them and forge a new relationship…or risk losing each other forever.", "hash": "c8abfd51-0633-4deb-a7a1-e3c023077774"}]