[{"title": "Silent Blade (Kinsmen #1)", "author": "Ilona Andrews", "pgs": 10, "sum": "Storyline: \nSilent Blade (Kinsmen #1) Old hatreds die hard. Old love dies harder. On Meli Galdes' home planet, the struggle for power is a bloody, full-contact sport--in business and on the battlefield. For years her lethal skills have been a valuable asset in advancing her family's interests. She's more than earned her right to retire, but her kinsmen have one last favor to ask. Kill the man who ruined her life. Celino Carvanna's razor-sharp business acumen--and skills with a blade--won him the freedom to do as he pleases. There's only one thing he can't seem to control--his reaction to the mysterious woman who tantalizes his senses. Her eyes alone set his blood simmering, stirring ridiculous adolescent fantasies about breasts and honey. With a few words she dissects his soul. Who is she? And how does she slide so easily under his well-guarded skin? It's almost too easy to draw Celino within the kill zone. Meli plans to revel in him. Drink him in. Wring every drop of pleasure out of every moment. And when she's sure he belongs to her, she will finally repay a decade's worth of pain--in a single, brutal dose of reality.", "hash": "854f0b27-8005-4e05-8b9d-be3c2587facb"}, {"title": "Silver Shark (Kinsmen #2)", "author": "Ilona Andrews", "pgs": 21, "sum": "Storyline: \nSilver Shark (Kinsmen #2) Claire Shannon is a killer. She uses no weapons, only her mind. Born on a planet locked in a long war, Claire is a psycher, a woman with the ability to attack minds and infiltrate a biological computer network where psychers battle to the death. But when the war abruptly ends, Claire must hide her psycher's ability to survive. She is deported to a new planet, a vivid beautiful place, where she meets Venturo Escana, a powerful psycher, whose presence overwhelms both her mind and her body. She thought she had left war and death behind, but now she must fight for her new life and this battle might just cost her everything...", "hash": "0e36eacd-96eb-4be8-9d24-27c7ae86c861"}, {"title": "A Mere Formality ", "author": "Ilona Andrews", "pgs": 6, "sum": "Storyline: \nThe alarm chimed, sending tiny shivers through Deirdre's fingers, coated in liquid interface.", "hash": "cf3d389f-1773-4845-bfe3-2aea2a0a1efc"}, {"title": "His Lordship Possessed ", "author": "Lynn Viehl", "pgs": 29, "sum": "Storyline: \nLady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.", "hash": "1a05b934-bf71-42d9-b528-2a5c7e84f5fa"}, {"title": "Her Ladyship's Curse ", "author": "Lynn Viehl", "pgs": 28, "sum": "Storyline: \nIn a steampunk version of America that lost the Revolutionary War, Charmian (Kit) Kittredge makes her living investigating magic crimes and exposing the frauds behind them. While Kit tries to avoid the nobs of high society, as the proprietor of Disenchanted & Co. she follows mysteries wherever they lead. Lady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.", "hash": "c0dcda7c-e0f5-4d87-8a3f-e5993c605de1"}, {"title": "Most Wanted (Love Slaves of the Alphas #1)", "author": "Shannon West", "pgs": 24, "sum": "Storyline: \nMost Wanted (Love Slaves of the Alphas #1) Hot porn star Ryan Henderson is desperate. On the run for a murder he didn’t commit, he tries to hide out by selling himself at an auction for love slaves. When a handsome Lycan wolf-shifter, Blayde Balenescu buys him, Ryan thinks his prayers have been answered—only to find out he’s jumped from the frying pan into the fire! Blayde is an intergalactic bounty hunter who’s only after the money Ryan will bring in. When Ryan gets off the transport bringing him to Blayde, however, he’s startled at Blayde’s violent reaction once he touches him. Dominant Blayde has recognized Ryan as his mate, and now Blayde has to figure out not only how he can possibly convince the young man to stay with him, and allow him to teach him proper behavior, but also how he’ll manage to keep Ryan alive long enough to save him from his powerful enemies.", "hash": "4639c36e-ae2e-46f6-8004-dd1c0a4dc0ae"}, {"title": "The Alpha's Concubine (Love Slaves of the Alphas #2)", "author": "Shannon West", "pgs": 19, "sum": "Storyline: \nThe Alpha's Concubine (Love Slaves of the Alphas #2) When Nikolai Balenescu and his brother stop by a small, out of the way planet called Jayron to deliver some goods, they have no idea what’s in store for them. Nikolai is immediately attacked by a fierce, gorgeous little prince named Jagger, who takes the Lycan shifter away in chains. Nikolai allows himself to be disarmed because he instantly recognizes the prince as his mate, and he’s willing to play along until he can figure out why his ship was attacked and how he’s now going to save his prince from his fearsome Lycan family who will be coming for him, intent on revenge. Meanwhile, Prince Jagger decides he’ll take the gorgeous Lycan as his love slave and puts him in chains. At first Nikolai is angry, but soon decides that being a love slave to his beautiful mate is an idea he’s only too happy to go along with.", "hash": "6c40e1ba-630d-448d-ad77-e0667ece1549"}, {"title": "Konnor and His Omega Mate (Love Slaves of the Alphas #3)", "author": "Shannon West", "pgs": 21, "sum": "Storyline: \nKonnor and His Omega Mate (Love Slaves of the Alphas #3) Ethan is having a really bad day. First he’s required by Lycan law to appear before a judging panel consisting of big, important alphas who intimidate him and make him so nervous he’s afraid he won’t be able to perform at all. He’s desperate to prove himself a worthy gamma, so he can get an apprenticeship, and start his new life. When he walks into the room he finds Konnor Balenscu, a handsome, important Lycan alpha, who also happens to be his mate. Ethan is incredibly drawn to him and is amazed to learn that Konnor returns his interest. There’s only one hitch—Konnor finds him to be a lowly omega, deemed mentally defective by the proud Lycans, and doomed to live his life as a love slave, sold to the highest bidder. He only has one option left. He has to run.", "hash": "caa97393-5be4-4ba9-979d-970fbe885673"}, {"title": "Reluctant Alpha (Love Slaves of the Alphas #4)", "author": "Shannon West", "pgs": 22, "sum": "Storyline: \nReluctant Alpha (Love Slaves of the Alphas #4) Handsome, young Kai is living a lie. On Scythia, male children are “rejected” so his mother, the queen, hid his true sex all his life. On this planet of Amazon-like women, he’s been able to hide out, but his mother needs to get him safely away from the planet, arranging a marriage to the powerful Lycan alpha. Lucas likes men but is being pressured to find a female and have an heir. Reluctantly, he agrees to meet Princess Kai, and is shocked to discover Kai is no princess, but a handsome young man! Instantly recognizing him as his bloodmate, Lucas is still furious at the deception. He mates with Kai and takes him home, but the lies between them threaten to tear them apart. Kai is still harboring a terrible secret—one that will destroy his world if it ever becomes known.", "hash": "3b5327f7-d55b-4ad0-bebd-5845f6e3606d"}, {"title": "Captive Wolf (Love Slaves of the Alphas #5)", "author": "Shannon West", "pgs": 24, "sum": "Storyline: \nCaptive Wolf (Love Slaves of the Alphas #5) Kyle travels with his bounty hunter cousin, Blayde, to arrest Tarr Bonnet, an exotic, handsome Tygerian national who trades in love slaves all over the galaxies. When Kyle meets him in a sting operation, Tarr turns the tables and takes him captive—he intends to give Kyle to his twin brother Taz, to become his love slave. Taz wants nothing to do with any Lycan, the ones who held him on their planet as a prisoner of war. Yet the second he sees Kyle, drugged, naked and bound in a cage on Tarr’s ship, he knows he has to save him. When Kyle awakens, he sees his mate in Taz and imprints on him immediately, in the way of Lycan wolves. Both men are extremely dominant, but only one can win this struggle between them. Meanwhile, Kyle’s family is planning a rescue, and they don’t care who gets in the way.", "hash": "2382e0cf-6033-4a12-bf5e-d39bdea5e375"}]