[{"title": "Wolf's Bounty (Love Slaves of the Alphas #6)", "author": "Shannon West", "pgs": 19, "sum": "Storyline: \nWolf's Bounty (Love Slaves of the Alphas #6) Larsson Balenescu is trying hard to get over the fact that his fated mate is not only a Tygerian, and one of the Alliance’s most bitter enemies, but also the fact that he’s Tarr Bonnet, one of the worst pirates and sex slave traffickers in the known galaxies. When Larsson discovers that Tarr has put a price on his head, he’s furious, and vows never to mate with the man, no matter how painful it is for him to stay away from him. Soon he’s captured by Tarr’s men and taken to his ship where Tarr sets out to claim him as his love slave. An accident en route forces them to crash on a strange moon, where Larsson is captured by the inhabitants. His only hope lies in Tarr’s ability to save him. But who will save him from Tarr?", "hash": "72d3885e-5eb9-465d-b8a2-3ed8ae2cc5e5"}, {"title": "Wicked as They Come (Blud #1)", "author": "Delilah S. Dawson", "pgs": 59, "sum": "Storyline: \nWicked as They Come (Blud #1) When nurse Tish Everett forced open the pesky but lovely locket she found at an estate sale, she had no idea she was answering the call of Criminy Stain, from the far off land of Sang. He’d cast a spell for her, but when she’s transported right to him, she’s not so sure she’s ready to be under the spell of another man. (It didn’t go so well last time with controlling, abusive, domineering Jeff.) If only Criminy wasn’t so deliciously rakish…. Half the inhabitants of Sang are Pinkies—human—and the other half are Bludmen, who in Tish’s world would be called vampires. But they don’t mess with any of the bat/coffin/no sunlight nonsense. They’re rather like you and me, just more fabulous, long living, and mostly indestructible. (They're also very good kissers.) But when the evil Mayor of Manchester (formerly Bludchester) redoubles his efforts to rid Sang of the Bludmen once and for all, stealing Tish’s locket in hopes of traveling back to her world himself for reinforcements, Criminy and Tish must battle ghosts, sea monsters, wayward submarines, a secret cabal, and thundering Bludmares to get the locket back and allow Tish to return home…but has she found love with Criminy? Could she stay in Sang forever?", "hash": "dc2928c4-4f5c-4368-9269-8da069d024e1"}, {"title": "Wicked as She Wants (Blud #2)", "author": "Delilah S. Dawson", "pgs": 62, "sum": "Storyline: \nWicked as She Wants (Blud #2) When Blud princess Ahnastasia wakes up, drained and starving in a suitcase, she’s not sure which calls to her more: the sound of music or the scent of blood. The source of both sensations is a handsome and mysterious man named Casper Sterling. Once the most celebrated musician in London, Sangland, he’s fallen on hard times. Now, much to Ahna’s frustration, the debauched and reckless human is her only ticket back home to the snow-rimmed and magical land of Freesia. Together with Casper’s prickly charge, a scrappy orphan named Keen, they seek passage to Ahna’s homeland, where a power-hungry sorceress named Ravenna holds the royal family in thrall. Traveling from the back alleys of London to the sparkling minarets of Muscovy, Ahna discovers that Freesia holds new perils and dangerous foes. Back in her country, she is forced to choose between the heart she never knew she had and the land that she was born to rule. But with Casper’s help, Ahna may find a way to have it all….", "hash": "3b4b55cd-40db-443a-9952-94f8381ede3d"}, {"title": "Wicked After Midnight (Blud #3)", "author": "Delilah S. Dawson", "pgs": 64, "sum": "Storyline: \nWicked After Midnight (Blud #3) Life as a contortionist in Criminy’s Clockwork Caravan should be the height of exotic adventure, but for Demi Ward, it’s total dullsville. Until her best friend, Cherie, is stolen by slavers outside of Paris, and Demi is determined to find her. On the run from his own past, Vale Hildebrand, a dashing rogue of a highwayman, hides Demi from the slavers…but why? He pledges to help her explore the glittering cabarets of Paris to find her friend, but much to Vale’s frustration, Demi soon attracts a host of wealthy admirers. The pleasures of music, blood, and absinthe could turn anyone’s head, and it would be all too easy to accept Cherie’s disappearance as inevitable—but with Vale’s ferocious will and Demi’s drive to find her friend, they soon have a lead on a depraved society of Parisian notables with a taste for beautiful lost girls. Can Demi wind her way through the seedy underbelly of Paris and save her best friend before she, too, is lost?", "hash": "2320db4f-7098-420e-b928-80449d33f3c9"}, {"title": "The Mysterious Madam Morpho (Blud #1)", "author": "Delilah S. Dawson", "pgs": 20, "sum": "Storyline: \nThe Mysterious Madam Morpho (Blud #1.5) An elusive woman arrives at Criminy’s doorstep with a steamer trunk, begging for a position in the caravan to perform her unique new act. She opens her trunk to reveal a menagerie of brilliantly colored butterflies. The woman, who calls herself Madam Morpho, is on the run from a dark past in London, where she was forced to leave her equipment behind and abscond with only her tiny performers. Playing a hunch, Criminy hires Madam Morpho on the spot. Taking her down to meet Mr. Murdoch, the reclusive talented engineer who keeps the carnival’s clockworks running, Criminy instructs them to work together to design and build a groundbreaking new circus for the butterflies. Amid the magical ambiance of the circus and the hint of danger from Madam Morpho’s pursuers, she and Mr. Murdoch soon find that their scientific collaboration has produced chemistry of a more romantic kind.", "hash": "4724cc9b-fd41-4609-b7a3-a7846a6c0467"}, {"title": "The Peculiar Pets of Miss Pleasance (Blud #2)", "author": "Delilah S. Dawson", "pgs": 21, "sum": "Storyline: \nThe Peculiar Pets of Miss Pleasance (Blud #1.6) In a world ruled by blood, live pets are rare and kindness rarer still. London pet shop owner Frannie Pleasance has a mysterious way with animals and keeps her charges (and heart) locked in a veritable Eden. She thinks Casper Sterling is just another stray…until she takes in the troublesome lodger (and unwelcome suitor) and becomes the victim of a series of strange and dangerous occurrences. When an unexplained fire threatens to destroy Frannie's carefully guarded world, firefighter Thom Maccallan is there to extinguish the blaze and help gather the lost creatures. The heat between Frannie and Thom begins to burn, but someone's still after the lady. Could it be Casper himself, or is Frannie’s new lodger just another victim of fate? Will they be able to figure out who's pursuing Frannie—and stop them—before she loses everything?", "hash": "9231723f-0e01-41ca-a7d5-4296cd58564a"}, {"title": "The Damsel and the Daggerman (Blud #3)", "author": "Delilah S. Dawson", "pgs": 20, "sum": "Storyline: \nThe Damsel and the Daggerman (Blud #2.5) Bad boy knife-thrower Marco Taresque is the hottest and most dangerous performer in the caravan. He keeps to himself until a pesky female journalist arrives, anxious to interview him about his checkered past—his last assistant disappeared under mysterious and bloody circumstances, earning him the nickname “The Deadly Daggerman.” Unsinkable journalist and adventurer Jacinda Harville doesn’t take no for an answer, and she’s determined to wear down Marco no matter how threatening—or incredibly desirable—he might appear. He agrees to an interview—but only if she’ll let him strap her to a spinning table and throw knives at her body. How can she say no? And how can she resist him when he leans close for a kiss that strikes her more sharply than any blade? It’s the first time she’s let a man get the better of her, and she’s determined it will be the last…", "hash": "997720e0-a231-419c-8390-ba6e1da1473f"}, {"title": "Born (Born #1)", "author": "Tara Brown", "pgs": 41, "sum": "Storyline: \nBorn (Born #1) \"It's us and them, Em. There are no regular people anymore.\" Ten years ago when the world ended she ran for her life. Five weeks ago the world she'd hidden from came knocking on the door of her secluded cabin. Ten days ago she found salvation hiding amongst the dead. Yesterday she went back for the living. Today she wonders if she will live to see tomorrow. What do you do when the world you were born to is gone? Where do you hide when even your own body isn't safe? Emma ran when her daddy told her to. She hid like he said she should. He was the first person she turned her back on. The first one she let die. Ten years has gone by and she still lives by the simple rules he taught her when she was nine years old. \"Don't help anyone. Don't go where other people are unless you have to. Trust no one. Always pull the trigger.\" Until one night she hears the worst sound in the world, a knock. A simple, timid knock, on the door to her cabin. Only the voice of the brave little girl, ready to die for her brother, persuades Emma to open the door. As her fingers turn the lock, she has a terrible feeling she will regret her decision. But even as regret fills her world, so do love and companionship. Things she never imagined she would ever have again. Everything comes at a cost, you decide what you'll pay.", "hash": "2096d6ab-ca60-408d-83e3-78e6b0550240"}, {"title": "Master of the Highlands (Highlands #1)", "author": "Veronica Wolff", "pgs": 53, "sum": "Storyline: \nMaster of the Highlands (Highlands #1) Lily Hamlin is making a pilgrimage to Scotland with hopes for some direction in her life. There she discovers an overgrown maze and a strange stone map-and lands back in time, in the Lochaber of 1654. Ewen, Chief of the Clan Cameron, must save his people from the brutal redcoats. But then he meets a saucy lass with a peculiar accent, no regard for his title-and an arousing body. Drawn to each other despite their differences, they both realize that they don't want her to go back to her own time. But with battles brewing, staying is a gamble.", "hash": "374906cc-88f3-490c-bb64-4f9d84757e37"}, {"title": "Sword of the Highlands (Highlands #2)", "author": "Veronica Wolff", "pgs": 56, "sum": "Storyline: \nSword of the Highlands (Highlands #2) One minute, she's New York heiress and art curator Magda Deacon, enraptured by the Highlander captured in an old portrait. The next, she's falling through time to 17th-century Scotland--and embarking on the most erotic journey of her life.", "hash": "6d6157e8-98b2-4b6e-8cde-d0094dc6dbac"}]