[{"title": "Warrior of the Highlands (Highlands #3)", "author": "Veronica Wolff", "pgs": 49, "sum": "Storyline: \nWarrior of the Highlands (Highlands #3) While doing research for her dissertation, graduate student Haley Fitzpatrick stumbles upon a strange artifact—which sends her back in time to old Scotland, directly into the path of the notorious Alasdair MacColla, a warrior known for his enormous physical presence and bloodthirsty reputation. Assuming that this woman with the mysterious accent is an enemy spy, MacColla promptly kidnaps her. But Haley’s beauty and courage strike a chord in the Highlander, awakening a desire in him that he hadn't known existed. At first Haley’s frightened by her imposing captor. But she soon discovers that MacColla is much more than the brute that modern history describes, and decides she’s meant to be by his side. But unless she can find a way to change the past, the warrior she’s fallen for is destined to meet a tragic end…", "hash": "ecbb6013-b81b-41ae-bf69-c7c9fa3b05fe"}, {"title": "Lord of the Highlands (Highlands #4)", "author": "Veronica Wolff", "pgs": 52, "sum": "Storyline: \nLord of the Highlands (Highlands #4) An online dating service may have pronounced Felicity \"unmatchable\" but she's determined-and destined-to find her perfect mate. All it takes is a mystical deck of Tarot cards and suddenly she's in 17th-century Scotland, smitten by a warrior who must make a daring choice: send Felicity back to her own time, or endanger both their lives.", "hash": "f8c85ad5-8ea6-49c9-a3a4-833ea8391ad9"}, {"title": "Grimspace (Sirantha Jax #1)", "author": "Ann Aguirre", "pgs": 45, "sum": "Storyline: \nGrimspace (Sirantha Jax #1) As the carrier of a rare gene, Jax has the ability to jump ships through grimspace—a talent which cuts into her life expectancy, but makes her a highly prized navigator for the Corp. But then the ship she’s navigating crash-lands, and she’s accused of killing everyone on board. It’s hard for Jax to defend herself: she has no memory of the crash. Now imprisoned and the subject of a ruthless interrogation, Jax is on the verge of madness. Then a mysterious man breaks into her cell, offering her freedom—for a price. March needs Jax to help his small band of rogue fighters break the Corp monopoly on interstellar travel—and establish a new breed of jumper. Jax is only good at one thing—grimspace—and it will eventually kill her. So she may as well have some fun in the meantime…", "hash": "76c13efa-3412-406f-874f-0fc32266f5a8"}, {"title": "Wanderlust (Sirantha Jax #2)", "author": "Ann Aguirre", "pgs": 47, "sum": "Storyline: \nWanderlust (Sirantha Jax #2) Sirantha Jax doesn’t take chances… she jumps at them… Sirantha Jax is a “Jumper,” a woman who possesses the unique genetic makeup needed to navigate faster than light ships through grimspace. Jax has worked for the Farwan Corporation her entire career. But now the word’s out that the Corp deliberately crashed a passenger ship, and their stranglehold on intergalactic commerce has crumbled—which means that Jax is out of a job. She’s also broke, due to being declared dead a little prematurely. So when the government asks her to head up a vital diplomatic mission, Jax takes it. Her mandate: journey to the planet Ithiss-Tor and convince them to join the Conglomerate. But Jax’s payday is light years away. First, she’ll have to contend with Syndicate criminals, a stormy relationship with her pilot, man-eating aliens, and her own grimspace-weakened body. She’ll be lucky just to make it to Ithiss-Tor alive…", "hash": "3f2b4ce4-05f8-42d6-ad16-4e4b440d3194"}, {"title": "Doubleblind (Sirantha Jax #3)", "author": "Ann Aguirre", "pgs": 49, "sum": "Storyline: \nDoubleblind (Sirantha Jax #3) It’s not easy to tread lightly wearing steel-toed boots. Sirantha Jax isn’t known for diplomatic finesse. As a “Jumper” who navigates ships through grimspace, she’s used to kicking ass first and taking names later—much later. Not exactly the obvious choice to sell the Conglomerate to the Ithtorians, a people whose opinions of humans are as hard as their exoskeletons. And Ithiss-Tor council meetings aren’t the only place where Ambassador Jax needs to maneuver carefully. Her lover, March, is frozen in permanent “kill” mode, and his hair-trigger threatens to sabotage the talks—not to mention their relationship. But Jax won’t give up on the man or the mission. With the Outskirts beleaguered by raiders, pirates, and the flesh-eating Morgut, an alliance with Ithiss-Tor may be humanity’s only hope. Which has Jax wondering why a notorious troublemaker like her was given the job.", "hash": "30d1cb6c-63c9-4e78-900b-16eee809a0a4"}, {"title": "Obsession ", "author": "Jennifer L. Armentrout", "pgs": 46, "sum": "Storyline: \nThis is a stand alone novel that is an adult spin-off of the Lux Series You do not need to read a Lux book to read Obsession and vice versa. He’s arrogant, domineering, and... To. Die. For. Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoys his job. That is, until he’s saddled with something he’s never had to do before: protect a human from his mortal enemy. Serena Cross didn’t believe her best friend when she claimed to have seen the son of a powerful senator turn into something... unnatural. Who would? But then she witnesses her friend’s murder at the hands of what can only be an alien, thrusting her into a world that will kill to protect their secret. Hunter stirs Serena’s temper and her lust despite their differences. Soon he’s doing the unthinkable—breaking the rules he’s lived by, going against the government to keep Serena safe. But are the aliens and the government the biggest threats to Serena’s life… or is it Hunter?", "hash": "4c8e0efb-cfa1-46ff-bcad-ac6c6ba0ad8a"}, {"title": "Skye's Trail (The Angelini #1)", "author": "Jory Strong", "pgs": 19, "sum": "Storyline: \nSkye's Trail (The Angelini #1) For Skye Delano, the hunt and the kill are sometimes inexorably tied together. Her origins shrouded behind an impenetrable wall of mental pain, Skye has survived and evolved into a tracker, a hunter who metes out justice to those who prey on the helpless. Alone but not lonely, she's been content with her life. But now her body is changing and there's an underlying craving that's left her restless. She needs to take a mate - or rather, two mates... Detective Rico Santana wants and needs Skye - for himself, and to track a couple of kids who have gone missing. In all the centuries that Giovanni Banderali has been alive, he's never desired any woman enough to bind her to him as a companion. That changed the moment he saw Skye. She's a threat to the fledgling vampires he's searching for, but nothing will stop him from claiming her - not even the Angelini blood that flows through her veins. Adversaries, natural enemies - dangerous allies - the bond that links them is stronger than lust, more powerful than love. When an Angelini chooses a mate, no man can resist.", "hash": "9322f2a7-97dc-40df-9eb2-716df16866b2"}, {"title": "Awaken Me Darkly (Alien Huntress #1)", "author": "Gena Showalter", "pgs": 34, "sum": "Storyline: \nAwaken Me Darkly (Alien Huntress #1) RIDDING THE WORLD OF EVIL, ONE ALIEN AT A TIME: THAT'S MIA SNOW'S MISSION. Snow is in the forecast. In a time and place not too far away, Mia Snow is an alien huntress for the New Chicago Police Department. Heading up her expert team of Alien Investigation and Removal agents, Mia's unmatched at battling the elusive enemy among us, and she's the perfect girl for the job. She's seen her brother die at the hands of aliens. She's earned each of her scars. And she'll die before she cries. Now, a series of killings have Mia and her partner Dallas tracking alien suspects -- but a sudden blast of violence leaves Dallas fighting for his life. They are ice and fire. The chance to save Dallas appears in the form of a tall, erotic stranger. An alien. A murder suspect. Kyrin en Arr, of the deadly Arcadian species, holds the power to heal the injured agent but not without a price. For Mia Snow, that price is surrendering to Kyrin's forbidden seduction...and embracing their electric attraction. She's walking a knife's edge, risking her badge and even her life. The closer she gets to Kyrin, the more Mia learns about her own heart, her human needs -- and the shocking secret that will shatter everything she's ever believed.", "hash": "bc82a244-6b1c-4a6b-b797-aa2cfafd93ac"}, {"title": "Enslave Me Sweetly (Alien Huntress #2)", "author": "Gena Showalter", "pgs": 34, "sum": "Storyline: \nEnslave Me Sweetly (Alien Huntress #2) Eden Black walks among humans, protecting them from the murderous evil of other-worlders who abduct and enslave. And though she appears to be human herself, Eden is an alien, a Raka, distinguished by her golden hair and skin, and gifted with the ominous ability to kill without remorse -- and with total accuracy. That is, until the fateful night she has one shot to eliminate her target, a human slaver -- and misses. \"Failure\" is not in Eden's vocabulary. Neither is \"partner\" -- but that's what she is forcibly assigned after recovering from her disastrous mission. A sexy, steely-nerved human agent, Lucius Adaire enjoys nothing more than sparking the fury -- and rousing the desire -- of the fiery female assassin too proud to admit defeat. Locked in an assignment they cannot afford to lose, Lucius and Eden find themselves bound in two high-stakes, heart-pounding games: the sensual web of kill or be killed, and the erotic dance of seduction.", "hash": "269f3226-2f49-4f5d-b5e6-8bb804f77c18"}, {"title": "Savor Me Slowly (Alien Huntress #3)", "author": "Gena Showalter", "pgs": 41, "sum": "Storyline: \nSavor Me Slowly (Alien Huntress #3) HALF HUMAN, HALF MACHINE...ALL WOMAN Mishka Le'Ace was created to be an undercover operative...literally. Her beautiful body has been mechanically augmented to give her superhuman strength -- strength she's going to need. Her latest mission sends her to rescue Alien Investigation and Removal agent Jaxon Tremain from torture and death. With him, she discovers a passion unlike any other. A passion she was forbidden to know.... From the moment they meet in a darkened cell, Jaxon craves her touch. But the machine half of Le'Ace forces her to do things she doesn't always want to do. Even betray him...and ultimately destroy him. Now Jaxon must battle the man controlling Le'Ace, and even Le'Ace herself, to at last claim the woman he's come to love.", "hash": "458b83f6-4395-47d8-8c00-34236d23d78a"}]