[{"title": "Seduce the Darkness (Alien Huntress #4)", "author": "Gena Showalter", "pgs": 43, "sum": "Storyline: \nSeduce the Darkness (Alien Huntress #4) SHE HAS A BODY MADE FOR TEMPTATION...AND A KISS TO DIE FOR. The war between otherworlders and humans changed Earth beyond recognition. It also saved Bride McKells's life. Before, the gorgeous vampire was a target for every fanatic with a stake and a crucifix. Now, she's free to roam the streets -- and desperate to find others of her kind. One man claims to have the answers she seeks. Devyn, King of the Targons, is a warrior and a womanizer, and he makes no secret of how much he wants Bride -- and how dangerous he could be to her in every way. An avid collector of women, Devyn easily seduces human and otherworlder alike. Until now. Not only does Bride resist him, but she leaves Devyn feeling something entirely new...a bone-deep need bordering on obsession. Her blood is the key to curing a vicious alien disease, but helping Bride uncover her origins will compel her to choose between electrifying passion and a destiny that could tear her from Devyn's side forever.", "hash": "1bd81c81-acd5-4c37-888e-da536cb3abe5"}, {"title": "Dark Taste of Rapture (Alien Huntress #6)", "author": "Kerrelyn Sparks", "pgs": 45, "sum": "Storyline: \nDark Taste of Rapture (Alien Huntress #6) With one caress, he can give unforgettable pleasure . . . or unending pain. . . . Hector Dean is shaved, tattooed, and totally ripped—and he has a deadly secret. He is a walking weapon, capable of killing with a single brush of his fingertips. Little wonder he’s determined to remain on his own. But Noelle Tremain is a temptation like no other. She is beautiful and rich, with a party girl smile that hides a shocking vulnerability, and from the beginning his sizzling attraction to her is undeniable. For the first time, his stone-cold resistance is tested. But to be with her, he risks destroying her. When a wealthy businessman is murdered in New Chicago’s seediest district, the two are partnered, and there’s no escaping what they both want: each other. Yet neither Hector nor Noelle knows what to fear more—the killer case, or their own lethal desires. . . .", "hash": "f1a7233f-d9b1-499c-bb03-c7779c5e933d"}, {"title": "Unravel Me (Shatter Me #2)", "author": "Tahereh Mafi", "pgs": 54, "sum": "Storyline: \nUnravel Me (Shatter Me #2) tick tick tick tick tick it's almost time for war. Juliette has escaped to Omega Point. It is a place for people like her—people with gifts—and it is also the headquarters of the rebel resistance. She's finally free from The Reestablishment, free from their plan to use her as a weapon, and free to love Adam. But Juliette will never be free from her lethal touch. Or from Warner, who wants Juliette more than she ever thought possible. In this exhilarating sequel to Shatter Me, Juliette has to make life-changing decisions between what she wants and what she thinks is right. Decisions that might involve choosing between her heart—and Adam's life.", "hash": "a397ef97-84ca-40a8-a609-1d83fecc265c"}, {"title": "Transcendence ", "author": "Shay Savage", "pgs": 39, "sum": "Storyline: \nIt’s said that women and men are from two different planets when it comes to communication, but how can they overcome the obstacles of prehistoric times when one of them simply doesn’t have the ability to comprehend language? Ehd’s a caveman living on his own in a harsh wilderness. He’s strong and intelligent, but completely alone. When he finds a beautiful young woman in his pit trap, it’s obvious to him that she is meant to be his mate. He doesn’t know where she came from; she’s wearing some pretty odd clothing, and she makes a lot of noises with her mouth that give him a headache. Still, he’s determined to fulfill his purpose in life – provide for her, protect her, and put a baby in her. Elizabeth doesn’t know where she is or exactly how she got there. She’s confused and distressed by her predicament, and there’s a caveman hauling her back to his cavehome. She’s not at all interested in Ehd’s primitive advances, and she just can’t seem to get him to listen. No matter what she tries, getting her point across to this primitive, but beautiful, man is a constant – and often hilarious – struggle. With only each other for company, they must rely on one another to fight the dangers of the wild and prepare for the winter months. As they struggle to coexist, theirs becomes a love story that transcends language and time.", "hash": "e653bf44-045d-4323-b4df-6ee4748c73c9"}, {"title": "A Bone to Pick (Aurora Teagarden #2)", "author": "Charlaine Harris", "pgs": 12, "sum": "Storyline: \nA Bone to Pick (Aurora Teagarden Mysteries #2) Having inherited a large estate from a member of the now defunct A Bone to Pick Club, Aurora \"Roe\" Teagarden, the 4'11\" librarian, is mystified by a mere acquaintance's gift of money, jewelry, and a two bedroom house with a skull in the window seat. Did the old lady kill someone and leave Roe to solve the mystery or was she being framed? Roe must figure it all out before her cheating ex-boyfriend Arthur, the police detective, and her new love interest Aubrey, the episcopal priest, figure out what she's up too.", "hash": "11c5bd8b-5582-4920-8184-ff10602aab75"}, {"title": "Three Bedrooms, One Corpse (Aurora Teagarden #3)", "author": "Charlaine Harris", "pgs": 16, "sum": "Storyline: \nThree Bedrooms, One Corpse (Aurora Teagarden Mysteries #3) Deciding if she wants to go into real estate becomes a life-or-death choice for Aurora \"Roe\" Teagarden. A naked corpse is discovered at her first house showing. And when a second body is found in another house for sale, it becomes obvious that there is a very cool killer at large in Lawrenceton, one who knows a great deal about real estate-and maybe too much about Roe.", "hash": "dee3f36c-abbe-4270-926a-0d8ba7c5d71f"}, {"title": "The Julius House (Aurora Teagarden #4)", "author": "Charlaine Harris", "pgs": 17, "sum": "Storyline: \nThe Julius House (Aurora Teagarden Mysteries #4) Since she met her fiance Martin Bartell, Roe Teagarden has never been happier. There's a difference in age and in background, but he seems to know exactly what she wants - like the Julius house. Roe is thrilled when Martin gives her the house as a wedding present. She's a keen amateur sleuth, and she has always been intrigued by its infamous history: six years ago, the family who lived there disappeared, never to be seen again. As Roe throws herself into renovating the Julius house, her misgivings about Martin's rather murky past recede. But when Roe is attacked by an axe-wielding maniac, she realises that the secrets inside her four walls - and her brand-new marriage - could destroy her.", "hash": "f9407334-2b07-4ea2-ad22-aca41b59e7b9"}, {"title": "Dead Over Heels (Aurora Teagarden #5)", "author": "Charlaine Harris", "pgs": 11, "sum": "Storyline: \nDead Over Heels (Aurora Teagarden Mysteries #5) What's the world coming to - when you can't relax with an ice-cold beverage in your own backyard without a body falling from the sky and landing in your garden? Part-time librarian and frequent amateur investigator Roe Teagarden has good reason to ask herself this question when the remains of one of the Lawrenceton, Georgia police department's finest catapults into her flower bed one beautiful sunny morning. Roe's friend and bodyguard, the long-legged, bikini-clad Angel Youngblood, is mowing the grass and Roe is reclining on a lounger when a small red-and-white plane flies low overhead and drops its unlikely debris more or less at Roe's feet. Roe's husband of two years, wealthy businessman Martin Bartell, immediately wonders if the killer chose his dumping place to send some kind of message to Roe. And the mystery deepens when two federal agents arrive in town to investigate the murder. It's only when Madeleine the cat provides a clue that Roe and Martin realize Roe herself may be in danger and that using Roe's yard as a temporary landfill for dead bodies was no accident.", "hash": "7e8ca7cb-57a1-47b7-93b5-94e1d2c405e3"}, {"title": "A Fool And His Honey (Aurora Teagarden #6)", "author": "Charlaine Harris", "pgs": 11, "sum": "Storyline: \nA Fool and His Honey (Aurora Teagarden Mysteries #6) Sleepless nights, a cross-country chase and a temporary stint at motherhood all turn newlywed Aurora Teagarden's life upside down. When her husband's niece, Regina, shows up unannounced on their doorstep with a baby and a secret, Aurora's perpetual curiosity leaps into overdrive -- especially when the body of the girl's husband is found axe-murdered in her own backyard! But Aurora's curiosity may get the best of her this time, as she walks right into the middle of Regina's dangerous secrets.", "hash": "04761856-a918-410f-bd39-a5500542aa61"}, {"title": "Last Scene Alive (Aurora Teagarden #7)", "author": "Charlaine Harris", "pgs": 15, "sum": "Storyline: \nLast Scene Alive (Aurora Teagarden Mysteries #7) Aurora Teagarden has never forgotten her first case: a serial killer who terrorized suburban Lawrencetown. Now that story is about to hit the small screen. Even if she wanted to, Aurora can't help getting involved. Her ex, Robin, wrote the TV movie's screenplay and her stepson, Barrett, has a starring role. Then there's Celia--the catty actress portraying Roe--who, by the way, also happens to be Robin's latest squeeze. But when Celia is murdered and Barrett is accused, the real-life script takes a deadly turn. Between threatening letters, deranged fans and renewed feelings for Robin, Aurora has one goal: catch a killer and make it to the final scene alive.", "hash": "75af269a-2383-4c4b-9ee3-9ac34a49fcb4"}]