[{"title": "Poppy Done to Death (Aurora Teagarden #8)", "author": "Charlaine Harris", "pgs": 14, "sum": "Storyline: \nPoppy Done to Death (Aurora Teagarden Mysteries #8) Small-town Georgia librarian Aurora Teagarden finds her stepsister-in-law, Poppy, dead on the kitchen floor...and must sift through the sordid details of her relative's life to find the killer. This is the eighth novel in Charlaine Harris' lighthearted Aurora Teagarden mystery series; it follows Last Scene Alive (Worldwide Mystery, 12/03). Her Worldwide Mystery novels average seven percentage points higher than the other titles in the month.", "hash": "877b9fce-4c09-46db-ace6-8fcddec45c01"}, {"title": "Blood Brothers (Sign of Seven #1)", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nBlood Brothers (Sign of Seven #1) Every seven years, there comes a week in July when the locals do unspeakable things--and then don't seem to remember them. The collective madness has made itself known beyond the town borders and has given Hawkins Hollow the reputation of a village possessed. This modern-day legend draws reporter and author Quinn Black to Hawkins Hollow with the hope of making the eerie happening the subject of her new book. It is only February, but Caleb Hawkins, descendent of the town founders, has already seen and felt the stirrings of evil. Though he can never forget the beginning of the terror in the woods twenty-one years ago, the signs have never been this strong before. Cal will need the help of his best friends, Fox and Gage, but surprisingly he must rely on Quinn as well. She too, can see the evil that the locals cannot, somehow connecting her to the town--and to Cal. As winter turns to spring, Cal and Quinn will shed their inhibitions, surrendering to a growing desire. They will form the cornerstone of a group of men and women bound by fate, passion, and the fight against what is to come from out of the darkness...", "hash": "92382710-2c98-4e2c-b3cb-97e7aa2da461"}, {"title": "The Hollow (Sign of Seven #2)", "author": "Nora Roberts", "pgs": 21, "sum": "Storyline: \nThe Hollow (Sign of Seven #2) In the small village of Hawkins Hollow, three best friends who share the same birthday sneak off into the woods for a sleepover the evening before turning 10. But a night of pre-pubescent celebration turns into a night of horror as their blood brother oath unleashes a three-hundred year curse. Twenty-one years later, Fox O'Dell and his friends have seen their town plagued by a week of unexplainable evil events two more times - every seven years. With the clock winding down on the third set of seven years, someone else has taken an interest in the town's folklore. A boutique manager from New York, Layla Darnell was drawn to Hawkins Hollow for reasons she can't explain - but the recent attacks on her life make it clear that it is personal. And though Fox tries to keep his professional distance, his interests in Layla have become personal too.", "hash": "35ee487f-0f24-4083-a017-e6326545a263"}, {"title": "The Alpha's Pet (Dark Hollow Wolf Pack #1)", "author": "Shannon West", "pgs": 22, "sum": "Storyline: \nThe Alpha's Pet (Dark Hollow Wolf Pack #1) Nicky Anderson is living a normal, if hectic life as an artist and part time waiter in a large city, when he’s attacked by a mugger who slashes his throat. When he awakens, he’s naked, and surrounded by large, muscular men. Nicky feels an immediate attraction to Marco, the most handsome man Nicky has ever seen, which is strange, since Nicky is straight. His attraction is overwhelming and downright embarrassing as he licks the man and tries to climb all over him. He soon discovers he’s the newest “pet” of the Mountain Wolf Pack, and Marco is his new master. Saved from certain death, has he exchanged one horrible fate for another? All he knows is that he’s in heat for this beautiful man. When he learns his new master is a wolf shapeshifter who demands his love and obedience, he begins to wonder just what he’s gotten himself into.", "hash": "42bc3f1d-bf3c-4b73-af07-9d31bf5b2e06"}, {"title": "Cry Wolf (Dark Hollow Wolf Pack #2)", "author": "Shannon West", "pgs": 17, "sum": "Storyline: \nCry Wolf (Dark Hollow Wolf Pack #2) Casey, a good looking young wolf shifter has sworn to kill the man who killed his brother. He has joined the Mountain Wolf Pack to carry out his revenge. On his first work detail, he discovers that the handsome young man in charge is his blood mate. The trouble is, the man, whose name is Rory, is straight, and a wolf. Two wolves are allowed to mate, but only if one assumes the submissive role. Neither of these two stubborn wolves is willing to compromise. If that’s not bad enough, they soon discover that Rory is the wolf who killed Casey’s only brother. Now Casey must find some way around his sworn oath. Can the two sexy wolves overcome their distrust and hatred of each other, or will they be forced to give up their happiness, along with their only true blood mate?", "hash": "4fe70684-6590-48a5-befa-0e9330bf13b6"}, {"title": "Logan's Choice (Dark Hollow Wolf Pack #3)", "author": "Shannon West", "pgs": 29, "sum": "Storyline: \nLogan's Choice (Dark Hollow Wolf Pack #3) As the beta of the Dark Hollow Wolf Pack, Ian is supposed to be the calm, sensible one, but when a young Hunter is captured, his overpowering attraction to the gorgeous man has him acting way out of character. As a sworn enemy to the wolf pack, the captive can’t be allowed to go free, yet the pack hates to keep Logan imprisoned. The only solution is to convince Logan to agree to mate with one of the wolves to form an unbreakable bond. Unwilling to see him mated to anyone else, Ian makes a decision—he must make the young man fall in love with him and agree to stay on as his mate. Can Logan make this difficult choice and leave behind the life he used to lead? When Ian is captured and tortured by the Hunters, Logan must make the most difficult choice of his life.", "hash": "94a13c5c-8019-492b-90f3-8334bede6755"}, {"title": "Gabe's Alpha (Dark Hollow Wolf Pack #4)", "author": "Shannon West", "pgs": 20, "sum": "Storyline: \nGabe's Alpha (Dark Hollow Wolf Pack #4) Gabe is a typical young college student until the night he and his mother are attacked by a beast who kills his mother and leaves Gabe for dead. When Gabe discovers the beast who bit him was a werewolf, and shifts into a beast like creature at the full moon, he leaves his home and descends into a nightmare of drugs, alcohol and one night stands. As he’s camping in the woods, preparing for the painful shift to come, he meets a the gorgeous alpha of the Dark Hollow Wolf Pack who tells Gabe he’s trespassing on his territory. Before Gabe knows it, he’s been trussed up, thrown over the man’s shoulder and taken as the mate of the alpha. Gabe embraces his new role as mate to the handsome Zack, but if the alpha thinks the wild young man will settle down, he’s got another think coming.", "hash": "9c116ac1-64c7-4de2-86dd-b5fa680cde2a"}, {"title": "Wolfsbane (Dark Hollow Wolf Pack #5)", "author": "Shannon West", "pgs": 26, "sum": "Storyline: \nWolfsbane (Dark Hollow Wolf Pack #5) Evan Grant, a security guard in the Hunters’ prison, is anxious to prove himself with the group. A new prisoner arrives, and Evan feels an immediate attraction. The shifter is Brett, the most handsome man Evan’s ever seen, and the tortures the Hunters have put him through touch Evan’s heart. Bringing him pain medicine and food, he makes a strong connection with the handsome shifter. His attraction is overwhelming, and it becomes even more difficult when the Hunters’ scientists ask him to volunteer to mate with the shifter so they can study the bloodmatch. He agrees to the experiment only after the scientists promise nothing can go wrong, but after Evan mates with Brett, he overpowers the guards and escapes, taking Evan with him. It doesn’t take long to discover Evan’s the newest “pet” of the Mountain Wolf Pack, and Brett is his new master.", "hash": "7cff72e6-e6c6-403c-89bc-42d8838ed38b"}, {"title": "Breaking Up With The Alpha (Dark Hollow Wolf Pack #6)", "author": "Shannon West", "pgs": 18, "sum": "Storyline: \nBreaking Up With The Alpha (Dark Hollow Wolf Pack #6) Nicky’s living his happily ever after with his handsome mate Marco. He thinks he’s finally getting his life together now that the Hunters are gone, and he and Marco have the relationship he always wanted. When Marco falls desperately ill, Nicky sees his world crashing around him. Nicky’s prayers are answered when Marco awakes, but he’s horrified to discover that the illness attacked the bloodmatch, and Marco has no memories of Nicky and their life together. Even worse, Marco has reverted back to the overbearing, dominant alpha Nicky first met. Desperate to regain what they had, Nicky agrees to the D/s relationship he never really wanted, but unable to be submissive, he asks Marco for a separation, only to discover that Marco can’t let him move on. In despair, Nicky runs away. Can Marco find him and regain what they had? Or will they lose each other forever?", "hash": "34c34bc8-accb-4961-bfa8-9298576d4fdc"}, {"title": "Bad Moon on the Rise (Dark Hollow Wolf Pack #7)", "author": "Shannon West", "pgs": 28, "sum": "Storyline: \nBad Moon on the Rise (Dark Hollow Wolf Pack #7) Living on the Gulf coast of Florida, Detective Tucker is investigating a series of strange, violent murders. Encountering a gorgeous stranger named Gavin in a bar, his attraction is powerful and immediate, but he learns the man is somehow involved in the savage killings that have already taken three lives. After an argument with Gavin sends Tucker to the beach to figure things out, he is attacked by a savage creature, and almost killed except for the intervention of a fierce animal that looks like a wolf. When he wakes up in Gavin’s hotel room he’s told that he’s not who he thought he was all his life, but a natural pet of the Dark Hollow Wolf pack. He wants to run, but if Gavin catches him, he’ll be taken away from everything he’s ever known and thrust into an alien world to become the mate of a powerful alpha.", "hash": "1622705b-d4af-4bcf-94a2-f1e716617996"}]