[{"title": "The Wedding (Lairds' Fiancees #2)", "author": "Julie Garwood", "pgs": 49, "sum": "Storyline: \nIt's a classic plot: a marriage of convenience that lays the groundwork for true love. 1119. Journeying from England to Scotland to wed a highlander, Lady Brenna had resigned herself to the arranged match. But when a band of fierce, painted warriors captured her en route, she fearlessly met their demand to marry their leader -- the quick-tempered laird Connor MacAlister. She couldn't know that her capture was merely the first act of vengeance against her betrothed, Connor's sworn enemy. Brenna harbored no illusions that her husband was in love with her; after a hasty forest wedding, MacAlister assured her she could return home once she had borne him a son. But she could not deny that she had once proposed to MacAlister -- ten years ago, when she was just a child, and the visitor to her father's castle charmed her with his dazzling, unexpected smile. Now, as she sets out to win the brave chieftain whom she has come to adore, a legacy of revenge ensnares Brenna in a furious clan war -- and only her faith in her gallant hero can save her...", "hash": "6ec93370-c9f5-46f9-a270-e6f64d05d3a7"}, {"title": "Archer's Voice", "author": "Mia Sheridan", "pgs": 36, "sum": "Storyline: \nA New York Times, USA Today, and Wall Street Journal bestselling book. Archer's Voice is a full-length, standalone romance. When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isolated man who holds a secret agony of his own. A man no one else sees. Archer's Voice is the story of a woman chained to the memory of one horrifying night and the man whose love is the key to her freedom. It is the story of a silent man who lives with an excruciating wound and the woman who helps him find his voice. It is the story of suffering, fate, and the transformative power of love.", "hash": "a5b66314-b8fc-4be2-8633-3c15c7824865"}, {"title": "Addicted", "author": "Zane", "pgs": 54, "sum": "Storyline: \nThe New York Times bestseller Adapted into a major motion picture distributed through Lionsgate From the Queen of Erotica, Addicted tells the provocative story of one married woman’s struggle to deal with the fall-out of her forbidden desires. The world of Addicted is continued in the New York Times bestseller Nervous, and Zane’s highly-anticipated upcoming novel Vengeance, available May 24, 2016. For successful businesswoman Zoe Reynard, finding the pleasure she wants, the way she wants it, is not worth the risk of losing everything she has: a charmed marriage to her childhood sweetheart, a thriving company, and three wonderful children. But Zoe feels helpless in the grip of an overpowering addiction…to sex. After finding a compassionate therapist to help her, Zoe finally summons the courage to tell her torrid story, a tale of guilt and desire as shocking as it is compelling. From the sensitive artist with whom she spends stolen hours on rumpled sheets, to the rough and violent man who leads her toward destruction, Zoe is desperately searching for fulfillment—and, perhaps, something darker and deeper. As her life spins out of control and her sexual escapades carry her toward a dangerous fate, Zoe races to uncover the source of her “fatal attraction.” Chilling secrets tumble forth and perilous temptations build toward a climax that could threaten her sanity, her marriage…and her life.", "hash": "43e05ceb-b40c-4671-8203-414c115c40fd"}, {"title": "A Kingdom of Dreams (Westmoreland Saga #1)", "author": "Judith McNaught", "pgs": 112, "sum": "Storyline: \n#1 bestselling author Judith McNaught dazzles with this beloved romantic classic, “one of the best ever” (Rendezvous), in which two defiant hearts clash over a furious battle of wills in a glorious age of chivalry. Abducted from her convent school, headstrong Scottish beauty Jennifer Merrick does not easily surrender to Royce Westmoreland, Duke of Claymore. Known as “The Wolf,” his very name strikes terror in the hearts of his enemies. But proud Jennifer will have nothing to do with the fierce English warrior who holds her captive, this handsome rogue who taunts her with his blazing arrogance. Boldly she challenges his will—until the night he takes her in his powerful embrace, awakening in her an irresistible hunger. And suddenly Jennifer finds herself ensnared in a bewildering web…a seductive, dangerous trap of pride, passion, loyalty, and overwhelming love.", "hash": "62d39741-c0b4-4261-8e58-38262475ea6d"}, {"title": "Tangled (Tangled #1)", "author": "Emma Chase", "pgs": 37, "sum": "Storyline: \nIn New York Times bestselling author Emma Chase’s sizzling and hilarious debut novel, Drew Evans—gorgeous, arrogant, irreverent, and irresistibly charming—meets his match in new colleague Kate Brooks. When rich, handsome, and arrogant meets beautiful, brilliant, and ambitious, things are bound to get tangled Drew Evans makes multimillion-dollar business deals and seduces New York’s most beautiful women with just a smile. So why has he been shuttered in his apartment for seven days, miserable and depressed? He’ll tell you he has the flu, but we all know that’s not really true. When Katherine Brooks is hired as the new associate at Drew’s father’s investment banking firm, every aspect of the dashing playboy’s life is thrown into a tailspin. The professional competition she brings is unnerving, his attraction to her is distracting, his failure to entice her into his bed is exasperating. How can one woman turn a smooth-talking player into a broken, desperate man? By making the one thing he never wanted in life the only thing he can’t live without.", "hash": "8b38c57d-3209-4e38-aa61-c9fc659f3073"}, {"title": "Mystery Man (Dream Man #1)", "author": "Kristen Ashley", "pgs": 114, "sum": "Storyline: \nNight time is the right time... Gwendolyn Kidd has met the man of her dreams. He's hot, he's sexy, and what started as a no-names-exchanged night of passion has blossomed into a year and a half-long pleasure fest. Sure, it's a little strange that he only appears in her bed at night, but Gwen is so sure he's the one, she just can't turn him away... Hawk Delgado knows more about Gwen than she could ever imagine. She's gorgeous, headstrong, and skittish about relationships. But Hawk is facing his own demons, demons that keep him from connecting with anyone. Yet when Gwen is drawn into Denver's lethal underground scene, Hawk's protective nature comes out full force. The problem is, when Gwen gets a dose of Hawk's Alpha attitude in the daylight, she's not so sure he's the one anymore...", "hash": "bc86a2a3-d5a2-4037-9206-56405d189d0b"}, {"title": "A Knight in Shining Armor (Montgomery/Taggart #15)", "author": "Jude Deveraux", "pgs": 53, "sum": "Storyline: \nNew York Times bestselling author Jude Deveraux will capture your heart with this reissue of her signature classic novel, a time-travel romance featuring a present-day heroine and a dashing hero from the sixteenth century! Abandoned by a cruel fate, lovely Dougless Montgomery lies weeping upon a cold tombstone in an English church. Suddenly, the most extraordinary man appears. It is Nicholas Stafford, Earl of Thornwyck…and according to his tombstone he died in 1564. Drawn to his side by a bond so sudden and compelling it overshadows reason, Dougless knows that Nicholas is nothing less than a miracle: a man who does not seek to change her, who finds her perfect, fascinating, just as she is. What Dougless never imagined was how strong the chains are that tie them to the past…or the grand adventure that lay before them. Hailed worldwide as one of the most romantic novels of all time, A Knight in Shining Armor is “a glorious love story that spans centuries, worlds, and souls. It is the epitome of every woman’s fantasy” (Chicago Daily Herald).", "hash": "0cfdcd13-3d53-4f0f-af77-756a37182079"}, {"title": "The Bride (Lairds' Fiancees #1)", "author": "Julie Garwood", "pgs": 45, "sum": "Storyline: \nBy edict of the king, the mighty Scottish laird Alec Kincaid must take an English bride. His choice was Jamie, youngest daughter of Baron Jamison...a feisty, violet-eyed beauty. Alec ached to touch her, to tame her, to possess her...forever. But Jamie vowed never to surrender to this highland barbarian. He was everything her heart warned against—an arrogant scoundrel whose rough good looks spoke of savage pleasures. And thought Kincaid's scorching kisses fired her blood, she brazenly resisted him...until one rapturous moment quelled their clash of wills, and something far more dangerous than desire threatened to conquer her senses...", "hash": "74906780-1082-4783-a442-806350e56aed"}, {"title": "Seduction and Snacks (Chocolate Lovers #1)", "author": "Tara Sivec", "pgs": 92, "sum": "Storyline: \nWarning #1: This book is not to be taken seriously. Do not read this if you don't have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don't think people who are drunk are hilarious, you shouldn't read this book. You probably shouldn't read this book if you aren't drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. 2012 Goodreads Choice Award Nominee - Best Romance Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.", "hash": "b2e018c0-01fc-4008-a453-f2c185d952d1"}, {"title": "Ten Tiny Breaths (Ten Tiny Breaths #1)", "author": "K.A. Tucker", "pgs": 58, "sum": "Storyline: \nJust breathe, Kacey. Ten tiny breaths. Seize them. Feel them. Love them. Four years ago Kacey Cleary’s life imploded when her car was hit by a drunk driver, killing her parents, boyfriend, and best friend. Still haunted by memories of being trapped inside, holding her boyfriend’s lifeless hand and listening to her mother take her last breath, Kacey wants to leave her past behind. Armed with two bus tickets, twenty-year-old Kacey and her fifteen-year-old sister, Livie, escape Grand Rapids, Michigan, to start over in Miami. Struggling to make ends meet, Kacey needs to figure out how to get by. But Kacey’s not worried. She can handle anything—anything but her mysterious neighbor in apartment 1D. Trent Emerson has smoldering blue eyes, deep dimples, and he perfectly skates that irresistible line between nice guy and bad boy. Hardened by her tragic past, Kacey is determined to keep everyone at a distance, but their mutual attraction is undeniable and Trent is determined to find a way into Kacey’s guarded heart—even if it means that an explosive secret could shatter both their worlds.", "hash": "5eec7bb6-1f18-4363-a8b8-132080a972ac"}]