[{"title": "Twice in a Blue Moon (Dark Hollow Wolf Pack #8)", "author": "Shannon West", "pgs": 25, "sum": "Storyline: \nTwice in a Blue Moon (Dark Hollow Wolf Pack #8) When Detective Kevin Bryson’s partner, Tucker, disappears into the mountains of Tennessee with only a phone call telling Kevin not to worry about him, Kevin can’t leave it alone. For one thing, he’s been in love with the handsome Tucker for years, and for another, he doesn’t trust the man Tucker left with—a handsome man named Gavin. Deciding to go to Tennessee to look for him, Kevin’s surprised when Tucker shows up at his hotel, with another of the men. Suspecting a dangerous cult, Kevin goes with them to their remote mountain lodge. Once he arrives, he’s told he can’t leave. Stripped naked and held captive in the lodge, Kevin finds out just who what this strange “cult” is all about, and he finds himself falling in love against his will. Can he escape and save his friend, or will he succumb to the lure of the blue moon?", "hash": "309da12e-5b53-4b34-ab34-d0c113d2b76f"}, {"title": "Bloodlust (Dark Hollow Wolf Pack #9)", "author": "Shannon West", "pgs": 25, "sum": "Storyline: \nBloodlust (Dark Hollow Wolf Pack #9) Forty miles east of New Orleans, dog tired and out of money, nineteen year old Jax and his little brother are on the run. They stop for breakfast at a roadside café and have a run-in with the leader of a tough looking motorcycle gang. His name is Cade D’Allisande, an alpha wolf leading his pack to a new home in North Carolina, hoping to join the Dark Hollow Wolf Pack. Cade instantly recognizes his bloodlust mate, an intense and rare blood match that forms an alpha pair. The trouble is Cade isn’t ready for a mate. Unable to leave him behind, he convinces the young man to join their group and takes him with them on their journey to find a new home. But once there, an old enemy of the Pack threatens their happiness, and Jax, Nicky and Gabe must team up to save their mates.", "hash": "e0f745b9-a65f-4755-bec1-38cb76382ac6"}, {"title": "Banshee Charmer (Files of the Otherworlder Enforcement Agency #1)", "author": "Tiffany Allee", "pgs": 25, "sum": "Storyline: \nBanshee Charmer (Files of the Otherworlder Enforcement Agency #1) When she’s sent to a crime scene and finds her second dead woman in as many weeks, half-banshee detective Kiera “Mac” McLoughlin is convinced a serial killer is on the loose. Incubi are extinct, her boss insists. But what else can kill a woman in the throes of pleasure? When her partner is murdered after using witchcraft to locate the killer and Mac is thrown off the case, her frustration turns to desperation. Certain the killer is an incubus, Mac works behind her department’s back to chase down slim, sometimes perilous leads. While the killer eludes her, she does discover handsome Aidan Byrne, an investigative counterpart from the enigmatic Otherworlder Enforcement Agency. Mac typically runs her investigations fast and hard, but with Aidan at her side, she’s running this one “hot” as well. But Aidan knows more than he’s letting on—something that could shatter their blazing romance and add Mac to the killer’s growing body count…", "hash": "3499872e-71e6-421d-a837-1d69fa148d0b"}, {"title": "Succubus Lost (Files of the Otherworlder Enforcement Agency #2)", "author": "Tiffany Allee", "pgs": 24, "sum": "Storyline: \nSuccubus Lost (Files of the Otherworlder Enforcement Agency #2) Someone is kidnapping and incinerating otherworlders beyond recognition, and detective Marisol Whitman, a succubus, races to find the murderer before he claims another victim. But her pursuit is derailed when her responsible younger sister vanishes. Marisol suspects foul play and enlists support from an unlikely source: an agent from the Otherworlder Enforcement Agency, Valerio Costa. When the trail pointing to everyone from vampires to witches dries up, Agent Costa admits to knowing more than he’s shared. Marisol’s sister’s kidnapper harnesses more magic than she can imagine—and they’re running out of time. To find her sister before her powers are drained and twisted beyond recognition, Marisol must connect the dots between cases and put her trust in Costa, a salamander who may burn her before she can solve either case.", "hash": "8ad8cb5a-5178-4b27-9004-698c5150c604"}, {"title": "The End of Me (The Single Lady Spy #1)", "author": "Tara Brown", "pgs": 40, "sum": "Storyline: \nThe End of Me (The Single Lady Spy #1) His death was almost the end of me. He was still everywhere, surrounding me. In our children's eyes, in the smell lingering in our bed, in candy bar wrappers stuffed down the side of the minivan driver door. He was everywhere except where I needed him to be. In my arms, kissing my lips, on the name of the deed to our house. When his death didn't end me, the proposal from the man who owned every moment of my life, did. My husband carried on in the places he wanted to be but I was gone the moment I agreed. The moment I let him have me, was the end of me. Adult 19+", "hash": "11467606-10e4-4402-a689-f1a2a3359aa8"}, {"title": "Blood Red ", "author": "Heather Graham", "pgs": 19, "sum": "Storyline: \nWhen a fortune-teller shows bridesmaid Lauren Crow an omen of her gruesome death, she and her friends laugh it off as cheesy theatrics--until women begin disappearing in the night. Even as the streets become more dangerous, Lauren finds herself lusting after a man who is himself dangerous-- and quite possibly crazy. Mark Davidson prowls the city by night armed with crosses and holy water, in search of vampires, whose existence, he insists, is real. He is as irresistibly drawn to Lauren as she is to him, and not only because she's the image of his murdered fiancee. But Mark's frightening obsession with finding his lover's killer merely hides a bitter vendetta that cuts deeper than grief over a lost love. As Lauren wrestles with desire and disbelief, sinister shadows lengthen over New Orleans, threatening her friends and foretelling a battle that may spell the end of the city's uneasy truce between the living and the undead.", "hash": "0a58ef39-a07d-4575-a022-0202857de589"}, {"title": "Haunted (Harrison Investigation #1)", "author": "Heather Graham", "pgs": 64, "sum": "Storyline: \nHaunted (Harrison Investigation #1) Love is everywhere. . . When does a gift become a curse? Matt Stone doesn't believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn't ready for beautiful, intriguing Darcy Tremayne. As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she's given Matt fair warning: sometimes people don't like the skeletons she finds. She never dreamed that the warning would apply to herself. For she's about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.", "hash": "4d9c3283-6716-4fef-8916-219cb850b8ae"}, {"title": "Ghost Walk (Harrison Investigation #2)", "author": "Heather Graham", "pgs": 51, "sum": "Storyline: \nGhost Walk (Harrison Investigation #2) Nikki DuMonde's newest employee is standing at the end of her bed at four o'clock in the morning begging for help. It's a joke, right? Besides, as manager of a successful New Orleans haunted-tour company, Nikki doesn't scare easily. But in the light of day, harsh reality sets in as a police officer informs her that Andy was brutally murdered--at the exact time Nikki swears the distraught woman was in her room. No one believes her except Brent Blackhawk, a paranormal investigator desperately trying to forget his tragic past. Half Irish, half Lakota--and able to communicate with the dead--Brent is used to living in two worlds. But when he realizes the ghost of a slain government agent is also trying to reach out to Nikki, he knows that she, too, must listen to the dead...if she wants to keep living.", "hash": "47faa031-dcd8-4ad4-b930-34ce1fbe014f"}, {"title": "The Vision (Harrison Investigation #3)", "author": "Heather Graham", "pgs": 54, "sum": "Storyline: \nThe Vision (Harrison Investigation #3) The gift of sight comes at a dangerous price When Deep Down Salvage begins the hunt for the \"Josephine Marie, \" it seems like any other dive...until Genevieve Wallace sees the vision of a dead woman in the water, her vacant eyes boring into Genevieve's very soul. Terrified and confused by what she saw, Genevieve is haunted by the memory, but no one -- including her diving partner Thor Thompson -- believes her. When a dead woman washes up on shore, everyone assumes this is Genevieve's \"vision,\" but Genevieve knows the truth: the dead woman is \"not\" the ghost she saw but another victim of the same brutal killer. Sensing that the threat of death is coming closer, she and Thor are forced to acknowledge that some things can't be explained, but simply \"are.\" Somehow they have to link a violent past with a present-day mystery or risk losing themselves in an abyss of terror.", "hash": "56ab168b-1774-4bc2-8384-47e9573f6e53"}, {"title": "The Dead Room (Harrison Investigation #4)", "author": "Heather Graham", "pgs": 56, "sum": "Storyline: \nThe Dead Room (Harrison Investigation #4) A year ago, archaeologist Leslie MacIntyre barely survived the explosion that took the life of her fiance, Matt Connolly. In the long months since, sh's slowly come to terms not only with her loss but with her unsettling new ability to communicate with ghosts, a dubious 'gift' received in the wake of her own brush with death. Now sh's returned to lower Manhattan's historic Hastings House, site of the explosion, to conquer her fears and investigate a newly discovered burial ground. In this place restless spirits hold the secrets not only of past injustice but of a very real and very contemporary conspiracy with deadly designs on the city's women--including Leslie herself. By night Matt visits her in dreams, warning her and offering clues to the truth, while by day she finds herself helped by--and attracted to-- his flesh-and-blood cousin Joe. Torn by her feelings for both men, caught between the worlds of the living and the dead, Leslie struggles against the encroaching danger that threatens to overcome her. As she is drawn closer to the darkness at the heart of Hastings House, she must ultimately face the power of an evil mind, alone in a place where not even the men she loves can save her.", "hash": "5b772cbe-dfcb-4b31-b7d5-8274e702fef8"}]