[{"title": "The Unspoken (Krewe of Hunters #7)", "author": "Heather Graham", "pgs": 50, "sum": "Storyline: \nThe Unspoken (Krewe of Hunters #7) 1898: Bound for Chicago, the freighter Jerry McGuen goes down in Lake Michigan, taking with it every man aboard. But what other fate could befall a vessel carrying the ill-gotten sarcophagus of an Egyptian sorcerer? Now: A veteran diver and ?ghost ship? expert is exploring the legendary wreck for a documentary. He dies inexplicably inside the freighter's main saloon. Then another diver is killed and panicked rumors rise like bubbles from the lake: ancient demons have awakened below! The expedition's beleaguered financier calls paranormal investigator Katya Sokolov to Chicago to save the film ? and perhaps some innocent lives. Along with media forensics guru Will Chan, Kat plumbs the depths of an evil that may date back to the time of the Pharaohs. But some secrets are best drowned in the seas of the past...", "hash": "1a96fad4-2ac8-45f1-8a03-2dd9668a200b"}, {"title": "The Uninvited (Krewe of Hunters #8)", "author": "Heather Graham", "pgs": 53, "sum": "Storyline: \nThe Uninvited (Krewe of Hunters #8) 1777: In the throes of the Revolutionary War, Landon Mansion is commandeered by British Lord \"Butcher\" Bedford. He stabs Lucy Tarleton - who spurned his king and his love - leaving her to die in her father's arms. NOW: After the day's final tour, docent Allison Leigh makes her rounds while locking up... and finds a colleague slumped over Bedford's desk, impaled on his own replica bayonet. Resident ghosts may be the stock-in-trade of stately Philadelphia homes, but Allison - a noted historian - is indignant at the prospect of \"ghost hunters\" investigating this apparent murder. Agent Tyler Montague knows his hauntings and his history. But while Allison is skeptical of the newcomer, a second mysterious murder occurs. Has \"Butcher\" Bedford resurfaced? Or is there another malevolent force at work in Landon Mansion? Wary, yet deeply attracted, Allison has to trust in Tyler and work with him to discover just what uninvited guest — dead or alive — has taken over the house. Or their lives could become history!", "hash": "cbcd5a6f-68eb-4f24-9c4c-ec7f58edd05c"}, {"title": "The Night Is Watching (Krewe of Hunters #9)", "author": "Heather Graham", "pgs": 53, "sum": "Storyline: \nThe Night Is Watching (Krewe of Hunters #9) The Old West town of Lily, Arizona, is home to the Gilded Lily, a former theater... and bawdy house. These days, it offers theatrical productions geared to tourists, but the recent discovery of a skull, a real skull, among the props and costumes shakes everyone up. So, who do you call? The Krewe of Hunters, a special FBI unit of paranormal investigators. In this case, it's agent Jane Everett. Jane's also a talented artist who creates images of the dead as they once were. But the Krewe always works with local law enforcement, and here that means Sloan Trent, former Houston cop and now sheriff. His great-great-grandmother was an actress at the Gilded Lily... and she's not resting in peace. Then more remains appear in the nearby desert. As they search for answers, using all the skills at their disposal, Jane and Sloan find themselves falling into danger — and into love.", "hash": "fb30a2bf-3cb2-4161-8936-6c58435b33d4"}, {"title": "The Night Is Alive (Krewe of Hunters #10)", "author": "Heather Graham", "pgs": 53, "sum": "Storyline: \nThe Night Is Alive (Krewe of Hunters #10) MIDNIGHT IN SAVANNAH It's a city of beauty, history... hauntings. And one of the most haunted places in Savannah is a tavern called The Dragonslayer, built in the 1750s. The current owner, Gus Anderson, is a descendant of the original innkeeper and his pirate brother, Blue. Gus summons his granddaughter, Abigail, home from Virginia, where she's studying at the FBI Academy. When she arrives, she's devastated to find him dead. Murdered. But Abby soon learns that Gus isn't the only one to meet a brutal and untimely end; there've been at least two other victims. Then Captain Blue Anderson starts making ghostly appearances, and the FBI's paranormal investigation unit, the Krewe of Hunters, sends in Agent Malachi Gordon. Abby and Malachi have a similar ability to connect with the dead... and a similar stubbornness. Sparks immediately begin to fly — sparks of attraction and discord. But as the death toll rises, they have to trust each other or they, too, might find themselves among the dead haunting old Savannah!", "hash": "e87a6e37-2e7d-4cdc-81e5-688803adbc1c"}, {"title": "The Night Is Forever (Krewe of Hunters #11)", "author": "Heather Graham", "pgs": 53, "sum": "Storyline: \nThe Night Is Forever (Krewe of Hunters #11) A Ghost Rider in the Sky? What happened here, on a historic ranch outside Nashville, during the Civil War? And what's happening now? Olivia Gordon works at the Horse Farm, a facility that assists patients with mental and physical recovery; her specialty is animal therapy. She's always loved her job, always felt safe...until now. People are dying, starting with the facility's founder, whose body is discovered in a ravine on the property-site of a massacre in 1862. And before every death, Liv sees a horse and rider, wearing a soldier's garb, in the night sky.... Warning? Omen? Or clue? Liv calls in her cousin Malachi and his Krewe, an FBI unit of paranormal investigators, to discover the truth. New Krewe member Dustin Blake knows they need Liv's involvement in the case, yet he's worried about her safety. Because he and Liv quickly become more than colleagues...and he doesn't want to lose her to the endless night", "hash": "775ee07a-e886-4a72-b18c-01596588f6b1"}, {"title": "Ghost Shadow (Bone Island Trilogy #1)", "author": "Heather Graham", "pgs": 54, "sum": "Storyline: \nGhost Shadow (Bone Island #1) There are those who walk among us who are no longer alive, but not yet crossed over. They seek retribution…vengeance…to warn. Among the living, few intuit their presence. Katie O'Hara is one who can. As she’s drawn deeper and deeper into a gruesome years-old murder, whispered warnings from a spectral friend become more and more insistent. But Katie must uncover the truth: could David Beckett really be guilty of his fiancée’s murder? Worse – the body count’s rising on the Island of Bones, and the dead seem to be reenacting some macabre tableaux from history. The danger is increasing by the moment – especially as Katie finds herself irresistibly drawn to David, who may be responsible for more than just one killing….", "hash": "a2cb1d44-9aa3-4e19-846d-67f212df4598"}, {"title": "Ghost Night (Bone Island Trilogy #2)", "author": "Heather Graham", "pgs": 52, "sum": "Storyline: \nGhost Night (Bone Island #2) A slasher movie turns real when two young actors are brutally murdered on a remote island film set. Their severed heads and arms are posed in macabre homage to a nineteenth-century pirate massacre. Two years later, survivor Vanessa Loren is drawn back to South Bimini by a documentary being made about the storied region. Filmmaker Sean O'Hara aches to see how the unsolved crime haunts her&hellip;and Sean knows more than a little about ghosts. Lured by visions of a spectral figurehead, Vanessa discovers authentic pirate treasures that only deepen the mystery. Are the murders the work of modern-day marauders, the Bermuda Triangle or a deadly paranormal echo of the island's violent history? As Vanessa and Sean grow closer, the killer prepares to resume the slaughter&hellip;unless the dead can intervene.", "hash": "0a508dbe-239e-4e89-9a57-82da8e5483da"}, {"title": "Ghost Moon (Bone Island Trilogy #3)", "author": "Heather Graham", "pgs": 50, "sum": "Storyline: \nGhost Moon (Bone Island #3) Reclusive collector Cutter Merlin is seldom seen in Key West — lately, not at all. Officer Liam Beckett visits Merlin's curious house and discovers the gentleman in his study. In his death grip: a volume of occult lore and a reliquary. His eyes are wide with fright, his mouth a horrified rictus where spiders now dwell. Kelsey Donovan returns to the old house to catalog her estranged grandfather's collection of artifacts and antiquities, vowing to see his treasures divested properly. But she cannot ignore the sense that she's being watched, the reports of malevolent black figures, the pervasive smell of death. Is the Merlin house haunted, even cursed? Liam knows well that some ghost stories are true and he swears to protect Kelsey. But there are forces at work for whom one more life is a pittance to pay for their deepest desire...", "hash": "3a92c68f-aeff-41ef-a8b9-54156c32b9c2"}, {"title": "Ghost Memories (Bone Island Trilogy #0)", "author": "Heather Graham", "pgs": 7, "sum": "Storyline: \nGhost Memories (Bone Island 0.5) In the early nineteenth century, pirates and privateers still wreaked havoc in the Caribbean. Bartholomew Miller had been one of them. After years of plying the seas for England as a privateer, he finally found a home and love on Bone Island off the Florida coast. But Bartholomew also made enemies in his time--enemies that would take everything Bartholomew loved and create a curse to haunt Bone Island for centuries....", "hash": "7927b50a-aab5-42a3-b814-a92e07eab61d"}, {"title": "Kiss of Darkness (Alliance Vampires #7)", "author": "Heather Graham", "pgs": 21, "sum": "Storyline: \nKiss Of Darkness (Alliance Vampires #7) The woods have always been full of whispers in Transylvania, of terrors that go back centuries to the legendary Vlad Dracul himself. Ignoring their professor's grave warning&mdash;beware those who would prey upon the innocent&mdash;several visiting students travel into the forest&#133;and disappear. Now their professor, Bryan McAllister, believes that a dark cult is at work&mdash;and that their next gathering will happen in America. When psychologist Jessica Fraser is approached by Bryan for her assistance, she is hesitant. Something about Bryan unnerves Jessica deeply, yet she cannot ignore the incredible pull she feels toward him. Now, as reluctant allies, they unite to seek the truth. The search takes them from the forested mountains to dimly lit clubs in New Orleans' French Quarter, where perversion goes beyond sexual to life-threatening.", "hash": "bf962e4d-9a5e-46dc-aa4b-7d2ae1ae535b"}]