[{"title": "Shades of Gray (Vampire Trilogy #1)", "author": "Amanda Ashley", "pgs": 34, "sum": "Storyline: \nShades of Gray (Vampire Trilogy #1) Bound by chains, the vampire had slept for 100 years, locked in pain and hunger, until the scent of one woman's blood recalled him to life. Lost in darkness, Grigori finds new sustenance in the light of Marisa's love, and new purpose in his life. Only he can protect her from the evil that stalks the night. Grigori vows to show Marisa that not all the undead are monsters, and that somewhere between the black and white of damnation and desire lay infinite shades of gray.", "hash": "2b7109f0-74da-4224-a657-b646ef7ffc42"}, {"title": "After Sundown (Vampire Trilogy #2)", "author": "Amanda Ashley", "pgs": 38, "sum": "Storyline: \nAfter Sundown (Vampire Trilogy #2) He Has Become What He Once Destroyed. Edward Ramsey has spent his life hunting vampires. Now he is one of them. Yet Edward's human conscience—and his heart—compel him to save beautiful Kelly Anderson, and soon their growing love is his reason for living. And as the ancient, stunning, and merciless vampire, Khira, seeks supremacy among Los Angeles' undead, Edward and his former nemesis, Grigori Chiavari, once Khira's lover, must unite to stop her— before the city, and everything they cherish, is in her power...After Sundown.", "hash": "0d4a8dc0-3002-41c3-944c-bc8448c0b41c"}, {"title": "Desire After Dark (Vampire Trilogy #3)", "author": "Amanda Ashley", "pgs": 51, "sum": "Storyline: \nDesire After Dark (Vampire Trilogy #3) Vicki Cavendish knows she should be careful. After all, there's a killer loose in town—one who drains women of blood, women with red hair and green eyes just like her. She knows she should tell police about the dark, gorgeous man who comes into the diner every night, the one who makes her feel a longing she's never felt before. The last thing she should do is invite the beautiful stranger into her house. Cursed to an eternity of darkness, Antonio Battista has wandered the earth, satisfying his hunger with countless women, letting none find a place in his heart. But Victoria Cavendish is different. Finally, he has found a woman to love, a woman who accepts him for what he is—a woman who wants him as much as he wants her...which is why he should leave. But Antonio is a vampire, not a saint. What is his, he'll fight to keep and protect. And Victoria Cavendish needs protecting...from the remorseless enemy who would make her his prey...and from Antonio's own uncontrollable hunger.", "hash": "03fec7d3-9f76-44ff-89c7-2eeea3dae913"}, {"title": "Night's Kiss (Children of The Night #1)", "author": "Amanda Ashley", "pgs": 46, "sum": "Storyline: \nNight's Kiss (Children of The Night #1) HE HAS FOUND HIS SOUL'S DESIRE... The Dark Gift has brought Roshan DeLongpre a lifetime of bitter loneliness-until, by chance, he comes across a picture of Brenna Flanagan. There is something hauntingly familiar about Brenna, something that compels him to travel into the past, save the beautiful witch from the stake, and bring her safely to his own time. Now, in the modern world, it is Brenna's seductive innocence and sense of wonder that are utterly bewitching the once-weary vampire, blinding him to a growing danger. For there is one whose dark magick is strong...one who knows who they both are and won't stop till their powers are his...and they are nothing more than SHADOWS THROUGH TIME...", "hash": "479a7b38-6940-4fe5-9fa7-3138188ae1d4"}, {"title": "Night's Touch (Children of The Night #2)", "author": "Amanda Ashley", "pgs": 46, "sum": "Storyline: \nNight's Touch (Children of The Night #2) One kiss can seal your fate... Cara DeLongpre wandered into the mysterious Nocturne club looking for a fleeting diversion from her sheltered life. Instead she found a dark, seductive stranger whose touch entices her beyond the safety she's always known and into a heady carnal bliss. A year ago, Vincent Cordova believed that vampires existed only in bad movies and bogeyman stories. That was before a chance encounter left him with unimaginable powers, a hellish thirst, and an aching loneliness he's sure will never end—until the night he meets Cara DeLongpre. Cara's beauty and bewitching innocence call to his mind, his heart—his blood. For Vincent senses the Dark Gift shared by Cara's parents, and the lurking threat from an ancient and powerful foe. And he knows that the only thing more dangerous than the enemy waiting to seek its vengeance is the secret carried by those Cara trusts the most.", "hash": "d951c138-6cc9-4ba8-8e2a-422746a25038"}, {"title": "Night's Master (Children of The Night #3)", "author": "Amanda Ashley", "pgs": 51, "sum": "Storyline: \nNight's Master (Children of The Night #3) Passion Has a Darker Side... Kathy McKenna was sure that the little Midwestern town of Oak Hollow would be isolated enough for safety, but the moment the black-clad stranger walked into her bookstore, she knew she was wrong. Raphael Cordova exudes smouldering power, and his sensual touch draws Kathy into a world of limitless pleasure and unimaginable dangers. Oak Hollow was supposed to be neutral territory for supernatural beings. Instead it has become home to an evil force determined to destroy them—and kill any mortal who gets in the way. As leader of the North American vampires, Raphael has always put duty first, but then, no women ever enthralled him the way Kathy does. And as the enemy's terrifying plan is revealed, Raphael's desire could be a fatal distraction for all his kind, and for the women he has sworn to love forever.", "hash": "72f0468c-9823-43c5-8230-70ebbfaeab9c"}, {"title": "Night's Pleasure (Children of The Night #4)", "author": "Amanda Ashley", "pgs": 52, "sum": "Storyline: \nNight's Pleasure (Children of The Night #4) Desire Casts a Dark Spell... Savanah Gentry’s life was so much simpler when she was a reporter for the local newspaper. That was before her father’s sudden death drew her into a mysterious new world she was just beginning to understand. A Vampire hunter by birth, Savanah has been entrusted with a legacy that puts everyone she cares for in danger—including the seductive, sensual Vampire who unleashes her most primal desires. Rane Cordova has always been alone, half hating himself for his dark gift, even as he relishes its extraordinary power. But one look at Savanah fills him with the need to take everything she has to give and carry her to heights of unimagined ecstasy. And though he never intended their relationship to go this far, now Savanah is in more danger than she knows—and facing a relentless enemy determined to eliminate Rane and all his kind.", "hash": "82e6d35b-d065-4626-9d4a-09d5a36d3280"}, {"title": "Everlasting Kiss (Everlasting #1)", "author": "Amanda Ashley", "pgs": 52, "sum": "Storyline: \nEverlasting Kiss (Everlasting #1) Daisy O'Donnell doesn't get the attraction some women feel for vampires. She likes her men with a heartbeat. And she's just met one who's full of life: Erik Delacourt, the unreasonably sexy man she keeps meeting at a popular L.A. nightclub called the Crypt. She barely knows him, but there's no resisting the connection she feels. . . There's one important detail Erik hasn't gotten around to telling her yet. He's a powerful vampire out to hunt the Blood Thief who is draining young vampires all over the city--and who has just raised the stakes by destroying one of Erik's friends. To Erik, Daisy is a bright spot of innocence in a world of darkness and menace. He'll do anything--even lie to her--to keep her safe and pure. If only he knew that Daisy has something of her own to hide. . .", "hash": "35df9aca-0e10-4aae-a512-b1013c345035"}, {"title": "Everlasting Desire (Everlasting #2)", "author": "Amanda Ashley", "pgs": 55, "sum": "Storyline: \nEverlasting Desire (Everlasting #2) Desire Burns Forever The clientele at Shore's clothing store includes some of L.A.'s sexiest bachelors. But none of them affects Megan DeLacey as deeply as the dark-eyed stranger who strides into her boutique one evening - and keeps returning, night after night. Megan is drawn to Rhys Costain even as she fears him. Because his reason for being there is clear - he wants Megan, with an intensity that's both tempting and terrifying. For almost five centuries, Rhys has lived alone, using women as it pleased him and never wanting more. As Master of the West Coast vampires, it's his duty to eliminate the ancient vampire who's draining humans on his turf, putting all of their kind at risk. But Megan's lush beauty and vibrant warmth is blinding him to a danger that will soon engulf them both - and tear him from the only woman who can satisfy his darkest hunger.", "hash": "fcdc388a-0d59-47a7-8d4d-2dcd9840c0ff"}, {"title": "The Captive ", "author": "Amanda Ashley", "pgs": 35, "sum": "Storyline: \nRelieved from deadly toil in the mines, a slave is brought to his master's household to work and there encounters a new form of torture in a seductive young woman who he is forbidden to have. Original.", "hash": "4eade3c7-5e47-4ea2-9233-09c738138ac0"}]