[{"title": "Sunlight Moonlight ", "author": "Amanda Ashley", "pgs": 51, "sum": "Storyline: \nIn Sunlight, handsome alien Micah is trapped on Earth after he crash lands and falls in love with beautiful woman, while in Moonlight, the vampire Navarre seeks for a woman brave enough to enter his world.", "hash": "49b7bd54-d3a2-475d-89c4-2a4f69e2c9d1"}, {"title": "Embrace the Night ", "author": "Amanda Ashley", "pgs": 38, "sum": "Storyline: \nA creature doomed to wander the earth in eternal darkness, he searches the ages for someone to share the endless night of his existence, for that one woman who will recognize the man within the monster. An angel of purity and sunlight, she fears the mysterious stranger whose eyes promise endless ecstasy even as he whispers dark secrets she dares not believe. They are two people longing for fulfillment, braving the danger of a love like no other. Alone, they face desolation and despair; together, they will share undying passion, defy eternity, and embrace the night.", "hash": "9aa14cec-a357-4f20-b355-2436dbc32f63"}, {"title": "Deeper than the Night ", "author": "Amanda Ashley", "pgs": 37, "sum": "Storyline: \nTownsfolk of Moulton Bay said there was something otherworldly about Alexander Claybourne. Some people whispered that with his dark, arresting features and mesmerising eyes, the seductive stranger looked every inch a vampire. They never guessed how near the truth they were-or that after more than two hundred years of resisting temptation, Claybourne had found a woman he had to possess. Never one to be scared off by superstitious lore, Kara Crawford laughed at the local talk of creatures lurking in the dark. What harm could come of befriending the handsome stranger with the haunted look in his midnight eyes? No matter what shadowy secrets Alexander hid, Kara felt drawn to him, compelled to join him beneath the silver light of the moon, where they would share a love...", "hash": "e6efd968-a757-4cae-a99c-374481d6f659"}, {"title": "A Darker Dream ", "author": "Amanda Ashley", "pgs": 29, "sum": "Storyline: \nIn four hundred years, Rayven has never met a woman like Rhianna McLeod. She is a vision of light, of warmth, of everything he is not—nor can ever be. Doomed to live forever in darkness and solitude, he knows all too well the risk of getting close to her, yet he hungers for her with a fierce passion he's sworn he'll never allow himself to feel. Rhianna's father sells her to Rayven to put food on the table—so she has no choice but to go with the dark stranger. To her surprise, he gives her everything she wants—the finest clothes, education, and the run of the castle—everything, that is, except his touch. For although she senses danger beneath his soft-spoken manner, although even Rayven himself warns her away, she is drawn to this creature of the night, and loves him as she can no other.", "hash": "692e792d-4f4c-4a97-b5b7-40b5c82b459f"}, {"title": "Devil's Due (Red Letter Days #2)", "author": "Rachel Caine", "pgs": 18, "sum": "Storyline: \nDevil's Due (Red Letter Days #2) The money Lucia and her new partner received to open their detective agency had come with strings: any assignment delivered via red envelope had to be top priority. No sweat. No one could make Lucia do something she didn't believe in -- right? Wrong. Lucia soon learned that every choice she made meant life or death for innocent people. No one could be trusted, not even the ex-cop she'd hired -- and fallen for. In fact, Ben might be her fatal weakness, if the powers warring to control the future used him to control Lucia....", "hash": "631b3c08-d99c-4964-93e1-99fe95a42755"}, {"title": "The Sooner the Better (Deliverance Company #3)", "author": "Debbie Macomber", "pgs": 40, "sum": "Storyline: \nThe Sooner the Better (Deliverance Company #3) Lorraine Dancy has just discovered that everything she believes about her father is a lie&#151;starting with the fact that Thomas supposedly died years ago. Now she's learned that not only is he not dead, he's living in a small town south of the border. In the process of tracking him down, she manages to get framed for theft and pursued by the real thief, the police and a local crime boss. Her father's friend Jack Keller agrees to help her escape, although Lorraine's reluctant to depend on a man like him. Jack's every bit the renegade Lorraine thinks he is&#151;an ex-mercenary and former Deliverance Company operative. He's also the one person who can guide her to safety. But there are stormy waters ahead, including an attraction neither of them wants to feel. An attraction that's as risky as it is intense&#151;for both of them. The sooner he can get Lorraine home, the better!", "hash": "b58b045a-2738-48f0-bcf9-3ff40f1f9a04"}, {"title": "No Regrets (Delta Force #1)", "author": "Shannon K. Butcher", "pgs": 42, "sum": "Storyline: \nNo Regrets (Delta Force #1) Renowned cryptologist Noelle Blanche refuses to have blood on her hands. So when the military asks for her help in a covert operation, she refuses--until masked gunmen raid her home and threaten her life. Suddenly it's all too clear that any blood spilled may be her own. Noelle has no choice but to trust the dangerous stranger sent by the military to safeguard her. A stranger who is everything she detests, everything she fears...and everything she desires. Former Delta Force operative David Wolfe thought he had left it all behind--the horror, the hurt, the guilt. But now the men who savagely murdered his wife have set their sights on a brilliant cryptologist who can lead them to the cache of weapons they prize. As passion ignites between David and the woman he's sworn to protect, what began as just a mission escalates into the fight of his life. But can he prevent history from repeating itself?", "hash": "4e5b1bb2-1214-4b1c-a7db-f91405d5eb5c"}, {"title": "No Control  (Delta Force #2)", "author": "Shannon K. Butcher", "pgs": 48, "sum": "Storyline: \nNo Control (Delta Force #2) NO HIDING. Lana Hancock knows all about danger--and betrayal. Eighteen months ago, she was captured by a terrorist group known as the Swarm while one of its members, a rugged man with sinfully dark eyes, did nothing to help her. Now when she's freed and desperate to put it all behind her, the unthinkable happens. The Swarm is targeting Lana once again and the man who stood silently by has become her protector. But can she trust him? NO ESCAPE. Delta Force operative Caleb Stone will never forget the hatred shining in Lana's eyes. Ordered to take down the Swarm by infiltrating its ranks, Caleb couldn't blow his cover to save her--no matter how much it haunted him. Now, gifted with a second chance, he vows to move heaven and earth to protect her...and fulfill her every desire. But the Swarm has reorganized. It's more powerful than ever and hell-bent on revenge...NO CONTROL.", "hash": "600a5753-70f1-473c-8f19-7593cb54ed54"}, {"title": "No Escape (Delta Force #3)", "author": "Shannon K. Butcher", "pgs": 54, "sum": "Storyline: \nNo Escape (Delta Force #3) Teacher Isabelle Carson is grief-stricken, angry, and scared. Three of her childhood friends have died. The police say they're suicides, but Isabelle knows they would never, ever take their own lives. Her past binds her to every victim, and she knows it's only a matter of time before the killer comes after her. Only one man can help her now, the only man she's ever trusted, the man who saved her so long ago... For Grant Kent, Delta Force vet, just being near Isabelle brings back old memories and desires, and stirs longings he'd rather deny. Yet he can't ignore the real terror in her eyes, or resist the thought of holding her again. But even as their friendship begins to blossom into a passionate affair, a killer continues his deadly rampage and plots his next move: the \"suicide\" of Isabelle Carson.", "hash": "924ea911-54bc-493a-8676-c9456267c546"}, {"title": "Carnal Innocence ", "author": "Nora Roberts", "pgs": 31, "sum": "Storyline: \nIn the small town of Innocence, Mississippi, days are long, nights are fragrant, and secrets are hard to keep. But when a brutal killer starts claiming the lives of the town's most attractive women, lifelong neighbors are forced to wonder if the culprit is a stranger lurking in the bayou...or someone right next door. World-famous concert violinist Caroline Waverly knows nothing of the murders when she arrives in Innocence. Burned out from a childhood lost to endless rehearsals and an all-too-public breakup with the conductor who was her lover, Caroline is looking for a little peace and some time to think. She hopes that a stay at her late grandmother's house the one with a covered porch just made for soft summer nights will provide the tranquillity she needs. But Innocence has something else to offer Caroline: a man named Tucker Longstreet. Blessed with the Longstreet good looks, lazy charm, and family fortune, Tucker is a tall, cool drink of water and he knows it. He likes to keep his romances short and shallow. But one look at Caroline, and Tucker realizes that she is unlike any other woman he's met. Tightly coiled and coolly reserved, Caroline is determined to fight him off. She might be able to do a better job if she hadn't felt an unexpected thrill at his ardent advances...and if she hadn't been so scared after finding a third murder victim in the murky waters behind her home. For Caroline Waverly,a beautiful summer interlude could turn into much more or could stir a killer's crazed dreams. Because there's just one small problem with her new romance: Tucker is the leading suspect in the killings.", "hash": "73c8d90a-c5e6-4c5e-81bf-87c387a34fb5"}]