[{"title": "High Noon ", "author": "Nora Roberts", "pgs": 31, "sum": "Storyline: \nPolice Lieutenant Phoebe MacNamara found her calling at an early age when an unstable man broke into her family's home, trapping and terrorizing them for hours. Now she's Savannah's top hostage negotiator, defusing powderkeg situations with a talent for knowing when to give in-and when to jump in and take action. It's satisfying work-and sometimes those skills come in handy at home dealing with her agoraphobic mother, still traumatized by the break-in after all these years, and her precocious seven-year-old, Carly. It's exactly that heady combination of steely courage and sensitivity that first attracts Duncan Swift to Phoebe. After observing her coax one of his employees down from a roof ledge, he is committed to keeping this intriguing, take-charge woman in his life. She's used to working solo, but Phoebe's discovering that no amount of negotiation can keep Duncan at arm's length. And when she's grabbed by a man who throws a hood over her head and brutally assaults her-in her own precinct house-Phoebe can't help but be deeply shaken. Then threatening messages show up on her doorstep, and she's not just alarmed but frustrated. How do you go face-to-face with an opponent who refuses to look you in the eye? Now, with Duncan backing her up every step of the way, she must establish contact with the faceless tormentor who is determined to make her a hostage to fear . . . before she becomes the final showdown.", "hash": "faab313a-3489-44cd-a72f-4e95485223f4"}, {"title": "Sacred Sins ", "author": "Nora Roberts", "pgs": 18, "sum": "Storyline: \nSacred Sins (D.C. Detectives #1) Combining explosive suspense with sensual passion, Nora Roberts turns up the heat in this classic tale — the sizzling story of a man and woman on the trail of a demented killer, a search that will plunge them headlong into danger.... In the lazy days of summer, a merciless heat wave is the biggest story in Washington, D.C. But the weather is knocked off the front pages when a young woman is found strangled to death. A note left behind reads Her sins are forgiven her. Two more victims soon follow, and suddenly every headline is devoted to the killer the press has dubbed “the Priest.” When the police ask top-notch psychiatrist Dr. Tess Court to help with their investigation, she comes up with a disturbing portrait of a twisted soul. Detective Ben Paris doesn’t give a damn about the killer’s psyche. What he can’t easily dismiss is Tess. Tall, dark, and good-looking, Ben has a legendary reputation with women, but the coolly elegant Tess doesn’t react to him like other women he’s known — and he finds the challenge enticing. Now, as the two are thrown together in a perilous quest to stop a serial killer, the flame of white-hot passion flares. But someone also has his eyes on the beautiful blond doctor ... and Ben can only pray that if the madman strikes, he'll be able to stop him before it’s too late....", "hash": "66a60911-7cd3-4a50-911b-9b5fb8ef2b4a"}, {"title": "Tribute ", "author": "Nora Roberts", "pgs": 30, "sum": "Storyline: \nCilla McGowan, a former child star, has found a more satisfying life restoring homes. So she comes to Virginia’s Shenandoah Valley to save the dilapidated farmhouse that once belonged to her grandmother—a legendary actress who died of an overdose more than thirty years ago. Plunging into the project with gusto, Cilla’s almost too busy and exhausted to notice her neighbor, graphic novelist Ford Sawyer. Determined not to carry on the family tradition of ill-fated romances, Cilla steels herself against Ford’s quirky charm, though she can’t help indulging in a little fantasy. But it’s reality that holds its share of dangers for Cilla. A cache of unsigned letters found in the attic points to a mysterious romance in her grandmother’s life—and may be the catalyst for a frightening, violent assault. And if Cilla and Ford are unable to sort out who is targeting her and why, she may, like her world-famous grandmother, be cut down in the prime of her life.", "hash": "46b9e677-978d-4338-985b-599ffee0ee8b"}, {"title": "Cut & Run (Cut & Run #1)", "author": "Abigail Roux", "pgs": 61, "sum": "Storyline: \nCut & Run (Cut & Run #1) A series of murders in New York City has stymied the police and FBI alike, and they suspect the culprit is a single killer sending an indecipherable message. But when the two federal agents assigned to the investigation are taken out, the FBI takes a more personal interest in the case. Special Agent Ty Grady is pulled out of undercover work after his case blows up in his face. He's cocky, abrasive, and indisputably the best at what he does. But when he's paired with Special Agent Zane Garrett, it's hate at first sight. Garrett is the perfect image of an agent: serious, sober, and focused, which makes their partnership a classic cliche: total opposites, good cop-bad cop, the odd couple. They both know immediately that their partnership will pose more of an obstacle than the lack of evidence left by the murderer. Practically before their special assignment starts, the murderer strikes again - this time at them. Now on the run, trying to track down a man who has focused on killing his pursuers, Grady and Garrett will have to figure out how to work together before they become two more notches in the murderer's knife.\"", "hash": "2225572d-0b17-442d-a572-4b7b272122c8"}, {"title": "Sticks & Stones (Cut & Run #2)", "author": "H.M. Ward", "pgs": 40, "sum": "Storyline: \nSticks & Stones (Cut & Run #2) Cut & Run Series Book Two - Sequel to Cut & Run Six months after nearly losing their lives to a serial killer in New York City, FBI Special Agents Ty Grady and Zane Garrett are suffering through something almost as frightening: the monotony of desk duty. When they're ordered to take a vacation for the good of everyone's sanity, Ty bites the bullet and takes Zane home with him to West Virginia, hoping the peace and quiet of the mountains will give them the chance to explore the explosive attraction they've so far been unable to reconcile with their professional partnership. Ty and Zane, along with Ty's father and brother, head up into the Appalachian mountains for a nice, relaxing hike deep into the woods... where no one will hear them scream. They find themselves facing danger from all directions: unpredictable weather, the unrelenting mountains, wild animals, fellow hikers with nothing to lose, and the most terrifying challenge of all. Each other.", "hash": "66921a86-5dfe-4011-b67f-002ad03e2622"}, {"title": "Fish & Chips (Cut & Run #3)", "author": "Abigail Roux", "pgs": 41, "sum": "Storyline: \nFish & Chips (Cut & Run #3) Special Agents Ty Grady and Zane Garrett are back on the job, settled into a personal and professional relationship built on fierce protectiveness and blistering passion. Now they're assigned to impersonate two members of an international smuggling ring-an out-and-proud married couple-on a Christmas cruise in the Caribbean. As their boss says, surely they'd rather kiss each other than be shot at, and he has no idea how right he is. Portraying the wealthy criminals requires a particular change in attitude from Ty and Zane while dealing with the frustrating waiting game of their assignment. As it begins to affect how they treat each other in private, Ty and Zane realize there's more to being partners than watching each other's backs, and when the case takes an unexpected turn and threatens Ty's life, Ty and Zane will have to navigate seas of white lies and stormy secrets, including some of their own.", "hash": "a7e35bce-b422-4e30-9585-d8c55343b0dc"}, {"title": "Divide & Conquer (Cut & Run #4)", "author": "Abigail Roux", "pgs": 38, "sum": "Storyline: \nDivide & Conquer (Cut & Run #4) Baltimore, Maryland, is a city in alarming distress. Rising violence is fanning the flames of public outrage, and all law enforcement agencies, including the FBI, are catching blame. Thus the FBI’s latest ideas to improve public relations: a municipal softball league and workshops for community leaders. But the new commitments just mean more time Special Agents Ty Grady and Zane Garrett have to spend apart when they’re happily exploring how to be more than by-the-book partners. Then the latest spate of crime explodes in their faces—literally—throwing the city, the Bureau, and Ty and Zane’s volatile partnership both in and out of the office into chaos. They’re hip-deep in trouble, trying to track down bombers and bank robbers in the dark with very few clues, and the only way to reach the light at the end of the tunnel together requires Ty and Zane to close their eyes and trust each other to the fiery end.", "hash": "d4cc4ed4-3417-4968-94fd-df9892322fef"}, {"title": "Armed & Dangerous (Cut & Run #5)", "author": "Abigail Roux", "pgs": 43, "sum": "Storyline: \nArmed & Dangerous (Cut & Run #5) Left alone in Baltimore after his unpredictable lover bails, Special Agent Zane Garrett takes his frustration out on everything in his path until he is ordered to Chicago to back up an undercover operative. When he gets there, though, he finds himself face to face with his wayward partner, Special Agent Ty Grady. They have to deal with the uncertainty lingering between them while they work to retrieve their intended mark, a retired hit man and CIA wet-works operative named Julian Cross. Ty, once a marine and now an FBI hotshot, has a penchant for being unpredictable, a trait Zane can vouch for. Zane is a man who once lived for his job but has come to realize his heartbreaking past doesn’t have to overshadow his future. They're partners, friends, lovers, and the go-to team for unusual cases. With Cross and his innocuous boyfriend, Cameron Jacobs, in tow, Ty and Zane must navigate the obstacles of a cross-country trek, including TSA pat-downs, blizzards, their uncooperative prisoners, CIA kill teams, a desperate lack of sleep or caffeine, and each other. Ty and Zane are determined to get Julian Cross to DC in one piece, but it’s starting to look like it might be the last thing they do.", "hash": "0753c8e9-b614-41d8-833e-cdb4db3ac129"}, {"title": "Stars & Stripes (Cut & Run #6)", "author": "Abigail Roux", "pgs": 42, "sum": "Storyline: \nStars & Stripes (Cut & Run #6) Special Agents Ty Grady and Zane Garrett have managed the impossible: a few months of peace and quiet. After nearly a year of personal and professional turmoil, they're living together conflict-free, work is going smoothly, and they're both happy, healthy, and home every night before dark. But anyone who knows them knows that can’t possibly last. When an emergency call from home upsets the balance of their carefully arranged world, Ty and Zane must juggle family drama with a perplexing crime to save a helpless victim before time runs out. From the mountains of West Virginia to a remote Texas horse ranch harboring more than just livestock and childhood memories, Ty and Zane must face their fears—and their families—to overcome an unlikely enemy and bring peace back into their newly shared world.", "hash": "3fec02b2-2030-4042-adac-27a5259d1aaa"}, {"title": "Touch & Geaux (Cut & Run #7)", "author": "Abigail Roux", "pgs": 40, "sum": "Storyline: \nTouch & Geaux (Cut & Run #7) After having their faces plastered across the news during a high-profile case, FBI Special Agents Ty Grady and Zane Garrett have become more useful to the Bureau posing for photo ops than working undercover. Just as Zane is beginning to consider retirement a viable option, Ty receives a distress call from a friend, leading them to a city rife with echoes from the past. New Orleans wears its history on its streets, and it’s the one place Ty’s face could get him killed. Surrounded by trouble as soon as they land, Ty and Zane are swiftly confronted with a past from which Ty can’t hide—one with a surprising connection to Zane’s. As threats close in from all directions, both men must come to terms with the lives they’ve led and the lies they’ve told. They soon discover that not all their secrets are out yet, and nothing lasts forever.", "hash": "993f728b-6c8e-401b-8410-b9e332657cb6"}]