[{"title": "Ball & Chain (Cut & Run #8)", "author": "Abigail Roux", "pgs": 42, "sum": "Storyline: \nBall & Chain (Cut & Run #8) Home from their unexpected deployment, the former members of Marine Force Recon team Sidewinder rejoin their loved ones and try to pick up the pieces of the lives they were forced to leave behind. Ty Grady comes home to Zane Garrett, only to find that everything around him has changed—even the men he went to war with. He barely has time to adjust before his brother, Deuce, asks Ty to be his best man. But that isn’t all Deuce asks Ty to do, and Ty must call for backup to deal with the business issues of Deuce’s future father-in-law. Nick O’Flaherty and Kelly Abbott join Ty and Zane at the wedding on an island in Scotland, thinking they’re there to assuage Deuce’s paranoia. But when bodies start dropping and boats start sinking, the four men get more involved with the festivities than they’d ever planned to. With the clock ticking and the killer just as stuck on the isolated island as they are, Ty and Zane must navigate a veritable minefield of family, friends, and foes to stop the whole island from being destroyed.", "hash": "4052c3a5-7819-49a2-b387-33994fa52e69"}, {"title": "Warm Bodies (Warm Bodies #1)", "author": "Isaac Marion", "pgs": 21, "sum": "Storyline: \nR is having a no-life crisis - he is a zombie. He has no memories, no identity, and no pulse, but he is a little different from his fellow Dead. He may occasionally eat people, but he'd rather be riding abandoned airport escalators, listening to Sinatra in the cozy 747 he calls home, or collecting souvenirs from the ruins of civilization. And then he meets a girl. First as his captive, then his reluctant house guest, Julie is a blast of living color in R's gray landscape, and something inside him begins to bloom. He doesn't want to eat this girl - although she looks delicious - he wants to protect her. But their unlikely bond will cause ripples they can't imagine, and their hopeless world won't change without a fight.", "hash": "52697885-94a0-4771-872e-48e5ab103ef0"}, {"title": "What Dreams May Come ", "author": "Richard Matheson", "pgs": 38, "sum": "Storyline: \nA LOVE THAT TRANSCENDS HEAVEN AND HELL What happens to us after we die? Chris Nielsen had no idea, until an unexpected accident cut his life short, separating him from his beloved wife, Annie. Now Chris must discover the true nature of life after death. But even Heaven is not complete without Annie, and when tragedy threatens to divide them forever, Chris risks his very soul to save Annie from an eternity of despair. Richard Matheson's powerful tale of life---and love---after death was the basis for the Oscar-winning film starring Robin Williams.", "hash": "a6a83b10-5a82-4589-bae8-c12b40c4ed7d"}, {"title": "Donners of the Dead ", "author": "Karina Halle", "pgs": 25, "sum": "Storyline: \n***A Standalone Horror Romance*** A note about this book: Donners of the Dead is set in 1851 – couples were often thrust into marriage together with short courtships, racism was widespread and not overly frowned upon, and women had little to no rights. What wouldn't fly in today's day and age was unfortunately the norm back then - it is worth keeping that in mind when reading this book. Jake McGraw was unlike anyone I’d ever known. He was brash, rude, unapologetic and arrogant; chauvinistic, close-minded, and terribly stubborn. He was built like a tree, tall with a hard chest and wide shoulders and hands that looked like they could wrestle a bear. He was a cigar-chomping, scruffy-faced, beast of a man. I was pretty sure I hated him. And I know he hated me. But among the flesh-eating monsters in these snow-capped mountains, he was the only thing keeping me alive The year is 1851 and pioneers in search of California gold are still afraid to travel on the same route as the tragic Donner party did years before. When the last wagon train to go into the Sierra Nevada mountains fails to arrive at their destination, Eve Smith, an 18-year old half-native girl with immense tracking skills is brought along with the search party, headed by an enigmatic former Texas Ranger, Jake McGraw. What they find deep in the dangerous snow-covered terrain is a terrifying consequence of cannibalism, giving new meaning to the term “monster.” While the search party is slowly picked off, one by one, Eve must learn to trust Jake, who harbors more than a few secrets of his own, in order to survive and prevent the monstrosities from reaching civilization. ***This is NOT New Adult***", "hash": "47c0f2f5-32ff-4a11-87e8-6ba938260c55"}, {"title": "Storm Born (Dark Swan #1)", "author": "Richelle Mead", "pgs": 28, "sum": "Storyline: \nDark Swan Series Book 1: Storm Born Storm Born is a supernatural, romance and fantasy novel written by American author Richelle Mead. It is the first in the Dark Swan series, followed by Thorn Queen and Iron Crowned. The fourth in the series Shadow Heir is set for publication January 2012. The series follows the main character Eugenie Markham, a \"shaman-for-hire\" and her encounters in the \"Otherworld\", a parallel world occupied by the \"shining ones\" and her adjustment to a prophecy stating her first-born son would be a powerful conqueror of both worlds.", "hash": "2ab455be-3786-4be7-8fa3-1529c7e79eef"}, {"title": "Thorn Queen (Dark Swan #2)", "author": "Richelle Mead", "pgs": 28, "sum": "Storyline: \nDark Swan Series Book 2: Thorn Queen Eugenie Markham is a shaman for hire, paid to bind and banish creatures from the Otherworld. But after her last battle, she's also become queen of the Thorn Land. It's hardly an envious life, not with her kingdom in tatters, her love life in chaos, and Eugenie eager to avoid the prophecy about her firstborn destroying mankind. And now young girls are disappearing from the Otherworld, and no one - except Eugenie - seems willing to find out why. Eugenie has spilled plenty of fey blood in her time, but this enemy is shrewd, subtle, and nursing a very personal grudge. And the men in her life aren't making things any easier. Her boyfriend Kiyo is preoccupied with his pregnant ex, and sexy fey king Dorian always poses a dangerous distraction.", "hash": "22112d52-5c1b-4493-97b3-ac6c9e23e8f9"}, {"title": "Iron Crowned (Dark Swan #3)", "author": "Richelle Mead", "pgs": 26, "sum": "Storyline: \nDark Swan Series Book 3: Iron Crowned An embattled realm mystically entwined with our own, the Otherworld is at the mercy of one woman...Shaman-for-hire Eugenie Markham is the best at banishing entities trespassing in the mortal realm. But as the Thorn Land's queen, she's fast running out of ways to end the brutal war devastating her kingdom. Her only hope: the Iron Crown, a legendary object even the most powerful fear...But who can she trust to help her? Fairy king Dorian has his own agenda. And Kiyo, her shape-shifter ex-boyfriend, has every reason to betray her. To control the Crown's all-consuming powers, Eugenie must confront an unimaginable temptation - one which puts her soul and the fate of two worlds in mortal danger...", "hash": "5a36d057-8f44-4b8b-ba33-71fdafcb93a5"}, {"title": "Succubus Blues (Georgina Kincaid #1)", "author": "Richelle Mead", "pgs": 27, "sum": "Storyline: \nGeorgina Kincaid Book 1: Succubus Blues We first meet Georgina Kincaid when she is asked by her friend Hugh the imp to sleep with a virgin who has bargained to give up his soul in exchange for a hot and heavy fantasy encounter with a demoness. So as a favor to her friend she agrees to shape shift into a demonic outfit complete with wings and a tail and sleep with the 34 year old man. We are then told that she is a succubus who takes the life force from men to survive through sex. The better character the man has the more energy she gets from him. The more immoral the man the less energy she gets from him. After sex with the man she goes to her car where she is accosted by a vampire named Duane who tries to force himself on her when she fights back he is angered but when a car driven by it allows her a distraction to get away. She gets a call from her demon boss Jerome who got a call from Duane saying she attacked him and threatened him, which she did in self defense.", "hash": "ef9738c8-19f7-436a-91d1-e1ef51e1e195"}, {"title": " Succubus on Top (Georgina Kincaid #2)", "author": "Richelle Mead", "pgs": 24, "sum": "Storyline: \nGeorgina Kincaid Book 2: Succubus on Top Succubus on Top is a supernatural novel by Richelle Mead. It is the second novel in the Georgina Kincaid series, which will have six books but only currently consists of five. It is written in a first-person perspective following the main character, Georgina Kincaid, who is a succubus with a heart working at a local book store, Emerald City Books & Cafe. \"Georgina Kincaid’s job sucks. Literally. Love hurts, and no one knows it better than Georgina Kincaid. If she so much as kisses her new boyfriend, she’ll drain his life force. Georgina is a succubus—a demon who draws her power from other men’s pleasure. Admittedly, the shapeshifting and immortality perks are terrific, and yes, Georgina did choose to join the ranks of hell centuries ago. But it seems completely unfair that a she-demon whose purpose is seduction can’t get hot and heavy with the one mortal who knows and accepts her for who she is.", "hash": "3f5cc8de-cf17-445f-b577-583e2c802a1d"}, {"title": "Succubus Dreams (Georgina Kincaid #3)", "author": "Richelle Mead", "pgs": 26, "sum": "Storyline: \nGeorgina Kincaid Book 3: Succubus Dreams especially when the girl in question is Georgina Kincaid, a shape-shifting succubus who gets her energy from seducing men. First there's her relationship with gorgeous bestselling writer Seth Mortensen, which is unsatisfying on a number of levels. It's not just that they can't have sex in case Georgina inadvertently kills him (generally a turn-off for most guys). Lately, even spending time together is a challenge. Seth's obsessed with finishing his latest novel, and Georgina's under demonic orders to mentor the new (and surprisingly inept) succubus on the block.", "hash": "e179e6fc-e9fe-4f02-83e8-d4f7c2272841"}]