[{"title": "Succubus Heat (Georgina Kincaid #4)", "author": "Richelle Mead", "pgs": 27, "sum": "Storyline: \nGeorgina Kincaid Book 4: Succubus Heat Which should be a good thing. But lately, thanks to her foul mood over breaking up with bestselling writer Seth Mortensen, she's been so wicked that Seattle's uber-demon Jerome, decides to \"outsource\" Georgina to a rival--and have her spy for him in the process. Being exiled to the frozen north--okay, Vancouver--and leaving Seth in the cozy clutches of his new girlfriend is unpleasant enough. Then Jerome is kidnapped, and all immortals under his control mysteriously lose their powers. One bright spot: with her life-sucking ability gone, there's nothing to keep Georgina from getting down and dirty with Seth--nothing apart from his girlfriend that is. Now, as the supernatural population starts turning on itself, a newly mortal Georgina must rescue her boss and figure out who's been playing them--or all hell will break loose. . .", "hash": "79a1b2e5-ac0a-4c6f-8940-4c30fe17b9be"}, {"title": "Succubus Shadows (Georgina Kincaid #5)", "author": "Richelle Mead", "pgs": 25, "sum": "Storyline: \nGeorgina Kincaid Book 5: Succubus Shadows Something ominous is tracking reluctant succubus Georgina Kincaid through her effervescent fifth urban fantasy adventure (after 2009's Succubus Heat). An elusive entity that Georgina can't name or fight invades her thoughts and nearly persuades her to kill herself. Georgina's boss, archdemon Jerome, and her angel friend Carter can't even detect the phenomenon, much less figure out how to stop it. Georgina's ex-boyfriend, Seth, is about to marry her friend Maddie, and what with pining after Seth, trying to protect him from another succubus, and being one of Maddie's bridesmaids, Georgia finds that suicide is starting to sound very tempting. Mead's lighthearted romp is plenty of fun on the surface; Georgina's struggles with the gray areas between good and evil provide a powerful undercurrent.", "hash": "b0a016db-033f-4104-8e7e-26241ba04bcf"}, {"title": "Succubus Revealed (Georgina Kincaid #6)", "author": "Richelle Mead", "pgs": 23, "sum": "Storyline: \nGeorgina Kincaid Book 6: Succubus Revealed After everyone finds out about Georgina's phase with Seth during his and Maddie's engagement, things degenerate at Georgina's workplace and she quits. In the opening of the sixth book she works as one of Santa's elfs in a Mall when she suddenly gets a notice that she has been transfered to Las Vegas.", "hash": "780458ad-d9db-4136-b351-75a95700f737"}, {"title": "Night World : Black Dawn (Night World #8)", "author": "L.J. Smith", "pgs": 20, "sum": "Storyline: \nBlack Dawn (Night World Book 8) Maggie Neely is a short, spunky sixteen-year-old with auburn hair and an iron will. When her brother turns up missing, she’s determined to find him. But she never suspects that the trail will lead her into the most secret heart of the Night World, a kingdom where no outsider has stepped in five hundred years. The kingdom is ruled by the young vampire prince Delos…who keeps all humans as slaves. When Delos falls in love with Maggie, he frees her and demands that she join him in his life of dark pleasure. He’s handsome, he’s romantic – Maggie can hardly resist him. But did he kill Maggie’s brother? And who are the strange people searching the kingdom for a Wild Power? Maggie won’t give up until she learns the truth – even if it means destroying Delos and his secret land. If he doesn’t destroy her firs...", "hash": "57aac84c-696d-49d1-9526-26ec6bb5ffe7"}, {"title": "Night Creature: Blue Moon (Nightcreature #1)", "author": "Lori Handeland", "pgs": 41, "sum": "Storyline: \nBlue Moon(Night Creature series book 1) Miniwa, Wisconsin is under siege, but not by the usual summer tourists. The area's normally shy wolf population has begun stalking human prey, and their victims have been disappearing...or worse. Something is happening in the woods. Something brutal and primitive... Officer Jessie McQuade has seen plenty in her years on the force-but nothing as intriguing as the gorgeous, naked man she encounters while tracking a rogue wolf. Professor Will Cadotte is a Native American activist. He's also the only man capable of distracting Jessie from her work. And for a cop, distraction-no matter how pleasurable-can be deadly. It's against Jessie's better judgment to accept Will's help in her investigation, yet she soon finds herself doing exactly that-and more. Will's dark, penetrating eyes see into a part of Jessie's soul she never knew existed. It's exhilarating...and terrifying. Now, as a town's deepest secrets come to light, no one is safe: not friends, lovers, or strangers. And as Jessie follows a bloody trail to the shocking truth, she'll have to decide who she can trust when the moon is full...", "hash": "451befcb-8d86-41ab-9e6b-8b1ba4953f19"}, {"title": "Night Creature: Hunter's Moon (Nightcreature #2)", "author": "Lori Handeland", "pgs": 40, "sum": "Storyline: \nHunter's Moon(Night Creature series book 2) eigh Tyler was once a kindergarten teacher with starry-eyed dreams-dreams that turned into nightmares when the biggest mistake she ever made came back to tear her world apart. Now, Leigh lives only for the hunt. Werewolves are her prey, and love is no longer an option. Leigh has been called to Wisconsin for something big. As long as it means killing fanged and furry demons, she's up for it. But the worst is yet to come, because something stronger and smarter than the average beast is on the prowl...and it's doing Leigh's work for her. Intoxicating and intriguing, Damien Fitzgerald is making Leigh question her vow never to let another man into her bed, or her heart. Every moment with him brings forth familiar-and dangerous-urges. Urges that may prove too strong to resist. Leigh's job is a dance with death, and she has no intention of letting Damian become involved and get hurt. Especially now that she knows her enemy is watching from the forest. Waiting for her first wrong step...", "hash": "1b2595e5-e0a4-4e8c-8cec-d2fcb9d784b5"}, {"title": "Night Creature: Dark Moon (Nightcreature #3)", "author": "Lori Handeland", "pgs": 36, "sum": "Storyline: \nDark Moon(Night Creature series book 3) Elise Hanover feels the pull of the moon--even in its dark phase. She is a werewolf who feels nothing but disgust for the bloodlust and violent tendencies inside her. Nick Franklin is the man she met and fell in love with in college, and the man whose touch first awakened her beast. When she realized that her lust for him inspired the wolf inside her, she ran as far and as fast as she could. To defeat her furry side, she has spent the last five years in a secret location in Montana, trying to find a cure for lycanthropy. Just as she feels she's at the edge of a breakthrough, her research is interrupted. Nick is now an FBI agent--and he's standing in her lab. Minutes after they leave the building, it explodes, destroying all of Elise's research and the serum she needs to fight her bloodlust. Together, Nick and Elise must race to find a cure for before the next full moon rises. Dark Moon is full of dry wit, steamy chemistry, and truly scary villians.", "hash": "904620df-eb0c-4585-92c0-1831847d1b56"}, {"title": "Night Creature: Crescent Moon (Nightcreature #4)", "author": "Lori Handeland", "pgs": 41, "sum": "Storyline: \nCrescent Moon(Night Creature series book 4) New Orleans is known for sinful pleasures and strange magic, but for cryptozoologist Diana Malone it offers one irresistible attraction. For over a hundred years there have been whispers of wolves around the Crescent City, and the recent discovery of bodies in the nearby swamps hints at a creature even more dangerous...one that could make Diana's career and fortune, if she lives to capture it. Adam Ruelle is a reclusive former Special Forces officer, the last of a mysterious Cajun family rumored to be cursed, and the only person skilled enough to guide Diana in her search. Rugged and captivating, he fills her nights with desire...but by day, Diana is plagued with doubts. Adam clearly knows more than he's telling, but is his aim to protect her or distract her? Something is stalking its prey in the Louisiana bayous, and every step towards the horrifying truth brings Diana closer to a centuries-old enemy that lives for the smell of fear and the thrill of killing, again and again...", "hash": "b5b90877-b270-4c04-92f0-0079ea575b9c"}, {"title": "The Secret Circle: The Captive (The Secret Circle #2)", "author": "L.J. Smith", "pgs": 16, "sum": "Storyline: \nThe Secret Circle book 2: The Captive Lured into the most popular in-crowd imaginable, Cassie is intoxicated by her newfound strength. Caught between two members' consuming desires to use the coven's mysterious forces, Cassie turns to one of their boyfriends, Adam - and falls captive to her own dangerous love.", "hash": "1f9f8ab8-320c-4630-b572-f17c313dd7f6"}, {"title": "The Secret Circle: The Hunt (The Secret Circle #5)", "author": "L.J. Smith", "pgs": 31, "sum": "Storyline: \nFor Cassie and her Circle of witches, it's hard to imagine life in New Salem getting any worse. A band of powerful witch hunters is targeting the group, determined to destroy them one by one. And Cassie's half sister, Scarlett, won't rest until she has a spot in the Circle - even if she has to kill Cassie to get it. The Circle's only hope against their enemies is Cassie's father's Book of Shadows - an ancient guide to the world of dark magic. But Cassie soon discovers that opening the book has grave consequences. Cassie's drawn in by the book's sinister spell, and it starts controlling her emotions and impulses, unraveling her relationship with Adam as it takes over her life. Cassie fights against the darkness inside her as the threats against the Circle grow. But once evil is let in, she may never escape...", "hash": "b0129000-6b52-4303-a17a-81d4ac154519"}]