[{"title": "Vampire Sunrise (Delilah Street #3)", "author": "Carole Nelson Douglas", "pgs": 38, "sum": "Storyline: \nVampire Sunrise (Delilah Street #3) Werewolf mobsters and vampires run Vegas, but that's yesterday's news for Delilah Street, paranormal investigator. What's truly fearsome is her bloody discovery of an undead evil rooted in ancient Egypt. Now, with her lover Ric fighting for life after a grim battle, the chips are down. But Delilah is a born winner who has never let a little danger throw off her game, and she's been learning fast since she came to Sin City. Her affinity for silver is making mirror-walking a real breeze, and being forced to accept the albino rock star sorcerer Snow's Brimstone Kiss has ramped up her powers to a startling new level. With the help of her trusty uber-wolfhound Quicksilver, not to mention the orange demon parking valet Manny, Delilah is determined to solve even more paranormal secrets, and hopefully save the few innocents left in town...", "hash": "0207e59e-6aba-4072-9959-68f0da92bb83"}, {"title": "Silver Zombie (Delilah Street #4)", "author": "Carole Nelson Douglas", "pgs": 32, "sum": "Storyline: \nSilver Zombie (Delilah Street #4) Zombies and Witches and Vamps . . . Oh, My! What happens in Vegas stays in Vegas—at least that’s Delilah Street’s hope. With Sin City’s vampire and werewolf mobs wanting to cash in her chips once and for all, she’s retreating with her partner Ric Montoya and half-wolfhound Quicksilver to her Kansas birthplace. Unfortunately, when it comes to finding trouble, there’s no place like home. . . . It doesn’t take long before Delilah realizes she’s not in Vegas anymore. Zombie cowboys and spectral cattle drives are kicking up dust, the local weather girls are total witches who forecast perfect storms, and some Hollywood fanatic is recasting zombies as the greatest stars of the silver screen. And speaking of silver, Delilah’s special affinity for the all-purpose monster-repellent leads her posse straight down a silver brick road—and into a notso- fun house of mirrors—putting her face-to-face with her dicey past and a mystery woman named Lilith, who’s a real dead ringer for Delilah. The key word being dead.", "hash": "41f8ded8-126d-4968-9b6d-fd6a6f7a1d1e"}, {"title": "A Little Night Magic (Nodaway Falls #1)", "author": "Lucy March", "pgs": 21, "sum": "Storyline: \nA Little Night Magic (Nodaway Falls #1) She's been working at the same Nodaway Falls, New York, waffle house since she was a teenager; not a lot of upward mobility there. She's been in love with Tobias, the cook, for the last four years; he's never made a move. Every Saturday night, she gathers with her three best friends - Peach, Millie, and Stacy - and drinks the same margaritas while listening to the same old stories. Intent on shaking things up, she puts her house on the market, buys a one-way ticket to Europe, and announces her plans to her friends... but then she meets Davina Granville, a strange and mystical Southern woman who shows Olivia that there is more to her life than she ever dreamed. As Liv's latent magical powers come to the surface, she discovers that having an interesting life is maybe not all it's cracked up to be. The dark side of someone else's magic is taking over good people in town, and changing them into vessels of malevolence. Unwilling to cede her home to darkness, she battles the demons of her familial past and her magical present, with those she loves at her side... and in the cross fire. Can the most important things in life - friendship, love, magic, and waffles - get her through the worst that the universe can throw at her?", "hash": "ded6a4f7-4e0a-481d-bda6-aefb126bf8fd"}, {"title": "The Warlord Wants Forever (Immortals After Dark #1)", "author": "Kresley Cole", "pgs": 13, "sum": "Storyline: \nThe Warlord Wants Forever (Immortals After Dark #1) EXCLUSIVE EBOOK NOVELLA with teaser chapters of the hugely anticipated LOTHAIRE Nikolai Wroth, once a ruthless human warlord in the 1700s and now a general in the rebel vampire army, needs to find his bride, the one woman who can render him truly alive. As a turned human, he doesn't enjoy a heartbeat or breathing and is consequently weaker than fully blooded vampires. He wants his bride for the power she will bring him and can hardly believe it when his heart beats for Myst the Coveted, a mad, fey, mythological creature. She eludes him for five years, but he has finally chased her to ground and stolen the jewel which commands her, giving him absolute power over her. While he possesses it, he can make her do anything, and he plans to in order for her to experience firsthand the agonizing, unending lust she'd purposely subjected him to for half a decade. Yet when Wroth realizes he wants more from her and frees her, will she come.", "hash": "6611b3bf-da5d-4697-b307-0a0f59529500"}, {"title": "Refugee (The Captive #3)", "author": "Erica Stevens", "pgs": 20, "sum": "Storyline: \nRefugee (The Captive #3) Whispers, rumors, and horror stories abound about The Barrens and the strange creatures that lurk within them. Determined to find the remaining vampires that stood against his father in the war, Braith knows that it’s dangerous to enter the inhospitable land, but that they must if they are to have a chance at gaining allies to help overthrow the king. Though he once knew the powerful vampires that are rumored to reside within The Barrens, he is unsure what to expect if they succeed in finding them. He will do whatever is necessary though to ensure a future for himself and Aria. Aria is fearful of entering into the land she’s heard nothing but cautionary tales about, but she’s determined to help Braith locate the vampires that may help them with their cause. She is fascinated and amazed by the world they uncover within, one that is unlike anything she has ever seen before. However, the more immersed they become in a world that she doesn’t entirely understand, the more she realizes that it won’t be the war, or even the king that will eventually tear her and Braith apart. It will be her.", "hash": "7f956f42-6a88-4d52-a6be-5f392170bc4a"}, {"title": "A Girl's Guide to Vampires (Dark Ones #1)", "author": "Katie MacAlister", "pgs": 20, "sum": "Storyline: \nA Girl's Guide to Vampires (Dark Ones #1) All Joy Randall wants is a little old-fashioned romance, but when she participates in a \"Goddess evoking\" ceremony with her friend, Roxy, Joy finds out her future true love is a man with the potential to put her immortal soul in danger. At first the ever-practical Joy is ready to dismiss her vision as a product of too much gin and too many vampire romances, but while traveling through the Czech Republic with Roxy, Joy begins to have some second thoughts about her mystery lover because she is suddenly plagued by visions of a lethally handsome stranger. Then, when she and Roxy attend a local GothFaire, Joy meets Raphael Griffin St. John, head of security, and she becomes even more bewildered because the dark and dangerous Raphael seems too close to her dreams for comfort.", "hash": "42e2abd5-b045-4673-8c10-bceecd0f1bf6"}, {"title": "Dead as a Doornail (Sookie Stackhouse #5)", "author": "Charlaine Harris", "pgs": 16, "sum": "Storyline: \nDead as a Doornail (Sookie Stackhouse #5) Small-town cocktail waitress Sookie Stackhouse has had more than her share of experience with the supernatural—but now it’s really hitting close to home. When Sookie sees her brother Jason’s eyes start to change, she knows he’s about to turn into a were-panther for the first time—a transformation he embraces more readily than most shapeshifters she knows. But her concern becomes cold fear when a sniper sets his deadly sights on the local changeling population, and Jason’s new panther brethren suspect he may be the shooter. Now, Sookie has until the next full moon to find out who’s behind the attacks—unless the killer decides to find her first…", "hash": "7d5ce16e-5ec4-469b-ac63-4cb508b26ac5"}, {"title": "Definitely Dead (Sookie Stackhouse #6)", "author": "Charlaine Harris", "pgs": 23, "sum": "Storyline: \nDefinitely Dead (Sookie Stackhouse #6) As a person with so few living relatives, Louisiana cocktail waitress Sookie Stackhouse really hated to lose one. But she never guessed that it would be her cousin Hadley—a consort of the Vampire Queen of New Orleans. After all, technically speaking, Hadley was already dead. And now, as unexpected heir to Hadley’s estate, Sookie discovers the inheritance definitely comes with a risk. Someone doesn’t want Sookie looking too deeply into Hadley’s past—or for that matter, Hadley’s possessions. And they’re prepared to do anything in their power to stop her. But who? The range of suspects runs from the Rogue Weres who reject Sookie as a friend of the Pack to the Vampire Queen herself, who could be working through a particularly vulnerable subject—Sookie’s first love, Bill. Whoever it is, they’re definitely dangerous—and Sookie’s life is definitely on the line… With HBO's launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.", "hash": "1d90430e-306f-4a38-b1dc-136cb0f7b03c"}, {"title": "All Together Dead (Sookie Stackhouse #7)", "author": "Charlaine Harris", "pgs": 19, "sum": "Storyline: \nAll Together Dead (Sookie Stackhouse #7) Louisiana cocktail waitress Sookie Stackhouse has her hands full dealing with every sort of undead and paranormal creature imaginable. And after being betrayed by her longtime vampire love, Sookie must not only deal with a new man in her life—the shapeshifter Quinn—but also contend with the long-planned vampire summit. The summit is a tense situation. The vampire queen of Louisiana is in a precarious position, her power base weakened by hurricane damage to New Orleans. And there are some vamps who would like to finish what nature started. Soon, Sookie must decide what side she'll stand with. And her choice may mean the difference between survival and all-out catastrophe. And with HBO's launching of an all-new show, True Blood, based on the Southern Vampire novels, the demand for Charlaine Harris and Sookie Stackhouse is bigger than ever.", "hash": "2f514e11-3dff-46f1-a48f-42d3e44a528d"}, {"title": "From Dead to Worse (Sookie Stackhouse #8)", "author": "Charlaine Harris", "pgs": 21, "sum": "Storyline: \nFrom Dead to Worse (Sookie Stackhouse #8) After the natural disaster of Hurricane Katrina and the manmade explosion at the vampire summit, everyone human and otherwise is stressed, including Louisiana cocktail waitress Sookie Stackhouse, who is trying to cope with the fact that her boyfriend Quinn has gone missing. It's clear that things are changing whether the weres and vamps of her corner of Louisiana like it or not. And Sookie, Friend to the Pack and blood-bonded to Eric Northman, leader of the local vampire community is caught up in the changes. In the ensuing battles, Sookie faces danger, death, and once more, betrayal by someone she loves. And when the fur has finished flying and the cold blood finished flowing, her world will be forever altered.", "hash": "0d2d95e3-8a34-49a7-a5d6-18a0cc0a445f"}]