[{"title": "Dead and Gone (Sookie Stackhouse #9)", "author": "Charlaine Harris", "pgs": 18, "sum": "Storyline: \nDead and Gone (Sookie Stackhouse #9) Except for Sookie Stackhouse, folks in Bon Temps, Louisiana, know little about vamps-and nothing about weres. Until now. The weres and shifters have finally decided to reveal their existence to the ordinary world. At first all goes well. Then the mutilated body of a were-panther is found near the bar where Sookie works-and she feels compelled to discover who, human or otherwise, did it. But there's a far greater danger threatening Bon Temps. A race of unhuman beings-older, more powerful, and more secretive than vampires or werewolves-is preparing for war. And Sookie finds herself an all-too human pawn in their battle.", "hash": "ca117443-5d77-4c08-a3cd-fca43003ac82"}, {"title": "Dead in the Family (Sookie Stackhouse #10)", "author": "Charlaine Harris", "pgs": 15, "sum": "Storyline: \nDead in the Family (Sookie Stackhouse #10) It's all about family ... Sookie Stackhouse is dealing with a whole host of family problems, ranging from her own kin (a non-human fairy and a telepathic second cousin) demanding a place in her life, to her lover Eric's vampire sire, an ancient being who arrives with Eric's 'brother' in tow at a most inopportune moment. And Sookie's tracking down a distant relation of her ailing neighbour (and ex), Vampire Bill Compton. In addition to the multitude of family issues complicating her life, the werewolf pack of Shreveport has asked Sookie for a special favour, and since Sookie is an obliging young woman, she agrees. But this favour for the wolves has dire results for Sookie, who is still recovering from the trauma of her abduction during the Fairy War.", "hash": "e0198e74-3d0c-4d57-b90f-b1633d13c3e5"}, {"title": "Dead Reckoning (Sookie Stackhouse #11)", "author": "Charlaine Harris", "pgs": 17, "sum": "Storyline: \nDead Reckoning (Sookie Stackhouse #11) With her knack for being in trouble's way, Sookie witnesses the firebombing of Merlotte's, the bar where she works. Since Sam Merlotte is now known to be two-natured, suspicion falls immediately on the anti-shifters in the area. Sookie suspects otherwise, but her attention is divided when she realizes that her lover Eric Northman and his \"child\" Pam are plotting to kill the vampire who is now their master. Gradually, Sookie is drawn into the plot-which is much more complicated than she knows...", "hash": "28a5062f-daab-444c-8996-798cab75f6e1"}, {"title": "Wolfsbane and Mistletoe ", "author": "Charlaine Harris", "pgs": 14, "sum": "Storyline: \nThe editors of \"Many Bloody Returns\" deliver the perfect howl-iday gift, with new tales from Patricia Briggs, Carrie Vaughn, and many more. \"New York Times\" bestselling authors Charlaine Harris, Patricia Briggs, Keri Arthur, and Carrie Vaughn—along with eleven other masters of the genre—offer all-new stories on werewolves and the holidays, a fresh variation on the concept that worked so well with birthdays and vampires in \"Many Bloody Returns.\" The holidays can bring out the beast in anyone. They are particularly hard for lycanthropes. Charlaine Harris and Toni L. P. Kelner have harvested the scariest, funniest and saddest werewolf tales by an outstanding pack of authors, best read by the light of a full moon with a silver bullet close at hand. Whether wolfing down a holiday feast (use your imagination) or craving some hair of the dog on New Year's morning, the werewolves in these frighteningly original stories will surprise, delight, amuse, and scare the pants off readers who love a little wolfsbane with their mistletoe.", "hash": "d6c35d32-4265-49c4-a199-e1763893325d"}, {"title": "Sex and the Single Vampire (Dark Ones #2)", "author": "Katie MacAlister", "pgs": 20, "sum": "Storyline: \nSex and the Single Vampire (Dark Ones, #2) If Allie doesn't find a ghost soon, her short career as a \"Summoner\" with United Psychical Research Association will be a thing of the past, so naturally she is delighted to find what she thinks is the tortured spirit of a gorgeous, naked, wounded man. But the cranky spirit, who looks exactly like the dishy man who has been haunting Allie's dreams, doesn't need her help since he isn't a ghost, but rather Christian Dante, best-selling author of vampire romances and Moravian Dark One. Of course, Allie wants some answers from the arrogant and domineering Christian, but he is more interested in working out the exact nature of their relationship, since fate has chosen Allie as his \"Beloved.\"", "hash": "d373fe38-9eaf-4756-8a81-8c39a6ebb644"}, {"title": "Sex, Lies and Vampires (Dark Ones #3)", "author": "Katie MacAlister", "pgs": 22, "sum": "Storyline: \nSex, Lies and Vampires (Dark Ones #3) As far as she can tell, Nell Harris is either going insane or she is in love. Nell thought she had been summoned to Prague to work on an inscription in a rare fourteenth-century breastplate. Instead, she is immersed in the world of the Moravian Dark Ones (think vampires) when she is swept up in the search for a boy held captive by the demon lord Asmodeus. Although Nell would like nothing better than to use her powers as a \"Charmer\" to help find the missing boy, the last time she dabbled in magic the consequences were dire. Then Nell meets Adrian Tomas. Bound to serve Asmodeus and forced to betray his fellow Dark Ones, Adrian desperately needs Nell to charm away his curse. One look into Adrian's haunted eyes, and Nell discovers she will do just about anything to save the soul of her new beloved.", "hash": "3387942f-2016-4cde-b0da-91bb83e5b81f"}, {"title": "Even Vampires Get the Blues (Dark Ones #4)", "author": "Katie MacAlister", "pgs": 22, "sum": "Storyline: \nEven Vampires Get the Blues (Dark Ones #4) Paen Scott is a Dark One: a vampire without a soul. And his mother is about to lose hers too if Paen can’t repay a debt to a demon by finding a relic known as the Jilin God in five days. Half-elf Samantha Cosse may have gotten kicked out of the Order of Diviners, but she’s still good at finding things, which is why she just opened her own private investigation agency. Paen is one of Sam’s first clients and the only one to set her elf senses tingling, which makes it pretty much impossible to keep their relationship on a professional level. Sam is convinced that she is Paen’s Beloved—the woman who can give him back his soul...whether he wants it or not.", "hash": "14695b0a-35d0-42ad-9fe5-3a1769027d29"}, {"title": "The Last of the Red Hot Vampires (Dark Ones #5)", "author": "Katie MacAlister", "pgs": 24, "sum": "Storyline: \nThe Last of the Red-Hot Vampires (Dark Ones #5) Physicist Portia Harding’s life is grounded in facts. There’s nothing that can’t be explained by logic and science. Until she travels with her best friend to England—and accidentally summons an ethereal Virtue who bequeaths her gift of weather control to Portia… Now Portia’s walking around with a literal cloud over her head—and a heartstoppingly handsome maniac trying to kidnap her. But Theondre North is no run-of-the-mill maniac. He’s a nephilim—the son of a fallen angel—who needs Portia’s help to change his fate. Problem is, Portia’s down-to-earth attitude frustrates beings from both heavenly and hellish realms—and gets Theo turned into a vampire. But at least he has Portia to satisfy his newfound hungers—and possibly save his soul…", "hash": "51a868e4-1fb4-4aa3-9a09-6f51d9994aa4"}, {"title": "Zen and the Art of Vampires (Dark Ones #6)", "author": "Katie MacAlister", "pgs": 20, "sum": "Storyline: \nZen and the Art of Vampires (Dark Ones #6) White picket fences can be dangerous to vampires. Sometimes a woman’s gotta choose… Pia Thomason doesn’t have a typical life, but she wants one. The husband, the kids, the house in the suburbs… With her fortieth birthday looming, she decides to do something drastic, and takes off on a singles’ tour through romantic Europe. But the few guys on the trip leave much to be desired—unlike the two men Pia sees in a small Icelandic town. Handsome, mysterious, and very dangerous… Just the sight of them puts her in a dither. When their paths cross again, Pia knows one thing for certain: Where vampires are concerned, love isn’t the only thing at stake.", "hash": "e75d5be1-6606-4fb3-acd6-388bc802b6b9"}, {"title": "Crouching Vampire, Hidden Fang (Dark Ones #7)", "author": "Katie MacAlister", "pgs": 17, "sum": "Storyline: \nCrouching Vampire, Hidden Fang (Dark Ones #7) For a woman married to the vampire of her nightmares, the honeymoon’s over—and reality bites… Pia’s dream of being married has come true. But her husband is straight out of her nightmares. Pia Thomason is torn between two Dark Ones and feeling like a fool, considering she doesn’t know where either of them are. Alec was no doubt broken-hearted over finding out that Pia was mated to his best friend, Kristoff. And hubby Kristoff believes she has ties to the group trying to destroy his people. So Pia goes back to her humdrum Seattle life determined to forget about Kristoff—but fate has other plans. With Alec missing, something truly evil threatening her ghostly charges, and the vampire community hunting both Kristoff and her for crimes they didn’t commit, Pia realizes that if they’re going to be shackled together for better or worse, she may as well start to enjoy it…", "hash": "4f040ff8-e90d-49cf-a521-6e330e9c087b"}]