[{"title": "The Bronze Horseman (The Bronze Horseman #1)", "author": "Paullina Simons", "pgs": 94, "sum": "Storyline: \nCalled “a Russian Thorn Birds,” The Bronze Horseman by Paullina Simons is a sweeping saga of love and war that has been a monumental bestseller all over the world. The acclaimed author of Tully, Simons has written a stirring tale of devotion, passion, secrets, betray, and sacrifice. “A love story both tender and fierce” (Publishers Weekly ) that “Recalls Dr. Zhivago” (People Magazine), The Bronze Horseman is rich and vivid historical fiction at its finest.", "hash": "1a6c4b4a-a370-488f-8bed-8c00f575b203"}, {"title": "The Edge of Never (The Edge of Never #1)", "author": "J.A. Redmerski", "pgs": 59, "sum": "Storyline: \nTwenty-year-old Camryn Bennett thought she knew exactly where her life was going. But after a wild night at the hottest club in downtown Raleigh, North Carolina, she shocks everyone-including herself-when she decides to leave the only life she's ever known and set out on her own. Grabbing her purse and her cell phone, Camryn boards a Greyhound bus ready to find herself. Instead, she finds Andrew Parrish. Sexy and exciting, Andrew lives life like there is no tomorrow. He persuades Camryn to do things she never thought she would and shows her how to give in to her deepest, most forbidden desires. Soon he becomes the center of her daring new life, pulling love and lust and emotion out of her in ways she never imagined possible. But there is more to Andrew than Camryn realizes. Will his secret push them inseparably together-or destroy them forever?", "hash": "402201e6-e6df-4511-9809-81d84635cf2e"}, {"title": "Born in Fire (Born In Trilogy #1)", "author": "Nora Roberts", "pgs": 90, "sum": "Storyline: \nMargaret Mary, the eldest Concannon sister, is a glass artist with an independent streak as fierce as her volatile temper. Hand-blowing glass is a difficult and exacting art, and while she may produce the delicate and the fragile, Maggie is a strong and opinionated woman, a Clare woman, with all the turbulence of that fascinating west country. One man, Dublin gallery owner Rogan Sweeney, has seen the soul in Maggie’s art, and vows to help her build a career. When he comes to Maggie’s studio, her heart is inflamed by their fierce attraction—and her scarred past is slowly healed by love…", "hash": "40806a88-3aa1-4486-adf3-e50122e33f03"}, {"title": "The Sea of Tranquility ", "author": "Katja Millay", "pgs": 58, "sum": "Storyline: \nI live in a world without magic or miracles. A place where there are no clairvoyants or shapeshifters, no angels or superhuman boys to save you. A place where people die and music disintegrates and things suck. I am pressed so hard against the earth by the weight of reality that some days I wonder how I am still able to lift my feet to walk. Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay. Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space. Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to. The Sea of Tranquility is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances.", "hash": "dc462a0a-1a15-4e34-a538-b81c667a4357"}, {"title": "The Fiery Cross (Outlander #5)", "author": "Diana Gabaldon", "pgs": 252, "sum": "Storyline: \nThe year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.", "hash": "d6b647ef-895a-40a9-bc88-51053b53ad13"}, {"title": "Vacant ", "author": "Evelyn R. Baldwin", "pgs": 18, "sum": "Storyline: \nEthan Parker gets up every day, surviving the only way he knows how - alone. Orphaned as a child and forced into the child welfare system, he knows better than to depend on anyone but himself. He's learned trust is a word used all too often, but rarely earned. Ethan believes that his best chance for maintaining a simple and solitary existence is to live by a simple mantra: Don't get involved. Keep things simple. Take care of yourself! When a young woman moves in next door, Ethan is forced to reevaluate his beliefs. He tries to keep his distance, but his new neighbor's infectious smile and outlook on life leave him struggling with the decision of living the life he knows, or taking a chance on the unexpected. As Ethan develops a relationship with his new neighbor, Emily, he realizes nothing is simple and learns that life is about more than just surviving... it's about living.", "hash": "dd660f1a-c245-48e2-b686-82999dc48aba"}, {"title": "The Silver Linings Playbook ", "author": "Matthew Quick", "pgs": 45, "sum": "Storyline: \nMeet Pat Peoples. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure him a happy ending - the return of his estranged wife, Nikki. (It might not come as a surprise to learn that Pat has spent several years in a mental health facility.) The problem is, Pat's now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he's being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he's being haunted by Kenny G!", "hash": "d2cd212b-0d10-4ed7-8de2-5e4ba565315b"}, {"title": "The Secret of Ella and Micha (The Secret #1)", "author": "Jessica Sorensen", "pgs": 26, "sum": "Storyline: \nA rule-breaker with a fiery attitude, Ella always wore her heart on her sleeve. Then she left everything behind to go to college, where she transformed into someone who follows the rules, keeps everything together, and hides all her problems. Now it's summer break and she has nowhere else to go but home. But once there, Ella fears that everything she's worked so hard to bury might resurface-especially with Micha living right next door. Smart, sexy, and confident, Micha can get under Ella's skin like no one else. He knows everything about her, including her darkest secrets. If he tries to tempt the old Ella to return, he will be impossible to resist. But what Ella doesn't realize is that when she left, she took a piece of Micha's heart with her. Now he's determined to win back the girl he lost, no matter what it takes.", "hash": "4528e491-ee70-438e-afb8-832443e0285f"}, {"title": "Night World : Daughters of Darkness (Night World #2)", "author": "L.J. Smith", "pgs": 17, "sum": "Storyline: \nDaughters of Darkness (Night World Book 2) Mary-Lynnette, 17, loves to watch the stars from her Oregon backyard. Then one day, she thinks she's witnessed a murder through her telescope. She's wrong: it's only three vampire sisters burying their mysteriously-killed aunt. The sisters, Rowan, Kestral, and Jade ran away from their enclave home to live the lives of regular teenagers. However, when their brother Ash is sent to bring the girls back, he falls in love with Mary-Lynnette. But will she accept him because of his lurid vampire past and can a now-repentant Ash convince Mary-Lynnette to let him atone for his former sins and be his soulmate?", "hash": "a1cd4f47-5840-436d-8e74-f1e506642f95"}, {"title": "Night World : Huntress (Night World #7)", "author": "L.J. Smith", "pgs": 18, "sum": "Storyline: \nHuntress (Night World Book 7) Jez Redfern is unique. She's a vampire hunter...who's half vampire. Raised in the Redfern family, the girl with fiery hair and silvery-blue eyes was the undisputed leader of a gang of vampire raiders. Then came the discovery that shattered her life - her mother was a human. Now, Jez hunts her former friends, protecting humans from the Night World. But when Circle Daybreak sends her on a search for one of the legendary Wild Powers, Jez has to rejoin her old gang. They want her back -- especially Morgead, the gorgeous green-eyed vampire who used to be her second-in-command. Jez wants to stay faithful to Hugh Davis, the human she loves. But Morgead swears he's her soulmate and he'll do anything to lure her back to the old ways. With danger and temptation around, Jez finds herself irresistibly drawn to him. And she's afraid that if she tastes blood again, she'll become the evil huntress she once was...", "hash": "c7b0397c-2508-40ca-9f5e-0c4c90e61178"}]