[{"title": "Darker Angels (The Black Sun's Daughter #2)", "author": "M.L.N. Hanover", "pgs": 26, "sum": "Storyline: \nDarker Angels (The Black Sun's Daughter #2) In the battle between good and evil, there's no such thing as a fair fight. When Jayné Heller's uncle Eric died, she inherited a fortune beyond all her expectations -- and a dangerous mission in a world she never knew existed. Reining in demons and supernatural foes is a formidable task, but thankfully Jayné has vast resources and loyal allies to rely on. She'll need both to tackle a bodyswitching serial killer who's taken up residence in New Orleans, a city rich in voodoo lore and dark magic. Working alongside Karen Black, a highly confident and enigmatic ex-FBI agent, Jayné races to track down the demon's next intended host. But the closer she gets, the more convinced she becomes that nothing in this beautiful, wounded city is exactly as it seems. When shocking secrets come to light, and jealousy and betrayal turn trusted friends into adversaries, Jayné will soon come face-to-face with an enemy that knows her all too well, and won't rest until it has destroyed everything she loves most...", "hash": "60ced3d4-e6f2-415b-83a3-29ea74f0059a"}, {"title": "Heart of the Dragon (Atlantis #1)", "author": "Gena Showalter", "pgs": 22, "sum": "Storyline: \nHeart of the Dragon (Atlantis #1) Grace Carlyle's world was about to change . . . Deep in the jungle on the trail of her missing brother, Grace never expected to find a secret world populated by mythological monsters -- nor guarded by a sword-wielding being whose beauty put mortal men to shame. Darius en Kragin belongs to a race of shape-shifting warriors sworn to guard Atlantis and kill all travelers who stray within its boundaries. Yet when Grace stumbles into his realm, he finds himself tempted to betray his centuries-old vow. Now their forbidden love will either bring their worlds together -- or tear them both apart.", "hash": "1b6e7a01-e1c0-4773-9ed7-605a297eae52"}, {"title": "Jewel of Atlantis (Atlantis #2)", "author": "Gena Showalter", "pgs": 30, "sum": "Storyline: \nJewel of Atlantis (Atlantis #2) All Atlantis seeks the Jewel of Dunamis, which legend claims can overcome any enemy. Grayson James, human agent of the ultra-secret Otherworld Bureau of Investigation, has orders to keep it from the wrong hands -- or destroy it. What he doesn't know is that Jewel is a woman, not a stone! But once he meets this precious gem, destroying her is the last thing on his mind . . . Jewel, part goddess, part prophet, is a pawn in Atlantis's constant power struggles. She needs Gray's help to win freedom and uncover the secrets of her mysterious origins. Gray needs her wisdom to navigate monster-ridden Atlantis. But need blossoms into passionate love as they fight demons, dragons, vampires-and a prophecy that says the bond between them could destroy them both.", "hash": "225a152a-c1ed-4ecf-a3a0-f0bb2cc155ef"}, {"title": "The Nymph King (Atlantis #3)", "author": "Gena Showalter", "pgs": 30, "sum": "Storyline: \nThe Nymph King (Atlantis #3) Females young and old, beautiful and plain crave Valerian's touch. None can resist his blatant sensuality and potent allure...until he steals Shaye Holling from a Florida beach and holds her prisoner in his underwater kingdom.The cynical Shaye wants nothing to do with the mighty warlord, but she's inexplicably drawn to him. For underneath the warrior's arrogant beauty lies a complex and powerful man. A man whose caress is like fire...Now Valerian must fight for the privilege of claiming her as his own. Because there's one thing Shaye doesn't know....That when a nymph discovers his true mate, she's his for life.", "hash": "abcc806a-fc48-4bdb-8582-f3274a97fc6e"}, {"title": "The Vampire's Bride (Atlantis #4)", "author": "Gena Showalter", "pgs": 26, "sum": "Storyline: \nThe Vampire's Bride (Atlantis #4) He is Layel, king of the vampires, a master seducer no woman can deny. But since a rogue horde of dragons killed his beloved over two centuries ago, Layel has existed only for vengeance…until he meets Delilah. Wary of love, the beautiful Amazon wants nothing to do with the tormented vampire. Yet there's no denying their consuming desire every time he nears her. Neither trusts the other—nor can they survive alone. For in an impossible game of the gods' devising, they've been trapped on an island, about to face the ultimate challenge: surrender to the passion that will bind them forever…or be doomed to an eternity apart.", "hash": "eb0827cf-1189-44b3-a853-7297dba63bd9"}, {"title": "The Amazon's Curse (Atlantis #5)", "author": "Gena Showalter", "pgs": 8, "sum": "Storyline: \nThe Amazon's Curse (Atlantis #5) Don't miss this brand-new, eBook exclusive tale of Atlantis, Gena Showalter's mythical world of immortals, magic and dark seduction Zane, a fierce vampire warrior, has been enslaved by the Amazons. Nola, a lovely Amazon soldier, has been cursed with invisibility. Now, these two stubborn enemies must overcome the pasts that haunt them and embrace a love that can set them free... \"A world of myth, mayhem and love under the sea \" -- \"New York Times\" bestselling author J.R. Ward on \"The Nymph King\"", "hash": "202ecd00-19ad-4f3e-a4d3-97c197b18912"}, {"title": "The Darkest Fire (Lords of the Underworld  #0.5)", "author": "Gena Showalter", "pgs": 20, "sum": "Storyline: \nThe Darkest Fire (Lords of the Underworld 0.5) He is the guardian of hell, more monster than man. She is the goddess of oppression, more angel than woman. Together they will enter the flames to battle a dangerous horde of demon lords -- and discover a passion unlike any other.... Don't miss this sizzling prequel to Gena Showalter's breathtaking new paranormal series, The Lords of the Underworld Though they carry an eternal curse, the Lords of the Underworld are irresistibly seductive -- and unimaginably powerful....", "hash": "28ddabb8-876f-402c-a8a5-1c8ca2c76d18"}, {"title": "The Darkest Night (Lords of the Underworld  #1)", "author": "Gena Showalter", "pgs": 25, "sum": "Storyline: \nThe Darkest Night (Lords of the Underworld #1) All her life, Ashlyn Darrow has been tormented by voices from the past. To end the nightmare, she has come to Budapest seeking help from men rumored to have supernatural abilities, not knowing she'll be swept into the arms of Maddox, their most dangerous member -- a man trapped in a hell of his own. Neither can resist the instant hunger than calms their torments... and ignites an irresistible passion. But every heated touch and burning kiss will edge them closer to destruction -- and a soul-shattering test of love... Though they carry an eternal curse, the Lords of the Underworld are irresistibly seductive -- and unimaginably powerful...", "hash": "00b51380-adde-4d9b-8f82-5849150b3ea0"}, {"title": "The Darkest Kiss (Lords of the Underworld  #2)", "author": "Gena Showalter", "pgs": 24, "sum": "Storyline: \nThe Darkest Kiss (Lords of the Underworld #2) She has tempted many men...but never found her equal. Until now. Though she has lived for centuries, Anya, goddess of Anarchy, has never known pleasure. Until Lucien, the incarnation of death--a warrior eternally doomed to take souls to the hereafter. He draws her like no other. And Anya will risk anything to have him. But when the merciless Lord of the Underworld is ordered by the gods to claim Anya herself, their uncontrollable attraction becomes an anguished pursuit. Now they must defeat the unconquerable forces that control them, before their thirst for one another demands a sacrifice of love beyond imagining...", "hash": "4f79632e-48b2-447b-8c58-b898a64176f9"}, {"title": "The Darkest Pleasure (Lords of the Underworld  #3)", "author": "Gena Showalter", "pgs": 27, "sum": "Storyline: \nThe Darkest Pleasure (Lords of the Underworld #3) Reyes is a man possessed. Bound by the demon of Pain, he is forbidden to know pleasure. Yet he craves a mortal woman, Danika Ford, more than breath and will do anything to claim her--even defy the gods. Danika is on the run. For months she's eluded the Lords of the Underworld, immortal warriors who won't rest until she and her family have been destroyed. But her dreams are haunted by Reyes, the warrior whose searing touch she can't forget. Yet a future together could mean death to all they both hold dear....", "hash": "1a660763-afba-4419-85bb-9691425a1f69"}]