[{"title": "Playing With Fire (Tales of an Extraordinary Girl #1)", "author": "Gena Showalter", "pgs": 23, "sum": "Storyline: \nPlaying with Fire (Tales of an Extraordinary Girl #1) Earth, Wind & Fire aren't just a band anymore... Used to be my greatest achievement was holding a job more than three days. Now suddenly I can shoot fireballs, chill your drink, or blow-dry your hair at fifty paces with a blink of my eye! It all started when this crazy scientist dropped something in my Grande Mocha Latte. Of course I got wicked sick. Next morning I'm waking up with this total hottie bending over me. He tells me 1)his name's Rome Masters, 2)he's a government agent and 3)I can control the four elements with a thought. He seems even less pleased by my (apparently irreversible) transformation than I am . . . Because now he'll have to kill me.", "hash": "e0ef1d05-58c2-4c49-9b9d-b0da3d75d8ab"}, {"title": "Twice as Hot (Tales of an Extraordinary Girl #2)", "author": "Gena Showalter", "pgs": 30, "sum": "Storyline: \nTwice as Hot (Tales of an Extraordinary Girl #2) Belle Jamison is finally starting to feel like a normal girl again. Her job as a paranormal investigator is going well, she's learned to control her supernatural abilities (mostly) and she's just gotten engaged to Rome Masters, the ultra-sexy operative who once tried to neutralize her! But planning a wedding is never easy, especially when the bride keeps accidentally torching her dress, the groom returns from a dangerous mission with selective memory loss and the man responsible now wants Belle for himself. With Rome's ex determined to win him back and a new band of supervillains on the horizon, it will take all Belle's powers—plus a little help from her trusty empath sidekick—to save the day, salvage the wedding and prove that true love really does conquer all.", "hash": "4d0bdaea-4071-4c6b-a55e-2bb5536354a1"}, {"title": "Animal Instincts ", "author": "Gena Showalter", "pgs": 21, "sum": "Storyline: \nUnleashing your inner tigress isn't easy when you're a doormat by nature Still, after escaping a wretched marriage to a cheating SOB, Dallas party planner Naomi Delacroix isn't about to let another man sweet-talk her into sheathing her protective claws. Not even hunky millionaire Royce Powell, who's hired her to arrange his mother's surprise party. Even if he does make her purr like a kitten with one heated glance... Royce claims he's been in love with her ever since she threw a party for one of his friends six months ago. But if that's true, why is this incredibly eligible CEO currently taking applications for a wife? Despite herself, Naomi is tempted to fill one out. But can her inner tigress believe a man might change his stripes?", "hash": "64c0314d-0d40-4621-8953-fa19b8ab6b43"}, {"title": "Heart of the Wolf (Heart of the Wolf #1)", "author": "Terry Spear", "pgs": 56, "sum": "Storyline: \nHeart of the Wolf (Heart of the Wolf #1) Their forbidden love may get them both killed. Bella is a red werewolf, sole survivor of the fire that killed her entire pack. Devlyn is a beta male werewolf in a pack of grays. Forced to flee her adopted gray pack when the alpha male becomes a vicious threat, she struggles to live as a lone wolf, until Devlyn, the gray male who rescued her as a pup, comes to bring her home. When a local red werewolf goes on a killing spree, Bella and Devlyn must flee the murderer, the police and their vengeful pack leader. With the full moon rising, and her heat upon her, Bella can't resist the pull to her destined mate, even if means Devlyn will have to face the wicked alpha male in a fight to the death...", "hash": "81a055b3-5963-4fd9-a9de-9369c915bb5e"}, {"title": "Destiny of the Wolf (Heart of the Wolf #2)", "author": "Terry Spear", "pgs": 62, "sum": "Storyline: \nDestiny of the Wolf (Heart of the Wolf #2) The chemistry crackles off the page. -Publishers Weekly Terry Spear further develops her world of the lupus garou with a romantic tale that unfolds inside the dynamics of pack behavior.", "hash": "c8e458bb-a735-498a-af76-f2ddef82852b"}, {"title": "To Tempt the Wolf (Heart of the Wolf #3)", "author": "Terry Spear", "pgs": 62, "sum": "Storyline: \nTo Tempt the Wolf (Heart of the Wolf #3) In this third in the series, wildlife photographer Tessa Anderson must prove her brother innocent of murder charges. But when she discovers a gorgeous naked man barely alive on her beach, she's got a new world of troubles to deal with, not least of which is how he affects her with just a look, a touch, or a whispered word. Hunter Greymore is a lupus garou, a grey werewolf. Hoping to keep a low profile at Tessa's cabin on the coast, he's drawn into her life\u0097and into her bed. His animal instincts war with his human half, but in the end, the only thing he can do about this fascinating, adorable woman is to leave her forever \u0097unless she becomes one of them.", "hash": "1ee3ad48-f70f-4b36-9053-ba4b48bd9a9e"}, {"title": "Legend of the White Wolf (Heart of the Wolf #4)", "author": "Terry Spear", "pgs": 54, "sum": "Storyline: \nLegend of the White Wolf (Heart of the Wolf #4) In this fourth in Spear's series, Private Eye Cameron MacPherson and Faith O'Mallery are both on quests that lead them into the world of magical wolves… Cameron arrives in the Canadian Arctic to search for his partners in his P.I. business who are late returning from a hunting trip. Faith is there to discover what her father had seen in the same area years earlier that had made him lose touch with reality\u0097man-wolves, he called them. The two tumble into an icy world of enemies bent on destroying the lupus garou kind. As they turn into lupus garou themselves, and bond with the pack that only they can rescue from destruction, Cameron and Faith find their soul mates in each other.", "hash": "cfdb79f5-2d43-417a-a3e6-de5bf109410a"}, {"title": "Seduced by the Wolf (Heart of the Wolf #5)", "author": "Terry Spear", "pgs": 59, "sum": "Storyline: \nSeduced by the Wolf (Heart of the Wolf #5) Praise for Terry Spear: \"The vulpine couple's chemistry crackles off the page, but the real strength... lies in Spear's depiction of pack power dynamics as well as in the details of human-wolf interaction. Her wolf world feels at once palpable and even plausible.\" -Publishers Weekly \"Chilling suspense and sizzling romance... The dark, sexy alpha hero will capture you-body, mind, and soul.\" -Nicole North, author of Devil in a Kilt \"If action, romance, and suspense are what you are looking for in a story, then look no further.\" -Night Owl Romance His first priority is to protect his pack... Werewolf pack leader Leidolf Wildhaven has just taken over a demoralized pack. With rogue wolves on the loose causing havoc and the authorities from the zoo suddenly zeroing in on the local wolf population, the last thing he needs in his territory is a do-gooder female, no matter how beautiful and enticing she is... She'll do anything to help wolves... Biologist Cassie Roux has dedicated her life to protecting wolves in the wild. On a desperate mission to help a she-wolf with newborn pups, the last thing Cassie needs right now is a nosy and entirely too attractive werewolf pack leader trying to track her down... With rogue wolves and hunters threatening at every turn, Cassie and Leidolf may find their attraction the most dangerous force of all...", "hash": "35d84ff5-dcba-4287-9430-741027f7a33b"}, {"title": "Wolf Fever (Heart of the Wolf #6)", "author": "Terry Spear", "pgs": 60, "sum": "Storyline: \nWolf Fever (Heart of the Wolf #6) Fate turned nurse Carol Woods into a wolf, but she refuses to let being a lupus garou define her life. Ordered by her pack leader to find a mate and commit to shifting, there is only one gray wolf that catches Carol's interest; but Chaz McKinley makes it very clear that unless she's willing to accept what she is, he wants nothing to do with her. When a virus outbreak leaves local pack members trapped in their wolf form, will Chaz and Carol learn to trust each other before it's too late for the pack and their one chance at true love?", "hash": "b4a9527f-8be9-4104-881b-40d758098387"}, {"title": "Heart of the Highland Wolf (Heart of the Wolf #7)", "author": "Terry Spear", "pgs": 57, "sum": "Storyline: \nHeart of the Highland Wolf (Heart of the Wolf #7) It's a matter of pride... Modern day werewolf laird Ian MacNeill reluctantly allows a film production company to use his castle, but he knows his secretive clan has a big problem when a beautiful red werewolf female who insists she's working on the film keeps showing up in the wrong places. And a matter of pleasure... Julia Wildthorn is not who she says she is-she's sneaking into Argent Castle to steal an ancient relic for her grandfather and to do research for her next werewolf romance novel. When she catches a glimpse of Ian, she realizes he's the perfect hero.", "hash": "d2a1a471-7dcf-4215-9b7e-5dea962bb784"}]