[{"title": "Dreaming of the Wolf (Heart of the Wolf #8)", "author": "Terry Spear", "pgs": 53, "sum": "Storyline: \nDreaming of the Wolf (Heart of the Wolf #8) A FIERCE HUNTER... Alicia Greiston is a no-nonsense bounty hunter determined to bring a ring of mobsters to justice. Her dogged pursuit of the crime family has forced her to avoid relationships— any man would only become a target for retribution. Luckily, Jake Silver is more than a man, and his instincts are telling him to stop at nothing to protect her. AN ANIMAL PASSION... However, the mob isn't entirely human either, and soon Alicia must flee for her life. When Alicia and Jake's passion begins to spill over into their dreams, Jake learns he will have to do more than defend her— he'll have to show his mate the way of the wolf. Praise for Wolf Forever: \"Riveting and entertaining...makes one want to devour the rest of Terry Spear's books.\" —Fresh Fiction \"Sensual, passionate, and very well written...another winnter of a story.\" —The Long and Short of It \"A must read...the chemistry is sizzling.\" —RomFan Reviews \"Full of nail-biting suspense, sexy scenes, and plenty of hot alphas...Spear knows how to keep her readers riveted.\" —Love Passion Romance", "hash": "a409708d-132a-48f6-ade4-3b311a1909ae"}, {"title": "A SEAL in Wolf's Clothing (Heart of the Wolf #9)", "author": "Terry Spear", "pgs": 49, "sum": "Storyline: \nA SEAL in Wolf's Clothing (Heart of the Wolf #9) Meara Greymere is in charge of the cabin rentals on the rugged Oregon coastline, so her brother and his mate could take a delayed honeymoon. But while Hunter is away, the she-wolf intends to play—she just has to convince the right alpha male to rent one of the cabins, and she’ll take it from there. But when Finn Emerson arrives with every intention of pretending to be her lover, she's not going to take this lying down. She knows he'll tell her brother what she's up to and put an end to her game. Finn Emerson is a Navy SEAL, formerly one of Hunter Greymere’s team members, and now he's trying to track down a gray wolf, who's already made an attempt on one of their team member's lives. Finn believes Hunter will be targeted next, only to discover Hunter is off with his mate on a honeymoon, and he fears Hunter’s sister is in grave danger. But the SEAL soon learns protecting the unpredictable sexy she-wolf is a mission and a half and protecting her isn’t all he wants to do.", "hash": "0790656e-f763-4142-b05f-7762221260d9"}, {"title": "A Howl for a Highlander (Heart of the Wolf #10)", "author": "Terry Spear", "pgs": 49, "sum": "Storyline: \nA Howl for a Highlander (Heart of the Wolf #10) Tracking the former stockbroker and gray wolf who made off with his family's fortune to the Grand Cayman Islands, Highland wolf Duncan MacNeill, while searching for the traitorous alphas, is unable to control his powerful attraction to a beautiful botanis.", "hash": "60c60d10-f157-4322-a766-aa04446cb3ae"}, {"title": "A Highland Werewolf Wedding (Heart of the Wolf #11)", "author": "Terry Spear", "pgs": 50, "sum": "Storyline: \nA Highland Werewolf Wedding (Heart of the Wolf #11) Elaine Hawthorn is a gray American werewolf, currently out of work, and on a mission to share in a family treasure. When she arrives in Scotland, she nearly has a head-on collision with one hot, kilt-garbed Highlander, and runs him off the road. Werewolf laird Cearnach MacNeill isn't happy Elaine ruined his car, but he quickly becomes her protector after a misunderstanding lands her right in the middle of two feuding clans. Now he's out to ensure that this sexy female wolf gets her fair share of her clan's treasure. He knows he should leave well enough alone, but it's too late to leave his heart out of it.", "hash": "266b9156-9a4b-47a6-a65f-56ca818197b4"}, {"title": "A SEAL Wolf Christmas (Heart of the Wolf #12)", "author": "Terry Spear", "pgs": 41, "sum": "Storyline: \nA SEAL Wolf Christmas (Heart of the Wolf #12) Can an Alpha wolf who's met his match... Navy SEAL Bjornolf Jorgenson has had tough missions before, but going undercover with feisty gray wolf Anna Johnson could top the list. She drives him crazy—in more ways than one. Now he has to investigate a murder, supervise a wild teenage wolf—and handle Christmas with Anna. Survive the Holidays with her? For Anna, the only thing worse than staging the perfect family Christmas is having to do it with Bjornolf posing as her husband. Anna is a serious undercover operative who isn't afraid of a fight, even with a hunky SEAL shifter. With a killer on the loose, Anna just wants to focus on their mission, but the one thing she can't fight is her sizzling chemistry with Bjornolf.", "hash": "8f1e116f-1637-4103-81ac-c98cca344ee5"}, {"title": "The Becoming (Anna Strong Chronicles #1)", "author": "Jeanne C. Stein", "pgs": 43, "sum": "Storyline: \nThe Becoming (Anna Strong Chronicles #1) My name is Anna Strong. I am a vampire. How I became one is the reason for this story. I tell it all the way it happened. It may not be what you expect. She's a bounty hunter--tough, beautiful, and trained for the unexpected. Until the night she's attacked and left closer to death than she can imagine. She awakens to an indoctrination into a dark new world where vampires walk among us. But this time, a tight grip on a .38 won't stop what she's hunting for. Existing between the worlds of the living and the dead, Anna is torn by her love for two very different men. Max, a DEA agent, all too human, and vulnerable. And Avery, a Night Watcher who's joined Anna in pursuit of the rogue vampire who changed her life that terrifying night. Now, as her two worlds collide, fate plunges Anna into the ultimate battle between good and evil where survival is not just for the living...", "hash": "fd99aa7f-9dab-49a5-9ed6-dd5915b24d89"}, {"title": "Blood Drive (Anna Strong Chronicles #2)", "author": "Jeanne C. Stein", "pgs": 47, "sum": "Storyline: \nBlood Drive (Anna Strong Chronicles #2) Anna Strong was a tough-as-nails bounty hunter, until the night she was attacked-and changed forever. Now a vampire, Anna discovers that her long-dead brother may have had a daughter-and the girl's in serious trouble. There are some very dangerous people after her, but they're about to learn that to a bounty hunter with an unnatural thirst for blood, even the deadliest human predators are easy prey.", "hash": "170813c9-1faf-4d95-a315-8651a0882029"}, {"title": "The Watcher (Anna Strong Chronicles #3)", "author": "Jeanne C. Stein", "pgs": 66, "sum": "Storyline: \nThe Watcher (Anna Strong Chronicles #3) Newly-made vampire Anna has become a Watcher-one of the supernatural world's enforcers- even as she fights to control her vampiric rage. When a series of very dangerous events threatens to draw out her unstable powers, her Watcher mentor sends her away for her own safety. But if there's one thing Anna has always been able to find, it's trouble.", "hash": "3da2c773-49d3-4c69-ab5d-147c91c86613"}, {"title": "Chosen (Anna Strong Chronicles #6)", "author": "Jeanne C. Stein", "pgs": 51, "sum": "Storyline: \nChosen (Anna Strong Chronicles #6) Anna Strong's primitive vampire instincts are getting harder to control. And a new enemy wants to take advantage of that fact, for Anna has been chosen to shape the destiny of all vampires-and all humans.", "hash": "05145f04-d53c-44ee-9e45-cc78014d4eb5"}, {"title": "Haunted (Anna Strong Chronicles #8)", "author": "Jeanne C. Stein", "pgs": 22, "sum": "Storyline: \nHaunted (Anna Strong Chronicles #8) Anna Strong—kick-ass bounty hunter and vampire—has made some enemies in her time. But it’s not just her old foes she should be worried about… Anna’s shape-shifting friend Culebra finally opens up to her about his life before he owned Beso de la Muerte, a bar catering to supernatural clientele. As if summoned by the conversation, Culebra’s past stumbles into his bar in the form of an old buddy cashing in a favor. Soon Anna, Culebra and her ex, DEA agent Max, find themselves deep in Mexico, dealing with drug cartel infighting, old vendettas and missing girls. Mexico just may prove to be Anna’s best match yet…", "hash": "65c444e0-8c4d-4aea-b252-d8ca7f39ecf2"}]