[{"title": "Cloud City (Anna Strong Chronicles #9)", "author": "Jeanne C. Stein", "pgs": 21, "sum": "Storyline: \nCloud City (Anna Strong Chronicles #8.5) Vampire Anna Strong never expected to find the witch Sophie Deveraux on her doorstep, asking for a favor. But Sophie needs help, even if it's from the vampire who killed her sister. Anna, driven both by guilt and obligation, agrees to help Sophie and her psychic alter-ego Jonathan. So begins an adventure that takes them to Leadville, Colorado. All too soon, Anna wonders whether Sophie is truly a victim of circumstance . . . or the author of a clever plot to rid herself of her unwanted psychic twin.", "hash": "1f254b4a-1d8d-4a88-bd4d-3b263d9406dd"}, {"title": "Blood Bond (Anna Strong Chronicles #9)", "author": "Jeanne C. Stein", "pgs": 36, "sum": "Storyline: \nBlood Bond (Anna Strong Chronicles #9) As a vampire, Anna Strong has an immortal life…but now she’s running out of time. Anna’s relationship with shape-shifter Daniel Frey has given her hope for a future with him and his son—especially when Frey proposes… But just when Anna starts to think her life couldn’t be better, she must fly to France to be at the side of her dying mother. There she learns that not every vampire accepts her Chosen One status. And one such vamp is about to go rogue—by leading his followers in a fight to usurp humanity…", "hash": "1c1ba9de-7ceb-4e6a-aeae-0064e028a25c"}, {"title": "Angel's Blood (Guild Hunter #1)", "author": "Nalini Singh", "pgs": 42, "sum": "Storyline: \nAngels' Blood (Guild Hunter #1) Vampire hunter Elena Deveraux knows she is the best- but she does not know if even she is good enough for this job. Hired by the dangerously beautiful archangel Raphael, a being so lethal that no mortal wants his attention, Elena knows failure is not an option—even if the task is impossible. Because this time, it's not a wayward vamp she has to track. It's an archangel gone bad. The job will put Elena in the midst of a killing spree like no other—and pull her to the razor's edge of passion. Even if the hunt does not destroy her, succumbing to Raphael’s seductive touch just might. For when archangels play, mortals break.", "hash": "b0fc1875-8c42-4598-b180-441f78008013"}, {"title": "Archangel's Legion (Guild Hunter #6)", "author": "Nalini Singh", "pgs": 69, "sum": "Storyline: \nArchangel's Legion (Guild Hunter #6) Angels are falling from the sky in New York, struck down by a vicious, unknown force. Vampires are dying impossibly of disease. Guild hunter Elena Deveraux and the Archangel Raphael must discover the source of the wave of death before it engulfs their city and their people, leaving New York a ruin and Raphael’s Tower under siege by enemy archangels. Yet even as they fight desperately to save the city, an even darker force is stirring, its chill eyes trained on New York…and on Raphael. Rivers of crimson and nightmares given flesh, the world will never again be the same…", "hash": "323258f8-955a-4df6-ab51-77c070e6424e"}, {"title": "A Quick Bite (Argeneau #1)", "author": "Lynsay Sands", "pgs": 24, "sum": "Storyline: \nA Quick Bite (Argeneau #1) That hot guy tied to Lissianna Argeneau's bed? He's not dessert—he's the main course! Lissianna has been spending her centuries pining for Mr. Right, not just a quick snack, and this sexy guy she finds in her bed looks like he might be a candidate. But there's another, more pressing issue: her tendency to faint at the sight of blood . . . an especially annoying quirk for a vampire. Of course it doesn't hurt that this man has a delicious-looking neck. What kind of cold-blooded vampire woman could resist a bite of that? Dr. Gregory Hewitt recovers from the shock of waking up in a stranger's bedroom pretty quickly—once he sees a gorgeous woman about to treat him to a wild night of passion. But is it possible for the good doctor to find true love with a vampire vixen, or will he be just a good meal? That's a question Dr. Greg might be willing to sink his teeth into . . . if he can just get Lissianna to bite.", "hash": "4472925c-47cd-4f6f-947b-3fcba316a63d"}, {"title": "Love Bites (Argeneau #2)", "author": "Lynsay Sands", "pgs": 20, "sum": "Storyline: \nLove Bites (Argeneau #2) Etienne Argeneau's three hundred years of bachelorhood are at an end. He can only \"turn\" one human in his lifetime, and most of his kind reserved that power for creating a life mate. He has to save Rachel Garrett. He doesn't know her very well, but the beautiful coroner had saved his life. To save hers he would make her immortal. Rachel Garrett awakes surprised. All she'd wanted was to get off the night shift at the morgue; now here she is staggering to her feet naked and in a strange place. Then she sees the man of her dreams emerging from his...coffin? She just hopes he tastes as good as he looks.", "hash": "aa353071-9103-42e1-95b3-4235bfe47ff6"}, {"title": "Single White Vampire (Argeneau #3)", "author": "Lynsay Sands", "pgs": 21, "sum": "Storyline: \nSingle White Vampire (Argeneau #3) SWM - \"Lucern.\" Successful biographer of family, books recently categorized as \"paranormal romance.\" Something of a recluse. Hates crowds, aggressive women. Doesn't like sunbathing, garlicky dinners or religious symbols. Likes old-fashioned values; spicy Mexican dishes; warm, nice-smelling neck; and plump red lips. Stronger than ten men and can vanish in the blink of an eye. Currently unaware he's seeking a woman to share eternity. SWF - \"Kate C. Leever.\" Newest editor of Romance at Roundhouse Publishing. Perky, fun. Has recently discovered a legacy author just dying to be broken out. In fact, her career could take off from it. (The tall, dark, handsome writer just needs to be taken to several romance conventions and introduced to his fans . . . and stopped from acting so strange in public.) Dislikes \"difficult, rude, obnoxious, pig-headed writers.\" Currently she's met the man of her wildest dreams. OH, DEAR.", "hash": "933f1d15-bb5f-4d3b-94f2-3664d03d889d"}, {"title": "Tall, Dark & Hungry (Argeneau #4)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nTall, Dark & Hungry (Argeneau #4) It bites: New York hotels cost an arm and a leg, and Terri has flown from England to help plan her cousin’s wedding. The new in-laws offered lodging. But they’re a weird bunch -- and it isn’t just that they’re Canadian! There is the sometimes-chipper-sometimes-silent Lucern, and the wacky stage-actor Vincent: she can’t imagine Broadway casting a hungrier singing-and-dancing Dracula. And then there is Bastien. Just looking into his eyes, Terri has to admit she’s falling for someone even taller, darker, and hungrier. She’s feeling a mite peckish herself. And if she stays with him, those bloodsucking hotel owners won’t get her!", "hash": "63b2bc6d-bd45-4237-8cd1-98180b613e9a"}, {"title": "A Bite to Remember (Argeneau #5)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nA Bite to Remember (Argeneau #5) Rule #1: Never get involved with someone who won't be there for you when the sun comes up. Once bitten, twice shy, and sexy PI Jackie Morrisey wasn't going there again. Vincent Argeneau may be the hottest guy she's ever met, living or dead, but she's here to stop a killer from turning this vampire into dust, not to jump into bed with him. Rule #2: Never kiss a vampire . . . it can be a pain in the neck. Okay, so Vincent's had four hundred years to perfect his kissing skills, and he does look rather tempting when he runs around the house shirtless. He's also charming, protective . . . did we mention he can kiss? Jackie needs to be on her guard, or else she'll have to come up with a new rule: If you're going to fall in love with a vampire, make sure it's a bite to remember.", "hash": "c75fedae-419b-4de0-a748-50dc409e2dbd"}, {"title": "Bite Me If You Can (Argeneau #6)", "author": "Lynsay Sands", "pgs": 20, "sum": "Storyline: \nBite Me If You Can (Argeneau #6) The \"New York Times\" bestselling author of \"A Quick Bite\" and \"A Bite to Remember\" continues her popular vampire series starring the Argeneau family. RClever, steamy, deliciously wicked.S--Kate MacAlister. Original. One minute Leigh is walking home in the early hours of the morning, and the next a vampire is sinking his teeth into her neck. Turns out it was a rogue vampire marked for termination, but it does Leigh little good because the damage's already been done. She's become one of them. Lucian Argeneau, hunter of rogue vampires, has been alive for over two thousand years, and there's very little to excite him anymore. Food has become tasteless, sex is ordinary. Then Leigh drops into his life. Suddenly he finds himself craving coffee ... and imagining the sassy brunette atop the black satin sheets on his nice big bed. It's Lucian's job now to enlighten Leigh on the inner workings of being immortal ... and tutoring her is igniting a fire in him that hasn't burned in centuries. But until they stop a renegade bloodsucker from destroying the human race, passion will have to wait!", "hash": "30223e82-6687-4538-be69-452396fd4558"}]