[{"title": "The Accidental Vampire (Argeneau #7)", "author": "Lynsay Sands", "pgs": 21, "sum": "Storyline: \nThe Accidental Vampire (Argeneau #7) FATE GAVE HER FANGS... Ever since an accident turned her into a knockout vamp, Elvi Black's been catching her z's in a coffin, staying out of the sun, and giving up garlic. She knows there's more to being undead than what she saw in Dracula, but she can't very well ask her mortal friends about proper biting etiquette. But when her neighbors placed a personal ad for her in the local paper, she never imagined she'd meet Victor Argeneau, a vampire who could have his pick of any woman - dead or alive. HE'LL SHOW HER HOW TO USE THEM... Rich, powerful, and drop—dead gorgeous, Victor's the perfect man for a novice neck—biter like Elvi. He's willing to teach her everything he knows, but he'll have to do it fast. Someone's out to put a stake through her new vamp life, and only Victor can keep her safe - and satisfied - for all eternity.", "hash": "8939496a-9ae2-425a-9c0e-fba1b4e9b228"}, {"title": "Vampire, Interrupted (Argeneau #9)", "author": "Lynsay Sands", "pgs": 20, "sum": "Storyline: \nVampire, Interrupted (Argeneau #9) After seven hundred years of life, Marguerite Argeneau finally has a career. Well, the start of one, anyway. She's training to be a private investigator, and her first assignment is to find an immortal's mother. It seemed simple enough, until Marguerite wakes up one evening to find herself at the wrong end of a sword. Now she realizes she's in way over her head. Julius Notte wants to protect Marguerite, and not because someone just tried to take her head off. She doesn't know it yet, but she's his lifemate and he's determined to woo her. It's been over five hundred years since he last courted a woman, but surely the techniques haven't changed. Now if only he can keep her alive—so to speak—so they can have that happily-ever-after.", "hash": "31b21419-ad7b-4f4e-8295-50e076eda46e"}, {"title": "The Rogue Hunter (Argeneau #10)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nThe Rogue Hunter(Argeneau, #10; Rogue Hunter, #1) Samantha Willan is a workaholic lawyer. She's grateful for some rest and relaxation in cottage country, and after a recent breakup she wants to stay as far away from romance as possible. Then she meets her irresistible new neighbor. There's something strange and mysterious about his eyes. Is it just her imagination, or are they locked on her neck? Garrett Mortimer is a rogue hunter. His last assignment united Lucian Argeneau with his lifemate, and Mortimer is hoping this one will be less... adventurous. He's here to track down a reported rogue, but fun in the sun is every bloodsucker's nightmare. Worse, he can't seem to get his mind off Samantha, especially when he spies her skinny-dipping in the lake. After eight hundred years as a bachelor, is he ready to turn a volatile attraction into a lasting love affair?", "hash": "55ffe515-a5c6-4165-a438-2741ddbad70e"}, {"title": "The Immortal Hunter (Argeneau #11)", "author": "Lynsay Sands", "pgs": 20, "sum": "Storyline: \nThe Immortal Hunter(Argeneau, #11; Rogue Hunter, #2) Even vampires need a vacation. But Decker Argeneau's ends abruptly when he's asked to help hunt the group of rogue vampires targeting mortals -- one that might include a defector in his own family. Before he can worry about that, though, he's got to rescue the latest victim. It's all part of the job, including taking a bullet for a beautiful doctor. Dr. Danielle McGill doesn't know if she can trust the man who just saved her life. There are too many questions, such as what is the secret organization he says he's part of, and why do his wounds hardly bleed? However, with her sister in the hands of some dangerous men, she doesn't have much choice but to trust him. Except now Decker's talking about life mates and awakening a passion that's taking Dani beyond anything she's ever known. Being undead may not be half-bad... especially if it means spending forever with a man who would love her with his mind, body, and immortal soul.", "hash": "6ad546f9-9cc6-46dc-b262-cb348d9a2317"}, {"title": "The Renegade Hunter (Argeneau #12)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nThe Renegade Hunter(Argeneau, #12; Rogue Hunter, #3) Nicholas Argeneau was once a successful hunter who went after rogue vampires who break the immortal law. Except no one has mentioned his name in the last fifty years, not since he turned into a rogue himself. But once a hunter, always a hunter. When Nicholas sees a bloodthirsty sucker terrifying a woman, it’s second nature for him to come to her rescue. He had no idea he would also want to kiss her senseless… One minute Josephine Willan is taking in a breath of fresh air, and the next sharp fangs are heading straight for her neck! Luckily a gorgeous stranger saves her life . . . and gets locked up for his troubles. Can a man who kisses so lovingly and passionately really have committed the crime he’s accused of? Jo isn’t so sure…and she’s determined to prove that this renegade hunter is worth fighting for.", "hash": "06a7b896-5432-4224-8191-25784b2dee04"}, {"title": "Bitten by Cupid (Argeneau #13)", "author": "Lynsay Sands", "pgs": 11, "sum": "Storyline: \n\"Vampire Valentine\" - Bitten by Cupid (Argeneau #12.5) Tiny had just raised his hand to knock on the door when a shriek rang out from the other side. The sound immediately had him dropping the bags of blood he carried to charge into the room. He'd taken several steps inside, his eyes quickly scanning the situation, before he came to a confused halt. He'd expected to find that one or more of Leonius's no-fangers had snuck into the church and was attacking someone, or, at the very least, a mouse that had startled someone, but there was neither. The room was filled with women, most of them in white, all peering at him with wide, startled eyes.", "hash": "0154b457-eeb7-4f51-83a7-482cdd65b02e"}, {"title": "Born to Bite (Argeneau #13)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nBorn to Bite (Argeneau #13) But with all three of his late wives meeting unfortunate and untimely ends, is this sexy immortal a lover or a murderer? That's what Eshe d'Aureus intends to find out. As an enforcer, it's her job to bring rogue vampires to justice, even if the rogue in question makes her blood race red hot. Armand knew she was trouble the moment Eshe roared into town on her motorcycle, clad in tight black leather. She claims she's hiding from dangerous fiends, though he suspects something more. But after three wives who've all had trouble remaining, well, undead, Armand is reluctant to open his heart again. Then strange accidents start to happen, each deadlier than the last, and Armand realizes he may not have much time to prove he's a lover, not a slayer.", "hash": "e2a1a738-a4ad-40f3-8946-fb6bb576bb52"}, {"title": "Hungry for You (Argeneau #14)", "author": "Lynsay Sands", "pgs": 18, "sum": "Storyline: \nHungry for You (Argeneau #14) This vampire has been alone for far too long . . . As one of the most ancient in the Argeneau clan, Cale Valens has given up on finding a life mate. His friends and family, however, have not. In fact, they believe they've finally found his perfect match. Getting them together, however, requires one little white lie . . . Alexandra Willan is in a panic. Her restaurant is due to open in two weeks, but her chef just walked out. Then a highly recommended replacement arrives, an impossibly handsome culinary genius who sends electric tingles racing through her body . . . Except he can't cook. In fact, Cale hasn't eaten real food in two thousand years. Yet he's determined to prove to Alex his prowess in the kitchen . . . and elsewhere. Because never has he hungered so for any mortal woman. And not just for a taste of her, but for the whole delicious feast!", "hash": "db4939e7-6eec-447a-acbe-868d633f661e"}, {"title": "The Reluctant Vampire (Argeneau #15)", "author": "Lynsay Sands", "pgs": 18, "sum": "Storyline: \nThe Reluctant Vampire (Argeneau #15) Has this immortal finally met her match? Rogue hunter Drina Argenis (from the Spanish side of the Argeneau family) has been many things in her years as an immortal, but bodyguard/babysitter to a teenage vampire is something new. There's an incentive, however: the other vampsitter, Harper Stoyan, may be Drina's life mate. Trouble is, having just lost a life mate, Harper is resigned to being alone. He's completely unprepared when sexy and unpredictable Drina bursts into his life to reignite his passions. Can Drina, with a little matchmaking help from their teen charge, tempt this reluctant vampire to take a chance? Or will a dangerous, unseen renegade kill Drina and Harper's one chance at happiness?", "hash": "76b85ea3-5713-4772-989f-c1872a389b8b"}, {"title": "The Bite Before Christmas (Argeneau #15.5)", "author": "Lynsay Sands", "pgs": 32, "sum": "Storyline: \nThe Bite Before Christmas (Argeneau #15.5) In Lynsay Sands' \"The Gift,\" Katricia Argeneau knows grey-eyed cop Teddy Brunswick is her life mate. She just needs to convince him they belong together, and being snowbound in a secluded cabin will make this a Christmas neither will forget. It's \"Home for the Holidays\" in Jeaniene Frost's Night Huntress series. Cat and Bones may long to wrap presents and set up a tree, but this Christmas, an evil vampire and long-buried family secrets will threaten to take a bite out of their holiday cheer.", "hash": "27ea3ac7-3447-4a52-a7cb-06a5c9fef917"}]