[{"title": "Under a Vampire Moon (Argeneau #16)", "author": "Lynsay Sands", "pgs": 21, "sum": "Storyline: \nUnder a Vampire Moon (Argeneau #16) When Vampires Go On Vacation . . . Escaping a horrible marriage, Carolyn Connor has no desire to think about men—a vow she's determined to keep while on vacation in St. Lucia. She'll take the Caribbean sun and sea and plenty of tropical drinks with those cute umbrellas poolside, thank you. She absolutely does not need male company, no matter how tan and rock-hard his body may be. Easy enough, but then Carolyn meets the charming Marguerite Argeneau, who is infamous among her family for her matchmaking prowess . . . Christian Notte has well known the power of finding a life mate. He's seen enough of his Argeneau relatives taken down for the count, but he never imagined he'd let himself fall in love—until he meets the enthralling, charmingly skittish, and oh-so-mortal Carolyn. But how will he reveal what he is and still convince this once-bitten mortal to trust him with her heart . . . and her forever?", "hash": "caf183ad-d783-405d-9db3-51c1cb941a84"}, {"title": "The Lady is a Vamp (Argeneau #17)", "author": "Lynsay Sands", "pgs": 19, "sum": "Storyline: \nThe Lady is a Vamp (Argeneau #17) One late night leads to... Kidnapped When Jeanne Louise Argeneau left work, she never thought she'd end up tied down by a good-looking mortal. More attracted than annoyed, she quickly realizes there is more to her abductor than meets the eye. One desperate act leads to... Love? Paul Jones has need of a vampire, and only Jeanne Louise will do. He just has to convince this beauty of a Vamp to help him...never imagining that he would fall in love. But with the immortal world's answer to law enforcement hunting them, their time together is running out...and Paul and Jeanne Louise will need to risk everything to spend an eternity together.", "hash": "fd346cdf-de3c-4e76-a503-20754054a84a"}, {"title": "Immortal Ever After (Argeneau #18)", "author": "Lynsay Sands", "pgs": 43, "sum": "Storyline: \nImmortal Ever After (Argeneau #18) A kiss doesn’t mean eternity . . . Valerie Moyer doesn’t believe in vampires—until she is kidnapped by a fanged psychopath! After escaping her bloodthirsty captor, she’s through with creatures of the night. Until she finds herself under the protection of the darkly handsome Anders. Not only is she expected to accept that Anders is immortal, but also that she is the woman destined to be his life mate! . . . Or does it? Anders felt a connection to Valerie from the moment he cradled her bruised body in his arms. But before he claims her, he must destroy the vampire who almost stole her from him forever. His job would be easier if Valerie didn’t fight him every step of the way. Still, Anders loves a challenge, and the green-eyed beauty is worth fighting for!", "hash": "eb3654d9-d68a-4921-bee7-fd08cc4026bd"}, {"title": "One Lucky Vampire (Argeneau #19)", "author": "Lynsay Sands", "pgs": 41, "sum": "Storyline: \nOne Lucky Vampire (Argeneau #19) Luck be a vampire tonight . . . When Nicole Phillips agreed to hire a housekeeper, she pictured someone a little frumpy and almost certainly female. Instead, she gets gorgeous, unmistakably male Jake Colson. The man is proving indispensable in the kitchen—and everywhere else. Except Jake might not be a mortal man at all. . . . and every night Who wouldn't want to be a tall, dark, powerful vampire? Jake, for one. He's barely had time to adjust to his new state before he's roped into a family favor. Still, secretly playing bodyguard to sweet, sexy Nicole is turning out to be the wildest ride of his life. First he'll put a stop to whoever's targeting her. Then he'll prove that this kind of love, and luck, happens only once in an eternity", "hash": "2b1cbed0-3006-44ef-919f-712708ac0d5d"}, {"title": "Blood Cross (Jane Yellowrock #2)", "author": "Faith Hunter", "pgs": 25, "sum": "Storyline: \nBlood Cross (Jane Yellowrock #2) The vampire council has hired skinwalker Jane Yellowrock to hunt and kill one of their own who has broken sacred ancient rules — but Jane quickly realizes that in a community that is thousands of years old, loyalties run deep... With the help of her witch best friend and local vigilantes, Jane finds herself caught between bitter rivalries — and closer than ever to the secret origin of the entire vampire race. But in a city of old grudges and dark magic, Jane will have to fight to protect both sides, even if no one will protect her.", "hash": "3f4f8b18-6d79-4de2-aacb-3331122e4b85"}, {"title": "Death's Rival (Jane Yellowrock #5)", "author": "Faith Hunter", "pgs": 22, "sum": "Storyline: \nDeath's Rival (Jane Yellowrock #5) Jane Yellowrock is a shapeshifting skinwalker you don’t want to cross—especially if you’re one of the undead… For a vampire killer like Jane, having Leo Pellisier as a boss took some getting used to. But now, someone is out to take his place as Master Vampire of the city of New Orleans, and is not afraid to go through Jane to do it. After an attack that’s tantamount to a war declaration, Leo knows his rival is both powerful and vicious, but Leo’s not about to run scared. After all, he has Jane. But then, a plague strikes, one that takes down vampires and makes their masters easy prey. Now, to uncover the identity of the vamp who wants Leo’s territory, and to find the cause of the vamp-plague, Jane will have to go to extremes…and maybe even to war.", "hash": "80d329ff-ff32-4d85-bbdf-957b08034c46"}, {"title": "Blood Doll (Vampire Agápe #3)", "author": "Georgia Cates", "pgs": 30, "sum": "Storyline: \nBlood Doll (The Vampire Agápe #3) Solomon Alexander is a tortured soul. Since being forced to drink from Avery Ferrand, a blood jewel, all he can do is think of her. He’s addicted to this girl he helped rescue but not in a way anyone would anticipate. He lies to everyone around him–denying his desire for her–so he may prevent his family from learning the truth. He loves her. But the feeling isn’t mutual. Avery fears and despises Sol so he makes the ultimate sacrifice–to walk away from everything. Including Avery. He wants to give her the peace she deserves after the horror she’s experienced so he couldn’t be more shocked by her proposal after he announces his departure. Will he do the right thing and proceed with his plan or will he give in to his desires and accept her offer?", "hash": "53d71c84-6821-4cfc-8d0f-266997d18277"}, {"title": "Magic Bites (Kate Daniels #1)", "author": "Ilona Andrews", "pgs": 11, "sum": "Storyline: \nMagic Bites (Kate Daniels #1) When the magic is up, rogue mages cast their spells and monsters appear, while guns refuse to fire and cars fail to start. But then technology returns, and the magic recedes as unpredictably as it arose, leaving all kinds of paranormal problems in its wake. Kate Daniels is a down-on-her-luck mercenary who makes her living cleaning up these magical problems. But when Kate's guardian is murdered, her quest for justice draws her into a power struggle between two strong factions within Atlanta's magic circles. The Masters of the Dead, necromancers who can control vampires, and the Pack, a paramilitary clan of shapechangers, blame each other for a series of bizarre killings—and the death of Kate's guardian may be part of the same mystery. Pressured by both sides to find the killer, Kate realizes she's way out of her league—but she wouldn't have it any other way…", "hash": "4ec549b3-918b-43f7-93dd-91f0a29e4f00"}, {"title": "Magic Burns (Kate Daniels #2)", "author": "Ilona Andrews", "pgs": 26, "sum": "Storyline: \nMagic Burns (Kate Daniels #2) As a mercenary who cleans up after magic gone wrong, Kate Daniels has seen her share of occupational hazards. Normally, waves of paranormal energy ebb and flow across Atlanta like a tide. But once every seven years, a flare comes, a time when magic runs rampant. Now Kate’s going to have to deal with problems on a much bigger scale: a divine one. When Kate sets out to retrieve a set of stolen maps for the Pack, Atlanta’s paramilitary clan of shapeshifters, she quickly realizes much more at stake. During a flare, gods and goddesses can manifest – and battle for power. The stolen maps are only the opening gambit in an epic tug-of-war between two gods hoping for rebirth. And if Kate can’t stop the cataclysmic showdown, the city may not survive…", "hash": "c0431a61-52e6-4a49-858e-ad22560dccbc"}, {"title": "Magic Strikes (Kate Daniels #3)", "author": "Ilona Andrews", "pgs": 30, "sum": "Storyline: \nMagic Strikes (Kate Daniels #3) Drafted into working for the Order of Merciful Aid, mercenary Kate Daniels has more paranormal problems than she knows what to do with these days. And in Atlanta, where magic comes and goes like the tide, that’s saying a lot. But when Kate's werewolf friend Derek is discovered nearly dead, she must confront her greatest challenge yet. As her investigation leads her to the Midnight Games—an invitation only, no holds barred, ultimate preternatural fighting tournament—she and Curran, the Lord of the Beasts, uncover a dark plot that may forever alter the face of Atlanta's shapeshifting community…", "hash": "e5acf11a-41ca-4b71-b1ed-17ef9ec8c032"}]