[{"title": "Magic Bleeds (Kate Daniels #4)", "author": "Ilona Andrews", "pgs": 29, "sum": "Storyline: \nMagic Bleeds (Kate Daniels #4) Atlanta would be a nice place to live, if it weren't for the magic. When the magic is up, rogue mages cast their spells and monsters appear, while guns refuse to fire and cars fail to start. But then technology returns, and the magic recedes as unpredictably as it arose. Kate Daniels works for the Order of Knights of Merciful Aid, officially as a liaison with the mercenary guild. Unofficially, she cleans up the paranormal problems no one else wants to handle - especially if they involve Atlanta's shapeshifting community. When she's called in to investigate a fight at the Steel Horse, a bar on the border between the territories of the shapeshifters and the necromancers, Kate quickly discovers that there's a new player in town. One who's been around for thousands of years - and who rode to war at the side of Kate's father. This foe may be too much even for Kate and Curran, the Beast Lord, to handle. Because this time Kate will be taking on family.", "hash": "505bfc9f-e61c-4f94-b0d7-765b05cbbf65"}, {"title": "Magic Slays (Kate Daniels #5)", "author": "Ilona Andrews", "pgs": 25, "sum": "Storyline: \nMagic Slays (Kate Daniels #5) Plagued by a war between magic and technology, Atlanta has never been so deadly. Good thing Kate Daniels is on the job. Kate Daniels may have quit the Order of Merciful Aid, but she’s still knee-deep in paranormal problems. Or she would be if she could get someone to hire her. Starting her own business has been more challenging than she thought it would be—now that the Order is disparaging her good name, and many potential clients are afraid of getting on the bad side of the Beast Lord, who just happens to be Kate’s mate. So when Atlanta’s premier Master of the Dead calls to ask for help with a vampire on the loose, Kate leaps at the chance of some paying work. Turns out this is not an isolated incident, and Kate needs to get to the bottom of it—fast, or the city and everyone dear to her might pay the ultimate price . . .", "hash": "9b81e7b3-888c-4eec-9694-f4bc0a3746ae"}, {"title": "Magic Rises (Kate Daniels #6)", "author": "Ilona Andrews", "pgs": 19, "sum": "Storyline: \nMagic Rises (Kate Daniels #6) Mercenary Kate Daniels and her mate, Curran, the Beast Lord, are struggling to solve a heartbreaking crisis. Unable to control their beasts, many of the Pack’s shapeshifting children fail to survive to adulthood. While there is a medicine that can help, the secret to its making is closely guarded by the European packs, and there’s little available in Atlanta. Kate can’t bear to watch innocents suffer, but the solution she and Curran have found threatens to be even more painful. The European shapeshifters who once outmaneuvered the Beast Lord have asked him to arbitrate a dispute—and they’ll pay him in medicine. With the young people’s survival and the Pack’s future at stake, Kate and Curran know they must accept the offer—but they have little doubt that they’re heading straight into a trap…", "hash": "ef442621-6415-48bc-9da8-75378d916007"}, {"title": "Magic Graves (Kate Daniels #0.5)", "author": "Ilona Andrews", "pgs": 29, "sum": "Storyline: \nMagic Graves (Kate Daniels 0.5) New York Times bestselling authors Jeaniene Frost and Ilona Andrews bring you two short stories of paranormal. Jeaniene Frost's story, One for the Money, features vampires Cat and Bones trying to protect a spoiled heiress with a price on her head and an undead hitman on her trail. Previously published in Death's Excellent Vacation. Also includes the first three chapters from Jeaniene's story in The Bite Before Christmas anthology, as well as a sneak peek at ONCE BURNED, the first novel in the new Night Prince series. Ilona Andrews' story, A Questionable Client, is a prequel to her award-winning Kate Daniels series. In a world beset by magic waves, Kate Daniels works as a mercenary. She is tired, hungry, and there is foul-smelling blood on her boots. All she wants to do is to go home, but when Mercenary Guild offers her a job she can't refuse, she finds herself protecting a man against Russian wizards. Previously published in Dark and Stormy Knights. Also includes first two chapters of FATE'S EDGE, book 3 in the Edge series, and first two chapters of Magic Grieves, a Kate Daniels novella.", "hash": "c21ff7d7-aa7a-4d65-8caa-25c01a9d7b96"}, {"title": "Magic Mourns (Kate Daniels #3.5)", "author": "Ilona Andrews", "pgs": 15, "sum": "Storyline: \nMagic Mourns (Kate Daniels #3.5) Andrea Nash of the Order of Knights of Merciful Aid - with an assist from her friend, Kate Daniels - tries to figure out why the giant three-headed dog who guards the gates of Hades is sniffing around Atlanta.", "hash": "b4ad708a-77ea-4eec-9833-7346eead88a1"}, {"title": "Magic Dreams (Kate Daniels #4.5)", "author": "Ilona Andrews", "pgs": 17, "sum": "Storyline: \nMagic Dreams (Kate Daniels #4.5) Magic Dreams originally appeared in the anthology Hexed. From New York Times bestselling author Ilona Andrews comes a tale of darkness, desire, and werecats. Alpha Pack leader Jim Shrapshire has always been the strong, silent type. But something has come over him--a magic force currently residing in one of the Pack's headquarters. Were-tigress Dali Harimau has always wished she could get Jim's attention--but now he needs her help. Stricken with a magic-sickness, Jim needs Dali's flair for magic. And to save him, she must challenge a powerful, dark being to a battle of wits. Includes an excerpt of Ilona Andrews's upcoming novel in the world of Kate Daniels, Gunmetal Magic, available in August 2012.", "hash": "a3f88cf8-f20e-4c94-a0fb-e0f181ac6557"}, {"title": "Magic Gifts (Kate Daniels #5.4)", "author": "Ilona Andrews", "pgs": 20, "sum": "Storyline: \nMagic Gifts (Kate Daniels #5.4) A dinner date after a hard day at work sounds heavenly. Of course, when that date is between the Beast Lord and Kate Daniels, things don’t go as planned. Before you know it, undead are running amok, heads are being chopped off, lawyers are deployed and used with extereme prejudice, and drunk vikings are calling people out.", "hash": "2cbb9c8b-853f-4cd5-8d73-59117f959f85"}, {"title": "Gunmetal Magic (Kate Daniels #5.5)", "author": "Ilona Andrews", "pgs": 84, "sum": "Storyline: \nGunmetal Magic (Kate Daniels #5.5) The New York Times bestselling Kate Daniels novels have been hailed as “top-notch urban fantasy” (Monsters and Critics). Now, Ilona Andrews delves deeper into Kate’s world, and reveals its untold stories… After being kicked out of the Order of the Knights of Merciful Aid, Andrea’s whole existence is in shambles. She tries to put herself back together by working for Cutting Edge, a small investigative firm owned by her best friend. When several shapeshifters working for Raphael Medrano—the male alpha of the Clan Bouda, and Andrea’s former lover—die unexpectedly at a dig site, Andrea is assigned to investigate. Now she must work with Raphael as her search for the killer leads into the secret underbelly of supernatural Atlanta. And dealing with her feelings for him might have to take a back seat to saving the world…", "hash": "71f9afa6-f0fe-46b0-bba7-cbf9ab9c93f7"}, {"title": "Angels' Judgment (Guild Hunter #0.5)", "author": "Nalini Singh", "pgs": 14, "sum": "Storyline: \nAngels' Judgment (Guild Hunter 0.5) Warrior angels, vampire hunters, and angels gone bad heat up this altogether sizzling paranormal alternate universe, from the bestselling author Nalini Singh. Angels' Judgementis the compelling story of passion, love and danger in the Guild Hunter world. Sara and Deacon are Guild Hunters, their life's work is catching and capturing - or killing - rogue angels. It's dangerous work and sometimes life or death decisions must be made in a moment. And when a judgement has to be made, should love be allowed to get in the way . . . ? This is a compelling, sexy addition to the Guild Hunter universe.", "hash": "f949dd91-4e6b-45f7-9cb4-71369dae05f1"}, {"title": "Angel's Wolf (Guild Hunter #3.5)", "author": "Nalini Singh", "pgs": 16, "sum": "Storyline: \nAngel's Wolf (Guild Hunter #3.5) Warrior angels, vampire hunters, and angels gone bad heat up this altogether sizzling paranormal alternate universe, from the bestselling author Nalini Singh. Angels' Wolf is a tale of flirtation and danger set in the Guild Hunter world. Noel has been promoted, but in the Guild Hunter world that's not always as positive as it sounds. And now that he's working with the beautiful, dangerous, seductive Nimra there are a whole host of new risks he has to contend with . . . Nimra is drawn to the mysterious Noel, sent to her by an angel, defiant and intense and oh-so-intriguing. Is their an alliance to be forged between them, or is it a matter of time before one of them becomes the others prey . . .", "hash": "ce55823c-0703-49f7-ad3b-139875f4c464"}]