[{"title": "Alphas: Origins (Guild Hunter #4)", "author": "Ilona Andrews", "pgs": 22, "sum": "Storyline: \nAlphas: Origins - Angels of Darkness (Guild Hunter #3.5) A woman is kidnapped into a world divided by a superhuman civil war. As the captive of an irresistibly dangerous male, she has two choices: submit and become a pawn, or take hold of her own destiny.", "hash": "0496a4d5-a1ee-4814-9b53-093b85403b04"}, {"title": "Sunrise at Sunset (Sunset Vampire #1)", "author": "Jaz Primo", "pgs": 14, "sum": "Storyline: \nSunrise at Sunset (Sunset Vampire #1) “We vampires are focused and tend to shape our own realities.” My name is Katrina Rawlings, and I am a vampire. I declare that with neither pride nor ego. I am simply nature’s most dangerous predator. On occasion, it’s a very valuable quality. It helped me protect Caleb Taylor one day when he was very young. But that single, traumatic day is behind him now; wiped from his memory, or so I hope. Caleb has finally matured into a rather striking young man, and believe me, I like what I see. I’ll readily admit that there are issues for us to confront and overcome, though a sense of mutual commitment isn’t one of them. I’m feeling hopeful for our future together, in fact. But an adversary from my past has returned to haunt me, and she’s trying to get back at me through Caleb. That was her first...and last...mistake. I’ll protect my Caleb at all costs, and I’ll make her regret the day she was born. So, I suppose that I’m not just a vampire. I’m about to become someone’s worst nightmare!", "hash": "0059206a-2ad7-4099-89e3-c1e262616ea1"}, {"title": "A Bloody London Sunset (Sunset Vampire #2)", "author": "Jaz Primo", "pgs": 10, "sum": "Storyline: \nA Bloody London Sunset (Sunset Vampire #2) The eagerly anticipated sequel to Sunrise at Sunset has finally arrived. Katrina Rawlings is a vampire who has finally rediscovered happiness for the first time in centuries. But unwanted complications erupt with a vengeance. Decisions of necessity combined with dark memories from a forgotten past threaten her relationship with the love of her life. When a sacrifice must be made, can she endure her decision? Caleb Taylor's life is finally back on track. He has rebounded from a near mortal injury, both physically and emotionally. Yet, his reality is shaken by the suggestion of a betrayal of trust from the woman he loves. Can the power of love overcome the power of a lie? Paige Turner is a century old vampire who fearlessly revels in a simple existence pursuing blood, dancing, and sex. Simple needs, and all met in the same manner: hot, fast, and without regrets. But a spontaneous visit leads to heartfelt sacrifice, and unexpected complications strike fear to the core of her soul. Will she survive the revelations?", "hash": "9d8678fc-0b97-4504-85f1-c9bed0373806"}, {"title": "Summit at Sunset (Sunset Vampire #3)", "author": "Jaz Primo", "pgs": 11, "sum": "Storyline: \nSummit at Sunset (Sunset Vampire #3) The third, and most exciting, novel in the Sunset Vampire Series has finally arrived! Powerful vampire Katrina Rawlings and her human mate, Caleb Taylor, are once more drawn into dangerous circumstances. Representatives of the most powerful and influential vampires from around the world converge upon a scenic mountain retreat located in Slovenia's Upper Bohinj Valley for a summit of historic proportion. Mystery leads to treachery, and events quickly spiral out of control. With the fates of both vampires and humans in jeopardy, Katrina desperately struggles to reconcile the balance of worldwide vampire power against honoring her commitment to the love of her life. Unwilling to be rendered helpless, Caleb initiates a desperate gamble that leads to a mortal decision. Meanwhile, the sexy and sassy vampire, Paige Turner, spearheads her own mission involving both surprising revelations of heart and grave circumstances for those around her. In Summit at Sunset, unlikely alliances will be sought, eternal bonds of friendship will be tested, unrequited love will be unleashed, blood will be shed, and one pivotal person's fate will collide with destiny.", "hash": "1a185e63-3dfa-4ae7-8b20-f60da61536e0"}, {"title": "On the Edge (The Edge #1)", "author": "Ilona Andrews", "pgs": 26, "sum": "Storyline: \nOn the Edge (The Edge #1) Rose Drayton lives on the Edge, between the world of the Broken (where people drive cars, shop at Wal-Mart, and magic is a fairy tale) and the Weird (where blueblood aristocrats rule, changelings roam, and the strength of your magic can change your destiny). Only Edgers like Rose can easily travel from one world to the next, but they never truly belong in either. Rose thought if she practiced her magic, she could build a better life for herself. But things didn’t turn out how she planned, and now she works a minimum wage, off the books job in the Broken just to survive. Then Declan Camarine, a blueblood noble straight out of the deepest part of the Weird, comes into her life, determined to have her (and her power). But when a terrible danger invades the Edge from the Weird, a flood of creatures hungry for magic, Declan and Rose must work together to destroy them—or they’ll devour the Edge and everyone in it.", "hash": "a34a2782-5c1b-446a-9c36-240e7ee7eaa1"}, {"title": "Bayou Moon (The Edge #2)", "author": "Ilona Andrews", "pgs": 31, "sum": "Storyline: \nBayou Moon (The Edge #2) The Edge lies between worlds, on the border between the Broken, where people shop at Walmart and magic is a fairytale–and the Weird, where blueblood aristocrats rule, changelings roam, and the strength of your magic can change your destiny… Cerise Mar and her unruly clan are cash poor but land rich, claiming a large swathe of the Mire, the Edge swamplands between the state of Louisiana and the Weird. When her parents vanish, her clan’s long-time rivals are suspect number one. But all is not as it seems. Two nations of the Weird are waging a cold war fought by feint and espionage, and their conflict is about to spill over into the Edge—and Cerise’s life . William, a changeling soldier who left behind the politics of the Weird, has been forced back into service to track down a rival nation’s spymaster. When William’s and Cerise’s missions lead them to cross paths, sparks fly—but they’ll have to work together if they want to succeed…and survive.", "hash": "1ec3aca0-edca-42e5-ba30-0a007c02dd61"}, {"title": "Fate's Edge (The Edge #3)", "author": "Ilona Andrews", "pgs": 17, "sum": "Storyline: \nFate's Edge (The Edge #3) Audrey Callahan left behind her life in the Edge, and she's determined to stay on the straight and narrow. But when her brother gets into hot water, the former thief takes on one last heist and finds herself matching wits with a jack of all trades... Kaldar Mar-a gambler, lawyer, thief, and spy-expects his latest assignment tracking down a stolen item to be a piece of cake, until Audrey shows up. But when the item falls into the hands of a lethal criminal, Kaldar realizes that in order to finish the job, he's going to need Audrey's help...", "hash": "a4287767-a688-4740-aa68-ecfbf7ede1f9"}, {"title": "Steel's Edge (The Edge #4)", "author": "Ilona Andrews", "pgs": 71, "sum": "Storyline: \nSteel's Edge (The Edge #4) Charlotte de Ney is as noble as they come, a blueblood straight out of the Weird. But even though she possesses rare magical healing abilities, her life has brought her nothing but pain. After her marriage crumbles, she flees to the Edge to build a new home for herself. Until Richard Mar is brought to her for treatment, and Charlotte’s life is turned upside down once again. Richard is a swordsman without peer, future head of his large and rambunctious Edger clan—and he’s on a clandestine quest to wipe out slavers trafficking humans in the Weird. So when his presence leads his very dangerous enemies to Charlotte, she vows to help Richard destroy them. The slavers’ operation, however, goes deeper than Richard knows, and even working together, Charlotte and Richard may not survive...", "hash": "a5172ea5-46fa-4523-910b-ca7e35cd2098"}, {"title": "Grace of Small Magics ", "author": "Ilona Andrews", "pgs": 8, "sum": "Storyline: \nA woman must repay her family's debt to a shapeshifting magician. Originally published as part of the anthology The Mammoth Book of Paranormal Romance.", "hash": "e65b93fe-a187-4818-8140-2db93ee1b266"}, {"title": "Of Swine and Roses ", "author": "Ilona Andrews", "pgs": 4, "sum": "Storyline: \nA young adult short story about a girl, a pig, some magic, and the worst date ever. Chad Thurman is a thug, who carries brass knuckles in both pockets and lays magic traps for intruders into “his” neighborhood. The last thing Alena Kornov wants to do is to go on the date with him. But when her family pressures her, she can’t say no. Now the ice-cream is absent, the pig is running for its life, and we won’t even mention the dead guy…", "hash": "28e32cc2-871e-4d88-a36b-cf554f0ed35a"}]