[{"title": "Curran, Vol. I (Curran POV #1)", "author": "Ilona Andrews", "pgs": 5, "sum": "Storyline: \nCurran, Vol. I (Curran POV #1) Not short story, novella, or standalone, but collection of scenes written by Gordon Andrews as a companion to our Kate Daniels series of books. These scenes illustrate the point of view of Curran, the Beast Lord of Atlanta and are provided in gratitude to our readers for all of their support.", "hash": "67962812-f768-40af-bae2-0b37c786ef72"}, {"title": "Fathers and Sons (Curran POV #2)", "author": "Ilona Andrews", "pgs": 4, "sum": "Storyline: \nCurran, Vol. II: Fathers and Sons (Curran POV #2) The second volume of Curran POV takes place after the events of MAGIC BLEEDS. Infuriated by Kate’s treatment at the hands of the Pack, the Beast Lord demands an explanation. When words fail, claws and fangs must do the talking.", "hash": "8b3a005b-9d9f-453e-88de-063253196ea0"}, {"title": "Slave to Sensation (Psy-Changeling #1)", "author": "Nalini Singh", "pgs": 53, "sum": "Storyline: \nSlave to Sensation (Psy-Changeling #1) THE HOT NEW NAME IN PARANORMAL ROMANCE. Nalini Singh dives into a world torn apart by a powerful race with phenomenal powers of the mind-and none of the heart. In a world that denies emotions, where the ruling Psy punish any sign of desire, Sascha Duncan must conceal the feelings that brand her as flawed. To reveal them would be to sentence herself to the horror of \"rehabilitation\" - the complete psychic erasure of everything she ever was... Both human and animal, Lucas Hunter is a changeling hungry for the very sensations the Psy disdain. After centuries of uneasy coexistence, these two races are now on the verge of war over the brutal murders of several changeling women. Lucas is determined to find the Psy killer who butchered his packmate, and Sascha is his ticket into their closely guarded society. But he soon discovers that this ice-cold Psy is very capable of passion - and that the animal in him is fascinated by her. Caught between their conflicting worlds, Lucas and Sascha must remain bound to their identities - or sacrifice everything for a taste of darkest temptation...", "hash": "e55421df-f126-4f7c-87b6-7cccb01e53fa"}, {"title": "Visions of Heat (Psy-Changeling #2)", "author": "Nalini Singh", "pgs": 54, "sum": "Storyline: \nVisions of Heat (Psy-Changeling #2) Used to cold silence, Faith NightStar is suddenly being tormented by dark visions of blood and murder. A bad sign for anyone, but worse for Faith, an F-Psy with the highly sought after ability to predict the future. Then the visions show her something even more dangerous - aching need...exquisite pleasure. But so powerful is her sight, so fragile the state of her mind, that the very emotions she yearns to embrace could be the end of her. Changeling Vaughn D'Angelo can take the form of either man or jaguar, but it is his animal side that is overwhelmingly drawn to Faith. The jaguar's instinct is to claim this woman it finds so utterly fascinating and the man has no argument. But while Vaughn craves sensation and hungers to pleasure Faith in every way, desire is a danger that could snap the last threads of her sanity. And there are Psy who need Faith's sight for their own purposes. They must keep her silenced - and keep her from Vaughn.", "hash": "359d5854-9325-4a9b-8311-34abf397aa94"}, {"title": "Caressed By Ice (Psy-Changeling #3)", "author": "Nalini Singh", "pgs": 61, "sum": "Storyline: \nCaressed By Ice (Psy-Changeling #3) Nalini Singh explores new heights of sensuality, returning to the world of the Psy - where two people who know evil intimately must unlock the good within their icy hearts... As an Arrow, an elite soldier in the Psy Council ranks, Judd Lauren was forced to do terrible things in the name of his people. Now he is a defector, and his dark abilities have made him the most deadly of assassins - cold, pitiless, unfeeling. Until he meets Brenna... Brenna Shane Kincaid was an innocent before she was abducted - and had her mind violated - by a serial killer. Her sense of evil runs so deep, she fears she could become a killer herself. Then the first dead body is found, victim of a familiar madness. Judd is her only hope, yet her sensual changeling side rebels against the inhuman chill of his personality, even as desire explodes between them. Shocking and raw, their passion is a danger that threatens not only their hearts, but their very lives...", "hash": "63983f64-2ed7-45c2-851b-73fecc290ae2"}, {"title": "Mine to Possess (Psy-Changeling #4)", "author": "Nalini Singh", "pgs": 60, "sum": "Storyline: \nMine to Possess (Psy-Changeling #4) Clay Bennett is a powerful DarkRiver sentinel, but he grew up in the slums with his human mother, never knowing his changeling father. As a young boy without the bonds of Pack, he tried to stifle his animal nature. He failed...and committed the most extreme act of violence, killing a man and losing his best friend, Talin, in the bloody aftermath. Everything good in him died the day he was told that she, too, was dead. Talin McKade barely survived a childhood drenched in bloodshed and terror. Now a new nightmare is stalking her life--the street children she works to protect are disappearing and turning up dead. Determined to keep them safe, she unlocks the darkest secret in her heart and returns to ask the help of the strongest man she knows... Clay lost Talin once. He will not let her go again, his hunger to possess her, a clawing need born of the leopard within. As they race to save the innocent, Clay and Talin must face the violent truths of their past...or lose everything that ever mattered.", "hash": "7c173404-4ef7-46c8-b957-e18d2c9e9f3a"}, {"title": "Hostage to Pleasure (Psy-Changeling #5)", "author": "Nalini Singh", "pgs": 60, "sum": "Storyline: \nHostage to Pleasure (Psy-Changeling #5) Separated from her son and forced to create a neural implant that will mean the effective enslavement of her psychically gifted race, Ashaya Aleine is the perfect Psy--cool, calm, emotionless...at least on the surface. Inside, she's fighting a desperate battle to save her son and escape the vicious cold of the PsyNet. Yet when escape comes, it leads not to safety, but to the lethal danger of a sniper's embrace. DarkRiver sniper Dorian Christensen lost his sister to a Psy killer. Though he lacks the changeling ability to shift into animal form, his leopard lives within. And that leopard's rage at the brutal loss is a clawing darkness that hungers for vengeance. Falling for a Psy has never been on Dorian's agenda. But charged with protecting Ashaya and her son, he discovers that passion has a way of changing the rules...", "hash": "4952117f-1543-477e-9f76-369e6ce929f9"}, {"title": "Branded by Fire (Psy-Changeling #6)", "author": "Nalini Singh", "pgs": 57, "sum": "Storyline: \nBranded by Fire (Psy-Changeling #6) Though DarkRiver sentinel Mercy is feeling the pressure to mate, she savagely resists when Riley Kincaid, a lieutenant from the SnowDancer pack, tries to possess her. The problem is not simply that he pushes her buttons; the problem is that he’s a wolf, she’s a cat, and they’re both used to being on top. But when a brilliant changeling researcher is kidnapped from DarkRiver territory, Mercy and Riley must work together to track the young man—before his shadowy captors decide he’s no longer useful. Along the way, the two dominants may find that submitting to one another uncovers not just a deadly conspiracy, but a passion so raw that it’ll leave them both branded by fire…", "hash": "21736273-e685-4669-b237-898628bd7f60"}, {"title": "Blaze of Memory (Psy-Changeling #7)", "author": "Nalini Singh", "pgs": 57, "sum": "Storyline: \nBlaze of Memory (Psy-Changeling #7) A woman without a past becomes the pawn of the man who controls her future... Dev Santos discovers her unconscious and battered, with no memory of who she is. All she knows is that she's dangerous. Charged with protecting his people's most vulnerable secrets, Dev is duty-bound to eliminate all threats. It's a task he's never hesitated to complete...until he finds himself drawn to a woman who might prove to be the enemy's most insidious weapon yet. Stripped of her memories by a shadowy oppressor and programmed to carry out cold-blooded murder, Katya Haas is fighting desperately for her sanity. Her only hope is Dev. But how can she expect to gain the trust of a man who could very well be her next target? For in this game, one must die...", "hash": "d6e5002d-dc94-4e0d-b521-3e57b6af8447"}, {"title": "Bonds of Justice (Psy-Changeling #8)", "author": "Nalini Singh", "pgs": 59, "sum": "Storyline: \nBonds of Justice (Psy-Changeling #8) Max Shannon is a good cop, one of the best in New York Enforcement. Born with a natural shield that protects him against Psy mental invasions, he knows he has little chance of advancement within the Psy-dominated power structure. The last case he expects to be assigned is that of a murderer targeting a Psy Councilor’s closest advisors. And the last woman he expects to compel him in the most sensual of ways is a Psy on the verge of a catastrophic mental fracture… Sophia Russo is a Justice-Psy, cursed with the ability to retrieve memories from men and women so twisted even veteran cops keep their distance. Appointed as Max’s liaison with the Psy, she finds herself fascinated by this human, her frozen heart threatening to thaw with forbidden emotion. But, her mind filled with other people’s nightmares, other people’s evil, she’s standing on the border between sanity and a silken darkness that urges her to take justice into her own hands, to become judge, jury…and executioner…", "hash": "4717c858-f077-43ba-8a40-acd271aa92d0"}]