[{"title": "Play of Passion (Psy-Changeling #9)", "author": "Nalini Singh", "pgs": 55, "sum": "Storyline: \nPlay of Passion (Psy-Changeling #9) In his position as tracker for the SnowDancer pack, it's up to Drew Kincaid to rein in rogue changelings who have lost control of their animal halves- even if it means killing those who have gone too far. But nothing in his life has prepared him for the battle he must now wage to win the heart of a woman who makes his body ignite... and who threatens to enslave his wolf. Lieutenant Indigo Riviere doesn't easily allow skin privileges, especially of the sensual kind- and the last person she expects to find herself craving is the most wickedly playful male in the den. Everything she knows tells her to pull back before the flames burn them both to ash... but she hasn't counted on Drew's will. Now, two of SnowDancer's most stubborn wolves find themselves playing a hot, sexy game even as lethal danger stalks the very place they call home.", "hash": "bf24300c-1579-42ea-bed6-34c704f0ae50"}, {"title": "Kiss of Snow (Psy-Changeling #10)", "author": "Nalini Singh", "pgs": 78, "sum": "Storyline: \nKiss of Snow (Psy-Changeling #10) Since the moment of her defection from the PsyNet and into the SnowDancer wolf pack, Sienna Lauren has had one weakness. Hawke. Alpha and dangerous, he compels her to madness. Hawke is used to walking alone, having lost the woman who would’ve been his mate long ago. But Sienna fascinates the primal heart of him, even as he tells himself she is far too young to handle the wild fury of the wolf. Then Sienna changes the rules and suddenly, there is no more distance, only the most intimate of battles between two people who were never meant to meet. Yet as they strip away each other’s secrets in a storm of raw emotion, they must also ready themselves for a far more vicious fight… A deadly enemy is out to destroy SnowDancer, striking at everything they hold dear, but it is Sienna’s darkest secret that may yet savage the pack that is her home…and the alpha who is its heartbeat…", "hash": "04d57144-e057-4668-b254-f19f98b4133c"}, {"title": "Tangle of Need (Psy-Changeling #11)", "author": "Nalini Singh", "pgs": 80, "sum": "Storyline: \nTangle of Need (Psy-Changeling #11) Adria, wolf changeling and resilient soldier, has made a break with the past—one as unpredictable in love as it was in war. Now comes a new territory, and a devastating new complication: Riaz, a SnowDancer lieutenant already sworn to a desperate woman who belongs to another. For Riaz, the primal attraction he feels for Adria is a staggering betrayal. For Adria, his dangerous lone-wolf appeal is beyond sexual. It consumes her. It terrifies her. It threatens to undermine everything she has built of her new life. But fighting their wild compulsion toward one another proves a losing battle. Their coming together is an inferno…and a melding of two wounded souls who promise each other no commitment, no ties, no bonds. Only pleasure. Too late, they realize that they have more to lose than they ever imagined. Drawn into a cataclysmic Psy war that may alter the fate of the world itself, they must make a decision that might just break them both.", "hash": "f94f9154-0044-4011-a2ed-e4927a6ae0d4"}, {"title": "Heart of Obsidian (Psy-Changeling #12)", "author": "Nalini Singh", "pgs": 66, "sum": "Storyline: \nHeart of Obsidian (Psy-Changeling #12) A dangerous, volatile rebel, hands stained bloodred. A woman whose very existence has been erased. A love story so dark, it may shatter the world itself. A deadly price that must be paid. The day of reckoning is here.", "hash": "6e0c85bf-a18e-48cd-9929-8187bcc4b3ad"}, {"title": "Lord of the Abyss (Royal House of Shadows #4)", "author": "Nalini Singh", "pgs": 39, "sum": "Storyline: \nLord of the Abyss (Royal House of Shadows #4) Once upon a time…the Blood Sorcerer vanquished the kingdom of Elden. To save their children, the queen scattered them to safety and the king filled them with vengeance. Only a magical timepiece connects the four royal heirs…and time is running out.… As the dark Lord who condemns souls to damnation in the Abyss, Micah is nothing but a feared monster wrapped in impenetrable black armor. He has no idea he is the last heir of Elden, its last hope. Only one woman knows—the daughter of his enemy. Liliana is nothing like her father, the Blood Sorcerer who’d cursed Micah. She sees past Micah’s armor to the prince inside. A prince whose sinful touch she craves. But first she has to brave his dark, dangerous lair and help him remember. Because they only have till midnight to save Elden.", "hash": "81afaadb-51a4-4b8d-ba10-ac9ebd970989"}, {"title": "Wild Invitation (Psy-Changeling #0)", "author": "Nalini Singh", "pgs": 62, "sum": "Storyline: \nWild Invitation (Psy-Changeling 0.5, 3.5, 9.5, 10.5) In Beat of Temptation , innocent Tamsyn has always had a place in her heart for Nathan, a blooded DarkRiver sentinel. But is she ready for the fierce demands of the mating bond? In Stroke of Enticement , a wary young teacher, skeptical about love, arouses the man—and the animal—in an aggressive leopard changeling who must prove his affections are true. Plus 2 NEVER BEFORE PUBLISHED NOVELLAS In Declaration of Courtship , Grace, a shy submissive wolf, finds herself pursued by the last man she ever would have imagined: a SnowDancer lieutenant said to be “mad, bad, and dangerous to know.” In Texture of Intimacy , SnowDancer healer Lara discovers the searing joys—and unexpected challenges—of being mated to quiet, powerful Walker, a man used to keeping his silence.", "hash": "c70fb248-d7f4-492a-9e0c-5b60b71c86f1"}, {"title": "The Magical Christmas Cat ", "author": "Nalini Singh", "pgs": 57, "sum": "Storyline: \nNew York Times bestselling author Lora Leigh and top-selling authors Nalini Singh, Erin McCarthy, and Linda Winstead Jones have a special gift for readers this year: heartwarming holiday stories featuring passionate romance, paranormal adventure, and a distinctly alluring feline touch. With four new stories―including one featuring Lora Leigh's genetically altered Feline Breeds―this is a collection packed with more surprises than Christmas morning, and more chills than the snowiest winter night...", "hash": "b4bd05b8-3139-4b02-aa23-c6c02138abde"}, {"title": "Whisper of Sin (Psy-Changeling #1)", "author": "Nalini Singh", "pgs": 15, "sum": "Storyline: \nWhisper of Sin (Psy-Changeling 0.6) San Francisco is under threat from a violent gang…a gang that has no idea who they’re challenging. The DarkRiver pack of leopard changelings has already claimed the city as their territory, and they will fight with wild fury to protect its residents. Emmett, a lethally trained leopard soldier, isn’t about to let outsiders muscle in on his home ground—especially when they target a human named Ria. Emmett has one word for the smart stranger with her curvy body and tough spirit: mine. Possessive, dominant, unyielding in his demands and desires, Emmett is unlike anyone Ria has ever before met. But while the sexy leopard changeling makes her body ignite, his kisses molten and his touch addicting, she’s no pushover and she has a few demands of her own. This leopard has met his match…", "hash": "61327a27-3cdc-4fd5-9ea8-90edbf1b3431"}, {"title": "Beat of Temptation ", "author": "Nalini Singh", "pgs": 15, "sum": "Storyline: \nBeat of Temptation is part of an anthology, An Enchanted Season, but I just had to post about it. I cried. I can’t remember the last time I cried while reading a romance novel or when I last read in the car, but I did both. It was that good. Beat of Temptation is a stand alone novella set in the Psy-Changeling world, and while it isn’t essential to the series, it offers a glimpse into the changeling mating bond. There’s an external plot dealing with the relationship between Psy and changelings, but it’s peripheral to the story. Beat of Temptation is about Tamsyn and Nate (introduced in previous books in the series), who recognised the mating bond when Tamsyn was only fifteen and Nate much older (twenty-five?). Now, nineteen-year old Tamsyn wants to … well, get the party started, but Nate wants her to enjoy unmated singledom for a while because he’s scared she’ll end up like his mother, who married young and ended up committing suicide.", "hash": "44056d23-4041-41fd-98ea-a7f49fcfad44"}, {"title": "Hidden Moon (Nightcreature #7)", "author": "Lori Handeland", "pgs": 39, "sum": "Storyline: \nHidden Moon (Nightcreature #7) He's got a secret... Claire Kennedy left Lake Bluff, Georgia, for the bright lights of Atlanta and a promising career in journalism. Now, recovering from a cruel betrayal, she's back in the one place she always felt safe, starting over as Lake Bluff's new mayor. But then trouble comes to town in the form of Malachi Cartwright, a man whose past is as mysterious as his present--a man who awakens something dangerous in sensible, realistic Claire. That leaves her hungry for more... When a tourist claims to have been mauled by a vicious wolf, and when the attacks turn deadly, Malachi's strange behavior rouses Claire's suspicions. Could he have a secret agenda and a sinister reason for coming to Lake Bluff? Malachi is the only man who could tempt Claire to succumb to her desires--but he's the last person she can trust. And as an eclipse approaches, the secrets of the hidden moon will come to light, and a deadly enemy will be revealed at last...", "hash": "a979329b-4088-44b8-96f2-b6b7c1368e79"}]